{"4488":{"abstract":"The goal of this project is to develop and apply scalable numerical methods and a software infrastructure for the first principles prediction of the properties of materials. These materials typically have complex structures and compositions, a large number of atoms (n>100) and little or no symmetry. For many important examples reliable theoretical predictions are not possible using present day approaches. Here a new method is being tested; preliminary results show that it promises to remove a major roadblock to the wider application of first principle calculations to real materials, thereby greatly expanding the problems that can be treated. As part of the project this new method will be applied to an important problem, the oxidation of carbon based materials. The project builds on a novel computational approach to solving the LAD equations based on a parallel, real-space, adaptive multigrid eigenvalue solver. Unlike Fourier methods, this adaptive method locally refines the solution to capture the short length scales in the problem; for example, the short length in near oxygen region in the carbon oxygen system. The investigators' preliminary calculations are currently limited to model problems with structures similar to the real materials Schrodinger eigenvalue equation. However, the new computational method shows promising improvements in convergence and efficiency over present algorithms. The purpose of this program is to enhance the proposed solver to enable application of an adaptive method to real materials.","title":"CARM: Computational Infrastructure for Intelligent Material Design","awardID":"9520372","effectiveDate":"1996-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["376372","544334"],"PO":["179296"]},"6457":{"abstract":"9528602 Holt As the tide of environmental change rises inexorably around us, it is becoming increasingly urgent to understand the capacity of species to respond. An inspection of the fossil record suggests that species vary widely in their abilities to adapt to changed circumstances. Some species seem to adapt very readily to change, whereas others are quite conservative in their basic \"ecological niches\" (i.e., the environmental conditions in which populations of a species can persist without repeated immigration or introductions of new individuals from external sources). The aim of this research project is to develop a conceptual framework for interpreting both conservatism and rapid change in species' niches, combining a contemporary understanding of genetic change in populations with an understanding of the determinants of change in population size. The basic approach taken is to use mathematical and computer analyses which combine ecology (controls on population size) and genetics (controls on the genetic makeup of populations) to examine how species respond both genetically and numerically to different kinds of variation in their environments. For example, climate change can lead to either an altered environment across the entire range of a species, or possibly just part of its range, in a short period of time. We thus consider a range of scenarios that incorporate both environmental change in time and variations across geographic locations. Findings from this research will address significant fundamental problems in biology--why some species adapt readily and others more slowly (or not at all) in the face of environmental change. The research has implications for important applied problems, such as the design of conservation plans and understanding genetic responses of pest organisms to control programs.","title":"Niche Conservatism: A Population Dynamic Perspective","awardID":"9528602","effectiveDate":"1996-04-15","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1174","name":"POPULATION DYNAMICS"}}],"PIcoPI":["519078","457467"],"PO":["564220"]},"7306":{"abstract":"9531535 Shirazi, Behrooz Kavi, Krishna M University of Texas, Arlington REU: Research Experiences for Undergraduates in Software Tools for Concurrent Programming This Research Experiences for Undergraduates project will support six students in Summer programs each year, for three years. The goal of the project is to continue an already established REU site program so as to continue to provide opportunities for highly talented and qualified upper division women, minority and disabled undergraduate students to participate in research programs in the field of parallel processing. The students will investigate problems related to parallel program development, debugging, scheduling, and performance profiling under the supervision of the principal investigators and faculty mentors and in collaboration with graduate students. The students will be recruited nationally with emphasis on recruitment of students from institutions lacking research facilities and located in the southwest region of the United States. ***","title":"REU Site: Research Experiences for Undergraduates in Software Tools for Concurrent Programming","awardID":"9531535","effectiveDate":"1996-04-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["13545","559679"],"PO":["173164"]},"7229":{"abstract":"9531321 Wiedenbeck, Susan University of Nebraska-Lincoln Research Experiences for Undergraduates: Research in Human-Computer Interaction and Multimedia Interface Design This Research Experiences for Undergraduates project will support ten students per year in programs carried out during the Summers, for three years. Students will be recruited from institutions across the nation, particularly from predominantly undergraduate institutions and with a maximum of three students per year from the University of Nebraska. The research topics will be drawn from the field of human-computer interaction (HCI) and multimedia interface design. The program will involve seminars, research projects, and academic year follow-up. The central activity will be the students' research projects during which they will conceptualize a specific problem within HCI, design a study to address the problem, instrument the study and run pilot tests. During the follow-up academic year, students will be encouraged to continue with data collection and analysis, with the help of the PI. Students are expected to leave the REU project with an understanding of the research process and the job of a researcher, an appreciation of creativity in science, and a sense of the excitement of scientific discovery.","title":"REU Site: Research in Human-Computer Interaction and Multimedia Interface Design","awardID":"9531321","effectiveDate":"1996-04-15","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["503162"],"PO":["173164"]},"2797":{"abstract":"Formal verification is a technique for reducing certain questions about the requirements, designs, or implementations of computer software and hardware to a mathematical form that can examined by methods having the character of calculation. Similar to the way in which questions about the properties of an aerofoil can be reduced to calculations that can be mechanized by computational fluid dynamics, mechanized formal verification uses automated theorem proving and related methods (e.g., model checking) to perform logical calculations about the properties of computer systems. Whereas testing can examine only some of the behaviors of a complex system, mechanized formal verification can examine all the behaviors of a model of the system (again, the situation is analogous to flight test vs. computational fluid dynamics). Using mechanized formal verification, suitably realistic models can provide strong evidence for the correctness of computer systems, and simplified models are often useful for detecting bugs that testing does not encounter. Mechanized formal verification is most effective when applied to the hardest and most critical elements of design. An area where it holds great promise is in the analysis of fault-tolerant systems, where the presence of faults can produce a complexity of behavior that defies other forms of analysis. The increased assurance provided by mechanized formal verification can be of particular value for fault- tolerant systems because these are generally found in applications that are critical to safety (such as aircraft and other vehicles) or national infrastructure (such as the telephone, power-distribution, and banking systems). The objectives of this research are to reduce mechanized formal verification of fault-tolerant distributed algorithms from tours-de- force to routine practice, and to develop a framework for mechanical verification of the architectures of complete fault-tolerant systems composed from such algorithms. Th e research focuses on developing systematic methods for the formal specification of classes of fault- tolerant algorithms, and mechanized strategies for their exploration and verification. These strategies will build on techniques that combine decision procedures and model checking within an interactive framework. The algorithms considered will include those for distributed consensus, synchronization, diagnosis, and group membership. The work is expected to yield improved understanding of the assumptions, constraints, and fault models underlying the algorithms studied, more refined arguments for their correctness, and coherent arguments for their synthesis into an overall architecture. In addition, the research is expected to yield new results in the construction and application of formal verification systems, and improved methods for the formal representation and analysis of fault- tolerant algorithms. ***","title":"An Integrated Framework for Mechanical Verification of Fault-Tolerant Systems","awardID":"9509931","effectiveDate":"1996-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["555363","521343","384061"],"PO":["150697"]},"6637":{"abstract":"9529253 French, James C. University of Virginia Special Project: NCSTRL: A National Computer Science Technical Report Library This project proposes to integrate two successful existing on-line computer science technical report servers into a single service called the Networked Computer Science Technical Report Service, or NCSTRL. The project will be carried out by a consortium of six universities which have been involved in the development of the two existing services, WATERS (Wide Area TEchnical Report Service) and Dienst, developed in the ARPA sponsored CS-TR project. The technologies developed in these earlier projects will be integrated and extended to provide the new service. After the completion of the integration effort, a major promotional effort is planned to increase the number of participating institutions. To that end of the endorsement of the Computing Research Association has been secured. The latter represents the PhD granting computer science departments in North America as well as several industrial laboratories that engage in fundamental research. These activities are expected to lead to a service that will improve computer science research while providing cost savings to computer science departments. It will be a valuable resource to the nation, and can be reached quickly and at a remarkably low cost. ***","title":"Special Project: NCSTRL: A National Computer Science Technical Report Library","awardID":"9529253","effectiveDate":"1996-04-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["355797"],"PO":["564412"]},"15091":{"abstract":"Software distributed shared memory (DSM) systems provide the abstraction of shared memory to networks of workstations and distributed memory machines, such as the Paragon, CM-5, or SP-2. Unfortunately, the latencies for global operations in either environment are several orders of magnitude more expensive than on tightly-coupled multiprocessors. The result is that current DSMs perform well for only a restricted class of applications. The Sparks project is designed to address this restriction by providing a protocol construction library that will allow DSM performance to be improved to within a few percent of tightly-coupled multiprocessors. Sparks' abstractions allow the design space of high-level synchronization operations to be explored cleanly and systematically, rather than in an ad hoc fashion. The emphasis is more on creating and investigating the abstractions that make a broad variety of optimizations possible, rather than on the individual optimizations themselves. However, the performance gains allowed by the synchronization types created via the Sparks library will be thoroughly quantified. The Sparks interface will be implemented in CVM, a new distributed shared memory system. In addition to providing support services to Sparks, CVM implements novel coherence protocols and multi- threading support. ***","title":"CAREER: Sparks: Coherence as an Abstract Type","awardID":"9624803","effectiveDate":"1996-04-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["409678"],"PO":["209879"]},"6209":{"abstract":"9527932 Truhlar, Donald G Thomas, David D University of Minnesota Research Experiences for Undergraduates: Undergraduate Internship Program in Biophysical Computing and Computational Dynamics This Research Experiences for Undergraduates project will support nine students per year in programs carried out during the summers, for three years. The program's objective is to promote and help support undergraduate involvement in ongoing and new research in biophysical computing and computational dynamics and new software development efforts for scientific computing and graphics support for such research, as well as to carry out interesting and useful research. Undergraduates will work with faculty on a wide variety of projects. The Supercomputer Institute, an interdisciplinary research program spanning all colleges of the University, provides a focal point for the project and arranges sessions at which the students working on various subprojects share their work, visit each others' labs, and learn about related work. ***","title":"Research Experiences for Undergraduates: Undergraduate Internship Program in Biophysical Computing and Computational Dynamics","awardID":"9527932","effectiveDate":"1996-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["489788","532865"],"PO":["297837"]},"15291":{"abstract":"*** 9625573 Jacob This project seeks to invent and implement a new model, abstraction, and language to provide a formal basis for describing and building next-generation user interfaces, which will involve parallel, continuous user-computer interactions. The next generation of emerging user-computer interaction styles has been called non-WIMP and is typified by parallel and continuous interactions, as seen in virtual reality or virtual environments. The project goal is to develop a model and abstraction that captures the formal structure of next-generation dialogues from the point of view of the user and the dialogue, rather than from the exigencies of the implementation in the way that existing techniques have captured command-based, textual, and event-based dialogues. Most current user interface description languages and software systems are based on serial, discrete, event-based interaction. Most of today's examples of non-WIMP interfaces have, of necessity, been designed and implemented with event-based models more suited to previous interface styles. Because those models fail to capture continuous, parallel interaction explicitly, the interfaces have required considerable ad-hoc, low-level, though highly inventive programming approaches. This work would ultimately be used by people who design and build user interfaces in virtual reality and other non-WIMP interaction styles. ***","title":"Models and Abstractions for Next-Generation User Interface Software","awardID":"9625573","effectiveDate":"1996-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["519872"],"PO":["565227"]},"15082":{"abstract":"The main objectives of the proposed research are: (1) to develop an integrated multimedia computing environment that supports efficient mechanisms for storage, transmission, and presentation of information in multiple forms (e.g., video, audio, images, text, and numeric data); and (2) to utilize it to develop innovative methods for delivering education. To achieve these objectives, the proposed research promises to develop an end-to-end architecture consisting of: (i) a multimedia file system that supports efficient means for storage and retrieval of multi-resolution multimedia objects, (ii) network algorithms and protocols for efficient transmission of multimedia objects over networks, and (iii) processor scheduling mechanisms as well as transport and higher layer protocols that support efficient processing and streaming of data at the end-station. The end-to-end system architecture thus created will form the basis for: (a) creating a digital repository of educational material containing video-lectures, notes, presentation slides, simulation packages, animation, images, etc., on several inter-disciplinary topics, and (b) providing efficient methods for organizing and browsing through the information space. In addition to being a realistic testbed for evaluating the end-to-end system architecture, this digital library prototype will provide an excellent environment for evaluating the effectiveness of various methods of distance learning and self-paced education. The findings of this research will significantly impact the design of large-scale digital libraries and distance learning tools of the future. ***","title":"CAREER: Designing an End-To-End Architecture for Distributed Multimedia Systems","awardID":"9624757","effectiveDate":"1996-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["261975"],"PO":["250083"]},"4958":{"abstract":"9522029 Booth This project connects Green River Community College to the Internet over a T1 (1.544 million bits per second) line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"NSFNET: Green River Community College Connects to the World","awardID":"9522029","effectiveDate":"1996-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12118,12119,12120],"PO":["121202"]},"15294":{"abstract":"9625577 Carroll, John M. Virginia Polytechnic Institute & State University CISE Postdoctoral Research Associate in Experimental Computer Science: Leveraging Networks for Collaborative Education in the Blacksburg Electronic Village This award supports associate Jurgen Koenemann. This project is part of an effort to create and study a virtual physics laboratory for middle and high school students in a rural area of Southwestern Virginia. The virtual laboratory is implemented as a real-time, multi-user domain, integrated with World-Wide Web resources. The postdoctoral work focuses on two technical challenges within this paradigm of network-based collaborative education: (1) supporting the design of virtual laboratory activities and materials by teachers, and (2) evaluating usability and learning outcomes for teachers and students. Regarding (1), a set of software tools will be developed to help teachers locate and incorporate World-Wide Web resources into activities they design for the virtual laboratory. For example, the tool will automatically generate appropriate hyperlinks and manage simulation software. Regarding (2), an evaluation tool will be developed to facilitate the collection and analysis of \"critical incident\" reports, episodes in which something went very well or very badly for the user. The reports will be linked to portions of the virtual laboratory software that may have been implicated in causing the critical incident to facilitate diagnosis and redesign. ***","title":"CISE Postdoctoral Research Associate in Experimental Computer Science: Leveraging Networks for Collaborative Education in the Blacksburg Electronic Village","awardID":"9625577","effectiveDate":"1996-04-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["549541"],"PO":["557609"]},"4729":{"abstract":"9521286 Threlfall This project connects Chabot College and Las Positas College through the Chabot\/Las Positas Community College District to the Internet over a T1 (1.544 million bits per second) line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"Connections to the NSFNET for Chabot College and Las Positas College","awardID":"9521286","effectiveDate":"1996-04-01","expirationDate":"1997-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11548,11549],"PO":["43608"]},"15010":{"abstract":"9624458 Hoelzle Programmers have long been faced with the dilemma of choosing between abstraction and efficiency: if they use abstraction pervasively, their programs become more maintainable but may execute too slowly. Ideally, hiding a design decision behind an abstract interface should have no impact on performance, so that programmers can reap the full benefits of encapsulation without fear of performance problems. Thus, abstraction-oriented languages must employ aggressive compiler optimizations to reduce the run-time overhead of abstraction. Since the ultimate goal is to increase programmer productivity, these optimizations must be compatible with interactive, exploratory programming environments. The focus of this work is on reducing the cost of abstraction in object-oriented languages, as well as, complementary educational goals. The objective of this project is to develop adaptive customization, a compiler technique that aims to make aggressive optimization practical by improving performance without unduly increasing code size. Being suitable for interactive programming environments, adaptive customization could dramatically improve the performance of real-world applications written in dynamic languages like Smalltalk, Self, Java, Dylan, or CLOS. Not all dispatches can be optimized away, and the remaining dispatches may become more expensive on superscalar processors. Thus, the goal is to develop new dispatch techniques specifically optimized for such processors. A comprehensive study of dispatch performance on superscalar processors will be undertaken in this project. Benchmark suites and tools will be developed to support this research. ***","title":"CAREER: Efficient Implementation of Object Oriented Languages on Superscalar Processors","awardID":"9624458","effectiveDate":"1996-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["77826"],"PO":["209879"]},"15055":{"abstract":"A major obstacle to building robust systems that can read, summarize, and extract information from text is the need for large amounts of linguistic knowledge to handle the myriad syntactic, semantic, and pragmatic ambiguities that pervade virtually all aspects of text analysis. The objective of this research is to address this knowledge engineering bottleneck for natural language processing (NLP) systems. The work extends a general knowledge acquisition framework that allows an NLP system to bootstrap its own knowledge bases directly from text using standard inductive machine learning techniques in conjunction with an annotated corpus and robust sentence analysis. In particular, the framework is being extended to handle additional problems in lexical and structural ambiguity resolution and is being evaluated using Penn Treebank data within the context of a larger NLP task. The work is of both theoretical and practical significance. First, the research will begin to determine the conditions under which machine learning techniques can be expected to offer a cost-effective approach to knowledge acquisition for NLP systems, especially in comparison to existing statistical techniques. Second, the work will expand the current system into an integrated tool that uses machine learning techniques to guide NLP system development.","title":"Knowledge Acquisition for Natural Language Understanding","awardID":"9624639","effectiveDate":"1996-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["548297"],"PO":["565227"]},"15245":{"abstract":"This is a proposal to intestigate the celebrated Hirsch conjecture using the new theoretical framework that was developed recently by the investigator and collaborators for resolving the conjecture. In contrast to all of the previous attacks on the conjecture which were inherently combinatorial, the new strategy brings to bear on the conjecture the powerful machinery of continuous analysis and representation theory of continuous groups. Preliminary results from the new approach include (i) the discovery of a new formulation of the Hirsch conjecture with connections to Gaussian elimination, and (ii) the emergence of the most compelling theoretical and empirical evidence to date about the validity of not just the Hirsch conjecture but a considerably stronger version of it. The project aims at proving the strong Hirsch conjecture by employing powerful techniques from differential geometry and cohomology theory. The strong Hirsch conjecture, if proved, would show the existence of exponentially many paths of linear length between the initial and optimal vertices of a polyhedron, and would hence revitalize the research for polynomial-time Simplex algorithms. ***","title":"Complexity of the Simplex Method","awardID":"9625425","effectiveDate":"1996-04-15","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["74519"],"PO":["187585"]},"17038":{"abstract":"This award supports a one-and-a-half day workshop to develop a policy framework for deploying security technologies on the Internet. The workshop was recommended at the Federal Networking Council Advisory Council meeting in October, 1995 to provide guidance for Internet planners. This followed the recommendation for such a workshop made by the Federal Networking Council Security Working Group. Workshop participants include industry, Federal and user community representatives. Specific topics addressed include: * Security technologies now available and in development * Security requirements of Federal, industrial, educational and foreign networks and users * Requirements for creation or enhancement of existing institutions to handle crisis response, public keys, etc. * Need for research in security techniques The result is a report detailing the workshop conclusions, and is available in printed form and on the Internet.","title":"Internet Security Workshop","awardID":"9631983","effectiveDate":"1996-04-01","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["410674"],"PO":["43608"]},"14883":{"abstract":"The proposed research is directed towards the advancement of the exploration of complex multi-dimensional timing control for multimedia streams in distributed multimedia systems. To achieve this goal, this research effort focuses on the exploration and development of a true generic system for the advanced timing control of resources used by multimedia streams. Timing control is particularly important for interactive multimedia distributed applications such as telerobotics, teleoperation in manufacturing, and virtual reality applications with force feedback including telesurgical training and audio-video conferencing. The focus of this research is on the study of algorithms and techniques to provide distributed control of multi-dimensional timing behaviors over different resources in an integrated fashion. While there have been advances in the control of the one dimensional case (timely delivery), and of the two- dimensional case (media synchronization), there has been little improvement in providing a third dimension in which the systems can control the adaptation of timely delivery and\/or media synchronization specified by quality of service (QoS) parameters such as end-to-end delay and jitter. This research addresses integrated time-variant QoS management for the above defined three dimensions. To achieve this integration, the research effort calls for: development of concepts for time-variant QoS management; development of a theoretical framework for formal specifications for time-variant QoS and the modeling of distributed control to accommodate QoS requirements; provision of an experimental testbed for multimedia transmission according to QoS requirements; and, evaluation of the framework through an experimental verification. ***","title":"CAREER: Time-variant QoS Management","awardID":"9623867","effectiveDate":"1996-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["561784"],"PO":["250083"]},"15400":{"abstract":"9625875 Lilja, David J. University of Minnesota, Twin Cities CISE Postdoctoral Research Associateships in Experimental Computer Science: Processor Allocation in Hierarchical Heterogeneous Networks of Workstations The wide availability and reasonable cost of networks of workstations makes them an attractive alternative to traditional supercomputer systems. However, the low degree of uniformity in the execution and communication times of parallel applications in heterogeneous systems can impose significant constraints on the possible parallel task scheduling solutions. The primary goals of this work are to develop techniques for determining the appropriate number and type of processors to be allocated to each application in a heterogeneous network of multiprogrammed workstations, and to match the diverse hardware platforms to the computational and communication requirements of the specific application tasks. The proposed \"matching factor,\" which provides a performance indicator for pairing hardware and applications in a dedicated environment, will be extended with scheduling heuristics for a network of multiprogrammed workstations with heterogeneous processor types and interconnection networks. The highly experimental nature of this work will greatly benefit from the interaction with computational scientists and engineers working at the University of Minnesota, and from the availability of the University's unique hardware and software resources. ***","title":"CISE Postdoctoral Research Associateship in Experimental Computer Science: Processor Allocation in Hierarchical Heterogeneous Networks of Workstations","awardID":"9625875","effectiveDate":"1996-04-15","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["528635"],"PO":["297837"]},"15103":{"abstract":"The focus of this research is to develop an effective caching infrastructure for the design and implementation of caches in modular systems. Caching is a well-known technique for exploiting locality to improve performance; unfortunately, caches are often added to systems in an ad-hoc fashion. The caching infrastructure will improve cache development in the following ways. First, it will define a set of practical and efficient external cache interfaces for integrating caching into modular systems, such as object-oriented operating systems. Second, it will allow the functions of the cache itself to be modularized, defining internal interfaces that allow the functions to be easily modified and replaced. The flexibility this affords will allow the cache infrastructure to serve as a test-bed for caching, enabling different cache algorithms to be easily implemented and studied. Third, the use of a common cache infrastructure will allow global resource allocation decisions to be made among caches that are competing for resources, thus optimizing overall system performance. This resource management functionality will also include mechanisms for efficiently transferring resources, such as data blocks, between caches. Finally, the caching infrastructure will contain a toolkit to enable the cache control functions, such as the cache coherency protocol, to be defined via a high-level specification which can be verified and compiled into an efficient implementation. ***","title":"CAREER: A Caching Infrastructure","awardID":"9624845","effectiveDate":"1996-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["383805"],"PO":["250083"]},"17347":{"abstract":"This award supports a two day workshop held in September 1996 at Harvard to explore the policies and planning required to continue the viability of the Internet. Participants include key individuals and organizations within and beyond the Internet community, from the U.S. and foreign countries. Papers presented at the conference are on the Harvard web server and published in a book from the MIT Press.","title":"Conference on the Future of the Internet; September, 1996; Cambridge, MA","awardID":"9632850","effectiveDate":"1996-04-01","expirationDate":"1997-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[43607],"PO":[43608]},"15238":{"abstract":"9625408 Horwitz, Susan Association for Computing Machinery Special Project: Group Travel Grant for Faculty at Minority\/Female Institutions to Attend PLDI 96 As a step toward improving the representation of women and minorities in computer science, the ACM Special Interest Group on Programming Languages (SIGPLAN) is working to improve the computer science background of faculty members from colleges with a large minority and\/or female student enrollment. This travel grant will provide partial support for selected individuals from such institutions to attend the annual conference on Programming Languages Design and Implementation (PLDI). In addition to the Conference, the participants will attend tutorials targeted specifically to teachers from non-research oriented institutions. For the selected participants, SIGPLAN will pay the tutorial and conferences fees and NSF funds will provide for travel and subsistence costs. ***","title":"Special Project: Group Travel Grant for Faculty at Minority Institutions and Women's Colleges to attend PLDI 96","awardID":"9625408","effectiveDate":"1996-04-01","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["331999"],"PO":["564412"]},"7093":{"abstract":"This project develops a new class of data acquisition systems with user configurable hardware. The primary development effort is the creation of software tools which will enable scientists and engineers who are not skilled hardware designers to utilize such systems. Some of the primary research issues are the development of techniques for specifying and analyzing timing behavior between fixed and configurable hardware and the development of techniques for designing robust interfaces. A typical application of this work is a reconfigurable data acquisition card consisting of a fixed analog section and a configurable digital section built from one or more field programmable gate arrays (FPGAs) and static RAM chips. Existing data acquisition cards are generally used by scientists and engineers who are not skilled hardware designers; however, the currently available tools for FPGAs require significant digital design experience. For a reconfigurable data acquisition card to be useful, it is necessary that the configuration tools accept as input high level programming language which is accessible to a competent programmer. Any custom hardware necessary to interface the analog sections or host CPU must be provided in the form of libraries which can be conveniently linked to the user's code.","title":"Data Acquisition Systems with User Configurable Hardware","awardID":"9530811","effectiveDate":"1996-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["565319","142436"],"PO":["321058"]},"15711":{"abstract":"The purpose of this meeting is to stimulate interest in and enhance understanding of the technical aspects of computer algebra, by providing a way for those in the region who are active or interested in becoming more active in computer algebra to meet with each other in an inexpensive and easily accessible way. This meeting will be more informal than the annual ISSAC meetings, with ample time for unstructured interaction. Participation by the region's graduate students will be particularly encouraged through special invitation to contribute to the poster sessions, and through travel support. This meeting is well on its way to becoming a regular series for the region, with different academic and industrial institutions hosting the meeting in rotation. This year's meeting is the third in the series: the first meeting was held in 1994 at Drexel University in Philadelphia, and the second meeting in April 1995 at the University of Delaware. Both meetings were very successful, and at the business session conducted at the end of the Delaware meeting it was agreed to meet at IBM Research in 1996, the first industrial site of our series. The meetings have had the endorsement (without financial support) of ACM's Special Interest Group for Symbolic and Algebraic Manipulation (SIGSAM) and of the Society for Industrial and Applied Mathematics (SIAM). ***","title":"East Coast Computer Day, Yorktown Heights, NY, April 13, l996","awardID":"9626881","effectiveDate":"1996-04-01","expirationDate":"1996-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["359253",39617],"PO":["187585"]},"14985":{"abstract":"In recent years geometric modeling and simulation techniques have become essential tools for applications involving physical objects. Although much progress has been made, there are important applications that cannot be realized with current technology. Examples include controlling autonomous robots operating in dynamic situations, training an employee for a dangerous task in a virtual reality environment, and helping an engineer interactively analyze design choices using a threedimensional model of a complex product. The general objective of this research is to design and implement practical algorithms for such applications. Toward this goal, the applicability of techniques developed in the field of computational geometry to the following target applications will be studied: performing robotic path planning and planning manipulation tasks with contact, and analyzing product designs for manufacturability, assembly, and disassembly. The research will be performed in collaboration with an ongoing research effort at Texas A&M in dextrous manipulation and with researchers at GE R&D analyzing product designs for and maintainability. Two educational activities will be undertaken. First, mentoring and general support programs will be initiated for undergraduate and graduate women in the Computer Science Department at Texas A&M. The goal of these programs is to encourage more women to pursue graduate studies and careers in computer science and engineering. Second, group learning methods will be incorporated into undergraduate and graduate courses in theoretical computer science. The change from the standard lecture format is motivated by research that has shown that group learning can increase student interest and help them to understand concepts more fully. ***","title":"CAREER: Building and Searching Data Structures for Spatial Environments","awardID":"9624315","effectiveDate":"1996-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["561154"],"PO":["179846"]},"15537":{"abstract":"9626318 Zwaenepoel, Willy William Marsh Rice University CISE Postdoctoral Program: Scalability of Software Distributed Shared Memory This award supports CES associate Povl Koch. Software Distributed Shared Memory (DSM) architectures strike a balance between the distributed-memory and shared memory architectures by providing an abstraction of shared memory in software on distributed memories. They are built using standard processors\/workstations and they are easy to program using a shared address space based on virtual memory pages. DSM systems are suitable for many parallel scientific applications. Although many systems have been designed, only the scalability issues for hardware shared-memory systems have been addressed. For software DSM systems, the focus has been on performance with a moderate number of nodes using relaxed memory consistency models and multiple-writers protocols. Most experiments have been on 8 nodes and a few with 16 nodes. When going from 8 to 64 or more nodes, each may have multiple processors, scalability problems exist with the current size of data structures and their allocation and deallocation. A scalable DSM should only capture actual causality of modifications, minimize space overhead per shared page, and the address space should be dynamically partitioned. We plan to analyze and build a scalable DSM system to run on a distributed-memory machine with 64 nodes and a fast interconnect. ***","title":"CISE Postdoctoral Program: Scalability of Software Distributed Shared Memory","awardID":"9626318","effectiveDate":"1996-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["191820"],"PO":["297837"]},"5390":{"abstract":"AI planning algorithms have typically ignored issues involving what to do if the agent has incomplete or incorrect information about the world. Probabilistic extensions to classical planners can quantify the agent's state of information, but have not addressed the question of when the agent should act to improve its state of information, how it should do so, and what it should do upon receiving new information. This project further extends planning algorithms to allow the building of plans with information-gathering actions, contingent execution, and iteration. The approach is a synthesis of traditional symbolic-planning representations and algorithms with a Bayesian- decision-theoretic model of uncertainty and information gathering. The project also explores the connection between the model and related work in the decision sciences and stochastic optimization (particularly existing work on partially observable Markov decision processes). The project's empirical component undertakes to develop control strategies that allow probabilistic plans with feedback to be constructed efficiently. The model is applied to problems in automated manufacturing and medical decision making. This research project will develop effective algorithms for planning under uncertainty while accommodating the ability to sense and act on new information about the world, thus addressing a fundamental limitation in classical planning algorithms and allowing existing planning technology to be applied to a significantly wider range of application domains.","title":"Probabilistic Planning in Partially Observable Domains","awardID":"9523649","effectiveDate":"1996-04-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[13191],"PO":["565227"]},"15109":{"abstract":"This research focuses on operating system support for collaborative information systems, in which multiple users or programs cooperate to maintain a shared information resource on a computer network. The central focus is development and evaluation of a \"network virtual store\", a virtual memory based storage repository for networked clusters of 64-bit computers. The network virtual store represents a convergence of distributed file systems, software-based distributed shared memory systems, and \"object-oriented database systems\" supporting transactional access to persistent data structures. The goal of the project is to explore new storage management approaches for group computer- aided design systems, scalable database servers, and other applications that require high-performance access to recoverable state in a distributed environment. ***","title":"CAREER: System Support for Collaborative Information Systems","awardID":"9624857","effectiveDate":"1996-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["553906"],"PO":["250083"]},"14823":{"abstract":"Recent progress in the speech recognition field suggests great promise for practical spoken language interfaces within the next decade. But this technology is not yet ready for many applications because of the lack of effective methods for handling spontaneous speech. This project focuses on techniques that can provide additional information to a natural-language parser beyond the output of the speech recognition system. This extra information will be used in handling the following problems that arise in spontaneous dialogue: the segmentation of utterances into meaningful units, the identification and correction of speech repairs, the detection and correction of speech recognition errors, and the interpretation of the intended speech act from surface structure, lexical cues and intonation. The approach involves using stochastic techniques to identify likely recognition errors, speech repairs, utterance unit boundaries and prosodic features and then passing this information on to a parser which determines the best interpretation given all the information. The results of this project will help the development of accurate speech recognition systems for spontaneous dialogue. The techniques developed will be evaluated using a series of empirical tests on a corpus of human-human dialogues, and by integrating the techniques into a fully functional dialogue system.","title":"Parsing Spontaneous Dialogue","awardID":"9623665","effectiveDate":"1996-04-15","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["517044"],"PO":["565227"]},"6395":{"abstract":"A domain-independent knowledge-based framework is being developed, specific to the task of abstraction of higher-level, interval-based concepts from time-stamped data in a context- sensitive manner. The inference structure used is knowledge- based temporal-abstraction, which decomposes the temporal- abstraction task into five subtasks, each solved by a temporal- abstraction mechanism. The research provides a formal method for specification of temporal-abstraction knowledge and for facilitating its acquisition, maintenance, reuse, and sharing. A representation of the knowledge in the web-based Ontolingua language also is evaluated. The temporal-abstraction mechanisms are being extended and validated within the RESUME system. An automated graphical tool for acquiring temporal-abstraction knowledge is developed using the PROTEGE-II system. An evaluation is being performed of the knowledge-acquisition tool, the computational mechanisms, and the overall framework in the diabetes-therapy domain and within the EON architecture for guideline-based care. The research has implications for construction of knowledge-based planning and monitoring systems in time-oriented domains, for automated summarization of temporal databases, for the operational semantics of deductive temporal databases, and for the semantics of queries to temporal databases; preliminary evaluation in clinical and engineering domains is highly encouraging.","title":"A Framework for Knowledge-Based Abstraction of Time OrientedData","awardID":"9528444","effectiveDate":"1996-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[15701],"PO":["565227"]},"6781":{"abstract":"This research is on developing structured design methods for Micro-Electrical- Mechanical Systems (MEMS). The focus is on MEMS fabrication process simulation and mask-layout synthesis. In analogy to present-day VLSI design, tools to permit rapid, accurate, conservative mask layout synthesis of MEMS are being explored. The objective for the tools is to enable a MEMS designer to specify a desire micro-mechanical function (e.g., a mechanical spring with particular characteristics), and have a system automatically generate the information (mask- layout, and other fabrication instructions) to create the shape that exhibits the desired function. This would includes refining and extending the 3-D anisotropic etch simulation methods. Prototype software design tools are being developed.","title":"Structured Design Methods for MEMS","awardID":"9529675","effectiveDate":"1996-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["96648"],"PO":["321058"]},"7037":{"abstract":"*** 9530666 Oviatt A foundation is provided by this research for the development of substantially more robust, flexible, accessible, and user-centered interfaces for multimodal\/multimedia systems that incorporate human language technology. Specific objectives include: (1) modeling users' adapted language during error resolution, and applying this information to the design of better error avoidance and resolution techniques, (2) examining the impact of different types and qualities of complex visual display on users' linguistic input to interactive systems, and designing interfaces that effectively but transparently guide users' input to match system processing capabilities, and (3) developing a refined metric of cognitive workload that can be applied to the design of well-integrated multimodal interfaces. To pursue these objectives, a rapid, semi-automatic simulation technique is being used that supports the collection of high-fidelity data during multimodal human-computer interaction. This research will significantly advance the empirical, theoretical, and applied foundations needed for the design of multimodal interfaces, and will be critical to establishing usable systems that can succeed in actual field settings. In particular, it can have a major impact on improving the commercial viability of next-generation communications devices and mobile technology for a wide range of applications. ***","title":"Interactive Multimodal Interfaces: Designing for Human Performance","awardID":"9530666","effectiveDate":"1996-04-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["515490","539504"],"PO":["565227"]},"7324":{"abstract":"9531571 Vakakis, Alexander F Sipcic, Slobodan R University of Illinois Urbana-Champaign REU: Undergraduate Symbolic Computations in Engineering and Science (USCES) This Research Experiences for Undergraduates project will support ten students per year in programs carried out during the summer, for three years. The project will promote the emerging field of symbolic computational science as an approach to computational modeling and scientific computing with problems drawn primarily from mechanical and industrial engineering. Specific goals of the project are (a) to introduce the students to modern computational and symbolic methodologies for solving challenging problems, (b) to increase understanding of the qualitative and quantitative nature of these problems, (c) to develop the students' ability to derive and interpret mathematical models, and (d) to provide an integrated educational experience to a selected group of undergraduate students with special emphasis on underrepresented groups. Members of the research team are from `oth the University of Illinois and from Wolfram Research and use of the symbolic manipulation package Mathematica will be a focus of the effort. ***","title":"REU Site: Undergraduate Symbolic Computations in Engineering and Science (USCES)","awardID":"9531571","effectiveDate":"1996-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["477580","508883"],"PO":["297837"]},"4872":{"abstract":"This research effort focuses on an integrated compiler-runtime approach to support software distributed shared memory (DSM). The goal is to achieve performance close to hand-tuned message passing programs while still presenting the user with a shared memory programming model. The work is primarily directed towards \"networks of workstations\", but it is also applicable to dedicated distributed memory machines like the IBM SP-2. Notwithstanding advances in the design and implementation of software DSM systems over the last few years, message passing has remained the most commonly used method for programming distributed memory machines, because message passing systems, in general, perform better than DSM systems. This proposal addresses this issue by building an integrated compiler-runtime DSM system, including the optimization of explicitly parallel shared memory programs through compiler analysis. Specifically, the ability of the compiler to predict access patterns, rather than merely react to them as the runtime system does, will allow prefetching and aggregation of messages, and will avoid unnecessary data movement and consistency actions. The work will be based on the TreadMarks DSM system developed at Rice. The proposed work will contribute to the better utilization of networks of workstations and, more generally, distributed memory machines for parallel computing. Earlier work on TreadMarks has already contributed to that goal, in that it has produced one of the most advanced runtime systems for DSM, that has been used by other researchers for work in computational genetics, mixed integer programming, and seismic modeling. ***","title":"An Integrated Compiler-Runtime Approach to Software Distributed Shared Memory","awardID":"9521735","effectiveDate":"1996-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["191820"],"PO":["250083"]}}