{"154495":{"abstract":"This is funding to support travel by 18 intermediate and advanced doctoral students to participate in the AI-ED Doctoral Student Consortium, at the upcoming International Artificial Intelligence in Education Conference (AI-ED), to be held to be held in Brighton, United Kingdom from July 6 to 10, 2009. The AI-ED International Conference is the premier biennial event for promoting promotes rigorous research and development of interactive and adaptive learning environments for learners of all ages; AI ED will be the 7th event in the series. The interdisciplinary areas that AI-ED represents, comprising cognitive science, computer science, and educational technology, are critical research domains that enhance the effectiveness and usability of software learning systems. Active participation of young researchers in this conference is very important, both for the health of the field and for the researchers themselves. The AI-ED Doctoral Consortium provides a unique opportunity for PhD students partway through their dissertation research to receive valuable feedback and individual mentoring from top researchers in the field. The PI and co-PI both hold active leadership roles within AI-ED, and both hold over $2 million of NSF grants in the areas of human-language and advanced learning technologies. The AI-ED Doctoral Consortium Committee will be comprised of the two PIs together with two other senior professors\/researchers. <br\/><br\/>Broader Impact: Bringing young and creative researchers to AI-ED will help advance an important and socially valuable interdisciplinary research field. For many graduate students, the cost of attending the AI-ED conference exceeds their travel budget. Thus, NSF funding will significantly impact the careers of the next generation of AIED researchers, by enabling a number of them to take part in an important event they would otherwise have to miss; in particular, those who lack funding from other sources (e.g., advisor's grants). The students will have an opportunity to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. Participation will also help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The PI and co-PI have indicated that they will act to assure participation by members of traditionally under-represented institutions, and will pay close attention to inclusion of minorities and women.","title":"Student Support for the AIED 2009 Artificial Intelligence in Education Conference","awardID":"0918684","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["446708","482198"],"PO":["564456"]},"154221":{"abstract":"The informatics problem facing scientists in the Petabyte Age has three parts: 1) finding, accessing, and loading massive amounts of data, 2) figuring out the appropriate data reduction or abstraction to make sense of the combined data set, and 3) operationally processing those data. n this SGER, the focus is on the second of these sub-problems ? how scientists deal cognitively with petabyte size data sets of their own and others? provenance. Natural language processing applications saw orders of magnitude improvement when statistical processing\/machine learning was applied to massive data sets. Some linguists observe that these improvements level off at some point, and that subsequent improvements come only after domain knowledge (in that case, linguistic theory) is also applied to the processing. There is a similar situation in science. While some application areas in a Petabyte Age might require only non domain-specific machine learning to predict phenomena (what Chris Anderson calls ?agnostic statistics?), others will require the deeper understanding of phenomena that most scientists seek. In<br\/>other words, for some domains, and in most sciences, it is not enough to answer ?what? ? one also needs to answer ?how?. This work is high risk because there is little research on the extent to which visualization of natural phenomena can be made \"cognitively\" consonant across disparate spatial and temporal scales, Further, because of disparity between the scientific- and information-visualization communities, it is unclear how to connect analytics with visualization of ecological phenomena. Finally, the data integration necessary for the proposed visualization requires managing much larger volumes of data, and many more different kinds of data. The intellectual merit of the proposed work lays in new conceptual data structures and data representations for scientific visualization that can be used to generate domain specific visualization templates from which a range of specific visualizations for a domain could be<br\/>drawn.<br\/><br\/> The broader impacts of the proposed work are three-fold: 1) potential application of the work beyond the realm of environmental science and climate change to that of natural resource management and policy, and to other sciences, 2) educational impact to computational thinking in terms of curricular development at Evergreen College, which will be disseminated via the NSF CPATH project Northwest Distributed Computer Science Department (NWDCSD), and 3) free open-source distribution of the software tool to the scientific community.","title":"SGER: 2- and 3-D Visualization of Ecological Phenomena - Transition to the Petabyte Age","awardID":"0917708","effectiveDate":"2009-05-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["474015"],"PO":["565136"]},"157158":{"abstract":"This project is a fifteen-month planning activity to develop a design for the successor to the TeraGrid project. This activity will engage researchers and educators in the refinement and validation of system requirements. The project includes the development of a detailed science case, concept of operations, design, and implementation plan for the eXtreme Digital (XD) Integrating Services. The primary goal of the next phase of the TeraGrid, XD, is to enable major advances in science and engineering research, in the integration of research and education, and in broadening participation in science and engineering by under-represented groups, by providing researchers and educators with usable access to extreme-scale digital resources, beyond those typically available on a typical campus, together with the interfaces, consulting support and training necessary to facilitate their use. The target for XD is innovation in the design and implementation of an effective, efficient, increasingly virtualized approach to the provision of high-end digital services ? extreme digital services - for researchers and educators. The XD infrastructure is intended to integrate extreme-scale digital resources and services into a common framework that makes it easy for researchers to take advantage of multiple resources and services, including the ability to move between using local resources and national resources within a single, well integrated environment. <br\/><br\/>The proposed activity is a planning activity for a project that, if successful, will provide infrastructure for research and education across a broad range of areas in science and engineering. In addition to users who are career researchers, it can reasonably be expected that this infrastructure will be used by several hundred graduate students and post-doctoral researchers each year as part of their research. The planning activity includes outreach to scientists and engineers from many fields.","title":"XROADS: Planning the Future eXtreme Digital Cyberinfrastructure","awardID":"0928542","effectiveDate":"2009-05-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}}],"PIcoPI":["490590","538992","554547","559497"],"PO":["525727"]},"148149":{"abstract":"SPIRE-EIT (Summer Program for Interdisciplinary Research and Education - Emerging InterfaceTechnologies) at Iowa State University is a 10-week interdisciplinary summer experience for undergraduates that integrates research and education in emerging interface technologies. Students are provided with classroom training and gain hands-on research experience using cutting-edge instruments, equipment, computers and technological infrastructure. Classes in computer programming and graphics, interface design, human computer interaction, and ethics occupy approximately 35% of the students'time. For the remaining time, students conduct interdisciplinary research projects in groups of three. Each group interacts with graduate students in the Human Computer Interaction Graduate Program under the supervision of HCI faculty. The research projects are presented at an end-of-the summer campus- wide research symposium in the form of posters, demos, and a five-page research paper.<br\/><br\/>Intellectual Merit <br\/>Two major trends are driving research in Emerging Interface Technologies: a dramatic increase and cheapening of interface technologies themselves, and the ubiquitous permeation of technology into everyday lives. Correspondingly, research questions focus on what new interfaces can be designed and on people's perception, conceptualization, and usage of these interfaces. The SPIRE exposes studentsto four broad areas of EIT: information visualization, mobile\/ubiquitous interfaces, intelligent agents, and enabling infrastructure. Because SPIRE-EIT has arisen from the ISU HCI graduate program, with 72 faculty across ISU's seven disciplinary colleges, faculty members compete to have their research projects included in the SPIRE and cite strong benefits from participation afterwards. <br\/><br\/>Broader Impact <br\/>As knowledge work and adaptability to new technologies continue to drive global competitiveness, it is imperative for the US to maintain leadership in interdisciplinary technology-based research and training. ISU's HCI graduate program was developed in response to this need, and represents an ideal platform to host SPIRE-EIT. Both the HCI program and SPIRE-EIT recruit with an emphasis on underrepresented groups, preparing students for graduate education in the interdisciplinary area of HCI, an area of importance to the US economy. By including instruction on ethics and on research-based evaluation techniques, the SPIRE gives students skills that are useful lifelong, independent of discipline, and which students might not otherwise encounter in a traditional engineering or computer science curriculum. Because of the connection with HCI, the results of research projects can easily be incorporatedinto faculty members' undergraduate and graduate classes. Professionally, the SPIRE offers an impressivementoring experience for the participants because of the large number of graduate student mentors involved. The experience offers these mentors, in turn, an opportunity to practice mentoring for when they become faculty.","title":"REU SITE: Summer Program for Interdisciplinary Research and Education: Emerging Interface Technologies","awardID":"0851976","effectiveDate":"2009-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505752","505751",394883],"PO":["562760"]},"154420":{"abstract":"As scholarly digital content has proliferated over the past decade, the field of library and information science has had to undergo radical curriculuum changes to deal with primary library tasks designed for print and analog media. The major educational and research changes related to digital information have led to a number of leading institutions to form interdisciplinary \"iSchools\" and begin a dialogue to adapt collectively to the new forms of information and access practices. This proposal is for a workshop to gather selected iSchool administrators and faculty focusing on pedagogical issues to discuss and reach common agreement on primary curriculum goals. This workshop is designed to present and analyze individual existing approaches and construct implementation, evaluation and dissemination plans to guide future activities.","title":"Workshop on Doctoral Education in the iSchools","awardID":"0918376","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518152","430566","531452"],"PO":["433760"]},"143222":{"abstract":"Concepts and techniques drawn from combinatorial and algebraic topology have been successful at solving a number of fundamental problems common to concurrent and distributed computing. This research focuses on two goals. First, much needs to be done to further explore and exploit the emerging connection between concurrent computing and topology. In particular, there is a need to reformulate classical notions from algebraic and combinatorial topology in terms better-suited to the demands of modeling computation. Second, there are many opportunities to apply techniques based on topology to emerging models and problems, refining and extending earlier results.<br\/><br\/>In the near future, nearly all computers, from supercomputers to smoke detectors, will be shared-memory multiprocessors (often called multicores). As a result, understanding how to exploit this new-found concurrency is one of the central issues in modern Computer Science.<br\/><br\/>This award is co-funded by EPSCoR","title":"Combinatorial Topology and Concurrent Computation","awardID":"0830491","effectiveDate":"2009-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["554181"],"PO":["565157"]},"146511":{"abstract":"Proposal: CCF- 0845716<br\/>Title: CAREER: Persistence Theories for Computational Topology<br\/>PI: Zomorodian, Afra<br\/>Institution: Dartmouth College<br\/><br\/>ABSTRACT<br\/>Data is often in the form of a set of points, sampled from some underlying original space. For example, a computer representation of a three-dimensional object is usually constructed from a set of points sampled from its surface using a 3D laser scanner. Another example is the set of snapshots from the simulated trajectory of a folding protein, a four-dimensional point set. Given any set of points, topological analysis tries to recover how the original space was connected. As such, topological analysis is a significant first step in understanding data, discovering its global structure. Due to its fundamental nature, topological analysis has applications in diverse disciplines, such as shape description, terrain analysis, sensor networks, and dynamical systems.<br\/><br\/>This research focuses on the theoretical and algorithmic development of persistence theories. Intuitively, persistence is the technique of identifying features by analyzing geometric histories of data. The key notion is that features persist through history while noise is short-lived. Currently, there exists a persistence theory only for one class of data: the theory of persistent homology for static point cloud data. This aim of this research is to develop persistence theories for other major classes of data that arise in the practice of computational topology, such as parameterized data, dynamic data, and data in diagrams.","title":"CAREER: Persistence Theories for Computational Topology","awardID":"0845716","effectiveDate":"2009-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":[390639],"PO":["565157"]},"146820":{"abstract":"ABSTRACT<br\/> Geometric modeling for simulation of complex physical phenomena raises many challenges including algorithmic efficiency, practicality, scalability, robustness, theoretical guarantees, and compatibility with the emerging numerical methods. We study solutions for geometric discretization problems for spatial domains (encountered in conventional scientific computing) and for space-time domains (motivated by the next-generation numerical methods being developed for solving PDEs directly in the space-time continuum). Our approach combines the strengths of theoretical algorithms (time complexity, output size optimality, and quality guarantees) and practical heuristics (ease of implementation, performance in practice, scalability). Two broad classes of problems are studied: (i) We develop fast, sequential and parallel algorithms and software to compute premium-quality, size-optimal, simplicial and cubical meshes of spatial domains which can evolve as the simulation progress for isotropic and anisotropic problems. (ii) We develop scalable, provably-good meshing algorithms and software to compute space-time triangulations which enables us to perform simulations directly in the space-time domain. <br\/> The algorithms and the software tools developed within this project are being integrated with applications and contributing to the fundamental research in engineering, scientific computing, solid modeling, computer-aided design, graphics, geographic information systems, computational biology, visualization and molecular modeling. As a result, this project has broader impact across a number of scientific, medical and industrial fields. Moreover, the project has academic impact through the inclusion of underrepresented groups, the development of interdisciplinary courses which focus on linking fundamental concepts in theoretical areas such as graph theory, geometry and topology to application problems in biology and engineering.","title":"CAREER: Computational Geometry, Mesh Generation, Geometric Modeling","awardID":"0846872","effectiveDate":"2009-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":[391289],"PO":["565157"]},"145566":{"abstract":"Abstract<br\/><br\/>Energy and water are major constraints to global prosperity and directly pertinent to global climate change. Their interface is of particular relevance to Wyoming as the leading US state in the exportation of energy but having major water limitations. As a model for illustrating principles of complexity and uncertainty in science, the energy-water interface presents a relevant framework to enhance STEM learning outcomes. In addition, like many rural, frontier states, Wyoming faces distinct challenges with respect to STEM awareness, education, and career opportunities. And a significant proportion of the state population can be categorized as at-risk relative to socio-economic status and educational achievement. These challenges will be addressed through a partnership between schools, the University, and the private sector using a diverse portfolio of activities designed to increase learning outcomes of doctoral fellows, 7-10 grade students and teachers, to inform career choice through motivating STEM experiences, and to institutionalize GK12 goals in the graduate education infrastructure of UW. Specific deliverables from this project include: inquiry based curricular units, summer research experiences, diverse workshops, multiple training events, sustained cyberinfrastructure interactions, and global research opportunities. This program will promote the competitive success of the future STEM workforce by providing training in leadership, communication and project management skills for graduate fellows, by enhancing the educational pipeline through motivational awareness units, through sustained professional development of teachers, and by development of new interdisciplinary graduate programs focused on GK12 objectives.","title":"The energy -water resources interface: A model for complex systems analysis in rural Wyoming middle schools","awardID":"0841298","effectiveDate":"2009-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7361","name":"EDUCATION AND WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":[388361,"412539",388363,"495105"],"PO":["559975"]},"147833":{"abstract":"This project will provide an opportunity for ten undergraduate students to participate in the ongoing CVMA (Computer Vision and Multi-Agent) research activities in the CS department at USU. The REU students will receive formal instruction on CVMA and an introduction to each project during the first week and a half. They will then directly work with the faculty mentor to generate computer programs for testing hypotheses and new techniques, and to demonstrate the feasibility of the specific ideas. Students will also participate in weekly individual meetings, alternated bi-weekly REU group meetings and brown- bag research group meetings, and social events. They are required to accomplish three oral presentations and writing tasks at three stages to improve communication skills essential to professionals in any discipline. Our goals are to provide undergraduate students with the opportunities to learn the research process, assimilate latest research, assess their own research, present their own work and experimental results, prepare publications, and prepare for admission to graduate school. This site will ensure at least four participants are underrepresented students and at least six participants are from other institutions, especially undergraduate institutions where research programs are limited.<br\/><br\/>Intellectual Merit:<br\/>The program will build a \"real-world\" working environment to help undergraduate students to develop an ability to think independently, a willingness to explore a multitude of approaches, a tenacity to face obstacles, and a background to learn state-of-the-art technical knowledge. Multiple projects will be defined to support and broaden current research efforts. These research projects include semantic-based CBIR (Content-Based Image Retrieval), image forensic and authentication, fire and flame detection, coalition organization with agent leadership, trust of robotic systems, and cooperative network monitoring. The proposed work will address the broad spectrums and challenging issues in CVMA using hands-on stimulating research projects. Some projects, designed for highly talented students, seek to advance knowledge and understanding by addressing unsolved problems. Others seek to employ CVMA techniques to solve the real-world problems. An intellectual approach will be applied to encourage students in active learning, free and open exchange of ideas, team spirit, and recognition and rewards for achievements. <br\/><br\/>Broader Impacts:<br\/>The program will impact the disciplines of CS and the competitiveness of our nation by seeding the next generation of researchers.The program will impact the individual participants by promoting the development of their independent thinking and problem-solving skills. The program's focus on students from primarily undergraduate institutions and on members of underrepresented groups will further enhance these impacts. Finally, the research itself has the potential for positive social impact due to its focus on real-world applications. Early exposure to research activities will substantially further students' learning process, significantly enhance their research experience, quickly develop their skills in CVMA related research, actively promote their interests in research, and effectively inspire their desire to pursue advanced degrees.","title":"REU Site: Research on Computer Vision and Multi-Agent Systems","awardID":"0850825","effectiveDate":"2009-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[393997,393998,393999],"PO":["563751"]},"159814":{"abstract":"Proposal Number: IIS-0241229<br\/>Principal Investigator: Thomas Moritz<br\/><br\/>This international collaborative project proposes to design and test approaches to mark-up and extraction of scientific date from a corpus drawn from the biosystematics literature of entomology (ants) and to develop a set of applications bases on an ontology for this topical area. Ontologies for natural history information are particularly complex because of the diversity of the source material and selected descriptors. The project will build on digital library work underway at the American Museum of Natural History, on biological informatics at Ohio State University and computer science at Universitat Magdeburg in Germany. The project is jointly sponsored by the German Deutsche Forschungsgemeinschaft.<br\/><br\/>Biosystematics is the science that provides the definitional foundations for organismic biology and for the applied science of biodiversity conservation. Within zoological systematics, insects are a uniquely important group of organisms with major impacts on human health and economics; ants constitute a particularly important group of social insects accounting for a major part of the biomass in tropical rainforests and displaying remarkable diversity and behavioral variation. This proposal is designed to test approaches to mark-up and extraction of scientific data from a corpus of texts drawn from the biosystematics literature of entomology (ants) and to develop a set of applications including powerful search and retrieval strategies to operate on this corpus. Specifically, approaches to automated XML mark-up will be tested using NMNH hypothesized Taxon-X Schema (derived from the implicit structure of scientific publications in biological systematics and already under development at AMNH). Then the corpus of marked-up literature will be used to explore the automated extraction and application of imbedded scientific data including scientific names, morphological characters, species distribution data (for plotting in GIS and contribution to the emerging world database of biological diversity) and collection locales\/events for inclusion in a gazetteer of collecting events.<br\/><br\/>Accomplishment of these goals will result in increased worldwide access and usefulness of an extensive body of scientific literature that is now generally restricted to users who have access to major research libraries. The project will also stimulate interdisciplinary interaction between computer scientists and domain specialists in a field that stands to benefit greatly from IT research. The core work of this project will contribute to global efforts to design and implement of similar, general purpose ontological services capable of supporting biological and conservation education at all levels. These project can contribute to research and education in biology by prototyping a model by extending the practical usefulness of the enormous body of legacy literature in biosystematics and contributing to the completion and continuing updating of international biodiversity databases. The corpus of literature to be made available on the Web -- as well as the methodology and protocols for managing them -- occurring in the context of the Commonsphilosophy can create a new model for international access to this literature offering access to biosystematics libraries to those who have never before had such resources available.","title":"Collaborative Research: Development of New Digital Library Applications in the Context of a Aasic Ontology for Biosystematics Information Using the Literature of Entomology (Ants)","awardID":"0943395","effectiveDate":"2009-05-18","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[427492],"PO":["433760"]},"158219":{"abstract":"Next-generation high-end machines will include interconnected computer nodes, each having heterogeneous accelerators and multi-core CPUs with complex memory hierarchy. They demand a programming model with a unified abstraction for programming dramatically different on-chip and off-chip parallel processing capabilities. None of the existing models is suitable for this need. The most fundamental challenge here is natural expression of parallelism in applications and efficient mapping of such parallelism to the hardware, including data distribution, locality, communication, synchronization, and load balancing. <br\/><br\/>This collaborative research between Syracuse University and Sandia Labs aims at developing an efficient programming model for high performance computing (HPC) applications using multi-core and heterogeneous processors. The specific goal of this study is to develop a high-level parallel programming abstraction with new high-level language constrctions, data types, and runtime library. Hardware features such as cores, memory hierarchy, processor heterogeneity, and interconnection will be embedded in the semantics of the language constructs and data types. The programming abstraction will guide the design and expression of parallel algorithms in the high-level language, mapped automatically onto the hardware for efficient execution. Users will be free from the low-level hardware details. The approaches include: memory virtualization,communication virtualization and processors virtualization.","title":"Collaborative Research: An Efficient Programming Model for HPC Application on Next-Generation High-End Parallel Machines","awardID":"0934447","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7952","name":"HECURA"}}],"PIcoPI":[422495],"PO":["565272"]},"146989":{"abstract":"The goal of the SGER project is to develop new tools to understand the principles of gene network operation and to use these principles as the basis for a new kind of geno-mimetic network architecture. Gene networks display multiple (degenerate) ways of giving a common output. The project identifies what principles these degenerate networks have in common and incorporate such common principles into network and circuit architectures for non-biological computational devices.<br\/><br\/>The project constitutes a new approach to the question of whether there are common underlying principles to biological network operation. The project also presents the potential to introduce an entirely new class of network architecture based on the functional configurations of gene networks.","title":"SGER: From Gene Network to Geno-Mimetic Architecture","awardID":"0847659","effectiveDate":"2009-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7946","name":"BIO COMPUTING"}}],"PIcoPI":["515695","560905"],"PO":["565223"]},"151687":{"abstract":"The NAACL HLT conference is the major international conference in North America in the field of natural language processing. This project is to subsidize travel, conference, and housing expenses of students selected to participate in the NAACL HLT Student Research Workshop which will be held during the conference May 31-June 5, 2009 in Boulder, Colorado. The workshop consists of two tracks: full paper presentations and poster presentations. All selected work has only student primary authors. The full paper sessions are composed of paper presentations followed by a discussion panel led by respected researchers in the field. The workshop is organized and run by students.<br\/><br\/>The Student Research Workshop provides a valuable opportunity for the next generation of natural language processing researchers to enter the computational linguistics community. It allows the best students in the field to take their first important step toward becoming professional computational linguists by receiving critical feedback on their work from external experts, and by making contacts with other students and senior researchers in their field. The students who are involved in running and selecting papers for the workshop also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The workshop contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing research community.","title":"Student Research Workshop in Computational Linguistics at the North American Association for Computational Linguistics and Human Language Technologies 2009 Conference","awardID":"0907847","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["554179"],"PO":["565215"]},"155979":{"abstract":"This award will help to help support student attendance at the ACM Annual Symposium on the Theory of Computing (STOC) in Bethesda, Maryland, May 31 through June 2, 2009. STOC and its sister conference, the IEEE FOCS meeting, are the premier broad-based conferences on the Theory of Computing in North America. In recent years the attendance at STOC has been roughly 275 plus or minus 25. 40% or more of the attendees have been students, for whom the conference serves as a valuable educational experience, both as regards the technical content of the talks and the opportunities for networking that it provides. This award will provide partial support to as many as thirty student attendees, covering registration fees, shared hotel rooms, and travel.","title":"AF: Student Travel to STOC 2009","awardID":"0923716","effectiveDate":"2009-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["518072","448713"],"PO":["565157"]},"158729":{"abstract":"Title: The Computing Innovation Fellows Project<br\/>Abstract<br\/>Objective: We propose an NSF Computing Innovation Fellows Project to enable new computing PhDs to obtain one-to-two year positions at academic institutions and industrial research organizations. This project will forestall a permanent loss of research talent likely to occur if new PhDs are forced to seek employment outside of the field due to the sharp cuts brought about by the recent budget crisis. It will also allow new PhDs to develop experience to make them more effective researchers and\/or teachers. In two years, increasing enrollments in both undergraduate and graduate computer science programs may create pent-up demand for hiring at university computer science and related departments. As the economy improves and budget adjustments are made, these departments will try to satisfy this demand for additional faculty. The Computing Research Association, through its Computing Community Consortium, will carry out the project and oversee its management. Together CRA and CCC will track its broader impacts and disseminate its outcomes to the community.<br\/>Intellectual Merit: As a nation, we have invested time, energy, and funding in the training of these PhDs. Now, more than ever, we need to find ways to realize a payoff for that investment. The NSF Computing Innovation Fellows (CIF) project will enable this payoff and make it possible for new PhDs to embark on advanced research and teaching careers. The project?s goal is to create a new cadre of researchers, selected by a community process that aggressively balances the often-competing goals of personal development, diversity, and institutional advancement. Because of these diversity goals, CIF may provide a way not only to rescue talent, but also to materially improve the field of computing research and education.<br\/>Broader Impact: CIF addresses the Broader Impact goals of the National Science Foundation. The scholars will remain in research positions, enabling them to advance the field while simultaneously gaining an opportunity for further training and learning. The selection process will actively seek applications from women and underrepresented groups; it also will identify scholar candidates from a cross-section of institutions. As a result, we envision that a broad range of host institutions will strengthen their research groups and labs, thereby improving the national infrastructure and research workforce.","title":"Computing Innovation Fellows Project","awardID":"0937060","effectiveDate":"2009-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7967","name":"EDUCATION AND WORKFORCE"}}],"PIcoPI":[424178,"425934","495939",424181,"209556","561152"],"PO":["565264"]},"152529":{"abstract":"Distributed Camera Networks: Research Challenges and Future Directions<br\/>Bir Bhanu, University of California-Riverside<br\/><br\/><br\/>This project provides a two-day workshop, to be held in spring 2009 at the University of California-Riverside, to discuss and identify research challenges and future research directions in the multidisciplinary research area of distributed camera networks. The workshop also intends to encourage multidisciplinary research in this area, facilitate greater interaction among researchers, and increase understanding of potential applications. Participants are from academia, industry, and government.<br\/><br\/>With respect to intellectual merit, the workshop addresses an emerging and potentially important multidisciplinary research area in what is intended to be a comprehensive manner. The workshop includes a mix of participants and topics from different disciplines. Topical areas represented include: (i) distributed sensing, processing, communication, and control; (ii) distributed understanding of video content; (iii) real-time embedded systems; (iv) graphics; and (v) simulation.<br\/><br\/>With respect to broader impact, the workshop itself and follow-on research and other activities have the potential to have a significant impact on important potential applications including video surveillance, monitoring of disaster sites, traffic monitoring, in-home care of the elderly, and entertainment. The workshop includes discussion of educational issues. The workshop intends to engage a diverse set of participants.","title":"Distributed Camera Networks: Research Challenges and Future Directions.","awardID":"0910614","effectiveDate":"2009-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":["553702","553703"],"PO":["564728"]},"163915":{"abstract":"Proposal ID: 0702761<br\/>PI name: Robert Dick<br\/>Title: Thermal-Aware Multiprocessor System-On-chip Synthesis<br\/>Institution: Northwestern University<br\/><br\/>ABSTRACT:<br\/>Embedded systems are application-specific computers within other devices such as consumer electronics, automobiles, medical devices, or networks of sensors used to monitor the safety of buildings and the health of wildlife. Many embedded systems are now implemented almost entirely on a multiprocessor system-on-chip (MPSoC), a single integrated circuit chip containing a complex network of microprocessors. In high-performance applications, the critical limiter on computation speed is temperature. Designing MPSoCs is a difficult task because the each application imposes different requirements. <br\/><br\/>In this project, the PIs plan to develop methods of accurately predicting the impacts of MPSoC design decisions on temperature, functionality, price, and power consumption. We will also develop methods of automatically designing MPSoCs that are well suited to particular applications. The planned work will focus on ideas that can be widely re-used in many different MPSoC applications. An estimate is that system-on-chip market is projected to reach $170 billion by 2007. The project will hopefully work to encourage industry to adopt the most promising new design and automated design techniques developed in this project by collaborating with our industrial affiliates on design projects and by teaching new design techniques to students who will later join industry.","title":"Thermal-Aware Multiprocessor System-On-chip Synthesis","awardID":"0964763","effectiveDate":"2009-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550572"],"PO":["562984"]},"158490":{"abstract":"This is funding to support the Student Design Competition (SDC), which will be part of the 2009 annual RESNA conference to be held June 23-27 in New Orleans. Today, between 40 million and 56 million people in the United States report some type of disability, and this number will likely grow in the coming years as the baby boom generation enters late life. RESNA is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. Comprised of over 1,000 individual and institutional members (researchers, clinicians, manufacturers, suppliers, professionals and end-users of technology devices and equipment), the organization has as its purpose to improve the health and participation of people with disabilities in mainstream society. To this end, RESNA supports individuals engaged in research, development, education, advocacy and the provision of technology through a number of programs and activities, which in addition to the annual conference include a credentialing program for assistive technology practitioners, suppliers and rehabilitation engineering technologists, as well as sponsored projects. RESNA's Technical Standards Board is the U.S. Technical Advisory Group to ANSI, the official U.S. representative to the International Organization for Standardization (ISO), for the development of ISO standards pertaining to assistive technology and other products for persons with disabilities.<br\/><br\/>The RESNA Student Design Competition fosters innovation and creativity with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference. Since then, over 200 designs have been identified as winning entries, chosen from more than 600 submissions by students from over 115 different universities. SDC entries are required to represent the work of students ONLY, including the design documentation; both undergraduates and graduates are eligible to take part. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Some past student designs have been patented and are now available commercially. NSF has been a supporter since 2005. This year's funding will enable the SDC to be further expanded and enhanced, so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also distributed electronically to a large number of colleges and universities with engineering and design schools. A team of 5 judges will pre-select entries from up to 10 teams, from which two members each will be invited to attend the conference supported with travel and hotel funds as well as complimentary registration. During a half-day session in which the teams will make presentations before the judges and public audience at the conference, 5 teams will ultimately be selected as the final winners. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. A platform session will be held this year for the second time as part of the SDC, in which the 5 finalists will make presentations to the general conference attendees. All SDC teams invited to the conference will have an opportunity to present their projects in a poster session during the general conference time. More information is available online at http:\/\/www.resna.org\/conference\/index.php.<br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. Unique in its primary focus on undergraduates, the event will provide participants with experience and skills that assist them to be successful in their engineering and design careers, and will further encourage, support and mentor students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields. In an effort to help communicate and disseminate information about this important opportunity to impact the lives of individuals with disabilities, and to increase participant diversity even further both with respect to individuals and universities, NSF funding will be used in part this year for the second time to provide video and audio streaming of the SDC activities that can then be made into podcasts or videos for the RESNA website.","title":"Video and Audio Streaming of the RESNA 2009 Student Design Competition","awardID":"0935331","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559082"],"PO":["565227"]},"148074":{"abstract":"Simulations of galactic events such as black hole and galaxy mergers <br\/>allow scientists to understand the fundamental nature of the universe. <br\/>These simulations create terabytes of data, which are extremely difficult <br\/>and time consuming to analyze using traditional mathematical tools and <br\/>techniques. To address these challenges, scientists often use data <br\/>visualization, which provides a powerful and effective approach to <br\/>understand interactions and behavior of simulations such as visualizing <br\/>the radiation of gravity waves during a supermassive black hole merger. <br\/>Visualization systems require high performance file-systems for efficient <br\/>data management. Over the last three years, a collaborative effort <br\/>between the Computer Science Department and the Center for Computational <br\/>Relativity and Gravitation at Rochester Institute of Technology resulted <br\/>in a visualization framework called Spiegel that has been used successfully <br\/>to analyze and visualize the simulation of a variety of galactic events.<br\/><br\/>This REU site provides students with the opportunity, environment and support <br\/>to conduct research in data visualization and high-performance file systems <br\/>using Spiegel as the starting point. Working in a collaborative and <br\/>interdisciplinary environment, students develop solutions to a broad set <br\/>of research problems in performing computation on massive amounts of <br\/>multi-dimensional data. Consequently, students gain knowledge in understanding, <br\/>critiquing, and presenting research literature. This project offers students <br\/>opportunities to work on state-of-the-art computing techniques that are <br\/>increasingly vital for solving research problems in modern scientific <br\/>disciplines. Undergraduate students are encouraged to pursue interdisciplinary <br\/>graduate studies in STEM disciplines. With specific recruiting efforts that <br\/>target underrepresented groups such as women, minorities, and persons with <br\/>disabilities, especially deaf and hard-of-hearing students, this REU program <br\/>also aims to increase the size and diversity of the scientific workforce.","title":"REU Site: High Performance Filesystems and Data Visualization","awardID":"0851743","effectiveDate":"2009-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["521954","513318"],"PO":["523800"]},"148075":{"abstract":"The project objectives are to broaden participation in computing doctoral programs by providing a summer research experience that will immerse undergraduates into the activities and culture of a research lab. Participating labs include the Charlotte Visualization Center, the Future Computing Lab, the Games+Learning Lab and the Networking Research Lab. Students will focus on computing research, within these labs, that empower people to solve problems of personal interest or that are important to society at large (socially relevant computing). The activities include a summer research experience introducing students to computing research methodologies and a broad array of computing research disciplines. Students will receive support from peer and faculty mentors. Students will take a GRE prep course and will be shown how to apply to and succeed in graduate school. The targeted student participants are women and under-represented minority students who are rising juniors, predominantly from non-doctoral institutions. The intended impact is that a high number of REU students will apply to computing doctoral programs.<br\/><br\/>INTELLECTUAL MERIT<br\/>The intellectual merit will primarily be the contributions to computing research that will be produced by the undergraduate students participating in the REU Site. The topics addressed are relatively new in CS. Additionally, the program evaluation will inform efforts to recruit undergraduate students to doctoral programs by demonstrating the success and challenges of this REU Site structure for motivating students to apply to doctoral programs in computing.<br\/><br\/>BROADER IMPACT<br\/>The broader impact of the project will be evidenced by the increased numbers of students from under-represented populations in computing who successfully participate in research and who apply to and are accepted into graduate programs in computing.","title":"REU Site: Socially Relevant Computing Research: Visualization, Virtual Environments, Gaming, and Networking","awardID":"0851745","effectiveDate":"2009-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["561854","464128"],"PO":["563751"]},"157373":{"abstract":"This travel grant provides partial support for young researchers and students to participate in MobiHoc 2009 Symposium in New Orleans, Louisiana, USA and partial support for a workshop entitled, ?The First Wireless of the Students, by the Students, for the Students Workshop? to be held in conjunction with ACM Mobihoc 2009 created by the students, for the students. The intellectual merit of the student workshop is to pursue a unique format that will develop leadership, early-career development and encourage participation in the research community. The student panels will be an early experience with bold, visionary thinking. Moreover, ACM MobiHoc is the premier international symposium dedicated to addressing challenges emerging from wireless ad hoc networking and computing. The broader impact is fostering an environment of technical discussions and debates among the communities of mobile computing and wireless systems. In addition, the event targets to encourage participation by young scientists and researchers and features a ?Networking Networking Women? meeting.","title":"A Proposal to Support Students and Young Scientists at the 2009 ACM Sigmobile Association on Mobile Ad Hoc Networking and Computing Symposium in New Orleans, Louisiana, USA","awardID":"0929464","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["548310"],"PO":["564777"]},"156362":{"abstract":"This is funding to support a one-day international workshop of researchers from academia and industry, along with graduate students, to be held in conjunction with the 11th International Conference on Ubiquitous Computing (Ubicomp 2009), which will take place September 30-October 3, 2009, in Orlando, Florida, and which is sponsored by the Association for Computing Machinery (ACM). Ubicomp is the premier outlet for novel research contributions that advance the state of the art in the design, development, deployment, evaluation and understanding of ubiquitous computing systems. Ubicomp is an interdisciplinary field of research and development that utilizes and integrates pervasive, wireless, embedded, wearable and\/or mobile technologies to bridge the gaps between the digital and physical worlds. More information about the conference is available online at http:\/\/www.ubicomp.org\/ubicomp2009. This interdisciplinary workshop, the first of its kind in the United States, will bring together researchers from a variety of scientific domains, from engineering, and from architecture, to identify opportunities and challenges in the emerging field of architectural robotics, that is to say robotics technologies embedded in the built environment. Throughout history the emergence of new technologies has reshaped our built environment and so, society. Workshop participants, about 20 of them supported under this award, will share their research and teaching, and explore issues relating to the design of complex engineered systems that respond to human needs and wants. They will wrestle with questions such as: What new vocabularies of design need to be cultivated, and what theories of self-reconfigurability defined, in order to lay the foundation for sophisticated algorithms that will sense and infer the occupancy, activities, and external conditions of a building so as to trigger change that improves life, enhances existing places, and supports human interaction? And: How can we educate students from different academic backgrounds to collaborate productively in teams, and what tools could further teaching and learning in the design and implementation of architectural robotics? The PIs expect the workshop to launch a viable new research community, by serving as a catalyst for future knowledge exchange, collaboration and growth. To these ends, event outcomes will include publication of a collection of position papers and set of references (including academic papers), as well as Web sites and other media that pertain to this new field of research.<br\/><br\/>Broader Impacts: The gradual embedding of robotics throughout the built environment will have a broad impact on society as these technologies support and, in some cases, augment everyday work, school, entertainment, and leisure. Early applications will likely be in health care, in support for persons with physical disabilities, in the empowerment of a growing populating wishing to age in place, and in intelligent work spaces that are responsive to changing needs, that consume less floor space, and that reduce energy costs. The educational activities in the workshop will explore methods of teaching multidisciplinary classes that bridge the academic cultural gaps that separate engineering, human-centered design, and architecture and its allied design and art practices. The PIs will make every effort to ensure a diverse group of participants including representatives of underrepresented groups in science and engineering such as minorities, women, and persons with disabilities.","title":"Architectural Robotics - An International Workshop","awardID":"0925238","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["538656","563341"],"PO":["565227"]},"148145":{"abstract":"This project renews an exemplary existing Research Experience for Undergraduates site focused on the areas of pervasive and mobile computing. The project engages students in a wide range of projects in wireless engineering, including human-computer interaction, distributed computing, software architecture, network design, and simulation. A nationwide recruitment process is used to select cohorts of undergraduate students to participate in a ten-week summer research program at the host institution. Particular emphasis is placed on recruitment of students from under-represented populations. The project includes mentoring by the experienced computer science faculty members, technical seminars and workshops, student presentations, and field trips and other professional development opportunities. <br\/><br\/>Intellectual Merit: The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in current research areas that are of interest to the community at large and that have clear practical applications. The students participate in a full range of research activities from preparing research literature reviews to production and dissemination of research results.<br\/><br\/>Broader Impact: The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The participating faculty members are committed to including under-represented minority students in their research. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site for Pervasive and Mobile Computing","awardID":"0851960","effectiveDate":"2009-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505916","409964"],"PO":["564181"]},"146574":{"abstract":"Pen-based computing has the potential to make a significant improvement in the education of our students in STEM disciplines so as to produce a more skilled technical workforce able to compete in the new global economy. Mathematical sketching, a pen-based interaction paradigm that is providing a new approach to STEM education, is the process of making and exploring dynamic illustrations by associating handwritten mathematics with free-form diagrams. The proposed research will develop new mathematical sketching tools to improve student learning in STEM. High level semantic recognition techniques for understanding mathematical sketches (the combination of handwritten problem description, mathematical expressions, and drawings) will be explored to ensure proper interactive feedback, facilitation of correct cognitive models, and the generation of the most appropriate dynamic visualizations for a given problem. In addition, these techniques will, in part, be used to develop strategies in inferential statics and dynamics, the process of finding appropriate animations when users do not directly specify motion equations in the problem solving process. Given the reliance on recognition-based interaction in mathematical sketching, usability studies will examine how users are affected by recognition feedback and accuracy levels. These studies will provide useful guidelines for ensuring that the mathematical sketching interface is usable by both teacher and student. Two educational studies will also explore how mathematical sketching affects teaching and learning. This work will advance the state-of-the-art in pen-based UIs through the development of techniques and exploration of user interface design issues for enriching mathematical sketching. <br\/><br\/>Broader Impact: This proposal links research in pen-based UIs with STEM education, a critical application area. Thus, the work has the potential to reach thousands of students each year. The PI has the opportunity to work on this research in conjunction with the University of Central Florida?s EXCEL Program, an NSF STEP-funded project that helps students succeed in math and science during the first two years of college, where the mathematical sketching paradigm is directly applicable. The PI will give demonstrations and lectures through the Florida High Tech Corridor Council techCAMP program to bring mathematical sketching to teachers and students in African American and Hispanic high schools. The proposed research will be integrated into a graduate-level course on pen-based UIs, thus enhancing the education of tomorrow?s pen-based UI designers and researchers. Finally, undergraduate courses will be taught on human computer interaction (HCI) and design of interactive systems that, together with the graduate course, will be an educational foundation for HCI at UCF.","title":"CAREER: Mathematical Sketching: Pen-based Tools for Conceptual Understanding in Mathematics and Physics","awardID":"0845921","effectiveDate":"2009-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["397950"],"PO":["565227"]},"158696":{"abstract":"Cameron (Kamin) D. Whitehouse, University of Virginia<br\/>Proposal for Participant Support in the IPSN Extreme Sensing Competition 2009<br\/><br\/><br\/>Intellectual Merit: This project provides travel and conference support for U.S. students to participate in the Extreme Sensing Competition (XSC), being held as part of the 8th ACM\/IEEE Conference on Information Processing in Sensor Networks (IPSN 2009). In the XSC, students, researchers, or industry participants build a sensor system that is used to perform a pre-specified task. The event requires students to address a number of open challenges involving sensing, control, signal processing, wireless networking, and the interactions between these areas. The 2009 competition considers body area networks (BANs) and dead reckoning.<br\/><br\/>Broader Impact: Most participants in the Extreme Sensing Competition are junior graduate students and the event allows them to engage with the CPS research community early in their graduate program. Unfunded students who would otherwise be unable to attend ISPN and participate in the XSC are given special consideration for support. Students from underrepresented groups are also given special consideration for support. Advertising emphasized outreach to these groups. The event also showcases the student participants and projects to the large cyber-physical systems research community, as ISPN 2009 is a component of Cyber-Physical Systems (CPS) Week and the competition is open to all CPS Week attendees.","title":"Proposal for Participant Support in the IPSN Extremem Sensing Competition 2009. To be held on April 13, 2009 in San Francisco, CA.","awardID":"0936902","effectiveDate":"2009-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":["543576"],"PO":["438934"]}}