{"28060":{"abstract":"The purpose of the research project is to design simple, efficient, and robust mechanisms to improve the performance of Transmission Control Protocol (TCP) in mixed wired\/wireless and ad hoc communication networks. The basic approach is to study how the soon-to-be-standardized Selective Acknowledgment (SACK) feature of TCP, together with knowledge of the statistical behavior of wireless links, can be used to decouple the error recovery and flow control functions of TCP by distinguishing between transient and persistent packet loss. The network will be modeled within a stochastic framework, guided and validated by computer simulation. Rigorous mathematical techniques, as well as extensive computer simulation, will be employed to design and analyze the performance of each mechanism. In order to accurately evaluate the performance of the mechanisms, they will be implemented experimentally under a wide variety of real-world conditions using channel emulation hardware. The education plan can be summarized as one of utilizing the vast resources at the University of Michigan, participating in several initiatives in curriculum development, involving undergraduate students in research, and developing Web-based Matlab modules.","title":"CAREER: Fundamental Control Problems in Wireless Communication Networks","awardID":"9734025","effectiveDate":"1998-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["118431"],"PO":["565090"]},"28150":{"abstract":"Over the past few years, the principal investigator has designed, implemented, and deployed a number of applications and application-level protocols that utilize IP Multicast for large-scale, multiparty remote-conferencing over the Internet Multicast Backbone or Mbone. In the current incarnation of the MBone tools, a separate application handles each media (e.g.,for audio,for video, and for whiteboard) and together these tools comprise a flexible multi-party communication system that scales to roughly 1000 participants. This NSF CAREER proposal builds upon this previous work on the MBone tools with a new emphasis on massive scalability. A principal goal is to design new end-to-end protocols complemented by new network services that will facilitate multi-party communication systems that scale to millions of hosts. At this extreme, ``multicast for the masses''becomes a reality. If successful,the traditional infrastructures for mainstream mass media ---e.g., analog cable networks and over the air radio broadcasts ---can be replaced by integrated packet-switched networks running highly scalable multicast protocols. The proposed approach for achieving this thousand-fold improvement in scalability is multifaceted. Initially, the investigator will design minimal but powerful extensions to the IP Multicast service model that will provide end hosts with more flexible mechanisms for exploiting the underlying network topology. In the current Internet architecture, network topology is deliberately hidden. While this has led to robust protocols and robust networks, it places fundamental scaling restrictions on end-to-end multicast protocols. Instead, the proposed work will investigate whether a properly modified IP Multicast service model can enable new end-to-end protocols that scale to the extreme degree proposed herein. One particularly promising extension to IP Multicast is a new forwarding service called subtree multicast or subcast. Subcasts provide the topol ogically-aware network localization that end-to-end protocols require in order to scale gracefully. Whereas a normal multicast packet is sent to every receiver in a target multicast group, a subcast packet is sent only to a well-defined, localized subset of the group. Leveraging subtree multicast, the proposed work aims to overcome many of the scaling limitations in current end-to-end multicast protocols, and in particular, seeks a new, subcast-based design for the local recovery component of modern reliable multicast transport protocols. But, more generally, subcasts hold the promise to have far-reaching impact on a number of end-to-end multicast protocols (e.g., announce\/listen protocols like RTCP, session directory protocols, multicast address allocation schemes, congestion control probes as RLM, and distributed voting algorithms like SCUBA),and the proposed work will investigate the integration of subcasts into these existing protocols as well as new ones. Research prototypes based on subcast technology will be fielded in real, ``production'' environments and integrated to the extent possible into the proposed educational activities. To this end, the investigator will develop on-line curricula that utilizes an experimental webcast system to deliver course content over the network, for example, to students in their dormitories, homes, or offices. The resulting applications and tools will also be deployed in a ``distance-learning classroom'', currenty under development at U.C. Berkeley, which houses classes, seminars, and research group meetings. To realize this ambitious goal, the proposed project will integrate artifacts and infrastructure from the MASH multimedia networking project at U.C. Berkeley and other similar efforts in the network research community that are investigating and building new multicast applications and protocols.","title":"CAREER: Multicast for the Masses: Scaling the Internet Multicast Service","awardID":"9734515","effectiveDate":"1998-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["96209"],"PO":["565090"]},"28033":{"abstract":"This research addresses the problems of detection and recognition of deformable articulated shapes, such as people and animals, from real images. The aim is to develop a Top-down and Bottom-up recognition strategy, where the Bottom-up detects features, group them, and access the object model, while the Top-down uses the object model to search for features. Objects are represented in a tree-graph structure derived from a shape axis model. The information stored in the nodes include probabilities, used to specify likely geometric deformations of the object and of the imaging function. The tree-graph structure allows for a description of occlusions and articulations in terms of tree matching operations. To further reduce the computational complexity of the task, an information theory criteria is studied to determine features which convey information about the objects in the image. The PI will also develop and teach two courses, one of them new to NYU, to support a focused program in computer vision; these course will be``Introduction to Vision'', and a specialized course in ``Grouping and Recognition''.","title":"CAREER: Articulated Model Recognition","awardID":"9733913","effectiveDate":"1998-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["170917"],"PO":["234178"]},"25570":{"abstract":"This award supports Dr. Jan Prins, co-PI Siddhartha Chatterjee, and a graduate student from the University of North Carolina-Chapel Hill in a collaboration with Stefan Jªhnichen of the Department of Communications and Software Engineering at the Technical University of Berlin. The collaboration will study high-performance computing with the aim of integrating nested parallelism into the High Performance Fortran (HPF) and Fortran 95 programming languages. (HPF is a variant of Fortran 95 specifically targeted for programming high-performance parallel computers in a way that does not depend on the computer architecture.) The time is right to incorporate this new technology into Fortran so that applications can take advantage of the capability without disrupting ongoing development. Nested parallelism enables the expression of adaptive and sparse solution techniques necessary to performing increasingly large and precise scientific computations. The collaboration combines the complementary strengths and facilities of the two research groups.","title":"U.S.-Germany Cooperative Research: High-Performance Execution of Nested Data Parallelism in Fortran Programs","awardID":"9726317","effectiveDate":"1998-03-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["426282",64474],"PO":["290800"]},"26670":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for a DS-3 connection to the enhance and accommodate research needs for Washington University by establishing a connection to the Very High Performance Backbone Network Service (vBNS) via the MCI POP in Downers Grove, IL. Projects in this proposal include: neuroscience, electronic radiology, planetary databases, computational projects in physics, genome sequence analysis, and studio quality video for scientific collaboration. With this high performance network capability the Washington University will expand current research and collaboration with both academic institutions and federal laboratories. On this project, collaborating institutions include: San Diego Supercomputer Center, University of California at San Diego, University of California at Los Angeles, Henry Ford Hospital, University of Michigan, Jet Propulsion Laboratory, NCSA, Oak Ridge National Laboratory, University of Colorado, University of California at Santa Barbara, and University of Indiana.","title":"Connection to the vBNS","awardID":"9729618","effectiveDate":"1998-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["498904",67148],"PO":["182196"]},"28133":{"abstract":"The purpose of the research project is to design simple, efficient, and robust mechanisms to improve the performance of Transmission Control Protocol (TCP) in mixed wired\/wireless and ad hoc communication networks. The basic approach is to study how the soon-to-be-standardized Selective Acknowledgment (SACK) feature of TCP, together with knowledge of the statistical behavior of wireless links, can be used to decouple the error recovery and flow control functions of TCP by distinguishing between transient and persistent packet loss. The network will be modeled within a stochastic framework, guided and validated by computer simulation. Rigorous mathematical techniques, as well as extensive computer simulation, will be employed to design and analyze the performance of each mechanism. In order to accurately evaluate the performance of the mechanisms, they will be implemented experimentally under a wide variety of real-world conditions using channel emulation hardware. The education plan can be summarized as one of utilizing the vast resources at the University of Michigan, participating in several initiatives in curriculum development, involving undergraduate students in research, and developing Web-based Matlab modules. http:\/\/www.eecs.umich.edu\/~wass\/nsf\/career.html","title":"CAREER:A Unified Approach to Quality-of-Service Provisioning in Integrated Services Networks: Traffic Characterization, Resource Management and Their Integration","awardID":"9734428","effectiveDate":"1998-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["543509"],"PO":["234222"]},"33084":{"abstract":"The 1998 IEEE Infocom Conference on Computer Communications will be held in San Francisco, California, from March 29 to April 2, 1998. This conference is the pre-eminent technical conference for presenting new results in all areas of computer communications. This proposal requests funding to assist approximately a dozen United States-based graduate students, post-docs and faculty in attending this meeting. Participation in conferences such as Infocom is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and be exposed to leading edge work in the field. It is also vital to the continued development of post-docs and faculty, particularly those relatively new to the rapidly growing field of computer communications. The support requested in this proposal will enable the participation of students, post-docs and faculty who would otherwise be unable to attend Infocom'98.","title":"Travel Support for IEEE Infocom'98 Conference; March 29 to April 2, 1998; San Francisco, California","awardID":"9811363","effectiveDate":"1998-03-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["518545"],"PO":["150490"]},"26760":{"abstract":"9729814 Yun, Xiaoping Naval Postgraduate School CISE Research Instrumentation: Accurate Control of Underwater Manipulators Using Inertial Sensors This research instrumentation grant contributes to the purchase of two MotionPak inertial sensors, two digital gyro compasses, and one water speed sensor, which will enable the following projects:- Coordination of an Underwater Vehicle and an Onboard Manipulator, and - Traction Control of an Autonomous Ground Vehicle on Rough Terrains. The objective of the proposed research projects is to investigate control and coordination of an underwater vehicle-manipulator system. An inertial sensor, water speed sensor, and digital compass are integrated to provide accurate estimates of vehicle motions. A novel nonlinear feedback control algorithm is developed to compensate for vehicle-manipulator dynamic interactions. Because of the uncertain nature of undersea environments and lack of hydrodynamic modeling data, it is crucial to validate theoretical algorithms by physical experiments. The proposed instrumentation makes it possible to conduct physical experiments using the proposed half-dry half-wet approach. The experiments not only validate the control algorithm proposed in this research, but also establish an entirely new, cost-effective underwater experimentation procedure. The integrated sensor system (replacing the water speed sensor by wheel encoders) is also applied to an all-terrain land vehicle for wheel slip estimation and for improved traction control.","title":"CISE Research Instrumentation: Accurate Control of Manipulators Using Inertial Sensors","awardID":"9729814","effectiveDate":"1998-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["438649"],"PO":["301532"]},"27024":{"abstract":"9730518 Knio The project is for numerical and theoretical study of the role of gravity waves in the long-time evolution of the global oceanic circulation. The model used is SEOM developed at Rutgers University, and an multiple-pressure- variable approach will be implemented. It would lead to an order-of-magnitude enhancement in the efficiency of SEOM, thus allowing extended high-resolution ocean simulations that include adequate representation of free-surface phenomena. The model will first be used for two-dimensional simulations of tidal circulation in the global ocean. After the model is optimized, extended three-dimensional simulations of the global wind-driven circulation will be performed.","title":"Numerical and Theoretical Analysis of Shallow Water Flow with Applications to the Global Oceanic Circulation","awardID":"9730518","effectiveDate":"1998-03-15","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1610","name":"PHYSICAL OCEANOGRAPHY"}}],"PIcoPI":["210127"],"PO":["563981"]},"28059":{"abstract":"*** 9734023 Tyson This project explores the interaction between code transformation performed during compilation and instruction set design. Several modifications in instruction set design are under investigation, each of which attempts to improve overall processor performance by increasing the amount of compile time information transmitted to the hardware at runtime. Some modifications, such as probabilistic prefetch or branch table indexing, amount to hints that may improve performance without requiring all implementations of an architecture to use the information. Others, such as imposition of FIFO semantics on one or more register identifiers, enable compilers to schedule resources and require that all implementations comply with the scheduling. Each of the modifications will be explored using both classroom projects for graduate courses and individual research by graduate students. Simulation and other tools arising from this project will be introduced into the undergraduate curriculum. ***","title":"CAREER: Improving Compiler\/Architecture Synergy","awardID":"9734023","effectiveDate":"1998-03-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["537232"],"PO":["113883"]},"24122":{"abstract":"9720612 McCauley-Bell, Pamela University of Central Florida POWRE: An Investigation of Interaction Between Human and Automation Elements in Alerting Systems The PI plans to visit the Humans and Automation Division of the Aerospace and Aeronautical Engineering Department of MIT with the objectives as defined in the program of Professional Opportunities for Women in Research and Education (POWRE): to achieve professional growth, career advancement, and increased prominence. The proposed activities will be centered around the theme of her research utilizing high risk, complex and automated systems for monitoring and control of numerous environments. Techniques and methodologies for successful human and intelligent system interaction with respect to emergency alerting systems will be explored. Human performance to alarm situations with and without the presence of the intelligent agent will be evaluated (response time and accuracy of results).","title":"POWRE: An Investigation of Interaction Between Human and Automation Elements in Alerting Systems","awardID":"9720612","effectiveDate":"1998-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["533425"],"PO":["297837"]},"26674":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an OC-3 connection to the enhance and accommodate research needs for the University of Alabama in Huntsville by establishing a connection to the Very High Performance Backbone Network Service (vBNS) via the co-located National Center for Supercomputing Applications existing connection to the vBNS. Some of the projects in this proposal include: Lightning Studies, Ozone and the environment, National distribution of global climate data, Radar data for tornado research, Satellite Remote Sensing Efforts, Tropical Energy Balance Assessment, Solar Plasma Physics, High Performance Communication for Space and Astrophysical Plasma Physics Research, Ultraviolet Imager, SSME Flow Process Modeling, Remote Polarization Sensing Data Analysis, Optical Phased Array Systems, Virtual Laboratories in Probability and Statistics, Alabama Supercomputing Program to Inspire Computation Research in Education, Remote High Performance Visualization and Virtual Reality for Surgical Planning and Rehearsal and Related Investigations in Telemedicine, and Collaborative Multi-Archive Data Mining. With this high performance network capability the University of Alabama in Huntsville will expand current research and collaboration with both academic institutions and federal laboratories. On this project, collaborating institutions include: Pennsylvania State University, National Center for Atmospheric Research, MIT's Lincoln Laboratory, Texas A&M, University of Arizona, University of Wisconsin-Madison, Georgia Institute of Technology, University of Virginia, university of Washington, University of Maryland, University of Colorado, University of California-San Diego, NOAA\/NESDIS, NOAA\/NCDC, EDC, NASA\/LaRC, NASA\/MSFC, NASA\/GISS, NASA\/GSFC, NASA\/JPL, Environmental Protection Agency, and the National Environmental Assessment Laboratory in Research Triangle Park.","title":"\"A Testbed For A Multi-network Infrastructure for Research\"","awardID":"9729627","effectiveDate":"1998-03-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[67158,"349823","527740",67161],"PO":["198445"]},"25024":{"abstract":"This three-year award supports US-France cooperative research among Joseph Kearney and James Kremer at the University of Iowa and Stephane Donikian at the Institute for Research in Informatics and Random Systems (IRISA) in Rennes, France. IRISA is affiliated with INRIA, which is the French National Institute for Research in Informatics and Applied Mathematics. The objective of the research is to investigate scene and scenario modeling for simulating large-scale virtual driving environments. These computer simulations are useful for studying driving behavior and conducting experiments on the influence of drugs and disease, the effectiveness of computer-assisted driving aids, and the impact of new in-vehicle technology. The University of Iowa and IRISA groups have developed independently driving simulators for rural and urban environments. Their work is supported by US and French governments respectively and Ford (in US) and Renault (in France). They have extensive and complementary expertise in system building, dynamic simulation and control programming. The project will advance knowledge of virtual prototyping and the development of computer tools for understanding crashes and crash prevention.","title":"U.S.-France Cooperative Research (INRIA): Driving Simulation","awardID":"9724746","effectiveDate":"1998-03-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["543444","543446"],"PO":["323582"]},"26730":{"abstract":"The award for \"High-Performance Network Connectivity for the University of Nebraska-Lincoln\" is made under the high performance connections category of DNCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides support for interconnecting UNL's ATM-based campus network infrastructure to the Very High-speed Backbone Network Service (vBNS) via the Great Plains network, a high-performance regional network dedicated to supporting the research needs of Great Plains universities. In addition to supporting meritorious research at the University of Nebraska, the high performance connection to the vBNS will permit the University to contribute more effectively to the Internet2 project as well as participate with NCSA in PACI. The award will partially fund the installation and operation of a DS-3 circuit from the Great Plains network gigapop in Kansas City to a vBNS connection point in Chicago over a two-year period. Research projects in the areas of earth systems science, inverse electrocardiography, image understanding (image analysis), mobile IP and cryptography expect to make use of the high-performance network partially supported by this award. Collaborating institutions on these projects include the USGS\/EROS Data Center, the National Center for Atmospheric Research, the USDA\/Natural Resources Conservation Service, the USDA\/Forest Service, NASA, the University of South Carolina, Creighton University, South Dakota State University, Western Michigan University, Kansas State University, Ben-Gurion University (Israel), the Salk Research Institute, the European Molecular Biology Laboratory, Argonne National Laboratory and various U.S. Air Force Laboratories. This award will allow the University of Nebraska-Lincoln to expand its collaborative efforts.","title":"High-Performance Network Connectivity for the University of Nebraska-Lincoln","awardID":"9729750","effectiveDate":"1998-03-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[67315,"207744"],"PO":["198445"]},"27963":{"abstract":"This research focuses on improving simulation and test methodologies through the use of Concurrent Simulation (CS) and Multiple Domain Concurrent Simulation (MDCS) algorithms. This project develops an efficient behavioral fault simulation architecture that integrates well with structural and RTL models. The inherent ability of CS to represent and store only unique behaviors from the fault free experiment allows for excellent internal observation and comparative experimentation. Furthermore, the use of MDCS algorithms provides compression techniques for large simulations, overcoming memory bottlenecks while supporting the creation of multiple experiment scenarios. This allows a designer to vary parameters within any model and simulate it against other model configurations in a single simulation. Activities being explored under this grant include: (a) Developing algorithms for behavioral fault simulation, observability and signature traces using CS and MDCS; (b) Reduction of memory requirements through enhanced erratic experiment (infinite loop) detection, experiment compression using MDCS algorithms and fault dropping. (c) Evaluation of algorithms that allow the seamless integration of multilevel models.","title":"CAREER: Robust Behavioral Fault Simulation Algorithms for Multilevel Simulation","awardID":"9733584","effectiveDate":"1998-03-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["461118"],"PO":["562984"]},"28117":{"abstract":"This project will develop fast and accurate numerical algorithms for linear algebra problems arising in engineering computations. One class of such problems concerns matrices with displacement structure. This is a general algebraic concept and includes the well-known classes of Toeplitz, Hankel, Vandermonde and Cauchy matrices. In practice there is the need for solving rapidly and accurately, both exactly-determined and over-determined linear systems involving such matrices. Furthermore, in some applications like inverse scattering for geophysical problems, there is also the need for the rapid factorization of such matrices. Another related class of problems arises in adaptive filtering applications, where there is a need to solve rapidly and accurately a sequence of structured linear problems that are related by low-rank changes. In a different vein, the computation of the eigenvalues and eigenvectors of symmetric pencils is another important problem. It frequently arises in finite-element analysis of engineering structures and associated model-reduction problems. New models and fast algorithms for the analysis of linear algebra problems with large bounded uncertainties will also be developed.","title":"CAREER: Studies in Numerical Linear Algebra","awardID":"9734290","effectiveDate":"1998-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["381444"],"PO":["201974"]},"26644":{"abstract":"The Institute of Ecosystem Studies, located in Millbrook, NY is an independent not-for-profit research and education institute dedicated to the creation, dissemination and application of knowledge about ecological systems. This grant will help fund Internet access for the institution by supporting the acquisition of a leased line, connection equipment, installation services and service provider fees. The students and faculty of the Institute of Ecosystem Studies need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"An Internet Connection for the Institute of Ecosystem Studies","awardID":"9729567","effectiveDate":"1998-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["535878",67068],"PO":["198445"]},"26600":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for an OC-3 connection to the vBNS. Applications include projects in astrophysics, physics, computer science and languages. Collaborating institutions include the National Center for Supercomputing Applications, Apache Point Observatory, Fermilab National Accelerator Laboratory, Johns Hopkins University, Carnegie-Mellon University, the National Astronomy and Ionosphere Center, Stanford University, University of California-Berkeley and Columbia University.","title":"A vBNS Connection for Princeton University","awardID":"9729437","effectiveDate":"1998-03-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[66946],"PO":["198445"]},"27943":{"abstract":"*** 9733475 Chong Microprocessor performance continues to increase faster than memory performance, so that computer systems face a memory bottleneck. The goal of this project is to distribute logic within memory systems so that some computations can be performed in the memory system without transferring data to the processor. By fabricating field-programmable gate arrays and memory on the same chip, computations for fine-grained data manipulation can be distributed to the memory system at run time to speed up specific applications.A crucial research issue in such a design is the partitioning of computations between high-performance processors and the distributed logic. This project is investigating this partitioning on a range of appilications, including integer programming for compiler register allocation, filters for image and video editing, internet routing, graph matching for intrusion detection, and protein sequence matching. Educational plans include the updating of several existing courses in computer architecture, the development of new courses in reconfigurable computing, and the incorporation of undergraduate research into the project. Expected outcomes of this project include a methodology for designing reconfigurable memory systems and using them in computations, an infrastructure of simulation tools and hardware prototypes, students trained in applications-driven system design, and web-based educational software to support collaborative projects in computer architecture. ***","title":"CAREER: Care and Feeding of High-Performance Processors with Reconfigurable Memory Systems","awardID":"9733475","effectiveDate":"1998-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["486140"],"PO":["113883"]},"26733":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in astronomy, biochemistry, physics, materials science, ocean field research and computer science. Collaborating institutions include the Apache Point Observatory, Pittsburgh Supercomper Center, Maui High-Performance Computing Center, Los Alamos National Laboratory, Harvard University, University of Washington, University of Miami, Batelle Pacific Northwest National Laboratory, Sandia Livermore National Laboratory, University of California at San Diego and Berkeley, Scripps Institute of Oceanography, Naval Postgraduate School and University of Minnesota.","title":"A High Performance Connection for Washington State University","awardID":"9729755","effectiveDate":"1998-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67328,"440928","555292","473921"],"PO":["198445"]},"26755":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in astrophysics, computer science and electrical engineering. Collaborating institutions include the NASA Ames Research Center, Massachusetts Institute of Technology, Arizona State University and University College London.","title":"A vBNS Connection for the University of Wyoming","awardID":"9729804","effectiveDate":"1998-03-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["437252",67384],"PO":["198445"]},"27877":{"abstract":"Broadband networks are being designed to transport diverse traffic streams with various quality-of-service (QoS) requirements. Accurate characterization of these streams is essential to devising efficient resource allocation strategies that guarantee acceptable QoS without underutilizing network capacity. This project is focused on characterizing compressed video traffic and investigating resource allocation schemes for transporting video traffic over computer networks. New traffic models for VBR video streams will be developed under three strongly related compression algorithms: JPEG, MPEG-1, and MPEG-2. The modeling methodology will be based on the class of M\/G\/infinity processes, whose versatility will be exploited to capture various forms of traffic correlations. Video sources (single and aggregated) will be characterized at both an entry node and after being multiplexed with other streams (i.e., the departure traffic from a multiplexer). Models for the various layers in hierarchically encoded MPEG-2 video will be developed. The multiplexing performance under video models will be investigated. Corresponding resource allocation strategies for transporting video traffic over broadband networks will be developed. The impact of correlations persistence on the queueing performance under video traffic will be investigated. Several priority scheduling strategies at a multiplexer that is fed by several MPEG-2 input streams will be studied. In connection with the proposed research program, several educational goals will be pursued. New courses on broadband multimedia networks which integrate in their curricula several aspects of the PI's research agenda will be developed. The pedagogical approach in these courses will be a balanced mix of theory and practice and will combine classroom instruction with research-oriented semester projects, hence exposing students (graduate and senior undergraduate) to the intriguing realm of research. Team work will be strongly encouraged in course projects, as it prepares students to future work environments in industry. In an effort to outreach to industry, networking courses taught by the PI will be broadcast over the VideoCampus facility to several industrial sites in the area, allowing many interested engineers and managers to take these courses on their premises. The PI plans to organize a weekly seminar on various topics in networks research, which will feature presentations given by students, faculty, and invited speakers from industry and academia.","title":"CAREER: Traffic Characterization and Resource Allocation for Transporting Video Streams Over Broadband Networks","awardID":"9733143","effectiveDate":"1998-03-15","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["540507"],"PO":["234222"]},"24137":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for a connection to enhance and accommodate the research needs for the University of Missouri-Columbia (MU) by establishing a connection to the Very High Performance Backbone Network Service (vBNS) via the MCI POP in Downers Grove, IL. Projects in this proposal include: Missouri Intelligent Networked Information System (MINIS), MU\/NASA Regional Applications Center (MURAC), The Classroom of the 21st Century (Class21), Collaborative Information Spreadsheet of Geospatial Information (CISS), Interactive Shared Journal System (ISJS), Distributed Genome Database Browsing and Analysis Facility (DGDB), and Intelligent Multiagent Systems for Networked Scientific Computing (IMSN). MINIS explores the integration of computational intelligence methodologies and networked information. MURAC involves the realtime collection and processing of GEOS-8\/9 remote sensing satellite hyper-image data data for distributed access by researchers in weather, environmental and agribusiness joint projects. Class21 involves the construction of a learning environment to permit project oriented collaboration by students in a shared information space. CISS involves the access and manipulation of geospatial information in a collaborative environment by widely dispersed researchers. ISJS involves the development of software to support new forms of teaching and learning. DGDB provides a seamless integration of genome databases to facilitate access and analysis by biomedical researchers. IMSN involves the creation of a problem solving environment for scientific computing applications. With this high performance network capability, MU will expand current research and collaboration with both academic institutions and federal laboratories. Collaborating institutions for this project include: University of Illinois at Urbana-Champaign, NCSA, NAS A Goddard, NASA Ames, JPL, Washington University-St. Louis, Monsanto Corporation, Ohio State University, Pittsburgh Supercomputer Center, San Diego Supercomputer Center, National Institutes of Health, and Purdue University.","title":"A vBNS Connection for the University of Missouri- Columbia","awardID":"9720668","effectiveDate":"1998-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"Y316","name":"NASA-THREE NEW RES SITES FOR H"}}],"PIcoPI":["530617","309750"],"PO":["182196"]},"26712":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in molecular modeling, modeling physical systems, network security, computational electromagnetics, geographic information systems and global positioning systems. Collaborating institutions include the University of Washington, University of Oregon, Oregon State University, Rensselaer Polytechnic University and the California Institute of Technology.","title":"A High Performance Connection for the University of Idaho","awardID":"9729710","effectiveDate":"1998-03-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["331322","331322","550050","559300","169584",67262],"PO":["198445"]},"26723":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an OC-3 connection to enhance and accommodate research needs for Drexel University by establishing a connection to the Very High Performance Backbone Network Service (vBNS). The award, coupled with existing vBNS initiatives at the University of Pennsylvania, will leverage resources and facilitate research in the greater-Philadelphia region. Projects in this proposal include: GRAPE-6 (research into areas of star cluster dynamics and stellar dynamical simulations), Sources of Gravitational Radiation, Numerical Modeling, Computational Astrophysics, DMS chemistry in the marine atmosphere, Aerosol Characterization Experiment, Pacific Exploratory Mission, Advanced Cluster Computing, and the Hospital University Business School (HUBS) initiative. With this high performance network capability Drexel University will expand current research and collaboration with both academic institutions and federal laboratories. Collaborating institutions on this project, include: Princeton University, University of Tokyo, University of Maryland, NCSA, JPL\/Caltech, University of Texas at Austin, Syracuse University, LSU, SDSC, NASA\/Goddard, University of Chicago, Argonne National Laboratory, Rensselear Polytechnic Institute, University of Arizona, and the Office of Naval Research.","title":"Drexel University Access to vBNS","awardID":"9729732","effectiveDate":"1998-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67289,67290,67291],"PO":["198445"]},"27505":{"abstract":"9732062 Antonio Arroyo University of Florida REU: Undergraduate Research Experience in Design and Construction of Autonomous Robots and Machine Learning This Research Experiences for Undergraduates (REU) Site project supports eleven students per year in programs carried out during the summers and academic years, for three years. The students will work on projects involving the design and construction of autonomous robots and machine learning. After building their own robot, the students will study, develop, and test machine learning algorithms by implementing them in their own enhanced autonomous agent. Student participants are recruited from institutions throughout the Southeast and Southwest with particular effort directed at students from several of the HBCUs in the area. REU participants will be able to maintain a web page on the project web site for a period of two years on which to post new developments on their platforms, after the actual REU session is over.","title":"REU: Undergraduate Research Experience in Design and Construction of Autonomous Robots and Machine Learning","awardID":"9732062","effectiveDate":"1998-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[69369,"268906"],"PO":["69811"]},"27968":{"abstract":"ATM and next generation IP networks will provide the fundamental building blocks for integrated services networks: the ability to reserve network resources on behalf of bursty real-time applications. However, provisioning network resources accurately is quite challenging in the real-world environment characterized by heterogeneous and highly bursty traffic streams which exhibit rate variations over multiple time scales. The goal of this research is to design accurate and robust admission control and resource management algorithms that scale to large internetworks. In particular, we plan to study the following three problems. First, in a shared public network, applications cannot be trusted to adhere to their specified traffic parameters and therefore must be policed. However, deterministic policing must not preclude statistical resource sharing, which is essential for efficient resource utilization. We are designing an accurate envelope-based resource allocation algorithm that enables the network to statistically multiplex traffic streams while simultaneously enforcing applications' specified traffic parameters. Second, many applications will be unable to specify their traffic parameters in advance so that the network must somehow reserve resources even for applications with unknown resource requirements. We are developing a measurement-based service that adaptively measures the envelope of the aggregate traffic flow to predict future resource requirements and performance parameters for such ill-characterized applications. Finally, internetworks are characterized by a large number of heterogeneous components so that a resource management scheme must scale to such realistic environments. We are devising end-to-end resource management techniques that exploit coarse-grained representation and allocation of network resources.","title":"CAREER: Accurate and Robust Admission Control in Integrated Services Networks","awardID":"9733610","effectiveDate":"1998-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["548310"],"PO":["194325"]},"26725":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for DS-3 connections for George Washington University and Georgetown University. Applications include automobile crash analysis, nuclear studies, molecular modeling, and medical ultrasound. Collaborating institutions include the Thomas Jefferson National Accelerator Facility, Brookhaven National Laboratory, National Center for Supercomputing Applications, Boston University and the Center for the Oceans, Land and Atmosphere.","title":"Washington Research and Education Network","awardID":"9729736","effectiveDate":"1998-03-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67296,"515407","310447","559162",67300,67301],"PO":["198445"]},"26649":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for DS-3 connections for three institutions to a California statewide network and then to the vBNS. The three institutions are California State University, San Bernardino; California State Polytechnic University, Pomona; and San Diego State University. Applications include biomedical and bioinformatics use of fractals, remote data acquisition and control research, distributed computing, and seismic research. Collaborating institutions include the National Center for Supercomputing Applications, University of Pennsylvania, University of Texas, University of Wisconsin and Rice University.","title":"CalREN-2: The Calfornia Research and Education Network- Phase 2","awardID":"9729574","effectiveDate":"1998-03-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67079,67080,"235075","438068","328887","538973","385273"],"PO":["121202"]},"30731":{"abstract":"This workshop addresses the question of how to create a collaborative digital library, to disseminate scientific data to a wider audience than those who created the data: from local, national, or global collaboration or the entire Internet. We bring together case studies (from physics, astronomy and biology), with those offering enabling technology, and other information scientists. Topics of the workshop include metadata formats, databases, graphical user interface (GUI) software, and data exploration software; how a new user can quickly and easily learn to use the library; how the new user can reuse interaction paradigms learned elsewhere; how to provide a mechanism for users to annotate the library and create new metadata. Another main thrust of the workshop is the provision of high-performance computing that is connected at high bandwidth to the data archive, to provide filtering and data mining services. The output from the workshop is a well-disseminated report of its conclusions, accessible via Internet, and published in digest form in a peer-reviewed journal. This workshop will offer approaches that can provide or improve access to scientific data to a wide variety or users, ranging from scientists, business and policy decision makers, general public to schoolchildren.","title":"Workshop on Interfaces to Scientific Archives","awardID":"9803760","effectiveDate":"1998-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y494","name":"NASA-DIGITAL LIBRARAIES RESEAR"}}],"PIcoPI":["408897"],"PO":["563751"]},"24769":{"abstract":"This three-year award supports US-France cooperative research aimed at the development of new visualization techniques for the interactive manipulation of urban data. Efficient visualization of 3D urban scenes is important for a number of applications, such as the evaluation of construction and renovation projects, civil and military simulators, navigation helpers for automobiles, virtual tourism and education, climate and environmental studies, and city development planning. The project involves the research groups of Julie Dorsey of the Massachusetts Institute for Technology and Francois Sillion of the French National Institute for Research in Informatics and Applied Mathematics (INRIA), Grenoble, and will support exchanges of researchers and graduate students. The US investigator brings to this collaboration expertise in architectural visualization, lighting simulation and design for very large datasets, image based rendering, and urban modeling. This is complemented by the French investigator's expertise in hierarchical modeling and rendering, efficient data structures for geometric reasoning and visibility studies, advanced lighting simulation and high performance visualization using mixed image-based and 3D-based rendering. \/% ????Á¢¢Á¢ ¿> ¥©?¢ ?Á¢Á\/??© >Á? ??_???>?¢ ?> ¥©?¢ Â\/_?%` ??%% ?Á ??Á?\/?Á? ?> ???Á? ¥? Á?¥Á>? ¥©Á ?¢ÁÂ?%>Á¢¢ ?Â ¥©?¢ ?>Á??Á>¢??Á ?%\/¢¢ ?Â _\/¥Á??\/%¢","title":"U.S.-France (INRIA) Cooperative Research: High-Performance Visualization of Urban Scenes","awardID":"9724005","effectiveDate":"1998-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["548698"],"PO":["323582"]},"23901":{"abstract":"Under flash-crowd conditions, where congestion arises near the server because a large number of users wish to retrieve files from it over a short period of time, users are in a unique position to benefit enormously from each other by sharing retrieved files. Pseudo-serving, a new paradigm for Internet access, provides incentives for users to contribute to the speedy dissemination of server files through a contract set by a super-server. Under this contract, the super-server grants a user a referral to where a copy of the requested file may be retrieved in exchange for her assurance to serve other users for a specified period of time. In this proposed project, we will investigate issues that must be resolved in order to make pseudo-serving an effective tool for dissipating flash-crowds on the Internet. This includes issues related to the acceptability of the contract to the user, the ability of the super-server to set contracts that account for the physical distribution of sources of the requests, security issues and various approaches in dealing with contract breaches, and strategies for integrating pseudo-serving into various caching policies. The outcome of this research will help the World Wide Web to scale more gracefully and provide a mechanism through which users can barter their local resources for preferential access to information from busy servers.","title":"Complimenting Internet Caching With Pseudo-Serving to Mitigate Network Congestion","awardID":"9714668","effectiveDate":"1998-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["541428",60054],"PO":["234222"]},"33515":{"abstract":"The NSF Information and Data Management Program Workshop, held in Washington, D.C. on March 29-31, 1998, has the objective to bring together the researchers currently funded by the Information and Data Management Program (IDM) of the National Science Foundation, along with selected industry and government invitees in order to cooperatively (1) identify the problems that are fundamental in making progress towards the integrated management of data and information; (2) specify areas where major breakthroughs appear possible; and (3) identify research infrastructures needed to meet current and future challenges. This workshop aims at enabling communication and future collaboration among researchers from the different communities involved in the IDM, including database research, information retrieval, multi-modal information management, and distributed (networked or wireless) heterogeneous (palmtop through mass storage) systems. Further, the workshop provides an opportunity to examine the current research efforts and to learn more about successes of the researchers funded by the IDM program. The workshop proceedings will include reports on all projects funded by IDM during the fiscal year 1997. The findings of the workshop will be presented in a report that will help in formulating future directions of research in information and data management and will suggest promising modalities of research in academia and industry with an aim to foster innovation as well as technology transfer. The workshop material will be widely disseminated in both hard copy and electronic form on the IDM Web site, in order to inform wide audience about the IDM program successes and future research directions.","title":"1998 NSF Information and Data Management Program Workshop: Research Agenda for the 21st Century","awardID":"9812229","effectiveDate":"1998-03-15","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["532922"],"PO":["563751"]},"26717":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in climate modeling, networking and computer science, mathematics, biophysics, medicine, engineering and astrophysics. Collaborating institutions include Cornell University, Brown University, University of Wisconsin, University of North Carolina, Scripps Institution of Oceanography, NCAR, University of Texas at El Paso, University of Maryland, and the University of Illinois.","title":"vBNS Connectivity for Purdue University","awardID":"9729721","effectiveDate":"1998-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["558285","459585","526006"],"PO":["121202"]},"33516":{"abstract":"The NSF Information and Data Management Program Workshop, held in Washington, D.C. on March 29-31, 1998, has the objective to bring together the researchers currently funded by the Information and Data Management Program (IDM) of the National Science Foundation, along with selected industry and government invitees in order to cooperatively (1) identify the problems that are fundamental in making progress towards the integrated management of data and information; (2) specify areas where major breakthroughs appear possible; and (3) identify research infrastructures needed to meet current and future challenges. This workshop aims at enabling communication and future collaboration among researchers from the different communities involved in the IDM, including database research, information retrieval, multi-modal information management, and distributed (networked or wireless) heterogeneous (palmtop through mass storage) systems. Further, the workshop provides an opportunity to examine the current research efforts and to learn more about successes of the researchers funded by the IDM program. The workshop proceedings will include reports on all projects funded by IDM during the fiscal year 1997. The findings of the workshop will be presented in a report that will help in formulating future directions of research in information and data management and will suggest promising modalities of research in academia and industry with an aim to foster innovation as well as technology transfer. The workshop material will be widely disseminated in both hard copy and electronic form on the IDM Web site, in order to inform wide audience about the IDM program successes and future research directions.","title":"1998 NSF Information and Data Management Program Workshop: Research Agenda for the 21st Century","awardID":"9812230","effectiveDate":"1998-03-15","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["334101"],"PO":["563751"]},"26729":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include projects in astronomy, networking research, economics, intelligent network-based tutoring, genetics, distributed mulitmedia information retrieval, remote sensing and aerial image understanding. Collaborating institutions include the Jet Propulsion Laboratory, Carnegie-Mellon, Washington University, SUNY, University of Wyoming, University of Oklahoma, Johns Hopkins University, Naval Research Laboratory and Pennsylvania State University.","title":"A High Performance Connection for Research and Education","awardID":"9729749","effectiveDate":"1998-03-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["499259","530807","533875",67313],"PO":["198445"]},"31923":{"abstract":"International Workshop on Accurate Solution of Eigenvalue Problems, July 20--23, 1998, Pennsylvania State University, University Park, PA. The purpose of this workshop is to bring together experts for reviewing current research and discussing future research directions concerning accuracy issues in the numerical solution of eigenvalue problems. The workshop will provide an opportunity for exchange of ideas to researchers investigating eigenvalue problems for structured matrices and those investigating pseudo- eigenvalues for nonsymmetric matrices.","title":"International Workshop on accurate Solution of Eigenvalue Problems, July 20-23, l998, Penn Stater Conference Center Hotel, University Park, PA","awardID":"9807742","effectiveDate":"1998-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485393"],"PO":["187585"]},"31956":{"abstract":"A one day meeting, called the East Coast Computer Algebra Day (ECCAD), will be held at the US Naval Academy, Annapolis, Maryland, on April 25, 1998. This series of meetings has become a regular event for the region, with different academic and industrial institutions hosting the meeting in rotation. The purpose of this meeting is to stimulate interest in and enhance understanding of the technical aspects of computer algebra, by providing a way for those in the region who are active or interested in becoming more active in computer algebra to meet with each other in an inexpensive and easily accessible way. This meeting is more informal than the annual ISSAC meetings, with ample time for unstructured interaction. Participation by the region's graduate students is particularly encouraged through special invitation to contribute to the poster sessions, and through travel support. Three invited lectures will anchor the meeting and will help attract participants. The invited talks and poster sessions contributed by the community will cover the breadth of computer algebra: algorithms, software, and applications.","title":"East Coast Computer Algebra Day, April 25, l998, U.S. Naval Academy, Annapolis, MD","awardID":"9807850","effectiveDate":"1998-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[80495,"563334"],"PO":["187585"]},"23915":{"abstract":"Project Homepage: http:\/\/www.cs.purdue.edu\/homes\/park\/nsf-ncr-9714707.html Abstract: Recent measurements of local area and wide area traffic have shown that network traffic is self-similar or fractal, i.e., the measured time series is bursty across several time scales. This phenomenon has been shown to be ubiquitous with potentially dire consequences to network performance due to the scale-invariant nature of burstiness. This project investigates effective traffic control algorithms, architectures, and mechanisms for facilitating efficient resource utilization while providing quality of service to real-time and best-effort traffic streams under self-similar traffic conditions. The project builds on recent work which characterizes the causal aspects of traffic self-similarity and shows that scale-invariant burstiness can be highly detrimental to network performance. In a nutshell, it is shown that self-similarity of traffic flow is an intrinsic property of networked client\/server systems which communicate files or objects of very large size with nonnegligible frequency. The latter is known, technically, as the heavy-tailed property of file or object size distributions which is evidenced in actual distributed systems including UNIX file systems. On the performance side, it is shown that conjoint provision of low delay and high throughput is adversely affected by self-similarity. We follow a three-pronged method of attack for managing self-similar traffic, the first two based on dynamic control of traffic flow, and the third being of a structural nature where resources are architected and apportioned under direct control. The first method, predictive feedback control, is geared toward exploiting the long-range correlation structure present in self-similar traffic for congestion control purposes. We identify the on-set of concentrated periods of either high or low traffic activity - a distinguishing characteristic of scale-invaria nt burstiness - and adjust the mode of congestion control appropriately from conservative to aggressive. Being able to predict the onset of persistent congestion or idleness from fine time scale observations and utilizing this information effectively are two key issues. The second method, adaptive forward error correction, is directed at supporting multimedia traffic with real-time constraints without engaging in expensive resource reservations. Retransmission of lost information is not a viable strategy for such traffic classes since lengthy round-trip latencies encountered in wide area network environments render retransmitted information useless to time-constrained applications. We formulate and analyze an adaptive packet-level forward error correction mechanism called AFEC where the degree of redundancy is controlled as a function of network state, increasing the level of redundancy when the network is bad and decreasing it when the network is well-behaved. The control problem is nontrivial due to the fact that increasing the level of redundancy too much can backfire, further aggrevating congestion and causing the probability of timely information recovery at the receiver to decrease. We investigate the conditions under which adaptive forward error correction is effective when traffic is self-similar. We identify two regimes - packet loss dominated connections and delay-dominated connections - the former being most conducive to AFEC-based traffic control whereas the latter is more subtle, admitting only a limited range of useful redundancy. The third method, structural resource allocation, seeks to identify the relative utility of the two principal network resource types - bandwidth and buffer capacity - with respect to their curtailing effects on self-similarity. We conjecture a highly skewed trade-off relationship between bandwidth and buffer capacity in favor of bandwidth whose quantitative form becomes important when computing res ource reservations for traffic streams with stringent quality of service requirements. A bandwidth-over-buffer capacity policy also impacts the first two methods in terms of predictability and packet loss dominatedness\/delay dominatedness. The three methods are expected to complement each other, each focusing on a different mode for quality of service provision under self-similar traffic conditions.","title":"Self-Similar Network Traffic and It's Control","awardID":"9714707","effectiveDate":"1998-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["409715"],"PO":["234222"]}}