{"91734":{"abstract":"This project establishes an REU site in computer graphics and visualization at the University of Rhode Island. A variety of multidisciplinary projects have been identified for the interns, including fundamental graphics research or research in support of a variety of applications to include graphical design, transportation, education, and bioinformatics. The internships are designed for both summer and academic year appointments, and the interns may participate in research projects in three locations: the labs at URI, the not-for-profit imedia organization, and the Frauenhofer Institute of Computer Graphics in Germany. <br\/><br\/>This project will aggressively recruit women and underrepresented minority participants from a number of identified institutions around Rhode Island. The three participating organizations will provide rare opportunities to Rhode Island undergraduates to conduct research in resource-rich environments. Interns choosing to conduct part of their research in Germany will be exposed to international collaborations and one of Europe's premiere research organizations. The projects offered should be of great interest to undergraduates and therefore should help encourage them to pursue careers in computer science.","title":"REU Site: RE for yoU, An REU Site for Graphics Research in Rhode Island","awardID":"0353786","effectiveDate":"2004-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":["528329","361119"],"PO":["381214"]},"90437":{"abstract":"ABSTRACT<br\/>PROPOSAL: 0347776<br\/>INSTITUTION: MIT<br\/>PRINCIPAL INVESTIGATOR: Demaine, Erik D.<br\/>TITLE: CAREER: Fundamental Research in Geometric Folding<br\/><br\/>CAREER: Fundamental Research in Geometric Folding<br\/><br\/>Folding and unfolding is an emerging field of computational geometry studying the continuous motion and reconfiguration of geometric objects such as linkages, paper, and polyhedra and their physical manifestations such as proteins, packaging, and sheet metal. Folding problems arise in surprisingly many contexts, ranging from pure computational geometry to ad-hoc wireless networks to protein folding. This research aims to build a basic theory of geometric folding and, as this theory develops, to explore potential applications throughout science and engineering. Potential applications include air-bag design, space deployment, and drug design.<br\/><br\/>This research addresses several fundamental unsolved problems in geometric folding. How can one efficiently compute motions that reconfigure a planar chain linkage between any two desired configurations? Do such motions always exist for 3D chain linkages whose edge lengths are all equal? Which configurations of proteins (viewed as a 3D chain linkage) can be biosynthesized by a ribosome? How efficiently can one-design proteins in the hydrophobic-hydrophilic model that fold stably into a desired shape? How efficiently can wireless beacons locate themselves in a global geometry given just local information about their neighbors? How efficiently can be design optimal foldings of paper into desired shapes? How many pieces must a polyhedron be cut into to unfold without overlap? In addition to solving problems such as these, the investigator is coauthoring a book about folding and is pursuing education of folding both as an interesting area in its own right and as a vehicle for presenting material in other areas.","title":"CAREER: Fundamental Research in Geometric Folding","awardID":"0347776","effectiveDate":"2004-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["527736"],"PO":["565157"]},"90427":{"abstract":"This project represents a multiple year effort to develop a theoretical and practical framework for the design and analysis of scalable ad hoc networks. The research focuses on cross-layer interactions and fundamental limitations. The research objectives are to develop rigorous approaches for determining bounds on systems performance and to develop algorithms to optimize achievable capacity and perform robust admission control for QoS traffic based on the novel cross-layer concept of deferral-sets. These goals are based on the critical need for a theoretical basis for consistent design and evaluation methodologies that reflect fundamental system invariants and the impact of mobility, media access control and cross-layer interaction. Novel inter-layer services will be developed that may be used to provide statistical QoS guarantees. By demonstrating the ability to provide statistically bounded service guarantees, the proposed investigation has the potential to change the perception of ad hoc networking in fundamental ways and thus increase the scope of both basic research and applications involving these networks. This effort will have impact beyond the area of wireless networks. Successful large-scale deployments of any network, not only ad hoc networks, will naturally spur the development of novel applications. For example, the global Internet has revolutionized the way mankind conducts business, disseminates knowledge, teaches courses, and runs governments in less than three decades. In addition, this effort will provide undergraduate students with new opportunities to participate in research oriented projects that focus on the critical areas under investigation in this project.","title":"CAREER: Cross-Layer Optimization for Robust Admission Control in Wireless Ad Hoc Networks: A Theoretical Framework","awardID":"0347698","effectiveDate":"2004-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[237118],"PO":["565090"]},"91758":{"abstract":"This project establishes an REU site at Towson University in several fields of computer science, including operating systems, applied cryptography, real-world algorithms, network security, wireless networks, intelligent agents, cognitive robotics, and computer vision. Although the proposed student projects are in a number of computer science specialties, security is a strong theme at this site. <br\/><br\/>This REU site will engage 8 interns per summer in the on-going NSF and industry sponsored research of the PI and faculty mentors at Towson University. In addition to the formal research projects, the site will host a series of lectures by scientists from University of Maryland, NASA, Johns Hopkins, NIST, etc., and it will sponsor field trips to nearby academic, governmental, and industrial laboratories. The summer program will provide special training on applying for graduate school, and will coach students on taking the Graduate Record Examination (GRE). A highlight of this site will be a 2-day ethics unit.","title":"REU Site: CS Undergraduate Research at Towson University","awardID":"0353868","effectiveDate":"2004-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}}],"PIcoPI":[240399,240400,240401,"450591",240403],"PO":["381214"]},"90219":{"abstract":"The proposed research will investigate how to build intuitive systems that manage the complexity of mobile computing. The approach, self-tuning parameter translation, inserts a software translation layer above the mobile system - this layer exposes only a small number of meaningful, well-calibrated parameters to the user. By drawing from a toolbox of techniques that includes on-line modeling of application workloads, off-line benchmarking, adaptation, feedback, application hints, and cost-benefit analysis. This layer transforms user input provided through the simple intuitive interface into policies that continuously tune the complex set of parameters exposed by the underlying mobile system.<br\/><br\/>Two case studies are planned to demonstrate the feasibility of this technique. First, a translation layer will be build that provides self-tuning power management for mobile computing systems. Second a layer will be built that guides the migration of mobile services. A mobile service is the resource-demanding, remote component of a partitioned, latency-sensitive application - it migrates between servers in response to user mobility in order to maintain high-bandwidth, low-latency connectivity to the client. A toolbox of reusable components that can be shared across translation layers will be developed, as well as a methodology that provides guidance about when to use each component.","title":"CAREER: Building Intuitive Mobile Systems with Self-Tuning Parameter Translation","awardID":"0346686","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["521047"],"PO":["557315"]},"90407":{"abstract":"This research aims to develop a comprehensive structured video representation via advanced statistical modeling approaches. The goal of research is to enhance interpretability and manipulability of visual data, leading to effective visual communications and innovative multimedia applications. The approach consists of four major research components: (1) joint frame and object video segmentation that applies advanced statistical clustering methods; (2) object-oriented structured video representation that integrates extended HMMs and is able to capture important structures in space and time; (3) the application in visual communications; (4) the application in the MPEG-7 Multimedia standard. This research addresses fundamental issues in visual information processing, with widespread applications in diverse areas, including multimedia, digital library, security surveillance, entertainment, biomedical imaging, and human-computer interface, etc. Moreover, the proposed research has significant contribution to industry standards (MPEG-7). The results of the project will be disseminated by scientific papers, software, online demos, and prototype video databases, which can be accessed from the project's website http:\/\/www.vcipl.okstate.edu.<br\/><br\/>The education al component includes the development of a unique Multidisciplinary Imaging Science & Technology Program (MISTP). The MISTP will provide students, particularly, minority and women students, with practical, ``hands-on'', research and experimental skills to help them succeed in a culturally diverse, cross-disciplinary research and work environment. The MISTP will impact students at all levels in multiple Science and Engineering disciplines. Dissemination of educational components will be implemented in a web-based format and by more traditional means. Program descriptions and educational materials will be distributed in professional conferences and made publicly available.","title":"CAREER: Advanced Statistical Modeling Approaches for Structured Video Representation and Research Oriented Multidisciplinary Education","awardID":"0347613","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[237076],"PO":["564316"]},"90408":{"abstract":"Wireless sensor networks promise a revolution in information technology, by providing a high-resolution interface between the physical and virtual worlds. This research project aims to create a mathematical foundation for analyzing and designing data gathering protocols in these systems.<br\/><br\/>This project develops mathematical models of sensor network applications, environmental conditions, and protocol parameters, in order to quantify and bound the performance of protocols with respect to key metrics such as energy efficiency and response latency. It complements other ongoing efforts in the research community to design and evaluate these protocols via simulations and experimental studies. The mathematical models of protocols developed in this project will provide wireless sensor network designers with practical guidelines and insights on selecting and optimizing protocols for different applications, and making them adaptive. Fundamental performance bounds will reveal whether there is room for improvement, and in some cases even suggest new efficient protocol designs.<br\/><br\/>The research is being carried out in close collaboration with wireless sensor network systems and applications researchers in academia and industry, to ensure that the analysis is informed by and has a significant impact on the design of real-world systems. Such wireless sensor networks are envisioned to be used in domains ranging widely from environmental, industrial and structural monitoring to security applications.<br\/><br\/>The research is tightly coupled with an educational program that includes integration of the research activities into the undergraduate graduate networks curriculum at the University of Southern California, as well as outreach to public high school students in Los Angeles.","title":"CAREER: Mathematical Models for Querying and Routing in Wireless Sensor Networks","awardID":"0347621","effectiveDate":"2004-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["531832"],"PO":["564777"]},"90309":{"abstract":"This project will investigate biologically-inspired methodologies and algorithms for several important problems in machine learning and AI: unsupervised feature learning, multi-modal integration of sensory data, and learning for real-time robotic systems with embedded sensors and actuators. The project will pursue both theoretical investigations of nonlinear properties of neurons and synapses and their role in processing of perceptual (visual, auditory, olfactory) stimuli, as well as the applications of such properties to the design of novel algorithms and architectures for processing of multi-modal perceptual stimuli. This research will integrate advances in the understanding of biological systems by building more advanced artificial sensorimotor systems. This project integrates research and an educational agenda that includes teaching and participation of students from the broader community in activities related to the overall goals of this research.","title":"CAREER: Biologically Inspired Learning Algorithms for Artificial Sensorimotor Systems","awardID":"0347132","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["553287"],"PO":["429182"]},"100208":{"abstract":"Type 2 diabetes is epidemic in the native populations, Navajo and Hopi, in Northern Arizona. Through this proposal a partnership would be developed with the community, the local Indian Health Services, and Northern Arizona University researchers to address this problem through the use IT. This proposal would explore the collection an integration of various data from medical devices such as glucometers, provision of information using wireless devices and PDAs, test various user interface concepts, and identify multicultural barriers.","title":"Information and Communications Technology (ICT)-Accessible Healthcare in Tribal Communities","awardID":"0443599","effectiveDate":"2004-06-29","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["358205"],"PO":["371077"]},"99050":{"abstract":"The workshop will consist of over ten sessions organized by prominent researchers who will focus on their own application areas including computer aided geometric design, geometric modeling and computation, robotics and kinematics, mechanics, high energy physics, economics and finance, theorem provers, types and specifications, differential equations, the symbolic numeric interface, education, engineering, science and applied mathematics. The researchers that are participating in this workshop are among the best in the world. The list of sessions is in the proposal. The workshop will be held in Beaumont, Texas.","title":"International Conference on Applications of Symbolic Computation (ACA-2004); July 21-23, 2004; Beaumont, TX","awardID":"0435826","effectiveDate":"2004-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["563805"],"PO":["321058"]},"99690":{"abstract":"CCR-0306372 and CCR-0306023<br\/>Collaborative Research: Scalable Integration Testing Object-Oriented Software: An Empirical Research Program<br\/>PIs: Mary Jean Harrold, Alessandro Orso, Gregg Rothermel<br\/><br\/>When object-oriented and component-based software systems are developed, they must be integration tested. Integration testing methods proposed to date for such systems, however, suffer from three limitations: they fail to consider system evolution, they fail to accommodate heterogeneous engineering models and sources of nformation, and they provide little or no empirical investigation or understanding of the factors influencing the testing effort. This research addresses these limitations. The initial objective of the work is to design and conduct families of experiments to compare the cost-benefits of existing techniques for integration testing applied to evolving object-oriented and component-based software, and evaluate the potential tradeoffs among those techniques. The results of these studies will guide the development of evolution-aware integration testing techniques, capable of accommodating heterogenous sources of testing information, and responding to the wide range of engineering models associated with object oriented and component-based software. By making experimental data, infrastructure, and new experimental methodologies available to the research community, the proposed work will enable scientific progress on the issues investigated to accelerate. By providing methodologies for testing this important class of software systems, the work will reduce the risks these systems present to society.","title":"Collaborative Research: Scalable Integration Testing of Object-Oriented Software: An Empirical Research Program","awardID":"0440452","effectiveDate":"2004-06-16","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["548132"],"PO":["564388"]},"97171":{"abstract":"The goal of this research is to investigate a global testing infrastructure to identify critical factors that reduce the time to product stability while improving the competitive position of developing organizations. Teams of graduate computer science students in Ireland and the United States will conduct operational testing on an industrial software system following several scenarios. They will compare various approaches of processing trouble reports and software updates to determine their impact on defects uncovered, the severity levels and types of defects, and the complexity of the modules in which the defects occurred. The faculty and industry personnel are all participants in the Software Engineering Research Center, and NSF Industry\/University Cooperative Research Center.","title":"Reducing the Time to Product Stability through Global Testing","awardID":"0423930","effectiveDate":"2004-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["522975","522976"],"PO":["565057"]},"98591":{"abstract":"The Information Technology Research (ITR) program is a unique, interdisciplinary program at the National Science Foundation (NSF). It is designed to fund innovative information technology research and education. To assess and learn from the experiences of the ITR program, two related phases of work are proposed. In the first phase, an ITR Principal Investigator (PI) meeting will be held. This meeting will foster an exchange of information and collaborative experiences among ITR PIs and NSF Program Officers to learn the outcomes of the ITR program. Detailed field notes will be collected from the ITR PI meeting. They will be analyzed systematically, and then applied to the next phase. In the second phase, the factors that lead to greater success in ITR projects will be analyzed. A survey will be created and objective data will be collected to evaluate quantitatively how different attributes of projects, such as geographic dispersion, number of disciplines and coordination strategies, effect the way that projects are conducted and research outcomes achieved. Projects will be assessed in comparison with NSF's GPRA goals to improve research knowledge, research infrastructure, scientific and engineering training and personnel, and society's use and understanding of science. The intellectual merit lies in the use of diverse metrics and systematic user-centered research design to assess interdisciplinary research programs, such as ITR. The broader impacts include advancing understanding and policy for successful interdisciplinary, distributed scientific work.","title":"Collaborative Research: ITR PI Meeting and Research Assessment","awardID":"0432638","effectiveDate":"2004-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["519226"],"PO":["564456"]},"90390":{"abstract":"ABSTRACT<br\/>PROPOSAL: 0347506<br\/>INSTITUTION: North Carolina State U<br\/>PRINCIPAL INVESTIGATOR: Szanto, Agnes <br\/>TITLE: CAREER: Solving Over-Constrained Systems of Non-Linear Equations by Symbolic-Numeric Methods<br\/><br\/>Non-linear, over-constrained systems of equations often arise in science and engineering where mathematical models are used for analysis. Such areas include: geo-physical phenomenon, computer graphics and vision, analysis of fluid and mechanical structures. Over-constrained equations are difficult to use, as there are no reliable and efficient methods for solving them. Traditional numerical and symbolic solution methods are not designed to handle either over-constrained systems or inexact coefficients. Thus, this research is exploring the theory, algorithms and software for solving systems of non-linear, over-constrained systems of equations. The goal is to lay the theoretical framework to extend both symbolic and numeric techniques to over-constrained equation systems. Special attention is paid to the integration of the research with graduate education through the development of course plans that give the required foundations for the students to participate in the proposed research. A wide range of application areas is being emphasized.<br\/><br\/>This research considers two types of systems: (1) Over-constrained systems of algebraic equations with inexact coefficients; and (2) Over-constrained systems of differential equations with symmetric solutions. The plan for investigation is:<br\/>Over-constrained systems of algebraic equations with inexact coefficients. First, a theoretical framework will be laid for reliable computation via meaningful and verifiable notions of solutions together with backward error and conditioning analysis. Next, effort will be made to substantially improve the complexity of existing symbolic-numeric methods by exploiting the possible small cardinality of the solution set. The goal is to devise an algorithm that is polynomial in the input plus the output size.<br\/>Over-constrained systems of differential equations with symmetric solutions: Recent results on moving frame methods allow to write a differential system in terms of the invariants of a symmetry group, and to design invariant numerical approximations via invariant finite difference equations. In order to apply these techniques on over-constrained differential systems, the investigator will extend algebraic elimination techniques to invariantized non-linear differential systems. However, the application of the invariant differential operators introduces non-commutativity in the associated differential algebra. The goal is to prove termination and give degree bounds for the elimination algorithms. These two problems are actually closely related and thus the investigator will also explore their deep interconnection with the goal of laying the mathematical bases of a unified approach.","title":"CAREER: Solving Over-Constrained Systems of Non-Linear Equations by Symbolic-Numeric Methods","awardID":"0347506","effectiveDate":"2004-06-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["517853"],"PO":["565251"]},"90380":{"abstract":"This proposal is to develop a unified approach in operating systems (Oss) for managing energy consumption. The goal is to make energy management completely automatic for all types of hardware components. This approach can be divided into three parts: (1) creating an interface for characterizing hardware components, (2) constructing energy models for supporting the Oss' run-time decisions, and (3) developing techniques to determine components' power states for managing energy.<br\/><br\/>Using Oss for energy management is still in its infancy. Timeout is a widely used (in most cases the only) solution in real-world Oss. Moreover, users have to set the lengths of the timeout. No operating systems can automatically find the appropriate timeout values based on the component's characteristics or the executed programs.<br\/><br\/>The first part of this proposal creates an interface for automatically characterizing components' power consumption. This hides the differences among components so that the Oss can manage the energy of all components in a uniform way. The second part of this proposal constructs energy models for estimating energy consumption; the models' coefficients can be automatically determined by using the proposed interface. The third part of this proposal develops techniques for determining components' power states. The OSs automatically select appropriate algorithms and set the algorithms' parameters. The parameters are calculated based on the components' characteristics. The algorithms change components' power states, for example by scaling down the performance of under-utilized components.<br\/><br\/>The education plan emphasizes system integration and helps students develop the skills to discover, define and solve complex problems. This plan includes three courses: (1) a graduate course on embedded systems, (2) an undergraduate course on computer organization, and (3) a graduate course on computer architectures. Under-represented minorities, disadvantaged students, women and undergraduate students will be recruited to participate in the research and education programs.","title":"CAREER: A Unified Approach for Energy Management by Operating Systems","awardID":"0347466","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["540778"],"PO":["535244"]},"90271":{"abstract":"CNS-0346939<br\/>CAREER: Language-based Distributed System Security<br\/>Stephan A. Zdancewic<br\/><br\/>Distributed systems are an increasingly crucial part of modern<br\/>computing infrastructure, yet the existing technology for ensuring<br\/>their security and reliability is lacking. This research addresses<br\/>the problem of building distributed systems and reasoning about their<br\/>security by developing programming languages that provide better<br\/>abstractions for describing security policies and communication<br\/>protocols. <br\/><br\/>The starting point for this project is existing work on security-typed<br\/>languages, which protect data confidentiality and integrity. This<br\/>research generalizes these information-flow policies to make them more<br\/>dynamic, enabling them to accommodate the changing environment in which<br\/>distributed systems run. For example, dynamic information-flow<br\/>policies should integrate cleanly with traditional authentication and<br\/>access control mechanisms to provide end-to-end guarantees about data<br\/>confidentiality.<br\/><br\/>The second stage of this project is to develop language technology<br\/>that applies dynamic security policies to distributed programs. The<br\/>idea for this part of the research is to develop a theoretical basis<br\/>for secure distributed computing using existing process calculi<br\/>augmented with a heterogeneous trust model and the policy language<br\/>outlined above. In this setting, types describe communication<br\/>protocols, properties of which can be verified statically by the<br\/>compiler. The result will be a programming language with a sound type<br\/>system that aids the programmer in writing correct, security-critical<br\/>distributed programs.","title":"CAREER: Language-based Distributed System Security","awardID":"0346939","effectiveDate":"2004-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["556654"],"PO":["521752"]},"90282":{"abstract":"ABSTRACT<br\/>0346982<br\/>CAREER: Programming Languages Techniques for Enhancing Software Quality<br\/>Jeffrey S. Foster<br\/>University of Maryland - College Park<br\/><br\/>The goal of this research is to develop tools and techniques for improving the quality of software, with a focus on methods that analyze source code. There are two main objectives. The first is to develop the equivalent of type systems for high-level designs in software. Currently, even with careful planning it is all too easy to<br\/>accidentally violate design invariants as software projects develop and thereby introduce errors into programs. Having an automatic system for checking the consistency of source code with the high-level<br\/>design decisions behind it will help programmers avoid these mistakes. The second objective of this research is to develop techniques for checking the correctness of programs written in multiple languages.<br\/>Current program analysis technology focuses on programs written in one language, yet modern software is often written in a mix of different languages. By developing analysis techniques that can span multiple<br\/>languages and check conditions at the interface between the languages, programmers will be given new tools to help them ensure that multi-language systems are correct. Ultimately, the results of this research are expected have long-term benefits in the improvement of software quality.","title":"CAREER: Programming Languages Techniques for Enhancing Software Quality","awardID":"0346982","effectiveDate":"2004-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["556281"],"PO":["564388"]},"90480":{"abstract":"The goal of this project is to build the scientific foundation for archiving the history and evolution of the Web: tracking changes of the Web, compactly storing multiple versions of Web pages, and providing the stored pages to users through an easy-to-access interface. This project comprises both experimental prototype construction and careful study of technical challenges. The experimental effort focuses on building a system that tracks and archives a large number of Web pages over a long period of time. The fundamental technical challenges that are investigated by this project include: (1) a novel mechanism to download pages from Web search interfaces; (2) an efficient way of predicting and detecting changed pages on the Web; (3) a compact representation for storing multiple versions of Web pages; and (4) a novel index structure to support keyword queries on multiple versions of Web pages. Success of this research will have broader impacts on the scientific community and the general public. It will provide a valuable testbed of Web history data that many humanity and engineering researchers can explore and analyze, enabling them to study the \"digital trace\" of human activity. The project Web site http:\/\/webarchive.cs.ucla.edu\/CAREER\/ will be used for broad results dissemination. <br\/><br\/>In addition, both graduate and undergraduate students are involved in this project, gaining invaluable research experience. The new findings and the software infrastructure from the project are incorporated into new graduate-level courses that are offered by the PI that will help students prepare for a successful career in the general field of computer science that increasingly requires solid understanding of large-scale data collection and management issues.","title":"CAREER: WebArchive -- Archiving the History of the Web","awardID":"0347993","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["316294"],"PO":["563751"]},"90284":{"abstract":"Many critical systems, including operating systems, embedded systems, and communications systems, are low-level. That is, they require careful control over hardware resources to implement needed functionality and to perform well. Low-level software is increasingly common, so it must be reliable and secure, but its increasing complexity makes doing so quite difficult.<br\/><br\/>This project is working to develop, implement, apply, and evaluate programming language technologies to ensure the security and reliability of low-level systems. The approach is to employ novel static analysis techniques, mostly novel type checking and inference systems, for automatically checking proper usage of idioms common to low-level software. These idioms include manual memory management, concurrency, and dynamic reconfiguration; their incorrect usage can lead to service failures, data corruption, and security exploits. For assessment, the new techniques are being incorporated into a new C-like programming language called Cyclone, which is then used to build or port real low-level software, including device drivers, network packet processors and servers, and embedded control software. These systems are experimentally compared against traditionally-developed systems to evaluate their flexibility, usability, and performance.<br\/><br\/>This work will result in new tools and methodologies for building more reliable and secure low-level systems. By validating these techniques on real low-level software, they will have strong relevance and impact. All results will be presented in public forums (conferences and journals) and as part of graduate and undergraduate education. All developed software will be freely available, and usable to non-experts in industry and education.","title":"CAREER: Programming Languages for Reliable and Secure Low-level Systems","awardID":"0346989","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["550282"],"PO":["564777"]},"94893":{"abstract":"This project has the goal of developing planner-generalization techniques that can be used to modify AI planning algorithms to remove some of the restrictive assumptions found in classical approaches to AI planning, such as: perfect knowledge about actions and objects and history of the planning environment, static planning environment, instantaneous actions, discrete time, determinism, black-and-white solution criteria. A starting point for the project will be the PI's preliminary results on a method to \"non-determinize\" forward-chaining planners. Using both theoretical and empirical techniques, the project will explore ways to systematically generalize planning algorithms to deal with nondeterminism, actions with probabilistic effects, and temporal issues. Results of the project will provide theoretical and experimental underpinnings necessary to enable AI planning to better address the needs of real-world planning applications such as manufacturing planning and ship movement planning. It is intended that implementations of algorithms developed in this project will be made available as open-source software.","title":"Pushing the Boundaries of AI Planning","awardID":"0412812","effectiveDate":"2004-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["508604"],"PO":["387198"]},"98875":{"abstract":"Proposal Number: 0434888<br\/><br\/>TITLE: Travel Support for Second Bertinoro Workshop on Future of Distributed Computing<br\/><br\/>PI: Lorenzo Alvisi<br\/><br\/>Abstract:<br\/>The workshop will focus on cross-pollination of research in distributed computing, fault-tolerance, and security with the goal of identifying the conceptual and practical foundations of a new generation of reliable and secure distributed systems. Invited talks from outstanding researchers will set the theme for the workshop, followed by reports of current research activities and directions. The workshop will involve students as well as researchers well-established in these fields. To encourage reporting of preliminary results without prejeducing their publication in established journals, no published proceedings are planned, but accepted position papers will be available on the Internet. The workshop is not expected to lead to specific new programs at NSF but rather to generate research collaborations that will be better able to respond to existing NSF programs and more generally to critical national needs in these areas","title":"Travel Support for Second Bertinoro Workshop on Future of Distributed Computing; June 23-25, 2004; Bertinoro, Italy","awardID":"0434888","effectiveDate":"2004-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["466840"],"PO":["521752"]},"96004":{"abstract":"Title: Scholarship and Travel Grants for the Grace Hopper Celebration of Women in Computing 2004<br\/><br\/>This Special Project award provides funding for approximately seventy-five undergraduate and graduate students to attend the 2004 Grace Hopper Celebration of Women in Computing. The fourth Grace Hopper Celebration will be held on October 6-9, 2004 in Chicago.<br\/><br\/>The intellectual merit of this project lies in the access to the many technical presentations and researchers at the conference. In addition, students have the opportunity to participate in poster sessions and receive feedback from discipline specialists. The Grace Hopper Celebration provides a unique, supportive environment for intellectual discourse that is particularly appealing for women and other under-represented groups. <br\/><br\/>The broader impacts of this project deal with providing resources and support to students that will help them persist in their programs as well as access to avenues to continue through the IT workforce pipeline. Students who attend the Grace Hopper Celebration will be exposed to women who are creating, improving, and studying computer and information technologies who serve as role models and mentors. This travel scholarship support provides a unique opportunity to directly affect the careers of future computer scientists and increase the representation of women in computing.","title":"CNS Special Projects: Scholarship and Travel Grants for the Grace Hopper Celebration of Women in Computing 2004; October 6-9, 2004; Chicago, IL","awardID":"0418340","effectiveDate":"2004-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["425926",251739,"529248"],"PO":["564181"]},"98688":{"abstract":"Proposal to NSF CPA Cluster for Supporting Student Travel to the 2nd ACM\/IEEE <br\/>International Conference on Methods & Models for Co-Design (MEMOCODE.04) <br\/> <br\/><br\/>As computing systems are becoming increasingly complex, integrated to daily usable <br\/>artifacts such as cell phones, cars, hand-held devices, medical prosthetics and other wide <br\/>range of applications, the need for design methodologies which can guarantee successful <br\/>integration of hardware and software, functional correctness and reliability is gaining <br\/>importance. Today.s computing is no longer limited to servers, work stations and desktop <br\/>computing, but they are embedded everywhere, most importantly in the medical space, as <br\/>well as in the safety critical systems such as avionics control, automotive control etc. <br\/>However, historically hardware and software have been built separately, and both being <br\/>extremely complex, the methodologies that ensure correct construction of hardware or <br\/>software are themselves research topics. Yet, we are faced with the need for formal and <br\/>mathematical techniques to model and analyze systems which integrate both hardware <br\/>and software, because of the increasing reliance of human society on ubiquitous and <br\/>pervasive computing. <br\/> <br\/>In 2003 the First International ACM\/IEEE Formal Methods and Models for Co-Design <br\/>(MEMOCODE) conference, for the first time, brought together researchers who apply <br\/>formal methods in software engineering fields, and those who apply formal methods to <br\/>design and validate hardware systems. It was felt from the panel discussions, key note <br\/>talks, and informal discussions that formal method practitioners from both sides have a <br\/>lot of share in terms of knowledge, experience and techniques. Also, the hardware-<br\/>software co-design problem imposes an ever than before need for this symbiosis, which <br\/>was the original aims of creating this series of conferences. More importantly, the US <br\/>researchers present at the conference last year (in France), felt that there is a lack of <br\/>research activity in this important area of formal methods in the US, compared to the <br\/>initiatives and research activities in Europe. As a result, this year the conference is being <br\/>held in San Diego, California, to bring more US participants, and create a forum for US <br\/>researchers to exchange formal method ideas, techniques and creative initiatives. This <br\/>proposal seeks financial support from NSF to support US graduate or advanced <br\/>undergraduate students attending the conference for the first time, so that they get <br\/>exposure to various aspects of formal methods, and recognize the importance of formal <br\/>methods in system design, especially hardware\/software safety critical systems. The <br\/>intellectual impact of this support from NSF would be that the increased attendance of <br\/>bright young students will fuel more research work in this very important area. The <br\/>European community has made much more progress than their counter parts in the US <br\/>due to a much less degree of interest by researchers to pursue formal methods. NSF can <br\/>make substantial contribution to the enrichment of educational and research objectives of <br\/>MEMOCODE. The workshop has some funding from sources other than NSF for invited <br\/>speakers and other expenses. Broader Impact of the requested NSF funding is that it <br\/>will provide travel support for students of US researchers, to encourage education and <br\/>research in the workshop topic. The emphasis will be on funding students who do not <br\/>otherwise have funding sources to attend the conference, and an attempt will be made to <br\/>fund members of underrepresented groups.","title":"CPA: Conference Support Proposal: 2nd ACM\/IEEE International Conference on Formal Methods and Models for Co-Design","awardID":"0433776","effectiveDate":"2004-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["384407"],"PO":["564388"]},"94970":{"abstract":"This project addresses an aspect of problem solving that is key for both machines and humans: reasoning by analogy with relevant precedents. The goal of the proposed research is a computational model of precedent-based analogical reasoning using a simple but expressive and cognitively plausible suite of representations that capture knowledge about entities, classes, causes, values, and motion along real and abstract trajectories. The project's target domain is political science, where in areas such as intelligence analysis, international relations, and government policy, experts use this type of case-based reasoning to analyze, assess, and make recommendations about new situations based on relevant past experience. The project, which builds on analogy research begun in the NSF-sponsored Bridge System, will make use of collections of well-documented political scenarios and analogies that have been analyzed by experts. While this project focuses primarily on development of a computational theory about reasoning by analogy from experience, a prototype tool will be built that is intended to assist analysts charged with evaluating courses of action by addressing an important aspect of analytical expertise: the ability to detect unintended consequences with precedential reasoning. This \"blunder stopper\" component of the prototype will monitor situations and proposed actions, match these against a data base of precedents, and, if appropriate, advise the analyst to examine a relevant precedent for possibilities suggested by the precedent that might otherwise be overlooked. In addressing a problem of interest to both computer science and social science, this project will contribute to theories of precedent-based reasoning in general, and course of action analysis in political science in particular.","title":"Representationally Complete Analogical - Reasoning Systems and Steps Toward Their Application in Political Science","awardID":"0413206","effectiveDate":"2004-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["536919"],"PO":["387198"]},"96357":{"abstract":"Title: Gender HCI Issues in Problem-Solving Software<br\/><br\/>This project investigates the role software plays in supporting or inhibiting the participation of women in information technology. The project involves empirical studies on research questions about the impacts of gender differences in confidence, of gender-conscious support mechanisms, of gender differences in motivation, and of collaboration opportunities by males and females using problem solving software. The investigators plan to produce guidelines to help designers of problem-based software environments make design decisions that account for gender differences.<br\/><br\/>The intellectual merit of this project lies in the potential contribution to human computer interface research. The topic of gender barriers in software design merits significant study. The project has thus has the potential to make a significant contribution to human computer interface and software design research as well as to provide insight into the barriers and possible solutions to the under-representation issues in information technology.<br\/><br\/>The project promotes broader impacts in several ways. The investigation team is composed primarily of females and three female high school students are involved in the research, which may encourage more female participation in information technology. The investigators plan to translate the empirical results of the study into a set of model-based guidelines to be widely distributed to software developers. If implemented, the resulting software could be instrumental in removing software-related gender differences that will result in broader participation in information technology careers by females.","title":"ITWF: Gender HCI Issues in Problem-Solving Software","awardID":"0420533","effectiveDate":"2004-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["548135"],"PO":["564181"]},"93762":{"abstract":"PROPOSAL NUMBER.: 0407218<br\/>INSTITUTION: University of Arkansas<br\/>NSF PROGRAM: NANOTECHNOLOGY UNDERGRAD EDUCATION (NUE)<br\/>PRINCIPAL INVESTIGATOR: Deaton, Russell J.<br\/>PROPOSAL TITLE: NUE: Integrating nanoscale science and technology into introductory computer science courses<br\/><br\/>Abstract:<br\/>In this project, by writing programs in their first two courses that simulate important molecular properties, freshmen Computer Science students are introduced to emerging technology in Nano-scale Science and Engineering. In the first course, students write programs that design DNA molecules for forming structures and doing computations. In addition, the biological role of DNA in the cell is introduced and reinforced through programming work. In the second course, students will learn about quantum computation by simulating the random placement of nano-scale dots. In both courses, fundamental Computer Science knowledge is related to research questions in nanotechnology, and the interdisciplinary nature of the research is emphasized. The main goal of the project is to get students interested in nano-scale research early in their college careers, and to have the students participate in research through their classroom experiences. The course material developed will be publicly available for use by other institutions through the Internet and CD-ROM. <br\/><br\/>The proposal for this award was received in response to the Nano-scale Science and Engineering Education announcement, NSF 03-044, category NUE.","title":"NUE: Integrating Nanoscale Science and Technology into Introductory Computer Science Courses","awardID":"0407218","effectiveDate":"2004-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7219","name":"NANOTECHNOLOGY UNDERGRAD EDUCA"}}],"PIcoPI":["548478","488979","524863"],"PO":["562984"]},"90276":{"abstract":"The main research objective of this proposal is to develop a formal theory of distributed ontologies for use on the Semantic Web. The theory defines the semantics of relationships that can exist between ontologies and those that can exist between ontologies and information resources. The theory will be developed in phases: a model theoretic semantics with different entailment relations for each point of view will be followed by a possible world semantics that unifies the various entailment relations. It will then be extended to allow for rich expressions of trust. Scalability, an important issue for the Semantic Web, will be a significant consideration in the design of the theory. Results from this project would impact other areas as well, for instance, communication between autonomous agents and distributed databases. The educational component of this project focuses on using the Semantic Web as a tool for education and for the training of semantic web practitioners and future researchers. Resources from the project will be used in a course and will be made available for use by other educators.","title":"CAREER: Theory of Distributed Ontologies and the Semantic Web","awardID":"0346963","effectiveDate":"2004-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["467778"],"PO":["564316"]},"94940":{"abstract":"This project aims to extend the Soar architecture to include episodic and reinforcement learning. Although Soar is a mature and widely known cognitive architecture, the extensions will enhance Soar by providing it an episodic memory of prior events that can improve future decision making and the ability to improve its behavior in response to rewards. This research will explore possible synergies between these learning mechanisms including using reinforcement learning for learning memory encoding and recall strategies, using internal episode-based models to boost reinforcement learning and using a model of emotions for affecting learning rates. Given that episodic memory is an important aspect of human cognition, this project will also strengthen Soar as a cognitive model. Besides building on on-going work on Soar, this project will build on results from closely allied fields such as Case-Based Reasoning.","title":"Integrating Reinforcement and Episodic Learning in a General Cognitive Architecture","awardID":"0413013","effectiveDate":"2004-06-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["402253"],"PO":["387198"]},"93752":{"abstract":"PROPOSAL NUMBER.: 0407183<br\/>INSTITUTION: State University of New York at Stony Brook<br\/>NSF PROGRAM: NANOTECHNOLOGY UNDERGRAD EDUCATION <br\/>PRINCIPAL INVESTIGATOR: Pacelli, Andrea<br\/>PROPOSAL TITLE: NUE: Introducing nanoscale system design into the undergraduate electrical and computer engineering curriculum<br\/><br\/><br\/>Abstract:<br\/>Nanotechnology is rapidly making the transition from the experimental stage to practical application. Nanoelectronic systems have the potential to revolutionize information technology, by achieving unprecedented storage and computation capabilities. However, past experience shows that harnessing the power of a new technology requires designers to appreciate its strengths and limitations, and adapt design methodologies to it. Therefore, to tap the potential of nanosystems five or ten years in the future, it is necessary to educate engineers now to appreciate the principles of nanotechnology and to take advantage of it. This interdisciplinary project has the goal of introducing basic concepts in nanoscale circuit and systems design into the undergraduate electrical and computer engineering curriculum, integrating education and current research. An instructional module and supporting CAD software will be developed. Nanoelectronics concepts will be presented from a designer's point of view, stressing the impact on information technologies rather than physical and fabrication aspects. Emphasis will be placed on the typical figures of merit of information processing systems: Computational throughput, power consumption, reliability, and cost. A research agenda will be carried out both in the classroom and in projects, exploring the design potentials of current and future nanoelectronic approaches and comparing them to the dominant silicon technologies.<br\/><br\/>The proposal for this award was received in response to the Nanoscale Science and Engineering Education announcement, NSF 03-044, category NUE.","title":"NUE: Introducing Nanoscale System Design into the Undergraduate Electrical and Computer Engineering Curriculum","awardID":"0407183","effectiveDate":"2004-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7219","name":"NANOTECHNOLOGY UNDERGRAD EDUCA"}}],"PIcoPI":["410653",245734,"380954",245736],"PO":["562984"]},"88946":{"abstract":"This project uses a high-impact, high-interest program visualization environment, Alice, to introduce a strong core of fundamental programming concepts (objects, classes, methods, functions, decisions, variables, parameters, loops) and problem-solving and design techniques to beginning programmers. It addresses the high attrition rate of computer science majors during their first year of study as well as the need for innovative materials and strategies for teaching programming in computer literacy and service courses. Unfortunately, students who are not computer science majors often have poor attitudes toward programming courses and the enrollment of women in computer science has been declining. The results of a previous NSF proof-of-concept project includes evidence that this approach can significantly improve achievement and retention of high-risk CS-majors during their first year. There is also anecdotal evidence that this approach captures student interest and motivates positive attitudes for women and minorities.<br\/><br\/>Previous work has yielded a prototype of instructional materials and a textbook that work synergistically with the Alice high-interest software environment. The prototype materials have been pilot tested and peer reviewed. Other faculty members have successfully used these materials, but no formal testing has been done beyond the pilot project. Thus, the project includes using and formally testing the revised materials at regional test sites during the first and second years of the project. The regional test sites are at different types of institutions, serving students with diverse backgrounds and career goals.","title":"Program Visualization Using Virtual Worlds","awardID":"0339734","effectiveDate":"2004-06-01","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7427","name":"CCLI-EDUCATIONAL MATERIALS DEV"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7428","name":"CCLI-ADAPTATION AND IMPLEMENTA"}}],"PIcoPI":["351237","412046","458384",233332],"PO":["472260"]},"96338":{"abstract":"CNS-0420448<br\/>Raghav Rao<br\/>Institution: SUNY Buffalo<br\/><br\/>Title: ITWF: Women and Cyber Security: Gendered Tasks and Inequitable Outcomes<br\/><br\/>This ITWF project examines the entry, retention, and advancement of women in cyber security information technology careers. The project involves studies on undergraduates and graduates recipients of Department of Defense scholarships, current cyber security professions who hold professional certification, and a group of women who are chief information security officers in American companies. The goals are to determine possible trends of task differentiation by gender and to determine possible institutional interventions that can promote gender equity in the critical field of cyber security.<br\/><br\/>The intellectual merit of this project lies in the theoretical foundations built on existing research in broader information technology fields and the potential to bring new insights to the nationally important field of cybersecurity. The focus on gender differences within the cyber security field is a largely unexplored area. This project could produce new insights that clearly illustrate the differences in the trends and practices in cyber security related to gender equity from those in other information technology sub disciplines.<br\/><br\/>The broader impacts of the project lie with the potential of the results to inform curriculum and program design with colleges and universities to promote enhanced participation of women in cyber security. The multi-faceted dissemination plan should reach many different populations and thus provide a broad audience of potential beneficiaries of the results. The project includes partnership with Buffalo State College to pilot outreach activities targeted at girls in middle and high school, thus widening the pool of females who may then actively pursue careers that combine IT and cyber security.","title":"ITWF: Women and Cyber Security: Gendered Tasks and Inequitable Outcomes","awardID":"0420448","effectiveDate":"2004-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["548305","563364","558161"],"PO":["361119"]},"90332":{"abstract":"Systems which learn from data are by now widely used in many areas, and such systems will doubtless be<br\/>even more ubiquitous in the future. As learning-based systems proliferate and are applied to larger and larger domains, the need for provably effective and efficient learning algorithms grows correspondingly more acute.<br\/>The object of the proposed research is to design and analyze such algorithms. More specifically, building<br\/>on the PI's previous work in this area, the two main research goals of this career development proposal are:<br\/>1. To develop algorithms which can efficiently learn rich and important classes of Boolean functions<br\/>in well-studied models of computational learning. Major focuses of this work will be (a)<br\/>learning Disjunctive Normal Form (DNF) formulas, which are a standard form of knowledge representation;<br\/>(b) learning various classes of Boolean circuits, which can be substantially more expressive<br\/>than DNF formulas; and (c) learning in the presence of irrelevant information, i.e. learning functions<br\/>which depend only on a small unknown subset of domain attributes.<br\/>We note that previous work in this area has uncovered many interesting and useful connections between<br\/>these learning problems and complexity-theoretic structural questions about Boolean functions.<br\/>An important aspect of this research (and indeed a key component of our methodology) is to continue<br\/>to explore and exploit these connections between learning and complexity.<br\/>2. To develop and analyze other well-motivated models for computational learning, and to develop<br\/>efficient learning algorithms for Boolean function classes in these models. Anticipated research<br\/>directions here include (a) giving efficient average-case learning algorithms for important concept<br\/>classes for which no efficient worst-case algorithms are known; (b) developing a theory of learning<br\/>from nonmalicious random examples; and (c) studying the role of quantum computation in learning<br\/>theory. Each of these directions has the potential to yield positive learning results which go beyond<br\/>what can be achieved in current standard learning models.<br\/>This research plan is closely integrated with a plan to achieve broader impact through education which<br\/>involves students at all levels. Highlights of the education plan include: (a) developing new computational<br\/>learning theory courses and other theory courses at Columbia University for target audiences ranging from<br\/>undergraduates to advanced graduate students; (b) introducing undergraduates to the excitement of research<br\/>by actively engaging them in research, both in undergraduate courses and in extracurricular projects; (c)<br\/>advising and guiding graduate students in their development as researchers and educators; and (d) building<br\/>a strong theory group at Columbia by maintaining regular theory group meetings and organizing events such<br\/>as Theory Day.","title":"CAREER: Efficient Learning Algorithms for Rich Function Classes","awardID":"0347282","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550576"],"PO":["550329"]},"90354":{"abstract":"Modern software systems are brittle. Today's systems fall over a performance cliff once load crosses a certain threshold due to the ever-steeper memory hierarchy. After this point, if there is any service, it is provided in a haphazard manner that is both unpredictable and uncontrollable. The latency between processors and memory - the memory wall - is large and growing, but even greater latency now exists between main memory and disk - the disk wall. As load increases, the combined working sets of processes can exceed main memory capacity. The resulting paging activity can render a system unresponsive. When paging occurs, the virtual memory manager becomes the de facto scheduler, thwarting load management. Technology trends are conspiring to make this problem more severe in the future. High-quality, high-performance RAM is increasingly expensive. Disk latency is millions of CPU cycles and growing, requiring larger filesystem caches. Garbage-collected languages lika Java and C# lead to larger working sets and worse locality. Finally, data-hungry applications such as multimedia and data mining are placing growing demands on memory.<br\/><br\/>An integrated attack on this problem is proposed by developing cooperative system support that intelligently manages the memory hierarchy. Enabling high performance and providing robustness under load. This approach involves novel adaptive algorithms and cooperation between the compiler, operating system, and run-time systems. The work will develop two synergistic new research areas:<br\/>1. Cooperative memory management between the operating system and run-time systems, including coarse-grained and fine-grained garbage collectors, to reduce or eliminate paging.<br\/>2. Scheduler-aware virtual memory management to provide predictable scheduling under load.<br\/><br\/>The coarse-grained collector will react to memory load information by reducing application footprint. Models will be developed (using VM information) to allow garbage collectors to perform cost-benefit analyses to choose the best possible heap size. The fine-grained collector will cooperate closely with the virtual memory, selecting appropriate victim pages for eviction by relocating objects to create empty pages, and preventing paging during garbage collection. Compiler programs will be adapted and developed. The analyses will be used to group objects with similar lifetimes onto the same pages. The scheduler-aware virtual memory manager will maintain detailed reference behavior tracking the utility of possible main memory allocations to each process. The scheduler will communicate its intended schedule to the virtual memory manager, which will weigh the utility of each allocation by the proportion of CPU time that the scheduler requests. A utility metric system will enable memory to be provided to each process so that it can run for its CPU proportion and then inform the scheduler when processes cannot be scheduled, so that the scheduler can decide which ones should be deactivated.","title":"CAREER: Cooperative System Support for Robust High Performance","awardID":"0347339","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["562740"],"PO":["565090"]},"90387":{"abstract":"This project explores an extreme form of fault-tolerance in large-scale distributed systems, viz., local correctness. Throughout the project the focus gradually shifts from the basic properties of local correctness to building fault-tolerant software. The topics to be studied are as follows:<br\/><br\/> the conditions under which locally correct programs exist, faults to be tolerated, proving correctness of such programs;<br\/> giving locally correct solutions to a number of prominent problems;<br\/> building the programs and automating the design process;<br\/> demonstrating the practicality by designing locally correct programs for prototype networked sensors.<br\/><br\/><br\/>The investigators expect that this research will define the realm of possibility in local fault-tolerance. That is, it will be possible to determine, based on program properties, whether that program can be made locally fault-tolerant under a given fault model. Moreover, the research will provide tools for synthesis of complex locally fault-tolerant programs using other locally fault-tolerant programs.<br\/><br\/>The investigators plan to publish their results in suitable International conferences\/journals in order to contribute to the body of knowledge in the field and obtain peer reviews. Applications developed will be made available to practitioners for immediate use. Specific graduate and under-graduate courses and research activities tailored for students of various levels will be used to generate more interest and expertise in the field.","title":"CAREER: Localizing Correctness to Tolerate Unbounded Faults in Distributed Systems","awardID":"0347485","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[237036],"PO":["564777"]},"90454":{"abstract":"Software development is an expensive and error-prone process at least partly because of the large semantic gap between the programmer's high-level understanding of the problem and the relatively low-level language in which the problem solutions are encoded. No language contains all of the general purpose and domain specific constructs that may be needed for the unique problems faced by programmers. Thus, they cannot ``say what they mean'' but must encode their ideas as programming idioms at a lower level of abstraction. Simply stated, this wastes time and money and is the source of many errors.<br\/><br\/> This project is directly addressing this problem by developing framework for extensible languages that enables programmers to use languages whose level of abstraction has been raised closer to their problem domain by importing new language features into their programming language. These features include domain specific language constructs, semantic analyses to ensure the correct usage of new language constructs and optimizations and code transformations to ensure that efficient target code is generated. Furthermore, these language extensions are modular and thus can be easily imported by programmer into his or her programming environment and analyzed to ensure that they will not interfere with one another.<br\/><br\/> Such an extensible compiler framework for a complete modern language will also be a catalyst for research in programming languages. It will allow researchers to study their ideas in a complete, not a toy, language and, as language extensions, they can be easily disseminated to other researchers and users.","title":"CAREER: An Extensible Compiler Framework for Modular Seamless Language Extensions","awardID":"0347860","effectiveDate":"2004-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["544438"],"PO":["535244"]},"90444":{"abstract":"CNS-0347807<br\/>CAREER: Secure and Resilient Sensor Network Communication Infrastructure<br\/>Adrian Perrig<br\/><br\/>Sensor networks provide solutions for many challenging problems, such as real-time safety monitoring of buildings or sensing of environmental pollutants. Attacks are often easy to launch in sensor networks---an attacker can easily eavesdrop on or inject wireless messages, or compromise sensors deployed in unsafe areas. Therefore, many sensor network applications require secure and attack resilient communication, especially sensor networks used to secure critical infrastructures.<br\/><br\/>This research studies the problem of secure and attack-resilient communication in sensor networks. The result of this research is an easy-to-use secure communication infrastructure. This secure communication infrastructure will enable sensor network designers to construct secure and attack-resilient networks, without requiring security experts. The resulting sensor network will provide data secrecy (provide robustness against eavesdropping) and data authenticity (prevent message injection), provide resistance against malicious resource consumption attacks, and provide resistance against physical sensor node capture and compromise. This research will significantly impact sensor network research and sensor network deployments as it will greatly simplify building secure sensor network applications. Securing sensor networks used in critical infrastructures will significantly enhance the resilience of critical infrastructure to failures and malicious attacks.","title":"CAREER: Secure and Resilient Sensor Network Communication Infrastructure","awardID":"0347807","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}}],"PIcoPI":["496764"],"PO":["529429"]},"90466":{"abstract":"Information Retrieval (IR) refers to finding information from large amounts of text, and is among the most useful technologies for overcoming information overload. For example, Web search engines are now essential tools for everyone to find information on the Web. Existing IR systems are inherently non-optimal because the retrieval decision is made primarily based on the current query and the document collection without considering information about the user and search context. This project seeks to eliminate this limitation of the existing retrieval methods and formally develop a new retrieval paradigm called user-centered adaptive information retrieval (UCAIR), in which user information and search context are both exploited to improve retrieval performance. This project includes research on: (1) developing a new UCAIR framework based on Bayesian decision theory; (2) developing new language models to exploit user information and search context to improve retrieval accuracy; (3) developing new retrieval methods to optimize the long-term retrieval utility over an entire retrieval session; (4) developing new retrieval methods to leverage user similarities to better infer one particular user's information need based on information about other similar users; and (5) developing prototype UCAIR systems for searching the Web and bioinformatics literature. The project will advance the state of the art of IR through developing a unified formal framework for UCAIR, a variety of retrieval methods for exploiting user information and search context to improve retrieval accuracy, which will directly lead to more effective information retrieval applications in all domains. The research results will also enhance the current IR curricula, improving education of information technology workforce. The project Web site http:\/\/sifaka.cs.uiuc.edu\/ucair\/ will be used for research results dissemination.","title":"CAREER: User-centered Adaptive Information Retrieval","awardID":"0347933","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["456699"],"PO":["563751"]},"94889":{"abstract":"This proposal addresses a central problem in the creation of autonomous intelligent agents: the development of a theory of what constitutes reasonable conclusions and decisions made on the basis of information supplied to the agents. Such conclusions have long been recognized to be not purely deductive in nature, that is, the conclusions are not necessarily logically entailed by the information supplied; rather they are defeasible in the sense that the conclusions might need to be withdrawn in the face of new information. Since real-world environments in which intelligent autonomous agents are presumed to operate do not provide complete information, a theory of defeasible reasoning is necessary for supporting agent planning. Current theories of defeasible reasoning are not entirely adequate for the task of building such agents, and this proposal aims to address this problem in two ways: (1) construct and implement a theory of defeasible reasoning suitable for autonomous agents; and (2) employ that system of reasoning as an inference engine to support decision-theoretic planning by agents. This project takes a hybrid approach that combines symbolic and probabilistic techniques. The research builds on the PI's ongoing OSCAR project that is aimed at developing autonomous cognitive agents in general. This project focuses on the particular problem of decision-theoretic planning, a problem relevant to a wide range of contexts such as exploration of space by autonomous Mars-style rovers.","title":"A System of Reasoning for Intelligent Robots","awardID":"0412791","effectiveDate":"2004-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[248906],"PO":["387198"]},"90412":{"abstract":"The focus of this project is the further development of statistical methods in the context of natural language processing (NLP). The project involves research in three core theoretical or algorithmic areas, and in three application areas within NLP. The core areas are supervised learning for natural language tasks; a study of the issues of efficient search and parameter estimation, particularly by exploring connections between NLP models such as weighted context-free grammars and work on search and estimation in graphical models; and finally, a study of unsupervised or partially supervised learning. The three application areas are syntactic analysis; learning in natural language interfaces; and learning approaches to information extraction.<br\/><br\/>A first aim is to further develop a theoretical understanding, and new algorithms, for machine learning approaches to natural language. A second aim is to apply these algorithms to natural language problems, and in particular to develop an understanding of the representations which lead to good performance on these tasks. <br\/><br\/>Improvements in core technologies for machine learning in natural language processing domains could have impact on a wide range of NLP applications. Our aim is to make it relatively simple to build a natural language interface, or information extraction system, in a new domain. Advances in our theoretical understanding of learning in language problems could also have an impact in linguistics, in studies of learnability or language acquisition. Finally, an important goal of the research and educational plan is to build connections between computational linguistics and other fields, particularly machine learning, and probabilistic representation and reasoning in artificial intelligence.","title":"CAREER: Statistical Learning Theory for Natural Language Processing: Theory, Algorithms and Representations","awardID":"0347631","effectiveDate":"2004-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["508222"],"PO":["565215"]},"90346":{"abstract":"The goal of this research is to reduce the knowledge engineering required to apply clustering to real-world problems by changing how users interact with clustering systems. Instead of having users manually engineer distance metrics and modify clustering algorithms, meta clustering helps users find good clusterings by generating many different clusterings of the data, and presenting these to users organized as a meta clustering. A meta clustering is a clustering of clusterings that makes it easier for users to navigate the clustering space to find clusterings useful to them. An important goal of the project is to work with existing clustering methods instead of replacing them with new methods. By shifting some of the burden from users to the computer, the project will have significant impact on the practice, research, and education in clustering. This will make clustering easier, particularly for users not adept at defining distance metrics, help experienced users arrive at good clusterings faster, and will advance clustering research and education by providing a framework for comparing and evaluating clustering methods. In addition to producing fundamental research results, the research project will be used to train Ph.D. students, will involve both undergraduate and exceptional high school students in research, will help in creating a new course on unsupervised learning, will yield meta clustering software available through the web that is compatible with many existing clustering algorithms, and will form the basis of a novel workshop and web-based comparison of clustering methods run by different clustering researchers. The project Web site http:\/\/www.cs.cornell.edu\/~caruana will be used for timely results dissemination.","title":"CAREER: Meta Clustering: Improving User Efficiency on Real-World Clustering Applications","awardID":"0347318","effectiveDate":"2004-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["342321"],"PO":["563751"]},"93525":{"abstract":"0406198<br\/>Huang<br\/>Various recent developments in different areas of mathematics and physics turn out to be related when the language of tensor categories is used as a unifying concept. Tensor categories emerge naturally whenever a mathematical problem needs an efficient treatment of one or several products,\" or when a problem in theoretical physics requires a concise description of possible couplings. As a consequence, tensor categories provide a natural unifying language for many interesting problems. Using this framework has the additional benefit of unraveling structural parallels and therefore often allows one to apply results and techniques to a given problem that were originally developed in a different context.<br\/><br\/>The PI is a co-organizer of a program, Tensor Categories in Mathematics and Physics, to take place in the spring and early summer of 2004 at the Erwin Schroedinger Institute in Vienna. The purpose of this program to bring together researchers working on different topics in mathematics (such as quantum groups, link invariants, vertex algebras, or subfactors) and physics (such as topological and conformal field theory, string theory, or operator algebraic approaches to quantum theory) in which tensor categories are playing a role, or can be expected to play a role in the future.<br\/><br\/>The contribution from NSF will be primarily used to support graduate students, junior faculty, women and members of underrepresented minority groups in the United States to attend the program. Active participation in such a program will undoubtedly have an important impact on their future careers. The idea of the program is to encourage interaction between mathematicians and mathematical physicists of different backgrounds. In particular, one of the main goals of the program is to make a wealth of mathematical results and concepts that are ready to use accessible to a larger part of the theoretical physics community. It is clear that mathematicians and physicists can all benefit from communicating results between the various disciplines and from developing a unified language.","title":"US-Austria Workshop: Tensor Categories in Mathematics and Physics","awardID":"0406198","effectiveDate":"2004-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["480278"],"PO":["564152"]},"95638":{"abstract":"The High Pressure Gordon Conference has been held biannually for 49 years: it<br\/>continues to be vital to new science developments in fields as diverse as physics, chemistry,<br\/>earth\/planetary science, materials and biology. It is one of the few that crosscuts a broad<br\/>spectrum of topics with a unifying theme of condensing matter with pressure. Spectacular<br\/>advances are now being made in high-pressure methods for creating new materials, and for<br\/>studying physical, chemical and biological processes under high-pressure conditions: recent<br\/>breakthroughs include diffraction of light elements using neutron scattering at extreme<br\/>conditions, direct measurement of thermal conductivity, acoustic velocities, and even the full<br\/>density of states at extreme conditions, polymerisation of molecules into new solids, creation<br\/>of super-hard materials, increasing superconducting Tc to record values, formation of<br\/>unexpected incommensurate structures in metals; and advances in fundamental theoretical<br\/>descriptions of simple molecular systems. Emerging areas include high-pressure<br\/>crystallography of hydrogen containing materials, new techniques for synchrotron\/neutron<br\/>studies and ongoing development of inelastic x-ray scattering on small volumes, and<br\/>understanding mineral physics of outer planets and stars. The 2004 GRC will feature invited<br\/>talks in exciting new areas at the forefront of science, including shock wave techniques of<br\/>double shock, laser shock, and shock-spectroscopy experiments; high pressure melting and<br\/>liquid structure;, super high pressure acoustic velocity measurement on metals and minerals;<br\/>sampling the deep Earth with single crystal x-ray studies at record pressures; new synchrotron<br\/>and neutron experiments; high-pressure superconductivity, and new metallic behaviour at<br\/>high pressure. For a vibrant and successful conference, it is essential to represent all sectors<br\/>of the field, including graduate students, post-docs and junior faculty, as well as newcomers<br\/>to the high-pressure field. Diversity is also stressed, including representatives from many<br\/>countries as well as more female scientists than in past conferences. Financing participation<br\/>in such a conference is an impediment to attendance by many attendees, that can not be<br\/>covered by the existing GRC fund. Here we request supplementary funds to subsidize travel<br\/>and conference fees, to enable participation by students and junior scientists, as well as<br\/>\"newcomers\" to the high-pressure field, with great benefits for US and international science.<br\/>Funds are being requested from two different NSF programs in approximately equal amounts<br\/>since these two areas are heavily represented in the program.<br\/>Broader Impacts:<br\/>This conference has traditionally had few women and minorities, often less than 3%.<br\/>This conference there are 3 women speakers, greater than 10% as well as a woman discussion<br\/>leader and woman chair (this conference's first). There are two Hispanic speakers, but not<br\/>American Hispanic. It is expected that this conference will have a larger than average<br\/>number of women scientists, a very underrepresented group in physics, and physical sciences.<br\/>Traditionally Gordon Conferences are platforms where one may bring in speculative<br\/>ideas to generate discussion, hence no photographs or publishable results. However, it is here<br\/>where inspiration to new directions and collaborations lead to new publications. The Gordon<br\/>Conference on Research at High Pressure is only one of two conferences where these<br\/>scientists meet, the other being the biannual AIRAPT, held only in odd numbered years.<br\/>This conference is extremely important for students and postdocs to attend (6 of the<br\/>speakers are students or postdoctoral scholars, an even larger number are invited posters) as it<br\/>is an integral part of their education to meet the key people in the field of high pressure,<br\/>discuss their work and putting their own ideas under the scrutiny of experts, and to be<br\/>inspired in new directions. This is what will help generate effective new scientists.","title":"2004 High Pressure, Research at Gordon Conference","awardID":"0416479","effectiveDate":"2004-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1762","name":"SOLID STATE & MATERIALS CHEMIS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1573","name":"PETROLOGY AND GEOCHEMISTRY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1574","name":"GEOPHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1771","name":"METAL & METALLIC NANOSTRUCTURE"}}],"PIcoPI":["276977","563235"],"PO":["563232"]}}