{"39193":{"abstract":"Computation and communication technologies have the potential to improve coordination in dynamic task and team situations. To realize that potential a deep understanding of the coordination processes used by teams is required. This project investigates the coordination processes used by distributed teams of experts operating in a highly dynamic work domain -- a trauma patient resuscitation unit. The main objective is to develop a framework for modeling coordination processes by team members in dynamic, multi-tasking, highly stressful environments. An interdisciplinary team with wide-ranging research backgrounds including team performance, information technologies, medicine, nursing, health care informatics, management sciences, biomedical engineering and ethnography will conduct the project. Qualitative and quantitative methods including ethnographic studies, surveys and interviews will be used to capture coordination processes in situ in trauma center settings. The project will result in a better understanding of the role of various communication media and how each medium is used in dynamic work settings to achieve work coordination and maintain adequate awareness. A set of design principles will be developed that can guide the deployment of communication-computation systems in domains where tasks are highly dynamic and accomplished by multi-disciplinary teams.","title":"Coordination Processes and Awareness Support in Dynamic Work Environments","awardID":"9900406","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["311750","472085","225702","317910",99445],"PO":["495796"]},"47081":{"abstract":"A planning grant is requested to establish a multi-disciplinary effort at UCLA to apply wireless, mobile networking to support seamless transition of applications across heterogeneous clients for patient record retrieval in medical settings. The planning grant will be used to establish a very small testbed with heterogeneous devices that include desktop computers, laptops, and hand held devices, to provide an environment in which to deploy an early prototype of the proposed system. The testbed will also allow us to enhance interactions among the researchers from different disciplines and the campus telecommunications facility to prepare for an eventual full throttled deployment of the system. Lastly, the small physical testbed will allow us to cleanly separate the advanced development concerns from the more research-oriented issues such that we can deploy the system using state of the art COTS tools while simultaneously pursuing research ideas to influence the next generation of the proposed environment.","title":"iMASH: Interactive Mobile Application Support for Heterogeneous Clients","awardID":"9982049","effectiveDate":"1999-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["231158","558959",120526,"123263","543560"],"PO":["125800"]},"45080":{"abstract":"Timely delivery of information from content servers to clients is now clearly one of the primary roles of ubiquitous networking. As the number of people seeking information through networks increases, scalability of information delivery services becomes an important issue. Server replication is one common technique used by service providers to accommodate the increasing information demands. Effective server replication, however, demands appropriate server selection approaches, without which the full benefits of replication will not be realized. Poor server selection often leads to an array of associated system performance implications: degraded performance as perceived by the client, possible rejection of the request due to server overload, degraded performance observed by other clients accessing the selected server, and poor performance observed by other network connections due to hot spots resulting from unbalanced load.<br\/>The focus of this proposal is on the design and evaluation of server selection approaches specifically in the context of wide-area server replication. We propose a research program that provides a systematic investigation of the server selection problem starting with the current state of services and networks but mostly concerned with future networking and service environments. Continuous evolution and innovation in the capabilities of wide-area networking and the nature of information services will result in a much more complex server selection problem with a wider diversity of performance and policy concerns that affect selection. The work will consider five types of service: traditional Web and FTP services, multicast services, multimedia streamed services, multi-source services and brokered services. The researchers consider these as different service dimensions that may be present in some combination in deployed services and explore the challenges in server selection for each dimension. The researchers will also consider how new network infrastructure capabilities (ranging from support for some form of differentiated service to the more far-reaching Active Networking proposals) can be used to enhance and support the server selection function.<br\/>The main contributions of the research will be:<br\/>1. Development and evaluation of techniques for the use of network support to aid the server selection function.<br\/>2. Characterization, mechanisms, policies and their evaluation for the multicast server selection problem.<br\/>3. Techniques for streamed video server selection in current and future network environments.<br\/>4. The use of the Interactive Multimedia Jukebox (IMJ) (http:\/\/imj.gatech.edu) and the researchers' previously developed multicast web server to provide proof of concept for the proposed server selection protocols for multicast and multimedia stream servers. 5. Further characterization and server selection proposals for two novel service paradigms (multiple-source and brokered services).<br\/>6. A reusable experimental platform for experimenting with server selection proposals.<br\/>The proposed work will go beyond server selection mechanisms in today's environment which do not need to be complex; round-robin or other simple techniques for allocating clients to servers are currently adequate. Such simple and ad-hoc techniques will not, however, work well in the richer environment that the trends above will lead to. The work considers the architecture, mechanisms and policies by which server selection may be accomplished in this future networked service environment. The researchers believe that their research will, in fact, play an enabling role, since this future's benefits cannot be realized without a workable system for server selection.","title":"Server Selection in Emerging Information Delivery Environments","awardID":"9973115","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["550428","550429"],"PO":["250082"]},"39371":{"abstract":"CCR-99000922 Bastani, Farokh B. The University of Texas at Dallas<br\/><br\/>The increasing automation of critical applications is imposing increasing demands on software capabilities and assurance levels. To handle these challenges, several methods have been proposed to decompose requirements specifications into disjoint pieces that can be implemented independently. However, most of these methods do not directly facilitate the assessment of the resulting system. This research focuses on IDEAL (Independently Developable End-user Assessable Logical) components, i.e., components that can be analyzed, developed, and evaluated independently by the end-user. To compose a system of IDEAL components, each component is relational (returns all possible outputs for a given input). This approach has several<br\/>significant advantages, including high reliability and safety assurance, automated composition, and support for multiparadigm control strategies. A formal foundation for the existence of relational programs for several classes of applications will be developed. A library of heuristic rules, data types, operations, and coordination schemes will be developed to facilitate the writing of efficient relational programs. Methods will be developed to infer the properties (performance, reliability, safety, and stability) of a system of IDEAL components from the properties of its components. These will result in a rigorous and practical approach for achieving certifiable high assurance for critical applications.","title":"Relational Programs","awardID":"9900922","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["526352"],"PO":["397849"]},"47371":{"abstract":"One of the ways in which advanced network infrastructures are expected to be used in the future is to serve as the backplane for a distributed computational infrastructure. The notion of a national computational <br\/>research grid is one of the models that has been proposed. This proposal is being funded in order to provide for planning workshops and small scale prototyping experiments that are intended to determine the requirements that applications expected to use such a grid might have. Results will be used to influence new projects and proposals for the construction of a full scale grid.","title":"The Beta Grid: A National Infrastructure for Computer Systems Research","awardID":"9983299","effectiveDate":"1999-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["562593","524614","554547"],"PO":["198445"]},"47151":{"abstract":"The visualization and analysis of animal structure in an evolutionary context has progressed from simple \"eyeballing\" to traditional morphometrics (multivariate analysis of caliper measurements) and is now entering the new regime of geometric morphometrics. In this approach, the three-dimensional (3D) coordinates of landmarks and intervening lines or surfaces are obtained with a digitizer or from CT or similar scans. Thus, the spatial relationships among these points, lines and surfaces are<br\/>expressly preserved. These coordinate data can be visualized as 2D and 3D images, manipulated, and statistically analyzed in high-dimensional shape space. The researchers will develop a set of database, statistical and manipulative tools to allow the rapid visualization and comparison of morphology among individuals and populations, across sex and age differences, including both extant and extinct samples, effectively forming a database of virtual morphology for computerized analysis. Reconstruction of damaged fossils from undistorted relatives, morphing of ancestral species into visualized descendants, exploration of endocranial features, tracing the evolution of brain neurochemical pathways using functional images and stereologic data across species, and combined analyses of brain and bony skull form are among the goals of this project. The focus will be on the skull and brain of the Anthropoidea or \"higher\" primates (humans, apes and monkeys), but the tools and approaches will be useful to a wide audience of zoologists and paleontologists. Based at the American Museum of Natural History, the team benefits from its vast collections and available visualization infrastructure, as well as the unique opportunity to project our displays to colleagues and the interested public on the 4-square-meter walls of the Reality Room immersion environment and the 21 meter Digital Dome of the newly renovated Hayden Planetarium.","title":"Visualization of High Dimensional Data in Comparative Morphology: Applications to Higher Primate Evolution","awardID":"9982351","effectiveDate":"1999-10-15","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}}],"PIcoPI":["485996",120718,120719,"447899"],"PO":["551992"]},"45381":{"abstract":"The objective of this research is to design novel data models for video databases that will provide enhanced semantic expressiveness needed for content-based retrieval of video data. The key features of such models will be to allow retrieval of video data using arbitrary combination of keywords and video events involving object motion. Such a hybrid approach can substantially enhance the degree of precision and scalability of retrieval mechanisms for video data. This research effort is expected to have a significant impact on the development of database tools for content-based indexing and retrieval of video data. Results of this project are anticipated to have widespread applications including those in surveillance, education, digital libraries, law-enforcement, tele-medicine, news and entertainment, and manufacturing.","title":"Intelligent Content Based Access to Networked Video Databases","awardID":"9974255","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["438744","438745"],"PO":["563751"]},"58372":{"abstract":"","title":"Reconsidering Fragmentation and Reassembly","awardID":"0096043","effectiveDate":"1999-10-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["438592"],"PO":["194325"]},"45073":{"abstract":"The dramatic growth in the popularity of the Internet, coupled with the increase in user access<br\/>speeds, has led to an increased demand for streaming media services in IP networks. However, the<br\/>heterogeneous and decentralized nature of the Internet, and the lack of end-to-end mechanisms for<br\/>quality-of-service guarantees, significantly hampers the effort to provide quality delivery and low<br\/>delay to all clients. The success of multimedia streaming applications hinges on developing new<br\/>techniques for providing both low start-up delay and high audio\/video quality, without requiring<br\/>control over the entire path from the multimedia source\/server to the end users. We propose an<br\/>approach based on active proxy services and prefix caching that has the potential of satisfying these<br\/>requirements. Proxy prefix caching is a mechanism whereby the first several seconds of a continuous<br\/>media (CM) object are stored at a proxy server close to a client. The prefix cache allows the proxy<br\/>to hide latencies introduced by either long end-to-end delays, the need to mask unreliable network<br\/>services, the need to process the stream arriving from the source, or the need to deal with scarce<br\/>resources between the proxy and clients.<br\/> In this proposal the researchers outline research investigating several aspects of this mechanism which in-<br\/>clude:<br\/><br\/>-Design and evaluation of preix caching mechanisms,<br\/><br\/>-Integration of prefix caching with bandwidth smoothing,<br\/><br\/>-Development of effective resource allocation schemes at the proxy, and<br\/><br\/>-Characterization of video sources and Internet traffic to feed into the these investigations.<br\/> The joint participation of AT&T Research and the University of Massachusetts provides a unique<br\/>synergy that would not otherwise be possible. AT&T provides access to resources in the form of<br\/>WorldNet traffic data, which supplies a snapshot of current CM workloads in the Internet, and<br\/>access to video testbed\/prototyping platforms that are not readily available in academia. On the<br\/>other hand, UMass provides a much more long-term perspective than is possible at an industrial<br\/>lab, as well as expertise in the area of active services, bandwidth smoothing, and reliable transport<br\/>protocols.","title":"Prefix Caching of Continuous Media Streams in the Internet","awardID":"9973092","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["545655"],"PO":["234222"]},"36560":{"abstract":"This project develops data mining algorithms, both association rules and prediction, targeted to geospatial data. This GOALI research is performed in collaboration with the SIVAM project underway at Raytheon Systems Company. Raytheon Systems Company, Garland Division, has the responsibility for the hardware and software development of SIVAM (System for the Vigilance of the Amazon). SIVAM's objective is to implement a surveillance and analysis infrastructure, including a very large (multi terabyte) geospatial database and associated visualization tools that will provide the Brazilian Government with the necessary information for the protection and sustainable development of the Amazon region. This research focuses on an important aspect of the overall problem: development of new algorithms for a specific target application. The developed algorithms scale to the massive amounts of data present as well as adapt to the available amount of main memory. In the SIVAM project, data is obtained on an ongoing basis (as time advances). The prediction algorithms are used to predict environmental catastrophes (such as flooding or deforestation) and are incremental in nature. State information is kept which \"remembers\" previous environmental data collected. As new data arrives, the state is advanced based on the data found. In addition, these structures used to save this state information are modified as learning takes place. The results of this research will advance the field of data mining and provide enabling technologies for the environment research and management.<br\/>http:\/\/www.seas.smu.edu\/~mhd\/dm.html","title":"GOALI: Data Mining Tools for Geospatial Databases--Enabling Technologies for the Environment","awardID":"9820841","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1520","name":"COMPUTING FACILITIES"}}],"PIcoPI":["430435",92131],"PO":["563751"]},"34140":{"abstract":"Reflecting the increased complexity and globalization of today's world, the importance of communication networks is apparent and growing in many aspects of everyday life. New networking architectures (e.g. optical networks, ATM Virtual Path networking) and the requirements of nimbleness have created a large number of network design\/configuration optimization problems, many of which fall in the category of NP-hard combinatorial optimization problems. Optimizing some design and usage characteristics of communication networks leads to considerable cost savings. The main objective of the proposed research is to improve the design and usage of optical networks. This will be achieved via identifying possible design problems and\/or opportunities, proposing mathematical models, and developing efficient algorithms to optimally (or suboptimally) solve these models. Specific objectives and applications include (but are not limited to):<br\/><br\/>(1) dynamic reconfiguration of multiwavelength multihop broadcast lightwave networks with variable number of transmitters\/receivers per node, in order to minimize maximal congestion on its links; (also applicable to distributed memory architectures in order to decrease the time spent in communication); <br\/>(2) reallocating capacity among links in a network to maximize the network utilization and minimize the total capacity required (applicable to rearrangeable T1\/T3 telecommunication networks with digital cross-connect nodes, ATM networks);<br\/>(3) sequencing the arrangement of links and\/or reallocation of capacity to minimally disrupt network operations (applicable to networks mentioned in (1) and (2));<br\/>(4) design optimization of non-broadcast networks with optical cross-connect equipment to allow wavelength routing and re-usage (applicable to Wide Area Networks);<br\/>(5) Designing minimum cost hub and spoke network by optimally (or suboptimally) locating hubs and allocating non-hub nodes subject to given restrictions (applicable to telephone networks, airline services and parcel delivery networks, distributed database systems, VLSI design).<br\/>(6) Controlling user's access to common communication medium by assigning time slots for variable bandwidth switching systems (applicable to satellite-switched time division multiple access system with different rates).<br\/><br\/>The primary direction of research includes the development, enhancement, and efficient implementation of heuristic search algorithms for some NP-hard combinatorial optimization problems arising in the design of optical networks. The work on heuristic methods includes development of improved criterions for measuring the quality of the proposed heuristic solution. This leads to research on development of efficient algorithms for obtaining tight lower bounds (for minimization problems). Having a certain measure of the quality of a solution, it is interesting to investigate under which conditions the quality deteriorates (or improves). The secondary direction of research is concerned with the identification of special cases of NP-hard problems arising in communication networks design that (due to restricting assumptions) could be efficiently solved to optimality. The related work includes the design of algorithms for more general classes of problems that make use of efficient subroutines to solve subproblems.<br\/><br\/>Increasing the solvability of networking optimization problems and placing them in the dynamic environment by studying the impact of data changes on the proposed solution, adds to the applicability of such mathematical models to an even broader number of problems arising in applications of modern technology. This will, in turn, advance our knowledge regarding solvability of relevant optimization problems facing contemporary engineering.","title":"On Design Optimization in Optical Networks","awardID":"9814014","effectiveDate":"1999-10-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[85933],"PO":["194325"]},"58384":{"abstract":"","title":"Design and Implementation of OBDD Variable Ordering\/ Reordering Methods","awardID":"0096055","effectiveDate":"1999-10-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485742"],"PO":["321058"]},"46185":{"abstract":"Abstract<br\/><br\/>IIS-9978138<br\/>Canny, John<br\/>University of California - Berkeley <br\/>$116,863 - 12 mos.<br\/><br\/>PRoPs and Gesturing Avatars: Embodied Robotic Interfaces<br\/><br\/>This is the first year funding of a three year continuing award. With the spread of personal computers and ubiquitous networking, computing has become a consumer technology. This growth was fed by demand for a new kind of computing: computers as *communication and information management tools*. But for a variety of reasons, no<br\/>current technology is a reasonable substitute for face-to-face communication. The ultimate computer-mediated communication form is telepresence via a robotic proxy. Many aspects of communication are possible only with this medium, and a precise characterization of those capabilities is the subject of this project. The project relies<br\/>heavily on concepts from the disciplines of inter-personal psychology and non-verbal communication. The former discipline deals with people's perception of a communication experience, how accurately they perceived the other person's intention, disposition, and<br\/>emotions. Non-verbal communication studies the role of particular cues, like gaze, gesture and posture, in contributing to a communication experience. In this research, telerobots are called \"PRoPs'' for Personal Roving Presence. The name emphasizes the<br\/>personal connection between the pilot and the robot, and that the robot is not an autonomous agent, but a manifestation (a presence) of its pilot. The project focuses on telepresence in the workplace, and within that category, on informational (office) workplaces and laboratories (which involve more interaction with objects). The main<br\/>research issues to be explored are: (i) generating and controlling non-verbal communication cues, especially spatialized ones such as gaze and gesturing (ii) easy and intuitive navigation and (iii) affective haptics. The social contexts to be explored are (i)<br\/>communication (ii) persuasion and (iii) trust-building.","title":"PRoPs and Gesturing Avatars: Embodied Robotic Interfaces","awardID":"9978138","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["409023","315297"],"PO":["234178"]},"47143":{"abstract":"Today's computer simulations and experiments often produce huge amounts of data that need to be seen and interpreted to explain the underlying phenomena. Conventional approaches to this visualization and analysis are likely to fail or have limited scope when used in isolation. A comprehensive end-to-end framework that integrates the data source, storage, servers, network, and the visualization client is critical for delivering scalable performance on a range of hardware platforms and datasets. The complete solution makes it possible to examine vast amounts of data that were never available before, and achieve true understanding of the science that produced the data. In particular, we will examine data from subsurface modeling projects (thus understanding the flow of groundwater and oil reservoirs) and the ASCI program (thus providing insight into advanced physics).<br\/><br\/>This project will develop a framework for interrogative visualization of terascale datasets. The basis of this framework is a suite of compressed multiresolution representation and data streaming techniques that adapt in an error-controlled manner to available computational resources. Used in conjunction with fully threaded visualization servers and clients for parallel performance and 1\/0 optimizations for out-of-core computations at both server and client ends, the system should provide seamless scalable performance. This is part of a long-term project at UT Austin to develop a comprehensive framework for multi-scale visualization and simulation for terascale problems, with a tight coupling between modeling, simulation, and visualization. The proposed project deals strictly with progressive interrogative visualization of off line terascale datasets. Other funding will extend the work to support interrogative steering of terascale physical simulations as well. Our primary source of terascale data is from massively parallel physical simulations of time dependent phenomena being performed at the Center for Subsurface Modeling (CSM) at the University of Texas at Austin (UT). To ensure a wider scope and general applicability of our techniques, we will also validate them on terascale simulation data sets made available by researchers at NASA Ames (simulation of supersonic flows), and by the DOE research laboratories (simulation of shock-waves in","title":"Terascale Data Visualization","awardID":"9982297","effectiveDate":"1999-10-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["517319"],"PO":["551992"]},"46175":{"abstract":"Visualization systems are most effective when the user can interactively explore the data by varying the viewpoint and visualization parameters via direct manipulation. However, visualization applications fre-quently deal with extremely large datasets, so such interaction is often impossible. In addition to being large, these datasets often have high depth-complexity and non-polygonal primitives, which makes them poorly suited to most current graphics accelerators. This project will investigate the use of ray tracing vi-sualization applications. By exploiting parallelism and image-based-rendering (pixel reprojection) this project can create a system that is both interactive and responsive for very large datasets. In addition, the programmable nature of such a system will allow improved rendering effects such as shadows and transparency, and sup-port for non-polygonal primitives such as glyphs and volumes. To test the relevance and performance of this system the project will be tested in several application areas: medical visualization, fluid flow visualization, terrain visualization, and bioelectric modeling visualization.","title":"Interactive Ray Tracing for Visualization","awardID":"9978099","effectiveDate":"1999-10-15","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}}],"PIcoPI":["560997","292838","558600","139560"],"PO":["562362"]},"46186":{"abstract":"EIA-9978141<br\/>Prudhomme, Thomas I.<br\/>Lathrop, Scott<br\/>Walker, Mary Bea<br\/>University of Illinois Urbana-Champaign<br\/><br\/>Digital Government: Alliance Federal Consortium Program: Making the Alliance Accessible to Federal Agencies<br\/><br\/>This activity will support the development and delivery of a series of technology transfer and outreach activities by the NSF National Computational Science Alliance to the Federal Web Consortium, a group of Federal civilian agencies with significant information services mission elements. Topics covered will include distance learning, high-bandwidth networking, simulation, mining and visualization of large datasets, and other activities. Delivery mechanisms will include site visits by Alliance staff to Consortium agency sites, site visits by the agencies to the Alliance, remote training, videoconferencing, and monthly meetings hosted by NSF. Additionally, support will be provided for the Alliance's Access Center, an 8,000-square feet high-tech demonstration and training site in Arlington, VA.","title":"Digital Government: Alliance Federal Consortium Program: Making the Alliance Accessible to Federal Agencies","awardID":"9978141","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X185","name":"BUREAU OF CENSUS-FED WWW CONSR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X335","name":"BUR OF LABOR STATISTICS-WWW"}}],"PIcoPI":["249524","351837",117792],"PO":["371077"]},"38266":{"abstract":"The Internet is facing two problems simultaneously: there is a need for faster switching\/routing<br\/>capacity to carry the continued growth of user data, and there is a need to introduce guaranteed<br\/>qualities of service (QoS) for real-time traffic. Each problem can be solved independently - the fastest single-stage switches and routers can be made using input-queued crossbar switches, instead of shared memory systems limited by memory bandwidth. And QoS can be provided using numerous well-known techniques, such as weighted fair queueing (WFQ). However, until now, these two solutions have been mutually exclusive; all of the work on algorithms that provide QoS has required that switches and routers use shared memory or output queueing.<br\/>The Next Generation Internet (NGI) will require hugely increased capacity, and distinguished and guaranteed qualities of service. Building on previous research on high performance switches and routers, the proposed work will follow three avenues in an attempt to solve the problem of simultaneously increasing network capacity and providing QoS:<br\/>1. Switch Speedup. Using a new technique called \"precise emulation via speedup\", cross-bar switches can be built that precisely emulate output queued and centralized shared memory switches, yet use memories that run at only twice the speed of the external line. This promising technique enables switches and routers to provide guaranteed QoS at speeds much higher than before. In this work, new practical algorithms will be developed, studied and prototyped with the goal of making this technique available to the industry at large,<br\/>2. The Fork-Join Router. This is a new highly parallel architecture for single-stage IP routers with aggregate capacities in excess of 1Tb\/s. Using multiple forms of parallelism simultaneously, different parts of the system may operate at different speeds, allowing a particular implementation to make best use of the available switching, and forwarding technology. The router is highly fault-tolerant, degrading gracefully when sub-systems fail. Perhaps most importantly, the fork-join router can use the \"speedup\" technique for Terabit routers that provide precise QoS guarantees.<br\/>3. The Streaming Processor. Network switches and routers require fast processing elements that process data as it \"streams through.\" Streaming data is not processed well by traditional heavily-pipelined load-store RISC CPUs. There is a need for a processor architecture optimized for streaming data, in which the CPU is part of a larger system pipeline, and in which data with spatial, but not temporal, locality can be processed at very high speed. Such a device would enable faster forwarding decisions in routers, perform<br\/>faster scheduling algorithms to provide QoS, and perform fast transcoding of net-work data.<br\/>An important goal is to see the research used by industry and in the NGI. Therefore, a goal of<br\/>the proposed research is to transfer the technology to the builders of \"carrier-class\" switching and routing equipment, and to encourage rapid adoption.","title":"CAREER: High Performance Packet Switches","awardID":"9875637","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["560546"],"PO":["292741"]},"45570":{"abstract":"EIA-9975018<br\/>Rauchwerger, Lawrence<br\/>CISE Next Generation Software(NG)<br\/>Texas Engineering Experimental Station<br\/><br\/>SmartApps: Smart Applications for Heterogeneous Computing<br\/><br\/><br\/>This proposal proposes to generate SMART APPLICATION code that uses information about its input data, operating system services and architecture capability, to adaptively reconfigure the application and the OS\/hardware platform. To enable very aggressive optimizations, we propose to build a two-stage compiler which has a static and run-time component. The run-time component is extremely fast, works in parallel on the target machine and can read all relevant input data, and the operating system and architectural capabilities. Furthermore, to adapt the performance to variable program inputs during execution, we propose to use novel speculative run-time adaptive optimization techniques (for example, the PI's speculative parallelization and a feedback loop of performance evaluator, predictor and optimizer inputs. All this support will be enabled by a run-time library and the necessary compiler-embedded code in the executable. With this approach, the application can adapt itself and its environment to its needs by issuing appropriate commands. For instance, it is able to control data placement by the OS, control the I\/O subsystem, modify coherence protocols and establish network connections. Moreover, smart applications are able to respond to the failures and large performance variations that distributed systems suffer.","title":"Next Generation Software: SmartApps: Smart Applications for Heterogeneous Computing","awardID":"9975018","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["561154","496841"],"PO":["301532"]},"49784":{"abstract":"Advances in multimedia digital signal processing (DSP), wireless communication systems, integrated circuit technology and portability requirements have fuelled research into the design of energy-efficient deep submicron (DSM) systems. Noise has emerged as a problem of significance for design in the DSM regime. This research addresses the dual challenge of designing reliable and energy-efficient DSP systems in the presence of DSM noise. Three coupled approaches are being explored: 1) algorithmic noise-tolerance (ANT) that employs stochastic signal processing techniques to combat DSM noise, 2) noise-tolerant dynamic circuit design techniques that provide noise-immunity with minimal energy penalty and 3) a CAD methodology that optimally folds the results of 1) and 2) in order to achieve a specified degree of system reliability and energy-efficiency.","title":"Noise Tolerant DSP for the Deep Submicron Era","awardID":"0000987","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["348133"],"PO":["562984"]},"48035":{"abstract":"Hierarchical databases were standard thirty years ago, but have been completely supplanted by relational databases since, in spite of hierarchy remaining the most common way in which we organize information in other spheres. The goal of this research project is to re-evaluate hierarchical databases in the light of the progress made in database technology. The thesis is that relational databases supplanted hierarchical databases not because flat relations provided a superior organization of the data, but rather on account of other crucial benefits relational technology provided, namely the separation of data organization from application logic and the notion of a declarative query language. The approach in this project is to begin with LDAP (Lightweight Directory Access Protocol) as a rudimentary hierarchical database, and to extend it to provide full-fledged database functionality. The results of this project will demonstrate the feasibility and value of building a hierarchical database as a far more flexible and scalable structure than the relational databases that are prevalent today. <br\/>http:\/\/www.eecs.umich.edu\/~jag\/","title":"SGER: Managing Hierarchically Organized Data in Modern Databases","awardID":"9986030","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["533266"],"PO":["563751"]},"46440":{"abstract":"This research project is a collaborative effort of Margaret Dunham, Southern Methodist University (IIS-9979458) and Vijay Kumar, University of Missouri at Kansas City (IIS-9979453) and is supported under the Wireless Information Technology and Networks (WITN) initiative, NSF 99-68. The goal of this research is to develop schemes for processing data that are strongly related to geographical locations, on a mobile computing platform. Unlike conventional data processing systems, in a wireless mobile computing environment the value of data may depend on location, and processing of a transaction at one site may give different results than that at another. This situation identifies a new type of data, which we refer to as Location Dependent Data (LDD). Thus, LDD is a class of data whose value is determined by (a) the geographical location of data storage and (b) the geographical location of the Mobile Unit (MU) where the query originated. For example, when a query from a MU wants to find out information about local hotels, it will get a different answer in Dallas than in Kansas City. It would even be possible for a traveler driving from Dallas to Kansas City to ask the same question en route but specifically request the response using Kansas City data rather than data based on the location from which he requests the query. Although the query may be stated in exactly the same way, it is interpreted in a location-dependent context. The objective of this research is to further explore the concept of LDD, its impact on transaction processing, and develop efficient schemes for its management. As a result of this research, methods will be produced which facilitate the storage of location dependent data at Mobile Units and techniques to efficiently process transactions which access this type of data. The creation of a testbed to is a major objective of the project. It will be used to implement and compare the various strategies proposed during the research.","title":"WITN: Collaborative Research in Location Dependent Data Management","awardID":"9979458","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["430435"],"PO":["563751"]},"46155":{"abstract":"Diagrams are used everywhere to illustrate complex relations, present data, document designs, and otherwise provide schematic views of information. In the near future, virtually every important document will be available in electronic (digital) form. Whereas many automated techniques have been developed to index, retrieve, summarize and translate electronic documents based on their textual content, few comparable techniques are known for similarly exploiting the diagrams in such documents. Building on his prior research, the PI will develop a new class of automated tools for vector (not bitmap) diagrams that analyze the graphical elements and the text associated with them to create rich descriptions of diagram syntax and semantics. These tools will allow collections of diagrams to be intelligently indexed and queried, and will form the basis for future systems that can compare, merge, summarize, and otherwise manipulate diagrammatic information in useful ways. Two dimensional diagrams such as data graphs, block diagrams, gene diagrams, technical drawings, maps, and others used in science, engineering, education, and industry will be studied. The research will lead to enhanced understanding of the syntax and semantics of diagrams, and to efficient systems for extracting syntactic and semantic information from vector diagrams; it will thus provide a firm foundation for the integration of diagrams on an equal footing with text in future information systems and digital libraries.","title":"The Structure and Content of Diagrams","awardID":"9978004","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["293969"],"PO":["246649"]},"45572":{"abstract":"EIA-9975020<br\/>Rice University<br\/>Kennedy, Ken W.<br\/><br\/>Grid Application Development Software (GrADS)<br\/><br\/>This proposal will make it possible to have advances in networking technologies to use the global information infrastructure in a qualitatively different way-as a computational resource as well as and information resource. This idea for an integrated computation and information resource called the Computational Power Grid has been described by the recent book entitled The Grid: Blueprint for a New Computing Infrastructure [40]. The Grid will connect the nation's computers, databases, instruments, and people in a seamless web, supporting emerging computation-rich application concepts such as remote computing, distributed supercomputing, tele-immersion, smart instruments, and data-mining.<br\/><br\/>To realize this vision, significant scientific and technical obstacles must be overcome. Principal among these is usability. Because the Grid will be inherently more complex than existing computer systems, programs that execute on the Grid will reflect some of this complexity. The Grid resources will be useful and accessible to scientist and engineers requiring new software tools that embody major advances in both the theory and practice of building Grid applications.<br\/><br\/>The goal of the Grid Application Development Software (GrADS) Project is to simply distribute heterogeneous computing in the same way that the World Wide Web simplified information sharing over the Internet. The GrADS projects will explore the scientific and technical problems that must be solved to make Grid application development and performance tuning for real applications an everyday practice.","title":"Next Generation Software: Grid Application Development Software (GrADS)","awardID":"9975020","effectiveDate":"1999-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["24590","229226","309293"],"PO":["301532"]},"46441":{"abstract":"In the past decade, the number of subscribers to mobile and wireless communication services has grown at an exponential rate. Concurrently, emerging wireless devices have enabled new modes of communication beyond traditional cellular voice. However, to remain continually \"connected,\" users face the frustrating task of manually coordinating a vast disarray of services, devices, and wireless technologies.<br\/><br\/>The goal of this project is to develop a platform for truly seamless communication throughout environments as fundamentally different as high-speed indoor wireless and conventional cellular systems. The investigators propose to design, build, and evaluate RENE (Rice Everywhere NEtwork), a multi-tier system that provides network- and application-level services using a single network interface card. The key innovations of the RENE project are as follows:<br\/><br\/>1. The design of an mNIC (multi-tier Network Interface Card), a novel network interface card that is reprogrammable on-the-fly to different physical- and network-layer standards. The mNIC will support soft handoffs, both horizontally within a tier and vertically among tiers, including transitions from a prototype 100 Mbps indoor wireless LAN protocol to commercial CDMA cellular standards.<br\/><br\/>2. The building of a proxy file system that enables seamless and consistent access to a user's home working environment, independent of the user's location or available network resources. The system will respond to changes in available capacity using transcoders, allow consistent reading and writing of files (even when transcoded), and facilitate network-awareness in unmodified applications.<br\/><br\/>3. The investigators will perform an extensive measurement and modeling study of proxy traffic using multi-fractal models. Using these results, policies will be devised which enable the proxy to make intelligent decisions on when and to what extent to transcode or store user data to best meet user performance objectives.<br\/><br\/>4. The development of a new coarse-grained approach to resource reservation and admission control that enables users to obtain predictable performance in multi-tier environments. The key technique is to abstract system resources into networks of virtual bottleneck cells such that by provisioning resources in the virtual cells, quality of service objectives can be satisfied in the actual system.<br\/><br\/>This research will be conducted in collaboration with Nokia and Texas Instruments in order to build a complete prototype implementation of the RENE system and demonstrate its capabilities.","title":"Wireless Technology: Seamless Multitier Wireless Networks for Multimedia Applications","awardID":"9979465","effectiveDate":"1999-10-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["542042","50058","497441","548310","548177"],"PO":["250082"]},"36542":{"abstract":"Abstract <br\/><br\/>IIS-9820794<br\/>Metaxas, Dimitris<br\/>University of Pennsylvania<br\/>$150,658 - 12 mos.<br\/><br\/>Coupling Deformable Model and Pixel Affinity Methods for Medical Image Segmentation and 3D Organ Reconstruction<br\/><br\/>This is the first year funding of a three year continuing award. This research develops new and efficient methods for segmenting radiological data of internal organs and reconstructing their 3D shape, to improve clinical practice and medical<br\/>education. These new methods allow the inclusion of image features such as patterns, textures and contours, to the storage and retrieval of data from the patient databases of the future. The methods we develop do not depend on the imaging modality used and can<br\/>be used for any type of internal organ. However, given the focus of our current research, we segment primarily the lungs and the heart and secondarily the brain. Such data are routinely used at the University of Pennsylvania. In particular we develop 1) methods for detecting and segmenting the boundaries of internal organs, 2) methods for detecting<br\/>abnormalities in the form of lesions, such as cancers and infections, 3) appropriate user interfaces so that the segmentation results can be superimposed on the radiological image, 4) 3D reconstructions of the shape of the internal organs using deformable models and splines, 5) the necessary evaluation procedures to test the accuracy of the segmentation methods and the efficacy of the user interface.","title":"Coupling Deformable Model & Pixel Affinity Methods For Medical Image Segmentation & 3D Organ Reconstruction","awardID":"9820794","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[92089,"522465"],"PO":["234178"]},"46255":{"abstract":"Current mining technology typically applies to centrally stored data (i.e., in one single repository, with central administration, etc.). However, real-life datasets are often decentralized (i.e., consisting of several tables, perhaps obtained via normalization or partitioning \/ allocation, stored in several repositories). The goal of this research project is to develop mining techniques for decentralized data. The key idea is that in contrast to traditional techniques (where the data is joined first to form a single table), the decentralized approach concurrently generates partial results on the separate tables, and thereafter, the foreign key relationships are utilized to merge these results. A similar approach is examined for classification in decentralized datasets, and the techniques chosen are those most amenable to decentralization, or as indicated by the applications. Efficiency analyses is used to assess the techniques, and empirically validated on available synthetic and real datasets. The effect of different database design choices on the decentralized mining algorithms is also considered. Systematic techniques are developed to use, together with the catalog statistics, the details of database design (e.g., normalization, and partitioning\/allocation information) to optimize for efficient execution. Furthermore, the techniques can be applied to mining distributed relational metadata for public information repositories; e.g., it can help simple web searching as well as allow programming advanced applications, such as information mining, for the datasets referenced - initially for those by students, and thereafter, users of any Web-based datasets. This research also benefits educational activities and provides research experience for graduate students involved in project.","title":"Mining Databases Across Multiple Tables","awardID":"9978510","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["337623"],"PO":["563751"]},"46145":{"abstract":"IIS-9977981<br\/>Robert L. Givan<br\/>Purdue University<br\/>$77,529 - 12 mos<br\/><br\/><br\/>Effective Planning Using Compact Problem Representations<br\/><br\/><br\/>This is the first year funding of a three year continuing award. This project examines new techniques for solving very large planning problems in stochastic domains. In many realistic domains, where the effects of actions cannot be deterministically given, Markov Decision Processes (MDPs) are a natural formal representation. Many important problems in both industrial applications (e.g., Federal Express package routing) and cognitive modeling (e.g., problem-solving in uncertain domains, route finding, naive human planning) are naturally represented using the MDP formalism. The operations research literature has provided effective methods for solving problems represented as MDPs for domains in which the number of possible states of the system is relatively small (less than 100,000 or so). However, most industrial and artificial intelligence domains do not meet this restriction. Recent AI research has shown that it is possible to exploit propositional structure in the state space in order to compactly represent and solve larger MDPs than was previously possible. Traditional AI planning research has concentrated on deterministic planning domains, and has relied heavily on compact, logical representations for such domains. This project aims to apply many of the lessons learned in deterministic planning to the stochastic setting by designing new compact representations for MDP problems while retaining the effectiveness of traditional MDP solution techniques. Use of such representations would allow the description and effective solution of much larger MDP problems than is currently possible, resulting in the automated near-optimal solution of many practical planning and optimization tasks that currently require heuristic solution by hand","title":"Effective Planning Using Compact Problem Representations","awardID":"9977981","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["402461"],"PO":["564456"]},"58399":{"abstract":"","title":"CAREER: Progressive coding and transmission of images and video","awardID":"0096070","effectiveDate":"1999-10-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["516912"],"PO":["564898"]},"40150":{"abstract":"Cellular networks, used in wireless and mobile communications under multiple access conditions, depend upon good protocols to (a) allocate spectral bandwidth in the presence of interference, (b) control access among participating users and (c) support robust quality of service in a seamless manner. This proposal addresses a common underlying goal of resource management protocols, viz. the provision of guarantees on performance measured in terms of network indicators such as spectral efficiency, rate of call loss or call blocking, fraction of successful handoffs and the complexity of control mechanisms. Naturally, these performance guarantees are subject to the service quality factors and to the radio interference constraints in the modeled topology of the network.<br\/><br\/>The researcher proposes the design and analysis of new, distributed protocols to adaptively allocate spectrum resources, implement call admission and support handoffs while simultaneously trying to optimize one or more desireable performance factors, e.g. maximizing spectral utilization, minimizing interference, maintaining acceptable service quality etc. The work is further expected to focus on strategies that react quickly to changing local conditions and that try to avoid centralized planning and control as much as possible. Building upon encouraging preliminary results, this proposal will use a general approach that consists of formulating such protocol design problems as instances of online, approximation algorithms competing with unknown but optimal \"adversarial\" protocols.<br\/><br\/>The overall goals of this work are two-fold. First the researcher will develop a suite of protocols in conjunction with realistic models that account for constraints as faithfully as possible, while guaranteeing theoretically derived bounds on performance. In addition, the work will be complemented by collaborations with undergraduate students to develop a comprehensive web-based visualization tool that can be used to validate the protocols through extensive empirical testing on both systhesized and real-world network traffic data.","title":"Adaptive Protocols For Cellular Networks: Modeling & Implementation","awardID":"9903240","effectiveDate":"1999-10-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["398251"],"PO":["234222"]},"45991":{"abstract":"EIA-9977471<br\/>Pullen, J. Mark<br\/>Setia, Sanjeev<br\/>George Mason University<br\/><br\/>MRI: Acquisition of a Superworkstation Cluster for Research and Teaching in Distributed Agent-based Computing<br\/><br\/>This proposal requests funding for a major improvement in the research and teaching instrumentation for an extended research team in the Department of Computer Science of George Mason University. The requested equipment involves a cluster of super-workstations which will expand the current research and teaching infrastructure by an order of magnitude. The equipment will be dedicated to the research and teaching needs at the cutting edge of Distributed Computing and Agent Software.","title":"MRI: Acquisition of a Superworkstation Cluster for Research and Teaching in Distributed Agent-Based Computing","awardID":"9977471","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["311712","252984"],"PO":["557609"]},"45562":{"abstract":"EIA-9974976<br\/>Purdue University<br\/>Eigenmann, Rudolf<br\/><br\/>Compiling for Speculative Distributed Microarchitectures<br\/><br\/>This project introduces a novel compiler paradigm called conservative-assumption-free compilation, which breaks the barrier of a conservative compile-time assumption, one of the most severe limitations of current generation of compilers. The new paradigm is enabled by emerging speculative, distributed microarchitechtures. In the proposed project the PIs will implement a full compiler system for such architectures. The effort will complement the already-onging Purdue Multiplex architecture project being investigated by the same PIs.<br\/><br\/>Purdue Multiplex combines trends of increasing on-chip integration with aggressive speculative instruction execution. Its distributed, single-chip microarchitecture integrates conventional multiprocessor thread-level parallelism with speculative execution of today's aggressive superscalar processors. The compiler generates threads, which are not necessarily independent, from a sequential program and the hardware guarantees correctness in case of inter-thread control\/data dependencies via speculation and rollback mechanisms. By providing support for thread-level speculation, the hardware relieves the compiler of the burden of guaranteeing inter-thread independence, enabling our conservative-assumption-free compilation paradigm. Our compiler will speculatively parallelize the unexplored domain of non-numeric applications via new analyses and novel transformations. Our compiler will tightly integrate techniques to exploit both instruction-level and thread-level parallelism.","title":"CISE Next Generation Software: Software Systems: Compiling for Speculative Distributed Microarchitectures","awardID":"9974976","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["558595","342332","550778"],"PO":["301532"]},"46135":{"abstract":"This research project proposes to study the use of groupware calendar systems within a number of organizations that have widely adopted them. Because local calendaring practices vary from site to site, the result is a variety of calendar cultures that afford different coordination behaviors within these organizations. In addition, the imminent availability of open standards created by the Internet Engineering Task Force (IETF) in support of calendar application interoperability means that calendars can more easily be shared across organizational boundaries (i.e., between businesses, public institutions and homes.) Thus, there are new opportunities for the use of shared groupware calendars across organizations (i.e., \"global calendaring\" practices). The PI will examine the IETF-Calsh standards design and their potential impacts on calendaring use and technology adoption across businesses as well as in home environments, with special attention to the practices and impacts of merging professional and personal calendars. This research will advance our understanding of collective time management practices within and across organizations, as well as between home and work.","title":"Local and Global Electronic Calendaring","awardID":"9977952","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["489545"],"PO":["565227"]},"47136":{"abstract":"The impact of this work will be threefold. The immediate result will be a prototype system for using software visualization for understanding. Educationally, the work will expose students to visualization as a means of understanding and get them interested and involved in working on the difficult problems inherent in visualization and understanding. Finally, the broader impact of this project will be to establish foundations for future software visualization and understanding efforts by solving some of the basic problems in these areas.","title":"Visualization for Software Understanding","awardID":"9982266","effectiveDate":"1999-10-15","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["448702","550484"],"PO":["551992"]},"42670":{"abstract":"The characteristics of data-distribution in high dimensional Euclidean space play a fundamental role in many areas of computer science, including database systems, pattern recognition and multimedia. Several basic data distribution properties, namely the angle, the distance and the radius properties in high dimensional Euclidean Space are being investigated. Both real data sets such as feature vectors for image data and synthetic data sets with distributions such as normal, zipf, self similar and fractal are being used to analyze these properties. A component of this research is to exploit these basic properties in developing efficient indexing schemes for nearest neighbor search. Significant performance improvement in search time in the proposed approach over those currently available is expected in this research. In addition, there is a plan to apply the indexing scheme to commercial image database systems.","title":"SGER: Data-Distribution Properties in High Dimensional Euclidean Space and their Applications in Optimizing Multi-Media Database Accesses","awardID":"9910605","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["550626"],"PO":["563751"]},"42131":{"abstract":"Recent developments in science and technology have advanced capabilities to both fabricate and control material systems on the scale of nanometers. These developments, in turn, have brought problems of materials behavior on nanometer scale into the domain of engineering. The field of mechanics has an important role to play in bringing new ideas to practical fruition and in enabling the technologies to meet a range of societal needs. The branch of mechanics research in this emerging field can be termed \"nano- and micro-mechanics of materials\". It is timely for the mechanics community to focus its thinking on the underlying challenges and to establish an effective, reliable national program and infrastructure on nano- and micro-mechanics of materials.","title":"Workshop on Nano and Micromechanics of Solids for Emerging Science and Technology, October 7-8, 1999, Palo Alto, California","awardID":"9909165","effectiveDate":"1999-10-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1441","name":"MECHANICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1444","name":"SURFACE ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}}],"PIcoPI":["478553"],"PO":["371937"]},"44133":{"abstract":"EIA-9970046<br\/>University of Massachusetts<br\/>Allen R. Hanson<br\/><br\/>NSF-CNPq Collaborative Research on Classification Methodologies Applied to Aerial Imagery for Environmental Monitoring and Urban Planning<br\/><br\/>This proposal is for a collaborative effort between the University of Massachusetts (UMass) Computer Science Department in the US, and the University of Sao-Paulo at Sao Carlos (USP) in Brazil within the NSF-CNPq Collaborative Research Opportunities. Our proposed collaboration involves the development and evaluation of classification methodologies applied to aerial image interpretation..The proposal will address two application domains.<br\/><br\/> (a) Environmental Monitoring-classification of vegetation species to determine the state of the environment, land use, change detection, etc. This project will be conducted in partnership with Conservation International (CI) which has an important ongoing environmental project in the state of Bahia, Brazil.<br\/><br\/> (b) Urban Planning-determination of functional categories in cultural areas, including the classification of buildings, roads, parking lots, fields, lakes, rivers, ponds, etc.","title":"NSF-CNPq Collaborative Research on Classification Methodologies Applied to Aerial Imagery for Environmental Monitoring and Urban Planning","awardID":"9970046","effectiveDate":"1999-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1513","name":"REGIONAL INST-GLOBAL CHNGE,ATM"}}],"PIcoPI":["290021","290022",112249],"PO":["301532"]},"42076":{"abstract":"Network systems and applications, including both established technologies <br\/>like wireless voice networks, the internet, and video services and emerging <br\/>technologies like wireless multimedia, distributed computing, and ubiquitous <br\/>computing, are undergoing explosive growth. While these systems differ in <br\/>many ways, a key bottleneck is common to all of them: The utility of each <br\/>of these technologies is limited by the amount of information that can be <br\/>sent through the corresponding network. Since bandwidth is scarce, making <br\/>the best use possible of the data rates available is critical. Thus use of <br\/>efficient data representations, or source codes, is imperative for maximizing <br\/>system performance in network technologies. <br\/><br\/><br\/>This research considers new paradigms for source coding in network systems <br\/>and compares those paradigms to existing approaches. The analysis involves <br\/>theoretical proof of concept, demonstration of practically achieved gains on <br\/>real data sets, and development of efficient codes to achieve those gains. <br\/>Current work focuses on source coding for broadcast systems. Broadcast <br\/>systems play a central role in all of the above network technologies, where <br\/>one system node ``broadcasts'' both common information (intended for all <br\/>users) and specific information (intended for a subset of the users) to the <br\/>other nodes in the network. Existing methods for source coding in broadcast <br\/>systems use collections of traditional (single-transmitter, single-receiver) <br\/>source codes within the (single-transmitter, multiple-receiver) broadcast <br\/>system. Current work aims to demonstrate and quantify the gains achieved by <br\/>abandoning this approach in favor of source codes optimized for broadcast <br\/>systems.","title":"Exploring Source Codes for Network Technologies","awardID":"9909026","effectiveDate":"1999-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["551140"],"PO":["564898"]},"58445":{"abstract":"","title":"NYI: Surface Splines Over Irregular Meshes","awardID":"0096116","effectiveDate":"1999-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["486405"],"PO":["179846"]},"46268":{"abstract":"This goal of this research project is to develop efficient query optimization and query execution methods for data integration systems. Data integration systems provide uniform access to a multitude of autonomous data sources within an enterprise or on the World-Wide Web. Unlike in traditional database applications, a query execution engine for data integration must be able to cope with limited availability of statistics on the underlying data and with unexpected network delays during query execution. The approach consists of developing an adaptive query execution engine for data integration. Two kinds of adaptivity are considered: (1) interleaving of query optimization and execution, and (2) developing novel query execution operators that are tailored to data integration. In the first part, algorithms for determining appropriate points at which to suspend query optimization are considered. For the second part, novel join implementations are considered (e.g., the double-pipelined join), as well as operators that are needed only in the data integration context (e.g., dynamic collectors performing unions over large collections of sources). In addition, issues involving the integration of semi-structured data (e.g., XML) are also addressed. The results of the research include the implemented Tukwila data integration system, which will be made available to other researchers in the field. The impact of the research will be to remove the performance bottleneck that hinders fielding data integration systems in the WWW and enterprise contexts. We will be able to process data integration queries involving 10's of MB of data coming from external sources in real time.<br\/>http:\/\/data.cs.washington.edu\/integration\/tukwila","title":"Efficient Query Processing for Data Integration","awardID":"9978567","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["278933"],"PO":["563751"]},"39987":{"abstract":"Many searchable text information sources are available in the Internet. The desired documents of a user are often stored in multiple heterogeneous sources, making it difficult for a user to find desired documents in the Internet. Automatic search brokers (metasearch engines) that can invoke multiple search engines are needed so that a user can find desired documents from multiple sources using a single query. This collaborative project is to develop techniques needed for the next generation metasearch engines. Highly scalable methods that can accurately estimate the usefulness of an information source with respect to each user query are to be developed. These methods would enable the metasearch engine to search only a small number of sufficiently useful information sources for each query, avoiding wasting resources for searching useless sources. Linkages among documents are to be used to improve the retrieval of relevant documents. A concept hierarchy is to be used to disambiguate the meanings of terms. Techniques that while guaranteeing the retrieval of all potentially useful documents from a local search engine, also minimize the retrieval of useless documents are to be investigated. Good solutions to the problem of merging results from multiple sources into a single ranked list are also sought. Developed techniques will be shown to significantly improve existing ones in both efficiency and effectiveness. A metasearch engine incorporating developed techniques on top of major university search engines will be implemented and made publically accessible.","title":"Determining Text Databases to Search in the Internet","awardID":"9902792","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["389044"],"PO":["563751"]},"47137":{"abstract":"Advances in computing technology are making simulation as important to science today as theory and experiment have been in the past. Unfortunately this success is overwhelming the scientific community by drowning scientists in the data produced. Because of storage, network, and graphics bottlenecks, more data is produced than can be analyzed or visualized. Valuable information is being lost or neglected because of these deficiencies. Additionally, scientists are painfully aware of this technological bottleneck, and it affects how they conduct their science. It slows the rate of data acquisition, and calculations that could generate higher-dimensional data, e.g. vector and tensor, are not being performed. The goal of this project is to address the visualization bottleneck by developing multiresolution software tools that will facilitate understanding of large-scale experimental and simulation datasets. The project will then apply these new techniques to data from physics and biology, thus providing advances in fluid dynamics and neuroscience. We will do this by close interactions with the discipline scientists, including using their feedback to improve initial designs of our tools.<br\/><br\/>The technical approach of the project is based on the fact that the graphics workstations available to most scientists are incapable of visualizing giga- and tera-scale datasets. It is also clear that for the foreseeable future our ability to generate data will outpace our ability to render and visualize it. Therefore we must develop methods for representing, segmenting and compressing these enormous datasets into a form that can be processed on today's graphics computers. Multiresolution representations and algorithms are at the core of the methods and tools to be developed. A multiresolution approach allows visualization techniques to scale to enormous datasets by focusing resources in those regions of the dataset most important to the user. For example, multiresolution modeling and display techniques will allow a user to view a single dataset at a coarse level-of--detail, and easily provide pertinent details only in those regions of greatest interest. During analysis, multiresolution methods can allocate more computational resources in segments of the data with the greatest rates of change or containing specific properties. This project will produce a set of multiresolution software tools for processing and visualizing large-scale N-dimensional (scalar, vector and tensor) volumetric datasets (NDVDs), as well as large-scale triangle meshes. Specifically, tools for segmenting and interpolating NDVDs using level-set methods, extracting semi-regular meshes directly from volume datasets, compressing triangle meshes, and volume rendering NDVDs will be developed. As tools become available they will be deployed to scientists at Caltech's Center for Simulation of Dynamic Response of Materials (sponsored by DOE), and to scientists at the National Center for Microscopy and Imaging Research (UC San Diego).","title":"Multiresolution Visualization Tools for Interactive Analysis of Large-Scale N-Dimensional Datasets","awardID":"9982273","effectiveDate":"1999-10-15","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1171","name":"PHYLOGENETIC SYSTEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1112","name":"Genetic Mechanisms"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}}],"PIcoPI":[120668,"285304","320958","453840"],"PO":["562362"]},"47148":{"abstract":"The proposed research seeks to develop sophisticated dynamic graphics tools interactive exploratory analysis of very large datasets. These tools, when used in conjunction with data mining algorithms, will enable the user to (1) detect local departures from an overall trend, (2) detect structure in sparse high dimensional data, (3) select data dependent preprocessing steps (e.g., scaling., normalization, feature extraction,) to enhance the effectiveness of automated numeric or symbolic \"machine learning\" algorithms, (4) refining solutions obtained with machine learning algorithms, (5) explore the differences in inductive and representational biases of alternative machine learning algorithms (e.g., decision trees versus neural networks), and (6) overview the data space as well as the complex relationships discovered by the data mining algorithms.","title":"Interactive and Dynamic Visual Overviews of Large Multi-Dimensional Data","awardID":"9982341","effectiveDate":"1999-10-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["560586","376529","530406"],"PO":["551992"]},"46422":{"abstract":"The research studies the design of agile wireless networks that<br\/>accommodate time variations in the communication channels, the<br\/>information sources, and the network topology.<br\/>The research will lead to design principles that, in addition to <br\/>enabling more efficient use of the current cellular and PCS bands, will allow <br\/>exploitation of frequency bands in the 10-100 GHz range to provide high-speed <br\/>multimedia services for both indoor and outdoor applications. While the basic <br\/>cellular paradigm of wireless access to a high-speed communication and<br\/>computing backbone will be adhered to, nearly every other assumption<br\/>in existing second-generation and projected third-generation cellular<br\/>and PCS networks will be reexamined. Some of the significant differences<br\/>from current designs are as follows. A dense network of base stations<br\/>will provide connectivity despite the high path losses<br\/>and sharp shadowing at higher frequency bands. Cells with<br\/>well-defined boundaries may no longer exist, and mobile terminals will<br\/>see a rapidly varying network topology. A variety of traffic classes,<br\/>such as voice, data, and video, with diverse requirements regarding<br\/>delay, loss, quality of reproduction, and number of potential receivers<br\/>will be considered.<br\/><br\/>The integrated research effort is being conducted by five overlapping<br\/>research teams of University of Illinois faculty investigators and<br\/>their students, organized around the following interdisciplinary projects:<br\/>(1) Concept Systems, Modeling, and Performance Limits,<br\/>(2) Design Principles for Wireless Packet Networks,<br\/>(3) Design for Time-Varying Channels,<br\/>(4) Jointly Optimized Source Coding, Channel Coding, and Estimation, and<br\/>(5) VLSI Algorithms, Architectures, and Bounds.<br\/>The investigators are applying their expertise in digital signal<br\/>processing, communication systems, networking, circuit design and control.<br\/>A diverse array of methods will be applied, including modeling<br\/>and simulation, application of adaptive and universal algorithm<br\/>methodologies, exploitation of antenna arrays and polarization for<br\/>diversity and beamforming, algebraic coding techniques, linear and nonlinear<br\/>optimization techniques, information theory, and laboratory<br\/>implementation and measurement.","title":"An Integrated Exploration of Wireless Network Communication","awardID":"9979381","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["456909","470450","381437","549356","348133"],"PO":["564898"]},"46433":{"abstract":"9979443<br\/>Giannakais<br\/><br\/>Emerging broadband wireless networks for multimedia information dissemination demand increasingly higher and variable rates. The integration of wireline-wireless networks, the size and low-power limitations in portable units, user mobility, and channel propagation effects pose major challenges to wideband communications. Code division and multicarrier systems offer two multiple access schemes with great potential to cope with these challenges, provided that their complementary advantages and performance limitations, in the presence of multipath propagation and multiuser interference, are addressed.<br\/><br\/>The PI's propose to develop and analyze an optimal generalized multicarrier code division multiple access (MC-CDMA) system for broadband wireless mobile communications. Specifically, they take a global system view that incorporates adaptive, scalable and robust joint source\/channel coding and multiple access techniques subject to power consumption and networking constraints. Their flexible generalized MC-CDMA precoder designs guarantee perfect interference elimination with simple linear receivers and are robust to channel fading effects.<br\/><br\/>Basic research, algorithms, and analytical performance evaluations are complemented by experimental validation with a millimeter-wave software radio testbed. The experimental facility will also foster enhanced student training and multidisciplinary research and development with committed collaborators at the University of Minnesota and the local industry.<br\/>***","title":"Mobile Communications and Networking: Low Power\/Complexity Transceivers for Adaptive Integrated Wireline-Wireless Multimedia Transmissions","awardID":"9979443","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1598","name":"WIRELESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1504","name":"GRANT OPP FOR ACAD LIA W\/INDUS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["515560",118493,"480652","564051","121430"],"PO":["239665"]},"45597":{"abstract":"Abstract <br\/><br\/>IIS-9975164 <br\/>Larson, Ray <br\/>University of California<br\/>$105,497 - 12 mos. <br\/><br\/>DLI-International: Cross-Domain Resource Discovery: Integrated Discovery and Use of Textual, Numeric, and Spatial Data<br\/><br\/>This is the first year funding of a three year continuing award. This project is a collaboration between the University of California, Berkeley and Special Collections and Archives , the University of Liverpool Library. The goal is to advance cross-domain searching capabilities in a multi-database environment. The effort is intended to result in a next generation online information retrieval system based on international standards that will facilitate searching on the Internet across collections of original materials, printed books, records, archives, manuscripts, and museum objects, statistical databases, full-text, geo-spatial, and multi-media data resources.","title":"DLI-INTERNATIONAL: Cross-Domain Resource Discovery: Integrated Discovery and Use of Textual, Numeric, and Spatial Data","awardID":"9975164","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["497619"],"PO":["433760"]},"58468":{"abstract":"","title":"Electronic Information Literacy for Educational Environments","awardID":"0096139","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["541869"],"PO":["563751"]},"38503":{"abstract":"EIA-9876619<br\/>Karr, Alan F.<br\/>National Institute for Statistical Sciences<br\/><br\/>Digital Government: A Web-Based Query System for Disclosure-Limited Statistical Analysis of Confidential Data<br\/><br\/>Working with several Federal statistical agencies, this grant will address an important topic for Federal statistical agencies. As part of their missions, these agencies collect a great deal of microdata (data related to an individual or particular business); this data must remain confidential. Thus, only aggregated microdata is provided publicly. However, the aggregation process reduces much of the value of the microdata for deriving knowledge to be used in research, policy and commercial purposes, so there is a balancing need to provide as much data as possible. What is proposed here is a large-scale system which tracks the history of provision of derived data and which \"understands\" and can quantify the potential for working backward from the derived data of confidential microdata.","title":"Digital Government: A Web-Based Query System for Disclosure-Limited Statistical Analysis of Confidential Data","awardID":"9876619","effectiveDate":"1999-10-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"X291","name":"BUR OF CENSUS-RES ON SURV METH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W097","name":"LABOR-NSF DIGITAL GOVERNMENT P"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X339","name":"BUREAU OF CENSUS-WEB BASE QUER"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X373","name":"GSA-WEB BASED QUERY SYS FOR DI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["531363"],"PO":["371077"]},"47138":{"abstract":"The objective of the proposed reserch is to develop a new class of data analysis methods. This will involve on-the-fly identification of physically-important events selectively store the data. This database will then be interrogated by feature extraction algorithms to yield an additional object database, which is a compact representation of the physically important space-time object trajectories. These database objects will be used as input to novel data mining methods to discover causal relationships between the objects. This approach will result in efficient storage of data, visualization of the important events within the data set, and methods for the high-level analysis of relationships between objects in the data.","title":"Dynamic Feature Extraction and Data Mining for the Analysis of Turbulent Flows","awardID":"9982274","effectiveDate":"1999-10-15","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}}],"PIcoPI":["304684","531622","421670","271975","565146"],"PO":["551992"]},"41385":{"abstract":"Abstract<br\/><br\/>IIS-9907060<br\/>Latombe, Jean-Claude<br\/>Stanford University<br\/>$122,673 - 12 mos.<br\/><br\/>Modeling Human-Body Soft Tissues for Surgical Applications<br\/><br\/>This is the first year funding of a three year continuing award. The goal of this research is to develop a general-purpose computational scheme for representing the geometry and physics of human-body soft-tissue structures and simulating their displacements <br\/>and deformations in real-time when external forces are applied by surgical instruments. The ability to realistically model soft tissues on a computer has the potential to radically change the ways surgery is currently taught and practiced. Virtual environments simulating deformable tissues will allow medical students to extensively practice delicate operations and confirmed surgeons to re-train themselves and maintain their skills for infrequent operations. Soft-tissue simulations will become essential to plan and rehearse surgical operations. The on-line availability of the models will make it possible to give intra-operative assistance to the surgeons. It will enable the introduction of roboticized instruments that will perform operations, either automatically or in interaction with surgeons. Research on soft-tissue modeling will directly benefit domains such as robotics, where the modeling of environments containing deformable objects is increasingly important; computer vision, where the task of tracking objects undergoing continuous deformations is central to understanding image sequences; and computer graphics, especially for the animation of virtual characters.<br\/><br\/>Previous research on soft-tissue modeling provides foundations on which the proposed research is based. In particular, as several researchers have suggested before, tissue structures will be modeled by meshes of point masses connected by elastic links, the so-called mass-spring elastic meshes. The research program includes both the theoretical development of a computational scheme based on the elastic mesh concept and the implementation\/experimentation\/evaluation of this scheme within a state-of-the-art virtual reality environment. The experiments will be conducted in the context of two applications: micro-anastomosis (the suturing of small blood vessels) and craniofacial surgery. This experimental effort will be critical to the validation of the results.<br\/><br\/>The unique features that this research expects to achieve are the following: - Modeling of complex tissue structures. Most existing models can only represent a tissue with uniform and isotropic elastic properties. Techniques will be developed to specifically model multiple adjacent soft tissues and their attachment to bones. - Realistic modeling of the mechanical response of individual tissues. To simplify computations a number of models assume linear elastic models. But human-body tissues are nonlinear and exhibit some <br\/>hysteresis. These properties will be captured in the new modeling scheme. - Modeling changes in tissue topology. External forces may cause topological changes in tissue structures, such as tissue cutting or tearing and formation of new contacts. A significant portion of the effort will be directed toward the effective modeling of such changes.<br\/>- Dynamic simulation. A simulator may only compute static equilibrium states of a tissue. Instead, by taking inertia and viscosity into account, it may compute the successive shapes of the tissue as it deforms toward equilibrium. The research will focus on <br\/>the second type of simulation. - Automatic construction of tissue models. Techniques will be developed to automatically generate complex elastic meshes and adjust their mechanical parameters from various imaging sources (e.g., video, laser scans, Computed Tomography, Magnetic Resonance Imaging).<br\/><br\/>The research will be conducted in close collaboration between the Computer Science Department, the Functional Restoration Department, and the Stanford-NASA National Biocomputation Center. A key mission of this center is to accelerate the transfer of imaging and visualization technologies to operating rooms and surgical training.","title":"Modeling Human-Body Soft Tissues for Surgical Applications","awardID":"9907060","effectiveDate":"1999-10-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["264577"],"PO":["234178"]},"47018":{"abstract":"This is a twelve month SGER award. Heterogeneity is a major issue in building distributed (e.g. multi-agent) information systems, and in communication in general. To get effective answers to queries or to develop a productive ongoing information-based interaction, participants have to build and maintain global correspondences between their respective local representations of information and activities. The dominant approaches to this (standards for representation and interchange, and translation to and from common base interlingua) depend on pre-established languages and rules for representing information and exchanging it. More importantly, theories that underpin these approaches depend on the prior existence of these structures and standards. Consequently, most effort goes into designing the standards and rules, rather than questioning the validity of these approaches as a whole or looking for a truly new and more flexible alternative. This project investigates a new, exploratory, dynamic approach, based on the evolution of interaction languages. The idea is to reverse the dominant picture described above, and to use interaction as the vehicle for creating emergent, dynamic bridges among information worlds. The eventual aim is to provide robust theories and techniques for the co-evolution of lexicons, syntaxes, grammars, semantics and eventually even higher-order social structures such as organizational forms and cultures (treated as information processing media) in distributed interaction. The new approach will improve the handling of openness, and will detail mechanisms and limits of language evolution, so we know just how heterogeneity will be bridgeable with limited resources or time. The research will a) investigate language generation\/evolution in human collaborative settings, b) investigate computational theories of the limits and mechanisms of language evolution, c) hypothesize bounded mechanisms to explain the observed and theoretically possible processes, and d) build preliminary computational models as proofs of concept and to explore actual mechanisms that can be useful in fully-automated contexts.","title":"SGER: Multiple Agents and Distributed Language Dynamics","awardID":"9981797","effectiveDate":"1999-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["503214"],"PO":["433760"]},"40781":{"abstract":"9905322<br\/>Hughey, Richard<br\/>Karplus, Kevin<br\/>U of California, Santa Cruz<br\/><br\/>CADRE: The UCSC Kestrel Server: Remote Parallel Processing and Computational Biology<br\/><br\/>This award provides support for high-speed computational biology servers using remote parallel processing architectures based on the University of California, Santa Cruz Kestrel Parallel Processor. This computational infrastructure will focus on the sequence analysis needs of the Human Genome Project and the general field of computational biology. A number of access servers will be developed and made available on the Web as a resource for researchers in the field. The University will develop outreach materials and activities to encourage smaller institutions to use Kestrel.","title":"CADRE: The UCSC Kestrel Server: Remote Parallel Processing and Computational Biology","awardID":"9905322","effectiveDate":"1999-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":[103256,"505531"],"PO":["297837"]},"41485":{"abstract":"Many real-world problems such as robot motion planning, scheduling, frequency assignment in wireless networks, and network resource allocation can be represented as constraint satisfaction problems (CSPs) that are based on constraint networks. These types of problems are usually distributed, dynamic, and contain large numbers variables and constraints. The development of adaptive algorithms that are capable of solving large-scale, distributed, dynamic problems is a necessity. In this proposal, the PI describes a research program that investigates the use of hybrid genetic algorithms (HGAs) for evolving solutions to recurrent, dynamic CSPs (RDCSP). A RDCSP can be viewed as a CSP where the constraints, variables, and values of variables are temporarily added or removed. RDCSPs can be based on either centralized or distributed constraint networks. This research will lead to a greater understanding of the types of RDCSPs that are most challenging for HGAs and hill-climbing algorithms, and will result in the development of an HGA that searches more efficiently than the hill-climbing","title":"Evolving Stable Solutions to Centralized and Distributed Dynamic Constraint Networks Using Hybrid Genetic Search","awardID":"9907377","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["554885"],"PO":["491702"]},"41012":{"abstract":"This award is made under section B., Connections for Higher Education Institutions, within \"Connections to the Internet\", NSF 98-102. It provides partial support for South Dakota State University in partnership with the Capital University Center (CUC) to gain access to statewide network resources and the Internet. The Center's purpose is to bring college education to an area in the central part of the state where colleges and\/or universities are over 125 miles away. The work will be done in partnership with South Dakota State University (SDSU) who is the provider of delivery of courses and programs needed for workforce development and continuing education. Availability to the Internet will be provided to faculty, staff, and student members of this rural community.","title":"Capital University Center Connection to the Internet","awardID":"9906045","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[103818,"157522"],"PO":["182196"]},"40044":{"abstract":"The general topic of the proposal is advanced reservations in itegrated packet networks. The ability to secure in advance the resources needed by a distributed application is becoming increasingly important. This is true, not only for high-end scientific or medical applications which require simultaneous access to several facilities and pieces of sophisticated equipment, but also for more mundane applications such as video-conferencing, whose reasonably high resources requirements make it desirable to ensure that the necessary network resources are available at the same time as the conference participants are. Support for advance reservations involves multiple aspects such as extensions to protocols, and in particular reservation (signalling) protocols, and enhanced resource management procedures, e.g., call admission. While there has been a number of previous works addressing both of these aspects, the corresponding two sets of issues have typically been considered separately. In addition, the advance reservation models that have been used, have essentially focused on asingle service model, i.e., the availability of a given amount of resources, from a given starting time, and for a given duration (with possibly a random component in both the starting time and the duration). The goals of this proposal are, therefore , to investigate jointly protocol extensions and enhancements to resource management, as well as consider more general service models for advance reservations. In particular, the researchers will consider the problem of routing of advance reservation requests in the context of an extension to the OSPF protocol, where link state updates have been extended to carry resource availability infromation over different time intervals. This allows for a distributed implementation which improves scalability by avoiding that all advance reservation requests be forwarded to a central server. However, it introduces new problems in order to contain the corresponding increase in protocol traffic while ensuring adequate performance. In that context, the researchers will study issues related to the trade-off between information accuracy and routing performance, and also investigate the use of mechanisms such as preemption priorities to offer applications a range of service options, e.g., request large amount of bandwidth at a low priority together with a small amount at a high priority. In addition, the researchers will also consider, again jointly with the associated routing problem, various extensions to the advanced reservation model, such as mininmizing completion time, maximizing available bandwidth, etc., that are of potential interest to adaptive applications that can modify their behavior according to the available service. The researchers believe that the joint development of the necessary infrastructure, e.g., extensions to the OSPF protocol, and the investigation of desirable extensions to the traditional advance reservation model, will allow them to make significant progress in both our basic understanding of the inherent complexity in supporting advance reservation, and our ability to deploy such capabilities.","title":"Routing and Scheduling Issues in Support of Advance Reservations","awardID":"9902943","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["564485"],"PO":["234222"]},"47975":{"abstract":"The indisputable existence of a racial digital divide calls into question the democratizing potential of new technologies. Evidence that access alone will not be enough to eliminate the divide suggests a consideration of fundamental psychological factors that influence all behavior. The proposed research is a first step in testing a model of computer\/Internet use. Its purpose is to develop methods and measures to examine how motivational, affective and cognitive factors influence the computer\/Internet use of African Americans, and how use, in turn, influences motivation, affect and cognition. African American participants will receive home computers, participate in Internet interventions during home visits and complete survey instruments needed to test a model of computer\/Internet use. Results are expected to be important to understanding why people choose to use or not use computers\/Internet and the impact of use on people. Results will also be important to developing strategies for reducing the racial digital divide.","title":"SGER: The Racial Digital Divide: Motivational, Affective, and Cognitive Antecedents and Consequences of Computer\/Internet Use","awardID":"9985863","effectiveDate":"1999-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["286162","286163",122593],"PO":["495796"]},"44367":{"abstract":"With the rapid advances in computing and communication technologies, there is increasing demand for and reliance on storing a large variety of data types in digital form. Once data is stored digitally, it becomes available for access and retrieval using a variety of parameters. This project addresses the problem of retrieval of multimedia data, which tends to be very large and hence requires a vast amount of storage. To capture the information content of data objects succinctly, it is represented as points\/vectors in a multidimensional data space. Methods for efficient placement and retrieval mechanisms for multidimensional data, based on exploiting redundant and parallel storage, are developed in this project. The role of data partitioning\/declustering and its interaction with indexing to support efficient retrieval of multidimensional data is explored. Efficient partitioning\/declustering techniques for retrieving multimedia data and NASD (networked attached secure disk) and active disk architectures developed during this proposal will be integrated with the NSF sponsored Alexandria Digital Library project at University of California at Santa Barbara, and the results are also expected to have a wide range of applications in multimedia information systems.","title":"Exploiting Storage Redundancy and Parallelism for Efficient Retrieval of Multimedia Data","awardID":"9970700","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["536696","500153"],"PO":["563751"]},"41651":{"abstract":"Abstract <br\/><br\/>IIS-9907892 <br\/>Lagoze, Carl <br\/>Cornell University <br\/>$93,607 - 12 mos.<br\/><br\/>DLI International: Integrating and Navigating Eprint Archives Through Citation-Linking<br\/><br\/>This is the first year funding of a three year continuing award. In this project, a 3-way partnership involving researchers from Southampton University, Cornell University, and the Los Alamos National Laboratory will hyperlink each of the over 100,000 papers in Los Alamos's unique online Physics Archive to every other paper in the archive that it cites. It is hoped that the power of this remarkable new way of navigating the scientific journal literature will help induce authors in others fields to join to create interlinked online archives like Los Alamos across disciplines and around the world.","title":"DLI-International: Integrating and Navigating Eprint Archives through Citation-Linking","awardID":"9907892","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["541699"],"PO":["433760"]},"46997":{"abstract":"The National Research Council will conduct a study that will explore the fundamental challenges in computer science, illuminating the kinds of research, their breadth and depth, associated with the vitality of the field. The project will emphasize, by illustrating those challenges in accessible form, the opportunities in computer science, highlighting key hard problems for future research in the field. It is intended to motivate more research among computer scientists (current and potential) and to generate better understanding of computer science research opportunities among the scientific community at large and policy makers. Broad input and discussion will feed a process of expert focusing and articulation of the intellectual core of computer science. The project will culminate in a detailed report and a popularly accessible summary statement.","title":"Fundamentals of Computer Science--Challenges and Opportunities","awardID":"9981754","effectiveDate":"1999-10-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["298189","234699"],"PO":["321058"]},"46425":{"abstract":"There has been a lot of research work on Wireless ATM in the past 5 years; most of the research works are geared towards mobility and connection management. The former is concerned with location and handoff management while the latter is concerned with signaling for call setup and teardown. What are remaining are still some very open issues that demand answers. In supporting QoS in Wireless ATM, the variation of QoS availability over space and time is different from one wireless cell to another. Mobile calls that are established at call setup may longer to able to maintain their QoS demands if the mobile host migrates from cell to cell, unless pre-allocation of network resources are made in advance (however, this is very inefficient). The trend so far has been towards an adaptive end-to-end Mobile QoS framework for Wireless ATM networks. Although this proposal addresses mobile QoS for Wireless ATM, it is not another duplication of existing efforts. Instead, we are investigating this area of work from another dimension - applying the know-how of control and network theory and protocols. It shall address challenging research issues at the network and transport layers and hence this proposal demands vertically integrated research.<br\/><br\/>Most end-to-end QoS adaptation framework attempts to ensure the QoS (normally the bandwidth and delay requirements) over both wired and wireless links are consistent after a handoff. However, such handoffs can occur on the two remote ends of the mobile-to-mobile connection. If the adaptation protocols are not well designed, the WATM can experience instability problems. The fact that a mobile host or the network triggers an adaptation is a sign of pro-active reaction. This is called sensitivity. A highly sensitive system can also cause substantial signaling overhead and result in network congestion and instability. The instability refers to a regenerative phenomenon where another adaptation process is triggered even before the current one is completed. The innovative approach is to apply control theory and to derive new network algorithms. We plan to introduce a set of damping procedures to control sensitivity and instability associated with continuous and transient oscillation in QoS adaptation. Our plan is to derive these adaptation damping procedures and to implement them on a WATM simulator\/testbed to evaluate the feasibility of the approach and the resultant stability and sensitivity of the system under different traffic load, degree of mobility and number of users. This area of this research proposal, therefore, enhances QoS support and more importantly, the reliability, availability and performance of future broadband wireless network systems. It views the understanding of underlying dynamics associated with QoS adaptation paramount to building high performance and reliable wireless broadband systems.<br\/><br\/>The second part of the research concerns with ABR and VBR flow control in WATM networks. While there has been much on-going research associated with ATM flow and congestion control, little is devoted to wireless flow and congestion control in WATM networks. This proposal reveals the impact of the dynamics associated with SS (Stability and Sensitivity) in QoS adaptation on ABR\/VBR flow control. This is a very genuine problem since current rate-based flow control relies on the use of feedback cells and these cells can be lost as a result of host mobility. The innovative approach has two components: (a) the separation of rate allocation and signaling in a vertically integrated design, (b) the optimization of flow control functions in both space and time. It intends to develop and validate a theory of protocols that enables max-min optimization, enhancing stability and minimizing sensitivity to an appropriate level. Protocols designed based on this theory will be amenable to rigorous analysis and proofs of behavior.","title":"Wireless Technology: Issues on QoS Stability, Sensitivity, Flow & Congestion Control in Wireless Broadband Networks","awardID":"9979401","effectiveDate":"1999-10-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["206020"],"PO":["250082"]},"46557":{"abstract":"Abstract <br\/><br\/>IIS-9980130<br\/>Owen, G. Scott<br\/>Georgia State University<br\/>$0 - 12 mos. (Totally funded by the Division of Undergraduate Education in the amount of $165,244)<br\/><br\/>DLI-Phase 2: Research on a Digital Library for Graphics and Visualization Education <br\/><br\/>This is the first year funding of a three year continuing award. This project focuses on two areas of interest to the development of a national digital library: testbeds and applications for undergraduate education and human-centered and collections-based research. The three goals of the project are 1) to provide a model for the reuse and repurposing of materials in a digital library based upon the Xtensible Markup Language (XML); 2) the improvement of navigation capabilities using information visualization techniques based upon XML and 3D Web graphics; and 3) the creation and development of a collaborative user community. The project uses standard Web-based technologies and is platform independent. It is part of the consortium lead by the COLLEGIS Research Institute (CRI) to develop a federated set of collections with a primary emphasis on education. <br\/><br\/>The project builds upon past ACM Special Interest Group in Graphics (SIGGRAPH) - NSF cooperative efforts, current ACM SIGGRAPH Education Committee projects, and the industry effort to create tools for XML and related applications. It will be a joint effort between ACM SIGGRAPH Education Committee (SEC) and the Hypermedia and Visualization Laboratory (HVL) at Georgia State University (GSU). It focuses on the SEC Digital Library (SECDL) and its community of users. The SECDL contains a large number of peer reviewed multimedia materials and is rapidly growing in size. It is a stable resource fully supported by SEC. Using emerging technologies such as XML, this project enables SEC to realize its vision of a hypermedia learning environment that can be used by the community of students and educators from all disciplines interested in computer graphics and visualization.","title":"DLI-Phase 2: Research on a Digital Library for Graphics and Visualization Education","awardID":"9980130","effectiveDate":"1999-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7427","name":"CCLI-EDUCATIONAL MATERIALS DEV"}}],"PIcoPI":["525686","530687","529917"],"PO":["564456"]},"45007":{"abstract":"EIA-9972879<br\/>Chase, Jeffrey S.<br\/>Agarwal, Pankaj<br\/>Arge, Lars<br\/>Lebeck, Alvin<br\/>Littman, Michael<br\/>Duke University<br\/><br\/>Research Infrastructure: Data-Intensive Computing for Spatial Models<br\/><br\/>Duke University researchers will conduct research on locality management for data intensive systems; locality issues include algorithms and toolkits to promote locality, fast and predictive data placement, memory system architectures (main, cache, and disk), network I\/O, and mobile\/wireless computing. Applications for the research include computational sciences, GIS applications, 3D modeling and visualization, molecular modeling. For wireless and mobile computing, transcoding for heterogeneous devices and power management will be addressed. As an outreach component, Duke will work with Martha Absher, a Presidential Awardee for Excellence, who coordinates College of Engineering activities to recruit and retain minority students; their activities will center on expanding REU opportunities; they will also collaborate with North Carolina Central University, also in Raleigh, in computational science.","title":"Research Infrastructure: Data-Intensive Computing for Spatial Models","awardID":"9972879","effectiveDate":"1999-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["554177","553906","555929","550488","172543"],"PO":["297837"]},"36559":{"abstract":"Sometimes, restricting the domain of interest makes a hard problem easy. For example, one can find the minimum vertex cover of a bipartite graph in polynomial time even though the general problem is NP-hard. Sometimes, restricting the domain does not make a problem easier. For example, finding the minimum vertex cover of a planar graph is NP-hard. <br\/> This project is to study issues relating to problems whose instances come from classes obtained by natural restrictions on more general classes. Many subtleties which arise naturally in dealing with such problems have been glossed over in the literature. Perhaps the most common interpretation of solving a problem on a retricted class is the \"promise\" version, in which there is a guarantee that the input is in the class, and an algorithm to \"solve\" the problem need not function correctly (or even terminate) if this guarantee is not met. This research is based on different definition, one in which the algorithm must produce correct output even if the input is not in the restricted class; such output may either be \"the input is not in the class\" or the correct solution to the problem. <br\/> The new definition of solving proglems on restricted domains requires algorithms to be \"robust: in the face of invalid input, a more stringent requirement than \"don't care.\" Robust algorithms are amenable to manipulation as building blocks of more general algorithms; in contrast, \"promise\" algorithms are not. Furthermore, there exist problems which are in P in the \"promise\" version of solving a problem, while being NP-hard under the new definition. Arguments can be made that the hardness results are sometimes more meaningful, necessitating a revamping of the notion of restricted class NP-completeness.<br\/> Graph classes provide interesting and natural restricted domains; the project will also study many problems on graph classes which satisfy the twin requirements of being:<br\/><br\/>. Easy to solve given a special and natural representation of a graph (i.e., a \"model\")<br\/><br\/>. Open with respect to complexity if the graph is given in a general form such as an adjacency list.<br\/><br\/>While some of these open problems appear to be quite hard, they are not easily classifiable as \"really\" being hard. This is because the model provides a certificate for the problem to be in NP and in co-NP; consequently, such problems can be NP-hard only if NP = co-NP. An operational notion of intractability is needed for several such problems and the project will investigate possibilities","title":"Robust Algorithms for Restricted Domains","awardID":"9820840","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[92127,"554655"],"PO":["543507"]},"49528":{"abstract":"Proposal processing and data entry support for the CAREER Program","title":"Proposal Processing and Data Entry Support forthe Faculty Early Career Development (CAREER) Program","awardID":"0000227","effectiveDate":"1999-10-14","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[126623],"PO":["565227"]},"44523":{"abstract":"With verification taking about two thirds of the development cycle, formal<br\/>methods hold great promise of increasing the productivity of electronic<br\/>designers. To overcome the limitations of current formal verification<br\/>algorithms, this project explores adaptive model checking techniques. Model<br\/>checking is a technique for the verification of properties of finite state<br\/>systems. Application of model checking to large systems is hindered by the<br\/>exponential growth of the number of states with the number of state<br\/>variables---a problem known as state explosion. This project addresses the<br\/>state explosion problem by a combination of three approaches: verification<br\/>management, automatic abstraction\/refinement, and binary decision diagram<br\/>(BDD) technology. These approaches combine to give adaptive model checking,<br\/>in which the verification management component identifies the appropriate<br\/>partitioning and abstraction strategies and extracts from the design to be<br\/>verified information that guides BDD-based algorithms to efficient symbolic<br\/>state exploration.","title":"A Verification Manager for Adaptive Model Checking","awardID":"9971195","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[113182,"518587"],"PO":["201974"]},"44457":{"abstract":"9970985 Griswold, William, G. University of California, San Diego<br\/>Coping with Software Change Using Information Transparency<br\/><br\/>Software engineers attempt to design software so that it can be extended, replaced, or modified in small units called modules. Shortcomings of traditional modularity mechanisms often result in non-localized ``aspects'' requiring global change. Engineers often overcome this problem in modular design by using the textual or syntactic similarity of the code to be modified to economically search for and display the dispersed elements. A design that facilitates such identification is called ``information transparent''. This research develops a theoretical and practical understanding of information transparency to increase its power and applicability. In particular, an in-depth analysis of a large, modern system is elucidating how programmers currently maintain their complex, interwoven structures. The research is also developing tools that are ``aspect aware'', enabling programmers to treat dispersed aspects more like traditional module structures. Lastly, experiments are being conducted on these tools in the development and maintenance of a complex system. Together these provide foundations, techniques, and tools for the improved management of complex software system structures. The research is also providing research training for several graduate students, disseminating practical results to undergraduate and graduate students in classes, and disseminating the tools via the Internet.","title":"Coping With Software Change Using Information Transparency","awardID":"9970985","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["564209"],"PO":["564388"]},"46404":{"abstract":"The currently envisaged third-generation wireless communication networks will provide clear improvements over the current systems, but will fall short of the goal of seamless communication for a large variety of services anywhere and anytime. Because the goal presents tremendous scientific and technological challenges spanning several disciplines, a multi-disciplinary, integrative research approach involving several researchers makes eminent sense. As such, our research will be conducted by four researchers whose backgrounds are in electromagnetics, signal processing and coding, and networking. The research will advance the state of the art in each of these \"layers,\" but will also explore how each of the layers might benefit the other layers.<br\/><br\/>Work at the RF Layer will involve the design of low-profile, low-power broadband antennas, with single and multiple antenna structures. Also studied for the benefit of the Signaling Layer are statistical and temporal models of the propagation environment. Research at the Signaling Layer will include the design of serial and parallel concatenations will be studied for both frequency selective and flat fading channels. Serial and parallel space-time concatenated codes will be designed also for systems with transmit diversity. Both textbook channel models as well as models developed in the RF Layer work will be adopted. At the Network Layer, work will involve performance analysis of quality of service metrics, on-line bandwidth allocation mechanisms, and adaptive error control under quality of service guarantees. Operation at this layer will be aided by data provided by the Signaling Layer. The research is collaborative, including the four University of Arizona researchers and members from industry.","title":"Integrated Design of Next-Generation Broadband Mobile Networks: Antennas, Codes, and Performance Guarantees","awardID":"9979310","effectiveDate":"1999-10-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["408606","537051","523391","540507"],"PO":["564898"]},"46437":{"abstract":"This research project is a collaborative effort of Margaret Dunham, Southern Methodist University (IIS-9979458) and Vijay Kumar, University of Missouri at Kansas City (IIS-9979453) and is supported under the Wireless Information Technology and Networks (WITN) initiative, NSF 99-68. The goal of this research is to develop schemes for processing data that are strongly related to geographical locations, on a mobile computing platform. Unlike conventional data processing systems, in a wireless mobile computing environment the value of data may depend on location, and processing of a transaction at one site may give different results than that at another. This situation identifies a new type of data, which we refer to as Location Dependent Data (LDD). Thus, LDD is a class of data whose value is determined by (a) the geographical location of data storage and (b) the geographical location of the Mobile Unit (MU) where the query originated. For example, when a query from a MU wants to find out information about local hotels, it will get a different answer in Dallas than in Kansas City. It would even be possible for a traveler driving from Dallas to Kansas City to ask the same question en route but specifically request the response using Kansas City data rather than data based on the location from which he requests the query. Although the query may be stated in exactly the same way, it is interpreted in a location-dependent context. The objective of this research is to further explore the concept of LDD, its impact on transaction processing, and develop efficient schemes for its management. As a result of this research, methods will be produced which facilitate the storage of location dependent data at Mobile Units and techniques to efficiently process transactions which access this type of data. The creation of a testbed to is a major objective of the project. It will be used to implement and compare the various strategies proposed during the research.","title":"WITN: Collaborative research in Location Dependent Data Management","awardID":"9979453","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["562301"],"PO":["563751"]},"40146":{"abstract":"Many networked applications such as electronic commerce, distance learning, digital libraries, multimedia teleconferencing and on-line entertainment involve real-time delivery of stored video to a large number of clients across a heterogeneous internetwork. For continuous playback at the client, quality-of-service (QoS) must be provided in an end-to-end manner. The design of efficient large-scale video delivery systems is complicated by such challenging issues as the highly bursty variable-bit-rate (VBR) compressed video, the underlying heterogeneous networking environments, disparate client capabilities, and diverse client QoS requirements. Solutions addressing these issues must be both efficient and scalable.<br\/><br\/>The main objective of the proposed research is to design and develop efficient and scalable streaming techniques for large-scale delivery of stored VBR video. The project relies on a novel distribution-tree based video delivery system architecture which employs a group of proxy servers strategically placed inside an internetwork to perform network-wide video streaming and distributed media control. Based on this system architecture, the researchers plan to develop and investigate efficient and scalable real-time video streaming mechanisms that can effectively accommodate the heterogeneity in both the underlying network environments as well as the client end systems, while providing flexible QoS supports to a large client population. In particular, o The researchers will develop network-wide video smoothing techniques which make use of the in-memory buffers at proxy servers and clients to reduce rate variability in video transmission and accommodate network bandwidth constraints.<br\/><br\/> o The researchers will develop proxy video staging techniques which exploit the disk storage space of proxy servers at network edges to achieve significant bandwidth reduction in the backbone wide-area network (WAN).<br\/><br\/> o The researchers will develop adaptive rate and error control mechanisms such as selective frame discard and selective retransmission which leverage application-specific information to meet diverse client QoS requirements.<br\/><br\/> o The researchers will also develop video stream synchronization and merging schemes which integrate network-wide video streaming with proxy-assisted video delivery in a synergistic manner.<br\/><br\/>The methodology the researcherse plan to use in the proposed research will be a combination of theoretical analysis, simulation study and experimental investigation. The end results produced from the proposed research will include new concepts, efficient and scalable mechanisms and algorithms for real-time video streaming, reports of simulation and experimental studies, and a prototyping video proxy server system.","title":"Efficient and Scalable Streaming Techniques for Large-Scale Delivery of Stored VBR Video","awardID":"9903228","effectiveDate":"1999-10-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["543509"],"PO":["194325"]},"45965":{"abstract":"With the development of the Internet, databases are being copied, transformed, and corrected on an unprecedented scale. With this comes the need to annotate data: for correcting it, commenting on it, or for recording its provenance. However, conventional databases have a regular structure and provide no \"room\" for annotations which are typically irregular and required at all levels of granularity. Annotations require some form of semistructured representation. This investigation centers on a new model for structured and semistructured data which is intended to facilitate the process of data annotation. The usual models of semistructured data are based on an edge-labeled graph and are \"nondeterministic\" in that a given vertex may have several out-edges with the same label. The model proposed here is more restrictive in that these labels must all be different. It is less restrictive because the labels themselves may themselves carry data. In fact a label may itself be a small piece of semistructured data. A number of advantages are claimed for this model. Like XML, the data representation is entirely syntactic. All operations are syntactic,, and serialization of data is immediate. Object identifiers in particular are syntactic constructs, they have structure, and certain database transformations may be achieved by manipulation of this structure. The goal of the investigation is to develop the model and associated interfaces so that it can be used as a common representation for both semistructured and structured data. A second goal is to develop tools for data annotation. <br\/>http:\/\/db.cis.upenn.edu\/Research\/","title":"A Deterministic Model for Semistructured and Structured Data","awardID":"9977408","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["541878","541877"],"PO":["563751"]},"44997":{"abstract":"EIA-9972853<br\/>Keshav Pingali<br\/>Nikos P. Chrisochoides<br\/>Carolina Cruz-Neira<br\/>Guang R. Gao<br\/>Anthony R. Ingraffea <br\/>Cornell University<br\/><br\/>CISE Research Infrastructure: A Two-tier Computation and Visualization Facility for Multiscale Problems<br\/><br\/>Cornell University, in conjunction with Iowa State University, the University of Delaware, and the University of Notre Dame, will build an infrastructure for scientific computing and visualization. The equipment purchased under this grant will consist of virtual reality (VR) hardware, and a number of NT workstations. In addition, Cornell is acquiring a large cluster of NT machines from other sources, which they anticipate will eventually be the world's largest such cluster. This hardware will support two computational science projects, one in fracture mechanics and one in computational molecular biology. In turn, compiler and runtime systems projects will be supported and will be driven by the demands of these applications while using the same hardware.","title":"CISE Research Infrastructure: A Two-tier Computation and Visualization Facility for Multiscale Problems","awardID":"9972853","effectiveDate":"1999-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["439586","556730","507725","561580","475422"],"PO":["297837"]},"41246":{"abstract":"The Internet is widely considered as the most reachable platform of next-generation information infrastructure. Although IP\/DWDM (internet protocol over dense wavelength division multiplexing) technology has been demonstrated to transport 1 terabit\/s bandwidth over a single fiber, the capability of routing IP packets at 1 terabit\/s still remains to be seen. Furthermore, in order to provide different<br\/>quality-of-service (QoS) requirements for the Next Generation Internet (NGI), IETF has suggested the Internet Integrated Services (IIS) with resource ReSerVation signaling protocol (RSVP). Although several<br\/>algorithms have been proposed to guarantee the stringent delay bound for the guarantee service flows, how to implement them at the aggregate rate of terabit\/s remains challenging.<br\/><br\/>This proposal tackles the problem by designing a large-capacity switch fabric for a terabit IP router and tightly controlling packet delay at the input and output ports of the router. The proposed terabit IP<br\/>switch router consists of multiple routing modules (RMs) that are interconnected by a fast switch fabric. Each RM forwards arriving packets independently, thus allowing the router to scale flexibly up to terabit\/s. With the application of the following innovations, supporting the IIS at terabit\/s is conceivably achievable.<br\/><br\/>First, a novel dual round robin (DRR) arbitration scheme is proposed to provide statistically bounded delay at the input ports of a nonblocking input-output buffered crossbar packet switch with a moderate speedup. The DRR is a distributed switch control scheme, in which input selection and output contention resolution are separatedly handled by two independent sets of round-robin arbiters. The switch is used to provide high speed interconnection among RM's. By using bit-slice technique with multiple switch planes, the switch operation speed is reduced and can be implemented with low-cost CMOS technology.<br\/><br\/>Second, a novel token tunneling mechanism is proposed to implement the DRR scheme at terabit\/s. It is shown that with state-of-the-art 0.25-micron CMOS technology, the arbitration time can be as small as<br\/>10 ns for a 256x256 Tb\/s packet switch. This scheme can also be extended to handle multiple-priority traffic. To demonstrate the feasibility of the concept, an application specific integrated circuit (ASIC) that implements the DRR scheme will be prototyped.<br\/><br\/>Finally, packet fair queuing (PFQ) has been proven capable of providing delay bound guarantee for the IIS. It will be used at the output ports of the router. Arrival packets are usually time stamped based on their committed rates. However, time stamp's computation and sorting always pose a great challenge for high speed networks, especially with hundreds of thousands of flows that need to be supported. Therefore, a novel RAM-based searching engine (RSE) is proposed to implement the PFQ scheduler at 10 Gb\/s for each output<br\/>port at low cost by using off-shelf parts while supporting hundreds of thousands of flows.<br\/><br\/>Furthermore, due to the heterogeneous networking environment in the Internet, hierarchical packet scheduling is required to accommodate different service classes and multiple Internet Service Providers<br\/>(ISP's). The shaper-scheduler scheme has been proven capable of providing tight delay bound in the hierarchical packet scheduling environment. Unfortunately, the scheme is very complicated and has not<br\/>been shown feasible at high speed and at low cost, especially for packet media. Therefore, a general shaper-scheduler is proposed for both ATM and packet networks. The concept of the RSE will be extended<br\/>to a two-dimensional RSE (2-D RSE) that implements the general shaper-scheduler. To demonstrate the feasibility of the concept, a 2-D RSE will also be prototyped.<br\/><br\/>All the prototypes and the developed technologies will be made transferable to the industry in order to expedite the deployment of the terabit IP routers in the NGI.","title":"A Terabit IP Router with Advanced QoS Support","awardID":"9906673","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["522037"],"PO":["292741"]},"47934":{"abstract":"This award was made under Section A. of the program announcement, NSF 98-102. The proposal maximizes available telecommunications access combined with emerging technologies and applications to enhance K-12 instructional tools. The twenty-fold increase in bandwidth to sixteen K-12 schools and library desktops in the state of Georgia utilizes a hybrid network of state-deployed satellite receiving systems for downlink capability and an already available ground Internet network (PeachNet) for uplink capability. Collaborators on the project includes EduLinc, Inc., Georgia Public Broadcasting, Georgia Board of Regents, and the following departments under the state government: Education, Technical and Adult Education, and Administrative Services.","title":"A Statewide Satellite High-Bandwidth Internet Delivery System with Integrated Video-on-Demand to Georgia's Educational Community","awardID":"9985726","effectiveDate":"1999-10-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["224406"],"PO":["182196"]},"46207":{"abstract":"Although there are tools that allow access to information and data from distributed sources, there is a strong need to develop a semantic layer on top of such tools to deal with the challenging requirements of applications built from distributed software components. This research is investigating the design of an integration rule language and the development of a middle-tier, rule-processing framework for the integration of distributed, black-box components. Integration rules are active, specifying how objects react to events, and declarative, specifying the conditions under which the defined action should be executed. The rules are used within an integration framework that encapsulates the processing logic associated with the interconnection of distributed components. A user interface allows the user to graphically specify the processing logic, which is automatically translated into the appropriate integration rules. Integration rules are executed within a rule engine, which is designed to build on the recognized strengths of distributed object computing with CORBA (Common Object Request Broker Architecture) and the Java programming language. The expressiveness and use of integration rules are evaluated by case study comparisons of integrating components using imperative code versus the use of integration rules. The development of such a rule-processing environment has an immediate relevance to the integration of distributed applications, such as electronic commerce, engineering design and manufacturing, and Web-based applications, in general. This integration framework provides a rapid approach to the construction of multi-tiered applications that separate processing logic from client and data sources.","title":"Active Declarative Integration Rules for Developing Distributed Multi-Tiered Applications","awardID":"9978217","effectiveDate":"1999-10-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["553593","426529"],"PO":["563751"]},"45009":{"abstract":"EIA-9972881<br\/>Randal C. Nelson<br\/>Christopher M. Brown<br\/>Sandhya Dwarkadas<br\/>Kiriakos N. Kutulakos<br\/>Michael L. Scott<br\/>University of Rochester<br\/><br\/>CISE Research Infrastructure: A Laboratory for Intelligent Multi-Sense Interfaces<br\/><br\/>University of Rochester researchers will conduct research and pilot studies in ubiquitous visual computing. The theme of their work is using high performance networking to connect devices that provide and use images in compute intensive settings. Researchers will establish a protocol that can ship images and video transparently between workstations and the computational cluster. Another project will implement a dataflow image computation model.","title":"CISE Research Infrastructure: A Laboratory for Intelligent Multi-Sense Interfaces (A Planning Grant)","awardID":"9972881","effectiveDate":"1999-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["540805","564815","214928","556692","138901"],"PO":["297837"]},"40015":{"abstract":"Many searchable text information sources are available in the Internet. The desired documents of a user are often stored in multiple heterogeneous sources, making it difficult for a user to find desired documents in the Internet. Automatic search brokers (metasearch engines) that can invoke multiple search engines are needed so that a user can find desired documents from multiple sources using a single query. This collaborative project is to develop techniques needed for the next generation metasearch engines. Highly scalable methods that can accurately estimate the usefulness of an information source with respect to each user query are to be developed. These methods would enable the metasearch engine to search only a small number of sufficiently useful information sources for each query, avoiding wasting resources for searching useless sources. Linkages among documents are to be used to improve the retrieval of relevant documents. A concept hierarchy is to be used to disambiguate the meanings of terms. Techniques that while guaranteeing the retrieval of all potentially useful documents from a local search engine, also minimize the retrieval of useless documents are to be investigated. Good solutions to the problem of merging results from multiple sources into a single ranked list are also sought. Developed techniques will be shown to significantly improve existing ones in both efficiency and effectiveness. A metasearch engine incorporating developed techniques on top of major university search engines will be implemented and made publically accessible.","title":"Determining Text Databases to Search in the Internet","awardID":"9902872","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["434747"],"PO":["563751"]},"46439":{"abstract":"The Multihop wireless capabilities will enable communication and coordination among autonomous nodes in unplanned environments and configurations. At the same time wireless channels present challenges of dynamic operating conditions, power constraints for autonomously-powered nodes, and complicating interactions between high level behavior and lower level channel characteristics (e.g. , increased synchronized communication will significantly degrade channel characteristics). The major goal of the research is the development, testing and characterization of algorithms for scalable, application driven, wireless network services using a heterogeneous collection of communicating mobile nodes. Some of these nodes will be autonomous (robots) in that their movements will not be human controlled. The others will be portable thus, making them dependent on humans for transportation. While the focus of the work is on the mobile nodes, include immobile computers on the network as well. It emphasize that most (though not all)<br\/>of the mobile nodes will have modest sensing, computational and communication resources. The collection as a whole is an example of a sensor network. The chief scientific motivation behind the work is the design of robust, efficient and scalable algorithms. The researchers hypothesize that distributed algorithms that rely on local interactions have many compelling characteristics, resulting in these properties. There is significant overlap between the problems of coordinating the autonomous mobile nodes that carry some of the sensors and the algorithms that direct the f ow of information from source(s) to sink(s) in the network. Both setsof algorithms will be carefully designed to improve robustness, effciency and scalability.","title":"Dynamic Adaptive Wireless Networks with Autonomous Robot Nodes","awardID":"9979457","effectiveDate":"1999-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["362108","560926","558935","553707","560335"],"PO":["194325"]},"41644":{"abstract":"The rapid growth of e-commerce on the Internet has raised a question of whether the Internet will mainly facilitate market consolidation by large companies, or whether it will be a driver of growth for small and medium-sized enterprises (SMEs) as well. This is significant because e-commerce could lead to increased competition, greater consumer choice and more innovation, or it could lead to reduced competition, consumer choice and innovation, depending on the impacts of e-commerce on firm and industry organization. The early evidence on the question is mixed and largely anecdotal. Therefore, the objective of this research to provide scientific evidence on the question. It uses theory on firm and industry organization as the conceptual basis for hypothesizing that e-commerce will lead to greater use of market transactions, as opposed to internal hierarchies, to organize economic activities, leading to increased competition and new business opportunities. This project examines the hypothesis through systematic, detailed case studies of the extended value chains of four firms in the PC industry. The computer industry is chosen because it is the leading user of e-commerce and it includes manufacturing, service, and information sectors, thus providing a microcosm of the national economy. The results will not only contribute new knowledge, but also provide a scientific basis for public discussion about the social and economic impacts of e-commerce, and lead to a more extended empirical study.","title":"Impacts of E-Commerce on Firm and Industry Organization","awardID":"9907881","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["540305","426259"],"PO":["495796"]},"44834":{"abstract":"NSF Proposal # 9972244<br\/>Long-Term File System Performance<br\/>Thomas Anderson <br\/><br\/>In recent years, the disk I\/O bottleneck has become widely<br\/>recognized -- as CPU performance improves much faster than<br\/>disk latency, an increasing fraction of overall system<br\/>performance is spent in the file system. Worse, file system<br\/>performance often degrades over time; as files are created,<br\/>deleted, and modified, the disk can become fragmented, limiting<br\/>system performance. Unfortunately, existing file system<br\/>benchmarks are too short to be of practical use in studying<br\/>this effect. This research focuses on understanding the long<br\/>term behavior of file systems by collecting and analyzing detailed<br\/>year-long traces of file system use. The work will use these<br\/>traces to evaluate several proposed strategies for dynamically<br\/>reorganizing the disk with the goal of improving the equilibrium<br\/>performance of file systems.","title":"Long-Term File System Performance","awardID":"9972244","effectiveDate":"1999-10-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["463055"],"PO":["241298"]},"45208":{"abstract":"Abstract<br\/><br\/>99-73518<br\/><br\/>Neubert\/Caswell<br\/><br\/>Transient dynamics of ecosystems<br\/><br\/>Ecological systems are subject to a wide variety of natural and anthropogenic perturbations. For example, consider a lake. On a short time scale, a rainstorm may temporarily increase the amount of nutrients in the lake, producing a brief algal bloom. On a longer time scale, acid rain might produce a permanent shift in the lake's fauna, including the possibility of species extinctions. The reaction of an ecosystem to a perturbation can have important human health or economic consequences. Ecologists and mathematicians have developed a theory to help them predict how ecosystems will respond to perturbations. While this theory has been useful, it has two principle shortcomings. First, its predictions are only expected to be correct a long time after the perturbation occurs. Second, it assumes that before the perturbation the ecosystem was in equilibrium, i.e., it assumes that none of the ecosystem's components are changing over time. The investigators on this project will develop a theory that corrects these two problems. This theory will focus on the short-term responses of ecosystems to perturbations and will incorporate non-equilibrium systems. The results of this study will be useful to ecosystem scientists working on a wide range of problems from conservation of biodiversity to global climate change, and in both terrestrial and aquatic systems.","title":"Transient Dynamics of Ecosystems","awardID":"9973518","effectiveDate":"1999-10-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["536139","536140"],"PO":["260207"]},"40985":{"abstract":"Abstract <br\/><br\/>IIS-9905955 <br\/>Lagoze, Carl<br\/>Cornell University<br\/>$0 - 12 mos. (Jointly funded by International Programs in the amount of $17000, and The Nat'l Edow. For Humanties in the amount of $6,589. Total award is $23,589)<br\/><br\/>Metadata for Resources Discovery of Multimedia Digital Objects<br\/><br\/>This is the first year funding of a three year continuing award. This project, HARMONY, is a three-way international partnership between Cornell University, the Australian Distributed Systems Technology Centre(DSTC) and the University of Bristol's Institute for Learning and Research Technology(ILRT). The joint work will be devising a framework to deal with the challenge of describing networked collections of highly complex and mixed-media digital objects. The work will draw together efforts on the RDF, XML, Dublin Core and MPEG-7 standards, and will focus on the problem of allowing multiple communities of expertise (e.g., library, education, rights management) to define overlapping descriptive vocabularies for annotating multimedia content.","title":"DLI-International: Metadata for Resource Discovery of Multimedia Digital Objects","awardID":"9905955","effectiveDate":"1999-10-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["541699"],"PO":["433760"]},"41007":{"abstract":"Abstract <br\/><br\/>IIS-9906025 <br\/>Landweber, Lawrence <br\/>University of Wisconsin <br\/>$158,196 - 12 mos.<br\/><br\/>DLI-International: Imesh Toolkit<br\/><br\/>This is the first year funding of a three-year continuing award. Recent years have seen the emergence of the subject gateway approach to Internet resource discovery and leading gateway initiatives have recently been collaborating informally under the name IMesh. The IMesh Toolkit project, a partnership of the UK Office for Library and Information Networking at the University of Bath, the Institute for Learning and Research Technology at the University of Bristol and the Internet Scout Project at the University of Wisconsin-Madison, aims to advance the system framework within which subject gateways and related services operate by defining an architecture which specifies individual components and how they communicate.","title":"DLI-INTERNATIONAL: IMesh Toolkit","awardID":"9906025","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["229263",103805],"PO":["433760"]},"46507":{"abstract":"9979838<br\/>Henderson, Thomas<br\/>Zachary, Joseph L.<br\/>Univ of Utah<br\/><br\/>CISE Educational Innovation: Simulation Science and Education<br\/><br\/>The goal of this CISE Educational Innovation (EI) award is to integrate research results on large-scale computational simulation into the undergraduate curriculum. The grant supports the development, testing and dissemination of web-based courseware derived primarily from research carried out by the Department of Energy ASCI Alliance Center on Simulation of Accidental Fires and Explosions (C-SAFE) at the University of Utah. The courseware is being developed in conjunction with Northern Arizona University and Worcester Polytechnic Institute as dissemination sites. Thus, the course material is being utilized by three very different undergraduate audiences: (1) a Research 1 institution, (2) a private institution whose primary mission is undergraduate education, and (3) a four-year institution serving a significant Native American student population. It is expected that the courseware, combined with research activity, both at the University of Utah and at the national labs, will create a national center for large-scale simulation science and education.","title":"CISE Educational Innovation: Simulation Science and Education","awardID":"9979838","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["429182","351449"],"PO":["551712"]},"40931":{"abstract":"Mathur<br\/>EEC-9905789<br\/><br\/>This project is supported under the initiative on \"Research Centers - Small Firms Collaborative R&D.\" The study concerns joint research between the Software Engineering Research Center (SERC), an IUCRC headquartered at Purdue University that includes the University of Oregon and Portland State University as affiliates, and Timberline Software Corp., a small firm located in Beaverton, OR. The work involves a research component followed by a validation and technology transfer component, and is based on the Value-Based Software Engineering (VBSE) approach being developed by SERC. VBSE systematically seeks to link critical software architecture design decisions to the business goals affected by those decisions; it brings together recent work in Customer Value Analysis (CVA), software architecture, and process modeling and improvement. The goal of the work is to develop and validate a set of lightweight analysis and software development processes that allow small-business software developers to move systematically from an understanding of strategic business goals to a software architecture that supports those goals over the long term. VBSE seeks to provide a systematic process for analyzing customer value, casting the results in terms of architectural quality requirements, and then developing architectural structures that satisfy those requirements. New architectural analysis techniques will support verification of the match between the resulting design and business goals. In th ecurrent study, the collaborators will develop a process model and methodology for small business software development that integrates advanced product-line and architecture technologies from software engineering, with the business administration discipline of customer value engineering. Timberline will provide realistic problems, validate the methods in a realistic setting, and provide feedback to the project on the effectiveness of the approach. Products of this effort will include model processes, products, and metrics applicable to a broad class of small-business software developers as well as SERC's industrial affiliates. To support Oregon's state initiatives in software engineering education, such as the University of Oregon's Master of Software Engineering program, the project will also develop educational materials describing the process and results. This project has the potential to serve as a national model of excellence in research centers - small firms collaborative R&D.","title":"Value-Based Software Engineering for Small Business","awardID":"9905789","effectiveDate":"1999-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1480","name":"ENGINEERING RESEARCH CENTERS"}}],"PIcoPI":["364273",103618,"425261",103620],"PO":["384939"]},"42779":{"abstract":"","title":"Support for Cost of Prototypes for U. S. Users of the U.S.-Japan Joint Optoelectronics Project - Interagency Transfer","awardID":"9910873","effectiveDate":"1999-10-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":[108288],"PO":["564454"]},"40976":{"abstract":"Abstract <br\/><br\/>IIS-9905935 <br\/>Hedstrom, Margaret <br\/>University of Michigan<br\/>$163,207 - 12 mos. <br\/><br\/>DLI-International: Emulation Options for Digital Preservation: Technology Emulation as a Method for Long-Term Access and Preservation of Digital Resources<br\/><br\/>This is the first year funding of a three year continuing award. A team of researchers at the University of Michigan and research staff in the UK from the Cedars project, being run at the Universities of Leeds, Oxford and Cambridge under the aegis of CURL (Consortium of University Research Libraries) will investigate the potential role of emulation in long-term preservation of information in digital form. The project will develop and test a suite of emulation tools, evaluate the costs and benefits of emulation as a preservation strategy for complex multi-media documents and objects, and develop models for collection management decisions about how much effort and resources to invest in exact replication within preservation activity. The project team will assess options for preserving the original functionality and \"look and feel\" of digital objects and develop preliminary guidelines for the use of different preservation strategies (conversion, migration and emulation).","title":"DLI-International: Emulation Options for Digital Preservation: Technology Emulation as a Method for Long-Term Access and Preservation of Digital Resources","awardID":"9905935","effectiveDate":"1999-10-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["551830","228266","471467",103736],"PO":["564456"]},"41515":{"abstract":"Indexing spatiotemporal data is an important problem for many applications (global change, transportation, social and multimedia applications). The goal of this project is to provide efficient access methods for data whose geometry changes over time. Two time-varying spatial attributes are considered, the object position and extent. Based on the rate by which these spatial attributes change, the discrete and continuous spatiotemporal environments are identified. In the discrete environment, spatiotemporal data changes in discrete steps. Efficient ways to answer historical queries on any past state of such spatiotemporal data are examined. In particular, selection, neighbor, aggregate, join and similarity queries are addressed using a \"partial persistence\" methodology. In the continuous spatiotemporal environment, data changes continuously. Instead of keeping the data position\/extent at discrete times (which would result in enormous update\/storage requirements) the functions by which this data changes are stored. This introduces the novel problem of indexing functions. Using this approach, selection, neighbor and aggregation queries about future locations of moving objects in one and two dimensions are addressed. The methods used in this project are expected to achieve at least 30% improvement over traditional access methods. The applicability of the completed work reaches multiple settings, including Geographic Information Systems, multimedia databases and transportation systems. Dissemination of project findings is provided through the project's web page: http:\/\/www.cs.ucr.edu\/~tsotras\/spatio-temporal.html.","title":"Efficient Indexing for Spatiotemporal Applications","awardID":"9907477","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["543515","430635"],"PO":["563751"]},"41306":{"abstract":"The focus of this proposal is on problems that arise in the context of QoS enabled networks and their use by applications. In particular, the main theme of the proposal, is the development of a greater<br\/>synergy between potential users of network QoS capabilities, i.e., applications, and the design and implementations of those QoS capabilities within the network. In order to accomplish such a goal, work will be carried out along the following three major axes:<br\/><br\/>1. Use and selection of network QoS services and parameters by applications. The goal here is to identify performance parameters that are of most significance to applications, and translate that knowledge into {\\em<br\/>utility} curves that can then be used by both applications to select the appropriate network service, and by the network to make intelligent decisions on how to best handle an application's traffic in case of resources contention. This includes not only assessing sensitivity to traditional QoS parameters such as bandwidth, loss, delay, and jitter of different types of applications traffic, e.g., transactions, audio, video, etc., but also considering more complex scenarios involving applications with multiple traffic streams which<br\/>might involve different (dynamic) resource sharing rules depending on the availability of network resources.<br\/><br\/>2. Algorithms for performance monitoring, resource sharing, and dynamic resource allocation in support of both network and applications requirements. The goal here is to design and evaluate specific network level<br\/>mechanisms in support of applications requirements for dynamic sharing of resources and service monitoring. For example, access to a ``high quality'' service by certain traffic streams might be predicated on the presence or absence of other streams. Devising and assessing mechanisms allowing the specification and implementation of such functionality can greatly improve the ability of networks to deliver services that are useful to applications. The challenges are not only to design mechanisms capable of supporting applications requirements, but also to integrate them with existing network services and capabilities. For example, it may require coupling between services above and beyond what is currently supported, e.g., ensure small delay to an audio stream, but only as long as a given floor rate can be guaranteed to data transfers.<br\/><br\/>3. Design and implementation of programmability in network devices in support of applications requirements and new service models. The goal of this last dimension of the proposal is to investigate the possibility of supporting applications needs and some of the above associated mechanisms, by leveraging some of the programmability that is being made available in a number of new network devices. The benefits of such an approach, if feasible, are that it can foster incremental deployment as well as facilitate the introduction of new capabilities if and when required by new applications. The challenges are to identify the appropriate trade-off between functionality and the implementation constraints that the technology imposes.<br\/> <br\/>The investigation of the above topics will be carried out through both experimental and analytical efforts. Experimentation will take place in the context of a newly established lab devoted to multimedia and<br\/>networking, that includes end-systems as sources of application traffic, and networking equipment made available by several vendors. Furthermore, work on the design and implementation of new mechanisms<br\/>to better support application service requirements, will be done in close collaboration with equipment vendors so as to facilitate their incorporation and testing on the available platforms. Finally, participation in the QBone Internet2 testbed will allow us to carry out end-to-end experiments that would not be feasible with only a local testbed. In particular, the QBone environment provides a representative sample of the type of network QoS services that will be initially available, and the experiments that will be carried out over<br\/>it will offer the opportunity to investigate not only how applications should use them, but also to identify related problems that may arise in their initial deployment.","title":"Application Driven Evaluation, Design, and Implementation of Network Services and Resource Sharing Models","awardID":"9906855","effectiveDate":"1999-10-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["527253","472358","564485"],"PO":["250082"]},"45939":{"abstract":"The goal of this research project is to develop new lossless text compression algorithms and software tools to incorporate compression in MIME\/HTML standards. The approach consists of encoding the text to exploit the natural redundancy of a language via the use of a dictionary and then compressing it using a pre-existing compression algorithm. The encoding scheme depends on the specific characteristics of the compression algorithm and the Bzip2 algorithm based on Burrows-Wheeler transform is used as the main backend compression algorithm. A basic understanding of the interaction of the encoding schemes and the compression algorithms is developed in this research project. The performance of the algorithms is measured taking into account both compression and communication metrics. Infrastructure tools are developed using dynamic caching of dictionaries to embed compression into MIME\/HTML standards. This research will have impact on the future of information technology by providing methods for data delivery systems where communication bandwidth is at a premium and archival storage is an exponentially costly endeavor. It is expected that the new lossless text compression algorithms will have 5 to 10% improved compression ratio over the best known pre-existing compression algorithms which might translate into a reduction of more than 50% of the text traffic on the Internet. The experimental research is linked to educational goals via rapid dissemination of results via reports, conference and journal papers, doctoral dissertations and masters theses, and transferring the research knowledge into the graduate curriculum. Software tools developed under this grant will be shared via a web site.","title":"Algorithms to Improve the Efficiency of Data Compression and Caching on Wide-Area Networks","awardID":"9977336","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["33013"],"PO":["563751"]},"41716":{"abstract":"The development of a comprehensive software environment based on scalable algorithms for the essential tasks required in unstructured mesh based applications. Unstructured mesh based approaches are a powerful tool in the analysis and modeling of problems involving dynamic, multi-scale features and complex geometries. This work will enable such large-scale scientific and engineering applications to take full advantage of parallel, high-performance computing systems.","title":"Scalable Unstructured Mesh Algorithms","awardID":"9908057","effectiveDate":"1999-10-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["485861","347998"],"PO":["562362"]}}