{"74938":{"abstract":"MS-0138445<br\/>Denis Zorin<br\/>DMS-0221666<br\/>Mathieu Desbrun<br\/>DMS-0220905<br\/>Peter Schroder<br\/><br\/>This is a collaborative project funded by the CARGO program under<br\/>DMS-0138445, DMS-0221666, and DMS-0220905.<br\/>Accurate computational representations of complex geometry <br\/>are of great importance in many disciplines ranging from <br\/>engineering and manufacturing to medicine and biology. With <br\/>the wide availability of powerful computational resources and <br\/>ever better acquisition technologies such as 3D laser <br\/>scanning and volumetric MRI or CAT imaging the geometries <br\/>used in applications are becoming increasingly complex. One <br\/>aspect of this complexity is topology, i.e., the presence<br\/>of holes and tunnels and of a network of one and <br\/>zero-dimensional surface features such as creases and spikes. <br\/>Typical examples of topologically complex shapes are a <br\/>perforated plate or the system of blood vessels of the body. <br\/>Traditional representations of geometry are at worst weak <br\/>and at best cumbersome and inefficient in representing<br\/>such complex topologies. Modeling of macro- and microscopic <br\/>biological structures is becoming increasingly important <br\/>for medical research, training, and treatment support. Such <br\/>structures often have extremely complex shape and topology <br\/>(e.g., the blood vessel or the nervous system, facial<br\/>muscles, a folded protein molecule). The representations <br\/>and algorithms we develop will result in new efficient ways <br\/>of manipulating and processing computer representations of <br\/>such structures. <br\/><br\/>In this project a team with expertise in numerical analysis, <br\/>geometric modeling, discrete algorithms and computer graphics <br\/>is studying ways to bring fundamental mathematical tools <br\/>and highly efficient algorithms to bear on the challenge <br\/>of creating efficient and accurate computational <br\/>representations and algorithms for surfaces of complex<br\/>topology. In particular we are investigating theory and <br\/>practical algorithms for (I) removal of topological noise <br\/>in existing models as well as in raw data used for surface <br\/>reconstruction; (II) topology discovery in volumetric <br\/>data sets; (III) construction of multiresolution <br\/>representations of geometry which can meaningfully<br\/>abstract fine level topology at coarser resolutions to <br\/>enable powerful multiscale techniques for rendering, <br\/>modification and simulation. Particular attention is paid <br\/>to exploring measures of topological scale which are <br\/>crucial to most of the algorithms being developed. The <br\/>algorithms to be developed by the team will have immediate <br\/>applications in two areas: Computer-Aided Design and <br\/>Medical Visualization. In CAD, examples of potential <br\/>applications include topology cleanup, simplification <br\/>for integration of scanned 3D data with manually <br\/>constructed models and use of multiscale representations <br\/>for interactive conceptual design representations.","title":"Collaborative Research: Modeling and Processing of Topologically Complex 3D Shapes","awardID":"0220905","effectiveDate":"2002-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["320958"],"PO":["313600"]},"70626":{"abstract":"This research investigates the parallel efficiency of an important class of bulk synchronous applications, as exemplified by computational molecular dynamics, in clusters of workstations. Bulk synchronous applications are often characteristic of non-deterministic computational requirements over time. In a multiprogramming environment, the nodal capacities allocated to an application may also change as other jobs join and leave. With respect to the dynamics of the computation and uncertainties of the cluster resources, this research aims at developing stochastic scheduling strategies in support of high performance computing in the clusters. It constructs a framework for modeling and analyses of adaptive scheduling algorithms by characterizing scheduling factors as random variables. It develops efficient application-level remapping policies by taking into account the dynamic systems of workload evolution and capacity change. The scheduling strategies are evaluated in the application of molecular dynamics computer simulations. <br\/><br\/>The research will blend formal modeling\/analyses, experimentation, and evaluation of stochastic scheduling algorithms. Success of this research will help increase the industrial acceptance of high performance cluster computing and advance computational molecular dynamics to simulations of large, multi-atom systems in a timely manner.","title":"ALGORITHMS: Adaptive Stochastic Scheduling for Bulk Synchronous Computations and Its Application in Molecular Dynamics Simulations","awardID":"0203592","effectiveDate":"2002-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["451038","434228"],"PO":["565272"]},"71808":{"abstract":"This small grant for exploratory research will support investigation of the use of media-rich instrumented environments in the performing and media arts. Using as the driver application a specific large-scale performance work, based on Homer's The Iliad, this project will begin development of a distributed control system. An important aspect of this system will be the ability of the audience to interact with the performance environment. Participants start their experience through a survey on a website, which populates a database used throughout the performance process. In the venue itself, which consists of a gallery as well as performance spaces, participants will be linked to their database records using standard radio frequency identification tags in their tickets, which are read by ubiquitous antennas. Media and story choices in the space will be adapted, based on the particular audience members attending on the particular day. As the experience progresses, the database will be updated with sensor data and images collected from the performance. The responsive environment is created by the interconnection of the database, sensors, and automated production equipment for the control of lighting, sound, motorized scenery, and video or image projection.<br\/><br\/>In the information society of the twenty-first century, technologies to manage, enable, and advance cultural innovation will be among the most valuable assets of civilization. This project will explore an emerging area that could be of great commercial, social, and scientific importance in the coming decades.","title":"IIS\/HCI SGER: The Iliad - Exploring Human Computer Interaction Research in the Performing Arts","awardID":"0207869","effectiveDate":"2002-05-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[185956,"552478"],"PO":["246649"]},"67280":{"abstract":"CCR-0132673<br\/>CAREER: Assessment of Open-Source Software for High-Performance<br\/> Computing <br\/>Edward B. Allen, P.I.<br\/><br\/>ABSTRACT:<br\/><br\/>This project will implement an integrated program of empirical<br\/>software-engineering research and an exemplar of education in<br\/>empirical methods for undergraduate and graduate students in<br\/>software engineering. This will be achieved through research<br\/>focused on assessing the quality of open-source software for<br\/>high-performance computing, and through development of relevant<br\/>courses and teaching modules.<br\/><br\/>High-performance computing is the platform of choice in many fields<br\/>of science and engineering that are critical to modern society.<br\/>Off-the-shelf software packages in this category include tools to<br\/>implement mathematical models, and middleware to manage parallel<br\/>and distributed computation. The open-source approach of software<br\/>development is becoming increasingly attractive in this field.<br\/><br\/>Research activities of this program will employ empirical analysis<br\/>methods to find ways to assess the quality of open-source software<br\/>for high-performance computing, enabling scientific and engineering<br\/>users to make better informed choices. Case studies of selected<br\/>software products will validate the practicality and usefulness of<br\/>obtaining such quality assessments.<br\/><br\/>Software-engineering education in America is largely lacking<br\/>instruction in empirical analysis methods. A spectrum of teaching<br\/>materials targeted toward this need will be developed. Research<br\/>results and instructional materials will be disseminated through<br\/>publications and the NSF-sponsored Center for Empirically Based<br\/>Software Engineering (CeBASE).","title":"CAREER: Assessment of Open-Source Software for High-Performance Computing","awardID":"0132673","effectiveDate":"2002-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["557830"],"PO":["564388"]},"67095":{"abstract":"EIA-0131886<br\/>Jose Fortes<br\/>University of Florida<br\/><br\/>Digital Government: Transnational Digital Government<br\/><br\/>With entre provided by Organization of American States (OAS), the US research team will collaborate with researchers from universities in Belize, Mexico, and the Dominican Republic. The domain is drug interdiction, under an arm or the OAS - the Inter-American Drug Abuse Control Commission. Under the COmmission, member states of OAS collect, share and analyze information in standard ways. Within this context, research will be undertaken in the areas of spoken dialogue systems, data management and security for rule-based data sharing and filtering, information retrieval and machine translation, middleware to support these transnational information grids, and network behavior modeling for acceptable quality of service.","title":"Digital Government: Transnational Digital Government","awardID":"0131886","effectiveDate":"2002-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["540130"],"PO":["371077"]},"76084":{"abstract":"Security system architecture, which defines structure of the system, the interaction and coordination among its components, has profound impacts on the security system' performance, reliability, interoperability and consistency among other critical properties. The purpose of this project is to develop a formal methodology to model security systems architectures and to assess key quality attributes of the composition. The proposed methodology has several integrated elements: First, an aspect-based architecture modeling framework is developed, which organized heterogeneous system properties into self-contained and yet integrated multi-level aspect models. Each aspect model can be constructed, changed and analyzed individually with minimal burden of complexity from the other models. Second, architecture-based constraint patterns are investigated. These constraint patterns define what conditions or properties that each component and their composition must satisfy under a security architecture. Based on the aspect architecture models, techniques will be developed to decompose system-wide constraint patterns onto individual components and to verify the consistency between global and component constraints. These patterns are the behavioral basis for checking and assuring end-to-end properties in system composition. Third, mature but individually homogeneous analysis techniques will be combined into a flexible and scalable method for analyzing the aspect models against their constraint patterns.","title":"An Aspect-based Approach for Analyzing Security System Architectures","awardID":"0226763","effectiveDate":"2002-05-17","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["364451"],"PO":["309350"]},"68671":{"abstract":"This award provides funding to the Polytechnic University of New York for the support of a three-year, REU Site in Information Systems for Undergraduates, under the direction of Dr. Frank A. Cassara. This eleven-week summer program will involve twelve students annually in an intensive research experience on various projects in the area of information systems and electrophysics. Each student will be closely mentored by an individual faculty mentor who will plan work and review progress throughout the program. The students will benefit not only from extensive interactions with participating faculty, but also with graduate students. Participants will have informative tours of the institution's research laboratories and there will be two or three seminar presentations to the group by leaders from industry, universities or government agencies. The program will conclude with a research review during which each student will make a formal presentation and respond to questions. A formal final written report of professional quality will be required of all participants.","title":"Research Experience in Information Systems for Undergraduates","awardID":"0139049","effectiveDate":"2002-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[177794,"491898"],"PO":["554829"]},"68441":{"abstract":"DMS-0138065<br\/>Binhai Zhu<br\/><br\/>In this project, we investigate a three-dimensional geometric <br\/>problem that originated in neural maps, which model the <br\/>motions of neurons so as to understand the human behavior. <br\/>The problem is defined as follows: given a neuron, which is <br\/>modeled as a polyhedron, compute a minimum set of (minimal) <br\/>cylindrical segments to approximate the neuron. We plan to <br\/>design a good approximation for this problem (i.e., the error <br\/>between the cylindrical segments and the neuron is small).<br\/>We also plan to have a good implementation, build a prototype <br\/>system, and perform extensive empirical studies. Practically, <br\/>a solution to this problem will have a great impact in <br\/>computational biology. Theoretically, this problem generalizes <br\/>the problem of finding a single line stabbing a set of balls <br\/>in 3D (and has never been seriously studied to the best of our knowledge).<br\/><br\/>Modeling the motions of human neurons is an important problem <br\/>in biology, especially in understanding human behavior under <br\/>different circumstances. To do that, we first need to model <br\/>a single neuron, which is very much like a tree-shaped <br\/>polyhedron, using a set of cylindrical segments. Different<br\/>cylindrical segments of different radii have different <br\/>functionality, so the union of the cylindrical segments <br\/>should be as close to the neuron as possible. In practice <br\/>this problem is estimated manually by technicians in<br\/>the computational biology community. The process is <br\/>time-consuming and error-prone. Our research will focus <br\/>on automating this process with computers and a successful <br\/>solution will have deep influence in the computational <br\/>biology community. We will train two graduate students<br\/>throughout this project.","title":"CARGO: Approximation and Simulation of Neurons","awardID":"0138065","effectiveDate":"2002-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["558865"],"PO":["313600"]},"68530":{"abstract":"DMS-0138426<br\/>Jack S. Snoeyink<br\/><br\/>Scientific measurements and computer simulations of <br\/>phenomena like air turbulence, nuclear explosions, or <br\/>combustion in an engine, when conducted at high-performance <br\/>computing facilities, produce vast amounts of four-dimensional <br\/>data representing how variables such as temperature and<br\/>pressure change over time. This incubation project brings <br\/>together researchers at UNC Chapel Hill, Georgia Tech, and <br\/>Lawrence Livermore National Labs to develop a prototype <br\/>visualization tool that can both quickly compute such <br\/>iso-surfaces from such data sets and also provide a global <br\/>summary that can indicate where a user should look in the <br\/>data set to find interesting phenomena.<br\/><br\/>The approach to be taken is to extend work on contour trees <br\/>to a \"Morse theory for a parameterized family of functions\" <br\/>that is sufficient to visualize 4D data from 2D iso-surfaces <br\/>or slices. When scientists, engineers, and students can <br\/>explore the data that comes from simulation, their understanding <br\/>of the process that is being simulated can only improve.<br\/>This not only increases the return from the national <br\/>investment in high-performance computing centers, but can <br\/>also result in, for example, cleaner-burning engines.","title":"Computational and Algorithmic Representations of Geonetric Objects - CARGO: Computational Topology for Exploring Time-varying Volume Data","awardID":"0138426","effectiveDate":"2002-05-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["370776","554471"],"PO":["218970"]},"76274":{"abstract":"This research involves the creation of a co-processor architecture evaluation environment which integrates architecture-level simulation with industrial CAD tools. The end-goal is to facilitate the design of high-performance domain-specific co-processors. In the evaluation environment, the designer will have the capability of 'test driving' a wide variety of design alternatives with respect to real application ppograms. The mechanism is to `drop-in' components into predetermined templates, gauge their effect on virtual machine instruction execution, and use that information to evaluate virtual machine instruction traces. There are three aspects to this research: (i) integrating existing or user-constructed component libraries and synthesis tools into an architecture- level model generator, (ii) integrating the same into an interprocessor network simulator, and (iii) extending an existing architecture-level simulator to include data parallel SPMD architectures. A graphic user interface is being developed to help the user mix-and-match components. The resulting environment will target not only professional designers, but also students in computer and advanced digital design classes.","title":"CAREER: Integrating Architecture-Level Simulation with Industrial CAD Tools for Prototyping High-Performance Coprocessors","awardID":"0228094","effectiveDate":"2002-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["511644"],"PO":["562984"]},"76099":{"abstract":"This project explores issues in the application of virtual reality environments to assist pre-school-aged children newly diagnosed with autistic spectrum disorder. The PI will develop and evaluate a tool that integrates virtual reality display with eye-tracking and sensing of other physiological and intentional signals in an appealing non-restrictive play environment, in order to deliver a rehabilitative intervention. The system to be developed is driven both by empirical findings and by theory. The literature reports a high degree of success for discrete trial training with some autistic children, with greater success the younger the age at which intervention is begun. Computerized implementation of discrete trial technology may improve its effectiveness, since eye-tracking and other sensors will record target behaviors more precisely and displays will deliver immediate contingent rewards more reliably than human trainers can accomplish. The theory that informs our approach is that failure to establish social attention in infancy is a key factor in the autistic developmental syndrome. The intervention, therefore, uses the discrete trial methods to teach social attention and other basic social skills that the typically-developing child acquires (without training) in the first year of life, and that children with autism lack. A Virtual Playmate will share enjoyable experiences with the child (music, interactive games, and \"rides\" in the motorized chair in which the child is seated) as rewards for gains in target behaviors such as visual fixation on the playmate's eyes, vocal response to the playmate's expressions of emotion, joint attention (looking where the virtual playmate is looking), and other social skills that are vital to social interaction. Training for skill maintenance and generalization will incorporate virtual versions of toys and models of individuals from the child's actual environment. A successful outcome to this project will ultimately improve autistic children's ability to take part in peer social interactions and move them closer to a typical developmental path so that they can become participating members of society.","title":"SGER: Development of an Interactive Virtual Environment for Delivery of Rehabilitative Intervention to Children with Social Cognitive Deficits","awardID":"0226850","effectiveDate":"2002-05-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":[198115],"PO":["565227"]},"67289":{"abstract":"Proposal Title: PECASE: Hierarchical Abstractions of Hybrid Systems <br\/>Institution: University of Pennsylvania<br\/><br\/>Recent years have witnessed the availability of extremely powerful and inexpensive computers, the explosion of communication networks, and revolutions in sensor and actuator technology. These accelerating advances have found their way inside many physical systems such as cars, aircraft, chemical processes, power networks, micro-mechanical systems, and manufacturing systems, resulting in the so-called embedded control systems or embedded software systems which merge physical processes with information systems. These application domains are important not only from an engineering perspective but also because of their prevalence in everyday life and the well-being of the economy.<br\/>Designing efficient, yet robust, large-scale embedded systems is a significant systems challenge. It is of immediate importance to develop the research foundations and educational programs to enable next-generation engineers to optimally utilize the opportunities offered by information technology. The difficulty with embedded systems arises from the fact that the software design and the control design is highly decoupled. As a result, physical constraints, such as differential equations, are not taken explicitly into account in the software design process. Consequently, fundamentally novel approaches to the design of embedded systems are needed as well as the development of models and tools that address the analysis and design of the integrated system with its many different physical, functional and logical aspects.<br\/>The research discipline of hybrid systems provides a theoretical foundation for the modeling, analysis, and design of embedded systems. Hybrid systems naturally combine discrete-event and continuous-time systems in a manner that can capture software logic, physical dynamics, and communication protocols, in a unified modeling framework. Hybrid systems have been used as mathematical models for automated highway systems, air traffic management systems, embedded automotive controllers, manufacturing systems, chemical processes, and, more recently, biomolecular networks. The wide applicability of hybrid systems has inspired a great deal of research from both control theory and theoretical computer science.<br\/>Despite the great success of hybrid systems as a model, the applicability of state-of-the-art analysis and design techniques for hybrid systems has been limited to examples of small size due to complexity. One of the fundamental approaches for reducing complexity involves the use of hierarchical decomposition. One of the main challenges in hierarchical systems is the extraction of a hierarchy of models at various levels of abstraction which are compatible with the functionality and objectives of each layer. Hierarchies have been instrumental in separately managing the complexity of both control and software designs. However, for hybrid systems which re-integrate software and control, the right notion of hierarchy is a great challenge, and is the critical obstacle for scaling our models, theories, algorithms, and tools to large scale, embedded systems.<br\/>Next-generation, large-scale embedded systems have motivated new control as well as software paradigms. As a result, there are numerous opportunities for fundamental and significant contributions from both a theoretical and an applied perspective. In this exciting intellectual landscape, the research and educational agenda of the proposed research focuses on developing the theoretical foundations for the hierarchical decomposition of hybrid systems at various levels of abstraction. The long term goal of the research agenda will address the fundamental problem of given a class of hybrid models, and a class of properties that must be preserved, extract modeling abstractions that preserve the properties of interest. Achieving this goal will consist of first developing robust notions of bi-simulation for purely continuous systems, and then unifying the continuous and discrete notions in a manner that is consistent with the dynamics of hybrid systems.<br\/><br\/>Merging discrete and continuous systems creates serious educational issues in order to combine the traditionally separate threads of discrete and continuous mathematics. These issues must be addressed at all educational levels. At the graduate level, creating new courses on hybrid systems are needed, but with focus on complexity reduction methods in both control theory and computer science. However, given the one-sided backgrounds of most undergraduate students, what is needed at the undergraduate level, is a cross-departmental, embedded systems course that will highlight both the discrete and continuous nature of embedded systems in various application domains. This will allow the earlier uniformization of educational backgrounds, expose students to related application domains in other depart","title":"PECASE: Hierarchical Abstractions of Hybrid Systems","awardID":"0132716","effectiveDate":"2002-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["526896"],"PO":["561889"]},"67443":{"abstract":"SUMMARY: Synthesis-assistance and Compilation Software for Embedded Systems<br\/>---------------------------------------------------------------------------<br\/><br\/>Embedded systems promise to revolutionize our day-to-day lives with ever-increasing intelligence and connectivity at decreasing cost. Yet, many of the software technologies for embedded systems remain antiquated, from compilers that produce code whose performance and power consumption is substantially inferior to assembly language programs, to synthesis software that provides little guidance to the designer on what decisions to make. These shortcomings decrease system performance and increase time-to-market and software and hardware development cost.<br\/><br\/>This project is developing fundamental technologies to propel the software for embedded systems to the next level of automation. Opportunities along two directions are being explored: increased automation of the synthesis of embedded soft cores, and new compiler strategies for the management of heterogeneous memories<br\/>in embedded systems. When deployed, these innovations can be expected to lead to vast improvements in the time-to-market, cost and performance of embedded designs. Both directions rely on improved compiler<br\/>analysis of application domains.<br\/><br\/>In the first and major research direction, tools that assist the synthesis of embedded soft cores are being developed. Soft cores are general-purpose processors having parameterizable components instead of a fixed design. The project is designing software that recommends to the user the best choice of an expanded space of hardware parameters for the given soft core, in an automated manner, taking into account the target application domain. The design goal is reduced runtime and power consumption within a given silicon-area budget. For the first time ever, the software uses compiler analysis of the applications to guide its decisions, rather than an exhaustive design space explorations proposed before, resulting in a rapid and scalable<br\/>methodology.<br\/><br\/>The second direction explored is the efficient compiler allocation of software-exposed heterogeneous memory. In many lower-end embedded chips, often used in micro-controllers and DSP processors, no caches are provided. Instead heterogeneous memory units such as scratch-pad SRAM, internal DRAM, external DRAM and<br\/>ROM are memory-mapped to different parts of the address space. Prior to this work, it was left to the user to partition the data among the different memory units. This project is developing a compiler strategy that automatically partitions the data among the memory units. <br\/><br\/>This CAREER research also includes a strong educational component that serves college students, industry and local high schools. To this end, several initiatives are pursued. First, a new graduate course on compilers for embedded systems has been designed. It continues to evolve with the integration of new research results. Second, undergraduates are recruited for summer internships to participate in the research. Third, a new laboratory course focuses on the design of embedded soft cores and uses software developed in the research, when complete, as an educational tool. Fourth, a research seminar series is conducted for high school juniors and seniors, using short examples of futuristic applications to excite students<br\/>about research in computer engineering.","title":"CAREER: Synthesis-assistance and Compilation Software for Embedded Systems","awardID":"0133519","effectiveDate":"2002-05-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["540124"],"PO":["561889"]},"72141":{"abstract":"The purpose of this research is to design and analyze discrete algorithms<br\/>approximating solutions to combinatorial optimization problems.Because<br\/>many of these problems are NP-hard,an exact solution is often not feasible;<br\/>in such cases approximation algorithms are a viable alternative.In addition<br\/>to attacking approximation problems that seem to require new strategies,<br\/>another main goal is to investigate the applicability of design principles de-<br\/>veloped successfully for traditional discrete optimization problems to com-<br\/>parable tasks occurring in other areas.In any ase,a rigorous performance<br\/>analysis is always intended.<br\/>A .rst focus is the #P-complete permanent problem,which is of much<br\/>importance in statistical physics and combinatorics.Rough approximations<br\/>(up to an exponential factor)can be obtained in deterministic polynomial<br\/>time and possibly even mu h faster on a parallel machine.Such a solution<br\/>would allow to solve the outstanding bipartite matching problem of parallel<br\/>computing.Even though the matching problem is easy for a sequential<br\/>machine,it is very hallenging to coordinate the many processors of a parallel<br\/>machine to worksimultaneously and e .ciently on the same matching.It is<br\/>also proposed to attackthe parallel matching problem with a novel version<br\/>of more traditional network .ow methods.<br\/>Another theme of this proposal is the approximation of NP-hard opti-<br\/>mization problems by traditional methods like lo al search,the comparison<br\/>method,semide .nite optimization,or some combination of these.It is even<br\/>proposed to investigate the approximation of some problems in P,as this<br\/>could have interesting applications in parallel computing.","title":"Approximation Algorithms for Problems of Various Complexities","awardID":"0209099","effectiveDate":"2002-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["551015"],"PO":["499399"]},"65431":{"abstract":"The goal of this project is to increase the number of women entering graduate programs in CISE areas by providing opportunities for female undergraduates to be involved in research projects with mentors at major research universities so as to experience research and graduate life. The Distributed Mentor Project (DMP) has been running successfully since 1994 and CRA proposes to build on that success by significantly increasing the number of students participating in DMP. To do this, CRA will initiate a new outreach program targeted at undergraduate institutions and universities without active research programs. The project will initially provide support for 30 students and will increase that number by 5 each year until, by the fifth year, 45 students will be working with experienced qualified mentors during the summer months. In addition, the project includes a significant evaluation component, a plan for dissemination of the results of the evaluation, and a plan to secure long-term funding and therefore institutionalization of the project from industry and other foundations.","title":"Special Projects: Scale-up, Evalulation, and Institutionalization of the Computing Research Association (CRA) Distributed Mentor Project","awardID":"0124641","effectiveDate":"2002-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["530729","208531","209556","561154"],"PO":["564181"]},"75155":{"abstract":"DMS-0138458<br\/>Peter Schroder<br\/>DMS-0221642<br\/>Ronald A. Devore<br\/>DMS-0221669<br\/>Mathieu Desbrun<br\/><br\/>This is a collaborative project funded by the CARGO program under<br\/>DMS-0138458, DMS-0221642, and DMS-0221669. This is the Age of Information. Whether it be in scientific computation or reverse engineering, in remote sensing or medicine, data sets of <br\/>incredible resolution and exquisite detail are created<br\/>daily. These data sets often have geometric structure which <br\/>contains important information about the data and its <br\/>application. The usefulness of such geometric datasets <br\/>rests on our ability to process them efficiently, whether <br\/>it be for storage, transmission, visual display, correlation, <br\/>or registration against data from other modalities. <br\/>Compression is the common critical issue in all<br\/>these applications.<br\/><br\/>Current data processing technology does not provide the <br\/>efficient and geometrically faithful representations demanded <br\/>by applications. In fact, a satisfactory data processing <br\/>platform will not be created by incremental advances of current technology but rather through a fundamental investigation of <br\/>how to represent large data sets with inherent geometry. To <br\/>pursue the necessary advances a team of researchers and <br\/>application developers representing expertise from<br\/>several disciplines including mathematics, computer science, <br\/>and engineering has been assembled. As drivers of the research, specially targeted applications (DTED, reverse engineering, <br\/>physical simulation) have been selected to guide the formulation <br\/>of the most critical and meaningful problems, as well as testing approaches to solving them. The team is carrying out <br\/>fundamental investigations on the representation and compression <br\/>of data sets with geometry by building new mathematical theory<br\/>including deterministic models, appropriate application <br\/>specific error metrics (e.g., Haussdorf distance rather<br\/>than Lp norms), an information theory based on Kolmogorov <br\/>entropy to determine the optimal compression, and the <br\/>development of nonlinear methods for representing the data <br\/>sets which are near optimal in the entropy sense.","title":"Collaborative Research: Compression of Geometry Datasets","awardID":"0221669","effectiveDate":"2002-05-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["448656"],"PO":["218970"]},"68511":{"abstract":"DMS-0138323<br\/>Reinhard C. Laubenbacher<br\/><br\/>This award supports research concerned with the algorithmic<br\/>representation of cell complexes, a special type of <br\/>topological space. These complexes arise as topological <br\/>models of data and processes in science and engineering. <br\/>Specific applications of interest are to biological, social, <br\/>and communications networks, as well as to problems in <br\/>statistics. Topological invariants of the complexes provide <br\/>measures of certain characteristics of the processes <br\/>producing the data. The use of cell complexes as data <br\/>models represents a new application of these structures <br\/>to science and engineering network problems. <br\/><br\/>The methods employed include tools from computational <br\/>algebra, combinatorics, and combinatorial topology, thereby <br\/>making a contribution to the applicability of new mathematical <br\/>areas to some pressing and challenging applied problems. <br\/>Research results will be disseminated directly to the end <br\/>user outside the mathematical community. The project impacts <br\/>a number of graduate students, including students from <br\/>underrepresented groups.","title":"Algebraic algorithms for Cell Complexes: Incubation Activity","awardID":"0138323","effectiveDate":"2002-05-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["500891"],"PO":["218970"]},"68533":{"abstract":"DMS-0138445<br\/>Denis Zorin<br\/>DMS-0221666<br\/>Mathieu Desbrun<br\/>DMS-0220905<br\/>Peter Schroder<br\/><br\/>This is a collaborative project funded by the CARGO program under<br\/>DMS-0138445, DMS-0221666, and DMS-0220905.<br\/>Accurate computational representations of complex geometry <br\/>are of great importance in many disciplines ranging from <br\/>engineering and manufacturing to medicine and biology. With <br\/>the wide availability of powerful computational resources and <br\/>ever better acquisition technologies such as 3D laser <br\/>scanning and volumetric MRI or CAT imaging the geometries <br\/>used in applications are becoming increasingly complex. One <br\/>aspect of this complexity is topology, i.e., the presence<br\/>of holes and tunnels and of a network of one and <br\/>zero-dimensional surface features such as creases and spikes. <br\/>Typical examples of topologically complex shapes are a <br\/>perforated plate or the system of blood vessels of the body. <br\/>Traditional representations of geometry are at worst weak <br\/>and at best cumbersome and inefficient in representing<br\/>such complex topologies. Modeling of macro- and microscopic <br\/>biological structures is becoming increasingly important <br\/>for medical research, training, and treatment support. Such <br\/>structures often have extremely complex shape and topology <br\/>(e.g., the blood vessel or the nervous system, facial<br\/>muscles, a folded protein molecule). The representations <br\/>and algorithms we develop will result in new efficient ways <br\/>of manipulating and processing computer representations of <br\/>such structures. <br\/><br\/>In this project a team with expertise in numerical analysis, <br\/>geometric modeling, discrete algorithms and computer graphics <br\/>is studying ways to bring fundamental mathematical tools <br\/>and highly efficient algorithms to bear on the challenge <br\/>of creating efficient and accurate computational <br\/>representations and algorithms for surfaces of complex<br\/>topology. In particular we are investigating theory and <br\/>practical algorithms for (I) removal of topological noise <br\/>in existing models as well as in raw data used for surface <br\/>reconstruction; (II) topology discovery in volumetric <br\/>data sets; (III) construction of multiresolution <br\/>representations of geometry which can meaningfully<br\/>abstract fine level topology at coarser resolutions to <br\/>enable powerful multiscale techniques for rendering, <br\/>modification and simulation. Particular attention is paid <br\/>to exploring measures of topological scale which are <br\/>crucial to most of the algorithms being developed. The <br\/>algorithms to be developed by the team will have immediate <br\/>applications in two areas: Computer-Aided Design and <br\/>Medical Visualization. In CAD, examples of potential <br\/>applications include topology cleanup, simplification <br\/>for integration of scanned 3D data with manually <br\/>constructed models and use of multiscale representations <br\/>for interactive conceptual design representations.","title":"Collaborative Research: Modeling and Processing of Topologically Complex 3D Shapes","awardID":"0138445","effectiveDate":"2002-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["550936"],"PO":["565063"]},"72593":{"abstract":"A natural language-based system will be built to answer queries based on a 200 million-word body of literature consisting of all the articles from the ASM journals for the last five years. The study consists of proof-of-concept research, so it is experimental in nature. There are two ideas that are key to the analysis, which has the potential to revolutionize the use of electronic literature in biology. The first idea is that biology should be viewed as a collection of natural language structures, containers, which have a standardized form and occur with high frequency in the literature. The second idea is that there is a simple but systematic relation between questions that users ask and the data in the containers found in the text. This will allow the system to answer queries without deep analysis. New technologies, especially visualization tools, will be developed in a uniform environment using Java.","title":"SGER: Discovering and Using the Knowledge in Biology Text","awardID":"0211047","effectiveDate":"2002-05-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["293969"],"PO":["216753"]},"79413":{"abstract":"Networked computer systems are vulnerable to malicious attack. These attacks<br\/>try to take over the control of a victim computer system by re-pointing the processor program counter (PC) to the attacker's code. This proposal explores a role for security aware compilation and processor microarchitecture in preventing unauthorized PC modifications. The two most common instances of PC compromise arise from the corruption of (1) the return address in an activation record and (2) function pointers. The basic approach to guarding PC is to apply an encoding function before any potential PC value (such as return address, or function pointer table entry) is stored in any memory location (such as a stack frame or function pointer table in the data or heap space). <br\/><br\/>Any read of a memory value into the PC first has to go through a decoding function. A compromised PC value would go only through the decoding function and hence would render the malicious attack ineffective. This research investigates several variations of PC encoding\/decoding schemes and evaluates computational overhead of these schemes and their effectiveness. This research plans to build a hardened Linux system, gcc compiler and other public domain utilities such as Apache web server incorporating the proposed return address and function pointer protection schemes.","title":"ITR-SY: System Hardening through Security Aware Compilation and Processor Architecture","awardID":"0242222","effectiveDate":"2002-05-15","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["316670"],"PO":["325495"]},"76146":{"abstract":"Pierre Moulin<br\/>University of Illiniois @ Urbana-Champaign<br\/><br\/>The goal of the workshop is to bring together a multidisciplinary group of researchers to identify promising research directions in authentication, information hiding, and related areas. The researchers come from diverse communities including: signal processing, information theory, coding theory, cryptography, and computer science. Each researcher will present a 20-minute talk followed by questions from the audience. There will also be a few short panel-type sessions in which everyone participates. There will also be representatives from NSF and possibly other federal agencies (NSA, DARPA).","title":"Perspectives in Signal Authentication","awardID":"0227350","effectiveDate":"2002-05-15","expirationDate":"2002-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["518625"],"PO":["564898"]},"72110":{"abstract":"Increased computing power allows for three dimensional models to be represented as digital images, which can be manipulated quite easily. Such advanced computer imaging affects many professions, and is expected to result in fundamental changes in the way those professions organize and conduct their work. This research will study the way that Frank O. Gehry and his firm of architects uses three-dimensional computer modeling in the design of buildings and the changes that it creates in his architectural practice and in the construction companies that participate with him in his building projects. It will study both the Frank Gehry firm, Gehry Partners, as well as key contractors, consultants and subcontractors involved in the construction of several of his most innovative building designs. The objective is to understand how innovation in work practices, technology use and organizational structures accompany the use of advanced three-dimensional computer imaging in both the Gehry Partners' firm as well as the contractors, consultants and subcontractors associated with his projects. The objective is to determine whether or not his innovative designs serve as a path creating event for his firm and companies working on his projects. <br\/><br\/>Path creating events are building projects that require a firm to break from the standard routines established in its industry and develop new approaches to doing its work. An hypothesis to be explored in this research is that the designs by Gehry Partners require innovation in work practices, technology use, and organization structures by those associated with his building projects. Another hypothesis is that the path-creating behaviors developed for work on his projects is carried over by the construction firms into other subsequent projects that they work on, including those designed by other architects. This is a different approach to the study of innovation, since most prior studies have either followed the invention and development of a particular technology over time, or have followed how a given technology is adopted by a population of firms. Here, innovation is conceptualized as a cascading wake that is initiated by path creating designs and is carried over in multiple forms to other aspects of an industry (in this case the construction industry). The benefit is a better understanding of how innovation takes place across firms and the network of innovation that is spawned by the adoption of advanced computer technologies in a profession such as architecture.","title":"Path Creation with Digital Technologies: Networks of Innovation in Architectural Design and Construction","awardID":"0208963","effectiveDate":"2002-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["313254","538337","517735"],"PO":["564456"]},"68645":{"abstract":"EIA-0138973<br\/>Roberts, Fred<br\/>Rutgers Univ. New Brunswick<br\/><br\/>Title: REU DIMACS-DIMATIA International REU Program<br\/><br\/>DIMACS, the Center for Discrete Mathematics and Theoretical Computer Science, headquartered at Rutgers University, proposes a three-part domestic and international REU program. The program will be co-sponsored by DIMATIA, the Center for Discrete Mathematics, Theoretical Informatics, and Applications, at Charles University in Prague, Czech Republic. The REU program we are proposing will be modeled after the highly successful programs we have already run and will have the following three parts: (i) A group of five students from all across the U.S. will participate in an 8-week REU program headquartered at DIMACS; (ii) A second group of five students from all across the U.S. will participate in the 8-week domestic REU program and then spend 3 additional weeks at DIMATIA; (iii) a group of five students from the Czech Republic will participate in the 8-week domestic REU program and then act as hosts at DIMATIA when the U.S. students go to Prague. The REU program will focus on the strengths that are joint between DIMACS and DIMATIA, and in particular on the fields of extremal and algebraic combinatorics, graph theory, computational geometry, logic and complexity theory, and combinatorial optimization.","title":"Research Experiences for Undergraduates - REU: DIMACS-DIMATIA International REU Program","awardID":"0138973","effectiveDate":"2002-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7335","name":"WORKFORCE IN THE MATHEMAT SCI"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}}],"PIcoPI":["264120"],"PO":["564181"]},"68667":{"abstract":"Autonomous parties - both companies and people - who exist in networked environments must perforce interact. Protocols structure and streamline those interactions. Traditional representations of protocols specify legal sequences of actions but not their content. Thus, traditional representations cannot adequately support flexible interactions (e.g., to handle exceptions and exploit opportunities.) This project will develop a richer model of protocols via an inference mechanism, called commitment machines, in which a declarative content is formulated for protocol states and actions in terms of the participants' commitments. Because of its representation of content and its inferencing-based operational rules, a commitment machine effectively encodes a flexible version of a protocol, thereby allowing a wider variety of legal moves than traditional representations. This project seeks to study protocols and commitment machines, capturing the kinds of reasoning needed in practical protocols, such as for e-commerce. Specifically, this project will 1) formulate a semantics for protocols that applies in open, networked applications, 2) represent protocols as generalized commitment machines, 3) implement commitment machines in a tool for protocol analysis and design, 4) evaluate the approach by applying the tool on popular and emerging e-commerce protocols, and 5) classify useful and pathological kinds of commitment machines.","title":"Principles of Commitment Protocols","awardID":"0139037","effectiveDate":"2002-05-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["565158"],"PO":["564456"]},"75147":{"abstract":"DMS-0138458<br\/>Peter Schroder<br\/>DMS-0221642<br\/>Ronald A. Devore<br\/>DMS-0221669<br\/>Mathieu Desbrun<br\/><br\/>This is a collaborative project funded by the CARGO program under<br\/>DMS-0138458, DMS-0221642, and DMS-0221669. This is the Age of Information. Whether it be in scientific computation or reverse engineering, in remote sensing or medicine, data sets of <br\/>incredible resolution and exquisite detail are created<br\/>daily. These data sets often have geometric structure which <br\/>contains important information about the data and its <br\/>application. The usefulness of such geometric datasets <br\/>rests on our ability to process them efficiently, whether <br\/>it be for storage, transmission, visual display, correlation, <br\/>or registration against data from other modalities. <br\/>Compression is the common critical issue in all<br\/>these applications.<br\/><br\/>Current data processing technology does not provide the <br\/>efficient and geometrically faithful representations demanded <br\/>by applications. In fact, a satisfactory data processing <br\/>platform will not be created by incremental advances of current technology but rather through a fundamental investigation of <br\/>how to represent large data sets with inherent geometry. To <br\/>pursue the necessary advances a team of researchers and <br\/>application developers representing expertise from<br\/>several disciplines including mathematics, computer science, <br\/>and engineering has been assembled. As drivers of the research, specially targeted applications (DTED, reverse engineering, <br\/>physical simulation) have been selected to guide the formulation <br\/>of the most critical and meaningful problems, as well as testing approaches to solving them. The team is carrying out <br\/>fundamental investigations on the representation and compression <br\/>of data sets with geometry by building new mathematical theory<br\/>including deterministic models, appropriate application <br\/>specific error metrics (e.g., Haussdorf distance rather<br\/>than Lp norms), an information theory based on Kolmogorov <br\/>entropy to determine the optimal compression, and the <br\/>development of nonlinear methods for representing the data <br\/>sets which are near optimal in the entropy sense.","title":"Collaborative Research: Compression of Geometry Datasets","awardID":"0221642","effectiveDate":"2002-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["519450"],"PO":["218970"]},"68536":{"abstract":"DMS-0138458<br\/>Peter Schroder<br\/>DMS-0221642<br\/>Ronald A. Devore<br\/>DMS-0221669<br\/>Mathieu Desbrun<br\/><br\/>This is a collaborative project funded by the CARGO program under<br\/>DMS-0138458, DMS-0221642, and DMS-0221669. This is the Age of Information. Whether it be in scientific computation or reverse engineering, in remote sensing or medicine, data sets of <br\/>incredible resolution and exquisite detail are created<br\/>daily. These data sets often have geometric structure which <br\/>contains important information about the data and its <br\/>application. The usefulness of such geometric datasets <br\/>rests on our ability to process them efficiently, whether <br\/>it be for storage, transmission, visual display, correlation, <br\/>or registration against data from other modalities. <br\/>Compression is the common critical issue in all<br\/>these applications.<br\/><br\/>Current data processing technology does not provide the <br\/>efficient and geometrically faithful representations demanded <br\/>by applications. In fact, a satisfactory data processing <br\/>platform will not be created by incremental advances of current technology but rather through a fundamental investigation of <br\/>how to represent large data sets with inherent geometry. To <br\/>pursue the necessary advances a team of researchers and <br\/>application developers representing expertise from<br\/>several disciplines including mathematics, computer science, <br\/>and engineering has been assembled. As drivers of the research, specially targeted applications (DTED, reverse engineering, <br\/>physical simulation) have been selected to guide the formulation <br\/>of the most critical and meaningful problems, as well as testing approaches to solving them. The team is carrying out <br\/>fundamental investigations on the representation and compression <br\/>of data sets with geometry by building new mathematical theory<br\/>including deterministic models, appropriate application <br\/>specific error metrics (e.g., Haussdorf distance rather<br\/>than Lp norms), an information theory based on Kolmogorov <br\/>entropy to determine the optimal compression, and the <br\/>development of nonlinear methods for representing the data <br\/>sets which are near optimal in the entropy sense.","title":"Collaborative Research: Compression of Geometry Datasets","awardID":"0138458","effectiveDate":"2002-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["320958"],"PO":["313600"]},"68448":{"abstract":"DMS-0138098<br\/>Thomas J. Peters<br\/><br\/>The investigators will define new representations for <br\/>intersecting spline surfaces within computer-aided design <br\/>(CAD) geometric objects. They will also create algorithms <br\/>to compute error bounds for approximated intersections <br\/>representing topological boundaries. Many modeling<br\/>techniques for geometric design depend upon reliable <br\/>intersection algorithms. Intersection algorithms will be <br\/>designed to deliver spline-based CAD geometric models that <br\/>can be robustly used within a variety of engineering <br\/>calculations. These intersection representations and error <br\/>bounds will significantly improve robustness between engineering <br\/>design and computational applications for stress analysis, <br\/>fluid dynamics and electromagnetics. No single intersection representation or method will be appropriate for all <br\/>intersection problems, similar to the mature view<br\/>taken in computational linear algebra relative to matrix <br\/>inversion. There, a matrix is first analyzed as to whether <br\/>it is singular, ill-conditioned (as in the case of a Hilbert <br\/>matrix), positive-definite, etc. For these approximated <br\/>spline intersections, new guaranteed error bounds will be <br\/>developed, as well as corresponding new criteria for<br\/>semantic consistency of the intersection boundaries formed <br\/>within spline-based geometric models.<br\/><br\/>For example, the significant improvements to approximated <br\/>spline models from this project will provide clear benefits <br\/>to science, industry, and defense. The delivery of the <br\/>Boeing 777 airplane has been hailed in the popular press <br\/>as the first production of a 'paperless' airplane, meaning <br\/>that computerized models supplanted the traditional paper<br\/>drawings of the engineering design room. While an impressive<br\/>milestone, the next ambitious step is to eliminate many of <br\/>the physical prototypes used for destructive testing<br\/>and engineering analyses prior to releasing an airplane. <br\/>These tests on physical prototypes are expensive. An <br\/>appealing, cost-effective alternative is to reliably <br\/>simulate the complex behavior of turbulence, stress and <br\/>strain on computerized geometric models of these aircraft. <br\/>Progress towards that goal has been delayed by inaccuracies <br\/>introduced in the geometric input to these simulations, <br\/>specifically along intersection boundaries, and improvement <br\/>of such intersections is the primary focus of this project. <br\/>This project will ensure relevance to these contemporary <br\/>aeronautical design problems by the participation of<br\/>Boeing scientists and engineers.","title":"I-TANGO: Intersections --- Topology, Accuracy and Numerics for Geometric Objects (in Computer Aided Design)","awardID":"0138098","effectiveDate":"2002-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["482465","425107","201138","317581"],"PO":["183592"]},"73069":{"abstract":"The University of Alaska has a collection of oral history recordings, made over several decades, of Native<br\/>American (Inuit and Athabaskan) individuals. Although prototypes of Web access to such collections exist,<br\/>research is needed to explore the opinions and preferences of the native communities to the wider distribution of these materials. This project will explore how they would like to see the Web used to benefit them, what use they can make of online access to the materials, and what kinds of improvements in interfaces and in policy would best suit the communities. The project involves both design of computer systems and travel and interviewing the communities. It will result in knowledge that may help ameliorate the \"digital divide\" between the majority US society and the generally poorer Native American communities, as well as presenting challenges to computer science research to learn how to build systems that support the policies needed by these communities.","title":"How Public is Public? Issues and Solutions for Oral History on the Internet","awardID":"0213351","effectiveDate":"2002-05-15","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["539862"],"PO":["564456"]},"65347":{"abstract":"The Center for Innovative Learning Technologies (CILT) was founded in October 1997 with a four-year grant from the National Science Foundation. The invited Accomplishment Based Renewal (ABR) proposal describes CILT' s planned activities during this ABR period.<br\/><br\/>CILT was formed to stimulate the development and implementation of important, technology-enabled solutions to critical problems in K-14 science, mathematics, engineering, and technology (SMET) learning. CILT has engaged the collaborative efforts of an exceptionally wide range of people, institutions, and organizations including hundreds of cognitive scientists, computer scientists, natural scientists, engineers, classroom teachers, educational researchers, learning technology industry leaders, and policy analysts. CILT is designed as an inclusive national effort led by five institutions -SRI International, Stanford University , University of California at Berkeley, Vanderbilt University, and the Concord Consortium - each with a broad range of expertise and an international reputation for making effective, innovative contributions to technology-enhanced SMET learning.<br\/><br\/>During the ABR period, CILT will continue its current work of hosting workshops that encourage collaboration throughout the field; funding and facilitating a new round of seed grants; and fostering the development of new researchers through its post doctoral researcher program. In addition, CILT team will find ways to sustain the promising aspects of CILT by refocusing the theme teams, nurturing the community that CILT has created, institutionalizing effective components of CILT, and exploring next steps. More can be learned about CILT and its current activities at http:\/\/www.cilt.org.","title":"Learning & Intelligent Systems: Center For Innovative Learning Technologies","awardID":"0124012","effectiveDate":"2002-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"1666","name":"RESEARCH ON LEARNING & EDUCATI"}}],"PIcoPI":["560145","533534","487434","527266","501315","549245"],"PO":["564318"]},"67327":{"abstract":"0132901<br\/>Har-Peled, Sariel<br\/>U of Ill, Urbana-Champaign<br\/><br\/>Computational geometry is the branch of theoretical computer science devoted to the design,<br\/>analysis, and implementation of geometric algorithms and data structures. Computational<br\/>geometry has deep roots in reality: Geometric problems arise naturally in any computa-<br\/>tional field that simulates or interacts with the physical world|computer graphics, robotics,<br\/>geographic information systems, computer aided-design, and molecular modeling, to name<br\/>a few|as well as in more abstract domains such as combinatorial geometry and algebraic<br\/>topology. Aside from their obvious practical significance, geometric algorithms and data<br\/>structures enjoy a rich and satisfying mathematical structure, and their development often<br\/>requires tools from mathematical disciplines such as combinatorics, topology, and algebraic<br\/>geometry, as well as traditional computational tools.<br\/>The proposal outlines a challenging career development plan focusing on research in a<br\/>broad cross-section of computational geometry, building on and significantly broadening the<br\/>PI's successful work in the field over the last several years. Specific problem areas in which<br\/>the PI plans to work include approximation algorithms, kinetic data structures, spatial and<br\/>temporal databases, external memory computation, geometric optimization, and clustering.<br\/>This classification is at best a rough guide, as many interesting geometric problems fall<br\/>into more than one category. Furthermore, the PI plans to continue combining theory and<br\/>empirical experimentation in his work, putting an emphasize on algorithms that perform<br\/>well in practice.","title":"CAREER: Approximation Algorithms for Geometric Computing","awardID":"0132901","effectiveDate":"2002-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["517802"],"PO":["321058"]},"68527":{"abstract":"DMS-0138411<br\/>Rida T. Farouki<br\/><br\/>Though motivated by practical engineering considerations, <br\/>surface intersection problems have deep roots in diverse <br\/>areas of mathematics, including algebra, geometry, topology, <br\/>analysis, and numerical methods. The proposed project will <br\/>bring the diverse expertise and renewed commitment of an inter-disciplinary team of mathematicians, computer<br\/>scientists, and engineers to bear on this critical problem. <br\/>Since successful solutions will require radically new <br\/>approaches and paradigms, rather than incremental advances, <br\/>special emphasis will be placed on re-visiting the problem <br\/>from first principles, seeking new insights through <br\/>synergistic dialog among participants with diverse areas of<br\/>expertise, and use of exploratory software implementations <br\/>as research tools. A central theme of the proposed research <br\/>is the ab initio incorporation of topological information <br\/>into the formulation and verification of intersection algorithms. Although failure to guarantee topological consistency is <br\/>the main deficiency of existing algorithms, this remains a <br\/>poorly explored domain. Our initial line of enquiry will<br\/>focus on using the homotopy or \"embedding\" method to track <br\/>topological changes in implicitly-defined algebraic curves, <br\/>as they evolve from \"simple\" initial configurations into a <br\/>prescribed intersection locus.<br\/><br\/>The accuracy, efficiency, and reliability of modern <br\/>computer-aided design (CAD) systems has been severely <br\/>compromised by the persistent lack of rigorous algorithms <br\/>for topologically-consistent representations of surface <br\/>intersections and trimmed surfaces. The solution to this<br\/>fundamental problem can have tremendous economic impact, <br\/>in terms of eliminating the laborious \"geometry preparation <br\/>and repair\" task that currently precedes the use of CAD <br\/>data in analysis, manufacturing, and inspection applications, <br\/>and in resolving data-exchange incompatibilities among <br\/>different CAD systems. The ensuing productivity benefits, <br\/>manifested in accelerated design cycles and greater reliance <br\/>on \"virtual prototyping\" for design verification, are crucial <br\/>to the maintenance of technological leadership.","title":"CARGO: Advanced Topological Methods for Robust Surface Intersection Algorithms and Trimmed Surface Representations","awardID":"0138411","effectiveDate":"2002-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["486372","181687"],"PO":["313600"]},"70057":{"abstract":"0201623<br\/>O'Connor<br\/>This award provides continued funding to the American Institute for Medical and Biological Engineering (AIMBE) to help promote scientific collaboration and improve communication among Biomedical Engineering researchers and their professional societies from 48 countries worldwide. AIMBE is the U.S. member organization to the International Federation of Medical and Biological Engineering and this award provides funds to support travel of AIMBE'S appointed representative to participate in meetings of IFMBE's Administrative Council. Representation on the Administrative Council provides the United States with the opportunity to develop new lines of communications and collaborative projects among biomedical engineering researchers globally, thereby extending the U.S. leadership role in medical science and technology research and development. This is particularly relevant to investigations concerning emerging medical technologies.<br\/><br\/>The current AIMBE representative to IFMBE is Dr. Dov Jaron, who also serves as the current President of IFMBE. Proceeds from a grant would be used to support the cost of attending Council meetings and regional conferences in Asia, Latin America, and Europe. The Council meetings entail strategic planning of the organization, planning of scientific meetings, publications, dissemination of scientific information and initiation of advanced projects in critical and emerging areas. The regional conferences are designed to promote collaboration and networking among Bioengineering researchers and educators from the United States and developing countries and as a mechanism to implement the critical projects. <br\/><br\/>The funding level is modest compared to the anticipated value for the U.S. community of biomedical engineering researchers. And the project is expected to promote the role of the National Science Foundation in advancing research and education in this field globally while assisting NSF in achieving its strategic objectives.","title":"United States Representation to the International Federation of Medical and Biological Engineering (IFMBE)","awardID":"0201623","effectiveDate":"2002-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["563711","363926","527522"],"PO":["317420"]},"68814":{"abstract":"This award provides funds for a Research Experiences for Undergraduates Site on Human Technology Interactions at the University of Oklahoma. This interdisciplinary REU Site will give undergraduates the opportunity to engage in research on human-technical systems. A total of 12 students, 10 funded by NSF and 2 funded by OU will spend eight weeks in the program. The students' time will be divided into three activities: individual research, team research, and collective activities. Each student will participate in individual research within an active laboratory. Research assistantships will be available in Cognitive Psychology, Social Psychology, Computer Science, Industrial Engineering, Library and Information Studies, History of Science, Information Systems, and Communication. A distinguishing characteristic of this program is that students will also participate on one of three multidisciplinary research teams composed of undergraduates and supervised by faculty and graduate students. To futher promote the experience of scientific inquiry, students will also participate in seminar and workshop series and special events. A multi-session ethics workshop will allow students to explore ethical issues in a variety of fields. Students will be recruited nationally and regionally with an emphasis on students who would otherwise have little opportunity to gain research experience or to develop technical expertise. <br\/>This award contributes to the Foundation's continuing efforts to attract talented students into careers in science through active undergraduate research experiences.","title":"REU on Human Technology Interaction","awardID":"0139480","effectiveDate":"2002-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["476812",178222],"PO":["565221"]},"77427":{"abstract":"This project examines several areas of research related to theorem proving techniques for multiple-valued logics (MVL's) and for proving completeness: - The most important work may be a new rule of inference, a resolution-like rule tentatively named Modification, for regular MVL's. It appears likely that Modification is more effective than existing methods of inference for MVL's; it is also likely that the insights provided by Modification can be adapted to improve the search behavior of other MVL inference rules. - Signed logic is an adaptation of classical logic for reasoning about MVL's. Several modest implementations have been developed recently for signed logic. The current project will broaden the focus to implementations in the general theorem proving setting. Experiments with logic programming and constraint solving will also be undertaken. - Annotated logic corresponds to a naturally arising class of signed logic and has been applied to reasoning with inconsistency. Current systems of annotated logic are paraconsistent, that is, inconsistency tolerant, with respect to epistemic inconsistency, but they behave classically with respect to ontological inconsistency. A mapping from signed logic to annotated logic has been defined which has the effect of mapping ontological inconsistency to epistemic inconsistency. Further investigation into properties of this mapping in the proposed project is expected to lead to fruitful insights on the relationships between the two notions of inconsistencies. - The Anderson-Bledsoe excess literal proof of the completeness of resolution was recently generalized to provide simplified proofs of known results as well as to prove completeness of connected tableaux and of connected regular tableaux for NNF formulas and the completeness of linear non-clausal resolution. The project will examine the application of the technique to still other methods of proof procedures.","title":"RUI: Deduction in Classical and Multiple-Valued Logics","awardID":"0233189","effectiveDate":"2002-05-16","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["562398"],"PO":[201974]},"68528":{"abstract":"DMS-0138420<br\/>Jarek Rossignac<br\/><br\/>We propose to develop the theoretical foundations and a <br\/>set of practical computing tools for the automatic analysis <br\/>of time-evolving shapes. Given a family of surfaces that <br\/>represent the boundary of a 3D shape whose geometry and <br\/>topology change with time, we propose to construct a <br\/>higher-dimensional multiresolution representation, which <br\/>we have named Atlas Transition Diagram, abbreviated ATD, <br\/>that will identify and track the morphological and <br\/>topological features of the 3D shape as they evolve with <br\/>time and with resolution. Our ATD will also associate a <br\/>chart to each feature, thus providing a surface-parameterization <br\/>that naturally follows the branches and handles of each <br\/>shape in the family. The charts evolve smoothly with time <br\/>and resolution and are topologically glued together at <br\/>their common boundaries to provide a continuous mapping, <br\/>S(r,t,u,v;f); f), that, given a feature ff, a resolution rr, <br\/>a time tt, and two parameters u and v, will identify a <br\/>unique point on the surface and will allow us to trace <br\/>its evolution with rr and tt. The theoretical underpinnings <br\/>and algorithmic designs that will lead to a practical <br\/>implementation of an efficient system for building and <br\/>querying ATDs go far beyond simple extensions of Morse <br\/>theory, of surface segmentation approaches, and of <br\/>multi-resolution techniques, which have so far been <br\/>mainly explored for static surfaces in 3D.<br\/><br\/>Evolving surfaces are important to many scientific <br\/>and engineering disciplines, including medicine, <br\/>developmental biology, cell biology, computational <br\/>fluid dynamics and computer aided design. They may <br\/>for example represent the growth of a tumor, the shifting <br\/>in position of a vortex over an airplane wing, or the <br\/>budding of fingers on the hand of a human embryo. We <br\/>propose to develop and integrate a collection of <br\/>theoretical and algorithmic tools for the analysis <br\/>and automated visualization of such evolutions. These <br\/>tools will allow us to partition the evolving surface <br\/>into features upon which a high-level description of <br\/>the shape of the surface and of its evolution will be <br\/>based. Furthermore, they will allow us to track their <br\/>points, and thus surface properties, through time and <br\/>to better visualize their evolutions through texture <br\/>maps that continuously evolve with the features and <br\/>highlight their boundaries and natural orientation. <br\/>Finally, these tools will help us support queries <br\/>about the time and nature of topological changes <br\/>in the evolving surface, which may be important for <br\/>the automatic analysis and retrieval of scientific <br\/>datasets. To achieve these results, we propose to <br\/>build a surface representation that is controlled <br\/>independently or simultaneously by time and resolution <br\/>and to decompose the time\/resolution domain into cells <br\/>where the surface topology (number of components and <br\/>through holes) and its partition into features remain <br\/>constant. To validate our theoretical contributions <br\/>and to increase their impact on the community, we plan <br\/>to develop a prototype implementation for animated <br\/>objects with triangulated boundaries. We expect to <br\/>make the source code of this implementation and its <br\/>programming interface publicly available. We envision <br\/>exploring collaborations with application developers <br\/>in Science, Engineering, Medicine and Biology to help <br\/>us refine and validate this approach.","title":"CARGO: Multi-Scale Topological Analysis of Time-Evolving Shapes","awardID":"0138420","effectiveDate":"2002-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["456660","370776",177379,"423419"],"PO":["313600"]},"73765":{"abstract":"EIA-0215962<br\/>Ioannis Stamos<br\/>Charles Ehlschlaeger<br\/>CUNY Hunter College<br\/><br\/>MRI\/RUI: Acquisition of Range-Scanning Equipment and of Data Servers for the Reconstruction of Large-Scale Scenes from 3D Range and 2D Color Data<br\/><br\/>This proposal, addressing the problem of 3D-photorealistic reconstruction of large-scale scenes in a tightly integrated system that features novel registration, segmentation, modeling, and visualization algorithms, tackles the following issues:<br\/><br\/>1) Nonplanar segmentation, <br\/>2) Automatic registration between 3D and 2D data sets,<br\/>3) Integration of the data sets, and <br\/>4) Simplification of the complex geometry.<br\/><br\/>The project requests the acquisition of a highly accurate range-scanner that can provide dense 3D data of outdoor scenes. Proposed is a system that operates on an input sequence of calibrated and uncalibrated 3D range and 2D image data. The system will segment the range and color images, extract their features, establish topological relationships between features, and derive global topological relationships between features in the final 3D geometric model. The whole process will be fully automated except for the range-to-image registration process that requires minimal user interaction. The expected output consists of a complete photorealistic model of the scene. The resulting 3D models will be utilized in geospatial; the acquired data will also be used for teaching purposes in CS and Geography departments. Aided by the Center of the Analysis and Research of Spatial Information (CARSI), urban areas of downtown New York and the interior of Grand Central Station in Manhattan are being used as testbeds.","title":"MRI\/RUI: Acquisition of Range-Scanning Equipment and of Data Servers for the Reconstruction of Large-Scale Scenes from 3D Range and 2D Color Data.","awardID":"0215962","effectiveDate":"2002-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["409474",191178],"PO":["557609"]},"72225":{"abstract":"Truong-Thao Nguyen<br\/>CUNY City College<br\/><br\/>The fast growth of the applied area of analog-to-digital conversion has simultaneously hindered the solid establishment of its mathematical foundations. This has become particularly critical with the currently successful technique of modulation, as recent results of the principal investigator have shown the inaccuracy of the conversion error model universally adopted until now. The research proposed in this project is based on recent discoveries of fundamental algebraic properties of n th order modulators and aims at establishing the first general algebraic foundations to modulation. On going research has already proved effective in correcting the classical error model. Although new practical improved techniques may not be the immediate outcome to this small grant proposal, the establishments of solid foundations will enable the growth of powerful analytical tools, opening new directions of design not accessible by the currently empirical approach to modulation.","title":"Algebraic Properties of nth order Sigma-Delta Modulators","awardID":"0209431","effectiveDate":"2002-05-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["279723"],"PO":["564898"]},"72249":{"abstract":"0209514<br\/>Bellaachia<br\/><br\/>Description: This project supports a U.S.-Morocco workshop on information technology to be held in Rabat, Morocco June 2002. The U.S. organizer is Dr. Abdelghani Bellaachia, Professor in the Department of Computer Science, George Washington University, Washington, D.C. The Moroccan co-organizer is Dr. Said Belcadi, Director, Scientific Research and Cooperation (CNCPRST), Ministry of Higher Education and Scientific Research, Rabat, Morocco. The workshop will cover topics in the following areas: bioinformatics, e-commerce, internet\/networking, software engineering, telecomputing\/telemedicine, and wireless communications. It is hoped that the presentations and discussions will lead to identifications of areas of cooperative research of mutual interest to the two countries.<br\/><br\/>Scope: This project will likely open avenues for collaboration in information technology research, an important area for the United States and for many of the developing countries, such as Morocco, where there is a need to accelerate the development in that area and to reap benefits in many applications such as in education, communications and in industrialization. The U.S. team that Dr. Bellaachia has assembled is composed of eminent and experienced scientists. The Government of Morocco has strongly endorsed the workshop. Funding for the project is provided by the Office of International Science and Engineering and the Division of Advanced Networking Infrastructure and Research.","title":"US-Morocco Workshop: Information Technology, June 2002","awardID":"0209514","effectiveDate":"2002-05-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["352978"],"PO":["540599"]},"71436":{"abstract":"The proposal requests support for convening an study group to examine networking and computing advances to enable new information management capabilities for domains of particular interest to sectors of the government. The study group will produce and disseminate its findings within one year of the start of the project.","title":"Information Management Requirements Study","awardID":"0206538","effectiveDate":"2002-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[185030],"PO":["433760"]},"67929":{"abstract":"0135943<br\/>David Luebke<br\/>University of Virginia<br\/><br\/>The computer g aphics community increasingly recognizes the importance of understanding and leveraging the human pe ceptual system.Indeed,several researchers have proposed techniques to accelerate rendering by exploiting the limitations of human vision. However,this research has focused on realistic rendering algorithms such as ray and path tracing, which take seconds or minutes to render.Ve y little work has been done on perceptually d iven interactive rendering,whe e each image must be completed in milliseconds.Yet a dire need exists for techniques to accelerate interactive rendering of ever-la ger datasets,fo despite<br\/>tremendous strides in graphics hardware,the growth in complexity of 3-D models appears to be<br\/>outstripping our ability to render them.<br\/>One barrier to research on perceptually motivated interactive rendering acceleration methods has been the inflexibility of standard graphics hardware.The rendering pipeline, specialized and perfected over many yea s,is now extremely fast at a narrow set of rendering tasks,but researchers cannot tamper with the traditional polygon-rendering underpinnings. We propose to circumvent this barrier by using software rendering,distributed across a cluster to achieve interactive ates on complex scenes.This SGER focuses on building the equipment necessa y to analyze several perceptual rendering techniques impossible under the traditional polygon-oriented interactive rendering paradigm.","title":"Beyond the Frame: Perceptually Based Rendering with Distributed Graphics Systems","awardID":"0135943","effectiveDate":"2002-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["451003"],"PO":["532791"]},"70668":{"abstract":"This proposal seeks to extend the PARINT software package for parallel integration, furnishing it with the characteristics of a Problem Solving Environment. The main goals of the project are to offer a complete set of tools for composing problem secifications, compiling and running applications, while providing state-of-the-art problem solving power to the end user. To this end, we propose adding new techniques for extending the PARINT problem domain, e.g., to allow for a variety of integration regions, high dimensions, and singular integrated behavior. These include a transformation interface, new distributed Quasi-Monte Carlo strategies and extapolation methods. Specific contributions are in the development of numerical techniques and evaluation of parallel integration algorithms. Important issues in parallel and distributed computations such as load balancing are addressed, with an emphasis on loosely coupled and heterogeneous systems. Other contributions are in the areas of user interfaces, visualization and web computing.","title":"ALGORITHMS: Distributed Multivariate Integration in a Problem Solving Environment","awardID":"0203776","effectiveDate":"2002-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["279984","564591","490801","490803"],"PO":["565272"]}}