{"38170":{"abstract":"While there is a definite need for engineers well versed in areas such as algorithms, economics, and management, there is little opportunity to add these areas to an already crowded engineering curriculum. Hence it is incumbent upon engineering educators to diversify the existing curriculum to incorporate these topics wherever possible. It is of interest, then, that certain kinds of engineering problems give rise to these subjects naturally. For example, in networking and communications it is not uncommon to encounter systems that would benefit from decentralized operation, and possibly even fully distributed or market-type\" operations, in which the distributed actors are allowed to perform independently and free of centrally imposed constraints. The engineer must then must ensure that the \"market\" leads to the desired (e.g., fair or, more commonly, efficient) operational solution. This project involves research in wireless communication networks and the integration of algorithm design, economic, and management issues arising therein into the engineering curriculum. <br\/><br\/>Power control is an important element in modern wireless communication networks, and is essential in networks based on IS-95 or code division multiple access. This project's research is directed toward power control systems which, unlike conventional power control systems, do not follow a received-power balancing or signal-to-interference ratio balancing algorithm. Instead, the ne3w systems target minimum energy consumption for a given quality of service. They also differ from their predecessors because they optimize dynamically and cooperatively - a sufficiently high interference levels, a transmitter begins to decrease its power. By contrast, essentially all existing power control systems call for nodes to increase power when faced with increased interference, in some cases to the point of saturation at all mutually interfering nodes. Power control systems based on the new approach have the potential to outperform conventional systems significantly, in terms of offering better stability and equivalent throughputs at considerably lower average powers. While the benefits are system-wide, the actions that lead to them are purely selfish from the standpoint of the transmitter, and require no explicit coordination with other nodes. This research aims to exploit these principles for the development of improved power control algorithms and, more generally, for efficient distributed resource allocation algorithms applicable to a variety of engineering problems.","title":"CAREER: Efficient Distributed Resource Allocation Algorithms, with Application to Wireless Communications","awardID":"9875221","effectiveDate":"1999-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[97031],"PO":["150411"]},"36290":{"abstract":"There is a perception among certain members of the artificial intelligence community that the logic-based approach to AI has not been sufficiently recognized as important at NSF. This workshop will bring together leading researchers in the logic-based AI community, to provide them with an opportunity to exchange information in their sub-disciplines, to learn about related work in logic-based AI, and to assess the direction of the field as a whole. A report to NSF will describes important current themes in the field which are worthy of research support, and will provide an assessment of an area of research that some of the leading figures in artificial intelligence believe to be among the most promising for significant future advances. NSF funds will be used to partially support attendees who do not have sufficient funds to come otherwise, as well as a small number of student attendees; no funds will be used for overhead or for the PIs. The University of Maryland Institute for Advanced Computer Studies will contribute approximately $5,000 to defray the charge for use of the conference rooms, to provide preprints of papers, and for other incidentals.","title":"Workshop on Research in Logic-Based Artificial Intelligence","awardID":"9820138","effectiveDate":"1999-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[91398],"PO":["565227"]},"38393":{"abstract":"By providing a number of channels through which information may pass between user and computer, multimodal interfaces promise to significantly increase the bandwidth and fluidity of the interface between humans and machines. Natural language processing techniques typically focus on processing strings of words within a single dimension. This program of research seeks to develop an approach to multimodal language processing which enables parsing and interpretation of natural human input distributed across two or three spatial dimensions, time, and the acoustic dimension of speech. A declarative unification-based grammar representation is proposed for the description of multimodal integration strategies. This representation is interpreted by a multidimensional parser yielding an architecture which provides the foundation for next generation natural interfaces supporting human-computer interaction through speech, pen, gesture, and other modes. Fundamental advances in multimodal interfaces are essential to the successful migration of human-computer interaction from the desktop to small mobile computing devices, public information kiosks, and other platforms for which complex graphical user interfaces are not feasible. Multimodal interfaces stand to play a critical role both in realizing the vision of universal access to information and in the development of assistive technologies for people with disabilities.","title":"CAREER: Multimodal Language Processing for Natural Interfaces","awardID":"9876223","effectiveDate":"1999-03-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[97479],"PO":["565227"]},"38251":{"abstract":"Three recent advances in technology -- the advent of the Web, the revolution of digital media, and the dramatic performance improvement of PCs -- have opened the door for a host of new 3D computer graphics applications. Access to this technology, as well as broadening interest in graphics among non-technical people, drives a growing demand for new ways to catalogue, view, modify, and protect 3D models. Several challenges to providing these tools lie in the growing size and heterogeneity of both the data available and the groups of people manipulating these data.<br\/><br\/>This project investigates four application areas pertinent to 3D<br\/>surfaces: (1) a content-based query method for 3D surfaces in order to find 3D models in a large database -- this technique will enable people to find 3D models on the Web and will enhance catalogue searching for the digital library of the future; (2) algorithms for surface interpolation in order to visualize either the time-evolution of an isosurface or an animation of the isosurface from low to high threshold values -- this technology will aid understanding of 3D data sets such as those resulting from medical scans or astrophysical simulations; (3) controls for reshaping a 3D model based on hand-drawn gestures and interactions with other models -- these controls permit 3D animators to reshape models in a natural way, and they allow 2D<br\/>animators to apply complex textures to hand-drawn figures; and (4) a method for insertion and detection of an invisible digital watermark in a 3D surface -- watermarking technology addresses concerns about copyright protection of proprietary models, and will thereby spur the proliferation of new models on the Web.<br\/><br\/>A factor that binds these projects together is that they rely on two common underlying technologies. The projects share a common<br\/>fundamental technology -- multiresolution analysis -- a tool for<br\/>representing and manipulating data at different levels of detail. At a higher level, they share a common problem -- the surface correspondence problem -- which looks at how to map one surface onto another optimally. Solutions to this problem have direct application in the four projects highlighted above.","title":"CAREER: Applications of Surface Correspondence in Computer Graphics","awardID":"9875562","effectiveDate":"1999-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["424207"],"PO":["321058"]},"38262":{"abstract":"IIS-9875628<br\/>Kutulakos, Kiriakos<br\/>University of Rochester<br\/>$87,425.00<br\/><br\/>CAREER: Appearance-Driven Reconstruction of Three-Dimensinal Scenes in the Physical World<br\/><br\/>This is the first year funding of a four-year continuing award. This research investigates the automatic construction of geometric representations that accurately capture the three-dimensional shape, appearance, and motion of complex scenes in the physical world (objects, indoor\/outdoor environments, and people). The central idea is that a reconstructed 3D'shape must be consistent with a scene's photographs in order to be a valid geometric description of that scene. In this paradigm, termed \"Appearance-Driven Reconstruction,\" shape recovery is formulated as a geometric constraint satisfaction problem, where every input photograph is a constraint that restricts the space of all possible 3D shapes to only those shapes that reproduce that photograph. When many such photographs are available, each taken from a known position in space, they define an equivalence class of 3D shape solutions called photo-consistent shapes that simultaneously reproduce all input photographs when viewed from the photographs' viewpoints. The resulting algorithms aim to (1) compute these shapes for a hierarchy of increasingly more complex models for scene reflectance, illumination, and the image formation process, (2) provably handle scenes of arbitrary geometry and topology, (3) accept arbitrary collections of raw, unprocessed photographs as input. Educational activities will center around a new laboratory facility for Appearance-Driven Reconstruction where undergraduate and graduate students will be immersed into research as soon as possible. Course development will include (1) a new project-intensive undergraduate'course on \"Visual Computing\" and (2) a restructuring of the graduate computer vision course to emphasize applications in computer graphics and image-based rendering.","title":"CAREER: Appearance-Driven Reconstruction of Three-Dimensional Scenes in the Physical World","awardID":"9875628","effectiveDate":"1999-03-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["138901"],"PO":["234178"]},"38373":{"abstract":"An increasing number of today's computers are equipped with sensors and actuators, so that they can interact directly with people and the outside world. Specific examples include software agents that interact with people and other software agents through the Internet, and consumer products, which interact with people and the physical world. Such computers, often called \"embedded,\" face a variety of challenges. For example, sensor limitations might make it impossible to sense the state of the environment accurately; thus, embedded computers must be able to cope with uncertainty. The environments of embedded computers might be dynamic, in which case there is a need to adapt to changes therein. Additionally, embedded computers might have to meet real-time constraints, as their environments tend not to wait for the termination of their programs. While many of these issues have been researched in the field of artificial intelligence (AI), computer science still lacks a sound methodology for software development in embedded computers. Existing programming languages and toolkits do not address issues such as uncertainty, adaptation, and on-time computing.<br\/><br\/>The PI's career objective it to change the way embedded computers are programmed. To pursue this goal, he proposes research towards a new programming language, specifically designed for embedded computer systems. This language will introduce three new ideas currently not found in existing programming languages:<br\/><br\/>I. Probabilistic data types and operators. Probabilistic data types and operators will enable programmers to compute with uncertain information just as if it was certain. Probabilistic data types represent information by probability densities. They generalize existing data types (e.g., float, int) in that they represent multiple values at a time, weighted by numerical probabilities. From the programmer's view, probabilistic computation will be analogous to conventional computation, with the added benefit of increased robustness to uncertainty.<br\/><br\/>2. Adaptation. The PI will develop mechanisms that support data-driven adaptation of program code. language will possess built-in learning algorithms (e.g., neural networks, reinforcement learning) and a mechanism for proper credit assignment. This will support the design of adaptable software, capable of automatically adapting to changes in the environment. It will also enable programmers to \"teach\" their code, as a supplement to current software development practice.<br\/><br\/>3. Any-time execution. To accommodate the need for timely responses, the new language will provide run-time support for any-time computation. Any-time programs can be queried for a result at (almost) any time; the quality of their solutions, however, increases over time. To obtain any-time characteristics, the execution system will process probabilistic variables selectively, in decreasing order of the probability of individual values. A special mechanism will be provided that permits the event-driven termination of any-time computation.<br\/><br\/>If this research is successful, programmers of embedded systems will be able to utilize the results-with minimal overhead, effectively enabling them to develop better software with significantly less effort, when compared to today's best practice.<br\/><br\/>To better achieve his career goal, the PI will also engage in a collection of educational activities. He plans to revise the curriculum of CMU's introductory programming class, by including a course segment on embedded computation. He will also develop a new graduate-level course on embedded computation, which will integrate material from a variety of currently separate disciplines. For both courses, the programming language will be used as a vehicle: By using this language, students will gain a much deeper understanding of the various issues involved in embedded computation and their theoretical foundations. Additionally, feedback of advanced students will guide the basic research proposed here. All course materials, the language, its implementation and documentation, and all related research papers will be made available to the research community at large using the Web, so that others can contribute to and benefit from this project.","title":"CAREER: A Software Development Framework That Integrates Learning, Probabilistic Reasoning, And Any-Time Computation","awardID":"9876136","effectiveDate":"1999-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["353783"],"PO":["564456"]},"38385":{"abstract":"Future billion-transistor processor chips will require innovations in architecture to overcome the fact that although gate delays scale with transistor sizes, wire delays do not. A SOFT ARCHITECTURE is a high-performance computer built by integrating dynamic compiler software with simple, fast processing hardware. The dynamic compiler replaces the large, complex, instruction-scheduling logic that is used successfully to extract instruction-level parallelism in contemporary superscalar processors but that is likely to limit the clock rates of future designs due to long wires. The research objective is to determine whether and how a soft architecture can exceed the performance of an architecture using dynamic instruction scheduling in hardware. While the dynamic compiler must make decisions less frequently than hardware, it can make potentially better decisions than hardware by exploiting additional information and by employing adaptivity. The research method is to construct a sequence of soft processor prototypes, dynamic compilers atop both conventional and custom (simulated) hardware, and to evaluate the performance of those prototypes by comparing to equivalent all-hardware solutions using standard benchmarks. The project provides a set of workbench tools for simulation and analysis that will also be used in architecture classes at the graduate and undergraduate level.","title":"CAREER: Soft Architectures: A Billion Transistors and a High Clock Rate","awardID":"9876180","effectiveDate":"1999-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["292887"],"PO":["113883"]},"38396":{"abstract":"Measuring Information's Contribution: Research on Value and Productivity<br\/>CAREER #98-76233<br\/>Van Alstyne, Marshall W.<br\/>The University of Michigan, Ann Arbor<br\/><br\/><br\/>This career development plan developes research and education agendas along two dimensions: how to measure information value and how to evaluate information productivity.<br\/><br\/>The first study devolopes a proof-theoretic model of value by combining concepts of utility and time-discounting from economics and procedural information from computer science. By modeling information as an uncertainty reducing series of instructions, a decision maker creates a call on a particular result. Financial options theory might then be used to value the information instrument. The significance is that numerous management decisions might benefit from having better information value tools.<br\/><br\/>The second study provides an empirical complement by gathering data on management practices that contribute to productivity. Software monitors will track organizational information flows. Interviews will provide context. Hypotheses - such as the value of decentralized access, focused communications, and incentives to promote sharing - will be tested using econometrics. Study benefits include better understanding of information productivity, use of person rather than firm level data, and newly developed integration metrics.<br\/><br\/>Related educational activities include mentoring Ph.D. research assistants, teaching these topics in a new Information, Economics, Management, and Policy track, and codeveloping dual degrees in Public Policy, Electrical Engineering & Computer Science, and Law.","title":"CAREER: Measuring Information's Contribution: Research on Value and Productivity","awardID":"9876233","effectiveDate":"1999-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["517681"],"PO":["565227"]},"38286":{"abstract":"9876117<br\/><br\/>CAREER: Compiler Optimizations for Instruction Bandwidth<br\/><br\/>Wilson C. Hsieh<br\/><br\/><br\/>This project reexamines how compiler optimization affects one of the<br\/>bottlenecks in commercial applications: the cost of fetching<br\/>instructions. Standard compiler optimizations trade instruction<br\/>bandwidth for faster instruction sequences, which works well for<br\/>applications that have good instruction locality. Unfortunately,<br\/>recent studies have shown that instruction bandwidth is a<br\/>performance-limiting factor in many commercial applications, such as<br\/>databases, circuit simulators, and multimedia programs. In addition,<br\/>technology trends in processor architectures will also increase<br\/>applications' demands for instruction bandwidth. The proposed<br\/>research will explore several solutions to these problems. First, two<br\/>new compiler optimizations to improve utilization of the instruction<br\/>cache, instruction cache scheduling and code factoring, will be<br\/>investigated. Trace analysis of commercial applications will be used<br\/>to quantify their benefits. Second, traditional compiler<br\/>optimizations will be reexamined and redesigned as necessary, with the<br\/>goal of making them sensitive to instruction cache utilization.<br\/>Finally, architectural changes to support explicit cooperation between<br\/>the compiler and processor to make more efficient use of the<br\/>instruction cache will be explored. This research will provide a<br\/>better understanding of how compilers should optimize large,<br\/>commercial applications, which is a field that has remained relatively<br\/>unexamined in the research community.","title":"CAREER: QoS Architecture for General Purpose Network Computing.","awardID":"9875742","effectiveDate":"1999-03-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["438434"],"PO":["309350"]},"38297":{"abstract":"9875783 John Chapin<br\/>This is a project to build tools for the dynamic analysis of parallel servers, and to develop educational techniques for improving the teaching of dynamic analysis skills. Parallel servers include operating systems, web servers, and other applications which must run forever and respond to multiple requests in parallel. Parallel servers are difficult to test and debug using current approaches due to their inherent nondeterminism. Better dynamic analysis tools are a critical step towards improving the reliability of this important class of programs. The core technology developed in this project is a Java virtual machine specifically designed so that tools can easily monitor and control the execution of Java programs. A hypothesis of the project is that the use of such a tool platform will significantly simplify the construction of analysis tools. The project is building three major tools. A bidirectional debugger provides reverse in addition to forward execution commands. An exhaustive-search tester supports thorough analysis of timing-dependent behaviors. An exploratory modeling tool automates the documentation and checking of the developer's evolving understanding of program behavior. These tools will be deployed in undergraduate classes and integrated into curricular materials developed to help teach dynamic analysis techniques.","title":"CAREER: Virtual Machine-Based Dynamic Analysis","awardID":"9875783","effectiveDate":"1999-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["511247"],"PO":["150697"]},"38441":{"abstract":"This award is made under the high performance connections portion of ANIR's<br\/>\"Connections to the Internet\" announcement, NSF 98-102. It provides support<br\/>for two years for a DS-3 connection to the vBNS for University of Hawaii at<br\/>Manoa and the Mauna Kea Observatories through a partnership with the Defense<br\/>Research and Engineering Network. Applications include remote observing with<br\/>the Keck telescopes, time domain astronomy, search for near Earth asteroids,<br\/>study of active volcanoes, research in meteoritics and astrobiology, numerical<br\/>weather modeling and distance learning. Collaborating institutions include<br\/>California Institute of Technology, University of Washington, NASA Goddard<br\/>Space Flight Center, NASA Ames Research Center, Georgia Tech University and<br\/>University of New Mexico in Albuquerque","title":"Hawaii High Performance Internet Connection","awardID":"9876406","effectiveDate":"1999-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["559160"],"PO":["182196"]},"49243":{"abstract":"","title":"Channel Coding Problems Associated with the Transmission of Compressed Signals over Mobile Radio Channels","awardID":"9996222","effectiveDate":"1999-03-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["446637","40607"],"PO":["188393"]},"38287":{"abstract":"CAREER: Design of Time Cognizant Electrical Brokeragers<br\/>IIL-9875746<br\/>Konana, Prabhudev C<br\/>The University of Texas at Austin<br\/><br\/>This CAREER award supports interdisciplinary research on the development of enabling technology for the next generation of electronic brokerages. In the future, electronic brokerages must ideally provide time-cognizant, pro-active and innovative services based on complex user preferences similar to those expressed in verbal communication. This research focuses on developing the theoretical foundations and a methodology to (a) develop user interface to specify complex preferences interactively, (b) translate preferences into appropriate processing specifications, (c) develop efficient algorithms to detect, update and cancel events in a timely manner, and (d) design mechanisms that efficiently bind actions to event\/condition detection. A software architecture will be developed to create component-based functional packages that can be plugged into commercial databases. In addition, this research proposes an innovative approach to integrate economic principles into brokerage design tp provide the optimal service quality and to integrate the role of user trust. The findings, validated by Java-based proff-of-concept software prototypes, will help create arobust and reliable brokerages for advanced electronic commerce applications. the Integrated Educational Plan of this CAREER proposal includes the development of information technology and domain-related courses. These courses will deal with the design of domain-specific electronic brokerages and experimentation with new business models in the electronic environment.","title":"Design of Time Cognizant Electronic Brokerages","awardID":"9875746","effectiveDate":"1999-03-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["193487"],"PO":["564456"]},"38244":{"abstract":"9875536 J. Gregory Morrisett<br\/>We are examining the design, applications, and foundations of low-level, but safe programming languages. The goal is as in C, to give programmers (and compilers) the option of tight control over instructions and memory management, but as with high-level languages such as Java or SML, provide the abstraction and safety mechanisms needed to engineer large systems. In particular, we are exploring type systems that support the elimination of unnecessary dynamic tests, provide manual control over data layout, and give fine-grained control over the [de]allocation of memory objects, all without sacrificing the safety guarantees of high-level languages. We expect that the type systems for these low-level languages will have a number of compelling benefits. First, a programmer unsatisfied with automatically generated code or automatic memory managers will have the facilities to hand-optimize the code. As long as the resulting code continues to type-check, the programmer can be assured that the code is still safe. Second, typed low-level languages can serve as compiler intermediate or target languages. Here, the types can be used to support advanced optimizations, to ensure that compilation invariants are maintained, and to support security in extensible systems. Finally, typed low-level languages can serve as safe \"glue\" between high-level language systems and low-level services, such as runtime systems, operating systems, or hardware devices, thereby providing an evolutionary path from legacy software to next-generation systems.","title":"CAREER: Design, Applications, and Foundations of Safe, Low-Level Programming Languages","awardID":"9875536","effectiveDate":"1999-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["518022"],"PO":["564388"]},"38365":{"abstract":"9876117<br\/><br\/>CAREER: Compiler Optimizations for Instruction Bandwidth<br\/><br\/>Wilson C. Hsieh<br\/><br\/><br\/>This project reexamines how compiler optimization affects one of the<br\/>bottlenecks in commercial applications: the cost of fetching<br\/>instructions. Standard compiler optimizations trade instruction<br\/>bandwidth for faster instruction sequences, which works well for<br\/>applications that have good instruction locality. Unfortunately,<br\/>recent studies have shown that instruction bandwidth is a<br\/>performance-limiting factor in many commercial applications, such as<br\/>databases, circuit simulators, and multimedia programs. In addition,<br\/>technology trends in processor architectures will also increase<br\/>applications' demands for instruction bandwidth. The proposed<br\/>research will explore several solutions to these problems. First, two<br\/>new compiler optimizations to improve utilization of the instruction<br\/>cache, instruction cache scheduling and code factoring, will be<br\/>investigated. Trace analysis of commercial applications will be used<br\/>to quantify their benefits. Second, traditional compiler<br\/>optimizations will be reexamined and redesigned as necessary, with the<br\/>goal of making them sensitive to instruction cache utilization.<br\/>Finally, architectural changes to support explicit cooperation between<br\/>the compiler and processor to make more efficient use of the<br\/>instruction cache will be explored. This research will provide a<br\/>better understanding of how compilers should optimize large,<br\/>commercial applications, which is a field that has remained relatively<br\/>unexamined in the research community.","title":"CAREER: Compiler Optimizations for Instruction Bandwidth","awardID":"9876117","effectiveDate":"1999-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["247495"],"PO":["551992"]},"29675":{"abstract":"Cosmological phase transitions can be a copious source of topological defects. The same happens in condensed matter systems, and experiments on these systems can help in determining the mechanism for defect formation. The similarities between the superfluid transitions in liquid helium and cosmological models containing topological defects is especially strong. As a result, in recent years there has been considerable activity to simulate phase transitions of the early universe using liquid He-3 and <br\/>He-4.<br\/><br\/>Previous experiments in both He-3 and He-4 have shown that defects, in this case vortices, are indeed created, and that the vortex line density is consistent with estimates based on the mechanism proposed by Zurek, now known as the Kibble-Zurek (K-Z) mechanism. This mechanism makes specific predictions about the scaling of the vortex line density with a) the rate at which the transition takes place and b) the amplitude of the correlation length of the order parameter. In earlier experiments there was little control over the former, while the latter, determined solely by the fluid, could not be changed appreciably either. Prof. Mulder's group will carry out a new experiment, operating close to the tricritical point in He-3 and He-4 mixtures, will have the ability to change both over a wide range. This should result in a definitive test of the K-Z mechanism.<br\/><br\/>This project is jointly supported by the Division of Physics, the Division of Materials Research and the MPS Office of Multidisciplinary Activities.","title":"Cosmological Experiments in He3 - He4 Mixtures","awardID":"9800748","effectiveDate":"1999-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["483555","366521",74990],"PO":["445352"]},"38157":{"abstract":"9875171 George Necula <br\/>A major challenge in building software systems is to ensure that the various components fit together in a well-defined manner. This problem is exacerbated by the recent advent of software components whose origin is unknown or inherently untrusted, such as mobile code or user extensions for operating system kernels or database servers. Such system integrity and security problems are tackled using techniques from mathematical logic and programming language semantics, in the framework provided by Proof-Carrying Code. As part of this research, the existing Proof-Carrying Code framework is extended to deal both with new language features such as objects, higher-order functions and copying garbage collection, and with more complex safety and liveness properties, such as information flow and resource usage constraints. This requires the investigation of new formal reasoning systems that are capable of encoding the enriched safety properties along with new proof methods to assist the generation of the safety proofs.","title":"CAREER: A Logic-Based Approach to Software System Integrity and Security","awardID":"9875171","effectiveDate":"1999-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451874"],"PO":["564388"]},"36343":{"abstract":"9820275<br\/>GUPTA<br\/><br\/>Hydrologic Sciences, as a distinct, new, interdisciplinary Geoscience, was conceived in 1991 in a report of the National Research Council called \"Opportunities in Hydrologic Sciences\". A new initiative by the Directorate for Geosciences (GEO) called GEO-2000 offers a unique opportunity for the broad hydrology community to take steps to develop a comprehensive, long ten-n plan which can serve as a basis to enhance base funding in hydrologic sciences at NSF. Simultaneously, this plan would provide a basis for taking stock of ma or accomplishments and advancements which would result from an enhanced funding base, and identifying future needs. This proposal addresses how such a plan can be developed and implemented within a broad scientific framework involving three steps. The first step is to prepare a 'concept paper' or a 'science plan'. The second step is to organize a small workshop in which the science plan will serve as a discussion document. The workshop will send its 'initial recommendations' to GEO by February 28, 1999. The third step is to widely publicize the outcome of the first two steps, and seek input from the broad national and international hydrology community. This third step will serve as the basis for making appropriate revisions into initial recommendations, preparing a set of 'revised recommendations' for the 'GEO-2000 report' by the fall of 1999, and making plans for future action items beyond GEO-2000.","title":"A Framework to Reassess Basic Research and Educational Priorities in Hydrological Sciences For GEO-2000 and Beyond","awardID":"9820275","effectiveDate":"1999-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1527","name":"LARGE-SCALE DYNAMIC METEOROLOG"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1579","name":"HYDROLOGIC SCIENCES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1448","name":"GEOTECHNICAL I"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1352","name":"GEOGRAPHY AND SPATIAL SCIENCES"}}],"PIcoPI":["526930","563622"],"PO":["376131"]},"38269":{"abstract":"9875648 David B. Stewart<br\/>Education and research projects focus on software engineering for embedded real-time systems. Educational activities emphasize practical hands-on, inter-disciplinary learning by designing and implementing low-cost embedded systems in university laboratories. The objective of the research is to automate the analysis and fine-tuning of an embedded system's temporal properties to facilitate debugging of timing errors. Automation is achieved by designing a prediction mechanism that uses a combination of measured data, desired requirements, and theoretical models to predict what fine-tuning operations can aid in correcting the errors. A computer-aided software engineering (CASE) tool incorporates the methods, to make the research available to embedded system programmers. The impact of the integrated research and education plan is that more engineers will be available to fill the demand for embedded real-time software developers. Through education, more students will have hands-on experience with embedded systems, thus better preparing them for work in industry. Through research, better tools will enable engineers with expertise in other areas to implement their applications, even without an in-depth background in real-time systems theory. Together, development time for embedded systems can decrease and quality can be improved, ultimately leading to a lower cost for embedded system products.","title":"CAREER: Automated Analysis, Debugging, and Fine-Tuning of Timing Properties in Embedded Real-Time Systems","awardID":"9875648","effectiveDate":"1999-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["561880"],"PO":["150697"]},"34178":{"abstract":"Time-discrete one- and two- dimensional sequences and arrays find applications in signal processing and as aperture functions for electromagnetic and acoustic imaging. Applications of two dimensional perfect binary arrays are found in 2-D synchronization and time-frequency coding. These are also used<br\/>in channel coding and cryptographic coding. This research involves the study of perfect arrays and their related mathematical objects. Wide-band digital communications, optical signal processing, radar and audio coding are other disciplines that have applications of these objects.<br\/><br\/>The conventional binary case { +1, -1} as the alphabet. The investigator extends the alphabet to the ternary and quaternary cases: the corresponding alphabets being {0, +1, -1} and {i,-i,+1,-1}. Here i denotes the complex fourth roots of unity. The problems studied pertain to perfect binary arrays, perfect ternary arrays, perfect quaternary arrays, almost perfect arrays and periodic complementary sequences. The investigator studies these via their algebraic formulations viz. difference sets, supplementary difference sets and divisible difference sets. New structural theorems will be proved using character sums<br\/>of group ring elements over suitable abelian groups. These results would enable to produce new classes of sequences and arrays with desirable correlation properties.","title":"Arrays over Small Phase Alphabet Having Desirable Correlation Properties","awardID":"9814106","effectiveDate":"1999-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["450820"],"PO":["223414"]},"49358":{"abstract":"","title":"CAREER: Transcending the Limits to ILP Processing","awardID":"9996340","effectiveDate":"1999-03-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["225924"],"PO":["197478"]},"38237":{"abstract":"This research explores three seemingly unrelated areas in the interface of computing: Optimization, Logic, and Information Transmission. Optimization is the study of algorithms (methods usable by computers) to solve large search problems; Logic is the study of fundamental questions such as \"What is a proof of a mathematical statement?\", Information transmission studies methods to improve the communication reliability when data is transmitted over noisy wires. Recent discoveries involving deep mathematics have established intricate links between these three areas. This research project exploits these links to investigate central questions in all three areas. The scope varies from a novel approach for studying optimization problems to improved methods for reliable communication and progress in the field of mathematical logic. The project will also introduce new courses and material at the graduate and undergraduate level to bridge gaps between mathematics and computer science.<br\/><br\/>Recent discoveries in theoretical computer science have revealed new connections between the complexity of finding approximate solutions to optimization problems and probabilistic notions of verification of proofs. This connection has already emerged as a powerful tool in the analysis of optimization problems. This research project exploits this new tool to classify entire classes of optimization problems. The resulting classification may provide one of the first systematic approaches to the study of optimization problems. The project also investigates related qu4estions about the nature of probabilistic checking of proofs and their efficiency with respect to new parameters. Scope of the project includes progress in the study of optimization and logic, as 3ell as improved methods for recovery from noise in information transmission. The education program focuses on the newly emerging themes in the area between mathematics and computer science and designs courses on probabilistic methods in logic and algebra to deal with the new needs.","title":"CAREER: Optimization, Probabilistic Checking of Proofs and Error-correcting Codes","awardID":"9875511","effectiveDate":"1999-03-01","expirationDate":"2003-01-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["425345"],"PO":["188393"]},"35652":{"abstract":"9818341<br\/>Brown, Frank M.<br\/>Agah, Arvin<br\/>University of Kansas<br\/><br\/>Ambiguity Resolution for Intelligent Systems Using a Cognitive Robot<br\/><br\/>This research instrumentation contributes to the acquisition, by the Departments of Electrical Engineering and Computer Science, Psychology, and Speech Language and Hearing, of a Cognitive Robot (base system, arm and hand manipulator, binocular color vision, laser ranger, sound reception and interpretation, and sound generation) enabling research projects in:<br\/><br\/>- Ambiguity Resolution in Spoken Language Understanding,<br\/>- Ambiguity Resolution in Context Driven Active Robot Vision,<br\/>- Ambiguity Resolution within the Memory System, and<br\/>- Ambiguity Resolution in Robot Reasoning and Actuation.<br\/><br\/>The Cognitive Robot, with visual, speech, movement, and hand\/arm manipulation capabilities, will enable research plausible interactions among the processes of ambiguity resolution in multiple cognitive subsystems including subsystems for speech and natural language understanding, scene interpretation, the retrieval of appropriate memory context, and robot planning and action execution. The research methodology is to integrate together computational models of these various ambiguity resolution processes of these subsystems into the Cognitive Robot and to test them in an integrated fashion by observing the behavior of the Cognitive Robot. The significance of this research lies in the fact that ambiguity in one subsystem can often only be resolved by the ambiguity resolution capabilities of the other subsystems. Thus, the study of ambiguity resolution in each of the four research projects using the Cognitive Robot will be enhanced by its integration with the ambiguity resolution capabilities of the others. Since the human capability for effortlessly resolving ambiguity seems to be a fundamental aspect of intelligence, an explication of the interactions among the ambiguity resolution capabilities of these subsystems may be highly significant.","title":"CISE Research Instrumentation: Ambiguity Resolution for Intelligent Systems Using a Cognitive Robot","awardID":"9818341","effectiveDate":"1999-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["504404","468586","507227",89694,"564342"],"PO":["557609"]},"34883":{"abstract":"The 1999 IEEE International Conference on Robotics and Automation-ICRA99 is a biennial conference being held May 10 to 15, 1999 in Detroit, Michigan. It is the premiere international symposium of its kind, attracting researchers and practicing engineers from around the world. To encourage student participation at the conference, a \"Best Student Paper\" competition has been implemented. This proposal request travel support for students from U.S. universities who are selected to participate in the Student Paper competition but who without a travel subsidy would be unable to participate. http:\/\/www.cs.umn.edu\/icra99\/","title":"Workshop: Student Paper Competition at the 1999 IEEE International Conference on Robotics and Automation-ICRA99","awardID":"9816024","effectiveDate":"1999-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[87775],"PO":["335186"]},"38338":{"abstract":"CCR-9875960<br\/>Vijaykumar<br\/><br\/>Traditionally, the gap between processor and main memory speeds has been bridged by placing a hierarchy of cache memories containing successive levels of slower, larger caches between the processor and main memory accesses that miss in the faster levels of the hierarchy underscoring the need for better cache hierarchy management.<br\/><br\/>The ever-increasing number of on-chip transistors can be employed to track dynamic information relevant to memory accesses. This project investigates novel hardware techniques to allow flexible cache management without excessive overheads. The techniques comprise of (1) providing flexible management through high cache associativity, (2) providing a shortcut from instructions to cache frames to avoid the overhead of high associativity, (3) tracking the instructions that compute the address of a cache miss to initiate a prefetch by executing such address computations, early, and (4) tracking the instructions that access cache blocks to enable replacement of less useful blocks by more useful data. Performance achieved by the proposed hardware-based techniques is evaluated by testing widely used benchmarks through a detailed software simulator.","title":"CAREER: Purdue Memory Access Based Caching Schemes","awardID":"9875960","effectiveDate":"1999-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550778"],"PO":["113883"]},"35643":{"abstract":"9818323<br\/>Maletic, Jonathan I.<br\/>Dasgupta, Dipankar<br\/>University of Memphis<br\/><br\/>Instruments for Systems, Software, and Database Research<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Geometric Techniques for Data Mining,<br\/>- Immunity-Based Intrusion Detection,<br\/>- Adaptive Indexing, and <br\/>- Software Reuse and Understanding.<br\/><br\/>To support the aforementioned projects, this award contributes in building an instrumentation infrastructure, a laboratory dedicated to specific research in systems, software, and database, at the University of Memphis, Department of Mathematical Sciences. The funds will contribute to the purchase of a Sun Enterprise 250, some Sun Ultra 5's, and the supporting networking software facilities. The computational techniques in the first project will be used to handle data mining problems in time series, where the data is not geometric in nature, but solutions involve geometric structures and algorithms and in spatial data mining, where the data itself is geometric in nature. Specific problems include similarity measure and searching in time series, and proximity and clustering problems in spatial data mining. The second project focuses on investigating immunological principles in designing a multi-agent system for network intrusion detection. The immune agents roam around the nodes of the network and monitor the situation, mutually recognize each other's activities, and produce specific action, while learning and adapting to its environment dynamically. The third project explores techniques such as query information and automatically adjusting features to enable the indexing to respond to change more appropriately. The last project tries to improve software quality and productivity through software reuse using latent semantic analysis.","title":"CISE Research Instrumentation: Instruments for Systems, Software, and Database Research","awardID":"9818323","effectiveDate":"1999-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["560637","156824",89660,"543540"],"PO":["301532"]},"36359":{"abstract":"EIA-9820309<br\/>Allan, Joseph<br\/>Callan, Jamie<br\/>U of Massachusetts - Amherst<br\/><br\/>REU: Involving Undergraduates in Research at the Center for Intelligent Information Retrieval<br\/><br\/>This Research Experiences for Undergraduates (REU) Site project supports ten students per year in programs carried out during the summers for three years. The students work on projects in the Center for Intelligent Information Retrieval (CIIR). The projects include work in image matching algorithms, machine methods for learning profile characteristics, retrieval of handwritten documents using image matching algorithms, and building Java interfaces for visualization. The project has strong collaborative plans for the project with Mt. Holyoke College, an outstanding and nearby women's institution.<br\/><br\/>Students for the REU program are recruited nationwide, but the program focuses on students from the University of Massachusetts and the four nearby undergraduate colleges. Faculty and students join in a group seminar that is used to describe, explore, and discuss research methodology, helping undergraduates learn what makes \"good science\". The group-based approach is an important aspect of the REU at the CIIR.","title":"REU: Involving Undergraduates in Research at the Center for Intelligent Information Retrieval","awardID":"9820309","effectiveDate":"1999-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["553228","406626","507668","541869"],"PO":["329035"]},"36238":{"abstract":"EIA-9819960<br\/>McGinnes, Patricia<br\/>Shelborne, Anthony<br\/>Council for Excellence in Government<br\/><br\/>Digital Government: Building Leadership for a Digital Government<br\/><br\/>The Council for Excellence in Government, in partnership with the Federal World-Wide Web Consortium, academics and industrial researchers, will design, develop and implement three actitivies to foster greater understanding of the value of the computer\/information science research process and products in the Federal Government arena. The three activities are:<br\/>1. A Digital Government resource center<br\/>2. Education and outreach programs, building on work by the Federal World-Wide Web Consortium, and<br\/>3. Planning for the development of a curriculum for a Digital Government Fellows program.","title":"Digital Government: Building Leadership for a Digital Government","awardID":"9819969","effectiveDate":"1999-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X593","name":"NATL IMAGERY & MAPPING AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X607","name":"CIA-FED CONSORTIUM MEMBERSHIP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X742","name":"BUR OF CENSUS-WORLD WIDE WEB"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"Y945","name":"HUD-NSF FEDERAL IT WEB CONSORT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"Y967","name":"NSA-WWW FEDERAL CONSORTIUM"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1400","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"9170","name":"NSF PLANNING & EVALUATION"}}],"PIcoPI":[91261,91262,91263],"PO":["371077"]},"36569":{"abstract":"As the nation commits more and more of its information and data resources to digital form, the assurance that vital records are stored and information is preserved for future generations is essential. The NSF Workshop on Data Archival and Information Preservation addressing these issues is organized by Christine Borgman, UCLA; Su-Shing Chen, University of Missouri-Columbia (Co-Chair), Hector Garcia-Molina, Stanford University; Ken Thibodeau, NARA and Gio Wiederhold, Stanford University (Co-Chair) and is held on March 26-27, 1999 in Washington DC. The goal of this workshop is to provide research directions concerning with various aspects of data archival and information preservation. The objective is to converge different aspects to a visionary report for archivists, system developers, organizations, and technologists. Topics to be discussed include: Information Preservation and its Requirements; Information Media and Storage Media; System and Technology; Workflow, Information Preservation and Data Archiving Processes; and Policy and Usability. The material prepared for the workshop, and, at the conclusion, the final report of the workshop will be submitted to NSF and disseminated widely, including at the workshop Web sites at http:\/\/www-db.stanford.edu\/LIC\/preservation.html and<br\/>and http:\/\/cecssrv1.cecs.missouri.edu\/NSFWorkshop.html .","title":"NSF Workshop on Data Archival and Information Preservation to be held March 26-27, 1999 in Washington, DC","awardID":"9820861","effectiveDate":"1999-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["257164"],"PO":["563751"]},"35349":{"abstract":"IIS-9817483<br\/>Seales, William B.<br\/>University of Kentucky Res Fdn<br\/>$499,924 - 36 months<br\/><br\/>The Digital Atheneum: New techniques for restoring, searching, and editing humanities collections<br\/><br\/>This work will develop new digital libraries from aging and damaged<br\/>portions of the Cottonian Collection at the British Library, tailored<br\/>to the requirements of scholars in the humanities.<br\/>The result of this project will be state-of-the-art technical approaches,<br\/>tools that incorporate those new approaches, and a widely distributed digital<br\/>library of restored, previously inaccessible manuscripts.<br\/>In particular, the technical focus will encompass the following important<br\/>research areas:<br\/> o Continued development of new illumination techniques for damaged and<br\/> aging manuscripts using novel lighting methods to make it possible to<br\/> recover markings and information that would otherwise be invisible<br\/> o Creation of a semantic object model and framework for creating digital<br\/> collections that will support domain or data-specific restoration and<br\/> content-based search\/access<br\/> o Incorporation of novel processing techniques for digitally restoring,<br\/> enhancing, and searching\/annotating manuscripts that have suffered damage<br\/> from fire, water, and aging<br\/>The project has strong support from IBM through the Shared University<br\/>Research (SUR). Likewise, partnership with the British Library provides<br\/>priviledged access to high-quality collections, manuscript and curator<br\/>expertise, and digitization facilities.","title":"The Digital Atheneum: New techniques for restoring, searching, and editing humanities collections","awardID":"9817483","effectiveDate":"1999-03-15","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["530999","494196","193991"],"PO":["433760"]},"37968":{"abstract":"9873740<br\/>Sauer<br\/><br\/>This three-year award in support of U.S.-France collaborative research in signal processing involves Kenneth Sauer of the University of Notre Dame and Ali Mohammad-Djatari of the Ecole Superieure d' Electricite. The objective of their research is the development of tomographic measurements and nondestructive techniques for image reconstruction. They will develop algorithms for defect detection and analysis and will focus on two algorithmic and modeling approaches for three-dimensional reconstruction from predominately X-ray data. The project takes advantage of the complementary expertise of the US and French investigators and the different algorithmic and modeling approaches developed by the French investigator. <br\/><br\/>Nondestructive testing can be used to identify and inspect defective objects having faults that are not visible from the exterior. The design of computerized reconstruction algorithms, the principal goal of this project, translates critical information extracted by certain media, into visualizations. These algorithms will be useful in the inspection of infrastructure, transportation systems, manufacturing materials, and archeological and paleontological objects.","title":"U.S.-France Cooperative Research: Tomography in Nondestructive Testing","awardID":"9873740","effectiveDate":"1999-03-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["263577"],"PO":["323582"]},"34349":{"abstract":"Integrated-services networks are expected to carry a class of traffic that has variable bit-rates and requires Quality of Service (QoS) guarantees. One of the main challenges is the provisioning of QoS to users while efficiently sharing network resources through statistical multiplexing. Admission control plays the essential role of limiting the number of flows admitted into the network such that each individual flow obtains the desired QoS. Measurement-based admission control (MBAC) is a practical way of achieving this objective through measuring the current and past variable traffic load in deciding how many flows can be admitted into the network.<br\/><br\/>Many issues have to be understood in the design of robust MBAC schemes. They include:<br\/><br\/>- impact of estimation errors on performance;<br\/>- effect of flow dynamics such as flow arrivals and departures;<br\/>- choice of measurement window size.<br\/><br\/>The goal of the proposed project is to establish a unified framework to study these and other issues in MBAC. We wish to obtain a set of guidelines for designing MBACs that are robust over a wide range of system parameters. Our methodology is to obtain insights from the analysis of a set of basic models, which are in turn validated with simulation experiments on real and synthetic traffic sources.<br\/><br\/>The preliminary investigation on a simple bufferless model yields simple expressions for the relevant performance measures as a function of key parameters such as system size, measurement window size, and<br\/>flow arrival and departure rates. The analysis provides basic insights for answering the questions asked above. One particularly interesting result is the identification of an important parameter ~T_h<br\/>which we call the critical time-scale for the MBAC problem. This parameter quantifies the amount of time a MBAC scheme has to predict into the future to provide good performance, and determine to a large extent the appropriate measurement window size.<br\/><br\/>The research proposes to build on this foundation and extend the framework to study the following issues:<br\/><br\/>- MBAC using aggregate versus individual flow measurements;<br\/>- MBAC for buffered links;<br\/>- impact of long-range dependency, multiple time-scale traffic dynamics, and non-stationarities;<br\/>- MBAC using direct QoS monitoring versus measurements of statistical parameters.","title":"A Framework for Robust Measurement-Based Admission Control","awardID":"9814567","effectiveDate":"1999-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["523728"],"PO":["234222"]},"35648":{"abstract":"9818334<br\/>Dongarra, Jack J.<br\/>Plank, James S.<br\/>University of Tennessee<br\/><br\/>Enabling Technology for High-Performance Heterogeneous Clusters Focusing on Grid Middleware, Fault Tolerance and Sparse Matrix Computations<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Harnessing Cluster Resources for Distributed Scientific Computing,<br\/>- Fast and Portable Checkpointing in Clusters and Clusters-of-Clusters, and<br\/>- Tools for Large-Scale Sparse Matrix Applications on Clusters.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of a 32-node high performance cluster, some switches, workstations, and interface to existing clusters and visualization lab at<br\/>the University of Tennessee. High-performance, low-latency clusters assembled from commodity computers and interconnects are clearly the cost-effective alternative to parallel supercomputers. But the software environment on such clusters is primitive at best; there is an obvious need of tools for application development and cluster management. The three projects in this proposal address this need. Their common goal is the development of enabling technology for advanced scientific computing applications on large-scale clusters and heterogeneous clusters-of-clusters. The proposed instrumentation is for a high-performance networked cluster of workstations. This cluster will be connected to two small clusters (available in the department) to provide a sizable, heterogeneous ``cluster-of-clusters'' with visualization capabilities. This cluster-of-clusters parallel platform will be used for algorithm, software and tool development research in the three projects.","title":"CISE Research Instrumentation: Enabling Technology for High-Performance Heterogeneous Clusters Focusing on Grid Middleware, Fault Tolerance & Sparse Matrix Computations","awardID":"9818334","effectiveDate":"1999-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["558550","450864","550407"],"PO":["301532"]},"40687":{"abstract":"The IDM99 Workshop is supported by the interinstitutional grants IIS-9904998, Alfonso Cardenas, UCLA and IIS-9905026, Edward Fox, Virginia Polytechnic Institute. The workshop is held March 7-9, 1999 at the University of California, Los Angeles. The recent advances in computer and network technologies and storage, the explosion of publishing, and the vast increase in data availability from such sources as satellites, that have enabled the emergence of an unprecedented number of new computer applications, present a new challenge to the ways data and information are used and managed. This challenge will shape both the research agenda as well as the technology to be developed for the 21st century. The objective of the workshop is to bring together the PIs and Co-PIs currently funded by the Information and Data Management Program (IDM) of the National Science Foundation as representatives of two communities, that is, information management (often referred to as information retrieval) and data management (often referred to as database management), along with selected industry and government invitees, to: (1) cooperatively (a) identify the problems that are fundamental in making progress toward this new challenge; (b) specify areas where major breakthroughs appear possible; (c) identify needed collaborations (e.g., inter-disciplinary, academic-industry); and (d) identify research initiatives and facilities needed to meet this and future challenges; (2) share, provide demonstrations and interact with each other on the objectives, contributions and challenges of major research activities funded by the IDM and explore fruitful collaboration and synergism; and (3) provide an opportunity to NSF, other funding agencies, and industry representatives to learn more about the current research efforts and successes of projects funded by IDM, and as well as to share their highlights and concerns. The workshop will generate proceedings, that include reports on all projects currently funded by IDM, which will be widely disseminated in both hard copy and electronic form on the Web. The project reports are searchable by different criteria and provide information relevant to NSF's GPRA Performance Plan Outcome Goals (e.g., connections between discoveries and their use in service to society). Further, the findings of the workshop will be presented in a report that will help in formulating future directions of research in information and data management and will suggest promising modalities of research in academia and industry with an aim to foster innovation as well as technology transfer. The workshop Web site (http:\/\/www.cs.ucla.edu\/csd\/IDM99) will also include links to other relevant material.","title":"1999 NSF Information and Data Management Workshop: Research Agenda for the 21st Century -- IDM 99","awardID":"9905026","effectiveDate":"1999-03-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["550462"],"PO":["563751"]},"39906":{"abstract":"9902428<br\/>Ryder, Barbara G<br\/>Association for Computing Machinery<br\/><br\/>Special Project: Travel Grant for Faculty at Minority\/Female Institutions to attend PLDI '99<br\/><br\/>In an effort to improve the representation of women and minorities in computer science, the organizing committee of the 1999 ACM SIGPLAN Conference on Programming Language Design and Implementation (PLDI) is inviting faculty actively involved with the education of women and minorities to attend the1999 PLDI tutorials and conference. A full day of tutorials is planned for educators. Targeted schools include primarily undergraduate institutions, including historically African American colleges, women's colleges, and other colleges with large minority enrollments. This travel grant will provide partial support for selected individuals from such institutions to attend and participate in the conference and tutorials. By strengthening faculty knowledge of recent research trends and results, the quality of programming languages and compiler courses will be improved at these institutions and, further, its is expected that interest will be generated among individuals from these underrepresented groups such that some of them will consider careers in computer science. For the selected participants, travel and subsistence costs are shared between NSF and ACM SIGPLAN and the organization will also provide the registration fees for the tutorial and conference.","title":"Special Project: Travel Grant for Faculty at Minority\/Female Institutions to Attend PLDI '99","awardID":"9902428","effectiveDate":"1999-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["438877"],"PO":["329035"]},"40678":{"abstract":"The IDM99 Workshop is supported by the interinstitutional grants IIS-9904998, Alfonso Cardenas, UCLA and IIS-9905026, Edward Fox, Virginia Polytechnic Institute. The workshop is held March 7-9, 1999 at the University of California, Los Angeles. The recent advances in computer and network technologies and storage, the explosion of publishing, and the vast increase in data availability from such sources as satellites, that have enabled the emergence of an unprecedented number of new computer applications, present a new challenge to the ways data and information are used and managed. This challenge will shape both the research agenda as well as the technology to be developed for the 21st century. The objective of the workshop is to bring together the PIs and Co-PIs currently funded by the Information and Data Management Program (IDM) of the National Science Foundation as representatives of two communities, that is, information management (often referred to as information retrieval) and data management (often referred to as database management), along with selected industry and government invitees, to: (1) cooperatively (a) identify the problems that are fundamental in making progress toward this new challenge; (b) specify areas where major breakthroughs appear possible; (c) identify needed collaborations (e.g., inter-disciplinary, academic-industry); and (d) identify research initiatives and facilities needed to meet this and future challenges; (2) share, provide demonstrations and interact with each other on the objectives, contributions and challenges of major research activities funded by the IDM and explore fruitful collaboration and synergism; and (3) provide an opportunity to NSF, other funding agencies, and industry representatives to learn more about the current research efforts and successes of projects funded by IDM, and as well as to share their highlights and concerns. The workshop will generate proceedings, that include reports on all projects currently funded by IDM, which will be widely disseminated in both hard copy and electronic form on the Web. The project reports are searchable by different criteria and provide information relevant to NSF's GPRA Performance Plan Outcome Goals (e.g., connections between discoveries and their use in service to society). Further, the findings of the workshop will be presented in a report that will help in formulating future directions of research in information and data management and will suggest promising modalities of research in academia and industry with an aim to foster innovation as well as technology transfer. The workshop Web site (http:\/\/www.cs.ucla.edu\/csd\/IDM99) will also include links to other relevant material.","title":"1999 NSF Information and Data Management Workshop: Research Agenda for the 21st Century -- IDM99","awardID":"9904998","effectiveDate":"1999-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["320635"],"PO":["563751"]},"41459":{"abstract":"This proposal requests support for a workshop to bring together US and Mexican computer and information science researchers and librarians at the University of New Mexico. The goal is to share information and knowledge and develop a template for creating large-scale digital libraries initiatives, and to develop a case study from the template focused on a Mexican Digital Library Project that will enhance current practices in Mexico and link to existing projects in the US and other coutries.","title":"NSF\/ISTEC\/CONACyT Digital Library Workshop","awardID":"9907293","effectiveDate":"1999-03-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["214180","455868"],"PO":["433760"]},"34806":{"abstract":"9815830<br\/>Ide<br\/><br\/>This three-year award for US-France cooperative research in computational linguistics involves Nancy Ide of Vassar College and Laurent Romary, Director of the CNRS Laboratoire LORIA in Nancy. The project is aimed at the development of models and methods for the study of the relationship between discourse structure of text and dialogue reference. The investigation will be extended to a multilingual context and to more complex linguistic annotation. The US investigator brings to this collaboration expertise on linguistic annotation and exploitation. This is complemented by the French group's research on automated reference resolution in the context of man-machine dialogue. The project takes advantage of opportunities to test the models and methods in at least two different languages.","title":"U.S.-France Cooperative Research: Discourse Annotation and Analysis","awardID":"9815830","effectiveDate":"1999-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["501442"],"PO":["323582"]}}