{"70757":{"abstract":"Rapidly increasing performance requirements of applications have spurred the next generation of complex, dynamic, heterogeneous, parallel\/distributed computing system architectures. The emerging computational grid, tightly-coupled petaflop grids-in-a-box (GiBs), distributed sensor networks, System-on-Chip (SoC) and polymorphous computing (PCA) architectures are examples of such systems. To exploit the full potential of this new computing architecture, applications, as they execute, must be able to adapt to the continuously changing system. <br\/>Although some support for adaptive application development is available in the form of programming languages and runtime systems, there is a lack of high level system abstractions that model the dynamic behavior and runtime adaptivity.<br\/>The proposed research will address fundamental issues in modeling these dynamic, complex architectures and the design and evaluation of adaptive algorithms for such architectures. The focus of the proposed research will be on creating a formal framework to reason about adaptivity at an abstract level.<br\/>A direct educational impact of the proposed activity will be the introduction of new curriculum in academia, to impart knowledge on algorithm design aspects for dynamic system architectures. This will include initiating new course-work along with traditional courses offered on analysis of algorithms and architectures. One of the broader impacts we foresee is the preparation of future Grid\/GiBs\/SoC\/PCA application developers.","title":"NGS: A Model-Based Framework for Adaptive Algorithm Design","awardID":"0204046","effectiveDate":"2002-11-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["563658","309263"],"PO":["301532"]},"80946":{"abstract":"EIA 0301844<br\/> Sears, Jay A<br\/>Corporation of National Research Initiatives (NRI)<br\/><br\/>SGER: KDD Research and Evaluation<br\/><br\/>This proposal will coordinate Knowledge Discovery and Dissemination research efforts to support overall program goals. Special emphasis will be given to the coordination of data collection and distribution, plus challenge problem process design. The proposal will explore data, tasks, and evaluation strategies to integrate many different projects funded under the KDD interagency effort. A complex task will be designed that will both focus individual research efforts and help to integrate the variety of efforts being funded. Additionally, attention will be devoted to the design of an unclassified testbed capability that would include data, integration, and evaluation processes.","title":"SGER: Knowledge, Discovery and Dissemination (KDD) Research and Evaluation","awardID":"0301844","effectiveDate":"2002-11-15","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V283","name":"CIA-HUMAN LANGUAGE & COMM PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V068","name":"CIA-KDD & TARGET CHARACHTERIZA"}}],"PIcoPI":[210755],"PO":["565215"]},"79683":{"abstract":"Provenance and data derivation are important to many aspects of scientific computation. In <br\/>molecular biology, where data is repeatedly copied, corrected, and transformed as it passes <br\/>through numerous genomic databases, understanding where data has come from and how it <br\/>arrived in the user's database is of crucial to the trust a scientist will put in that data, yet this <br\/>information is seldom captured properly. In astronomy, useful results may have been been <br\/>obtained by filtering, transforming, and analyzing some base data by a complex assemblage of <br\/>programs, yet we lack good tools for recording how these programs were connected and the <br\/>context in which they were run. <br\/>The intellectual merit of the proposed activity lies in the new insights that it will bring to the <br\/>important topics of data provenance and data derivation. <br\/>The broader impacts resulting from the proposed activity relate primarily to the establishment of <br\/>new ties between distinct disciplines that have strong interests in data derivation and provenance <br\/>but have not, historically, talked to each other. These new ties will tend to accelerate both <br\/>research and education in the participating disciplines.","title":"Workshop on Data Derivation and Provenance - Chicago IL","awardID":"0243349","effectiveDate":"2002-11-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["554547"],"PO":["551992"]},"79169":{"abstract":"This proposal is in request of $25,000 for travel grants for graduate students and young faculty for the 35th International Symposium on Microarchitecture (MICRO). MICRO is the premiere conference in this very vibrant and topical area. This year the conference will be held in Istanbul, Turkey from November 18th-21st.","title":"Travel Grants for Graduate Students and Young Faculty for the International Symposium on Microarchitecture","awardID":"0241217","effectiveDate":"2002-11-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["322427"],"PO":["248088"]},"76464":{"abstract":"0228966<br\/>Niebur<br\/>This symposium is designed to explore the function of biological tissues as modulators of mechanical stimuli applied to cells and as transducers of mechanical forces. A wide variety of lectures will be presented, ranging from tissue formation and remodeling, to methodologies for probing the mechanical properties of tissues and cells. Speakers with expertise in a wide range of biological systems will develop a broad understanding of mechanobiological processes. By promoting discussion and presenting current research, the proceedings will advance our current understanding of mechanobiology and foster new research by exposing gaps in current knowledge.<br\/><br\/>The meeting will bring together acknowledged experts in the field of tissue mechanics to provide training, insight, and advice to those interested in becoming involved in this field of research. It will also provide a forum for discussion and debate of the current state of knowledge of mechanics and mechanobiology for different tissues. Tutorial lectures on bone, cardiovascular, and cartilage remodeling will provide attendees with a view of the current state of the art in each of these fields, and emphasize important areas of future research. The meeting is to promote interaction between engineers, physicists, mathematicians, biologists, and chemists with interests in biomechanics and mechanobiology. Also, it provides a forum for junior faculty and graduate students to interact with a wide range of experts in the field of tissue mechanics and mechanobiology.<br\/><br\/>Proceedings of the conference will be compiled and disseminated to all participants, and will be made available electronically over the world-wide-web.","title":"Symposium: The Role of Tissue Mechanics in Biological Responses to Mechanical Loading, Notre Dame, Indiana","awardID":"0228966","effectiveDate":"2002-11-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["528829","477405"],"PO":["317420"]},"80282":{"abstract":"EIA-0245231<br\/>Michael Keller<br\/>Stanford University<br\/><br\/>Digital Government: SGER: LOCKSS Government Documents<br\/><br\/>This proposal will explore the usefulness and appropriateness of a distributed peer to peer network-based storage and archiving technology for the long-term (decades) maintenance of Federal records. Using a system known as LOCKSS, the PI will collaborate with the Government Printing Office and its group of 55 Federal Depository LIbraries. The hope is to provide new options to the current model of a central archieve with off-site backups.","title":"SGER: Lots of Copies Keep Stuff Safe (LOCKSS) Government Documents","awardID":"0245231","effectiveDate":"2002-11-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["563142"],"PO":["371077"]},"81151":{"abstract":"ABSTRACT<br\/>0302706<br\/>Simon Haykin<br\/>McMaster University <br\/><br\/>Much of the signal-processing literature in the 20th Century focused on certain simplifying assumptions: Stationarity, Gaussianity, and linearity. The primary motivation for these assumptions is mathematical tractability. However, with the ever-increasing power and availability of computers, mathematical tractability is no longer the compelling issue that it used to be. Indeed, with powerful computers at hand, we can expand on the horizons of statistical signal processing to account for practical realities of nearly all physical phenomena encountered in practice, namely, nonstationarity, unknown statistics (typically nonGaussian), and nonlinearity. This expansion is one of the major goals of the 2003 Workshop on \"New Directions in Signal Processing for the 21st Century\".<br\/><br\/>Another major goal of this unique Workshop is to bring two scientific communities closer together:<br\/><br\/>The signal processing community, which is still dominated by classical approaches to the solution of real-life problems; and, <br\/><br\/>The neural computation community, which distinguishes itself by being motivated by the computing power of the human brain but lacks the attention that signal processing problems duly deserve.<br\/><br\/>With these two goals in mind, and by focusing on a carefully selected set of topics, the Workshop is assured of making a significant difference.","title":"Workshop on New Directions for Signal Processing in the 21st Century","awardID":"0302706","effectiveDate":"2002-11-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[211323],"PO":["564898"]},"75632":{"abstract":"EIA 02-24441<br\/>Beck, Micah D.<br\/>Dongarra, Jack J.; Livny, Miron; Plank, James S.; Wolski, Richard<br\/>University of Tennessee - Knoxville <br\/><br\/>CISE RR: A National Logistical Networking Testbed <br\/><br\/>This project, investigating a distributed network storage architecture based on the Internet Backplane Protocol (IBP) and the external node (exNode) data structure, explores an approach to communication infrastructure, called Logistical Networking. This approach applies the Internet model of community resource sharing to network storage to infuse the network itself with storage resources that can be shared, scaled up, and exposed for external scheduling just like IP datagram delivery. A resource fabric that unifies the co-management of scheduling of data transport and data storage results, creating conditions for interoperable state management among distributed applications. The resources of the National Logistical Networking Testbed (NLNT) proposed attract the kind of diverse and heavy usage necessary to carry out critical research and testing on this technology under real world conditions. NLNT, an experimental communication fabric, places large \"depots\" of sharable storage on the nation's high performance network for the unbrokered use of the research community. These depots support the exploration and testing of Logistical Networking technology under meaningful loads by diverse middleware and application research groups. Its leading characteristics follow. NLNT<br\/>1. Storage: scalably sharable. To help maximize the share use of time-limited lightweight allocations of network storage resources, NLNT uses a network storage technology, Internet Backplane Protocol (IBP). IBP closely models IP datagram service and follows Internet design principles for scalable sharing to create shared storage service that can scale globally.<br\/>2. Target capacity: 1 Petabyte. Planned project funding and contributions from industrial partners support NLNT capacity of 100TB in year three. As the technology shows value, capacity grows.<br\/>3. Deployment: aims for ubiquity. To provide high performance access and support heavy use, NLNT locates massive \"depots\" at two major Gigapops with direct access to the national backbone. High value of well-provisioned local depots encourages ubiquitous provisioning of storage.<br\/>The growth of the fully realized NLNT will be seeded by three storage depots: an advanced 11.68TB Storage Area Network system donated by Yotta Yotta; a special purpose 16GB RAM-only storage depot to be used for middleware research on high performance overlay networks; and a third storage cluster planned as a 88TB system attached to the network via a fast, non-blocking switch. The units will be placed at Gigapops in Chicago (Starlight) and near Washington D.C. (MAX). NLNT software foundation, IBP, has already been implemented and tested. Basic software components (xNode toolset for aggregating distributed storage allocations, the Network Weather Service (NWS) for monitoring and forecasting the performance of distributed resources, and the Logistical Backbone (L-Bone) for NLNT resource discovery) support NLNT middleware research, including scheduling with dynamic network topology, tools and methodologies to provide runtime support for key storage functions (e.g., replication, caching, etc.), and high performance overlay network technology. The research involves collaborators from the Universities of California-Santa Barbara (Wolski) and Wisconsin-Madison (Livny).","title":"CISE Research Resources: A National Logistical Networking Testbed","awardID":"0224441","effectiveDate":"2002-11-15","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["558550","560467","530745","450864","402357"],"PO":["557609"]},"75611":{"abstract":"EIA-0224363<br\/>Nikolaos Papanikolopoulos<br\/>Daniel L. Boley; William K. Durfeet; Maria L. Gini; Bradley J. Nelson<br\/>University of Minnesota-Twin Cities<br\/><br\/>CISE RR (Collaborative): Teams of Miniature Mobile Robots<br\/><br\/>This project, redesigning and manufacturing a team of Scout-Ranger robots, improvises on the current scout design through novel design schemes, software development, sensory fabrication, and processing sensory data in real time. The research extends work based on a previous generation of Scouts. The institution developed a heterogeneous robotic team emphasizing the \"Scout\" robot, launched and controlled by a larger platform, the \"Ranger.\" After deployment, Scouts have a unique combination of mobility modes including rolling and hopping, multiple sensing capabilities for navigation (e.g., cameras, microphones), full communications for data and instructions (controlled by cellular phones), and onboard computational resources. Their functionality is increased by actuated wheels and miniature grappling hooks and can serve applications such as reconnaissance, earthquake rescue operations, homeland security space exploration, fire rescue missions, hostage release operations, etc. Their design requires a compromise in power, sensor types, locomotion, and size. However, rather than concentrating on size, this work focuses primarily on communications, sensor fabrication, and sensor placement. Solutions to research problems are sought in areas of miniature-robot design, communication for distributed robotics (especially in low-bandwidth situations), and resource allocation for distributed robotics. Specifically:<br\/>1. Designs of miniature robots: modifying original scout design, giving special care to image-processing<br\/>2. Software support for Robot Teams: sharing resources leading to decision making and planning<br\/>3. Tradeoffs between sharing communication channels and performance in motion detection<br\/>4. Sensor fabrication in the micro fabrication lab<br\/>5. Analysis of sensory data (images) of the team of robots; seeking optical positioning of the sensor to maximize coverage\/redundancy<br\/>6. Analysis of traffic patterns (of humans) in a building<br\/>7. Detection of anomalies on those patterns, or detection of unusual situations (i.e. smoke): using method of Principal Direction Divisive Partitioning<br\/>8. Innovative uses of Scouts: tele-rehabilitation, dynamic hopping devices, etc.<br\/>The educational plan includes the incorporation and mentoring of women and minority students. The robots will be used not only in Computer Vision and Robotics classes, also, in Algorithms, Data Structures, Operating Systems, and Artificial Intelligence. Outreach activities, proposed for K-12, along with public outreach complement the research agendas.","title":"CISE Research Resources: Teams of Miniature Mobile Robots","awardID":"0224363","effectiveDate":"2002-11-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["550553",196704,"561562","223048","557449"],"PO":["335186"]},"75633":{"abstract":"EIA 02-24442<br\/>Fortes, Jose A.<br\/>Figueiredo, Renato; George, Alan D.; Principe, Jose C.; Su, Stanley Y.<br\/>University of Florida <br\/><br\/>CISE RR: Collaborative Research on Wide-Area Network Computing Using Virtual Machines<br\/><br\/>This collaborative research project (with Dinda at Northwestern University, proposal 02-24449), requiring a wide-area test bed that enables experimentation with, access to, and running of applications on unique resources, requests PC clusters, an IBM server, and other ancillary hardware for projects in<br\/>1. Distributed grid computing and information processing systems using virtualization technologies and<br\/>2. Information grids with real users and research applications requiring capabilities enabled by virtual machines (VMs).<br\/>Deploying a distributed system based on clusters connected by local, metropolitan, and wide area networks, the work aims to provide a virtual computing and data storage interface to clients that access resources on the underlying \"information grid.\" The test bed includes the following defining features.<br\/>1. Virtualization capabilities, i.e., the ability to instantiate independent logical machines that can be multiplexed on physical processors (or fractions of them), storage and network I\/O channels, and can use distinct operating systems;<br\/>2. Wide-area distribution, i.e., Internet-linked test bed components in independently-administered geographically-apart network domains;<br\/>3. Scalable capacity for both scientific computing and information processing; and<br\/>4. Heterogeneity.<br\/>Interrelated projects enabled by the test bed towards the goal of developing VM-based middleware for grid computing include virtualized end resources, monitoring and prediction, interactive computing, virtual file systems, data management, cycle selling, and security. Information grids and web portals for use of CAD tools are also enabled by the infrastructure for dissemination of collaborative research results and data, and for digital government services. From the availability of the portals and grid-computing resources benefits are expected in brain-machine interfaces, biologically-inspired nanocomputing, auction-based computing, distributed knowledge applications, medical imaging and data archiving, light-scattering spectroscopy, and mixed non-linear optimization. Collaborations include the Sigmicro microarchitecture center, NETCARE and the Purdue-hosted Nanohub (enabling users to run tools for computer architecture and parallel computing, and nanoelectrnics). The project impacts some minority serving institutions such as Chicago State and Florida A& M Universities and enables a testbed for a transnational digital government projects involving Carnegie Mellon University, University of Belize, University of Colorado, University of Florida, University of Massachusetts, and Pontificia Universidad Catolica Madre y Maestra of the Dominican Republic.","title":"CISE RR: Collaborative Research on Wide-Area Network Computing Using Virtual Machines","awardID":"0224442","effectiveDate":"2002-11-15","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["540130","438490","289580","523144","558495"],"PO":["557609"]},"75635":{"abstract":"EIA 02-24449<br\/>Dinda, Peter A.<br\/>Banerjee, Prithviraj; Kao, Ming-Yang<br\/>Northwestern University<br\/><br\/>CISE RR: Collaborative Research on Wide-Area Network Computing Using Virtual Machines<br\/>This collaborative research project (with Fortes at University of Florida, proposal 02-24442), requiring a wide-area test bed that enables experimentation with, access to, and running of applications on unique resources, requests PC clusters, an IBM server, and other ancillary hardware for projects in<br\/>1. Distributed grid computing and information processing systems using virtualization technologies and<br\/>2. Information grids with real users and research applications requiring capabilities enabled by virtual machines (VMs).<br\/>Deploying a distributed system based on clusters connected by local, metropolitan, and wide area networks, the work aims to provide a virtual computing and data storage interface to clients that access resources on the underlying \"information grid.\" The test bed includes the following defining features.<br\/>1. Virtualization capabilities, i.e., the ability to instantiate independent logical machines that can be multiplexed on physical processors (or fractions of them), storage and network I\/O channels, and can use distinct operating systems;<br\/>2. Wide-area distribution, i.e., Internet-linked test bed components in independently-administered geographically-apart network domains;<br\/>3. Scalable capacity for both scientific computing and information processing; and<br\/>4. Heterogeneity.<br\/>Interrelated projects enabled by the test bed towards the goal of developing VM-based middleware for grid computing include virtualized end resources, monitoring and prediction, interactive computing, virtual file systems, data management, cycle selling, and security. Information grids and web portals for use of CAD tools are also enabled by the infrastructure for dissemination of collaborative research results and data, and for digital government services. From the availability of the portals and grid-computing resources benefits are expected in brain-machine interfaces, biologically-inspired nanocomputing, auction-based computing, distributed knowledge applications, medical imaging and data archiving, light-scattering spectroscopy, and mixed non-linear optimization. Collaborations include the Sigmicro microarchitecture center, NETCARE and the Purdue-hosted Nanohub (enabling users to run tools for computer architecture and parallel computing, and nanoelectrnics). The project impacts some minority serving institutions such as Chicago State and Florida A& M Universities and enables a testbed for a transnational digital government projects involving Carnegie Mellon University, University of Belize, University of Colorado, University of Florida, University of Massachusetts, and Pontificia Universidad Catolica Madre y Maestra of the Dominican Republic.","title":"CISE RR: Collaborative Research on Wide-area Network Computing using Virtual Machines","awardID":"0224449","effectiveDate":"2002-11-15","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["517969","540138","295247"],"PO":["557609"]},"74436":{"abstract":"EIA 0218767 Jerome Pine California Institute of Technology Title: A Neurochip for Studying Neural Networks in Vitro<br\/> The mammalian central nervous system has enormous capabilities for information processing; analysis; and generation of appropriate outputs for a huge variety of task. It far surpasses current best efforts with man-made hardware and software. Learning in detail about how real neural networks function holds the promise of guiding efforts to improve man-made systems, and perhaps showing the way to revolutionary rather than evolutionary improvements. Yet doing this is a daunting task for in vivo systems, where huge numbers of neurons operate cooperatively, and observation of their individual behaviors in full detail is far beyond the capabilities of current technology. Understanding the behavior of small neural networks in vitro is a potentially valuable start, and it is proposed here to create a silicon-based system, called a \"Neurochip\", with unique capabilities for observing the behavior of every neuron of a small network in detail. Each neuron will be in an enclosure\" which incorporates an intracellular electrode for recording and stimulation.<br\/><br\/>The experimental system is being constructed mainly from commercial components. The neurochip itself is being fabricated using novel methods, but ones, which can be duplicated, in any serious fabrication laboratory. The low temperature fabrication process for the neurochip can be done on a silicon wafer, which incorporates CMOS circuitry, so an on-board computer could be made part of the system.","title":"BITS: A Neurochip for Studying Neural Networks In Vitro","awardID":"0218676","effectiveDate":"2002-11-15","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["201423","563344"],"PO":["565223"]},"70741":{"abstract":"Title: Optimizing Performance and Reliability in Distributed Computing Systems Through Wide Spectrum Storage Services<br\/><br\/>Logistical Networking promotes an innovative model of network storage that views data transmission and storage as part of a unified framework, just as military or industrial logistics view transportation lines and storage depots as coordinate elements of a single infrastructure. Under the Logistical Computing and Internetworking (LoCI) project, we have created and implemented a primitive abstraction of network storage, called the Internet Backplane Protocol (IBP) [43], as the lowest network layer in a \"storage stack\" for Logistical Networking. <br\/><br\/>The goal of the proposed research is to test this hypothesis by creating a Logistical Runtime System (LoRS) designed to support advanced applications on a well-provisioned network of IBP-based storage, and then exploring its value and performance along several dimensions using real-world Grid applications.","title":"NGS: Optimizing Performance and Reliability in Distributed Computing Systems Through Wide Spectrum Storage Services","awardID":"0204007","effectiveDate":"2002-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["558550","530745","450864","402357","397101"],"PO":["301532"]},"78904":{"abstract":"This award will provide travel support for approximately twelve graduate students, post-docs and junior faculty members in the U.S. to attend the IEEE Infocom 2003 Conference being held in San Francisco, CA from March 30 to April 3, 2003.The travel award will target graduate students, since attending conferences is an important part of their educational experience, and they often have limited funds. Infocom is a preeminent international conference in computer communications, covering a wide sprectrum of theoretical and applied research in networking.","title":"Travel Support for IEEE INFOCOM 2003 Conference; San Francisco, CA; March 30 through April 3, 2003","awardID":"0239899","effectiveDate":"2002-11-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[205477],"PO":["250082"]},"75605":{"abstract":"EIA 02-24306<br\/>DeFanti, Thomas A.<br\/>Grossman, Robert L.; Leigh, Jason; Nelson, Peter C.; Yu, Oliver<br\/>University of Illinois Chicago <br\/><br\/>CISE RR: Matching Advanced Visualization and Intelligent Data Mining to High-Performance Experimental Networks <br\/><br\/>This project, developing techniques for advanced grid computing with focus on visualization and data-mining applications, aims at setting up a high-performance, high-bandwidth Grid matched with Visualization and Data Mining Research. The Grid is made up of Lambdas (clusters of PCs) that are connected by high-bandwidths connections to other clusters. Software and toolkits to enable high-performance applications will be built with the goal of attaining a high-speed optical metropolitan-area network to be used in the data mining and visualization applications. The project expands grid technology to infrastructure, protocols, network memory and distributed control, and applications in constraint logic programming. Since optical networking technology is rapidly migrating from ultra-expensive long-haul carrier implementations to affordable regional- and metro-area community networks, this project explores inherent flexibilities in these new technologies to support large-scale data, visualization, and collaboration-intensive applications with very advanced real-time demands. Thus, application-aware software and middleware will be created to help interconnect tomorrow's terascale-class machines with distributed petabyte data stores, remote sensors, instrumentation and visualization over gigabit\/sec to terabit\/sec networks. LambdaNodes, defined as PC clusters with storage and visualization coupled to like clusters by numerous wavelengths (called lambdas), will be used connected by lambda networks to create a prototype metropolitan-scale LambdaGrid. With the goal of optimally matching data mining and visualization to high-performance optical networks with e-Science and homeland security model applications as expected drivers (achieving a 10x or greater end-to-end improvement over today), the equipment and support enables the following:<br\/>1. Matching data-mining and visualization capabilities on clusters to emerging wavelength-rich networks,<br\/>2. Distributing parallel computation and rendering for high-resolution volume visualization,<br\/>3. Providing applications signaling and control of both electronically and optically switched lambdas,<br\/>4. Measuring and monitoring multi-gigabit circuits over multiple wavelengths,<br\/>5. Providing users with networks that have known and knowable bandwidth and latency,<br\/>6. Investigating high-availability\/uninterrupted cluster computing to support time-critical collaborations,<br\/>7. Addressing real-time applications in security domain, and, eventually, security of the data as well,<br\/>8. Integrating metropolitan-scale LambdaGrids with the emerging Global Grid and the National TeraGrid, and<br\/>9. Incorporating distributed data mining and visualization into undergraduate African-American-centered coursework and research through the Virtual Harlem Project.","title":"CISE Research Resources: Matching Advanced Visualization and Intelligent Data Mining to High-Performance Experimental Networks","awardID":"0224306","effectiveDate":"2002-11-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["557607","533353","472589","558518","416010"],"PO":["557609"]},"70754":{"abstract":"EIA-0204040 Mary Hall University of Southern California Resource-Aware Off-line and On-line Empirical Optimization <br\/><br\/>The research we propose herein explores a new paradigm that fundamentally restructures the compilation process to enable resource-aware optimization. We will demonstrate how this system can alleviate some of the problems that lead to inefficiencies in big science and engineering codes today: register pressure, cache conflict misses, the trade-off between synchronization, parallelism and locality in SMPs, and process migration in computational grids. There are three essential components of this research program:<br\/><br\/> Compiler-directed off-line empirical optimization;<br\/> Dynamic feedback, for user-and compiler-directed on-line optimization; and<br\/> Experience base to guide optimization from history: The results of experiments from both off-line and on-line empirical optimization will be maintained in an experience base, which can be used to generalize prior optimization results and plan a future optimization strategy.","title":"NGS: Resource-Aware Off-line and On-line Empirical Optimization","awardID":"0204040","effectiveDate":"2002-11-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["542054",183165,"535236"],"PO":["301532"]},"82536":{"abstract":"Mobile ad hoc networks are multi-hop wireless networks, with dynamically changing network<br\/>topology. Evaluating network capacity is a hard problem in such networks because of the shared<br\/>nature of the radio medium and possibility of spatial reuse. The latter is again influenced by routes<br\/>used and node mobility. On the other hand, understanding the network capacity in terms of available bandwidth is crucial to design effective routing protocols. The resarchers propose empirical techniques to evaluate the network capacity. The techniques work in conjunction with a simulator and use mobility and session-level traces to compute capacity that can be compared against the network utilization reported by the simulator. Preliminary experiments indicate interesting results that more capacity is available with higher mobility; however common routing protocols fail to utilize the additional capacity for better routing performance. Preliminary analysis indicates that spatial diversity is not exploited enough by conventional protocols, indicating that multipath routing protocols and distributing traffic over multiple paths would be quite effective.<br\/> While investigating better techniques to evaluate capacity will be one component of the researchers work, they will also expend substantial effort in developing multipath protocols and techniques to achieve better load balance. For efficiency they will focus on protocols with an on-demand nature. The researchers indicate in this proposal how multiple, link- or node-disjoint, loop-free routes can be computed on demand without the use of source routing, with minimal additional overhead. The researchers will further development and analysis of such protocols. The emphasis will be on obtaining as many multipath<br\/>routes as possible. Our preliminary results already indicate that such routing mechanisms<br\/>reduce route discovery attempts, thus improving both delay and throughput. We will also focus on<br\/>evaluating techniques to distribute load on multiple routes effectively for a fuller utilization of the<br\/>available capacity.<br\/> However, we point out that the dense nature of most ad hoc networks will form multiple routes<br\/>in radio vicinity. In that case, topologically disjoint routes may still share radio medium. To<br\/>achieve diversity further, we propose using multiple channels in the underlying medium access<br\/>control (MAC) layer so that independent channels can be assigned to neighboring routes. While<br\/>individual channels may now have less capacity, some preliminary results indicate that significant<br\/>performance gains are possible if the transmitter is capable of transmitting on multiple channels<br\/>concurrently. The researchers wish to explore, among other things, channel selection issues for individual links and paths when multipath routes are available.<br\/> To summarize, the overall goal in this project is to better our understanding of the capacity of<br\/>a mobile ad hoc network operating with real network protocols; and to exploit spatial and channel<br\/>diversity significantly with a synergistic use of multipath routing and multichannelMAC protocols.","title":"Exploiting Spatial and Channel Diversity in Ad Hoc Networks","awardID":"0308631","effectiveDate":"2002-11-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["563568"],"PO":["7594"]}}