{"126269":{"abstract":"This is funding to support this year's HCI doctoral research consortium (workshop) of approximately 15 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2007 Conference on Human Factors in Computing Systems (CHI 2007), which will be held April 28-May 3 in San Jose, and sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI). Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on April 28-29, with follow up activities planned during the technical program of the CHI 2007 conference. Extended abstracts of the students' work will be published in the CHI 2007 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia, which began in 1986, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impact: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Human-Computer Interaction Doctoral Research Consortium at ACM CHI 2007: Human Factors in Computing Systems","awardID":"0707398","effectiveDate":"2006-12-15","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["563439"],"PO":["565227"]},"123773":{"abstract":"This travel grant supports stipends and travel assistance for the 28th IEEE International Conference on Distributed Computing Systems (ICDCS) to be held in China in 2008. ICDCS is a flagship conference in distributed computing, sponsored by the Institute for Electrical and Electronics Engineers (IEEE). The funds will be used to support support keynote speakers, conference organizers, faculty and graduate students to attend the conference and present papers. The conference location and the costs involved to travel to the chosen location will be seen as an impediment to the communities participation. This grant will well serve to offset the larger than ordinary expenses to attend the conference. The conference finance chair is being awarded the funding.","title":"2008 International Conference on Distributed Computing Systems (ICDCS) Travel Support","awardID":"0649997","effectiveDate":"2006-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["523431"],"PO":["561889"]},"122453":{"abstract":"Spontaneous speech, accented speech, and speech in noise continue to<br\/><br\/>provide automatic speech recognition (ASR) technology with significant<br\/><br\/>challenges; error rates of ASR systems are still unacceptably high for<br\/><br\/>these types of speech. This project establishes a consistent<br\/><br\/>framework that seeks to cope with all of these conditions. The novel<br\/><br\/>approach to phonetic variability investigated here views the problem<br\/><br\/>as one of phonetic information underspecification: some subset of<br\/><br\/>information that the listener receives will be missing or uncertain.<br\/><br\/>Lexical access is thus a phonetic code-breaking problem --- how can a<br\/><br\/>system accumulate phonetic cues in each of these conditions to<br\/><br\/>recognize words on the basis of incomplete evidence?<br\/><br\/><br\/><br\/>The research program of this project takes a multidisciplinary<br\/><br\/>approach to integrating linguistic theory with speech recognition<br\/><br\/>technology; discriminative statistical models of linguistic features<br\/><br\/>are employed to model nonlinear, overlapping phonological effects<br\/><br\/>observed in speech. The framework allows derivation of new linguistic<br\/><br\/>insights through analysis of trained systems.<br\/><br\/><br\/><br\/>The educational program fosters interdisciplinary research (with<br\/><br\/>cross-disciplinary graduate seminars) and increases participation of<br\/><br\/>underrepresented students in Computer Science by introducing language<br\/><br\/>technology topics early into the undergraduate curriculum and<br\/><br\/>encouraging undergraduate research.<br\/><br\/><br\/><br\/>Apart from cultivating a new way of thinking about pronunciation<br\/><br\/>variation for ASR, the broader impacts of this research are to provide<br\/><br\/>collaborative resources for the ASR and linguistics communities to<br\/><br\/>discuss in tutorial and workshop settings. Addressing noise, accent,<br\/><br\/>and speaking style in a consistent framework will also improve ASR<br\/><br\/>technology for many who are underserved by current systems.","title":"CAREER: Breaking the phonetic code: novel acoustic-lexical modeling techniques for robust automatic speech recognition","awardID":"0643901","effectiveDate":"2006-12-15","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["543555"],"PO":["565215"]},"118911":{"abstract":"This is a project to understand and test theories of how three aspects of human-robot interaction independently and interactively affect collaborative work: robot social behavior, mutual understanding in human-robot communication, and the impact of robotic assistants on group dynamics. With advances in computing technology and artificial intelligence, autonomous robots are becoming viable in such critical domains as search and rescue, military battle, mine and bomb detection, scientific exploration, law enforcement, and hospital care. Robotic assistants ranging from museum guides to forestry scouts are being developed to interact with people \"in person\" or remotely, as agents that collaborate with the work team. This project is targeted at little understood but critical aspects of robot-supported collaborative work. <br\/><br\/>The research involves three kinds of studies: (1) fundamental laboratory research on behavioral characteristics of robots performing social tasks, especially as these characteristics reflect lifelikeness, (2) controlled experiments and field studies of interpersonal communication and the development of mutual understanding between robot and human, and (3) studies of robots in work groups. The studies are designed to motivate and test theory, as well as to explore both direct and secondary or indirect social effects of robot-supported collaborative work. The fieldwork will be carried out in hospitals and scientific exploration settings. <br\/><br\/>This research will advance our understanding of the possibilities and problems of mutual adaptation in human-robot interaction over time, and will help us anticipate changes in the group dynamics of collaborative work. It also will extend our basic knowledge of communication and group dynamics in environments that incorporate robotic technology. It will improve our ability to make principled design decisions about robots that work with people, and better understand the societal impact of robots. In particular, this research will give us a foundation for understanding and designing collaborative work with robots in critical environments like mines, hospitals, households with elderly or disabled residents, in challenging scientific settings, and in situations in which the robot is remote. The work also will contribute to public and student awareness of the human side of robotics, and help motivate students' interests in science and engineering.","title":"Collaborative Research: DHB: Human Dynamics of Robot-Supported Collaborative Work","awardID":"0624275","effectiveDate":"2006-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7326","name":"HSD - GENERAL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550147","438709","519226","526576"],"PO":["564456"]},"120772":{"abstract":"Signal processing is the enabler and driving force (\"brain in the box\") behind many everyday technologies including audio\/image\/video processing (MP3, JPEG, MPEG), communications (cell phones), medical and bioimaging (MRI, fMRI, CAT\/PET scan, high-throughput drug screening), sensor networks (cars, surveillance), security (biometrics for financial industry and securing US borders). As a discipline, signal processing makes heavy use of deep mathematics including complex calculus, linear algebra, stochastics and approximation theory. In fact, many of the above advances were made possible by importing and using novel techniques from mathematics. This research connects signal processing to abstract algebra (a major discipline in mathematics) at a fundamental level. In doing so, a whole new set of mathematical tools becomes available to signal processing. In preliminary work, these tools have already produced novel and<br\/>efficient processing techniques. The investigators will develop many more and aim to tackle problems that have eluded solution with previous methods.<br\/><br\/>The platform for the research is a novel approach to signal processing, called algebraic signal processing theory (ASP), which will be further developed in this work. ASP generalizes the standard linear signal processing to provide novel notions of filtering, Fourier transforms, and others. ASP captures many existing signal processing methods into one common framework and enables the derivation of new ones in one and higher dimensions, separable and nonseparable, shift-invariant and shift-variant. A major goal in this research is to expand ASP to include general notions of filter banks and ultiresolution methods for important applications. At a fundamental level, ASP may provide a more rigorous, axiomatic approach to signal processing and thus impact education. A first course based on ASP will be developed in this project.","title":"Algebraic Signal Processing Theory: Towards Multiresolution Analysis","awardID":"0634967","effectiveDate":"2006-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["493223","332185"],"PO":["564898"]},"126932":{"abstract":"New Jersey Institute of Technology has received a CISE Special Projects award to convene a workshop in the Mid-Atlantic region of the United States on the transformation of undergraduate computing education. The purpose of this workshop is to provide a forum to catalzye the transformation of undergraduate computing education and to disseminate information about new NSF initiatives, such as CISE Pathways to Revitalized Undergraduate Computing Education (CPATH). Such a transformation is critical to the information technology (IT) workforce preparation and the continued preeminence of the U. S. in technology innovation. <br\/><br\/>The intellectual merit of this project lies in the synergies that will follow from bringing together thoughtful individuals with wide-ranging expertise in the area of undergraduate computing education. <br\/><br\/>The broader impact lies in the potential impact on computing education and thus a broad range of students across the United States. The number of students majoring in computing disciplines has declined in recent years even though employment demands for graduates in these disciplines continues to climb. Significantly, the number of women and minority students who consider the possibility of majoring in computing has fallen even more dramatically, further restricting the pool of available talent. Identifying innovative strategies to add and attach a broad range of students in computing disciplines will have enormous impact not only in terms of strengthening the nation's economy but also in preserving equality of opportunity.","title":"Mid-Atlantic Workshop on Revitalizing Undergraduate Computing Education","awardID":"0710745","effectiveDate":"2006-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["528628",336811],"PO":["564181"]},"123599":{"abstract":"This project renews an exemplary former CISE Research Experience for Undergraduates site focused on the areas of information processing and decision making for intelligent and secure environments. A regional recruitment process is used to select cohorts of undergraduate students to participate in a summer research program at the host institution. Particular emphasis is placed on recruitment of students from under-represented populations and students from institutions lacking strong research programs and opportunities. The project includes mentoring by the experienced faculty members, technical seminars and workshops, student presentations, and field trips and other professional development opportunities. The project refines the recruitment, selection, and performance evaluation processes developed in the previous REU site project at the institution.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in current research areas that are of interest to the community at large and that have clear practical applications. The students participate in a full range of research activities from preparing research literature to production and dissemination of research results.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups and community college students. The participating faculty members are committed to under-represented minority students in their research. The institution has an outstanding record of supporting undergraduate research with many of the undergraduates selecting to go on to graduate school as a result of the experience. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Sites: Research Experiences for Undergraduates in Information Processing and Decision Making for Intelligent and Secure Environments","awardID":"0649229","effectiveDate":"2006-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505936","559680"],"PO":["564181"]},"118913":{"abstract":"This is a project to understand and test theories of how three aspects of human-robot interaction independently and interactively affect collaborative work: robot social behavior, mutual understanding in human-robot communication, and the impact of robotic assistants on group dynamics. With advances in computing technology and artificial intelligence, autonomous robots are becoming viable in such critical domains as search and rescue, military battle, mine and bomb detection, scientific exploration, law enforcement, and hospital care. Robotic assistants ranging from museum guides to forestry scouts are being developed to interact with people \"in person\" or remotely, as agents that collaborate with the work team. This project is targeted at little understood but critical aspects of robot-supported collaborative work. <br\/><br\/>The research involves three kinds of studies: (1) fundamental laboratory research on behavioral characteristics of robots performing social tasks, especially as these characteristics reflect lifelikeness, (2) controlled experiments and field studies of interpersonal communication and the development of mutual understanding between robot and human, and (3) studies of robots in work groups. The studies are designed to motivate and test theory, as well as to explore both direct and secondary or indirect social effects of robot-supported collaborative work. The fieldwork will be carried out in hospitals and scientific exploration settings. <br\/><br\/>This research will advance our understanding of the possibilities and problems of mutual adaptation in human-robot interaction over time, and will help us anticipate changes in the group dynamics of collaborative work. It also will extend our basic knowledge of communication and group dynamics in environments that incorporate robotic technology. It will improve our ability to make principled design decisions about robots that work with people, and better understand the societal impact of robots. In particular, this research will give us a foundation for understanding and designing collaborative work with robots in critical environments like mines, hospitals, households with elderly or disabled residents, in challenging scientific settings, and in situations in which the robot is remote. The work also will contribute to public and student awareness of the human side of robotics, and help motivate students' interests in science and engineering.","title":"Collaborative Research: DHB: Human Dynamics of Robot-Supported Collaborative Work","awardID":"0624283","effectiveDate":"2006-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["370732","518945"],"PO":["564456"]},"125305":{"abstract":"The purpose of this award is to plan and hold a two-day workshop<br\/>involving representatives from academia, industry, and government to<br\/>discuss the feasibility of developing a center-based partnership<br\/>between industry and academia in the area of human language technology<br\/>(HLT). Although currently this research area does not have such a<br\/>center, given the success story of Linguistics Data Consortium and the<br\/>fact that there are many potential industrial partners, the time is<br\/>ripe to build a better understanding of how to create a center that is<br\/>not only mutually beneficial, but supports work that simply could not<br\/>be done by either partner alone. Such collaboration would be<br\/>important for stimulating research excellence at the university while<br\/>enhancing the quality of the intellectual property of US HLT<br\/>companies. The participants are meeting to develop a strategic plan<br\/>for building a mutually beneficial research center. Generally center<br\/>vehicles at NSF require strong commitments from industry. This<br\/>workshop will focus on evaluating the feasibility of building<br\/>partnerships for two of these programs: Industry\/University<br\/>Cooperative Research Centers and Engineering Research Centers:<br\/>Partnerships in Transforming Research, Education and Technology. The<br\/>intellectual merit of the proposed activity is specific to the<br\/>planning of the workshop. The broader impacts of such a center would<br\/>be to stimulate HLT research at the university, while enhancing the<br\/>intellectual property of industrial affiliates.","title":"Workshop Proposal on Strategic Planning for an Academic\/Industry Center for Language Technologies (Spring 2007, Washington DC metro area)","awardID":"0702910","effectiveDate":"2006-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["246649"],"PO":["565215"]},"122018":{"abstract":"The existing Industry\/University Cooperative Research Center for Identification Technology Research at West Virginia University will continue to focus on research in identification that includes iris, fingerprint and face recognition and will significantly enhance the research database available for the disciplines involved with security biometrics technologies. Research is needed in large scale fully automated distributed systems in several applications ranging from drivers license, passports and visas for example.","title":"Operating Center Renewal Proposal for the Center for Identification Technology Research (CITeR): An I\/UCRC in Biometrics","awardID":"0641331","effectiveDate":"2006-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H280","name":"US DEPT OF HOMELAND SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"I230","name":"U.S. Department of Homeland Se"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"H140","name":"NATIONAL SECURITY AGENCY"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"H230","name":"Department of Army"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"H231","name":"Department of Army"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"H295","name":"Army Research Laboratory"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"H451","name":"DEPT OF TRANSPORTATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"H473","name":"FBI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"I143","name":"National Security Agency"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"I149","name":"FEDERAL BUREAU OF INVESTIGATIO"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"I338","name":"HQDA, Office of the Deputy Chi"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"I405","name":"U.S. Army Armament Research"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"I441","name":"National Security Agency"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"I448","name":"Department of Transportation F"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"J137","name":"U.S. Department of Homeland Se"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"J146","name":"FEDERAL BUREAU OF INVESTIGATIO"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"J224","name":"U.S. Department of Homeland Se"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"J287","name":"Department of Army"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"J299","name":"Department of Defense"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"K523","name":"U.S. Department of Homeland Se"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"S026","name":"DEPARTMENT OF DEFENSE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"S073","name":"CIA"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"T759","name":"NSA-BIOMETRIC TECHNOLOGIES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"T789","name":"DOD - BIOMETRICS RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"T798","name":"FBI-MEMBERSHIP (CITerR)"}}],"PIcoPI":["564474","560285","560285"],"PO":["565057"]},"118927":{"abstract":"The use of language is central to human social dynamics. Current techniques for modeling human language are widely based on simplifying assumptions that underestimate human language capacities by ignoring statistical patterns. The present project starts from a strongly contrasting approach which can lead to a breakthrough in the understanding of linguistic dynamics by linking changes in language across the different time scales of speech, the human life cycle, and the history of communities. This approach models grammar as a highly plastic cognitive system sensitively tuned to the probabilities of the environment. The project combines detailed statistical analyses of patterns found in recorded speech with laboratory experiments on language production in adults and language learning in children. The phenomena considered include high-level grammatical choices (such as whether to say \"give someone a job\" or \"give a job to someone\"), low-level pronunciation choices (such as where \"to\" is reduced to \"tuh\"), and overregularizations (such as when children say \"goed\" instead of \"went\"). Studies will involve work with data from multiple dialects of English, as well as German and Chinese. The project involves cross-disciplinary collaboration among researchers trained in Linguistics, Psychology, and Computer Science. This research will lay the groundwork for improved language technologies, and may find other applications, for example in the treatment of language disorders.","title":"The Dynamics of Probabilistic Grammar","awardID":"0624345","effectiveDate":"2006-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["450470",315282,"517444","455430"],"PO":["565215"]},"120679":{"abstract":"Humboldt State University (HSU) proposes to establish a Coalition for American Indians in Computing (CAIC) in order to recruit American Indian students, meet their unique retention needs, and provide computer science programs geared toward employment opportunities in tribal communities. The proposed project is a collaboration between faculty in Humboldt's Computing Science Department and the staff of several specialized programs (the Center for Indian Community Development, the Natural Resource, Science and Engineering Program, and the Indian Teacher and Educational Personnel Program). In addition, it is a collaboration between HSU programs and northern California tribes. The CAIC will involve students' families, tribal communities, faculty advisors, peers, specialized student support services personnel, and tribal IT professionals in culturally appropriate mentoring and career development activities. These activities will validate tribal values, address tribal computing needs, and foster Indian students' sense of self-efficacy and leadership potential. The CAIC project will include campus visits by Indian students, parents, tribal community leaders, and tribal IT professionals. It will also include exchange visits by University faculty to tribal governments, enterprises, and organizations that represent a variety of technology applications for which Indian students will be prepared. CAIC will run summer camps for high school and community college students that offer pre-college academic preparation, career planning, tribal internships, and orientations to specialized student support services. Finally, CAIC will engage in collaborative adaptations of HSU computing curricula to address the specific needs of tribes for well-trained Indian technologists; and involvement of Indian CS\/CIS students in real, tribally-based service learning, research experience, and problem-solving projects.","title":"BPC-DP: Coalition for Native Americans in Computing (CNAC)","awardID":"0634528","effectiveDate":"2006-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":[320640,"320642",320642,320643,320644,320645],"PO":["561855"]},"122418":{"abstract":"Statistical machine translation systems have seen increasing success in recent years, due to improved statistical methods and larger quantities of training data. However, their ability to generalize has been limited by overly simplistic representations, which are not sensitive to linguistic structure. This project investigates techniques for syntax-aware machine translation in three directions: (1) extending monolingual grammar induction models to the multilingual case, (2) designing discriminative tree-to-tree models which account for structural divergences between languages, and (3) building efficient inference systems for such models.<br\/><br\/>This project aims to develop general models and algorithms for syntactic translation, as well as building end-to-end translation systems. A particular focus is on language pairs for which monolingual resources do exist, but for which large bilingual training texts are unavailable. Another focus is exploring the way in which monolingual algorithms can be extended or applied to the multilingual case. In addition to the production of new translation systems and algorithms, a central goal is to develop and make available educational materials suitable for use in training undergraduate and graduate students in the areas of machine translation specifically and artificial intelligence more broadly.","title":"CAREER: Discriminative, Syntactic Machine Translation","awardID":"0643742","effectiveDate":"2006-12-15","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["491648"],"PO":["565215"]},"122518":{"abstract":"Proposal 0644225<br\/>\"CAREER: Thinking that is 'just right': Query-Specific Probabilistic Reasoning and its Application to Large-Scale Sensor Networks\"<br\/>PI: Carlos Guestrin<br\/>Carnegie-Mellon University<br\/><br\/>This project develops a novel approach for probabilistic reasoning in complex systems. Whereas most current approaches work by first learning a probabilistic model from data, committing to this model, and then applying probabilistic inference techniques to answer user queries, this project is pursuing a significantly different approach: learn a model specific for the query at hand. This project addresses the problem that complex real-world systems require complex models, and inference in these models can be intractable, thus forcing most practitioners to apply approximate inference techniques that are unstable and inaccurate<br\/><br\/>This projects aims to demonstrate that many queries can be answered by simple models that enable exact, stable inference. This project will develop algorithms for building such query-specific models, addressing both static and dynamic inference problems, distributed reasoning, and modular or relational query-specific models.<br\/><br\/>This project's general approach, query-specific probabilistic reasoning, enables the efficient solution of many real-world reasoning problems. Specifically, the project addresses practical problems in sensor networks, including: emergency response, surveillance with camera networks and monitoring of large-scale computer systems. Results from this work will be used to develop a publicly available Machine Learning class, including class projects (data), exercises, notes, slides and lecture videos.","title":"CAREER: Thinking that is \"just right\": Query-Specific Probabilistic Reasoning and its Application to Large-Scale Sensor Networks","awardID":"0644225","effectiveDate":"2006-12-15","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549916"],"PO":["562760"]},"125585":{"abstract":"The Computing Research Association is funded to hold an informational meeting for the NeTS research community to provide information about the NeTS-FIND programmatic area. FIND is a relatively new programmatic area within NeTS and this meeting provides an opportunity for members of the NeTS community who plan to submit to the FIND programmatic area to discuss new research directions and ideas about designing new architectures for the Future Internet as well as to ask questions about the program and discuss whether their ideas fit programmatic area. <br\/><br\/>Broader Impacts<br\/><br\/>The FIND initiative promises to have a long term impact on networking innovation and the NeTS vision. This meeting is important to advancing this promise by involving stakeholders early--before they submit proposals so that their work can be responsive to the solicitation. In addition NeTS program officers have the opportunity to gain input from a significant portion of the community concerning the FIND area. The webcast of the meeting will be available at www.cra.org.","title":"The 2006 FIND Informational Meeting","awardID":"0703972","effectiveDate":"2006-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["209556"],"PO":["565090"]}}