{"22918":{"abstract":"This project plans and executes a workshop that brings together representatives of the diverse research community funded by the Information Technology and Organizations (ITO) Program. This workshop will be a forum to allow researchers in this area to meet, mix, learn about others' contributions, to potentially form more fruitful interdisciplinary research alliances, and to articulate the significant research and programmatic issues facing ITO today and in the future. One outcome of the workshop will be collection of short project descriptions suitable for display on the World Wide Web. Another workshop product will be a report that weaves together the diverse research threads supported by ITO, showing their common concerns and their special distinctions. This report will also discuss historical, current, and potential future directions of ITO research.","title":"Information Technology and Organizations Grantees' Workshop","awardID":"9711401","effectiveDate":"1997-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["209826"],"PO":["495796"]},"13190":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years for a totally wireless system to connect a small museum to the Internet. Wireless also will be used within the museum to connect a laptop equipped with a camera to allow innovative ways for remote users to view the museum displays.","title":"Local History by Wireless","awardID":"9616740","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["201347"],"PO":["121202"]},"29273":{"abstract":"","title":"Realistic Computer Rendering of Complex Scenes Using Quantitative Perceptual Error Metrics","awardID":"9796136","effectiveDate":"1997-03-15","expirationDate":"1998-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["292838"],"PO":["187585"]},"23081":{"abstract":"This award is for travel support for the April 7-11,1997 IEEE INFOCOM International Conference on Computer Communications held in Kobe, Japan. This annual international conference is jointly sponsored by IEEE Computer and Communications Societies. INFOCOM has become a premier meeting for examining research advances made in the state-of-the-art computer communications technology. INFOCOM addresses research in multimedia, networking architectures and protocols; network design, planning and management; photonic switching and optical networks; protocol design, analysis, and specification; congestion and flow control; network security and privacy; distributed systems and network algorithms; internetworking and interoperability; and high speed networks.","title":"1997 IEEE INFOCOM International Conference on Computer Communications; April 7-11, 1997; Kobe, Japan","awardID":"9711921","effectiveDate":"1997-03-15","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["60089"],"PO":["150490"]},"19891":{"abstract":"This research aims to improve the ease-of-use and performance of parallel systems by combining state-of-the art compiler technology with an enhanced implementation of software distributed shared memory (DSM). The programming interface, compile- time analysis, and runtime support necessary to achieve these goals will be developed. Compilers that target the underlying message passing on distributed systems offer good performance for applications whose access patterns are regular. However, other types of accesses, if compilable at all, currently require complex run-time support. Run-time DSM systems provide good overall performance by fetching data on-demand, but incur additional overhead for regular accesses The research supported by this grant aims to develop enhancements to the DSM interface that will utilize static information about program behavior, including data accesses and consistency requirements, and provide a uniform interface and implementation for different levels of hardware support for shared memory, as well as for the hierarchical structure of memory in some architectures. The proposed work will contribute to the better utilization of distributed systems for parallel computing. To further this goal, a course on parallel computing will be developed that will target not only undergraduate students in computer science, but also potential parallel computer users in other science and engineering disciplines. Every opportunity will be used to stress the interaction among different system components, and their effect on performance and programming. ***","title":"CAREER: Enhanced Software Distributed Shared Memory as a Compiler Target","awardID":"9702466","effectiveDate":"1997-03-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["556692"],"PO":["250083"]},"19353":{"abstract":"This research is concerned with the problem of recovery, representation, and recognition of two and three-dimensional shape from real images. Building on the results of previous NSF- funded research on deriving a representation for segmented shape that is robust to variations in the visual scene, the current effort focuses on deriving such representations directly from real images of appreciable complexity, involving partial occlusion, gaps, spurious edges, and noise. Two key complementary approaches are proposed. The first relies on a local formulation of deformation and shock formation by propagating local, labeled waves directly from edge elements and detecting, classifying, grouping, and labeling the formed singularities (shocks) to recover partial shock segments from partial contour segments, shock-based partitioning of shapes in grey-scale images prior to segmentation, and completion of missing contours. Secondary (interpenetrating) waves and a set of shock transformations are proposed to deal with alterations due to partial occlusion, gaps, and spurious edge elements. The second approach is complementary to the first and captures regional continuity by randomly initializing object hypotheses as fourth-order shocks (seeds), which then grow based on the output of low-level processes. The research is motivated by segmentation and registration problems in 3D and will focus on two key areas: 1) the formalization of a classification of 3D shocks, the development of a shock grammar, and the implementation of robust numerical schemes for their detection; and 2) the development of a geometric notion of scale in 3D by devising a surface evolution scheme of diffusion, thus generalizing the reaction-diffusion space to 3D. The overall approach reflects visual modeling by sets of coupled systems of PDEs, a paradigm which allows for simultaneous interaction of boundary and regio n processes as well as bottom-up\/top-down communication.","title":"Recovery, Representation, and Recognition of Two and Three-Dimensional Shape from Real Images","awardID":"9700497","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["550631"],"PO":["179262"]},"14085":{"abstract":"This research project consists of two major parts: parallelizable fast algorithms for large dense eigenproblems and inexact\/inner-outer iteration methods for large sparse eigenproblems. Techniques of rational transformation and matrix-squaring for designing parallelizable fast algorithms for large dense eigenproblems have been developed which only use matrix- matrix multiplications and QR decompositions as building blocks. Now a general theory is to be established to encompass the class of algorithms developed and to also provide guidance to the derivation of new algorithms. Error analysis, robust deflation techniques and stopping criteria which are extremely important for the practical implementation of the algorithms will be fully investigated. This part of the research will result in deeper understanding of the theory of a new class of generalized eigensolvers and deliver a class of algorithms that are truly of high parallel efficiency and robustness. Efficient algorithms for eigenproblems of partial differential equations is the major topic of the second part of this research. Inner-outer iteration type of algorithms will be developed for the subspace iteration and Lanczos algorithms and the insight obtained will be applied to the PDE case. It is demonstrated that different iterative processes behave quite differently with respect to the distribution of the accuracy of each inner iteration, and each iterative process needs a careful analysis in order to find the distribution strategy that will give the minimum number of total inner iteration steps. Two algorithms, the variable-accuracy inner-outer iteration method and the successive inner-outer iteration method will be further analyzed and their convergence behavior explained. A PDE eigenproblem will be solved by putting an iterative process such as the Lanczos method in a Hilbert space setting. At each Lanczos iteration step, the matrix-vector multiplication corresponds to solving a boundary value problem for the differential operator, and different discretizations will be used to enhance efficiency. The research will result in deeper understanding and provide sound theoretical results of various iterative processes for solving large sparse eigenproblems in the setting of inexact matrix-vector multiplication. It will also give more efficient algorithms for solving large sparse eigenproblems that arise in many science and engineering areas.","title":"Numerical Methods for large Eigenvalue Problems: Parallizable Fast Algorithms and Inner-Outer iterations","awardID":"9619452","effectiveDate":"1997-03-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["549456"],"PO":["187585"]},"13371":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years for a cable modem network to connect the educational institutions in Jamestown ND to the Internet. The schools include a high school, middle school, seven elementary schools, a vocational center and a center for children. Jamestown College independently is upgrading its existing 56kbps Internet connection to T1 to handle the increased traffic. The educational institutions and the local cable company have formed a partnership for this project, with leadership from the college.","title":"Jamestown Educational Cable Modem Network","awardID":"9617137","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33858,33859,33860,33861,33862],"PO":["121202"]},"14251":{"abstract":"9619957 Cremer, James University of Iowa Research Experiences for Undergraduates at the University of Iowa in Experimental Computer Science This Research Experiences for Undergraduates (REU) Site project supports 12 students per year in programs carried out during the summers, for three years. The students participate in a variety of computer science research projects, with emphasis on experimental and applied research. Students are recruited nationally and matched with active faculty members in research areas including: virtual environments, real-time simulation, graphics, computer vision, computational geometry, distributed systems, and artificial intelligence. Substantial effort is placed on recruiting minority students and students from non-research institutions. The program provides a coherent experience involving close interaction between faculty, graduate students, and REU students, hands-on experience with state-of-the-art software and computing facilities, and work on challenging and important research problems.","title":"REU: Research Experiences for Undergraduates in Experimental Computer Science","awardID":"9619957","effectiveDate":"1997-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["543444","543446","74418"],"PO":["329035"]},"13350":{"abstract":"This project connects Trinity College to the Internet over a 56kbps line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Trinity College Internet Access Project (TCIAP)","awardID":"9617076","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33807],"PO":["121202"]},"14241":{"abstract":"Most current NLP techniques expect input resembling read or constrained speech. When applied to spontaneous speech, such techniques encounter two serious difficulties. First, spontaneous speech contains surface phenomena relating to non-propositional aspects of the input, such as disfluencies and discourse markers. Second, spontaneous speech lacks overt punctuation for segmenting the input into meaningful units. For effective NLP, such phenomena should be overtly marked in the input; current speech recognizers, however, produce only a raw sequence of words. The goal of this project is to augment speech recognition models to output word sequences annotated for these phenomena, termed \"Hidden Word-Level Events\" (HWEs). New models are developed to allow recognition of HWEs to occur in tandem with word recognition. HWE recognition is based on a combination of acoustic and language models, extending the standard components found in current systems. The new models also capture prosodic characteristics of HWEs, including intonation and duration patterns. The prosodic information is combined with statistical language models describing the distribution of HWEs in relation to lexical and syntactic units. Results should significantly enhance our ability to process spontaneous speech automatically; the research will also further our basic understanding of spontaneous speech.","title":"STIMULATE: Modeling and Automatic Labeling of Hidden Word- Level Events in Spontaneous Speech","awardID":"9619921","effectiveDate":"1997-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V513","name":"CIA-KDD WORKING GROUP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V713","name":"CIA-KDD NSF GRANT RECIPIENTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V789","name":"HOMELAND SECURITY-KNOWLEDGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y026","name":"NSA-HUMAN COMM PROC & INFOR TE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y488","name":"DARPA-HUMAN LANGUATGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V083","name":"CIA-KNOWLEDGE DISCOVERY TO NSF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V145","name":"CIA-KNOWLEDGE DISCOVERY & DISS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W295","name":"CIA-KNOWLEDGE DISC & DISSEMIN"}}],"PIcoPI":["294416","438686"],"PO":["565227"]},"19972":{"abstract":"The research part of this CAREER project develops accurate and efficient numerical methods for a number of important problems including high relative accuracy (tiny percentage error) eigenvalue and singular value computations, updating the singular value decomposition (SVD), and distance problems in linear systems and control computations. Although current methods for solving them are abundant, many important questions remain unanswered. For example, a large number of recent papers describe numerical methods to compute all eigenvalues and singular values to high relative accuracy for a few isolated special classes of matrices, but a common explanation and a common numerical method are missing. As another example, the ability to rapidly update the SVD is critical in signal processing applications since problems are often real- time, but none of the current methods is efficient enough for this purpose. A goal is to provide a common explanation and a common numerical method for high relative accuracy eigenvalue and singular value computations. It turns out that the common explanation and common numerical method are applicable to many new interesting classes of matrices, arising from areas as diverse as combinatorics and numerical solution of ODE's and PDE's. The project also aims at providing rapid methods for updating the SVD, hence removing a major bottleneck in SVD-based methods for various signal processing applications. The education part of the project is to develop software tools so that students taking abstract mathematics courses can clearly envision and play with the sometimes abstract objects and results on the World-Wide Web with vivid graphical display. The plan also includes new graduate courses in numerical linear algebra with scientific and engineering applications.","title":"CAREER: Algorithms for Eigenvalue and Singular Value Problems","awardID":"9702866","effectiveDate":"1997-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550348"],"PO":["179846"]},"13450":{"abstract":"9617349 Bic, Lubomir, F. Michael Dillencourt University of California, Irvine CISE Research Instrumentation: A Distributed Biomedical Computing Laboratory Many important problem areas of biomedical computing have the ability to generate large volumes of relatively coarse-grain computations and thus can benefit greatly from a LAN-based network of workstations. This project will provide such an infrastructure, based on a cluster of Sun workstations, which will be shared by the following four projects: -Knowledge Discovery in Clinical Databases-Brain Network Models-Toxicology simulations-Distributed Protein Structure Prediction. The goal of this project is to discover new knowledge in clinical databases that will be useful for diagnosis and treatment. It uses novel machine learning methods that are particularly suited to medical databases. The second project attempts to understand the functions of specific brain regions. It will develop parallel versions of neural-net-based algorithms to solve difficult signal-processing tasks. The third project develops a distributed simulation environment that supports the construction and interactive use of simulation models for predicting concentrations of chemicals (drugs or toxins) in the human body to assess health risks. The last project will parallelize a novel protein structure prediction algorithm developed by our research group, and, subsequently, will validate a novel Bayes-optimal Prediction theory.","title":"CISE Research Instrumentation: A Distributed Biomedical Computing Laboratory","awardID":"9617349","effectiveDate":"1997-03-01","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["50854","50855","420347","226351",34076],"PO":["557609"]},"13230":{"abstract":"Capitol College requests support from NSF to connect it's campus to the Internet. Capitol College in Laurel, MD has approximately 1,200 students, faculty and staff. The college intends to connect through BBN Planet, a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Capitol College Connection to the Internet","awardID":"9616842","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["557686"],"PO":[33486]},"13120":{"abstract":"This award supports a three year project to continue investigation of Internet web caching. It is a follow-on to a successful two year project which deployed caching servers at the five NSF-funded supercomputing centers and at FIX-West. The project resulted in considerable international participation and an early version of caching software called Squid which is now being used at over 400 sites. This follow-on project does the following: ... encourage greater U.S. participation. ... continue Squid code development and maintain the public domain code base for experimentation and collaboration. ... hold at least one workshop to improve exchange of ideas among caching researchers. ... standardize the Internet Caching Protocol (ICP) to assure interoperability between implementations. ... develop an automatic cache discovery system. ... assist in improving the web software, http, to support caching. ... collaborate with other caching research groups to use multicast for distributing data between caches. ... develop specifications for high performance caching hardware, and work with the vendors in developing such equipment. ... investigate research questions such as scaling, recording system performance and information provider hit statistics, and improving statistics gathering to enable better caching simulations.","title":"A Distributed Architecture for Global WWW Cache Integration","awardID":"9616602","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["521741","73917"],"PO":["198445"]},"19621":{"abstract":"An existing component-oriented software system that is based on a platform-independent software distribution format will be augmented by a dynamic re-optimizer. The existing system already employs load-time code generation that happens in a single burst and puts compilation speed ahead of code quality, so that program execution can commence immediately. The additional re-optimizer will improve this situation by continually re-generating the object code of all active software components in the background, applying aggressive intermodular optimization techniques. Hence, it will combine a collection of independently compiled and distributed software components into a single, fully cross-optimized, quasi- monolithic code image, and then supplant the currently executing version of the code by the newly generated image. Re- optimization will be guided by run-time profiling data, so that successive re-optimizations will adapt to shifting usage patterns. Dynamic code generation will enable component- oriented systems to match or even surpass the efficiency of statically optimized software, in spite of being extensible at run-time. Concurrently with this research, a new upper-division undergraduate course sequence on language implementation will be developed.***","title":"CAREER: Dynamic Optimization of Software Component Systems","awardID":"9701400","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["486136"],"PO":["250083"]},"13098":{"abstract":"CDA-9616546 Mostow, David J. Carnegie Mellon University CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: An Automated Reading Assistant That Listens Carnegie Mellon University will build a prototype to serve as a testbed for experimental in-school use by students and teachers. The investigator will advance, adapt, and integrate methods from speech recognition, computational linguistics, cognitive and motivational psychology, machine learning, human computer interaction, and education. Expected outcomes include implemented, evaluated methods to analyze oral reading, provide cognitively and motivationally effective response, and author interactive reading experiences.","title":"Collaborative Research on Learning Technologies: An Automated Reading Assistant That Listens","awardID":"9616546","effectiveDate":"1997-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["551746"],"PO":["564318"]},"14023":{"abstract":"The goal of this research project is to develop algorithms to solve dual problem of structure and motion recovery of nonrigid objects from multiple 2D views. Previously, algorithms have been developed that can recover point correspondences in nonrigid motion from range data sequences. If only 2D projections (perspective or scaled orthographic) are available, not only motion but also structure (i.e. 3D coordinates) of the surface points need to be determined. There are several research questions related to nonrigid motion and structure recovery which are being addressed. .First, depending on the observed motion, which of the various nonrigid motion models should be utilized (that include determination of the number of parameters to be estimated)? Second, once the motion model is decided, how many feature points, over how many frames are required in order to estimate the motion and structure of the points under consideration? Further, the derived solutions need to be extended to line (and other) features. This local motion modeling approach is often noise sensitive and may have problems handling large deformations. Those drawbacks will be addressed bycombining local techniques with global models. Global models under investigation include time-varying superquadrics and hyperquadrics, spherical harmonics as well as FEM models.","title":"Nonrigid Motion and Structure Recovery from 2D Views","awardID":"9619240","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["353592"],"PO":["179262"]},"19996":{"abstract":"Efficient communication is at the very heart of extracting performance from a parallel or distributed system. The design of a parallel or distributed network involves a number of complex design choices. This research aims at providing a sound theoretical basis for making these choices and help meet the challenges of the evolving National Information Infrastructure (NII). This project will study important theoretical issues in the design of parallel or distributed networks that guarantee quality-of-service (QoS) performance metrics. Further, this effort will focus on simple implementable protocols for store-and-forward, wormhole, and deflection routing. This project will investigate theoretical aspects of wireless communication, including call admission algorithms, and algorithms for mobility management. The education plan includes activities involving research into novel teaching methodologies, participating in teaching seminars, and consulting with experienced educators. A new core undergraduate course in algorithms will be developed with the aim of integrating algorithmic theory with algorithmic practice. The course will focus on a number of teaching innovations. ***","title":"CAREER: Communication in Parallel and Distributed Systems","awardID":"9703017","effectiveDate":"1997-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["282000"],"PO":["309350"]},"13276":{"abstract":"This project connects two educational sites to the Internet over a 56kbps line. The two sites to be connected are in Seward: the Seward Marine Center of the University of Alaska Fairbanks, and the Alaska Vocational Technical Center, a state-funded post-secondary educational institution. Faculty and students at the schools benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Internet Connection for Rural Alaska","awardID":"9616926","effectiveDate":"1997-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["150420",33597,33598],"PO":["121202"]},"19821":{"abstract":"This work will advance automatic storage allocation through the use of experimental techniques, and will advance education in experimental computer science. Automatic deallocation of dynamically allocated storage is called \"Garbage collection\" (GC). GC helps to avoid a variety of common but serious programming errors. Unfortunately, it may adversely affect program performance. Modern collectors probably provide acceptable performance, but there is a lack of experimental evidence to support this claim, hindering the adoption of GC, despite its advantages. The goal of this work is to provide a better understanding of GC performance, both aiding its adoption when performance is adequate, and providing detailed quantitative information about how performance needs to be improved when it is inadequate. In particular, the work will compare the performance of copying and mark-and-sweep collection on modern computer architectures. The focus of the work will be building a GC testbed, which will facilitate the systematic comparative study of a variety of GC techniques. The educational goal is to improve the teaching of experimental computer science. A new course is proposed that will explicitly teach experimental CS. The pedagogiaal approach is the standard one used to teach other experimental sciences, in which well-known experiments are repeated, enabling students to gain hands-on experience with the basic methodologies and techniques.***","title":"CAREER: Advancing Experimental Computer Science in Storage Management and Education","awardID":"9702107","effectiveDate":"1997-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["316328"],"PO":["250083"]},"17126":{"abstract":"We seek to marry rate-distortion theory with perceptual science in order to develop improvements in fidelity criteria and techniques for the compression of video and other natural data sources. The information theory of Weber-Fechner (WF) and root law (RL) fidelity criteria will be studied, with emphasis on their application to lossy compression of video signals and on calculating lower bounds to their rate-distortion functions. Multiterminal source coding models will be employed to deal with perceptual considerations, such as just-noticeable-differences and masking, that arise when sequences of video frames are viewed. Also, we shall explore novel video compression schemes grounded in WF\/RL theory that provide dramatic computational simplifications relative to competing algorithms at high data rates and promise better quality in the low-bit-rate regime for such appications as video telephony and distance learning. Low-latency video compression and transport will be performed on facilities in the DISCOVER Lab to test our perceptually based algorithms.","title":"Weber-Fechner Rate-Distortion and Video Compression","awardID":"9632266","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508479"],"PO":["150411"]},"19337":{"abstract":"In a semidefinite programming (SDP) problem, a linear function of a symmetric matrix variable X is minimized subject to linear equality constraints on X and the essential constraint that X be positive semidefinite. Several problems can be cast as SDP problems including linear programs, convex quadratic problems with convex quadratic inequality constraints, matrix norm minimization and a variety of maximum and minimum eigenvalue problems. In addition, SDP has many applications in enginnering, combinatorial optimization and statistics. It is known that several interior point algorithms for linear programs can be extended to SDP problems. As in linear programming, many of these methods are polynomially convergent and perform very efficiently in practice. In particular, the class of primal-dual interior point methods and their higher- order variants are the most effective interior point methods. In contrast to linear programming, there are many ways one can compute the Newton search directions used in primal-dual algorithms for SDP. For this reason, the theory of primal-dual methods for SDP is substantially more difficult than that for LP. This project addresses the development of the theory and implementation of primal-dual interior point algorithms for SDP problems. The objectives of this research project include: 1) developing a new primal-dual interior point algorithm for SDP; 2) advancing the knowledge of the theory of polynomial and superlinear convergence analysis of primal-dual methods for SDP; 3) studying the existence and asymptotic behavior of continuous trajectories for SDP; 4) developing new higher-order primal-dual methods for SDP; 5) implementing the new proposed algorithm and comparing it against existing primal-dual interior point methods; and 6) extending primal-dual interior point algorithms to the context of nonlinear SDP and complementarity problems.","title":"Interior Point Methods: Semidefinite and Nonlinear Programming","awardID":"9700448","effectiveDate":"1997-03-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["540935"],"PO":["187585"]},"11681":{"abstract":"This three-year award supports U.S.-France cooperative research in knowledge-based, information systems between Shlomo Zilberstein of the University of Massachusetts and Jean-Paul Haton of the French National Institute for Research in Computer Science and Applied Mathematics (INRIA) in Nancy, France. The project involves an exchange of graduate students. The objective of the research is to build knowledge-based systems that would operate robustly in real-time domains such as process control, automated navigation, and medical diagnosis. The American and French investigators bring to this collaboration complementary expertise and approaches to the problem.","title":"U.S.-France Cooperative Research (INRIA): Resource-Bounded Knowledge-Based Systems","awardID":"9612092","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["485994"],"PO":["323582"]},"20030":{"abstract":"This research endeavors to explore uses of Markov chains, focusing on applications in statistical physics and computer science. Markov chains are used in these disciplines to study features of a combinatorial set by allowing (1) the sampling of configurations and (2) estimating the set's cardinality. In statistical physics such sets arise as models of simple physical systems, where the configurations typically represent arrangements of molecules in the system. Sampling provides insight into the thermodynamic properties of the system, such as the specific heat and free energy. Recently in computer science, several new techniques have been developed for proving that certain classes of Markov chains are rapidly mixing. In fact, there has been considerable success with algorithms for precisely the types of problems arising from physical models. This project represents three new ways of continuing this research in directions which will be beneficial to both fields. (1) Develop provably efficient algorithms for other combinatorial problems. Two problems of interest are: (a) k-coloring, which arises in the Potts model for antiferromagnetism, and the Ice model, and (b) Hamiltonian cycles on lattice regions and hypercubes, which has applications in cryptography (for encrypting images and generating random Gray code) and biophysics (for studying compact conformations of polymers). (2) Design sampling algorithms for finite lattice regions which will give insight into the corresponding problems in infinite lattices (i.e., the continuum limit). (3) Develop decomposition techniques for bounding the mixing rate of Markov chains and study applications using \"`simulated tempering.\" Finally, this interdisciplinary research will be complemented by the design of new courses which focus on (and encourage projects related to) recent research results and through the organization of workshops and seminars which bring together scientists from the relevant disciplines.","title":"CAREER: Markov Chain Algorithms for Combinatorial Problems from Statistical Physics","awardID":"9703206","effectiveDate":"1997-03-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["518569"],"PO":["179846"]},"13892":{"abstract":"This research addresses theoretical and computational aspects of structured optimization: polynomial-time algorithms, fully polynomial-time approximation schemes, complexity issues related to semidefinite programming, and numerical experimentation. The goals are: (1) to study the efficiency of widely-used Lagrangian decomposition techniques with emphasis on the development of nearly-optimal potential-reduction methods; (2) to study general block-angular and linear bordered block-diagonal problems, and, time permitting, their specialized applications in combinatorics, operations research, communications, engineering and finance; (3) to explore the complexity of semidefinite programming with real and integer variables; and (4) to conduct computational experiments which will examine the numerical behavior and practical performance of the developed algorithms.","title":"Approximatiom and Polynomial-time Algorithms for Structured Optimization","awardID":"9618796","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["165645",35203],"PO":["179846"]},"14212":{"abstract":"This project concerns the use of foveated geometries for scientific visualization applications. Two main motivations for such geometries are (1) the analogy with biological vision systems, and (2) their remarkably reduced pixel density that is logarithmic in the radius of the visual field. To compensate for the loss of peripheral vision in foveated geometries, the approach of active visualization is to allow the user interactive control of several parameters of vision, including rapid saccades and adjustable resolution. These are new capabilities, to be added to the more conventional navigational control. Foveated geometries will be a key to making current visualization systems more robust, scalable and extendible. The project will investigate three main areas: - Algorithms and data structures for rendering and manipulating foveated images. - Wavelet theory and algorithms for a corresponding concept of foveated multiresolution. - Application of active visualization in \"thin-wire models\" of computation such as the internet. In a typical \"thin-wire\" visualization scenario, imagine an image server with powerful computational resources, a client displaying images with the the computational power of stock PC's, and between them, a thin-wire. In current visualization applications, the bandwidth usage from client to server is negligible but the bandwidth in the other direction is a severe bottleneck. In exchange for a modest amount of bandwidth going from client to image server, active visualization is able to remove this bottleneck. Such a development can have major impact on visualization. ***","title":"Algorithmic Development of Visualization Under Foveated Geometries","awardID":"9619846","effectiveDate":"1997-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["409933"],"PO":["187585"]},"13376":{"abstract":"9617148 Roberts This award provides funds to partially support the five day workshop, \"Statistical Physics Methods in Discrete Probability, Combinatorics, and Theoretical Computer Science\" to be held March 23-27, 1997 at the Institute for Advanced Study in Princeton. The goal of the workshop is to bring together researchers working at the interface of statistical physics, probability, combinatorics and theoretical computer science with the intention of developing a common language and recognizing parallels among the fundamental problems being addressed in these disciplines. There will be several introductory lectures surveying some of the major themes of the workshop. In addition, there will be more advanced lectures giving junior and senior researchers opportunities to present recent results. There will be ample time for discussion of open problems.","title":"Mathematical Sciences: Workshop: Statistical Physics Methods in Discrete Probability, Combinatorics and Theoretical Computer Science","awardID":"9617148","effectiveDate":"1997-03-15","expirationDate":"1997-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["197610","518569","264120"],"PO":["517169"]},"20042":{"abstract":"This project will investigate the use of perceptually-motivated image metrics across a range of important applications in computer graphics. A wide variety of tasks in computer graphics assume some measure of similarity in appearance between two images. Such tasks include level-of-detail generation, raster font design, cartographic element placement, texture synthesis and shape transformation. Too often the metrics used in such work are poor at reflecting what a human would visually perceive for the given task. This project will re-visit several areas within computer graphics and will apply visually-based metrics to a number of applications with the goal of producing better images. Replacing the techniques that are used in existing applications with perceptually-based measures of image similarity has the potential to improve the results in a wide range of important applications. Applications that can benefit from the use of image metrics include: - Simulators for pilot and driver training. - Computer aided design of mechanical parts. - Automated map-making. - Raster font creation. - Interactive walkthroughs of large building interiors for architectural review - Comparison between \"model\" organs and the MRI or CT data of a medical patient - Vector and tensor field visualization for applications such as weather prediction and stress\/strain simulations of mechanical and architectural structures. This project will investigate using techniques from image processing and computer vision to help define image metrics for particular tasks. Some of the properties that these metrics may incorporate are: sensitivity to edge strength and orientation, frequency responses at a number of scales, relative rather than absolute measures of intensity and color within an image, and the masking effects that noise has on perception. Once a metric is defined, an optimization procedure will be used to minimize the differences between the generated image or geom etry and the target object. The choice of optimization technique will depend on the application and on the form of the image metric. Computationally expensive optimization methods may be acceptable for off-line tasks. Where speed is essential, heuristics may be suggested by observations of the optimization routine while it is executing. The educational goals of this project are to introduce both undergraduate and graduate students to computer science research, to expose the community outside of academia to important applications of computer graphics, and to disseminate the programs, libraries and datasets that are developed by this project to other researchers worldwide. Students will be involved in research both through the computer graphics classes that are being developed and by working within a research group. ***","title":"CAREER: Image Metrics for Computer Graphics","awardID":"9703265","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["456660"],"PO":["179846"]},"13893":{"abstract":"This project proposes a multi-level process of summarization featuring: (1) integration of knowledge about a document derived with both statistical and symbolic techniques; (2) the use of language generation for reformulating this information into both indicative and informative summaries; (3) summarization across sets of related articles; and (4) development of techniques for domain independent summarization. The proposed research comprises both document analysis and summary generation. Document analysis involves segmenting a document into topics, using statistical techniques to identify key content within each section, and constructing a lexical semantic representation for use by the summary generator. Generation focuses on integration of relevant information from several data sources, on presentation of contrasting information from the input articles, and on the use of planning operators to combine information from the separate representations into a single concise text. The research includes evaluation techniques for measuring both coverage and robustness of the analyzer and generator, including conceptual and linguistic knowledge. Through collaboration with Columbia's Center for Research on Information Access, the proposed research on dynamically generated, coherent summarization across domains will ultimately be part of a digital library interface that filters documents according to a user's interests and needs.","title":"STIMULATE: Generating Coherent Summaries of On-Line Documents: Combining Statistical and Symbolic Techniques","awardID":"9618797","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y026","name":"NSA-HUMAN COMM PROC & INFOR TE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["334101","423553"],"PO":["565227"]},"12585":{"abstract":"The main objective of this project is to improve the scalability and effectiveness of knowledge discovery and data mining systems in order to handle large, structural databases (i.e., databases composed of parts and relations among parts). First, a state-of-the-art structural discovery system called Subdue will be integrated with one or more existing non-structural discovery systems. Parallel and distributed versions of both Subdue and the integrated discovery system will then be developed. Distributing both the data and the processing across several machines will afford the most scalability for the discovery systems, and distribution is essential for handling large databases. The integrated discovery system will then be applied to several large scientific databases. The results will be evaluated by domain experts and disseminated along with source code releases of all software to the scientific community. This research addresses a critical need to improve the scalability of existing knowledge discovery and data mining methods, especially in domains with richer data representations, will provide scalable discovery systems to the scientific community, and will increase the state of knowledge in the design of parallel and distributed intelligent systems.","title":"Scalable Knowledge Discovery from Large Structural Databases","awardID":"9615272","effectiveDate":"1997-03-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["547675","550149"],"PO":["563751"]},"13278":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years for an Internet connection for a high school and middle school through a cable television network.","title":"Cambria County Connections to the Internet - CATV - Ferndale School District","awardID":"9616929","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33602],"PO":["121202"]},"13982":{"abstract":"A video sequence is a rich multimodal information source, including speech, text, audio (non-speech portion), color patterns and shapes of imaged objects (reflected in individual frames), and motion of these objects (revealed by changes between frames). Although the human being can quickly interpret the embedded semantic content from the information carried by different modalities, computer understanding of a video sequence is still in a primitive stage. The aim of this project is to develop new theory and techniques for scene segmentation and classification in a video sequence, which is key to video understanding. Research in this arena has in the past several years focused on the use of text, speech and image information. The proposed research explores the use of motion and audio characteristics, which will provide important complimentary information. New results are anticipated both in the general theory of feature analysis and classification, and in practical techniques for video understanding and scene classification. These new developments will have direct applications in information indexing and retrieval in multimedia databases, spotting and tracking of special events in surveillance video, video editing and movie stratification, etc.","title":"STIMULATE: Video Scene Segmentation and Classification Using Motion Information","awardID":"9619114","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y026","name":"NSA-HUMAN COMM PROC & INFOR TE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z964","name":"NSA-IRIS STIMULATE INITIATIVE"}}],"PIcoPI":["420327","491898"],"PO":["565227"]},"13872":{"abstract":"The majority of current computer speech recognition systems model the speech signal with homogeneous observation frames, represent words by a string of phonemes, and rely heavily on statistical word-based language models to decode the underlying word sequence. This project aims to investigate an alternative approach that incorporates many more levels of linguistic information into a parsimonious hierarchical framework for speech recognition and understanding. This approach will provide new perspectives on incorporating constraints from the distinctive feature, phonetic, phonological, syllabic, morphological, lexical, syntactic, and semantic levels into a probabilistic framework for speech recognition and understanding. Structure sharing of sub-word levels across words will allow for the generalization of phonological effects across similar environments and increased flexibility for dynamic vocabularies and language models. Structure sharing should also produce a more efficient search with a smaller number of parameters. The proposed hierarchical framework also has the potential of serving as a recognition kernel, with the speech signal as input and a set of morpho-phonological units as output. This kernel would have a finite inventory of units for a given language, whose internals will be vocabulary and task independent. To ensure that the proposed framework is language independent, its utility will also be investigated for languages other than English.","title":"STIMULATE: A Hierarchical Framework for Speech Recognition and Understanding","awardID":"9618731","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y030","name":"DARPA-IRIS\/ISP INITIATIVE STIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y489","name":"DARPA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y490","name":"DARPA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y951","name":"DARPA-MIT"}}],"PIcoPI":[35149,"250512",35151],"PO":["565227"]},"12684":{"abstract":"MagnetoEncephaloGraphy (MEG) is concerned with mapping electrical activity in the brain by measuring the induced external magnetic field. This mapping is applied for diagnosis of diseases such as epilepsy. MEG has been a very active area lately due to the steady improvement of weak magnetic field measurements and its relative robustness to inhomogeneities in electrical conductivity within the skull. This research is developing several performance measures and optimization schemes for magnetoencephalography (MEG) and electroencephalography (EEG) systems, from a signal processing point of view. The measures include: (1) accuracy of source parameter estimates, (2) detectability of a source, based on the probability of detection, and (3) resolution of sources, or the probability of detecting more than one source. These measures are being applied to develop techniques for the optimum design of MEG\/EEG system parameters, including sensor placement, type and orientation.","title":"Magnetoencephalography Performance Measures and Optimizations","awardID":"9615590","effectiveDate":"1997-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["449854"],"PO":["564898"]},"20088":{"abstract":"The primary purpose of this workshop is to create a broad research summary and planning report on the topic of visual cognition to guide research in the interdisciplinary field. Visual cognition integrates visual perception with higher level domain knowledge, and serves as the interface to high-level reasoning, planning, communication, learning, and other cognitive abilities. Many diverse, practical areas, such as automated manufacturing and robotics, mechanical design, transportation planning, education, and the representation and storage of spatial information stand to benefit from research in visual cognition. A fuller understanding of higher-level cognitive processes and their development may hinge on an understanding of their relation to perception. There is already a body of relevant work in computer science on these issues, categorized variously as diagrammatic reasoning, qualitative physical reasoning, geometric reasoning, and the formal logic of spatial reasoning, and there have been other meetings on visual cognition. But the field is of necessity strongly interdisciplinary (the three workshop organizers come from psychology, computer science, and electrical engineering, for example), so this meeting will attempt to be more comprehensive and integrative in nature, in order to accomplish its stated purpose.","title":"Workshop on Visual Cognition and Decision-Making in the Spatial Domain to be held in the Spring of 1997 in Solomons, Maryland","awardID":"9703475","effectiveDate":"1997-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[50781,50782,"528943"],"PO":["565227"]},"12135":{"abstract":"The Grouplens research project explores collaborative filtering approaches to address information overload for users of Internet information systems. Collaborative filtering is a technology that uses the opinions of some readers of a document to predict the interest of other potential readers in that document. This project builds upon the successful Grouplens collaborative filtering system for Usenet news to explore in more detail the human factors and algorithmic issues of collaborative filtering. This project addresses three fundamental problems in collaborative filtering: how to effectively measure user interest with minimal effort from users, how to use these measures of interest to produce accurate predictions of other user's interest, and how to integrate non-collaborative and collaborative filtering approaches to create robust filtering environments. The research approach relies upon three experimental methods. A set of controlled experimental trials is used to gather complete ratings datasets to directly measure the effectiveness of collaborative filtering algorithms. A small- scale public trial is used to collect data on the actual usage of the GroupLens system. Survey research is used to obtain user opinions and feedback from both trials.","title":"GroupLens: Scalable Collaborative Filtering for the Internet","awardID":"9613960","effectiveDate":"1997-03-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["483488","550380"],"PO":["565227"]},"19824":{"abstract":"In this effort research and education at the boundary of parallel systems and applications will be performed. It is motivated by the need for application insights to make fundamental advances in parallel systems, and the recent convergence in multiprocessor architectures to general purpose nodes connected by a communication architecture. On the research side, challenging, irregular, dynamic applications will be parallelized on real systems in close collaboration with domain researchers, particularly in probabilistic protein structure determination and adaptive unstructured meshing, and their implications for parallel architecture and software understood. General techniques for partitioning such complex applications will be developed, particularly for the emerging class of cache- coherent distributed-memory multiprocessors. The applications will be distributed as benchmarks to the parallel computing community. Architectural implications, particularly communication demands, scaling and resource distribution, will be examined, and scaling methodologies developed. Funds permitting, a range of commercial systems will be evaluated using applications, to understand the impact of their communication architectures and tradeoffs, and insights into programming and performance debugging environments studied. On the education side, a new undergraduate course in parallel architecture will be developed, and a textbook on parallel architecture is being written to articulate the convergence and develop parallel architecture as an engineering rather than exotic discipline.","title":"PECASE: Applications-driven Research in Multiprocessor Architecture and Software Systems","awardID":"9702115","effectiveDate":"1997-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["462748"],"PO":["548925"]},"13983":{"abstract":"*** In the rapidly emerging area of multimedia information systems, effective indexing and retrieval techniques are critically important. In this project, the Center for Intelligent Information Retrieval (CIIR) will study algorithms and mechanisms that facilitate the.process of indexing and retrieving images, video, and associated text. Specifically, the CIIR will: 1) Develop techniques for browsing and retrieving images and videos by content. Image indexing is an emerging technology which is poorly understood. New and powerful techniques will be developed for indexing images and videos using visual attributes such as color, texture and 'appearance'; 2) Develop techniques for indexing images and videos using text present in the images. Methods of assisting with manual annotation of images will also be studied. The text indexing methods will be combined using the INQUERY probabilistic retrieval engine; 3) Develop and evaluate interactive retrieval and browsing interfaces for image, video, and text retrieval. These interfaces will be based on novel visualization and user interface work done at CIIR. The CIIR will perform user studies to evaluate the appeal and effectiveness of the interfaces. In summary, the project will integrate innovative image matching, sophisticated text retrieval and new query formulation and visualization methods to create a powerful platform for indexing and retrieving images, video, and text.***","title":"STIMULATE: Multimodal Indexing, Retrieval, and Browsing: Combining Content-Based Image Retrieval with Text Retrieval","awardID":"9619117","effectiveDate":"1997-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y488","name":"DARPA-HUMAN LANGUATGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["553228","406626","290022"],"PO":["565227"]},"13313":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for an OC-3 connection to the Very High Performance Backbone Network Service (vBNS). The connection is through the MREN (Metropolitan Research and Education Network) ), an OC-12 ATM ring connecting several research institutions in the Chicago area to each other and to the vBNS. Applications include projects on compilers, VLSI CAD, distributive higher performance computing, optimization techniques, and x-ray research. Collaborating institutions include San Diego Supercomputing Center, Argonne National Laboratory, Cornell Theory Center, Pittsburgh Supercomputing Center, and the National Center for Supercomputer Applications.","title":"High Performance Network Connection to vBNS","awardID":"9617001","effectiveDate":"1997-03-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33711,"291028","230628","541641"],"PO":["121202"]},"13424":{"abstract":"96-17279 Michael P. Fitz Steve Bibyk Ohio State University CISE Research Instrumentation: A Physical Layer Radio Communications Laboratory This grant supports instrumentation to enable the following research: -Narrowband Radio Services Design Telecommunications Circuit Design Wideband Radio Design Automated Highway System Communications. This project sets up a physical layer radio research laboratory at the Ohio State University (OSU) which empowers a variety of multidisciplinary research in data communication. The equipment enables the construction and support of a highly flexible testbed for physical layer radio research. This test bed consists of real-time digital signal processors, microwave signal sources, high power linear amplifiers, antennas, radio receivers, data acquisition electronics, workstation and personal computers, and supporting electronic test equipment. The laboratory is the focus of ongoing experimental work in the development of high performance narrowband wireless modems and will spur new experimental work in wideband multiple access radio design. In particular investigations into improving transmitter and receiver antenna diversity and signal processing for interference suppression or multiuser demodulation can now be backed with experimental feedback. Much greater gains in bandwidth efficiencies are potentially achievable by being able to measure and exploit the actual channel characteristics. Additionally the laboratory will be the focus of ongoing research in the area of high power amplifier linearization and very large scale integrated circuit design. Finally much of this work supports a modem being developed for Intelligent Transportation Applications (ITS). The Center for Intelligent Transportation Research is a nationally designated center of excellence for automated highway research (AHS). This laboratory will be the focal point for a wireless modem development for potential use in AHS applications within the national ITS program.","title":"CISE Research Instrumentation: A Physical Layer Radio Communications Laboratory","awardID":"9617279","effectiveDate":"1997-03-01","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["433532","492384",33996,"282307","515828"],"PO":["557609"]},"13369":{"abstract":"The California College of Podiatric Medicine requests support from NSF to connect it's campus to the Internet. The College, located in the San Francisco with approximately 400 students, is one of seven podiatric medical schools in the nation. The college intends to connect through AimNet a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connections to the Internet","awardID":"9617135","effectiveDate":"1997-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33854],"PO":["121202"]},"19837":{"abstract":"The instrumentation and measurement of systems is vital for them to be understood, debugged, tuned, refined, tested, validated, or made reliable. This project will investigate the principles and practice of program instrumentation. Principles include a theoretical understanding of the dynamic measurement and observation of various structures in parallel, distributed, and sequential systems, such as acyclic or cyclic graphs for representing parallel executions and families of finite automata for tracking information about variable accesses. The complexity of computing and analyzing such structures will be explored, including tradeoffs between time, space, accuracy, and completeness. The practice of instrumentation implements measurement techniques at a cost acceptable to users, using on-line algorithms to dynamically decide what to do and when it is best done and by fully exploiting the semantics of the problem at hand. Techniques will be developed, especially for debugging and programming tools, for problems whose best-known solutions are currently prohibitive because of instrumentation costs. An arsenal of practical techniques usable in many areas, all of which are based on theoretical underpinnings, will also be developed. This research will result in a deeper understanding of the cost of solving various types of instrumentation problems and an array of techniques for their solution. This project will introduce undergraduates to research by involving them in independent study seminars together with \"project sets\" partially specified mini-research problems which require as much work in problem formulation as solution. This project will escalate the undergraduate-outreach effort at Brown. The tools this project will produce will be suitable for use by students in their research projects.***","title":"CAREER: Principles and Practices of Program Instumentation","awardID":"9702188","effectiveDate":"1997-03-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["448702",50225],"PO":["250083"]},"19958":{"abstract":"The use of multiprocessor computer systems is increasingly common in scientific and numeric computing. In developing applications for multiprocessor systems, new challenges arise in coordinating concurrent accesses to shared data. This is traditionally achieved through locking, which often restricts parallelism, and can also cause performance bottlenecks because delayed processes can cause others to wait. This work aims to eliminate locking from multiprocessor applications through the use of transparent, wait-free implementations of user-supplied transactions, which ensure that delayed processes never cause others to wait. In this project, wait-free implementations will be designed that automatically resolve conflicts between concurrent transactions, and exploit parallelism between nonconflicting transactions. Their performance will be studied through simulation and applications. Finally, a seamless interface for application code will be developed on several systems. The education plan of this project focuses on integrating research and education in concurrent programming. This research will provide new tools for developing efficient applications in multiprocessor systems. These tools will be used in some of the future courses in concurrent programming. ***","title":"CAREER: Transparent Support for Efficient, Wait-Free Transactions in Shared-Memory Multiprocessors","awardID":"9702767","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[50470],"PO":["561889"]},"11620":{"abstract":"This research focuses on the compiler and architectural issues of concurrent multithreaded architectures. These architectures allow multiple threads to be active simultaneously to achieve multiple instruction issue in a single machine cycle. The architectural research focuses on the design of thread execution units that include support for communication between threads, for speculative thread execution, and for thread pipelining. Simulation at the functional and register-transfer levels will be the primary tool for this research. The compiler research focuses on integrating optimization for thread and instruction level parallelism. This research will take place in the context of modifications to the gcc compiler. While threads can be used to allow multiple independent programs to execute concurrently, the primary focus of this project is speeding up the execution of a single program.","title":"Experimenting with Concurrent Multithreaded Architectures for High-Performance Computing","awardID":"9610379","effectiveDate":"1997-03-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["408878","528635","383980"],"PO":["197478"]},"13941":{"abstract":"Humans communicate using speech, prosodic cues, hand gestures, gaze and facial expression. The focus of this project is the interaction among these modalities in humans and in interactive humanoid communicating agents. The goal is to be able to synthesize and understand natural face-to-face conversational behavior -- that is, spontaneous gesture and facial movements in the context of speech with intonation. Two converging lines of research will be carried out: first, a series of empirical experiments on the interaction among these modalities, including experiments on the association between gestural features and motion verbs, the relationship between turn-taking and information structure, the interaction between facial movements and gesture, and the distribution of listener-looking-at-speaker- gesture. Second, the continued development of an interactive humanoid agent, including generating gestural features in association with dialogue, refining dialogue generation to take into account turn-taking, distributing conversational load across speech, gesture, and facial expression, and replacing the current system of gesture input by dataglove with a stereo vision system. The results of this research will contribute to theory of the interaction between verbal and nonverbal modalities in human interaction, and aid in the development of autonomous agents and humanoid interfaces that depend on natural human communicative behavior for increased efficiency, naturalness and flexibility of human - computer interaction.","title":"STIMULATE: A Unified Framework for Multimodal Conversational Behaviors in Interactive Humanoid Agents","awardID":"9618939","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["496760"],"PO":["565227"]},"13985":{"abstract":"This project proposes an environment to provide up-to-the-minute briefings on topics of interest, linking the user into an integrated collection of related multimedia documents. On the basis of a user profile or query, the proposed system filters multimedia information to match the user interests and automatically generates a summary of the set of matching documents to provide the user with an overview of the relevant information. The system also provides a representative set of images or video that match user interests as well as hypertext links into the documents themselves. The user can follow up with multimedia queries to refine the search for related images, video, or additional articles. The research has three main components: summarization, multimedia search and manipulation, and event tracking. Results will provide advances in summarization using language generation over information extracted from multiple live sources of news, in multimedia search and classification over compressed images using visual features, and in tracking of events by detecting surface differences between documents. Research will also result in technologies to aid a user in tracking multimedia information in specific news domains, reducing the number of documents end users such as journalists must access.","title":"STIMULATE: An Environment for Illustrated Briefing and Follow-up Search Over Live Multimedia Information","awardID":"9619124","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y609","name":"CIA-STIMULATE RES PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["423553","563299","38475"],"PO":["565227"]},"19904":{"abstract":"This project integrates research and education in the design of memory hierarchies. The research augments conventional cache management techniques with more sophisticated reference history information. These techniques include programmer-supplied annotations, hardware buffers to identify and exploit locality, use of latency tolerance to decide on invalidation of cache lines, and prefetching of thread working sets. These research efforts will be integrated into the undergraduate and graduate curriculum by adding courses, organizing a working group on computer architecture, and maintaining a web site on memory hierarchy management.","title":"CAREER: Informed Caching Environment","awardID":"9702547","effectiveDate":"1997-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["555929"],"PO":["197478"]},"13249":{"abstract":"Palm Beach Community College requests support from NSF to connect the main campus and three remote campuses to the Internet. The College serves the greater Palm Beach County, Florida. It has approximately 50,000 students enrolled in a wide range of academic programs which lead to associate degrees or to a transfer to a four year institution. The college will connect to the Internet through a local Internet service provider to be selected competitively. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connections to the Internet - Palm Beach Community College","awardID":"9616884","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33527,33528,33529,33530],"PO":["121202"]},"13942":{"abstract":"Example-based machine translation (EMBT) searches a parallel corpus of pre-translated texts for the closest match to each new sentence being translated. Traditional EBMT works well only when there is a very large relevant parallel corpus (e.g. over 200 MB). The proposed investigation extends EBMT by generalizing words into semantic equivalence classes, by syntactic canonicalization of the source and target corpora, and by composing multiple partial matches, rather than selecting a single \"best\" match. These new methods will be evaluated in at least Spanish-English and Korean-English machine translation. Generalized EBMT promises to produce significantly higher accuracy translations than traditional EBMT, given the same size training corpus, or alternatively produce equivalent-quality translations given an order of magnitude smaller corpus. Combining the inherently brief development cycle of EBMT with the much smaller bilingual corpus requirement, makes generalized EBMT the future technology of choice for rapid deployment of machine translation to new, possibly exotic, language pairs.","title":"STIMULATE: Generalized Example-Based Machine Translation","awardID":"9618941","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X033","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y609","name":"CIA-STIMULATE RES PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["562859"],"PO":["565227"]},"11885":{"abstract":"This project is developing a novel approach to natural language generation, applying it to computer-aided text and speech generation for people with physical disabilities. Many people who cannot speak because of physical disability utilize text-to- speech generators as prosthetic devices. However, users of speech prostheses often have more general loss of motor control, and despite aids such as word prediction, text entry is slow and difficult. For typical users, current speech prostheses have output rates less than a tenth of the speed of normal speech. This prevents natural social conversation, since it completely disrupts the usual processes of turn-taking, and can lead to negative effects on the listener's attitude to the prosthesis user. The main focus of this research is the investigation of techniques which can improve rates sufficiently for more natural conversation to be possible, without sacrificing flexibility of content. This new approach employs a combination of a wide- coverage grammar, corpus-based word frequency data, and conversational templates. Applied to speech prosthesis, it enables the production of full sentences from minimal user input in a context-sensitive way. The approach can also be applied more generally for efficient production of formulaic text like the structured reports used widely in business and government.","title":"Language Generation for a Speech Prosthesis","awardID":"9612682","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["149035","169183"],"PO":["565227"]},"13986":{"abstract":"*** SRI is investigating the properties of human interactions with a graphical terrain model as they would occur in a crisis situation, with a particular emphasis on elucidating the process of reference through natural language and gesture. First, the research team is augmenting existing theories of discourse salience to account for how entities are introduced through the visual display in addition to speech, and extending theories of reference resolution by incorporating mutually constraining effects of gesturing and properties of linguistic referring expressions. Second, the team is studying how discourse structure is affected by the structure of the terrain model and of the task being executed, and how it can be determined through a combination of speech and gestural cues. Third, they are studying how spatial terms are used in uniquely identifying referents in a terrain model, particularly with respect to perspective- relative relational terms. The data used are generated from a set of wizard-of-oz sessions with an existing multimodal route-planning system. The results of the research are demonstrated in proof-of-concept extensions to this system, and are measured by a systematic set of evaluation methods. This research carries out the first step toward the flexible integration of speech, gesture, and visual display that will be required by the interactive, multimodal systems of the future.***","title":"STIMULATE: Multimodal Access to Spatial Data","awardID":"9619126","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y488","name":"DARPA-HUMAN LANGUATGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z964","name":"NSA-IRIS STIMULATE INITIATIVE"}}],"PIcoPI":[35519,35520],"PO":["565227"]},"13437":{"abstract":"96-17308 Irwin, Mary Jane Owens, Robert M. Penn State University CISE Research Instrumentation: Prototyping Equipment for Application Specific Architectures This research instrumentation grant enables two distinct research projects: - Low Power, High Performance Architecture Design - Massively Parallel, Application Specific Hardware System Design The first project focuses on the design of low power, high performance hardware systems for use in mobile applications. This project includes the design of CAD tools which support the design of low power systems and the study of low power module and processor architecture alternatives. A subset of the designs will be selected for fabrication, using the requested chip fabrication expenses, and evaluation, using a subset of the prototyping support equipment, to validate simulated speed and power consumption measurements. The second project focuses on the design, implementation, and use of massively parallel, application specific hardware systems for signal and image processing applications. A specific example is the MGAP-2 which is a single board coprocessor containing 49,152 fine grain processors (on 32 custom VLSI chips). Experience with the MGAP family of architectures has provided insight into derivative architectures which hold a promise of improved performance, flexibility, and\/or physical size. A subset of these derivative designs will be implemented using the requested chip fabrication expenses, prototyping support equipment, and hardware prototyping accessories to validate their benefits.","title":"CISE Research Instrumentation: Prototyping Equipment for Application Specific Architectures","awardID":"9617308","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["52185","507752"],"PO":["301532"]},"19927":{"abstract":"This project will focus on the development and evaluation of scheduling and run-time optimization techniques for supporting the parallelization of irregular scientific code with mixed granularity on distributed memory machines and workstation clusters. The main research topics will be to develop general space\/time efficient scheduling techniques and integrate memory and communication support for solving large-scale irregular problems. A software tool will be developed for evaluating the effectiveness of the proposed techniques and providing an infrastructure which can be used by other researchers. Interoperability with other tools will also be investigated if time and funds permit. The targeted applications will be mainly in irregular scientific computing such as iterative methods for nonlinear equations and sparse matrix based solvers. The educational activities will include course development for undergraduate parallel computing, with an emphasis on parallel programming and basic scientific algorithms on distributed and shared memory machines. ***","title":"CAREER: Scheduling and Run-time Support for Parallel Irregular Computations","awardID":"9702640","effectiveDate":"1997-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["486626"],"PO":["209879"]},"13921":{"abstract":"Automated systems that can interact with human users in modalities such as speech and handwriting will greatly enhance productivity and system usability. These systems will allow simple access to information and services on the internet. These capabilities are essential to other tasks, such as enabling access by handicapped users or querying an on-line maintenance manual while performing intricate repairs. A statistical model of language is a crucial component in such systems, which convert between speech or handwriting and text, and in statistical machine translation systems. Most current algorithms for language modeling exhibit an acute myopia, basing their predictions of the next word on only a few immediately preceding words. When humans are faced with a comparable task they easily outperform these models using the richer linguistic information available to them from more complete context. Researchers at CLSP propose to investigate and develop novel language modeling techniques that exploit richer contextual information. They propose to examine models that use a variety of techniques to capture syntactic dependencies through dynamic, hierarchical models of topic, and to combine the resulting models with the best current ones using the maximum entropy principle. This research will focus on improving the recognition accuracy of spontaneous human speech, but beyond that will provide insight into new information sources and techniques applicable to all applications of language modeling.","title":"STIMULATE: Exploiting Nonlocal and Syntactic Word Relationships in Language Models for Conversational Speech Recognition","awardID":"9618874","effectiveDate":"1997-03-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y026","name":"NSA-HUMAN COMM PROC & INFOR TE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z964","name":"NSA-IRIS STIMULATE INITIATIVE"}}],"PIcoPI":[35295,"445172","445173","445169"],"PO":["565227"]},"13317":{"abstract":"This project connects College of Visual Arts to the Internet over a T1 (1.544 million bits per second) line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"New Connection to the Internet","awardID":"9617012","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33726,33727],"PO":["121202"]},"13439":{"abstract":"CDA-9617310 McKinley, Philip K. Cheng, Betty H.C. Michigan State University CISE Research Instrumentation for an SMP Cluster Testbed This award provides funds for the purchase of a cluster of symmetric multiprocessors (SMPs), interconnected by a high-speed switch, to be used in parallel and distributed data processing research. The SMP cluster will be connected to existing research facilities, creating a rich research infrastructure. The primary purpose of the testbed is to support experimental studies in four projects: large-scale parallel data clustering as applied to image processing; communication algorithms and libraries for distributed parallel computing; programming support tools for specification and design, visualization, and resource allocation; and design of parallel algorithms for feature extraction and matching in large-scale, distributed, fingerprint databases. The results of this experimental research will provide a better understanding of the issues and problems that must be addressed in developing distributed parallel software for SMP clusters. Moreover, these projects will produce tangible results in the form of applications software, libraries, and tools for use by other researchers and developers. The Department of Computer Science, College of Engineering, and Michigan State University are strongly committed to the success of this project, as evidenced by significant matching funds, leveraging of existing equipment, and commitments for maintenance and support of the testbed.","title":"CISE Research Instrumentation: CISE Research Instrumentation for an SMP Cluster Testbed","awardID":"9617310","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["334363","472159","543568"],"PO":["301532"]},"11525":{"abstract":"9610082 Wang, Jing University of California, Riverside REU: Micro-Robot Soccer Playing - A R&D Project for Undergraduate Students This Research Experiences for Undergraduates (REU) Site project supports 8 students per year in programs carried out during the summers, for three years. The projects involve research and development aspects of micro-mobile robots, robots that can cooperate to \"play\" soccer against another robot team--an innovative research project promoted internationally by the IEEE Robotics and Automation Society. A robot soccer game is played on a court of 140 cm X 90 cm by two teams of autonomous mobile robots, each of which must fit in a 7.5 cm cube. A team consists of 3 to 5 robots. Participants will work on micro-robot structures, computer vision systems, onboard-robot processing units and peripherals, local motion and sensing, inter-robot communication, computer simulation, and game strategies. The program is designed to train students to become research-minded and to think independently while gaining technical and ethical experiences. Students will be exposed to cutting edge research in various technical areas including robotics, artificial intelligence, distributed computing, real-time systems, and computer organization.","title":"REU: Micro-Robot Soccer Playing - A R&D Project for Undergraduate Students","awardID":"9610082","effectiveDate":"1997-03-15","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["553703","496864"],"PO":["329035"]},"10833":{"abstract":"This award partially supports the PI, the two Co-PIs, 12 invited speakers, and 14 postdocs, graduate students, or younger faculty in attending a workshop on macromolecular modeling at the Konrad Zuse Center on the Free University campus in Berlin. The conference will run from May 6-9, 1997.The workshop will bring together researchers from Europe, Israel, and the United States, and from the fields of chemistry, biology, biophysics, mathematics, and computer science. The themes of the workshop include advanced time stepping, quantum-classical molecular simulations, free-energy and ensemble calculations, structure determination, protein folding, and electrostatics. By emphasizing the participation of young scientists along with a select group of invited speakers, the workshop will provide a forum for presentation of the most recent discoveries, and lay the groundwork for future United States-Europe collaborative projects.","title":"U.S.-German Workshop: Algorithms for Macromolecular Modeling","awardID":"9603012","effectiveDate":"1997-03-01","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["235605","433979","40869"],"PO":["290800"]},"13913":{"abstract":"The sensory modalities of sight, sound and touch are employed in combination to research a new dimension in human-machine communication. These expanded interface capabilities build on technologies established in related work, and are implemented at multiple user stations in a networked Distributed System for Collaborative Information Processing and Learning (DISCIPLE). The system provides object-oriented groupware running on Internet protocols as well as on an Asynchronous Transfer Mode intracampus network. Intelligent agents at each user location fuse the multimodal information inputs and decide actions to be taken in the collaborative environment. Established technologies for region-of-interest sensing, image understanding, face recognition and visual gesture are applied for interaction in the sight domain. Automatic speech and speaker recognition, speech synthesis, and distant-talking autodirective microphone arrays support the sound dimension. Gesture detection, position sensing, force feedback gloves and multitasking tactile software are employed for touch communication. The DISCIPLE environment of multiple collaborating users provides a comprehensive test bed for quantifying human interface designs, and for measuring the synergies that can be won from combinations of simultaneous multimodal communication. Results of this research will significantly broaden the utility of distributed networked computing for human users.","title":"STIMULATE: Synergistic Multimodal Communication in Collaborative Multiuser Environments","awardID":"9618854","effectiveDate":"1997-03-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y488","name":"DARPA-HUMAN LANGUATGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["271309","317419","409115","96302","328359"],"PO":["565227"]},"12835":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect three schools in two Texas school districts to the Internet using wireless techniques.","title":"Wireless Direct Connect","awardID":"9616004","effectiveDate":"1997-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["487316",32568],"PO":["57343"]},"21449":{"abstract":"In this exploratory research, an incremental-learning rule- based neural network is developed using bounded weight modification and structural adaptation. Data information stored as clusters can be incrementally updated by adding cluster-based processing units to the neural network. Learning theory suggests that rule-based neural networks employing the CF-based activation function require smaller sample sizes for correct generalization than standard multilayer perceptrons. Experiments for evaluating the learning capacity and sample complexity of such systems are to be conducted. This research is intended for building expert systems with the capabilities of automatic inference and life-long learning in a wide range of domains.","title":"SGER: Machine Learning by Combining Knowledge and Adaptation","awardID":"9707333","effectiveDate":"1997-03-01","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["552321"],"PO":[54008]},"11913":{"abstract":"This is a three year project to further develop a scalable, distributed multi-threaded architecture for the management, simulation and distribution of inter-domain policy-based routing information for the Internet. It follows on the success of a previous award to Merit to develop a distributed multi-threaded route server (MRS), and will develop tools and methodologies for benchmarking and evaluating the performance of the server in a variety of complex inter-domain routing environments. Merit also will work with researchers using the DARPA-funded CAIRN network and the RAISE (Rational ATM Internet Suite).","title":"Experimentation with Multi-threaded, Distributed Routing Technology in the Internet","awardID":"9612764","effectiveDate":"1997-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["89387","464147","56470"],"PO":["198445"]},"13905":{"abstract":"Tools for Lexicon Building\" project is preparing a lexical database for English called \"Framenet\" built on abundant corpus evidence and formulated on the principles of frame semantics. It will be freely available to researchers in several formats, including one that can serve as an accessory to WordNet. The primary deliverable is a highly relational \"starter\" lexicon containing 5,000 entries covering major semantic domains. Each database entry is associated with the semantic frame in which it participates, and annotated with respect to how it constellates with the elements of that frame, both morphosyntactically and semantically. Entries will also list examples taken from the corpus showing the range of the word's use, including relative frequency data. Another significant development of the project is a set of high-performance computational tools for corpus research, annotation, and analysis (some of which are being developed in collaboration with colleagues in Europe) which will be made available to the research community. The resulting facility, which incorporates both linguistic-semantic and lexicographic techniques, will be valuable to human users of both printed and online works and also to researchers exploring natural language processing, speech recognition, and the complex problems of language understanding.","title":"STIMULATE: Tools for Lexicon Building","awardID":"9618838","effectiveDate":"1997-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y939","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z747","name":"NSA-HUMAN COMMUNICATION PROC &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["353897"],"PO":["565227"]},"21507":{"abstract":"A one day meeting, called the East Coast Computer Algebra Day, will be held at Northeastern University, Boston, on Saturday, May 3, 1997. The purpose of this meeting is to stimulate interest in and enhance understanding of the technical aspects of computer algebra, by providing a way for those in the region who are active or interested in becoming more active in computer algebra to meet with each other in an inexpensive and easily accessible way. This meeting will be more informal than the annual ISSAC meetings, with ample time for unstructured interaction. Participation by the region's graduate students will be particularly encouraged through special invitation to contribute to the poster sessions, and through travel support. In addition, the offer to fund travel and hotel for graduate students makes this is an important opportunity to attract more women and minorities into the computer algebra community. For many professionals and graduate students on the East Coast, the current meeting represents the most accessible opportunity over two years to meet with a significant portion of the computer algebra community. Both ISSAC and IMACS (major computer algebra meetings) were held in Europe last year, and will be held in Hawaii in summer, 1997. Northeastern University is inside Boston itself, with excellent mass transportation, including subway connections to bus, train and plane. Three invited speakers will anchor the meeting and will help attract participants. The invited talks and poster sessions contributed by the community will cover the breadth of computer algebra: algorithms, software, and applications.","title":"East Coast Computer Algebra Day, Northeastern University, Boston, MA, May 3, l997","awardID":"9707543","effectiveDate":"1997-03-01","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["521812"],"PO":["187585"]},"13908":{"abstract":"The proposed research aims to provide the scientific and technological base for a new paradigm for human-computer interaction, one that enables the principled design of multi- modal dialogue-supporting interfaces. Two strands of previous research support this effort: research towards building novel, collaborative interfaces for automated graphic design and the development of explicit theories of collaboration. The proposed research addresses a key missing element of prior research, an understanding of how theory can be integrated with practice, so that a theoretical understanding of collaborative activity can inform in a principled manner the design of concrete software interfaces. The research comprises three activities: specialization of the general theory of collaboration to provide a framework for the design of collaborative interfaces; application of the theory to human-computer interface design leading to a set of design principles enabling system designers to construct software elements that communicate well in multiple modalities; and implementation of specific collaborative interfaces in a range of domains. The proposed research will contribute to fundamental research in communication, to the development of collaborative human-computer interface systems, and to training of undergraduates, graduate students, and post- doctoral fellows for work in multi-modal communication.","title":"STIMULATE: Human-Computer Communication and Collaboration","awardID":"9618848","effectiveDate":"1997-03-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X033","name":"DEFENSE-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X050","name":"CIA-SPEECH TEXT IMAGE & MULTIM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y023","name":"CIA-STIMULATE RES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y026","name":"NSA-HUMAN COMM PROC & INFOR TE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y488","name":"DARPA-HUMAN LANGUATGE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y491","name":"NSA-STIMULATE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y938","name":"DARPA-HUMAN COMPUTER INTERACTI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Z962","name":"ARPA-HUMAN LANGUAGE SYSTEMS"}}],"PIcoPI":["333902","379957"],"PO":["564456"]}}