{"176165":{"abstract":"Producing human speech requires the exquisite timing of multiple interacting modalities: movements of the lips, tongue, velum, and vocal folds are all precisely coordinated to give each sound its unique properties. Understanding how these different modalities interact is important to basic linguistic and cognitive science as well as to applied research areas, such as automatic speech recognition, speech therapy, and second language learning. This workshop will bring together experts in speech database construction, speech recognition, and articulatory research to explore the feasibility and desirability of developing software and a database to study the interaction of the speech articulators and how their coordination relates to the sounds produced. The workshop brings these three communities together to address (i) requirements of software for extracting and analyzing articulatory data in conjunction with the acoustic signal, and (ii) properties of the database to be constructed, namely: which utterances should be recorded; how to synchronize capture of the multiple modalities; markup, annotation, and storage of the data.<br\/><br\/><br\/>The goal of the project is to develop both software for multi-modal speech analysis and a database of synchronized multi-modal speech recordings. A critical first step is to assess which features of the database and software are needed to maximize the long-term value to the scientific community. This workshop brings together researchers from diverse backgrounds in human language and computer sciences to examine these issues, so that the database and software may facilitate studies of oral tract articulation across many disciplines, e.g. to understand the diversity of human language sounds, language acquisition and endangered languages, explore speech deficits, teach foreign language pronunciation or oral language to the profoundly deaf, improve speech recognition and synthesis software, understand how musicians shape sounds while playing wind instruments, etc.","title":"CI-P Seeing speech: A community resource for analysis of multi-modal language data","awardID":"1059266","effectiveDate":"2011-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1311","name":"LINGUISTICS"}}],"PIcoPI":["529934",472092],"PO":["565215"]},"177365":{"abstract":"The goal of this project is to create the next generation of approximate inference techniques and algorithms for probabilistic graphical models. Probabilistic graphical models are employed throughout science and engineering to solve difficult problems, including automated reasoning and decision making, computational biology and genetics, computer vision, data mining, and social network analysis. However, these real-world problems are now of such considerable size that most existing techniques are uneven in their performance in that they typically work well on some problems and not others, and often require sets of choices and customizations that must be made with little guidance or automation.<br\/><br\/>This project brings together separate but complementary streams of research to develop new algorithms to manage models containing mixtures of probabilistic and deterministic relations and mixtures of graph-based and context-sensitive relationships. This project aims to advance the state of the art of probabilistic reasoning in the presence of deterministic constraints by developing new approximate inference techniques for graphical models, for instance, by exploiting the rich structure of graphical models that is largely neglected by most sampling techniques. This project aims to create improved frameworks for probabilistic graphical models by improving both sampling and message-passing algorithms for approximate inference and developing hybrid approaches that exploit the advantages of each. The frameworks will be used to provide automated guidance for selecting parameters to optimize the inherent tradeoffs between complexity and accuracy as well as provide meaningful bounds on results and accuracy. This project will use the fruits of its research to improve education, both at the undergraduate and graduate level, for instance by developing a new undergraduate course in graphical models, and by posting course materials online. In addition, the project will post open source code on the web.","title":"RI: Medium: Approximation Algorithms for Probabilistic Graphical Models with Constraints","awardID":"1065618","effectiveDate":"2011-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[475511,"554545"],"PO":["565035"]},"176177":{"abstract":"Optical imaging is increasingly used in biomedical research for its unique advantages in terms of sensitivity, specificity, resolution, and versatility, as compared with other imaging modalities. Optical imaging spans multiple scales, from macroscopic imaging using bioluminescence and fluorescence which collect data at millimeter level to microscopic imaging at the micrometer level in both 2D and 3D spaces. Combined with high-throughput and staining techniques, optical images are often acquired in large numbers over several channels. As a result, for optical imaging methods to be of maximal use in biomedical research, computational enhancement of optical imaging has become a necessity for data management and effective information extraction.<br\/><br\/>This project initializes and adopts a multi-disciplinary approach to planning the creation of a community infrastructure for computationally enhanced optical imaging. The planning stage includes a larger workshop and smaller, targeted meetings, and discussions to solicit input from computational scientists, biomedical researchers, and engineers concerning the establishment, functionality, operational processes and user access of a computationally enhanced optical imaging infrastructure. The planned community infrastructure features a multi-institutional collaboration including hospitals, research laboratories, and universities. The infrastructure can provide students and researchers in biomedicine, mathematics, computer science, and engineering a platform for interaction and collaboration on development and use of computational techniques to model, process, quantify, and analyze various types of optical images. In addition the infrastructure offers training opportunities to students and early career researchers to apply their knowledge and skills in practice and to collaborate with investigators with different backgrounds.","title":"Collaborative Research: CI-P: Computationally-enhanced optical imaging infrastructure","awardID":"1059314","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["561951"],"PO":["564316"]},"175342":{"abstract":"Hardware components can contain malicious, illegal modifications that can siphon sensitive information to transmit to adversaries or shutdown critical operations. Such modifications to the hardware - the root of trust in computing - can compromise trustworthiness of systems. A malicious modification (backdoor) can find its way into a design through a core component implemented by a malicious insider on the team, or through a third-party intellectual property (IP). This research investigates techniques to build trustworthy hardware systems even with such untrustworthy, malicious hardware components.<br\/><br\/>A key insight used in this study is that while a large number of digital backdoor implementations are feasible they can be all classified into four simple categories with unique behavioral characteristics that can be leveraged to thwart backdoors. Digital backdoors can only be triggered in two ways: they must turn-on after certain amount of time or by specially crafted inputs. This classification is complete because time and data are the only two ways a digital system can change. After a backdoor is woken up it can impact the infested hardware component in only two ways: it can cause the hardware component to produce extraneous outputs or corrupt existing outputs. Backdoor detection techniques monitor the outputs of hardware units for anomalous behavior while protection techniques scramble inputs making it infeasible for the backdoor to be triggered at runtime. Hardening both the inputs and outputs of a hardware module against backdoors provides comprehensive protection and provides a strong basis, for the first time, to certify digital hardware to be free of backdoors. Such certification can significantly enhance the state of trustworthy computing","title":"CAREER: Trustworthy Hardware from Untrustworthy Components","awardID":"1054844","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["541924"],"PO":["366560"]},"177267":{"abstract":"A wealth of data about individuals is constantly accumulating in various databases in the form of medical records, social network graphs, mobility traces in cellular networks, search logs, and movie ratings, to name only a few. There are many valuable uses for such datasets, but it is difficult to realize these uses while protecting privacy. Even when data collectors try to protect the privacy of their customers by releasing anonymized or aggregated data, this data often reveals much more information than intended. To reliably prevent such privacy violations, we need to replace the current ad-hoc solutions with a principled data release mechanism that offers strong, provable privacy guarantees. Recent research on DIFFERENTIAL PRIVACY has brought us a big step closer to achieving this goal. Differential privacy allows us to reason formally about what an adversary could learn from released data, while avoiding the need for many assumptions (e.g. about what an adversary might already know), the failure of which have been the cause of privacy violations in the past. However, despite its great promise, differential privacy is still rarely used in practice. Proving that a given computation can be performed in a differentially private way requires substantial manual effort by experts in the field, which prevents it from scaling in practice. <br\/><br\/>This project aims to put differential privacy to work---to build a system that supports differentially private data analysis, can be used by the average programmer, and is general enough to be used in a wide variety of applications. Such a system could be used pervasively and make strong privacy guarantees a standard feature wherever sensitive data is being released or analyzed. Specific contributions will include ENRICHING THE FUNDAMENTAL MODEL OF DIFFERENTIAL PRIVACY to address practical issues such as data with inherent correlations, increased accuracy, privacy of functions, or privacy for streaming data; DEVELOPING A DIFFERENTIALLY PRIVATE PROGRAMMING LANGUAGE, along with a compiler that can automatically prove programs in this language to be differentially private, and a runtime system that is hardened against side-channel attacks; and SHOWING HOW TO APPLY DIFFERENTIAL PRIVACY IN A DISTRIBUTED SETTING in which the private data is spread across many databases in different administrative domains, with possible overlaps, heterogeneous schemata, and different expectations of privacy. The long-term goal is to combine ideas from differential privacy, programming languages, and distributed systems to make data analysis techniques with strong, provable privacy guarantees practical for general use. The themes of differential privacy are also being integrated into Penn's new undergraduate curriculum on Market and Social Systems Engineering.","title":"TC: Medium: Putting Differential Privacy To Work","awardID":"1065060","effectiveDate":"2011-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["563479","475279"],"PO":["564388"]},"176178":{"abstract":"Optical imaging is increasingly used in biomedical research for its unique advantages in terms of sensitivity, specificity, resolution, and versatility, as compared with other imaging modalities. Optical imaging spans multiple scales, from macroscopic imaging using bioluminescence and fluorescence which collect data at millimeter level to microscopic imaging at the micrometer level in both 2D and 3D spaces. Combined with high-throughput and staining techniques, optical images are often acquired in large numbers over several channels. As a result, for optical imaging methods to be of maximal use in biomedical research, computational enhancement of optical imaging has become a necessity for data management and effective information extraction.<br\/><br\/>This project initializes and adopts a multi-disciplinary approach to planning the creation of a community infrastructure for computationally enhanced optical imaging. The planning stage includes a larger workshop and smaller, targeted meetings, and discussions to solicit input from computational scientists, biomedical researchers, and engineers concerning the establishment, functionality, operational processes and user access of a computationally enhanced optical imaging infrastructure. The planned community infrastructure features a multi-institutional collaboration including hospitals, research laboratories, and universities. The infrastructure can provide students and researchers in biomedicine, mathematics, computer science, and engineering a platform for interaction and collaboration on development and use of computational techniques to model, process, quantify, and analyze various types of optical images. In addition the infrastructure offers training opportunities to students and early career researchers to apply their knowledge and skills in practice and to collaborate with investigators with different backgrounds.","title":"Collaborative Research: CI-P: Computationally-enhanced optical imaging infrastructure","awardID":"1059316","effectiveDate":"2011-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["506512",472129],"PO":["564316"]},"175376":{"abstract":"This CAREER project studies the theoretical properties underlying social networks. The focus of the research is two-fold: first, models are created to explain the formation and evolution of social networks. Particular emphasis is placed on the co-evolution of social networks and social behaviors such as smoking or the choice of profession. Next, these models are leveraged to help social planners build systems for networked societies that, say, maximize the spread of a particular social norm or generate large revenue from the sale of a socially-enabled product. The proposed modeling techniques combine economic theory and stochastic processes with standard graph theory in order to generate models that capture both the self-motivated interests of individuals in social networks as well as the randomness inherent in social interactions. The induced social planning problems are often computationally-intractable, so the proposed techniques also incorporate approximation algorithms and average-case analysis in an attempt to design practical and efficient systems.<br\/><br\/>The broader impact of the proposed research will be to increase awareness and understanding of the power of social networks, enabling more effective and efficient design of systems that operate in the context of social networks. Such advances can be used to create and facilitate social networking platforms by guiding the network evolution, to promote socially-beneficial behaviors such as anti-smoking norms or charitable contributions, and to help stimulate the economy by increasing revenues of socially-oriented products. The PI will also pursue several educational and outreach efforts, focusing on individuals outside standard academic institutions. The PI will reach out to high school students and working adults through popular science articles and Science Cafes. Additionally, the PI will disseminate knowledge to developing nations such as Iran, the West Bank, and Uganda through onsite summer schools in an effort to promote the science and education that are fundamental and essential for those nations' futures.","title":"CAREER: Networked Game Theory and Mechanism Design","awardID":"1055020","effectiveDate":"2011-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["516987","516986"],"PO":["565251"]},"182361":{"abstract":"This conference is intended to jump-start a new field: Comparative Decision Making Studies (CDMS). CDMS will focus on the many ways that social, economic and computational decision making studies can leverage methods and results across disciplinary boundaries, especially the ways computational thinking can change the types of questions considered by social and economic scientists.<br\/><br\/>The conference will accomplish three goals, by facilitating a discussion among scholars from various academic backgrounds and individuals applying decision-making in society. First, we will encourage transplanting techniques and insights across research programs and traditions, highlighting the similarities and differences among established approaches. Second, we will identify the most important current issues in decision making research and discuss how collaboration across disciplines and between academia and the consulting industry can facilitate the emergence of important new theories, empirical methods, and applications. Finally, we will justify and promote the CDM approach in the scientific community and consulting industry.","title":"ICES: Comparative Decision Making Studies Conference","awardID":"1122298","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":[488552,488553],"PO":["565251"]},"177258":{"abstract":"The necessary science and technology are developed to demonstrate sustained dynamic soaring of an unmanned aerial vehicle. This has four primary components. First, the team develops novel, real-time solutions specific to the dynamic soaring motion planning problem to enable perpetual flight. Second, they develop compact representations for estimating wind field in real time. These measurements serve as input to the motion planner to optimize energy that is recovered from a given soaring cycle. Third, they develop a novel airframe whose design is tightly coupled with motion planning algorithm development. Finally, a significant technical evaluation is performed which culminates in a demonstration of sustained low-altitude dynamic soaring.<br\/><br\/>The realization of unmanned aerial vehicles capable of staying aloft is transformative for many fields, e.g., as a low altitude and cost alternative to conventional satellite systems. Such pseudo-satellites serve as a sensor network and provide surveillance data, weather monitoring, and act as relay nodes in telecommunications networks. They are put into place, recovered, and maintained without the significant expense and failure risk associated with a space launch. A dynamically soaring unmanned aerial vehicle is ideal for hurricane observation since the craft is designed with the required strength and the associated wind gradients provide sufficient aircraft endurance for the life of the storm. One major outreach effort is the Robotics and Aerospace Camp for a group of 20-30 eighth and ninth grade students; this is part of a year round academy to promote academic achievement and college placement for economically and academically challenged middle level and high school students.","title":"RI: Medium: Collaborative Research: Towards Perpetual Flight of a Gliding Unmanned Aerial Vehicle in the Jet Stream","awardID":"1065024","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[475209],"PO":["564069"]},"175356":{"abstract":"This project investigates techniques for extracting and searching Web-embedded structured datasets. For example, a manufacturer's site may contain technical product data, and a governmental site may contain economic statistics. Unfortunately, such data can be hard to isolate from surrounding text, and difficult to find using existing search engines that focus exclusively on documents. The approach for the extraction step is to use current incomplete datasets to induce a large \"portfolio\" of possible extractors, apply all of them to crawled Web content, then test which are most successful. The approach for the search step is to examine user query logs to find common patterns that describe the relationship between topic words and words that describe the dataset's structure; e.g., \"endangered species near the Mississippi River\" is a prototype for a many-to-many geographic relationship. The central goal of this work is to eventually construct a working search engine for the structured-data component of the Web.<br\/><br\/>The success of this project is likely to increase access to structured datasets for a very broad population of users. The project will also yield a large amount of novel extracted data relevant for scientific research, plus useful tools and query logs. To accompany the research program, this project involves an educational plan that includes revised undergraduate course material, development of online educational material surrounding the datasets and tools, and a course on Web topics taught to a local rural high school. All project results will be distributed at the project's Web site (http:\/\/www.eecs.umich.edu\/~michjc\/structuredweb\/index.html).","title":"CAREER: Building and Searching a Structured Web Database","awardID":"1054913","effectiveDate":"2011-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["558950"],"PO":["563751"]},"175257":{"abstract":"This project will develop new combinatorial and probabilistic algorithms that will unravel the interwoven large-scale genomic changes that have occurred across species in an evolutionary context. The main research thrust is to develop new ancestral genome reconstruction algorithms that handle rearrangements, duplications, and large insertions and deletions at different resolutions in a single unified framework. These methods will be applied to the large number of whole-genome sequence data that have become available to elucidate detailed history of large-scale genomic operations in mammalian genomes. With the reconstructed history, scientists will be able to explain the large-scale genomic changes and assess their phenotypic impact on any lineage, including the human lineage. <br\/><br\/>The PI considers the problem of ancestral genomes using a parsimony principle based on breakpoint graphs that are consistent with current genomes. For considering more than two genomes, these problems are nearly all computationally intractable. The approach focuses on building better synteny blocks between genomes and using these blocks in a hierarchical method to develop new reconstruction algorithms that are then refined to smaller blocks and dealing with incomplete lineage sorting. <br\/><br\/>These new software tools and resources will be extremely useful to shed new light on the extraordinary diversity of mammalian forms and capabilities. In addition, the insights from this project will be applied to improve genome assembly methodologies based on next-generation high-throughput DNA sequencing reads. The models and algorithms will also be used to investigate specific genomic regions influenced by large-scale genomic changes, such as complex gene clusters and regions that harbor genome instability in cancer genomes. The project will develop open-source software tools for comparative genomics research, making them accessible to other scientists around the world. In addition, the outcome of the project will be disseminated through online website. Visualization tools from the research will provide scientific education on genome evolution to increase the accessibility of scientific results to the general public.<br\/><br\/>As part of his CAREER plan, the education components are closely integrated with the research program. The educational objectives include the development of new bioinformatics courses; training graduate students with interdisciplinary expertise necessary for the post-genomic era and providing them with meaningful international research experience through collaboration; getting undergraduate students involved in research projects; and participating in the G.A.M.E.S. camp at the University of Illinois to inspire pre-college girls to develop careers in science and engineering.","title":"CAREER: Computational Methods for Analyzing Large-Scale Genomic Changes in Mammalian Genomes","awardID":"1054309","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["25139"],"PO":["565136"]},"182990":{"abstract":"This project supports the travel of US doctoral student researchers to the premier international conference on autonomous agents and multi-agent systems and their participation in the Doctoral Mentoring Consortium held in conjunction with it. The International Joint Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2011) will be held in Taipei, Taiwan, May 2-6, 2011. All students awarded stipends will participate in a Doctoral Mentoring Consortium in which they will present their research to other student researchers and receive in-depth feedback from a group of senior researchers. Travel stipends will be awarded through an application process that requires that students be full-time students and that they be explicitly listed as an author of an accepted paper. The AAMAS conference provides these students with a platform to present their research results and allows them to participate in valuable discussions that will likely shape the future of this critically important field. The technical program is complemented with an array of workshops, tutorials and other events. The wide variety and significance of the topics typically presented at AAMAS, in both the technical program and the workshop program, provides opportunities for students to share, exchange and learn from each other.","title":"Doctoral Mentoring Consortium at the International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2011)","awardID":"1125979","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562335"],"PO":["491702"]},"175665":{"abstract":"The PI will extend extensive studies in numerical linear algebra to the numerical multilinear algebra setting, which complements and enriches the underlying linear framework. The PI's prior work has laid foundations for this new subject via (1) mapping the boundary between the possible and impossible, the computable and non-computable; and (2) extending several matrix notions to tensors (e.g. eigenvalues, singular values, Schatten, Ky Fan norms, Perron-Frobeniuis theorem). This project takes the next step -- developing the requisite algorithms for problems that sit within these boundaries. While almost all 'algorithms' currently in use for tensor problems lack correctness and convergence guarantees, the ones developed for this project strive to be algorithms in the true sense of the word, i.e. meeting the basic requirement of convergence to a true solution and not just a stationary or fixed point. This is in general not possible but the PI will (i) identify large classes of interesting cases for which efficient, provably convergent algorithms exist; and (ii) exploit multilinearity and tap the existing rich collection of linear techniques. These design principles and goals will be applied to algorithmic development of all following problems: (a) Low rank tensor approximations; (b) eigenvalues and singular values for tensors; (c) systems of multilinear equations in the exact and least-squares sense. The PI will also demonstrate the utility of numerical multilinear algebra by proposing several new tools in telecommunications, bioinformatics, and neuroimaging.<br\/><br\/>Almost all engineering, scientific, and statistical computing problems may ultimately be reduced to a handful of standard problems in linear algebra. <br\/>Therefore one may argue that computational linear algebra is the workhorse of computations in science and engineering. This project is about expanding this fundamental arsenal of tools by going from \"linear\" to \"multilinear\". To achieve this, one must first realize that while there are natural extensions of the aforementioned handful of linear problems, there are also subtle difficulties and even impossibilities associated with these multilinear analogues. The crux of the project is to carve out a substantial tractable subclass of problems that are nevertheless still useful in applications. The project would also examine three concrete applications to brain imaging, cellular phone communication, and analytical chemistry.","title":"CAREER: Numerical Multilinear Algebra and Its Applications - From Matrices to Tensors","awardID":"1057064","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["513676"],"PO":["565027"]},"175379":{"abstract":"This project develops the theory and algorithms for the next generation of statistical motion models and their applications in Bayesian motion synthesis. Thus far, one of the most effective ways to model human movement is to construct statistical motion models from prerecorded motion data. While the promise of learning from motion data is unlimited, current statistical motion modeling techniques suffer from four major limitations. Firstly, they lack scalability and ability to model large and heterogeneous datasets. Secondly, they do not capture environmental contact information embedded in prerecorded motion data. Thirdly, they are mainly focused on modeling spatial-temporal patterns within a small temporal window rather than the global motion structures of human actions and thus face great risk of destroying global motion structures in motion generalization. Lastly and most importantly, they do not consider dynamics that cause the motion. This project investigates a new generation of statistical motion models that address these four challenges. The project also develops new Bayesian motion synthesis algorithms that leverage the proposed generative models in graphics and vision applications. In addition, the research produces new animation modeling systems for novices, new performance interfaces for full-body motion control, and new technologies for video-based motion capture. In the project, the PI makes special efforts to recruit students from under-represented groups, to integrate the research into existing and new courses, and to use a high school competition as a channel for attracting more young students to pursue careers in computer science.","title":"CAREER: Theory and Practice of Bayesian Motion Synthesis","awardID":"1055046","effectiveDate":"2011-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["475404"],"PO":["564316"]},"176149":{"abstract":"Behavioral biometrics, such as gait, walking trajectory, and speech rhythm, are advantageous in their tolerance of low sensory resolution, long sensing distance, and poor environmental conditions. Many applications in security and tele-healthcare require tracking and identification of individuals based on their behavioral traits. Conventional approaches typically use video cameras, which could incur high data throughput and computational costs.<br\/>This project aims to develop a research infrastructure that enables tracking and identification of individuals? behavioral biometrics through thermal, pressure, photonic, acoustic, fiber-optic, and laser sensors. Besides low cost, those sensors can produce sparse behavioral biometric data that can be analyzed quickly. To achieve this goal, we will develop: (1) a set of tools for novel sampling geometries, cognitive sensing protocols, biometric feature modeling and distributed information aggregation; (2) a multi-agent architecture for system operation and adaptation that enables heterogeneous sensors to achieve consensus in behavior analysis; and (3) a set of programming and evaluation tools for system integration and improvement.<br\/>The developed computing research infrastructure will enable research activities about behavioral biometrics based on low-cost, low-power, distributed platforms with a variety of sensing modalities. The enabled distributed behavioral biometrics intelligence has great potential to cope with the technical challenges in behavioral biometrics caused by long distances and crowded scenes. The developed education materials will benefit a number of computing and engineering courses for the training of highly skilled workforce on surveillance and security monitoring. The outreach programs include summer student training, faculty workshops, and school visits.","title":"II-NEW: Cognitive Sensing Research Infrastructure for Distributed Behavioral Biometrics","awardID":"1059212","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["513708",472051],"PO":["563661"]},"177249":{"abstract":"Multi-core computing, where several processor cores are combined together into a single chip, has become<br\/>the standard in computer processor design. In effect, each chip has become a small parallel computer<br\/>and leveraging the processing power of parallel computing efficiently is a difficult challenge. Parallel<br\/>computing attempts to accelerate computational tasks by separating the work into segments that can be<br\/>calculated independently using different processors. Unfortunately, these processors need to communicate<br\/>with each other to complete the computational tasks correctly. This communication and the resulting<br\/>access to data are major limiting factors to how much a computational task can be accelerated with<br\/>multiple processors.<br\/>This research proposes a cooperatively designed system that considers the method for storing and accessing<br\/>data (memory), the method for communication between processors (network), the software that<br\/>controls how programs are executed (operating system), and the design of the program executables themselves<br\/>(compilation) to maximize the program execution speed. The key observation is that while each<br\/>component of the system can be improved independently, each component contains information that can<br\/>help the other components to realize even greater benefits. Just as a transportation infrastructure requires<br\/>information about traffic patterns; for example, if traffic patterns were ignored and if highways connect<br\/>rural areas and only side streets connect major cities, traffic would reach a standstill while highways are<br\/>inefficiently used. Likewise, the communication network cannot be efficiently designed without information<br\/>from programs on communication patterns.<br\/>The outcomes from this project will be the development of ?cross-layer? design concepts for multi-core<br\/>computer architectures that will result in performance improvements and effective use of more processor<br\/>cores within a single chip.","title":"SHF: Medium: Compiler and Chip Multiprocessor Co-Design for Scalable Efficient Data Access and Communication","awardID":"1064976","effectiveDate":"2011-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["533851","543497",475186],"PO":["366560"]},"175556":{"abstract":"Questions of neural synchrony -- correlations in cell-to-cell spiking -- have <br\/>driven decades of research. However, recent technological and theoretical <br\/>advances have thrust open two lines of inquiry. The first is understanding <br\/>the combinatorial scale of the correlations that occur in natural and model <br\/>neural networks. It is well known that describing neural activity requires <br\/>pairwise statistical interactions -- but we do not yet understand when network <br\/>dynamics produce patterns of correlations that extend beyond this pairwise <br\/>description, when the pairwise descriptions will be complete, and what the <br\/>overall implications are for neural coding and signal processing. <br\/>The Principal Investigator will address these questions for a set of \"canonical\" <br\/>neural circuits, or motifs, and will build toward networks of gradually <br\/>increasing complexity in their dynamics and architecture. Further, extending <br\/>beyond intrinsic network dynamics, he will ask how these basic network properties <br\/>determine the ways in which patterns of synchrony can be controlled by external stimulation. <br\/>Answering these complementary questions requires synergies between methods of <br\/>stochastic processes, dynamical systems, and statistical inference.<br\/><br\/>How do how networked neurons work together to produce the brain's astonishing <br\/>computational ability? Such coordinated neural dynamics are characterized by <br\/>synchrony among different neurons. One prospect is that this coordinated <br\/>activity opens new channels for signal processing: there is a combinatorial <br\/>explosion in the number of possible multi-neuron patterns that can occur in <br\/>increasingly large networks. However, we only have the first hints at whether <br\/>and when these patterns systematically occur in the brain's networks, and what <br\/>information they might (or might not) carry. Shea-Brown will study the <br\/>fundamental properties of neural dynamics, connectivity, and noise that <br\/>determine the level and impact of multi-neuron synchrony in a series of <br\/>networks of gradually increasing complexity. He will use <br\/>interdisciplinary tools from both deterministic and statistical branches of <br\/>applied mathematics to understand how levels of synchrony are created, <br\/>destroyed, and manipulated by external stimulation. These findings will <br\/>contribute to experimental and clinical neuroscience: working in <br\/>collaboration with experimentalists, the investigator will make predictions for light stimuli <br\/>that evoke higher-order correlations in the retina, and for electrical stimuli <br\/>that suppress pathological synchrony in neurodegenerative disease. These <br\/>questions, as part of theoretical neuroscience -- an emerging field that is <br\/>rich in open questions and highly varied interdisciplinary techniques -- <br\/>present a strong opportunity for recruiting, engaging, and training <br\/>undergraduates in the mathematical sciences. Shea-Brown will direct this opportunity <br\/>toward the underrepresented groups from which new scholars are most urgently <br\/>needed, through an integrated four-year research pathway for undergraduates. <br\/>This will be developed together with newly designed units in the computational <br\/>science and mathematical biology courses taught by the investigator.","title":"CAREER: Bridging dynamical and statistical models of neural circuits -- a mechanistic approach to multi-spike synchrony","awardID":"1056125","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7334","name":"MATHEMATICAL BIOLOGY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["513094"],"PO":["230845"]},"183433":{"abstract":"The purpose of this RAPID proposal is to investigate questions surrounding the use of social media during the current political crisis in Egypt. From a research perspective, the case of Egypt is unique in the unprecedented scale, role, and rapidity in which media is being used in organizing and reporting on events. This project will develop software that will perform ongoing data collection of information about the Egyptian uprising and use a combination of quantitative and qualitative techniques to analyze the data. Because events in Egypt are transpiring rapidly, it is imperative to capture data relevant to current events immediately. <br\/><br\/>Though studies have examined social media use in crisis settings, this research setting is distinctive in several ways. First, the scale and rapidity of mobilization in the current Egyptian setting in conjunction with the role of social media is unique and may be indicative of the future role of social media. Second, most studies focus on a single type of media, such as blogs or Internet forums, and this study will examine different social media and will try to understand what function each had in the current setting. Third, it will study how information was globally communicated despite the fact that the Egyptian government installed a \"virtual curfew\" on the Internet and satellite phones. This research will focus not only on technical features of the applications but also on social and cultural issues involved in social media use in crisis settings. <br\/><br\/>Broader Impacts. By understanding how social media is used for mobilization and communication during a major disruption in society, the project will contribute knowledge about the role and potential of social media. By examining how such information can spread outside of a \"blocked\" society, it has strong implications for understanding the role of social media in promoting democratic voices in a society. Though the proposed data collection infrastructure is geared towards events related to Egypt it can be applied to numerous other countries and events, ranging from political crises to natural disasters, to national elections, and more. The project will provide infrastructure that will allow people from all over the world to view the data, gain firsthand reports on what is happening in another country and provide commentary and discussion. It will be a valuable teaching device to expose young people to current events in other countries.","title":"RAPID: Citizen Use of Social Media in the Egyptian Uprising","awardID":"1128008","effectiveDate":"2011-03-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["518420"],"PO":["564456"]},"181013":{"abstract":"This award provides support to students and other young researchers for travel and accommodation to the Machine Learning Summer School 2011 to be held in Purdue University, June 13-24, 2011. World class speakers from academia and industry are delivering tutorial style lectures over a two week period, and these presentations are being recorded and made available over the Internet. The Summer School is suitable for participants with different backgrounds. Individuals without previous knowledge are able to learn more about the theory and practice of Machine Learning, while those wishing to broaden their expertise in this area find the advanced courses particularly useful. The participating students are able to network with international experts.","title":"The 2011 Machine Learning Summer School at Purdue University","awardID":"1115185","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["541857","548255",485110,"559403",485112],"PO":["562760"]},"177318":{"abstract":"Over the last few decades, integrated circuits (IC) have progressed from being dominated with nonlinear circuits to being dominated with linear networks because of the scaling of transistors and interconnects in ICs. However, the prevailing circuit simulation paradigm is still heavily dominated by SPICE (Simulation Program with Integrated Circuit Emphasis), which is very capable of solving nonlinear functions for the simulation of active devices, but has difficulties in keeping up with the growth in the linear network because of (1) the sheer volume of interconnects--every device added has to be connected, (2) the growing sophistication of the models describing the interconnects--every added interconnect translates into many circuit parameters, i.e., resistances, capacitances, and inductances, and (3) the highly irregular large-scale system matrices arising from the extraction of circuit parameters for a linear network from the layout. The highly irregular large-scale system matrices arising from such models make it unlikely for the existing circuit simulator to achieve the optimal complexity (i.e., linear complexity in time and space) in simulation.<br\/><br\/>This proposal seeks to develop a transformative circuit simulation paradigm that offers not only unparalleled efficiency but also unprecedented accuracy, overcoming the shortcomings of the existing simulation frameworks. Guided by physics-based first principles, the PIs propose to bypass the step of the extraction of the linear network. Going directly from layout to simulation, such an extraction-free methodology allows for a computation-free decomposition of the system matrix, thus enabling a circuit simulator of linear complexity or optimal complexity in time and space.<br\/>Further speedup is achieved with an embarrassingly parallel implementation of the transformative circuit simulator on a many-core node or a cluster of such nodes. This project will deliver a public-domain circuit simulator that can fully account for the interactions between nonlinear devices, substrate, on-die interconnects, and package; thereby contributing to the continued scaling and integration of circuits crosscutting digital, analog, and RF technologies across full electromagnetic spectrum for years to come.<br\/><br\/><br\/>The availability of the transformative circuit simulator in the public domain will enrich the learning experience of future circuit designers progressing through the pipeline of higher education. Moreover, in partnership with the diversity programs at Purdue, summer camp projects that embed essential concepts related to circuits, electromagnetics, and computing will be developed to broaden the participation of underrepresented minority and women students in computing and engineering. Through the active involvement of undergraduate and graduate students in the project and the integration of research results into the undergraduate graduate curricula, students will be trained with a broad range of skills, in areas such as circuits, electromagnetics, numerical linear algebra, and many-core computing.","title":"SHF: Medium: Say \"No\" to Extraction--A Transformative Circuit Simulation Paradigm Guided by First Principles","awardID":"1065318","effectiveDate":"2011-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[475378,"550994",475380],"PO":["562984"]},"184424":{"abstract":"This project supports travel expenses for participants at the workshop on advances in language and vision. In the past few years, great progress has been made in the fields of language and computer vision in developing technologies of extracting semantic content from text and imagery respectively. Each field has desires to adapt methods from the other, but often looking to the past literature rather than the current state of the art. This workshop makes significant scientific progress in multimodal representations and methods by bringing together the top researchers in both fields. The well organized brainstorming and discussion sessions contribute new ideas to this emerging area. The outcome of the workshop provides some guidelines for targeted research in this interdisciplinary area, including anticipated fundamental scientific advances, possible large-scale challenge problems, the needs and prospects for available datasets, and connections to significant applications and their associated long-term economic impact and other societal benefits.","title":"Support for Workshop on Advances in Language and Vision","awardID":"1134072","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["515704"],"PO":["564316"]},"183357":{"abstract":"This award supports participants to EAAI-11, The Second Symposium on Educational Advances in Artificial Intelligence. EAAI-11 will be collocated with the Twenty-fifth AAAI Conference on Artificial Intelligence (AAAI-11), to be held August 7-11, in San Francisco. EAAI-11 provides a venue for researchers and educators to discuss pedagogical issues and share resources related to teaching artificial intelligence (AI) and using AI in education across a variety of curricular levels (K-12 through postgraduate training), with a natural emphasis on undergraduate and graduate teaching and learning. The EAAI symposium will seek and disseminate contributions, such as model assignments, syllabi, projects, and ready-to-adopt materials for teaching AI, address how to more effectively teach AI in multi-disciplinary contexts involving subjects like biology or economics, and how themes from AI can be used generally to enhance education and engagement of students in Computer Science and STEM disciplines. EAAI will include a session \"How AI and AI education can improve CS education and outreach.\"","title":"EAAI-11: The Second Symposium on Educational Advances in Artificial Intelligence","awardID":"1127650","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["558297",491701],"PO":[491702]},"175339":{"abstract":"Heterogeneous computer architectures, especially those that combine CPUs and GPUs, have become widespread in both desktop and mobile platforms. These architectures increase the complexity of architecture designs and the severity of resource management problems. To increase energy efficiency and performance in these architectures, this CAREER project investigates new resource management system that combines static and dynamic analysis. It uses analytical and statistical models to predict application performance and energy consumption behaviors. These models will be also used for exploiting heterogeneous architecture design choices. The proposed research brings together cross-disciplinary techniques from architecture, compiler, and power measurement systems, and researchers from academia and industry. The results of this research can be directly used for designing the next generations of heterogeneous architectures and software systems. The PI plans to collaborate with industrial partners to ensure a direct path for technology transfer.<br\/><br\/>In this project, the investigator plans to develop a new undergraduate course and a new simple GPU simulator framework for undergraduate students and graduate students. The proposed simulator will be available to a wide community of researchers.","title":"CAREER: CPU and GPU Based Heterogeneous Architecture Design and Managements","awardID":"1054830","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["556658"],"PO":["565272"]},"176109":{"abstract":"This award focuses on creating a comprehensive processing and design infrastructure to enable and accelerate research on robust VLSI technology using Carbon Nanotube Field-Effect Transistors (CNFETs) for next generation energy-efficient computing systems. CNFETs represent a significant departure from traditional silicon technologies, and can potentially enable computing systems with more than an order of magnitude better energy efficiency compared to silicon-CMOS. Moreover, a unique aspect of CNFET technology enables massive monolithic three-dimensional integration. However, several fundamental challenges must be overcome before such benefits can be achieved. This requires significant inventions in inter-disciplinary fields of devices, processing, VLSI design and CAD, and integrated computing system design. Hence, a significant amount of infrastructure is required, where robust and repeatable processing and design flows are established (unlike stand-alone prototypes). Such a comprehensive infrastructure for CNFET VLSI, created in this project, will enable easy adaptability and integration of new inventions. This will help build a research community around a common CNFET VLSI processing and design platform.<br\/>It will also provide unique opportunities for exploring new research frontiers, and solid training of the next generation of researchers and practitioners.","title":"II-NEW: Robust Carbon Nanotube Technology for Energy-Efficient Computing Systems: A Processing and Design Infrastructure for Emerging Nanotechnologies","awardID":"1059020","effectiveDate":"2011-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["542319","549505","559405"],"PO":["565272"]},"176901":{"abstract":"This funding renews a CISE Research Experience for Undergraduates site focused on computational science at the University of Houston. Each year, ten students are to be recruited from institutions that offer limited research opportunities. The program emphasizes steering non-traditional students into research, reinforcing their interest in computer science, and providing professional development opportunities for the students. Research in these areas of national importance is overseen by an interdisciplinary team of faculty mentors and is reinforced through site visits to cutting-edge research laboratories in the local area. <br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. <br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups and from institutions with limited research environments. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Undergraduate Research Experience in Computational Science","awardID":"1062954","effectiveDate":"2011-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["528483","528484"],"PO":["564181"]},"180653":{"abstract":"The International Symposium on Performance Analysis of Systems and Software (ISPASS) is a premier forum for sharing advanced academic and industrial research focused on performance analysis of computer systems and software, and brings together researchers from the computer architecture, systems and applications software, and performance analysis fields. ISPASS seeks to increase student participation in symposium and the field. The proposed funding would support the travel of eligible US students to the symposium.","title":"Travel Support for the 2011 IEEE International Symposium on Performance Analysis of Systems and Software","awardID":"1112772","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556789"],"PO":["565272"]},"184119":{"abstract":"This proposal requests NSF support to broaden participation in The International Symposium on Code Generation and Optimization (CGO) to be held in Chamonix, France April 2-6, 2011. The International Symposium on Code Generation and Optimization (CGO) is the premier venue to bring together researchers and practitioners working on bridging the gap between software abstraction and hardware execution. <br\/>This proposal aims to increase the impact of this conference by enabling participation by studentsfrom US-based institutions for whom travel support would otherwise preclude their attendance.","title":"Travel Grant for Students to Attend The Interanational Symposium on Code Generation and Optimization (CGO)","awardID":"1131946","effectiveDate":"2011-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["550505"],"PO":["565272"]},"180654":{"abstract":"The International Symposium on Computer Architecture (ISCA) is a premier forum for presenting, discussing and debating new and innovative architectural ideas and techniques for advanced computing and communication systems. This symposium brings together researchers in fields related to processor architecture, compilers, chips and systems, for technical exchange on current areas of architectural challenge. This proposal aims to support this highly regarded conference by obtaining travel support for students in order to defray the costs of attending and participating in the ISCA conference June 4-8, 2011 in San Jose, California as part of the Federated Computing Research Conference (FCRC). <br\/>Up to 30 U.S.-based students (averaging $500 each) to be supported by the award. The majority of the awards to be granted to Ph.D. students. Priority will be granted to students who have authored papers accepted for presentation at the conference or its joint workshops, in particular those students without existing travel support.","title":"Student Travel Support for the 2011 International Symposium on Computer Architecture (ISCA-38)","awardID":"1112774","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556789"],"PO":["565272"]},"180302":{"abstract":"This award assists approximately 20 US-based graduate students to travel and attend the Eighth Symposium on Networked Systems Design and Implementation (NSDI-2011), which is to be held in Boston, MA on March 30, 2011. This support enables the participation of students who would otherwise be unable to attend NSDI-2011.","title":"Student Travel Support for the Eighth Symposium on Networked Systems Design and Implementation (NSDI)","awardID":"1110708","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["548263"],"PO":["493916"]},"175309":{"abstract":"Human computation is a growing research area that studies how to harness the combined power of humans and computers to solve problems that would be impossible for either to solve alone. The goal of this project is to introduce online education as a new vehicle and incentive mechanism for human computation. The central hypothesis is that problems that are difficult for computers can be transformed into tasks that are also educational, so that students solve the problems at the same time as they learn. With millions of people learning online, education could provide a powerful motivator for participation in distributed human computation. This project will demonstrate that education allows significantly more complex problems to be attacked with human computation than has been possible with previous paradigms for human computation. The project will also explore whether human computation can be a motivator for education. <br\/><br\/>The hypothesis will be tested on a new large-scale system called Duolingo, a free language-learning site in which students will solve problems that computers cannot yet solve. The site will present students with many types of activities, each exercising a different aspect of the foreign language while simultaneously channeling the students to perform a different task that artificial intelligence cannot yet accomplish. Some of the tasks that students will perform include: language translation, audio transcription, and image tagging. <br\/><br\/>Broader impacts. The project will provide a free language-learning site expected to help millions of users learn a foreign language. It will also provide large quantities of useful data in many languages to train more accurate machine learning algorithms for language translation, voice recognition, and computer vision. Duolingo will also serve as a platform for performing large-scale experiments on how people learn languages online. In addition, undergraduate and graduate classes will be improved and developed using this research.","title":"CAREER: Online Education as a Vehicle for Human Computation","awardID":"1054630","effectiveDate":"2011-03-15","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["530563"],"PO":["564456"]},"182537":{"abstract":"This project proposes to organize a series of two international workshopsthat will bring together a relatively small (approximately 20) but focused and diverse group of academic researchers from the US and India to discuss, develop, and propose collaborative research projects in the area of pervasive computing and communications. A major goal is to identify and develop bi-lateral collaborative research projects, and then submit to the appropriate funding agencies in the US and India. The first workshop will be organized in New Delhi, India on March 10-11, 2011 and the second workshop will be held in Washington, DC late June or early July, 2011.<br\/><br\/>The two workshops and the collaborative US-India research they will enable, will serve as an important foundation for future collaborative international research activities in information communication technologies (ICT). Pervasive computing and communications touches on many fields of computing, including cyber-physical systems (sensor networks; embedded systems; smart environments; sensor network application areas including agriculture, water and weather), trustworthy computing (systems security, homeland security, privacy), energy and sustainability (smart grid, environmental monitoring, home monitoring); health-care (personalized and smart health care technologies), and citizen science (enabled by mobile smart phones with sensing, computing, and communication capabilities). The workshops will serve as a testbed, where specific research collaboration mechanisms can be tried. They will serve as an incubator, providing an environment in which specific collaborations can take root and begin to flourish. They will also serve as a training ground, for a diverse future generation of internationally-focused ICT researchers.<br\/><br\/>In a time of increasing globalization and inter-connectedness especially in areas of science and engineering such as computing it is increasingly important that research activities and the training of the next-generation of researchers also be international in scope. This project will itself foster international collaboration through the workshops and the subsequent collaborative research proposals generated by workshop participants. Graduate and undergraduate students, in both the US and in India would be involved in this collaborative research. More broadly, leveraging lessons learned and successful collaborations begun, these workshops will serve as foundation for more broadly-based international collaborations among scientists and engineers in a global 21st century knowledge-based world in which ICT plays an increasingly important role. Workshop reports will document workshop findings and outcomes.","title":"PC3: US-India Program for Pervasive Communications and Computing Collaboration","awardID":"1123268","effectiveDate":"2011-03-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["499259"],"PO":["564181"]},"176949":{"abstract":"The UC Berkeley Department of Electrical Engineering and Computer Sciences (EECS) CISE REU site 2011-2013 focuses on SUPERB-Information Technology for Sustainability (ITS). Energy is a springboard to all aspects of sustainability; energy production and use represent one of the most critical technological challenges of our era. The energy and sustainability theme of our REU site offers students the chance to engage in the solution of a crucial problem for their generation and beyond. Energy infrastructure for the 21st Century is a computing systems problem. The IT for Sustainability research theme includes a range of research projects including optimal control of building systems; energy efficient air traffic control; mobile sensing to assess health impacts of traffic; energy management systems to reduce waste in buildings; and personalized real-time footprint tracking for energy management. This research theme presents a basic opportunity for undergraduates to get involved in new research that combines intellectual merit and technical opportunities with very broad impact (such as the possibility of improving the environment and the quality of people's lives).","title":"REU Site: SUPERB-Information Technology for Sustainability","awardID":"1063117","effectiveDate":"2011-03-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["527079"],"PO":["563751"]},"172715":{"abstract":"The digital revolution has created new opportunities in the management and use of all types of research (and other) data and information. Most areas of scientific research are now data-driven and this has produced a broad range of quantitative and qualitative improvements in the research enterprise. The communication of research results in myriad forms, both formal and informal, has also increased and improved. Moreover, the day-to-day practices of the established fields of science and engineering are changing in response to the emergence of new computer- and network-based modes of communication and collaboration. While the technical systems have completed the shift from print to digital media, the social systems are far from rationalized and have not made a similarly effective transformation. The rate of technological change has created many challenges in the effective and efficient exploitation of those digital research resources. Many of the organizational and legal models from the print era have been transferred to the digital network context without adjusting sufficiently for the qualitatively different research capabilities online. New models of scholarly exchange and knowledge production are emerging, but they are still poorly understood or not fully established and utilized. Although automated knowledge production and diffusion promise radical improvements to our capacity to extract, integrate, and exploit new knowledge from the vast stores of available digital data and information, many roadblocks remain. At the same time, old endemic problems such as quality assurance, metadata generation and maintenance, long-term digital preservation, and assessment methodologies for research data and information activities not only have not been addressed successfully in many cases, but new dimensions and concerns have been added by emerging technologies and applications. Both the policies and practices associated with deriving greater returns from the investments in digital knowledge resources, especially online, require sustained focus, analysis, and advice.<br\/><br\/>The federal agencies together make public investments of many billions of dollars per year in producing or externally funding the generation of huge and diverse data streams as inputs into the research enterprise. They similarly produce or fund the creation of ever-increasing volumes of scientific information,both peer-reviewed and gray literature, that embodies the results of much of the research output. As the nation's stewards or funders of these digital research assets, they have a major stake in continually improving their management, policies, and utilization. However, the investments and policies for managing, preserving, disseminating, and reusing the data and information resources are lagging and are generally perceived to be inadequate. Many unresolved issues arise at the different levels of the research system in this regard, affecting established research strategies and priorities. They involve not just scientific and technical elements, but institutional, economic, legal, and socio-cultural aspects. The most pervasive dysfunctions occur at the interdisciplinary, inter-sectoral, and international levels, and in public-private partnerships. The problems in successfully forging relationships for managing and using digital knowledge resources can have significant negative effects, such as structural inefficiencies and lost opportunity costs, on our national research and innovation systems, economic competitiveness, and the greater social welfare.<br\/><br\/>Because research data and information are of great importance to the progress of science and the nation?s competitiveness in the knowledge-based economy, these issues need to be well understood by the various stakeholders in our nation's research enterprise, including the research communities in government, academia, and industry, research policymakers and managers in the Administration and Congress, and ultimately the public that both supports these activities and the benefits from their improved effectiveness. Acting through the NRC, the proposed Board on Research Data and Information would establish a new interdisciplinary mechanism and focal point for bringing greater understanding and visibility to these issues, for adding value to the sponsors? objectives and priorities in these areas, and for helping to improve returns on the federal agencies? investments in a time of increasingly constrained budgets.","title":"Board on Research Data and Information","awardID":"1040898","effectiveDate":"2011-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":["499569"],"PO":["565255"]},"183858":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 10 promising graduate students from U.S. institutions of higher learning along with 9 distinguished research faculty, to be held in conjunction with the Fourth International Conference on Pervasive Technologies Related to Assistive Environments (PETRA 2011), which will take place May 25-27, 2011, on the island of Crete, Greece (http:\/\/www.petrae.org). PETRA is the only annual conference that brings together theoreticians and practitioners from a wide variety of disciplines to focus on the application of pervasive technologies to assistive environments. What connects different disciplines in this highly interdisciplinary but topical conference is the ability to discover new alliances, share data and design new methods that have real-world social impact while also advancing each field scientifically. PETRA 2011 will address timely computational challenges including integration mechanisms of diverse sensor technologies, modeling heterogeneous data, synthesis and analysis of data streams, privacy and security of information, ranking, cleaning, storing and retrieving sensor data streams for pattern analysis and discovery, robust remote rehabilitation mechanisms, correlating brain imaging with behavioral imaging, handling intensive real time data in complex environments, and ways to interpret seemingly meaningless data in order to derive meaningful human behavioral patterns and\/or to identify important \"events\" or changes. PETRA 2011 will also study vital issues in privacy and security in monitoring ambient intelligent environments with the goal of identifying and predicting risks, intrusions, unauthorized access to information, or information leaking. PETRA projects assume a human is at the center of \"cyberphysical systems\" where the digital world merges with the physical.<br\/><br\/>The goals of the Doctoral Consortium are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance in a supportive and interactive environment from a group of senior researchers. Student participants in the Doctoral Consortium will be drawn from diverse communities including computer science, engineering, psychology, social science, neuroscience, human-computer interaction, cognitive science and communication. They will make formal presentations of their work and will receive feedback from a faculty panel; the feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The workshop faculty members will bring a wide spectrum of expertise, and provide student mentoring and coordination. Doctoral Consortium attendees will be asked to create and maintain \"conference workbook\" (webpage) where along with their work they include feedback on papers they attended and observations that they gathered (e.g., through meetings and discussions with conference speakers and other participants) that will apply to and impact their work. Short papers on the participants' work will be published in the Conference Proceedings (which are included in the ACM Digital Library), and a summary report on the event will be posted on the conference website. <br\/><br\/>Broader Impacts: The PETRA 2011 Doctoral Consortium will bring together some of the best students, researchers and practitioners in relevant fields, and will thereby afford the younger participants a unique opportunity to gain wider exposure for their innovative ideas while also receiving reinforcement for the importance and value of conducting research with societal impact. The workshop will allow the junior participants to create a social network both among themselves and with senior colleagues. The organizing committee will make a concerted effort to attract participants who are women, members of under-represented minorities, and persons with disabilities.","title":"WORKSHOP: Doctoral Consortium at the PETRA 2011 Conference","awardID":"1130207","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560636","557541","229551","564932","553595"],"PO":["565227"]},"182649":{"abstract":"The purpose of this award is to support a PI meeting that is bringing together principal investigators, some of them are currently supported via the CISE Directorate in the NSF, in a workshop setting to collectively develop a vision of the Science of Cloud Computing.","title":"The NSF PI Meeting: The Science of Cloud Computing","awardID":"1123954","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["536696"],"PO":["493916"]},"174609":{"abstract":"The Association for Computing Machinery (ACM) proposes to support student attendance at and development of the Richard Tapia Celebration of Diversity in Computing. Tapia Conference series highlights the technical achievements of diverse researchers in computing. It provides a unique forum to support diverse students (undergraduates and graduate students) and professionals. The conference programs include invited speakers, workshops, birds-of-a-feather sessions, panels, a student poster competition and a doctorial consortium. The programs allow leadership development activities for the students as well as young professionals. Moreover, they include significant time for networking about research collaborations and professional development. <br\/>This proposal will support student scholarships for the conference and the doctoral consortium in 2011 and 2013, and partial salary for a staff person to manage the conference planning and fund raising during that period. The staff person will provide stability and consistency in correspondence with Tapia supporters, oversight for the social networking that will support communities formed at the conference, and logistical support.","title":"Support for the Richard Tapia Celebration in Computing Conferences 2011 and 2013","awardID":"1050330","effectiveDate":"2011-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["541641"],"PO":["561855"]},"176190":{"abstract":"Objective:<br\/>The objective of Trust-Hub project is to lead a community-wide movement toward stronger assurances in<br\/>the digital hardware industry. The Trust-Hub is a means for information sharing between researchers and<br\/>practitioners to accelerate the development of defenses against hardware-level attacks. This project<br\/>proposes the development of Trust-Hub, a central web-based repository for technical papers, benchmarks,<br\/>hardware platforms, source codes, tools, and other information that accelerates hardware security research<br\/>and developments.<br\/><br\/>Intellectual Merits:<br\/>This project plans to develop benchmark circuits infected with hardware Trojans (called trust<br\/>benchmarks), create hardware platforms to validate trust benchmarks, and develop a web portal to<br\/>accelerate research and development in hardware security and trust. The project includes (i) creation of a<br\/>large set of static trust benchmarks, (ii) benchmark complexity analysis, (iii) procedures to dynamically<br\/>generate trust benchmarks with hard-to-detect Trojan instances, (iv) platforms for hardware emulation and<br\/>validation of Trojan detection methods, (vii) a web-based repository called Trust-Hub, and (viii)<br\/>comprehensive validation test suites.<br\/><br\/>Broader Impacts:<br\/>The results of this project would be of interest to fab-less semiconductor companies, US government<br\/>agencies and university researchers worldwide. Benefits to the society include trustworthy electronics for<br\/>healthcare, defense, weather forecasting, finance, transportation, and automotive applications. By<br\/>integrating the results of this project into existing courses and by offering new courses in the<br\/>undergraduate and graduate curriculum, the PIs will impart cutting-edge engineering knowledge to<br\/>students and improve their hardware design, security verification and test skills.","title":"Collaborative Research: CI-ADDO-NEW: Trust-Hub: Design of Trust Benchmarks, Hardware Validation Platforms and a Web-Based Dissemination Portal","awardID":"1059390","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["560771"],"PO":["565327"]},"176180":{"abstract":"Objective:<br\/>The objective of Trust-Hub project is to lead a community-wide movement toward stronger assurances in<br\/>the digital hardware industry. The Trust-Hub is a means for information sharing between researchers and<br\/>practitioners to accelerate the development of defenses against hardware-level attacks. This project<br\/>proposes the development of Trust-Hub, a central web-based repository for technical papers, benchmarks,<br\/>hardware platforms, source codes, tools, and other information that accelerates hardware security research<br\/>and developments.<br\/><br\/>Intellectual Merits:<br\/>This project plans to develop benchmark circuits infected with hardware Trojans (called trust<br\/>benchmarks), create hardware platforms to validate trust benchmarks, and develop a web portal to<br\/>accelerate research and development in hardware security and trust. The project includes (i) creation of a<br\/>large set of static trust benchmarks, (ii) benchmark complexity analysis, (iii) procedures to dynamically<br\/>generate trust benchmarks with hard-to-detect Trojan instances, (iv) platforms for hardware emulation and<br\/>validation of Trojan detection methods, (vii) a web-based repository called Trust-Hub, and (viii)<br\/>comprehensive validation test suites.<br\/><br\/>Broader Impacts:<br\/>The results of this project would be of interest to fab-less semiconductor companies, US government<br\/>agencies and university researchers worldwide. Benefits to the society include trustworthy electronics for<br\/>healthcare, defense, weather forecasting, finance, transportation, and automotive applications. By<br\/>integrating the results of this project into existing courses and by offering new courses in the<br\/>undergraduate and graduate curriculum, the PIs will impart cutting-edge engineering knowledge to<br\/>students and improve their hardware design, security verification and test skills.","title":"Collaborative Research: CI-ADDO-NEW: TrustHub: Design of Trust Benchmarks, Hardware Validation Platforms and a Web-Based Dissemination Portal","awardID":"1059328","effectiveDate":"2011-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["550604"],"PO":["565327"]},"175180":{"abstract":"Nearly every graphical user interface (GUI) is implemented using some form of GUI toolkit. While these toolkits have enabled many successes of the past forty years of research and practice in human-computer interaction (HCI), they have unfortunately also become stifling. The rigidity and fragmentation of current GUI toolkits makes it difficult or impossible to deploy new ideas in complex existing applications, so researchers are instead often limited to demonstrating and evaluating small toy applications. This is a major challenge for the field, as it limits both the progress and impact of HCI research. The PI's goal is to transcend the fragmentation of modern GUIs by building upon their single largest commonality, namely that all GUIs ultimately consist of pixels painted to a display. He argues that if it were possible to quickly and robustly interpret those pixels, without application source code and independent of its underlying toolkit implementation, we could use that understanding to modify any interface. The PI's prior work on the Prefab system has shown promising preliminary results, enabled by a strategy of reverse engineering widget appearance. In the current project the PI will develop methods for pixel-based interpretation of graphical user interfaces, including methods for identifying complex widgets, for extracting widget content, and for recovering widget relationships, and he will build upon these to model widgets state and to address occlusion of portions of interfaces. He will create methods for modifying graphical user interfaces, including semantic views on pixel-based interpretation, methods for manipulating underlying interfaces, methods for translation between presentations, visual programming methods, and end-user tools for interface customization. He will implement new tools for informing, deploying, and evaluating interaction research in the field, and he will partner with leading researchers to apply these tools to target-aware pointing and automatic interface generation. And he will validate his pixel-based methods in real-world datasets collected from broad deployments.<br\/><br\/>Broader Impacts: In this project the PI will pursue a vision of a transformative democratization of every aspect of interaction, in which instead of being limited to a single provided interface anybody can modify any interface of any application. For example, an HCI researcher might implement and evaluate a new interaction technique in several existing applications; a practitioner or hobbyist who sees the publication might add the technique to their favorite applications. Web communities might organize around causes, such as translating interfaces into new languages, improving the accessibility of existing applications, or updating interfaces to support gestures, speech access, or other interactions. End-users might browse libraries of extensions, vote on their favorites, and use visual programming tools to create their own. Project outcomes, including tools and dataset, will be openly disseminated. The PI will make special efforts to recruit students from under-represented groups, to integrate the research into existing and new courses, and to use a high school design competition as a channel for recruiting high school students for internships.","title":"CAREER: Pixel-Based Interpretation and Modification of Graphical User Interfaces","awardID":"1053868","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560940"],"PO":["565227"]},"176192":{"abstract":"Objective:<br\/>The objective of Trust-Hub project is to lead a community-wide movement toward stronger assurances in<br\/>the digital hardware industry. The Trust-Hub is a means for information sharing between researchers and<br\/>practitioners to accelerate the development of defenses against hardware-level attacks. This project<br\/>proposes the development of Trust-Hub, a central web-based repository for technical papers, benchmarks,<br\/>hardware platforms, source codes, tools, and other information that accelerates hardware security research<br\/>and developments.<br\/><br\/>Intellectual Merits:<br\/>This project plans to develop benchmark circuits infected with hardware Trojans (called trust<br\/>benchmarks), create hardware platforms to validate trust benchmarks, and develop a web portal to<br\/>accelerate research and development in hardware security and trust. The project includes (i) creation of a<br\/>large set of static trust benchmarks, (ii) benchmark complexity analysis, (iii) procedures to dynamically<br\/>generate trust benchmarks with hard-to-detect Trojan instances, (iv) platforms for hardware emulation and<br\/>validation of Trojan detection methods, (vii) a web-based repository called Trust-Hub, and (viii)<br\/>comprehensive validation test suites.<br\/><br\/>Broader Impacts:<br\/>The results of this project would be of interest to fab-less semiconductor companies, US government<br\/>agencies and university researchers worldwide. Benefits to the society include trustworthy electronics for<br\/>healthcare, defense, weather forecasting, finance, transportation, and automotive applications. By<br\/>integrating the results of this project into existing courses and by offering new courses in the<br\/>undergraduate and graduate curriculum, the PIs will impart cutting-edge engineering knowledge to<br\/>students and improve their hardware design, security verification and test skills.","title":"Collaborative Research: CI-ADDO-NEW: Trust-Hub: Design of Trust Benchmarks, Hardware Validation Platforms and a Web-Based Dissemination Portal","awardID":"1059416","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["485958"],"PO":["565327"]},"177283":{"abstract":"The rampant growth of massive data sets presents new challenges for data processing and analysis. To cope with this phenomenon, sublinear time and sublinear space algorithms that are capable of analyzing and extracting value from such immense inputs must be developed. This project aims to study sublinear time and space algorithms from a unified perspective, using the synergies in order to gain a better understanding that will lead to faster, space efficient and more widely applicable algorithms.<br\/><br\/>The proposed research has two core components. The first component is the study of sparse representations of large data sets. Sparse representations are useful for quickly analyzing and processing data. This component itself will have two parts. First, it will lead to a better understanding of sublinear time sampling algorithms for data coming from a succinctly described distribution. The succinct descriptions considered include those defined by a small number of parameters, such as power laws, Gaussians, and histogram distributions. Second, it will improve the current state of knowledge of streaming algorithms, data sketching, compressive sensing and sparse recovery techniques. Such techniques will for example have an impact on algorithms for acquiring and processing images, audio and network data. <br\/><br\/>The second component aims to design novel statistical techniques for understanding various distributional quantities describing commonly used structured objects such as graphs. The focus in this component will be on sublinear time and space algorithms that estimate parameters of graphs. This project will significantly advance the algorithmic foundations of algorithms with limited resources, and develop highly efficient algorithms for analyzing massive data sets.<br\/><br\/>This project will significantly advance the algorithmic foundations of computation with limited resources. It will develop highly efficient algorithms for analyzing massive data sets that arise in diverse areas including electronic commerce, health, network security, and scientific data collection.<br\/><br\/>The broader impacts of this project are in the education and mentoring of young researchers including underrepresented groups. Community outreach activities will introduce primary school children to interesting mathematical and computer science ideas.","title":"AF: Medium: Taming Masssive Data with Sub-Linear Algorithms","awardID":"1065125","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["517766","560190"],"PO":["565251"]},"176173":{"abstract":"Optical imaging is increasingly used in biomedical research for its unique advantages in terms of sensitivity, specificity, resolution, and versatility, as compared with other imaging modalities. Optical imaging spans multiple scales, from macroscopic imaging using bioluminescence and fluorescence which collect data at millimeter level to microscopic imaging at the micrometer level in both 2D and 3D spaces. Combined with high-throughput and staining techniques, optical images are often acquired in large numbers over several channels. As a result, for optical imaging methods to be of maximal use in biomedical research, computational enhancement of optical imaging has become a necessity for data management and effective information extraction.<br\/><br\/>This project initializes and adopts a multi-disciplinary approach to planning the creation of a community infrastructure for computationally enhanced optical imaging. The planning stage includes a larger workshop and smaller, targeted meetings, and discussions to solicit input from computational scientists, biomedical researchers, and engineers concerning the establishment, functionality, operational processes and user access of a computationally enhanced optical imaging infrastructure. The planned community infrastructure features a multi-institutional collaboration including hospitals, research laboratories, and universities. The infrastructure can provide students and researchers in biomedicine, mathematics, computer science, and engineering a platform for interaction and collaboration on development and use of computational techniques to model, process, quantify, and analyze various types of optical images. In addition the infrastructure offers training opportunities to students and early career researchers to apply their knowledge and skills in practice and to collaborate with investigators with different backgrounds.","title":"Collaborative Research: CI-P: Computationally-enhanced optical imaging infrastructure","awardID":"1059292","effectiveDate":"2011-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[472116],"PO":["564316"]},"176195":{"abstract":"Objective:<br\/>The objective of Trust-Hub project is to lead a community-wide movement toward stronger assurances in<br\/>the digital hardware industry. The Trust-Hub is a means for information sharing between researchers and<br\/>practitioners to accelerate the development of defenses against hardware-level attacks. This project<br\/>proposes the development of Trust-Hub, a central web-based repository for technical papers, benchmarks,<br\/>hardware platforms, source codes, tools, and other information that accelerates hardware security research<br\/>and developments.<br\/><br\/>Intellectual Merits:<br\/>This project plans to develop benchmark circuits infected with hardware Trojans (called trust<br\/>benchmarks), create hardware platforms to validate trust benchmarks, and develop a web portal to<br\/>accelerate research and development in hardware security and trust. The project includes (i) creation of a<br\/>large set of static trust benchmarks, (ii) benchmark complexity analysis, (iii) procedures to dynamically<br\/>generate trust benchmarks with hard-to-detect Trojan instances, (iv) platforms for hardware emulation and<br\/>validation of Trojan detection methods, (vii) a web-based repository called Trust-Hub, and (viii)<br\/>comprehensive validation test suites.<br\/><br\/>Broader Impacts:<br\/>The results of this project would be of interest to fab-less semiconductor companies, US government<br\/>agencies and university researchers worldwide. Benefits to the society include trustworthy electronics for<br\/>healthcare, defense, weather forecasting, finance, transportation, and automotive applications. By<br\/>integrating the results of this project into existing courses and by offering new courses in the<br\/>undergraduate and graduate curriculum, the PIs will impart cutting-edge engineering knowledge to<br\/>students and improve their hardware design, security verification and test skills.","title":"Collaborative Research: CI-ADDO-NEW: Trust-Hub: Design of Trust Benchmarks, Hardware Validation Platforms and a Web-Based Dissemination Portal","awardID":"1059435","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[472184],"PO":["565327"]},"176185":{"abstract":"An anthropomorphic robot arm and a human capture system enable the autonomous performance of assembly tasks with significant uncertainty in problem specifications and environments. This line of work is investigated through sequences of manipulation actions where the guarantee of the completion of task-level objectives is rooted in the discovery of the semantic structure of human manipulation. New research directions in anthropomorphic robotics are explored including programming by demonstration, activity recognition, control and estimation and planning.<br\/><br\/>The motion grammar laboratory infrastructure allows a great opportunity for research and education. New classroom experiences for undergraduates and graduates provide practical experience in robot human interaction and activity process sharing. This opens possibilities for human training and rehabilitation, as well as assistive personal robotic, and opens the door to a host of technological innovations.","title":"II-New: Motion Grammar Laboratory","awardID":"1059362","effectiveDate":"2011-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["508256","549592","565099","500707","553540"],"PO":["543539"]},"175372":{"abstract":"Most work on computer interaction for blind people focuses on these users as consumers, rather than creators, of information. Work on document creation specifically intended for blind people mainly concentrates on supporting general tasks associated with writing documents rather than on document formatting and layout, even though there is evidence that blind authors' documents are treated dismissively when they do not live up to \"expected\" standards of document presentation. Many blind authors therefore rely on sighted people to check their documents; consequently, they cannot be as productive as their sighted peers. The PI's goal in this project is to facilitate independence for blind authors in producing documents that meet the presentation standards expected by sighted readers. To these ends, the PI will develop an impact-weighted taxonomy of common document presentation errors of blind authors. She will explore blind authors' mental models and strategies for learning and coping, and how these models and strategies contribute to the success of independent document formatting and layout activities. And she will investigate the content-sharing and voting dynamics of blind authors. These findings will enable her to implement an integrated solution to document preparation for blind authors in the form of a Microsoft Word compatible formatting and layout checker, as well as a fix to the compatibility problems between Word's grammar and spell checkers and commonly used screen readers. And she will develop an accessible content-sharing environment for blind authors with an interface for sighted help from Amazon Mechanical Turk. To achieve her goals the PI will employ, among other techniques, participatory design with blind users and controlled experiments for investigating real-time non-visual presentation of grammar, spelling, formatting and layout statuses, errors and corrections (including through the use of haptic feedback and spatial sound).<br\/><br\/>Broader Impacts: This research will naturally involve blind persons at almost all stages. Project outcomes will reduce the necessity for blind authors to rely on sighted help, thus affording increased independence and productivity to members of this community. The work will likely prove of value to the general population as well, for whom non-visual document presentation information can be of benefit in eyes-busy or phone-based interactions. The PI will conduct numerous educational and outreach activities in conjunction with this project, including distribution of the software tools developed to centers and schools for blind and visually impaired persons, and development of a multidisciplinary and multilevel (undergraduate and graduate) course aimed at both psychology and computer engineering students on \"Designing Socio-technical Systems for People with Special Needs.\"","title":"CAREER: Document Layout and Formatting Helper for Blind Authors","awardID":"1054984","effectiveDate":"2011-03-01","expirationDate":"2016-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["522608"],"PO":["565227"]},"177297":{"abstract":"The necessary science and technology are developed to demonstrate sustained dynamic soaring of an unmanned aerial vehicle. This has four primary components. First, the team develops novel, real-time solutions specific to the dynamic soaring motion planning problem to enable perpetual flight. Second, they develop compact representations for estimating wind field in real time. These measurements serve as input to the motion planner to optimize energy that is recovered from a given soaring cycle. Third, they develop a novel airframe whose design is tightly coupled with motion planning algorithm development. Finally, a significant technical evaluation is performed which culminates in a demonstration of sustained low-altitude dynamic soaring.<br\/><br\/>The realization of unmanned aerial vehicles capable of staying aloft is transformative for many fields, e.g., as a low altitude and cost alternative to conventional satellite systems. Such pseudo-satellites serve as a sensor network and provide surveillance data, weather monitoring, and act as relay nodes in telecommunications networks. They are put into place, recovered, and maintained without the significant expense and failure risk associated with a space launch. A dynamically soaring unmanned aerial vehicle is ideal for hurricane observation since the craft is designed with the required strength and the associated wind gradients provide sufficient aircraft endurance for the life of the storm. One major outreach effort is the Robotics and Aerospace Camp for a group of 20-30 eighth and ninth grade students; this is part of a year round academy to promote academic achievement and college placement for economically and academically challenged middle level and high school students.","title":"RI: Medium: Collaborative Research: Towards Perpetual Flight of a Gliding Unmanned Aerial Vehicle in the Jet Stream","awardID":"1065202","effectiveDate":"2011-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[475315,475316],"PO":["564069"]}}