{"132561":{"abstract":"Proposal 0737207<br\/>\"Workshop on Contemporary Approaches to Human-Level Artificial Intelligence\"<br\/>PI: Leslie P. Kaelbling<br\/>MIT<br\/><br\/><br\/>ABSTRACT<br\/><br\/>This award supports the organization and the participation of approximately 35 experts in a two-day workshop to be held July 12-13, 2007 at MIT Endicott House in Dedham, Massachusetts. The purpose of this workshop is to bring together leading researchers in Artificial Intelligence to assemble a research agenda for developing AI systems capable of human level performance (Human Level AI or HLAI). HLAI includes the following constellation of capabilities exhibited by human beings: (1) The ability to adapt and survive for an extended period of time in a rich, complex physical and social environment; (2) The ability to learn throughout this extended period of existence and, in particular, to improve performance on a fixed set of tasks, learn to perform new tasks, transfer knowledge and skill from one task to another, the ability to execute a new task after being told (or shown) how to do it; (3) The ability to reason about their own capabilities and limitations, to formulate new tasks, and to gather information needed for learning how to perform those tasks; (4) The ability to communicate and interact (e.g., cooperate) with other agents, to form teams, to recognize the goals, beliefs, and intentions of other agents, to persuade and negotiate with other agents; and (5) The ability to design and execute changes in the environment (physical and social) to improve their ability to survive and achieve their goals. In other words, an HLAI system is characterized by the potential to perform a great breadth of tasks--including those not pre-envisioned by the system designer--and by the ability to reflect on and improve all of its own capabilities, and to do so in a robust, flexible manner. This workshop will review the current state of the art, propose new integrated architectures for robust integrated intelligent systems, and suggest ways for researchers to leverage results across the many subspecialties in AI.","title":"Workshop on Contemporary Approaches to Human-Level Artificial Intelligence","awardID":"0737207","effectiveDate":"2007-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["486247"],"PO":["387198"]},"122430":{"abstract":"In a wide range of practical applications (e.g., transportation systems, embedded software design, energy saving of portable electronics, biological systems, etc.), there are two types of uncertainty inherent in the evolution of the systems: small incremental noises caused by environmental perturbations, and abrupt and large changes caused by random discrete events and system reconfigurations. The model and analysis of such systems can be conveniently captured by the recently developed framework of stochastic hybrid systems. <br\/><br\/>This NSF CAREER research aims to develop the theoretical foundation and the computational platform for the efficient solution of two important classes of problems arising in stochastic hybrid systems: their reachability problems and reachability optimization problems. The reachability problems are particularly relevant in safety-critical applications (e.g. air traffic management): their solutions will give quantitative probabilistic characterizations of the system safety under the presence of uncertainty. Such information can not only be used in monitoring the safe operation of the system, but can also serve as the intermediate results in an overall effort to optimize the system performance, resulting in reachability optimization problems. A key obstacle to the efficient solution of these two problems is the explosive increase of computational complexity with the problem dimension. Hierarchical multi-level computational algorithms are being developed in this project to overcome this obstacle. Software tools developed based on these algorithms are expected to enable the real-time solution of the two problems for many practical applications of great societal importance. In addition, the developed theory, algorithms, and software are being validated on a multi-robot experimental testbed.","title":"CAREER: Reachability Analysis and Optimization of Stochastic Hybrid Systems","awardID":"0643805","effectiveDate":"2007-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553623"],"PO":["561889"]},"126401":{"abstract":"Proposal #: CNS 07-07931 <br\/>PI(s): Eigenmann, Rudolf<br\/> Midkiff, Samuel P.<br\/>Institution: Purdue University<br\/> West Lafayette, IN 47907-2108<br\/>Title: CRD: Supporting the Cetus Compiler for the Community<br\/><br\/>Project Proposed:<br\/><br\/>This project, deploying and maintaining for the community a new compiler infrastructure for multicore and high-end computing, enables community access to the system, provides frontline support for errors of repairs and feature requests, and evolves the Cetus infrastructure with contributions of the user community. Cetus, a source-to-source translator supporting the creation of source-oriented compiler optimization techniques, permits researchers to develop novel techniques and evaluate them in the context a realistic and robust environment. The techniques enabled are needed in languages for modern, parallel computer architectures, and are critical for developing and understanding program transformations and optimizations for such systems. Specifically, Cetus fills the need for languages based on C and is being used by research teams world-wide.<br\/><br\/>Broader Impacts: Cetus, a successful infrastructure that is being distributed to the community for broad use and impact, is also used as a teaching infrastructure in several courses where it provides the basis for student projects.","title":"CRI: CRD - Supporting the Cetus Compiler Infrastructure for the Community","awardID":"0707931","effectiveDate":"2007-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["558595","550995"],"PO":["557609"]},"125214":{"abstract":"ABSTRACT<br\/>NSF Proposal 0702506<br\/>PI: Maciej Ciesielski<br\/>Inst: U of Massachusetts, Amherst<br\/><br\/>Verification-Aware Algorithmic Synthesis based on Canonical Data Flow Representation<br\/><br\/>This work proposes a new methodology in algorithmic synthesis and verification for data intensive applications. The proposed work offers a systematic method to perform behavioral transformation of the initial description of designs specified at the algorithmic level using standard programming languages, such as C or C++. Optimization of design specification at the functional or behavioral level, rather than on the register-transfer or gate level, has been shown to have the greatest impact on the quality of synthesized hardware.<br\/><br\/>The proposed method is based on a novel canonical representation of the computation, called Taylor Expansion Diagram (TED). As a canonical functional representation, TED represents a class of structural representations, from which one optimized for a particular design objective can be selected. TED will serve as a vehicle to transform initial, \"un-timed\" algorithmic design specification into a data flow description that will produce architecture optimized for a particular design cost, such as area, latency, power, or performance. The modified data flow graph can be synthesized by a standard high-level synthesis tool to produce an RTL net-list. <br\/><br\/>An important aspect of this work is that it performs synthesis in a verification-aware fashion. This is accomplished by favoring those behavioral transformations that are ``verification-friendly'' and by maintaining a record of behavioral transformation history to be used by a formal verification engine. <br\/><br\/>The proposed work will culminate in the development of a CAD system for fast architectural exploration for signal processing and algorithm-oriented designs. The prototype system will be distributed on the world-wide web.","title":"Verification-Aware Algorithmic Synthesis based on Canonical Data Flow Representation","awardID":"0702506","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["550433"],"PO":["562984"]},"125247":{"abstract":"This project is advancing the state of the art in constructing software for complex distributed systems, including such examples as Internet communication protocols; protocols for communication and computation in mobile ad hoc networks; robot and transportation control systems; and security protocols. The approach pursued in this project enables rigorous derivations of distributed systems that previously could be specified only in an ad hoc way, invariably leading to implementations whose adherence to functional and behavioral requirements could not be guaranteed. This project develops a comprehensive computer-supported framework, based on sound mathematical principles, for modeling, analyzing, and generating code for complex systems.<br\/><br\/>The overall framework developed in this projects builds on and extends the successful timed and untimed Input\/Output Automata (IOA) frameworks. This research project envelopes the following technical areas: (1) Developing languages and associated modeling and analysis theory, extending IOA and Timed IOA, and supporting timed, hybrid, and probabilistic Input\/Output Automata, and combinations thereof. These provide comprehensive facilities for expressing properties of modern distributed systems. (2) Developing tools supporting analysis of distributed system designs expressed using our new languages. (3) Developing tools and supporting theory for automated and computer-aided generation of distributed code from specifications, and supporting the derivation of correct and optimized mappings from software components to physical network nodes. (4) Developing several sophisticated applications using the theory, both solving important problems in their application domains and demonstrating the effectiveness of the formal framework.","title":"Extending the Power and Applicability of the Timed Input\/Output Automata Framework","awardID":"0702670","effectiveDate":"2007-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["517826","451177"],"PO":["565272"]},"125269":{"abstract":"As the size of the data sets manipulated by data-intensive scientific applications approaches the petabyte level and beyond, the need for scalable I\/O techniques becomes increasingly important and difficult. Much of the research on this issue has been performed within the context of<br\/>MPI-IO: the de-facto standard parallel I\/O interface for data-intensive applications. Its popularity stems from the fact that MPI-IO provides to applications a rich and flexile parallel I\/O API coupled with highly efficient implementations of this API. This problem is being further addressed by the development of powerful parallel I\/O subsystems, and state-of-the-art file systems that can efficiently access this infrastructure. However, even with such advances, I\/O continues to be a significant bottleneck in application performance.<br\/><br\/>The goal of this research is to provide high-performance I\/O for data-intensive applications. A key insight is that a major obstacle in the way of this goal is the legacy view of a file as a linear sequence of bytes. This is because scientific applications rarely access data in a way that matches this file model, using instead what is more accurately described as an object model. In fact, it is the runtime translation between these two data models that is a major contributor to poor I\/O performance. To address this issue, this research will develop a more powerful object-based file model for MPI applications, and an object-based caching system to serve as an interface between MPI applications and object-based files. Objects will be carefully defined to encapsulate information about an application's I\/O access patterns, and such information will be used to increase the parallelism of file accesses and decrease the cost of maintaining global cache coherence.","title":"Object-Based Caching for MPI-IO","awardID":"0702748","effectiveDate":"2007-06-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["344399"],"PO":["565272"]},"132013":{"abstract":"This grant provides funding to involve graduate students in the relatively new and innovative annual meeting on recommender systems of the Association for Computing Machinery (ACM), an area of currently great and rapid development in computer and information science. Recommender systems are information systems, often associated with major commercial websites, that advise customers and other users about products such as books or movies, on the basis of their own past choices and the choices of other users who have similar preferences. Following up on previous successful workshops and conferences on recommender systems, the research community has taken the lead in creating an ACM sponsored conference in the field. To be held October 19-20 in Minneapolis, Minnesota, it will feature a peer-reviewed research program (with both a printed proceedings and publication in the ACM Digital Library) and an industry program, to better bring together the experiences and needs of industry practice and academic research. Presentations of full papers, posters, and demonstrations will make up the main body of the conference. The Doctoral Consortium component of the conference will be held on October 18. Between six and eight advanced graduate students will present their research and receive feedback from faculty and fellow students. <br\/><br\/>This doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development.","title":"Recommender Systems Conference Doctoral Consortium, 2007 (October 19-20, 2007)","awardID":"0733678","effectiveDate":"2007-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550380","518491"],"PO":["564456"]},"125226":{"abstract":"Advances in technology have enabled individuals, organizations and government agencies to collect and store massive amounts of data across all walks of human endeavor. A critical challenge here is to extract actionable information from such tera- and peta-scale data stores in as efficient manner as possible so that domain scientists can make critical advances in various fields including the sciences, engineering, medicine and homeland security.<br\/><br\/>Toward this objective, the PI seeks to employ an architecture-conscious approach to scalable data analysis on modern cluster systems interconnected through a high speed network. The central thesis of this work is that current day algorithms for data analysis often grossly under-utilize architectural resources (processors, memory, disk and network). This project seeks to address this limitation in the context of key application drivers drawn from scientific simulations, bioinformatics and security applications. Specifically locality enhancing techniques, the ability to leverage new features of modern architectures, the ability to efficiently work with large out-of-core data structures, multi-level load balancing and distribution of work among cluster nodes and mechanisms that support remote memory paging on modern clusters will be investigated and leveraged in this context. <br\/><br\/>The main scientific outcomes of this research will include the ability to process and analyze hitherto intractably large datasets enabling new scientific discoveries in the corresponding domains and the ability to engage and fully utilize the underlying parallel architecture to respond and react to domain expert queries efficiently. Another expected outcome of this work will be from specific solutions obtained to deploy generic runtime abstractions that can be used by a host of data-intensive applications. The broader outcomes of this work will be to train capable undergraduate and graduate students. Women and minorities will be especially encouraged to participate and existing interactions with a local HBCU will be strengthened through various initiatives.","title":"Scalable Data Analysis: An Architecture Conscious Approach","awardID":"0702587","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["527873"],"PO":["565272"]},"125259":{"abstract":"Power Aware Graphics Hardware<br\/><br\/>Today, power consumption is as important as speed in almost all electronic design. Handheld electronic devices, such as cellular phones, personal digital assistants, and handheld game consoles have become commonplace and consumers are demanding longer battery lifetimes without additional weight, in addition to greater functionality and performance. This research addresses this critical need for developing energy-efficient graphics hardware for use in handheld devices.<br\/><br\/>The key objective of this research is to explore the use of asynchronous (or clockless) logic to reduce power consumption in the graphics processing units (GPUs) of handheld devices, while maintaining a given level of performance. An asynchronous graphics processor promises to reduce power requirements in many ways. Whereas the constantly running clock in synchronous logic causes circuits to consume power even when no work is being done, clockless logic is essentially powered down when idle. Thus, the asynchronous graphics pipeline would adjust naturally to the constantly varying demands of graphics. The graphics problem is also a good match with asynchronous design because it has many pipeline stages, is tolerant to latency, and can take advantage of parallelism at a fine granularity everywhere in the pipeline. Furthermore, other power benefits specific to graphics pipelines are expected to be achieved by introducing two new capabilities that are greatly facilitated by asynchronous design: on-demand and variable-precision computation.","title":"Power Aware Graphics Hardware","awardID":"0702712","effectiveDate":"2007-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["491524",332385],"PO":["532791"]},"125536":{"abstract":"Proposal ID 0703859 <br\/>Date 04\/11\/2007 <br\/>Despite great strides in the development of automatic speech recognition technology, we do not yet have a system with performance comparable to humans in automatically transcribing unrestricted conversational speech, representing many speakers and dialects, and embedded in adverse acoustic environments. This approach applies new high-dimensional machine learning techniques, constrained by empirical and theoretical studies of speech production and perception, to learn from data the information structures that human listeners extract from speech. To do this, we will develop large-vocabulary psychologically realistic models of speech acoustics, pronunciation variability, prosody, and syntax by deriving knowledge representations that reflect those proposed for human speech production and speech perception, using machine learning techniques to adjust the parameters of all knowledge representations simultaneously in order to minimize the structural risk of the recognizer. The team will develop nonlinear acoustic landmark detectors and pattern classifiers that integrate auditory-based signal processing and acoustic phonetic processing, are invariant to noise, change in speaker characteristics and reverberation, and can be learned in a semi-supervised fashion from labeled and unlabeled data. In addition, they will use variable frame rate analysis, which will allow for multi-resolution analysis, as well as implement lexical access based on gesture, using a variety of training data. <br\/>The work will improve communication and collaboration between people and machines and also improve understanding of how human produce and perceive speech. The work brings together a team of experts in speech processing, acoustic phonetics, prosody, gestural phonology, statistical pattern matching, language modeling, and speech perception, with faculty across engineering, computer science and linguistics. Support and engagement of students and postdoctoral fellows are part of the project, engaging in speech modeling and algorithm development. Finally, the proposed work will result in a set of databases and tools that will be disseminated to serve the research and education community at large.","title":"Collaborative Research: Landmark-based Robust Speech Recognition using Prosody-guided Models of Speech Variability","awardID":"0703805","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["558131"],"PO":["565215"]},"130212":{"abstract":"This award provides partial support for travels of students, young faculty, and especially members of underrepresented groups from the US institutions, to attend the 5th Pathways, Networks and Systems International Conference in Porto Heli, Greece, 24-29 June 2007. The conference uniquely blends experimental studies of complex multilevel systems with rigorous computational, bioinformatics, statistical and analytical approaches. Emphasis is on mammalian systems, but breakthrough discoveries in other species are included where they lead to new strategies, paradigms, analytical methods, and phenotyping methods. Attendance is limited to less than 100 to promote direct and personal interactions. The conference is a balanced mix of formal and long (45 min) platform presentations with ample time for informal discussions. Feedback from previous conferences has been exceptional. Although there are other genomics, computational and systems biology conferences, none integrate computational and experimental approaches so seamlessly or effectively.","title":"Pathways, Network and Systems International Conference in Porto Heli, Greece, 24-29 June 2007.","awardID":"0724984","effectiveDate":"2007-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["498292"],"PO":["561879"]},"130003":{"abstract":"A fundamental challenge for many mobile computing applications is data<br\/>management. Data should be available anywhere at anytime. However,<br\/>this task is particularly difficult to support with respect to<br\/>managing a user's personal data (e.g., data files, email, and cached<br\/>web pages) across a collection of personal devices (e.g., a laptop,<br\/>PDA, and mobile phone). Two properties of the mobile environment make<br\/>data management particularly challenging: network disconnection and<br\/>device resource constraints, particularly energy constraints. The<br\/>goal of this work is to provide maximal availability and consistency<br\/>of personal data as well as maximal aggregate device lifetime for a<br\/>collection of personal devices. To accomplish this goal, the project<br\/>develops a set of cooperative prefetching algorithms that enable<br\/>devices to retrieve relevant data when connected to the information<br\/>source. Further, the algorithms efficiently distribute the energy<br\/>burden of performing prefetching across the collection of devices.<br\/>The evaluation investigates the performance of the algorithms in an<br\/>implementation running on a collection of laptop computers and iPAQs.<br\/>Two primary metrics are considered: the aggregate lifetime of the<br\/>devices and the hit rate of user requests for data. The overarching<br\/>impacts of this work will be improved usability of mobile devices and<br\/>applications and maximization of mobile device lifetime. Further, the<br\/>student participants in this project are undergraduate women from<br\/>Mount Holyoke College, one of the nation's finest all-women<br\/>undergraduate institutions. Therefore, the project will also serve to<br\/>improve the overall participation of women in systems research.","title":"RUI\/CSR-PDOS: Cooperative Prefetching for Mobile Devices","awardID":"0724027","effectiveDate":"2007-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563481"],"PO":["561889"]},"122513":{"abstract":"After decades of research on shared-memory multiprocessors, computers with multiple processors have now been widely embraced with the arrival of the multicore revolution. Unlike the previous microprocessor revolution---which required no fundamental software changes---the multicore revolution requires a significant shift for software. Because much of the accustomed exponential performance improvements over the next decade will come directly from multiplying the number of processor cores on a chip, programmers that wish to harness this computational power must undertake the difficult task of creating parallel versions of their programs.<br\/><br\/>To reduce the difficulty of this task of creating correct and efficient shared-memory programs, recent work on \"transactional memory\" has focused on providing the programmer with a higher-level primitive than just lock- based critical sections for managing concurrency in their shared-memory programs: a region of code annotated to execute as if it was not running in parallel with other code. Although conceptually serial, advanced implementations allow for concurrent execution while still providing a serializable semantics.<br\/><br\/>The goal of this research is to identify, understand, and resolve the most important semantic and implementation challenges of hardware-based transactional memory. Just as the multiprocessor research successfully overcame important challenges, this research tackles the analogous challenges for hardware transactional memory: (i) understanding the semantics of the hardware\/software interface, (ii) developing simple and fast hardware implementations, and (iii) creating critical experimental simulation and workload infrastructures.","title":"CAREER: Semantics and Hardware Implementation of Transactional Memory","awardID":"0644197","effectiveDate":"2007-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556655"],"PO":["565272"]},"125527":{"abstract":"Proposal ID 0703859 <br\/>Date 04\/11\/2007 <br\/>Despite great strides in the development of automatic speech recognition technology, we do not yet have a system with performance comparable to humans in automatically transcribing unrestricted conversational speech, representing many speakers and dialects, and embedded in adverse acoustic environments. This approach applies new high-dimensional machine learning techniques, constrained by empirical and theoretical studies of speech production and perception, to learn from data the information structures that human listeners extract from speech. To do this, we will develop large-vocabulary psychologically realistic models of speech acoustics, pronunciation variability, prosody, and syntax by deriving knowledge representations that reflect those proposed for human speech production and speech perception, using machine learning techniques to adjust the parameters of all knowledge representations simultaneously in order to minimize the structural risk of the recognizer. The team will develop nonlinear acoustic landmark detectors and pattern classifiers that integrate auditory-based signal processing and acoustic phonetic processing, are invariant to noise, change in speaker characteristics and reverberation, and can be learned in a semi-supervised fashion from labeled and unlabeled data. In addition, they will use variable frame rate analysis, which will allow for multi-resolution analysis, as well as implement lexical access based on gesture, using a variety of training data. <br\/>The work will improve communication and collaboration between people and machines and also improve understanding of how human produce and perceive speech. The work brings together a team of experts in speech processing, acoustic phonetics, prosody, gestural phonology, statistical pattern matching, language modeling, and speech perception, with faculty across engineering, computer science and linguistics. Support and engagement of students and postdoctoral fellows are part of the project, engaging in speech modeling and algorithm development. Finally, the proposed work will result in a set of databases and tools that will be disseminated to serve the research and education community at large.","title":"Collaborative Research: Landmark-Based Robust SpeechRecognition Using Prosody-Guided Models of Speech","awardID":"0703782","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["508316"],"PO":["565215"]},"131996":{"abstract":"This project will develop a formal framework based on optimization and reinforcement learning to model important features of creative processes. Large, ill-defined optimization problems that characterize situations where creativity comes into play require selectional, or generate-and-test, procedures that include both a smart generator and a smart tester. The generator responsible for generating structures to be evaluated should be able to generate structures that are novel while at the same time have high probability of being successful. This project investigates new methods for injecting structured, knowledge-based, novelty into the generation process. The tester, the process that evaluates alternatives, should be a good surrogate for the primary objective function, which is often not easily or inexpensively accessible. A smart tester uses a combination of a priori knowledge, knowledge accumulated from past creative activity, and information gained during the current creative activity to assess alternatives. The working hypothesis is that the synergy created by the interaction of a sufficiently smart generator and a sufficiently smart tester can account for important aspects of creative processes.<br\/><br\/>Intellectual Merit. Although there have been past attempts to mathematically and computationally model aspects of creativity, few bring to bear modern developments in machine learning or take advantage of recent advances in computational reinforcement learning and its relation to animal reward and motivational systems. Furthermore, computational studies have not taken advantage of psychological theories of play, curiosity, surprise, and other factors involved in intrinsically motivated behavior and that perform significant roles in creative activities. This project addresses these shortcomings by taking a interdisciplinary approach. The project will meet the challenge of providing a coherent theoretical account of aspects of creativity without losing sight of the fluidity and flexibility of creative processes.<br\/><br\/>Broader Impacts. Representing key elements of creative processes in a mathematically coherent framework can stimulate new directions of research in computer science, engineering, design research, and psychology. Algorithms designed according to this framework can facilitate the design of creative artificial agents as well as form the basis of tools for enhancing human creativity and creative enterprises. Such a framework can also provide a principled means for comparing performances of algorithms purporting to show creativity, thus forming a component of future research methodology directed toward creativity. The project has the potential to contribute to our understanding of general principles underlying human creativity, with implications for design, education, and the arts.","title":"SGER: Building Blocks for Creative Search","awardID":"0733581","effectiveDate":"2007-06-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["513288"],"PO":["424970"]},"125209":{"abstract":"Barycentric coordinates have become a standard interpolation technique in Computer Graphics. These coordinates solve a boundary value interpolation problem and can be used to interpolate discrete scalar fields, vector fields or even multidimensional fields over irregular tessellations. While barycentric coordinates were first generalized in 1975 by Wachspress for Finite Element Analysis, the Graphics community has made heavy use of these coordinates for applications such as texturing mapping, polygonal rasterization, ray-intersection calculations and spline surfaces. More recently, new research in barycentric coordinates has led to additional applications in surface parameterization, solid texturing and surface deformation. Despite these advances, very few generalizations of barycentric coordinates exist today and most contain restrictions. For instance, many barycentric coordinate constructions require that the input shapes must be convex and, even then, the coordinates may not be well-defined everywhere. Currently, there is only one type of barycentric coordinates, called Mean Value Coordinates, defined for arbitrary, closed shapes. However, these coordinates still leave much to be desired as they can be negative (problematic for interpolation applications) and lack local control, thus producing artifacts. <br\/><br\/>Ideally, barycentric coordinates should have constant and linear precision (needed for applications such as deformation), produce smooth functions, have local influence and contain only positive values. No current analytic formulation contains all of these properties. This research is generalizing barycentric coordinate construction by investigating a novel approach to building barycentric coordinates that directly solves for coordinates that have these desirable properties. Once the theory is completed, the new barycentric coordinates will be applied to several application domains including: Boundary Value Interpolation, Surface Deformation, and Example-based Deformation Synthesis.","title":"Generalized Barycentric Coordinates","awardID":"0702499","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["501894"],"PO":["532791"]},"131602":{"abstract":"Title: 2007 RoboCup International Symposium<br\/>PIs: Tucker Balch and Frank Dellaert<br\/>Institution: Georgia Institute of Technology<br\/><br\/>The RoboCup International Symposium is the premier meeting for presentation and discussion of scientific advances in diverse areas inspired by the RoboCup Initiative, including: robot soccer, rescue robotics, and robots and people. The Symposium's scope encompasses research and education activities in the fields of computer vision, artificial intelligence, human robot interaction, multi-agent systems, robot mechanisms, and robot locomotion. The 11th annual RoboCup International Symposium will be held in conjunction with RoboCup 2007 in Atlanta, July 9-10, 2007.<br\/><br\/>Scientific Merit: The symposium offers an excellent opportunity to introduce new techniques to disciplines and people who have not been exposed to them before. The experimental, interactive and benchmark character of the RoboCup initiative creates an opportunity to present, learn and evaluate novel ideas and approaches across a variety of disciplines. If promising, these ideas are rapidly adopted and field-tested by a large (and still strongly growing) community.<br\/>Finally, the introduction of RoboCup@Home in 2006 provides additional opportunity to expand the areas of discussion at the Symposium.<br\/><br\/>Broader Impact: RoboCup offers a significant opportunity to provide international impact in science and technology. RoboCup draws participants from over 20 countries. This year's event marks the first time that the event will be hosted entirely on a university campus and only the second time the event has been held in the United States. One impact in this case is the opportunity for introducing international students and faculty to a leading U.S. <br\/>academic<br\/>environment that will encourage them to pursue additional collaborations in the U.S.<br\/><br\/>URL: http:\/\/www.robocup-us.org\/","title":"2007 RoboCup International Symposium","awardID":"0731741","effectiveDate":"2007-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["436270","485377"],"PO":["564316"]},"122538":{"abstract":"Building reliable software systems remains a challenging problem. The main difficulty is that such systems are built by integrating smaller components written by developers working in isolation. Each component functions correctly only under some specific conditions that remain unarticulated in the development process, thereby complicating the task of checking the compatibility of the different parts.<br\/><br\/>This research proposes to develop Assert-Generated Interfaces, a toolkit to increase the reliability of software by ensuring that large systems are built from compatible components. Individual component builders then locally specify properties critical to the correct working of the components using assert statements embedded within the implementation. <br\/><br\/>These assertions are automatically analyzed to obtain interfaces that describe how the component may be safely used. Automatic generation ensures the interface evolves with the implementation. Assert Generated Interfaces decompose the task of system-level correctness checking into manageable component-level checks, and when static checking is impossible, the interfaces can be used to build wrappers that dynamically shield components by blocking unsafe uses.","title":"CAREER: Software Reliability via Assert-Generated Interfaces","awardID":"0644361","effectiveDate":"2007-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["529115"],"PO":["565264"]},"131967":{"abstract":"The medical sector represents about 20% of the United States gross domestic product. The rapidly increasing use of software to control medical devices makes the development and production of medical device software and systems a crucial issue, both for the U.S. economy and to assure safe advances in healthcare delivery. There is strong interest in advancing research and development to improve the design, certification, and operation (by both healthcare practitioners and consumers) of medical device software and systems to result in better and more cost-effective medical care.<br\/><br\/>The purpose of the HCMDSS\/MD PnP workshop is to bring together medical device specialists (including researchers, engineers, and clinicians) from clinical environments, industry, research laboratories, academia, and government with the goal of advancing science, technology, and practice to address crucial software and systems issues and challenges in the design, manufacture, certification, use, and interoperability of medical devices.<br\/><br\/>This joint workshop on HCMDSS (High Confidence Medical Devices, Software, and<br\/>Systems) and Medical Device Plug-and-Play (MD PnP) Interoperability provides a working forum for the presentation of research and development activities covering all aspects of high integrity medical devices, software, and systems, which is essential to support innovative, networked medical device systems to improve safety and efficiency in health care. The convening of this group of thought leaders in the areas of medical device interoperability and high confidence embedded systems offers a unique opportunity for the kind of intellectual exchange that will advance the field. Previous workshops have resulted in extensive networking and collaborative activities that have facilitated parallel efforts in technology, methodology, and standards development. <br\/><br\/>The broader impacts of this agenda include the collaborative development of technology and methodology to enable (1) the adoption of innovative approaches to improve patient safety and workflow efficiency, (2) the resulting reduction of healthcare costs, (3) the support of access to health care in remote environments, and (4) the improvement of requirements methodologies to provide a clinical basis for technology development.","title":"Joint Workshop on High Confidence Medical Devices, Software, and Systems and Medical Device Plug-and Play Interoperability","awardID":"0733417","effectiveDate":"2007-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T748","name":"NSA - SOFTWARE ROADMAP RSRCH"}}],"PIcoPI":["553656","531882"],"PO":["561889"]},"131903":{"abstract":"The goal is to provide travel support to 15 US-based graduate students to attend the 8th IEEE International Symposium on a World of Wireless, Mobile and Multimedia Networking (WoWMoM 2007) to be held in Helsinki, Finland, on June 18-21, 2007 with Nokia as the local host. WoWMoM is a premier forum dealing with cutting-edge research and technology developments in wireless converged (multimedia) networking and applications. WoWMoM Participants include academics, industry and government organizations worldwide. Attendance in this conference will provide the US-based students a unique opportunity to exchange research ideas and network with international peers, thus making them more competitive in the job market. Such experience is so important in this age of globalization.","title":"NeTS-WN: IEEE World of Wireless, Mobile and Multimedia Networking (WoWMoM) 2007 Student Travel Support","awardID":"0733114","effectiveDate":"2007-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["564777"],"PO":["7594"]},"125170":{"abstract":"This project investigates innovations in the organization and use of computation and storage resources for future multicore processors. Such innovations are critical to maintaining growth in microprocessor performance, which is the driver of the computer industry.<br\/><br\/>Two specific directions for innovation will be investigated: (i) novel and efficient organization and use of computation resources within a multicore, and (ii) novel and efficient organization and use of cache resources within a multicore. The first research direction uses a newly proposed framework, Computation Reassignment, which transfers computation fragments to the most appropriate resources for execution,<br\/>transparent to the higher level software. The proposed technique has the potential to greatly increase the efficiency with which the computation resources of a multicore processor execute a program, which can lead to better performance, better power efficiency, better reliability, and better thermal management. The second research direction investigates Cooperative Caching, a recent proposal for constructing an aggregate,<br\/>globally managed cache via cooperation between the individual caches. The investigation of cooperative caching will include innovative cooperation policies to coordinate the combined cache resources of a multicore processor to achieve three simultaneous goals: (1) memory access latency reduction, (2) throughput, fairness and quality of service improvement and (3) performance and power management of multicore caches. <br\/><br\/>The research methodology makes extensive use of simulations using full-system, cycle-level simulators. The project uses a wide variety of benchmark programs including standard benchmark suites as well as other<br\/>programs, including commercial workloads, written in a number of different programming languages and run on multiple, commercial operating systems. The simulation capabilities include models that allow a quantification of various forms of efficiency, including power and area models.<br\/><br\/>The research is expected to have a broader impact in several ways, including the training of graduate students, impact on commercial computer designs, enhancing the body of knowledge used to design powerful computers, as well as the development of pedagogical tools that will be useful in educating future computer scientists and engineers.","title":"Innovations in Resource Organization and Use in Multicore Processors","awardID":"0702313","effectiveDate":"2007-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["438221"],"PO":["559883"]},"125280":{"abstract":"With the advances in technology, Field-Programmable Gate Arrays (FPGAs) have become an attractive choice for scientific computing. Indeed, several research groups as well as vendors are developing high performance computer systems which employ FPGAs for application acceleration. These hybrid systems integrate general-purpose processors, FPGAs, memory hierarchy consisting of SRAM and DRAM, and pose new design challenges in optimizing the overall performance. The challenges to achieving high performance include managing shared memory hierarchy, partitioning among multiple FPGAs, and hardware\/software co-design between the general-purpose processors and the FPGAs.<br\/><br\/>This research develops a high performance linear algebra library for FPGA-accelerated systems. The operations considered include reduction of a series of floating-point values, data path synthesis using deeply pipelined FPUs, sparse matrix-vector multiplication, and dense matrix computations. These kernels are fundamental operations in many scientific applications. The library is parametrized using available configurable logic, on-chip memory (Block RAM), SRAM and its bandwidth, and DRAM bandwidth via interconnection network. Algorithmic exploration of hybrid computing platforms that consist of processors, reconfigurable logic and user controlled memory hierarchy are performed.<br\/>These include:<br\/>1. Optimal algorithms to exploit memory hierarchy and reconfigurable logic, 2. Parameterized IP cores based on the design space characterized by available logic, SRAM and memory bandwidth, 3. Hardware\/software partitioning to exploit the computational resources, 4. Synthesis of optimal data paths for arithmetic expression evaluation including reduction circuits, and 5. Demonstration on state of the art high end computing platforms from leading supercomputing vendors and research groups.<br\/><br\/>Comparison against highly optimized code developed for general purpose processors using well-defined benchmarks are performed using comparable architectural resources such as processor-memory bandwidth, memory and logic.","title":"Parameterized and Tunable Linear Algebra Library for FPGA-Accelerated Systems","awardID":"0702784","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["563658"],"PO":["565272"]},"126492":{"abstract":"In previous decades, computational science has enabled important discoveries. It plays an increasingly important role in many challenging problems in science and engineering. At the University of South Carolina, Clemson, Medical University of South Carolina, and other universities in the state, there exists a diverse group of researchers engaged in computationally intensive advanced research projects in biology, chemistry, medical imaging, nanotechnology, and computer science. These projects depend not only on the development of new sets of theories and algorithms, but also require the availability of state-of-the-art high performance computing facilities. The acquisition of a high-performance shared-memory computer is proposed as a means of improving the research and educational infrastructure of high performance computing at the University of South Carolina. This computer will be operated and maintained by the Department of Computer Science and Engineering at the University of South Carolina. In addition to supporting the projects detailed here, this machine will be made available to researchers in other South Carolina institutes whose research interests deal with biological and medical problems.<br\/> The proposed shared-memory computer will greatly enhance the computational capabilities of multiple research groups by enabling them to tackle new and more challenging problems, particularly in biological and medical related areas. It will also substantially improve graduate and undergraduate training in the area of high performance computing by providing new research opportunities for students. This computer will also serve as a state-wide resource for researchers in institutes across the state of South Carolina. This computer will provide resources to advance research in the areas of bioinformatics, computational biology, medical research and nanotechnology. By providing a community computing resource, it will also help catalyze further collaborations among researchers who share common interests in South Carolina. This shared-memory machine will also be available to educators in many departments at the University of South Carolina. Education in computational science and high performance computing will be closely integrated with research in several areas (biology, medical imaging, chemical engineering, etc) to take advantage of the equipment. With this new addition to our modest existing computational facilities, students will be afforded significantly better access to the newest high-performance technologies.","title":"CRI: CRD Acquisition of a High-Performance Shared-Memory Computer for Biological and Medical Research in South Carolina","awardID":"0708391","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["435436",335593,"451161","508135"],"PO":["565136"]},"125173":{"abstract":"Project Abstract<br\/><br\/>The evolution of semiconductor technology and computer systems has made interconnection networks, and particularly on-chip interconnection networks (OCNs), a critical technology. In recent years, single-processor performance has reached a plateau, leading processor manufacturers to combine many processors on a chip. Such multi-core or many-core chip multi-processor (CMP) architectures depend on an OCN to provide communication between processors, cache memory modules, and external memories and I\/O devices. A large fraction of area and power in such systems is consumed by communication making OCNs even more critical.<br\/><br\/>The PIs propose to develop enabling technology (circuits and architecture) for OCNs. They will develop circuits that are expected to reduce OCN power by 10x and decrease cost by 4x for an OCN with constant performance. This circuit-level work will enable the development of accurate models for the cost, power, and performance for key OCN components. Using these models, new network architectures will be developed that are expected to close much of the gap between an OCN and the ideal interconnect to 1\/3 of its present size. The technology developed will be demonstrated through implementing an optimized OCN to the level of completed layout. While the OCN will be targeted for CMPs and driven by CMP workloads through the RAMP infrastructure, the PIs will also be working with systems-on-chip groups to inject the proposed circuit macros and architectural designs into their design tool-chains.","title":"Collaborative Research: Enabling Technology for On-Chip Networks","awardID":"0702341","effectiveDate":"2007-06-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["400637"],"PO":["366560"]},"125184":{"abstract":"Although processor cycles, memory size, and disk capacity all become increasingly abundant, there is still a serious deficiency in the system support for handling data-intensive applications, which is the long latency of hard disk accesses, measured by the time to get the first byte of requested data. This latency improvement has significantly lagged behind other system component improvement, including disk peak bandwidth. To address this critical issue, the investigators will develop new and efficient buffer cache management systems that adapt to the dramatic technology changes and the high demand of data-intensive applications with complicated access patterns. Aiming at making the memory buffer as a truly effective agent between the requests from applications and services provided by disks, the investigators will leverage the cache and prefetch mechanisms in the memory buffer to improve effective I\/O system performance, perceived by applications, by minimizing the cost (both energy and time) of expensive disk accesses. A unique approach to be adopted in the research is to put the disk layout information directly on the map of buffer management and effectively integrate both temporal and spatial localities. The investigators will design and implement a system infrastructure that analyzes and exploits data layout information on disks. With this critical system support, the investigators will further design and implement dual-side-aware memory buffer management algorithms that adapt to characteristics exhibited at both programs' side and disks' side.","title":"Collaborative Research: Algorithms Design and Systems Implementation to Improve Buffer Management for Fast I\/O Data Accesses","awardID":"0702380","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["551992"],"PO":["565272"]},"128001":{"abstract":"This project facilitates a unique collaboration among artists and scientists with the goal to develop, implement, and validate novel metaphors and approaches to access, manage, and communicate scholarly datasets. The results are expected to have transformative power in terms of the organization, analysis, and visualization of large-scale scholarly datasets. A sequence of three artists will work with scientists at the Information Visualization Laboratory and the Cyberinfrastructure for Network Science Center at Indiana University. <br\/><br\/>The artists will work with database experts on parsing, structuring, and loading new datasets into a multi-terabyte database of scholarly data. The artists will play with a multitude of data analysis and visualization algorithms. They will participate in brainstorming, technical, and design sessions. Most importantly, the artists will be fully immersed as equal partners in different projects. Ethnographic studies will be conducted to capture, optimize, and communicate this unique collaboration. This is exploratory work as we cannot predict what will happen when artists are immersed in the Lab and are asked to rethink and reinvent the way in which research is conducted, the tools being used and designed by the researchers, and the means of communicating results.<br\/><br\/>The broader impact of this research will be facilitated by three workshops that bring together artists and scientists with synergistic expertise in (2) the communication of science dynamics, (2) novel devices and interactivity techniques, and (3) dramatization of information. These workshops bring together scholars and artist that normally do not meet in a scholarly setting.","title":"Creative Metaphors to Stimulate New Approaches to Visualizing, Understanding, and Rethinking Large Repositories of Scholarly Data","awardID":"0715303","effectiveDate":"2007-06-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["519649"],"PO":["424970"]},"125186":{"abstract":"The clock speed of microprocessors has finally reached its practical limits. Future performance gains will only be obtained through various forms of parallelism such as integrating multiple CPU cores on one chip: The area of mainstream parallelism has started. This will pose an enormous burden on the developers of high performance libraries. Optimal code has to be carefully tuned to every specific platform including its memory hierarchy, special instruction sets, and the forms of parallelism it provides. This time-consuming process is repeated for every new platform released. It is time to ask the question: Can computers write these libraries for us?<br\/><br\/>The goal of this research is to develop a program generation system that completely<br\/>automates the implementation and optimization of a large class of performance-critical library functionality. This class will at least include linear transforms, a set of dense linear algebra problems, correlation, a set of decoders, and numerical integration. The program generation system will produce code that is optimized to a computer's memory hierarchy and that is parallelized, if required, for vector architectures, shared or distributed memory parallelism, or even streaming parallelism in graphics processing units (GPUs), or a for a combination of those. The performance of the generated code should be competitive with the best hand-written code available. \"Program generation\" means that the system takes as input only the problem specification. In other words, the computer itself writes highly optimized and, if desired, already parallelized source code. To achieve this, the knowledge about alternative algorithms and about algorithm optimization has to be formalized in a way that it can be done by the computer. In summary, the goal is to enable computers to write very fast libraries for well-understood numerical functionality and for a wide range of parallel platforms.","title":"Program Generation for Parallel Platforms","awardID":"0702386","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["533346","332185","533346",332185],"PO":["565272"]},"128343":{"abstract":"The creative digital media exhibition Speculative Data and the Creative Imaginary:<br\/>shared innovative visions between art and technology will be held at the National<br\/>Academy of Sciences Gallery in Washington D.C., June 3 to August 24, 2007, as part of<br\/>the program for the Association for Computer Machinery (ACM) Creativity and Cognition<br\/>Conference, to be held June 13 to 15, 2007 in Washington D.C.. The exhibition will be<br\/>open for almost 3 months and in the summer, allowing ample time for adult, children,<br\/>and tourist visitors to view and interact with the exhibits. <br\/><br\/>The intellectual merit in this exhibition lies in the collection and dissemination of digital<br\/>media projects that illustrate premises that information technology (IT) is forming a<br\/>powerful alliance with creative practices in the arts and design to establish the exciting<br\/>new domain of information technology and creative practices (ITCP)set<br\/>forth in the 2003 National Research Council experts meeting and report Beyond<br\/>productivity: Information Technology, Innovation and Creativity and the Rockefeller<br\/>Foundation report New Media Arts | New Funding Models, (Mitchell, Inouye, and<br\/>Blumenthal, 2003; Jennings, 2000) Creative digital media works to be presented<br\/>demonstrate the contemporary practice of the merging of the creative practitioner and<br\/>the engineer - sometimes as a single person and other times as interdisciplinary teams<br\/>that exhibition participant Donna Cox, Director of Visualization from the National Center<br\/>of Supercomputing Application, calls renaissance teams. The term renaissance team is<br\/>descriptive of the CISE CreativeIT focus in supporting research that is done with groups<br\/>of people from different backgrounds in which the creative synergy is focused on a<br\/>specific context, problem, or perceived need resulting in new products, models, and<br\/>areas of research that transcend discipline specific methods of inquiry.<br\/><br\/>The broader impact of this exhibition is in having the exhibits available in a public space<br\/>for children and adults to visit and interact with.","title":"SGER: Exhibition: Speculative Data and the Creative Imaginary at the National Academy of Sciences to be held June 3, 2007-August 24, 2007 in Washington, DC.","awardID":"0717081","effectiveDate":"2007-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["424970"],"PO":["424970"]},"122491":{"abstract":"Hsien-Hsin S Lee<br\/>Georgia Institute of Technology<br\/>CAREER: Introspective Computing: A Multcore Approach to Availability, Reliability, and Security<br\/>0644096<br\/>Panel ID: 070111<br\/><br\/>Abstract<br\/><br\/><br\/>Cyber exploits and remote attacks on network servers are becoming enormous concerns by service providers, online merchants, and network users. Due to the deficiency of effective and efficient countermeasures and self-healing capability, malicious adversaries can easily compromise systems, gain unauthorized access, and disrupt services, leading to huge loss of productivity and revenues. To provide high availability, reliability and security for computing systems is, more urgent than ever, the first-order design criteria. On the other hand, technology scaling has reached a point where processor architects can integrate multiple processor cores onto the same die. Using such multi-core processors with necessary hardware and system software support, an introspective computing platform can be constructed to addresses these emerging issues. <br\/><br\/>An introspective multi-core architecture leverages several advantages offered by the tightly-coupled on-die processor cores to perform: fine-grained security introspection, instant low-overhead checkpoint, and fast, on-demand rollback recovery, thereby providing a continuing service in the face of system compromise or corruption. The key features of an introspective system include programmable asymmetric processor cores, physical insulation against exploits, highly efficient fine-grained introspection, and fast checkpoint\/recovery mechanism. In addition, with adequate monitoring and detection mechanism implemented, fault-tolerance and hardware-based transactional memory system can be enabled for minimal cost. Overall, it provides a synergistic and holistic solution toward the challenges of achieving high availability, reliability, and security. The outcome of this research will substantially benefit the IT industry, the generic users for protecting their privacy, and the processor architects to consider these challenges in the early design phase.","title":"CAREER: Introspective Computing: A Multicore Approach to Availability, Reliability and Security","awardID":"0644096","effectiveDate":"2007-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["526309"],"PO":["535244"]},"125340":{"abstract":"Proposal ID 0703859 <br\/>Date 04\/11\/2007 <br\/>Despite great strides in the development of automatic speech recognition technology, we do not yet have a system with performance comparable to humans in automatically transcribing unrestricted conversational speech, representing many speakers and dialects, and embedded in adverse acoustic environments. This approach applies new high-dimensional machine learning techniques, constrained by empirical and theoretical studies of speech production and perception, to learn from data the information structures that human listeners extract from speech. To do this, we will develop large-vocabulary psychologically realistic models of speech acoustics, pronunciation variability, prosody, and syntax by deriving knowledge representations that reflect those proposed for human speech production and speech perception, using machine learning techniques to adjust the parameters of all knowledge representations simultaneously in order to minimize the structural risk of the recognizer. The team will develop nonlinear acoustic landmark detectors and pattern classifiers that integrate auditory-based signal processing and acoustic phonetic processing, are invariant to noise, change in speaker characteristics and reverberation, and can be learned in a semi-supervised fashion from labeled and unlabeled data. In addition, they will use variable frame rate analysis, which will allow for multi-resolution analysis, as well as implement lexical access based on gesture, using a variety of training data. <br\/>The work will improve communication and collaboration between people and machines and also improve understanding of how human produce and perceive speech. The work brings together a team of experts in speech processing, acoustic phonetics, prosody, gestural phonology, statistical pattern matching, language modeling, and speech perception, with faculty across engineering, computer science and linguistics. Support and engagement of students and postdoctoral fellows are part of the project, engaging in speech modeling and algorithm development. Finally, the proposed work will result in a set of databases and tools that will be disseminated to serve the research and education community at large.","title":"Collaborative Research: Landmark-based Robust Speech Recognition Using Prosody-guided models of speech variability","awardID":"0703048","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[332626],"PO":["565215"]},"125241":{"abstract":"Project Abstract for 0702658:<br\/><br\/>Technological advancements in semiconductor fabrication have led to an abundance of on-chip transistors, faster clock speeds, and unprecedented processor performance. In contrast, while DRAM capacity has increased commensurately, DRAM speeds have primarily lagged behind resulting in an ever-increasing processor\/memory performance gap. Conventional approaches to bridge the speed gap with a hierarchy of ''''cache'''' memories--where at every level cache size is traded off for speed--has reached diminishing returns. Cache hierarchies have become increasingly ineffective in hiding the memory latency for important classes of commercial and scientific workloads. For example, in modern servers (e.g., transaction processing or web servers) the processors idle more than 50% of the time waiting for memory. Processor-centric proposals to bridge the gap (e.g., large-window or run-ahead execution) rely on high inherent memory-level parallelism in applications, which is unfortunately absent in many such workloads due to the dependent nature of memory accesses (e.g., pointer chasing in linked data structures).<br\/><br\/>In this project, a novel memory system architecture, called Spatio-Temporal Memory Streaming (STeMS), is developed in which memory moves in correlated groups (called spatio-temporal streams) rather than as individual cache blocks to enhance fetch lookahead and memory-level parallelism, hide memory latency, and improve on-chip storage utilization and pin bandwidth. STeMS capitalizes on the observation that memory access patterns, while arbitrarily irregular, are highly repetitive due to iterative program control flow and infrequent structural changes to data in memory. To enhance memory-level parallelism, STeMS is designed to extract repetitive temporally- and spatially-correlated ''''streams'''' of instructions and data corresponding to data structure traversals at program sites. Preliminary results indicate that a STEMS-based system can eliminate over 60% of shared cache misses in on-line transaction processing server software.","title":"Spatio-Temporal Memory Streaming","awardID":"0702658","effectiveDate":"2007-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["342331","342332"],"PO":["559883"]},"125253":{"abstract":"Title: RUI: Managing Memory Demands of Data Intensive Workloads in Chip Multiprocessors<br\/>PI: Kelly A. Shaw<br\/><br\/> Until recently, most computer chips contained a single processor; systems with multiple processors were created by using multiple computer chips. Changes in the semiconductor industry are now enabling many, even tens, of processors to reside on a single chip. Placing multiple processors on a given chip makes it possible to execute many different tasks, or processes, on that chip simultaneously, potentially speeding up complex computations. However, it also means that all of those executing tasks must compete for and share all of the other resources on the chip. These resources include locations to store the data used by the processes, wires that enable data to be moved to different locations on the chip, and pins that enable data to be moved on or off of the chip. For applications that use large quantities of data, efficient use of these shared resources will be necessary for fast execution on these chips. The importance of these types of data intensive applications cannot be overstated; financial institutions use them to insure compliance with government standards, scientists use them while performing genome sequence research, and businesses use them to learn about individuals in order to develop new products. <br\/> This project has two goals. First, this work will quantify the demands these data intensive applications place on a chip's shared resources as more processors are placed on each chip. Understanding the resource needs of these applications will enable identification of problems that prevent these applications from executing quickly on these chips and will expose ways to potentially address these problems. Second, this project will develop and evaluate changes to the chips and to the applications that will help reduce the demands placed on a chip's shared resources. Specifically, the project will examine ways to organize the shared resources on a chip to more closely match how an application uses these resources. Additionally, this work will propose and evaluate techniques that reduce the amount of unneeded data being incidentally brought onto and stored on a chip. Finally, the project will examine ways to use knowledge about the application to restructure the application in a way that reduces the need to move data to different locations on a chip using the shared wires.","title":"RUI: Managing Memory Demands of Data Intensive Workloads in Chip Multiprocessors","awardID":"0702689","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[332369],"PO":["559883"]},"125286":{"abstract":"Future microprocessors will be multicore systems with significant real estate dedicated to on-chip cache memory. The potential performance of multicore processors far exceed that of traditional single-core processors, but their performance is limited by the memory system''s inability to deliver data to cores in a timely fashion. Traditional techniques for overcoming this memory bottleneck problem are power hungry, which makes them unsuitable for future power-limited designs. To overcome the memory bottleneck problem, we are evaluating a wide variety of multicore memory hierarchy design space options, with an eye towards both improving performance and decreasing power. Among the design options we are investigating are hierarchical versus tiled cache architectures, support for dynamic tile allocation policies, support for moving select computation to data, support for vector-style gather-scatter operations, support for selective updates, power-aware coherence protocols and prefetching mechanisms, and coherence and prefetching mechanisms that exploit heterogeneous wire technologies. Preliminary results indicate that these mechanisms will significantly increase performance and reduce power dissipation in future multicore processors.","title":"Improving Memory Power and Performance for Multicore Processors","awardID":"0702799","effectiveDate":"2007-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["481348"],"PO":["559883"]},"125199":{"abstract":"CCF: Capturing and Animating the Human Hand: Robust Recovery of Hand-Object Interactions<br\/><br\/>Nancy Pollard<br\/><br\/>Abstract<br\/>This research addresses the problem of accurately capturing motion of the human hand. Capturing human hand motion has proven exceptionally difficult for a variety of reasons, including the complexity of the joints in the hand, variation in hand anatomy from person to person, small ranges of motion, difficulties related to motion capture technology, and complex contact conditions while manipulating objects. However, the hand is critically important for communication, caring for others and ourselves, and using tools to alter the world around us. This research covers a suite of practical techniques needed to make accurate, subject-specific capture of the human hand possible using today's hardware. These techniques, along with the corresponding hand motion database, will make it possible to study the workings of the hand when performing all manner of tasks with captured data at a high level of detail and accuracy. This work should be useful in rehabilitation for measuring progress in improving range of motion and in accomplishing everyday activities. It should be useful for exploring potential designs for robot hands. And it should also be of great use for exploring the basis of dexterity itself.<br\/><br\/>This research involves three specific subtopics. The first is robust algorithms for automatic extraction of subject specific skeletal models from motion capture data. We then observe that marker protocol affects the results a great deal. Thus, the second subtopic of this research is obtaining well founded recommendations for marker protocols for accurate data capture. Next we observe that cleaned motion capture data does not capture the contact conditions that are so important to understanding grasping. Thus, the third subtopic of this research is developing optimization algorithms to obtain physically plausible representations of observed motion, even in situations with complex, changing contacts between deformable tissues of the hand and a manipulated object.","title":"CCF: Capturing and Animating the Human Hand: Robust Recovery of Hand-Object Interactions","awardID":"0702443","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["560865"],"PO":["532791"]},"125210":{"abstract":"Although processor cycles, memory size, and disk capacity all become increasingly abundant, there is still a serious deficiency in the system support for handling data-intensive applications, which is the long latency of hard disk accesses, measured by the time to get the first byte of requested data. This latency improvement has significantly lagged behind other system component improvement, including disk peak bandwidth. To address this critical issue, the investigators will develop new and efficient buffer cache management systems that adapt to the dramatic technology changes and the high demand of data-intensive applications with complicated access patterns. Aiming at making the memory buffer as a truly effective agent between the requests from applications and services provided by disks, the investigators will leverage the cache and prefetch mechanisms in the memory buffer to improve effective I\/O system performance, perceived by applications, by minimizing the cost (both energy and time) of expensive disk accesses. A unique approach to be adopted in the research is to put the disk layout information directly on the map of buffer management and effectively integrate both temporal and spatial localities. The investigators will design and implement a system infrastructure that analyzes and exploits data layout information on disks. With this critical system support, the investigators will further design and implement dual-side-aware memory buffer management algorithms that adapt to characteristics exhibited at both programs' side and disks' side.","title":"Collaborative Research: Algorithms Design and Systems Implementation to Improve Buffer Management for I\/O Data Accesses","awardID":"0702500","effectiveDate":"2007-06-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["518050"],"PO":["565272"]},"126684":{"abstract":"Proposal #: CNS 07-09472 <br\/>PI(s): Manduchi, Roberto <br\/>Institution: University of California- Santa Cruz <br\/> Santa Cruz, CA 95064-4107 <br\/>Title: IAD:Comparative Evaluation of Assistive Technology Devices & Software for Visually Impaired Persons <br\/><br\/>This project, acquiring appropriate infrastructure for building assistive technology applications for visually impaired persons, aims at <br\/>. Analyzing existing products from the technical side as well as from the user standpoint and <br\/>. Devising new research directions in the Assistive Technology (AT) field.<br\/>The analysis enables understanding the reasons for success or lack thereof of AT products and contributes in formalizing the do's and the don'ts of assistive technology. Relying on experience with existing technology, the latter requires discussions with visually impaired users who are expected to contribute in defining the most interesting, unexplored, and relevant areas for development. Volunteers from the Vista Center for the Blind and Visually Impaired in Santa Cruz will test the infrastructure. Since many tools have met with scarce success and high abandonment rate in an area where tools often do not go beyond the prototype phase, this infrastructure enables the evaluation of existing technologies in terms of technical performance and usability. The work facilitates drawing conclusions about the various aspects that increase the probability of adoption of an existing technology device.<br\/><br\/>Broader Impact: With a potential to contribute to the quality of life of a segment of the population, this project might increase the independence of blind and visually impaired individuals. Furthermore, the work produces new opportunities for educational and outreach activities involving visually impaired individuals.","title":"CRI: IAD: Comparative Evaluation of Assistive Technology Devices and Software for Visually Impaired Persons","awardID":"0709472","effectiveDate":"2007-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7399","name":"CISE MINOR INST INFRA (MII) PR"}}],"PIcoPI":["395034"],"PO":["557609"]},"125485":{"abstract":"Proposal ID 0703859 <br\/>Date 04\/11\/2007 <br\/>Despite great strides in the development of automatic speech recognition technology, we do not yet have a system with performance comparable to humans in automatically transcribing unrestricted conversational speech, representing many speakers and dialects, and embedded in adverse acoustic environments. This approach applies new high-dimensional machine learning techniques, constrained by empirical and theoretical studies of speech production and perception, to learn from data the information structures that human listeners extract from speech. To do this, we will develop large-vocabulary psychologically realistic models of speech acoustics, pronunciation variability, prosody, and syntax by deriving knowledge representations that reflect those proposed for human speech production and speech perception, using machine learning techniques to adjust the parameters of all knowledge representations simultaneously in order to minimize the structural risk of the recognizer. The team will develop nonlinear acoustic landmark detectors and pattern classifiers that integrate auditory-based signal processing and acoustic phonetic processing, are invariant to noise, change in speaker characteristics and reverberation, and can be learned in a semi-supervised fashion from labeled and unlabeled data. In addition, they will use variable frame rate analysis, which will allow for multi-resolution analysis, as well as implement lexical access based on gesture, using a variety of training data. <br\/>The work will improve communication and collaboration between people and machines and also improve understanding of how human produce and perceive speech. The work brings together a team of experts in speech processing, acoustic phonetics, prosody, gestural phonology, statistical pattern matching, language modeling, and speech perception, with faculty across engineering, computer science and linguistics. Support and engagement of students and postdoctoral fellows are part of the project, engaging in speech modeling and algorithm development. Finally, the proposed work will result in a set of databases and tools that will be disseminated to serve the research and education community at large.","title":"RI-Collaborative Research: Landmark-based robust speech recognition using prosody-guided models of speech variability","awardID":"0703624","effectiveDate":"2007-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["537717","426305"],"PO":["565215"]},"127674":{"abstract":"This award provides NSF support for a workshop on the topic of Cyber-Physical Systems (the First International Workshop on CPS) to be held in June of 2008 in Beijing, in conjunction with the IEEE International Conference on Distributed Computing Systems. The aims of the workshop are to provide a forum for a new NSF program area addressing next-generation physical and engineered systems.","title":"First International Workshop on Cyber Physical Systems --- In Conjunction with ICDCS'08","awardID":"0714247","effectiveDate":"2007-06-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["460574"],"PO":["561889"]},"125254":{"abstract":"P0702693<br\/>Finding What's Not There: A New Approach to Revealing Neglected Conditions in Software<br\/>Andy Podgurski<br\/><br\/>A new approach to the detection of neglected conditions in software is explored that is based on the ideas that vital clues about neglected conditions are often distributed throughout a project code base. Clues are represented as graph minors of program dependence graphs, which model programming patterns in which particular conditions are handled properly. PDG minors permit a wide variety of such patterns to be modeled concisely and without unnecessary constraints on the contexts in which the patterns may be found. Patterns are found by mining a database of dependence graphs to identify recurring graph minors, on the assumption that the more a programming pattern is used, the more likely it is to be correct. After putatively correct patterns are identified, the graph database is searched again to identify pattern violations corresponding to neglected conditions. This approach is distinguished from related work on defect detection by its focus on neglected conditions, by its use of dependence graph minors to represent programming patterns, and by its use of graph mining technology to identify patterns. The approach will be evaluated and refined by applying it to reveal neglected conditions in a variety of open-source projects.","title":"Finding What's Not There: A New Approach to Revealing Neglected Conditions in Software","awardID":"0702693","effectiveDate":"2007-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["460483"],"PO":["564388"]},"125179":{"abstract":"From now on, all processors will consist of a large number of processing cores, and programs will run fast only if they can run in parallel on these cores. However, finding parallelism in programs is a very difficult job, and has succeeded only in limited domains like scientific computing. There have been few successes in the more general domain of irregular programs that manipulate large pointer-based data structures like graphs. The Galois project will implement and evaluate a new approach to parallelizing such irregular programs based on optimistic parallelization and a small amount of information from library writers. Preliminary results on problems like Delaunay mesh generation are very promising.<br\/><br\/>Irregular programs that manipulate pointer-based data structures are known to be difficult to parallelize. The Galois project is implementing a novel approach for optimistic parallel execution of such programs. The Galois programming model is an object-based shared-memory model. There are three main aspects to Galois: (i) a small number of syntactic constructs for packaging optimistic parallelization as data structure manipulations, (ii) assertions about methods in class libraries, and (iii) a runtime system for detecting and recovering from unsafe accesses made by an optimistic computation to shared memory. The funding for this project will be used to develop techniques for verifying class library assertions, and continuing the implementation of the Galois system.","title":"The Galois Approach to Optimistic Parallelization","awardID":"0702353","effectiveDate":"2007-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["556730"],"PO":["565272"]},"129546":{"abstract":"Since the fundamental Internet protocols were designed, the Internet has changed from a cooperative network to one in which carriers and application providers both cooperate and compete. Internet design, however, has not evolved to gracefully recognize or support this competition. Support for both cooperation and competition requires coordinated evolution of Internet architecture and communications law. Communications law that is not based on Internet architecture can not effectively regulate the converging communications marketplace. Similarly, Internet architecture that does not recognize the effect of communications law upon the marketplace can not serve as a catalyst for innovation and new applications.<br\/><br\/>Broader Impact: The focus of this project is on the interplay between Internet architecture and communications law around a recent issue called Net Neutrality. Net neutrality represents the idea that Internet users are entitled to service that does not discriminate on the basis of source, destination, or ownership of Internet traffic. Proponents of net neutrality argue that without a prohibition on discrimination, Internet Service Providers may charge application providers discriminatory prices for access to dedicated bandwidth or for quality of service, or may outright block access to certain applications or websites, and that such activity will inhibit development of new Internet applications. Opponents of net neutrality argue that there is no current problem, that competition is sufficient to ensure that commercially negotiated arrangements for bandwidth or QoS will not negatively impact consumers, and that any regulation will discourage investment in network infrastructure. Congressional action, or inaction, on net neutrality will greatly impact Internet architecture. If Congress adopts one of the more extreme versions of net neutrality, then the use of QoS could be prohibited. If Congress adopts a more moderate version of net neutrality, then QoS might be allowed but charging for QoS might be prohibited. If Congress does not act on net neutrality, then ISPs may block access to QoS mechanisms to competing application providers. Any of these actions would substantially affect the evolution of the Internet and of future Internet research. <br\/><br\/>Intellectual Merit: In this project, the issue of net neutrality will be used to examine the interplay between Internet architecture and communications law, by considering the implications of Internet architecture upon net neutrality law and by considering the implications of net neutrality law upon Internet architecture. First, a network model and terminology will be created that can be interpreted in both Internet architecture and communications law. Internet infrastructure services will be defined as functionality that must be provided within the access network, whereas Internet application services will be defined as functionality that can be provided elsewhere in the Internet. Second, to consider the implications of Internet architecture upon net neutrality law, a net neutrality law will be formulated based on a careful delineation of Internet infrastructure and Internet applications. The approach will essentially mandate the use of open interfaces between infrastructure and applications, but will not mandate full open access, which would require open interfaces at each protocol layer. Third, to consider the implications of net neutrality law upon Internet architecture, architectural requirements required to support net neutrality through an open interface will be identified. Internet architecture requirements required to gracefully support both cooperation and competition will be studied. New design principles that the FIND community should attempt to incorporate into future Internet architecture will be formulated. It is difficult to formulate","title":"SGER: Net neutrality","awardID":"0722087","effectiveDate":"2007-06-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["516930"],"PO":["565090"]},"130195":{"abstract":"Id: CNS 0724890<br\/>PI: Stephen Cooper (St. Joseph's University)<br\/>Title: Alice Workshop 2007, Southwestern US<br\/><br\/>This CISE special project provides support for a workshop for 60 faculty members using the Alice software for introductory and experienced programming instruction. This workshop is a continuation of the prior 3 successful Alice workshops held in the summer of 2005 in the southeastern part of the United States. This workshop includes interactive and active learning style lab sessions modeling instructional use of Alice as well as a focus on pedagogical issues related to teaching with Alice.<br\/><br\/>Intellectual Merit: This project extends the use of the Alice environment to a broad educational and research community. It includes not only instructional experiences but also the development of a significant set of resources and curricular materials that are of value to the computing community. The project extends and leverages the significant funding the PIs have received to develop and disseminate Alice which is now in use by over 100 institutions and countless researchers.<br\/><br\/>Broader Impact: This project extends the Alice community to a new geographical area, the west coast. The Alice environment with its 3D animation approach is a fundamental paradigm shift of methodology for teaching problem solving and programming. The Alice workshop is essential for faculty adopting this approach. Alice has also shown potential to broaden participation in computing through its human-centered, interactive approach and thus promote diversity and the inclusion of underrepresented groups in computing.","title":"Alice Workshop 2007, Southwestern US","awardID":"0724890","effectiveDate":"2007-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["351237","458384","452174"],"PO":["564181"]},"125553":{"abstract":"Despite great strides in the development of automatic speech recognition technology, we do not yet have a system with performance comparable to humans in automatically transcribing unrestricted conversational speech, representing many speakers and dialects, and embedded in adverse acoustic environments. This approach applies new high-dimensional machine learning techniques, constrained by empirical and theoretical studies of speech production and perception, to learn from data the information structures that human listeners extract from speech. To do this, we will develop large-vocabulary psychologically realistic models of speech acoustics, pronunciation variability, prosody, and syntax by deriving knowledge representations that reflect those proposed for human speech production and speech perception, using machine learning techniques to adjust the parameters of all knowledge representations simultaneously in order to minimize the structural risk of the recognizer. The team will develop nonlinear acoustic landmark detectors and pattern classifiers that integrate auditory-based signal processing and acoustic phonetic processing, are invariant to noise, change in speaker characteristics and reverberation, and can be learned in a semi-supervised fashion from labeled and unlabeled data. In addition, they will use variable frame rate analysis, which will allow for multi-resolution analysis, as well as implement lexical access based on gesture, using a variety of training data. <br\/>The work will improve communication and collaboration between people and machines and also improve understanding of how human produce and perceive speech. The work brings together a team of experts in speech processing, acoustic phonetics, prosody, gestural phonology, statistical pattern matching, language modeling, and speech perception, with faculty across engineering, computer science and linguistics. Support and engagement of students and postdoctoral fellows are part of the project, engaging in speech modeling and algorithm development. Finally, the proposed work will result in a set of databases and tools that will be disseminated to serve the research and education community at large.","title":"RI: Collaborative Research: Landmark-based Robust Speech Recognition Using Prosody-Guided Models of Speech Variability","awardID":"0703859","effectiveDate":"2007-06-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["246649","508500"],"PO":["565215"]}}