{"210752":{"abstract":"The explosive growth in bandwidth represented by advances in optical communication and networking technologies has underpinned the increasing reach and reliability of the Internet in the last two decades. However, the potential impact of increasingly sophisticated recent advances in optical technology, such as rapid switching and elastic wavelengths, have not yet been realized. The main cause of this is that such technology, while possible to integrate into the data plane of planetary networking, is difficult to accommodate in the current planning, management, and control strategies.<br\/><br\/>In this project, we will work hand-in-hand with collaborating researchers from NICT, Japan, who are working to realize a novel technology of hybrid optical packet\/circuit switching. Such a technology could be immensely useful to large transport network operators, but there are no existing algorithms that can easily determine how a provider can provision their resources between the circuit and packet possibilities on an ongoing dynamic basis.<br\/><br\/>We take a novel approach to this problem, utilizing the concept of a \"choice marketplace\" that embodies sophisticated rendezvous semantics between customer and provider, and allows them to cooperatively guide network resource provisioning to dynamically fulfill network objectives such as maximizing performance received by network traffic. Our approach provides social benefit by balancing of various objectives, such as network utilization, latency, and the increasingly important metric of energy expenditure in the network. Our work will provide an early prototype of how customers can shop for network transport services in a competitive marketplace, allowing provider ecosystems to emerge for mutual advantage. The project will integrate research and prototyping activities into education, and utilize the US-Japan collaboration to provide broadening of students' educational horizons.","title":"NeTS: JUNO: Service Offering Model and Versatile Network Resource Grooming for Optical Packet and Circuit Integrated Networks","awardID":"1402053","effectiveDate":"2014-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564672],"PO":["564993"]},"210766":{"abstract":"Today's Internet connects more and more devices. It has been predicted that by 2020, 50 billion \"smart\" embedded devices will be connected to the Internet. As the address space is nearly exhausted, the increasing users, applications, services, and devices pose a great demand on the Internet. At the same time, Internet users expect to have any information\/service available at their fingertips. This exacerbates the need for a highly available and scalable Internet.<br\/><br\/>The project aims to meet the scalability and reliability demands of diverse applications, services and trillions of devices. The proposed architecture, referred to as LOcation-based Routing and ID-based Forwarding or LORIF, supports data forwarding based on the ID of a destination host, while maintaining routes based on the topological locations of the end host. Each host may have multiple locations representing its topological identity. Through a novel service for mapping host ID to network location(s), LORIF enables the control plane to scaleably exploit path diversity, while at the same time, facilitating data plane to improvements in end-to-end reliability.<br\/><br\/>LORIF brings significant benefits to users and the society by enhancing the scalability and reliability of our communication infrastructure. This project brings together an international team of researchers from diverse and complimentary backgrounds. Such a collaboration enables the feasibility of deploying the testbed across the continents, and enhances the odds of adoption in the future. This project will train graduate and undergraduate students in network architecture design and testbed development.","title":"NeTS: JUNO: Collaborative Research: Location-Based Forwarding and ID-Based Routing (LORIF) for the Future Internet","awardID":"1402594","effectiveDate":"2014-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564706],"PO":["564993"]},"210775":{"abstract":"Today's Internet connects more and more devices. It has been predicted that by 2020, 50 billion \"smart\" embedded devices will be connected to the Internet. As the address space is nearly exhausted, the increasing users, applications, services, and devices pose a great demand on the Internet. At the same time, Internet users expect to have any information\/service available at their fingertips. This exacerbates the need for a highly available and scalable Internet.<br\/><br\/>The project aims to meet the scalability and reliability demands of diverse applications, services and trillions of devices. The proposed architecture, referred to as LOcation-based Routing and ID-based Forwarding or LORIF, supports data forwarding based on the ID of a destination host, while maintaining routes based on the topological locations of the end host. Each host may have multiple locations representing its topological identity. Through a novel service for mapping host ID to network location(s), LORIF enables the control plane to scaleably exploit path diversity, while at the same time, facilitating data plane to improvements in end-to-end reliability.<br\/><br\/>LORIF brings significant benefits to users and the society by enhancing the scalability and reliability of our communication infrastructure. This project brings together an international team of researchers from diverse and complimentary backgrounds. Such a collaboration enables the feasibility of deploying the testbed across the continents, and enhances the odds of adoption in the future. This project will train graduate and undergraduate students in network architecture design and testbed development.","title":"NeTS: JUNO: Collaborative Research: Location-Based Forwarding and ID-Based Routing (LORIF) for the Future Internet","awardID":"1402857","effectiveDate":"2014-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["521123"],"PO":["564993"]},"210839":{"abstract":"Delivering high-speed, pervasive wireless services to trillions of mobile devices requires a significant transformation to today's wireless cellular networks. Hyper-dense heterogeneous networks (HDHNs), enabled via a viral and large-scale deployment of small cell base stations and mobile devices, are seen as one of the cornerstones of this transformation. However, most existing network design and optimization techniques fall short in handling the scale, density, sustainability, and dynamics of such HDHNs.<br\/><br\/>This project contributes to the foundations of HDHNs via innovations that include novel mobility state estimation techniques, optimized cell selection and handover methods, and a new game-theoretic framework for self-organizing resource management in energy-efficient HDHNs. The proposed approaches will be evaluated and enhanced via implementation on an experimental testbed using software radio and open source platforms. <br\/><br\/>Boosting the performance of wireless systems will have societal impacts via enablement of novel mobile services requiring high-performance network connectivity. The project results will also support the analysis of dense networks and the development of future wireless standards and products. As a new Japan-US collaboration the project will build long-term relationships between US and Japanese researchers designing sustainable, energy-efficient and dense wireless systems. The project will create new educational and outreach activities to attract under-represented minorities to the field of sustainable HDHNs.","title":"NeTS: JUNO: Energy-Efficient Hyper-Dense Wireless Networks with Trillions of Devices","awardID":"1406947","effectiveDate":"2014-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564874],"PO":["564993"]},"210841":{"abstract":"Delivering high-speed, pervasive wireless services to trillions of mobile devices requires a significant transformation to today's wireless cellular networks. Hyper-dense heterogeneous networks (HDHNs), enabled via a viral and large-scale deployment of small cell base stations and mobile devices, are seen as one of the cornerstones of this transformation. However, most existing network design and optimization techniques fall short in handling the scale, density, sustainability, and dynamics of such HDHNs.<br\/><br\/>This project contributes to the foundations of HDHNs via innovations that include novel mobility state estimation techniques, optimized cell selection and handover methods, and a new game-theoretic framework for self-organizing resource management in energy-efficient HDHNs. The proposed approaches will be evaluated and enhanced via implementation on an experimental testbed using software radio and open source platforms. <br\/><br\/>Boosting the performance of wireless systems will have societal impacts via enablement of novel mobile services requiring high-performance network connectivity. The project results will also support the analysis of dense networks and the development of future wireless standards and products. As a new Japan-US collaboration the project will build long-term relationships between US and Japanese researchers designing sustainable, energy-efficient and dense wireless systems. The project will create new educational and outreach activities to attract under-represented minorities to the field of sustainable HDHNs.","title":"NeTS: JUNO: Energy-Efficient Hyper-Dense Wireless Networks with Trillions of Devices","awardID":"1406968","effectiveDate":"2014-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564879],"PO":["564993"]},"210842":{"abstract":"Optical networks have expanded their reach from national backbone networks to metropolitan and customer access networks, and are making their way into datacenters. This has been made possible due to great strides in two arenas: optical switching technology including the development of reconfigurable optical add-drop multiplexers and wavelength-selective switches; and efficient transmission methods that enable flexible provisioning of elastic bandwidth to applications. Nevertheless, there are fundamental fiber capacity limitations that will inevitably necessitate multiple parallel fibers between switching nodes and larger switches. A solution to the switch-scaling problem is to bundle some of the wavelengths or frequency slots together and switch them as a band. Yet, current methods are inadequate because technological advancements have rendered some of the research obsolete or have introduced new problems that have not been attempted before.<br\/><br\/>The objectives of this joint US-Japan project are to develop novel scalable and cost-effective multi-granular switching node architectures, and to develop efficient algorithms for provisioning bandwidth to applications. Scaling an architecture typically introduces some form of penalty, such as a provisioning constraint, that the network operator must respect. This project will aim at identifying what features bring about the most cost reduction and increase in scalability without overly limiting network operators? flexibility. The architectures and algorithms will be evaluated using theoretical analyses, simulations, and small-scale experiments.<br\/><br\/>By targeting an important component of the cost of optical networks, this project will enable the faster adoption of optical infrastructure and the availability of high-speed networking for all.","title":"NeTS: JUNO: Cost-Effective and Scalable Architectures for Multi-Granular Optical Networks","awardID":"1406971","effectiveDate":"2014-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564881],"PO":["564993"]}}