{"203467":{"abstract":"This award supports the travel of US doctoral students to, and their participation in the Twelfth International Joint Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2013), and the doctoral consortium to be held in conjunction with it. <br\/><br\/>AAMAS is the premier international conference devoted to all aspects of agent technology and its applications in the World Wide Web, electronic commerce, digital libraries, search, personalization, etc. The Doctoral Consortium offers the students an opportunity to present their research and receive in-depth feedback from senior researchers. Students will benefit from attending the conference, with its rich technical program of contributed and invited research talks, complemented by focused workshops, tutorials and other events. <br\/><br\/>The student travel awards will help enrich the eduation and training of a diverse group of young researchers, including women and members of underrepresented groups, working in Artificial Intelligence in general, and Autonomous Agents and Multi-Agent Systems in particular.","title":"Doctoral Mentoring Consortium at the Twelfth International Conference on Autonomous Agents and Multi-Agent Systems","awardID":"1308505","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[545120],"PO":["565136"]},"207856":{"abstract":"This grant provides travel support for selected students attending the annual Symposium on Combinatorial Search (SoCS). Student participation in SoCS encourages young investigators in their research in combinatorial search. This symposium carries on a tradition of bringing together researchers and students around issues of pattern-database heuristics, inconsistent heuristics, real-time search, path-finding for physical robots and computer-game agents, parallel search, and search using external memory. These search techniques have a significant place in broader AI application in areas such as robotics, computer games, planning, and bioinformatics. In addition, SoCS 13 includes a special focus on graph search engineering.","title":"EAAI-13: The Fourth Annual Symposium on Educational Advances in Artificial Intelligence","awardID":"1337085","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[556572],"PO":["565035"]},"199177":{"abstract":"The objective of this research is an injection of new modeling techniques into the area of Cyber-Physical Systems (CPSs). The approach is to design new architectures for domain-specific modeling tools in order to permit feedback from analysis, validation, and verification engines to influence how CPSs are designed. This project involves new research into the integration of existing, heterogeneous modeling languages in order to address problems in CPS design, rather than a single language for all CPS. Since many tools for analysis, validation, and verification focus on at most two of the three major components of CPS (communication, computation, and control), new paradigms in modeling are used to integrate tools early in the design process. The algorithms and software developed in this project run validation and verification tools on models, and then close the loop by using the tool outputs to automatically modify the system models.<br\/><br\/>The satisfaction of design requirements in CPSs is critical for tomorrow's societal technologies such as smart buildings, home healthcare, and water management. Among the most compelling design requirements are those of safety, and CPSs for autonomous vehicles exemplify this well. By involving a full-sized autonomous vehicle in this project, the validation and verification of safety requirements is tied to a concrete platform that is broadly understood. By involving students in the design of behaviors of the vehicle, the project exposes scientists and engineers of tomorrow to societal-scale problems, and tools to address them.","title":"CAREER: Domain-Specific Modeling Techniques for Cyber-Physical Systems","awardID":"1253334","effectiveDate":"2013-05-01","expirationDate":"2018-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":["565273"],"PO":["564778"]},"202797":{"abstract":"Abstract: RouteViews is a system for systematically collecting data on the routes (the paths by which data gets from point A to point B) used by Internet traffic. It has played a critical role in the study of significant events, such as large scale outages, that have taken place in the Internet. The RouteViews data archives are the most widely used source of Internet routing data for the computer networking, network operations and network security communities. They are also increasingly being used in studies of network topological growth and network economics. However, access to the RouteViews data has been challenging to new users since the data is current structured as flat binary files with no simple interfaces for searching or accessing the data.<br\/><br\/>This project will design and implement database access to the RouteViews data, and will develop simple interfaces and tools for accessing the data. The resources used to acquire and store the data will also be expanded. The project will open up the use of routing data to a broader community including undergraduate education. It will work with the community to raise awareness about the potential uses of routing data in research and education, and will promote the use of the new access methods.<br\/><br\/>The project will expand routing data collection, will make it easier to access the collected data and will benefit networking research, network operations and network security.","title":"Collaborative Research: CI-ADDO-EN: Making Internet Routing Data Accessible To All","awardID":"1305218","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8027","name":"Cyber Secur - Cyberinfrastruc"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[543493],"PO":["564993"]},"201004":{"abstract":"This funding renews a highly successful CISE Research Experiences for Undergraduates (REU) site at the University of Houston. The theme of this site is algorithm design and analysis focusing on real-time, parallel, data-intensive problems in large-scale heterogeneous, and highly distributed modern computing environments. Students will receive ten-week intensive training in specific research fields as well as basic research skills including literature review, algorithm design and implementation, experiment setup, data analysis, technical writing and presentation. The research projects are interdisciplinary and an emphasis will be placed on teamwork and collaboration. Local researchers from the Texas Medical Center, NASA Johnson Space Center, and oil industry will helps provide mentoring to the students.<br\/><br\/>This site will introduce 30 undergraduate students (over three years) to computing research, with a goal of directing more U.S. undergraduates into graduate computing programs. The host institution is both a Hispanic Serving Institution as well as a Minority Serving Institution, so this project will help attract minority students into STEM programs.","title":"REU Site: Research Experiences in Algorithm Design and Analysis for Students in Undergraduate Institutions","awardID":"1262928","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[538902,538903],"PO":["564588"]},"202357":{"abstract":"Clemson University, in collaboration with the University of Alabama, Auburn University, Carnegie Mellon University, Rice University, University of Wisconsin-Madison, and Winston-Salem State University, propose to extend the work of multiple NSF BPC Alliances (A4RC, ARTSI, EL Alliance) and Demonstration Projects (AARCS) that utilized different strategies toward broadening the participation of African-Americans in computing sciences. Although these previous alliances and demonstration projects differed with respect to implementation strategies, they all had a strong emphasis on mentoring. As such, the newly combined Institute for African-American Mentoring in Computing Sciences (iAAMCS, pronounced \"i am cs\") will serve as a national resource and emphasize mentoring as the primary strategy for increasing the participation of African-Americans in computing, specifically at the Ph.D. level and beyond. The overarching goal of the iAAMCS is to increase the number of African-Americans obtaining computing sciences doctoral degrees leading to an increase in the number of African-American researchers in the academy, government, and industry. Toward this goal, the iAAMCS Alliance will (1) increase the number of African-American Ph.D. graduates who enter the workforce with a research focus; (2) retain and advance African-American Ph.D. students, faculty and researchers in computing; and (3) develop future African-American leaders with computing expertise in the academy, government, and industry. The iAAMCS will be evaluated by a prestigious advisory committee consisting of experts from computing as well as an external peer evaluation conducted by the new Center for the Evaluation of the Research Pipeline (CERP).","title":"NSF BPC-A: Institute for African-American Mentoring in Computing Sciences (iAAMCS)","awardID":"1303156","effectiveDate":"2013-05-01","expirationDate":"2018-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[542298,542299,542300,542301,"560700"],"PO":["560704"]},"199257":{"abstract":"Software development is a complex socio-technical activity typically occurring concurrently, in distributed teams, and within the larger organizational goals and context. Current development tools are overwhelmed by the scale of software-intensive systems, and often end up contributing to, rather than minimizing, information overload, and coordination breakdowns, which ultimately lead to software conflicts and project delays.<br\/><br\/>This research seeks to establish an understanding of how past development data and team practices can be used to proactively identify dependencies and constraints across tasks, and schedule tasks so as to minimize conflicting changes in parallel, distributed development. This work will contribute: (1) conflict typology formalizing software conflicts and their interplay with organizational context, (2) knowledge about how to achieve improvements in productivity, quality, and development speed, (3) a suite of analysis techniques, design principles, tool prototypes, and interaction methods for conflict minimization in distributed, parallel development. Evaluation includes deployment to real software development teams and controlled experiments of the efficacy of the resulting tools. The broader impacts of the work are ultimately to enable software teams to develop software in a conflict-free environment and train students on critical processes associated with collaboration competency.","title":"CAREER: Conflict Minimization in Distributed Software Development","awardID":"1253786","effectiveDate":"2013-05-15","expirationDate":"2018-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["548131"],"PO":["564388"]},"207915":{"abstract":"The International Symposium on Computer Architecture (ISCA) is a premier forum for presenting, discussing<br\/>and debating new and innovative architectural ideas and techniques for advanced computing and<br\/>communication systems. This symposium brings together researchers in fields related to processor architecture,<br\/>compilers, chips, and systems. This proposal aims to support this highly regarded conference by<br\/>obtaining travel support for students in order to defray the costs of attending and participating in the ISCA<br\/>conference in June, 2013 in Tel Aviv, Israel. Priority will be given to US<br\/>citizens and permanent residents, students from under-represented groups, and students<br\/>that will be presenting their research at ISCA or its joint workshops. <br\/>The ISCA conference will be strengthened as a<br\/>result of the greater attendance that this travel support will enable. Students receiving travel<br\/>support will personally benefit from the opportunity to interact with peers and experts, as well as establish<br\/>connections that will help their professional careers.<br\/>More broadly, we expect additional indirect impacts. First, we plan to widely advertise the available<br\/>support in order to attract women and under-represented minority groups (through postings on computer<br\/>architecture web-sites and mailing lists). Second, by focusing on students, the grant will help foster the<br\/>mentoring of subsequent generations of computer architects.","title":"Student Travel Support for the 2013 International Symposium on Computer Architecture (ISCA-40)","awardID":"1337380","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":[556789],"PO":["366560"]},"203824":{"abstract":"A Scalable Data Management Abstraction for Large-scale Coupled Simulation Workflows<br\/><br\/>Coupled scientific simulation workflows, integrating multiple physics and scales and running at very large scales on high-end resources, have the potential for achieving unprecedented levels of accuracy and providing dramatic insights into complex phenomena. However, the coupled component of these simulation workflows need to interact and exchange significant amounts of data at runtime, and the data often has to be transformed as it flows from source to destination. As the volumes and generation rates of this data grow, the costs (latencies and energy) associated with extracting this data and transporting it for coupling, transformation and analysis have become the dominating overheads and are dictating the level of performance and productivity that can be achieved.<br\/><br\/>The goal of this project is to address these challenges and to develop conceptual solutions as well as a software framework that can enable the large-scale data-intensive simulations. Our approach is based on the premise that given the large data volumes and associated costs, data will have to be largely processed online, ?in-situ? and ?in-transit? while it is staged using resources within the computational platform, and the programming and runtime system must provide abstractions and mechanisms that facilitate such data processing. Our effort is organized around three key research thrusts: (1) Programming abstractions for in-situ\/in-transit data management; (2) Design and implementation of a scalable data staging substrate; and (3) Data-centric mapping and scheduling.<br\/><br\/>Data and compute intensive simulations are becoming increasingly critical to a wide range of science and engineering domains, and as a result, this research has the potential to drive research and innovations in these domains. The developed framework and benchmarks also provide computer scientists with a substrate to experiment with and explore data-centric research. The development of human resources, including the training of students, researchers and software professions, as well as outreach to minorities and underrepresented group, is integral to all aspects of this effort.","title":"Scalable Data Coupling Abstraction for Data-Intensive Simulation Workflows","awardID":"1310283","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"8084","name":"CDS&E"}}],"PIcoPI":["558205","558206"],"PO":["565292"]},"201955":{"abstract":"This award establishes a new Research Experiences for Teachers Site at Appalachian State University. High school teachers and community college faculty from a ten county region surrounding the university will work on summer research with their university faculty mentors. The research covers a range of computing disciplines including data analysis and mining, image processing and visualization. The educators will also develop inquiry-based classroom modules and curricular materials related to their research and then implement the models in their classes during the academic year. Workshops will be held to train additional teachers to use the materials. The program hopes to build a community of educators that can work together to integrate computing concepts into STEM education in the participating school districts and to establish partnerships that continue to thrive and provide leadership to ensure quality computing education in the region.<br\/><br\/>The intellectual merit of this project is in the research focus on data mining and visualization, two areas that are current and of importance to the computing disciplines. The university faculty has outstanding expertise and resources to lead the site. The project team has significant related research and experience in educational applications and K-12 school outreach. The projects are compelling and current and of interest to the teachers and their students. <br\/><br\/>The broader impacts of the project include providing a quality research experience to teachers and the infusion of sound instructional models into the K-12 schools and community colleges. The project includes outreach to a large community of teachers in Appalachian region and should impact a student population in a rural area where there are limited opportunities for students. The materials will be broadly disseminated for use by others. The project has the potential to create a sustainable partnership between the university and schools thus benefiting the area for years to come.","title":"RET in Engineering and Computer Science Site: Data Analysis and Mining, Image Processing and Visualization at Appalachian State University","awardID":"1301089","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}}],"PIcoPI":["552235",541268],"PO":["564181"]},"205915":{"abstract":"This project supports the Doctoral Consortium held with the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) in Portland, Oregon, in June 2013. CVPR is the premier annual conference with about 2000 senior and student participants in computer vision, held in North America and attended by members of the international research community. The goal of the Doctoral Consortium is to highlight the work of senior Ph.D. students, who are close to finishing their degrees, or recent graduates, and to give these students the opportunity to discuss their research with senior researchers matched with their expertise. NSF support covers some of the costs for the selected US graduate students to attend the conference. <br\/><br\/>The intellectual merit of this project rests in the selection of top-quality Ph.D. students whose research is showcased and to whom feedback is provided by senior researchers. The opportunity to receive advice on their research and career plans from experts from different institutions, and with potentially different perspectives, in many cases is not available internally within one's own institution. The broader impacts of this project include supporting the career development of some of the brightest junior researchers in computer vision, contributing to the research community in general by drawing attention to an important aspect of graduate student development, and potentially increasing the number of active researchers and teachers in STEM. The doctoral consortium event aims to have representation from a diverse group of participants in terms of gender, ethnic background, academic institution and geographic location.","title":"Group Travel Grant for the Doctoral Consortium of the IEEE Conference on Computer Vision and Pattern Recognition","awardID":"1321408","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[551285],"PO":["564316"]},"200966":{"abstract":"This funding will establish a new CISE Research Experiences for Undergraduates (REU) Site at the University of Maryland-College Park. This Site focuses on research in combinatorial algorithms, which are algorithms that work on discrete objects such as numbers, graphs, or data where one needs to optimize over a space of possible solutions. To help create a climate in which students learn new techniques, understand a few real world problems, and work on designing and implementing algorithms, the students will be involved in applied algorithms research projects that will be jointly advised by members of the UMD theory group in conjunction with faculty in different research areas, such as systems, artificial intelligence, and databases.<br\/><br\/>This REU Site will support eight undergraduate students for ten weeks each year. The Site will recruit computer science, computer engineering, and mathematics majors, with a focus on students from Historically Black Colleges and Women's colleges. The Site will help bridge the gap between theory and practice, which will benefit both as it gives theorists new and exciting problems and non-theorists tools they can use. The students will have the opportunity to see what research is like, obtain a solid grounding in algorithms, and encourage them to go to graduate school.","title":"REU Site: CAAR: Combinatorial Algorithms Applied Research","awardID":"1262805","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":[538795,538796],"PO":["564588"]},"202836":{"abstract":"Abstract: RouteViews is a system for systematically collecting data on the routes (the paths by which data gets from point A to point B) used by Internet traffic. It has played a critical role in the study of significant events, such as large scale outages, that have taken place in the Internet. The RouteViews data archives are the most widely used source of Internet routing data for the computer networking, network operations and network security communities. They are also increasingly being used in studies of network topological growth and network economics. However, access to the RouteViews data has been challenging to new users since the data is current structured as flat binary files with no simple interfaces for searching or accessing the data.<br\/><br\/>This project will design and implement database access to the RouteViews data, and will develop simple interfaces and tools for accessing the data. The resources used to acquire and store the data will also be expanded. The project will open up the use of routing data to a broader community including undergraduate education. It will work with the community to raise awareness about the potential uses of routing data in research and education, and will promote the use of the new access methods.<br\/><br\/>The project will expand routing data collection, will make it easier to access the collected data and will benefit networking research, network operations and network security.","title":"Collaborative Research: CI-ADDO-EN: Making Internet Routing Data Accessible To All","awardID":"1305404","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["559197","559197","559198","559198"],"PO":["564993"]},"193565":{"abstract":"Computer interpretation of images has taken huge strides in recent years, but even the most modern algorithms can't come close to matching human capabilities on simple visual tasks. For example, in a brief glance at an image, people reflexively classify the objects in it in terms of the categories they belong to--people, animals, tools, and other significant classes. This allows us to understand the objects' meaning in the image, for example understanding that a scene with many pieces of food might be a dinner table. Because even modern computer vision systems can't make such a classification, they can't automatically detect when an object in a scene doesn't belong, that is, when it is abnormal relative to the categories present in the scene. Detecting such \"oddball\" or atypical objects is essential to understanding visual scenes, because objects that don't belong are often the ones that play the most important role and require immediate action (like a cat on the dinner table). Studies of human subjects have shown that humans are indeed especially adept at detecting atypical items, which often draw our visual attention even before we become consciously aware of them.<br\/><br\/>This project aims at developing algorithmic techniques to endow computer visions systems with the same ability. By adapting modern vision techniques to mimic the way human observers classify visual atypicality, researchers will develop computer systems that can examine an image and automatically detect abnormal objects, as well as identifying the nature of the abnormality and quantifying the degree of abnormality. The project involves a collaboration among researchers at multiple universities and multiple scientific specialties, including both computer vision and human vision. The result will be a new and useful class of computer vision techniques that can be applied to visual image understanding in many contexts.","title":"RI: Small: Collaborative Research: Detecting Abnormalities in Images","awardID":"1218683","effectiveDate":"2013-05-15","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[518405],"PO":["564318"]},"202817":{"abstract":"Abstract: RouteViews is a system for systematically collecting data on the routes (the paths by which data gets from point A to point B) used by Internet traffic. It has played a critical role in the study of significant events, such as large scale outages, that have taken place in the Internet. The RouteViews data archives are the most widely used source of Internet routing data for the computer networking, network operations and network security communities. They are also increasingly being used in studies of network topological growth and network economics. However, access to the RouteViews data has been challenging to new users since the data is current structured as flat binary files with no simple interfaces for searching or accessing the data.<br\/><br\/>This project will design and implement database access to the RouteViews data, and will develop simple interfaces and tools for accessing the data. The resources used to acquire and store the data will also be expanded. The project will open up the use of routing data to a broader community including undergraduate education. It will work with the community to raise awareness about the potential uses of routing data in research and education, and will promote the use of the new access methods.<br\/><br\/>The project will expand routing data collection, will make it easier to access the collected data and will benefit networking research, network operations and network security.","title":"Collaborative Research: CI-ADDO-EN: Making Internet Routing Data Accessible To All","awardID":"1305346","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[543560],"PO":["564993"]},"198749":{"abstract":"This award is to support development and test the accelerated, efficient reconstruction and beam-forming algorithms for radio astronomical detectors. When possible, computations will be ported out to the Graphics Processing Unit (GPU) clusters that provide massively parallel floating-point capabilities. This approach is ideally suited to the data generated by digital radio astronomy arrays, and especially well suited when the respective hardware is deployment at remote observation sites - because of the proposed algorithms show excellent performance-to-power efficiency when compared to general-purpose supercomputers. Additionally, the real-time (Field Programmable Gate Arrays) FPGA-based algorithms will be developed for radio transient data reduction. They will help developing accelerated radio simulation methods to support and validate the proposed methodology. These algorithms and methodology will be tested at the Askaryan Radio Array (ARA), an array of in-ice antennae deployed in the U.S. Antarctic South Pole Station to detect highest-energy neutrinos coming from the deep Universe sources. The award's broader impacts are in the use of high-performance parallel computing and efficient real-time data reduction in the fields of radio astronomy, cosmology, and particle astrophysics. Expansion of the use of GPUs will provide the necessary computing power for next-generation experiments in a sustainable, efficient way. The post-doctoral researcher and graduate student will be part of the overall development and testing. In addition, undergraduate students will also be involved in the research. An on-line public research component will be developed to engage \"citizen scientists\" in the analysis of radio astronomy data on home computers.","title":"BIGDATA: Small: DCM: DA: Advancing real-time data processing and reduction in radio astronomical detectors","awardID":"1250720","effectiveDate":"2013-05-15","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"5407","name":"POLAR CYBERINFRASTRUCTURE"}}],"PIcoPI":["564217","564215",533221],"PO":["565272"]},"199608":{"abstract":"CIF21 DIBBs: Designing the Roadmap for Social Network Data Management <br\/>Scholarly interest in network analysis has increased dramatically in the social sciences and beyond. The explosion of social media tools such as Facebook, Flickr, and Twitter, along with new developments in machine learning and data mining have produced new types of behavioral data for scholars to analyze (Mislove et al., 2007). Significant advances in mathematics, statistics, and computer science have also produced unprecedented opportunities to analyze ?Big? social network data. Social network analysis sits at the cutting edge of social science and also links the social, natural, and computational sciences. Understanding the multi-faceted nature of social networks and their effects on human behavior is one of the grand challenges faced as this project seeks to maximize our investments in scientific research (NSF-ACCI, 2011). However, the community has not seen comparable advances in the management, archiving, and sharing of social network data. This presents a fundamental obstacle to advancing network science across the social, natural, and computational sciences. This proposal seeks to begin to remedy this problem. The data management needs social network scholars are complex. Network data often come from unstructured environments that require researchers to define and describe a set of units or actors (called nodes) and the connections (called edges) between them. Networks might be static or dynamic, include one type of node or multiple node types, and include edges that are uni-directional or bi-directional and weighted or unweighted. In addition, as relationships spread within the network and\/or a network grows, the associated data management, data storage, and analytical memory requirements can grow exponentially. This proposal brings together the social network analysis, information science, computer science, and data archive communities to develop a data infrastructure to support advanced analysis and research on social networks as well as to facilitate data sharing and archiving within this community. The group will address key questions concerning data storage architecture and lifecycle requirements, develop design specifications for creating a sustainable data infrastructure that will be discoverable, searchable, accessible, and usable to the entire research and education community, and initialize a prototype solution based on that plan. Intellectual Merit: The proposed project will bring together the social network analysis community to work with information technology professionals to design a robust data management infrastructure to promote the sharing and interoperability of social network data. Effective data management for social network data amplifies the impact of research by revealing data quality issues early in the data collection process, ensuring that required data is retained and usable throughout the life of a research project. It also facilitates data sharing and reuse. A key to responsible data stewardship is the application and auditing of quality data management policies ? something included in this proposal. Providing a robust infrastructure to store, analyze, curate, share, and manage important social network data will increase researchers? production and provide an unprecedented view of the social world only visible through social network data. Broader Impacts: The project will facilitate data sharing and increase social network data availability while assuring researchers that data management policies are followed. It will help formalize a community of network data experts that will begin developing best practices for the community. Availability of data particularly benefits early-stage researchers, and researchers at diverse institutions. Widespread availability of data facilitates citizen science and the integration of science and teaching at all levels of education. Managed data sharing is critical to the multi disciplinary research to answer the critical challenges facing society today. It would be difficult to overstate the importance of social network analysis to better understand human networks and social behavior.","title":"CIF21 DIBBs: Designing the Roadmap for Social Network Data Management","awardID":"1255826","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":["557802"],"PO":["565292"]},"196826":{"abstract":"Harvey Mudd College will adapt exemplary educational resources to create MyCS, a CS curriculum whose goal is to develop positive computational identities among middle-school students. A positive computational identity subsumes self-efficacy, enjoyment, and future engagement with creating computation. The project's approach existing pedagogical resources into three distinct MyCS variations. Inspired by UCLA's high-school course, Exploring Computer Science (ECS), the first variation broadly explores computational concepts and skills. The second variation is a depth-based development of programming skills through Scratch and web technologies, adapting several successful middle- and high-school courses. The third variation is a hybrid that punctuates skill-building in Scratch and web programming with curricular breaks contextualizing those skills. The project investigates how teachers and students respond to these different MyCS realizations. The project team will compare results within and among the primary partnering school district, Pomona Unified in Pomona, CA, along with our two secondary partnering districts, Lihue, HI and San Bernardino, CA. In order to maximize the number of students reached, the project focuses on middle-school teacher development through summer workshops and academic-year support.<br\/><br\/>Computation has become a crucial component of every modern endeavor. It has not, however, become a component of every modern student's identity. That is, the number of students who feel that \"computation is something that people like me create\" lags significantly behind the demand for computational creativity, both now and in the foreseeable future. Because of their pivotal role in early identity-formation, the middle-school years provide a window of opportunity to build a positive computational identity and to prime the pump for the ambitious CS10k project. To that end, this project develops, deploys, and assesses several variations of a middle-years computer-science curriculum, MyCS. The project team will build MyCS communities within targeted schools in three districts, each with a large majority of students from a distinct group underrepresented in STEM fields. Two key benefits will result. First, those communities will continue to develop computationally confident students even after the project concludes. Second, assessments will cull less effective variations and facets of MyCS, leaving a ready-to-go curriculum that will succeed in further regional deployment and will be prepared for larger-scale vetting, national trials, and broader adaptations.","title":"CER: MyCS - Middle Years Computer Science","awardID":"1240939","effectiveDate":"2013-05-15","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1793","name":"MSP-OTHER AWARDS"}}],"PIcoPI":[527995,527996],"PO":["560704"]},"198806":{"abstract":"This award is for addressing the problem of the increasing amount of cryospheric data being generated at an unprecedented rate, and in particular, for the discoverability and higher-level data analytics such as anomaly detection in these big data flows. This work builds on the results from the previously NSF-awarded project aimed at the development of \"datarods technology\", in which the data are organized in temporal columns (aka \"datarods\") that include multiple time stamps and sensor values stored sequentially but not necessarily as a fixed time interval. These will lead to investigation and development of innovative techniques for the construction of \"Condensate Databases\" that are much smaller (but yet capture key characteristics) of the original datasets. The challenges lie in the fact that cryospheric data are massive and diverse, and have \"normal\" and \"abnormal\" patterns spanning a wide range of spatial and temporal scales. Three main areas of the study are: (1) adaptive neighborhood-based thresholding in both space and time; (2) compressive-domain pattern detection and change analysis; and (3) hybrid condensation of multi-modal, multi-scale cryospheric data. The techniques and software developed will be shared publicly via the National Snow and Ice Data Center (NSIDC) existing support platform, and publicized via scientific publications and presentations at top-tier conferences such as the America Geophysical Union meetings. The next generation of scientists and technical professionals will be trained in the interdisciplinary domain of Big Data management, data analytics, and scientific discovery through the student curriculum integration, distance learning, and education workshops.","title":"BIGDATA: Small: DCM: ESCE: Condensate Database for Efficient Anomaly Detection and Quality Assurance of Massive Cryospheric Data","awardID":"1251257","effectiveDate":"2013-05-15","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"5407","name":"POLAR CYBERINFRASTRUCTURE"}}],"PIcoPI":["555576",533362],"PO":["565272"]},"193607":{"abstract":"Computer interpretation of images has taken huge strides in recent years, but even the most modern algorithms can't come close to matching human capabilities on simple visual tasks. For example, in a brief glance at an image, people reflexively classify the objects in it in terms of the categories they belong to--people, animals, tools, and other significant classes. This allows us to understand the objects' meaning in the image, for example understanding that a scene with many pieces of food might be a dinner table. Because even modern computer vision systems can't make such a classification, they can't automatically detect when an object in a scene doesn't belong, that is, when it is abnormal relative to the categories present in the scene. Detecting such \"oddball\" or atypical objects is essential to understanding visual scenes, because objects that don't belong are often the ones that play the most important role and require immediate action (like a cat on the dinner table). Studies of human subjects have shown that humans are indeed especially adept at detecting atypical items, which often draw our visual attention even before we become consciously aware of them.<br\/><br\/>This project aims at developing algorithmic techniques to endow computer visions systems with the same ability. By adapting modern vision techniques to mimic the way human observers classify visual atypicality, researchers will develop computer systems that can examine an image and automatically detect abnormal objects, as well as identifying the nature of the abnormality and quantifying the degree of abnormality. The project involves a collaboration among researchers at multiple universities and multiple scientific specialties, including both computer vision and human vision. The result will be a new and useful class of computer vision techniques that can be applied to visual image understanding in many contexts.","title":"RI: Small: Collaborative Research: Detecting Abnormalities in Images","awardID":"1218872","effectiveDate":"2013-05-15","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[518507,518508],"PO":["564318"]},"208360":{"abstract":"This award supports a Future Internet Architecture (FIA) principal investigator (PI) meeting in March 2013. The PIs will discuss two topics; the first is of possible environments in which each of the NSF-funded projects might be deployed and demonstrated. The funded projects are expected to produce a running prototype that can be used to gain operational experience with the ideas as they are reduced to practice. This meeting will bring together the investigators from the various projects and experts representing various possible demonstration environments. The second topic of the workshop is the challenge of evaluation of proposed architectures. The meeting will include a series of discussions around different aspects of architecture evaluation, as the projects position themselves to evaluate their designs.<br\/><br\/>Intellectual Merit:<br\/><br\/>The discussions of demonstration environments, which will bring together outside experts and project leadership, will contribute to a shared understanding of the problems and issues that various user communities face as they incorporate networking technology into their domains. The discussions of evaluation will lay the groundwork for a methodical study of the question as to how to evaluate architectural proposals and argue that one or another design is 'better', or more fit for purpose. The field of computer science today has no agreed method or approach to the evaluation of design proposals in a complex, multi-dimensional requirement space.<br\/><br\/>Broader Impacts:<br\/><br\/>The broader goal of the NSF FIA effort is enhancing the relevance and impact of the NSF-funded network research, intellectual enrichment of the network research community, and the contribution of new concepts and thought leadership to the future of the Internet. The FIA effort, and the workshops in particular, are a means to train a cohort of academic network researchers in the practice of long-range architectural thinking. The program has the potential to contribute to a future Internet that is materially more secure, robust, economically viable, and fit for the needs of society than the Internet of today. The results of this workshop, which will be posted on the FIA website for public dissemination, will be a contribution to this broader goal.","title":"Workshop: Spring 2013 Future Internet Architecture investigator meeting","awardID":"1339471","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["565000"],"PO":["565090"]},"206151":{"abstract":"This award provides support for students to attend the OSG User School and the XSEDE-13 conference in San Diego. The participants will<br\/>learn about the advances and increased sophistication of research that are being enabled by XSEDE and OSG.<br\/>The broader impacts will be through the direct engagement of students who may, in the future, become<br\/>researchers, including underrepresented students, including those at Minority Serving Institutions (MSIs)<br\/>and smaller colleges and universities across the country","title":"XSEDE and OSG 2013 Engagement Program for High School, Undergraduate and Graduate Students","awardID":"1322496","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7244","name":"COMPUTATIONAL PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["559499"],"PO":["558595"]},"206185":{"abstract":"This project funds travel support for students and a few junior faculty to attend the 33rd International Conference on Distributed Computing Systems (ICDCS) to be held in Philadelphia, PA, July 8-11, 2013. ICDCS is a premier conference and has a wide coverage of topics in distributed computing. Attendance will provide an excellent opportunity for students and junior faculty to interact with senior researchers of international standing. The selection of the grantees will be managed via a rigorous application process that will consider the expected benefits and interests of the prospective participants.","title":"Travel Support for the 33rd IEEE International Conference on Distributed Computing Systems","awardID":"1322717","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[551992],"PO":["565255"]},"199190":{"abstract":"Long-life, maintenance-free, self-powered wireless sensor networks (WSNs) could potentially benefit many applications using WSNs with nodes that do not have access to continuous, conditioned power. However, the lifetime of self-powered WSNs has been severely limited by the cycle life and a short life span of rechargeable batteries (RBs), the current popular storage device for energy harvesting wireless sensors. Alternatively, supercapacitors (SCs) have cycle lives on the order of millions and a life span of 20 years or more. Recent advances in SC technology may lead to a paradigm shift from a battery-based to a SC-based design if the adaptive power management can be established to maintain the sustainability of the WSNs, which will generate great interest from many long-life applications.<br\/><br\/>This research project aims to establish the theoretical foundation and applied framework of adaptive power management for supercapacitor-powered wireless sensors, which enables the next generation of perpetual, sustainable operation of environmentally-powered WSNs. This project consists of three main research components: (1) investigate how supercapacitor device characteristics affect power management policies and provide guidelines for SC-powered embedded systems; (2) create practical and accurate SC models for supporting power management research in energy harvesting WSNs; (3) design the SC-aware power management framework that enables sustainable operation of WSNs and evaluate it in laboratory testing and practical SC-based energy harvesting WSNs. <br\/><br\/>This project will significantly advance the understanding of the next-generation SC-based energy harvesting WSNs, and lead to WSNs that can exist for decades on weak ambient energy and provide services required by important applications. In addition, the SC model and power management framework can also have impact on other portable embedded electronics. The educational components of this project include (1) providing research opportunities for graduate and undergraduate students, especially women and members of underrepresented groups; (2) integrating knowledge of state-of-the-art research and recent technological advances into the developed new curricula to provide multidisciplinary training, and inspire interdisciplinary research ideas; (3) developing educational activities in helping K-12 students from underrepresented groups and K-12 teachers from schools with high minority student population and low socioeconomic status.","title":"CAREER: Adaptive Power Management for Supercapacitor-Operated Sustainable Wireless Sensor Networks","awardID":"1253390","effectiveDate":"2013-05-01","expirationDate":"2018-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["266247"],"PO":["565303"]},"208651":{"abstract":"The Center for Elementary Mathematics and Science Education (CEMSE) at the University of Chicago proposes a \"Design Studio\" for computer science education professional development (PD) providers. Attendees will have an opportunity to collaborate with each other and experts from the University of Chicago with the goal of addressing key issues in computer science PD raised by CEMSE's landscape study of computer science PD. That study, \"Building an Operating System for Computer Science Education,\" released in December 2012, contained 14 recommendations for improving computer science education professional development. After findings from that study were presented to PIs from the National Science Foundation's Computing Education for the 21st Century (CE21) program in January 2013, many of the CS 10K practitioners expressed interest in further exploring these recommendations, and the implications for their work.<br\/><br\/>The Design Studio will advance the recommendations of the landscape study by working with a variety of computer science professional development providers in a collaborative process to explore existing literature on effective professional development, review examples of success from other disciplines, and identify opportunities to improve CS professional development for high school teachers. The PD providers will collaborate with each other, as well as with experts from the University of Chicago in a structured and facilitated manner to explore three key questions that have implications for individual PD sites and for the field as a whole:<br\/><br\/>1. How can we move computer science education professional development toward a more coherent vision of what good computer science education and therefore professional development looks like?<br\/>2. How can we move computer science education professional development toward better fitting the needs of the groups that will comprise the computer science teacher workforce?<br\/>3. How can we move computer science education professional development to focus more on teaching and learning in the classroom?","title":"Design Studios: CS Professional Development","awardID":"1341068","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[559330],"PO":["560704"]},"208365":{"abstract":"The past decade has witnessed a sea change in the way that computing systems are designed, programmed, implemented, and evaluated. The advent of multicore technologies has fundamentally reshaped the long-standing contract between hardware and software - no longer can we simply rely on improvements in clock speeds to have our programs run faster. Instead, the burden for improvements in program performance now falls squarely on software and algorithms. Devising new techniques to efficiently and safely exploit multiple cores is the central question facing language designers, compiler writers, and system architects.<br\/><br\/>To help address these challenges, this NSF sponsored workshop will identify future research directions related to High-Level Programming Models for Parallelism, and the transition of such research to industrial practice. The workshop will bring together researchers from academia, industry, and government research labs working in the area of parallelism, including algorithms, architecture, language design and implementation, and runtime systems. The workshop will identify primary challenges in the field, both foundational and infrastructural, and will address the transition of ideas from research to practice.","title":"Workshop on High-Level Programming Models for Parallelism","awardID":"1339507","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[558389,558390],"PO":["564588"]},"208288":{"abstract":"This grant provides travel support for selected students attending the annual Symposium on Combinatorial Search (SoCS). Student participation in SoCS encourages young investigators in their research in combinatorial search. This symposium carries on a tradition of bringing together researchers and students around issues of pattern-database heuristics, inconsistent heuristics, real-time search, path-finding for physical robots and computer-game agents, parallel search, and search using external memory. These search techniques have a significant place in broader AI application in areas such as robotics, computer games, planning, and bioinformatics. In addition, SoCS 13 includes a special focus on graph search engineering.","title":"Symposium on Combinatorial Search - 2013","awardID":"1338995","effectiveDate":"2013-05-15","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[558173],"PO":["565035"]},"208542":{"abstract":"Support is requested for the participation of ~15 researchers from US academic institutions for a three-day workshop, ``Advances in Molecular Programming and Computing: Toward Chemistry as a New Information Technology'', that aims to assess the current state, prospects, and challenges in this new research area. A similar number of researchers from European and Asian countries will be participating, supported by other funding sources. Participation from key industry representatives will also be encouraged.<br\/><br\/>The objective of the workshop is to articulate a vision for the advancement of the information science and technology aspects of molecular chemistry and biochemistry, ranging from molecular devices to DNA nanotechnology to synthetic biology as well as related areas involving information processing and programmability within engineered (and natural) molecular \/ chemical \/ biological systems. The concrete goal is to bring this emerging frontier more prominently to the attention of both US and non-US funding agencies, to explore it from theoretical, scientific, technological, and application perspectives, and to provide an unbiased assessment of its potential and challenges that will inform future decision-making. Through a written report, published along with original research and opinion articles as a formal proceedings, the workshop will explore how chemical and biochemical substrates might emerge as a new information technology in the coming century, and help articulate the challenges, the potential, and the need for vigorous research activity in this area, with an emphasis on how researchers (and funding agencies) with deep experience in information science and technology will be integral to developing this frontier.<br\/><br\/>Intellectual Merit: Molecular programming will provide new insights and solutions to grand challenges in biology, chemistry, materials science, and medicine. In manufacturing it will enable fabrication of complex products from the bottom-up (e.g., programmable materials and devices grown from molecules); in biological engineering it will bring deeper computer science principles to the design of programmable subsystems within living cells. The knowledge gained will clarify the relationship between computation and the physical world---how information can be stored and processed by molecules, the limits of what can be computed and fabricated, and how quickly computation or fabrication can be done for a given energetic cost. While molecular programming will leverage existing tools from computer science, control theory, electrical engineering, and bioengineering, it will also require new approaches to analyzing complex programs, circuits, and networks of molecules.<br\/><br\/>Broader Impact: This workshop will expand the network of scientists and engineers working in molecular programming and bring together a diverse community of researchers who will, over time, build this field.","title":"Speaker support for workshop on advances in molecular programming and computing","awardID":"1340383","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[558957],"PO":["565223"]},"208586":{"abstract":"This is funding to support the Student Design Competition (SDC), which will be part of the 2013 annual RESNA conference to be held June 22-24 in Bellevue, Washington. Today, more than 54 million people in the United States report some type of disability, and this number will likely grow in the coming years as the baby boom generation enters late life. RESNA, the Rehabilitation Engineering and Assistive Technology Society of North America, is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. RESNA's membership consists of individuals and institutions covering a range of disciplines (including researchers, clinicians, suppliers, manufacturers, consumers and educators who work in non-profit and for-profit settings), all of whom are dedicated to promoting the exchange of ideas and information for the advancement of assistive technology. In addition to its annual conference, RESNA conducts a credentialing program for assistive technology practitioners, rehabilitation engineering technologists and suppliers, as well as sponsored projects. RESNA's Technical Standards Board is the U.S. Technical Advisory Group to ANSI, the official United States representative to the International Organization for Standardization (ISO), for the development of ISO standards pertaining to assistive technology and other products for persons with disabilities. More information about RESNA and its annual conference is available online at http:\/\/www.resna.org. <br\/><br\/>The RESNA Student Design Competition fosters innovation and creativity with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference; since then over 250 designs have been identified as winning entries from among over 780 submitted by students from over 124 different universities and institutes of higher learning. Both undergraduate and master's level graduate candidates are eligible to submit entries, which must represent the work of students ONLY; no faculty or professionals may be included as co-authors, although faculty may be mentioned as advisors and\/or mentors. NSF has been a supporter since 2005. This year's funding will enable the SDC to be further expanded and enhanced, so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also distributed electronically to a large number of colleges and universities with engineering and design schools. A team of 5 judges will pre-select entries from up to 10 teams, from which two members each will be invited to attend the conference supported with travel and hotel funds as well as complimentary registration. During a half-day session in which the teams will make presentations before the judges and public audience at the conference, 5 teams will ultimately be selected as the final winners. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. The conference schedule includes a platform session in which finalists will present their designs to the general conference audience; in addition, finalists will have an opportunity to present their projects during the Annual Developers' Forum which highlights new products under development (some past SDC student team designs have been patented and are now available commercially). New this year and incorporated into the conference is a Student Track with specifically designed sessions, including: Rehabilitation Engineering and Technology Careers; Presentation Skills; How to Write for Peer Review Journals; and Engineering Concepts in Assistive Technology: A course for Non-Engineers.<br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. Unique in its primary focus on undergraduates, the event provides participants with experience and skills that help them succeed in their engineering and design careers. It encourages and mentors students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields, and provides an opportunity for the students to network with their peers as well as participants in previous SDC competitions, many of whom are now leaders in service, research, and educational areas related to technology for people with disabilities. Furthermore, continuing a practice started a few years ago, all participants (not just the finalists) will create blog posts that capture and archive their submissions, and these will remain accessible indefinitely through the RESNA and the ATWiki. Thus, those who teach will also be able to share this information with thei","title":"RESNA Student Design Competition: Technology Solutions for People with Disabilities","awardID":"1340824","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[559082],"PO":["565227"]},"202273":{"abstract":"Parallel and distributed computing systems are often a heterogeneous mix of machines. As these systems continue to expand rapidly in capability, their computational energy expenditure has skyrocketed, requiring elaborate cooling facilities, which themselves consume significant energy. The need for energy-efficient resource management is thus paramount. Moreover, these systems frequently experience degraded performance and high power consumption due to circumstances that change unpredictably, such as thermal hotspots caused by load imbalances or sudden machine failures. As the complexity of systems grows, so does the importance of making system operation robust against these uncertainties. The goal of this award is to study stochastic-based models, metrics, and algorithmic strategies for deriving resource allocations that are energy-efficient and robust. The research focus is on deriving stochastic robustness and energy models from real-world data from heterogeneous computing machines; applying stochastic models for resource management strategies that co-optimize performance, robustness, computation energy, and cooling energy; developing novel schemes for real-time thermal modeling; and driving and validating the research with feedback collected from real-world petascale systems (Yellowstone at National Center of Atmospheric Research and Jaguar at Oak Ridge National Lab) and terascale systems (Colorado State University's ISTeC cluster and clusters at Oak Ridge National Lab).<br\/><br\/>The research is expected to realize resource management strategies that are resilient to various sources of uncertainty at run-time while also considering the dynamics of temperature variations and cooling capacity to meet performance guarantees with unprecedented gains in system energy-efficiency in high performance computing environments. By lowering the energy costs and impact of uncertainties associated with computing, this research will ultimately render high performance computing accessible to a wider population of researchers and scientific problems. In the long term, the theoretical foundations and tools that emerge from this research will play a vital role in achieving the grand promise of sustainable computing at extreme scales within realistic power budgets. The broader impacts of the research include: incorporate research results into all levels of teaching, including graduate, undergraduate, secondary, and even elementary education; increase participation by underrepresented groups; and foster close ties with industry and government labs to transfer the developed knowledge quickly into real-world deployments.","title":"SHF:Medium: Energy Efficient and Stochastically Robust Resource Allocation for Heterogeneous Computing","awardID":"1302693","effectiveDate":"2013-05-15","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":[542085,542086,542087,542088],"PO":["565272"]},"206673":{"abstract":"This award will support student travel to the 2013 ACM SIGPLAN Symposium on Programming Language Design and Implementation (PLDI '13), which is being held in Seattle, Washington. PLDI is a top conference in the fields of programming languages and compilers. The funds will help support U.S. students, focusing on Ph.D. students at an advanced stage in their program and students who would otherwise not be able to attend PLDI. Supporting student travel to attend professional conferences and workshops is a very important mission of the NSF. Broader impacts include training the next generation of researchers in this important research area.","title":"PLDI 2013 Travel Support","awardID":"1329263","effectiveDate":"2013-05-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[553364],"PO":["564588"]},"199281":{"abstract":"Interoperable, reconfigurable systems of medical devices are the future of medical technology. They will improve care outcomes by catching common mistakes, reduce clinician cognitive workload by suppressing false alarms, and streamline and simplify continued care, especially when patients move between different medical facilities. As the penetration of \"smart\" networked medical technology increases, we will see increased problems with cybersecurity of such systems. This project is building the theoretical foundations and software prototypes to enable safe and secure real-time medical coordination in the presence of not only random faults, but actively malicious actors.<br\/><br\/>Medical and cyber-physical systems rely on real-time feedback and control, where microseconds could mean the difference between correct functionality and a fault, and ultimately, in medical systems, life and death. Since it is not possible to count on technology functioning flawlessly, especially with intelligent active attackers who may have access to medical devices or the network through which they communicate, this project seeks to develop requirements and best practices for \"optimistic real-time\" safety-critical systems, with built-in fallback to safe states if timing or performance guarantees cannot be met. The software and communication protocols will allow for global-scale medical systems, with real-time care independent of the location of the clinician or the patient, minimizing the chance of malfunction as a result of natural faults or tampering. The status of the system will be communicated to users without requiring specialty knowledge of security or communication protocols.","title":"CAREER: Safety and security for next-generation world-scale real-time medical systems","awardID":"1253930","effectiveDate":"2013-05-01","expirationDate":"2018-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":["562257"],"PO":["565327"]},"208136":{"abstract":"OCI 1338373<br\/>Chaitanya Baru - U. of California at San Diego<br\/>Workshop on Big Data Benchmarking: The BigData Top 100 List<br\/><br\/>The Workshop series on Big Data Benchmarking (WBDB) was created in 2012 by the Center for Large-scale Data Systems Research (CLDS) at the San Diego Supercomputer Center, UC San Diego to foster a community activity in the area of benchmarking of big data systems. The first workshop was held in May 2012 in San Jose, California and was sponsored by the National Science Foundation along with a few industry sponsors. Subsequent meetings followed, and a second workshop held in December 2012 in Pune, India. The meetings and the second workshop substantiated the initial ideas for a big data benchmark leading to the concept of the BigData Top100 List for ranking big data systems according to performance on a specified big data workload, while also recording and reporting system efficiency, for example, in terms of price\/performance.<br\/><br\/>This current action is for the Third Workshop on Big Data Benchmarking workshop to be held on July 16-17, 2013 in Xi'an, China. The local hosts for this meeting will be the Xi'an University of Posts and Telecommunications and the Shanxi HPC Center. <br\/><br\/>Intellectual Merit: While a mature transaction processing and data management industry has been established over the last two decades based primarily on relational database (RDBMS) technologies, the emergence of the Big Data phenomenon characterized by the so-called \"3Vs\" - volume, velocity, and variety) of data along with the need for agile development of data-driven applications, has introduced a new set of challenges. A variety of new techniques and technologies have emerged to address these challenges. A big data benchmark could, indeed, be specified with the following components: (i) a definition for a synthetic benchmark dataset with a well-defined and well-specified data generation procedure; (ii) a representative workload for big data applications; and (iii) a set of metrics, run rules and full disclosure reports for fair comparisons among technologies and platforms. These results would then form the basis of the BigData Top100 List.<br\/><br\/>Broader Impacts: The first two WBDB meetings have had a total of about 100 (invited) attendees from about 60 different organizations from industry and academia. The BigData Top100 List initiative was officially introduced at a dedicated session at the Strata Conference in Santa Clara, on February 28th, 2013. This is a community effort and the benchmark will be released via the bigdatatop100.org website.","title":"Workshop on Big Data Benchmarking: THE BIGDATA TOP100 LIST","awardID":"1338373","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":["559496"],"PO":["565292"]},"208401":{"abstract":"The PI meeting will showcase the NSF Expeditions in Computing program and provide an opportunity for Expeditions PIs and program directors to interact with each other, the NSF, and industry guests. The meeting will last three days and include an overview of existing Expeditions projects, panels on topics of large project management, outreach, and opportunities in additional NSF programs. The schedule will include ample time for one-on-one interactions including a poster session on the final day. In addition, the meeting will coincide with the CISE advisory board meeting to give the board members a chance to learn more about CISE's flagship program, interact with the research teams, and provide feedback and suggestions to the showcased research projects or the expedition program in general.<br\/><br\/>Intellectual Merit<br\/>This meeting will highlight the three goals of the Expeditions program: to catalyze far-reaching research explorations motivated by deep scientific questions or hard problems in the computing and information fields, and\/or by compelling applications that promise significant societal benefits; to inspire current and future generations of Americans, especially those from under-represented groups, to pursue rewarding careers in computer and information science and engineering; and to stimulate significant research and education outcomes that, through effective knowledge transfer mechanisms, promise scientific, economic and\/or other societal benefits. This is the first Expeditions PI meeting and will also serve to provide direct feedback to the NSF on the success of the Expeditions program as well as suggestions for the future of the program. <br\/><br\/>Broader Impact<br\/>The meeting will provide opportunity for researchers from disparate disciplines to interact and learn new models for conducting and managing large basic research projects. The meeting will also serve as a venue for connecting with potential industry partners for technology transition. One key aspect of the discussions will be an overview of each team's outreach activities and the benefits and challenges of large, coordinated outreach and education efforts compared to individual efforts. In addition, teams will be encouraged to bring students to the meeting to participate in presentations and discussions.","title":"NSF Expeditions in Computing PI Meeting","awardID":"1339709","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[558485,558486],"PO":["565223"]},"205598":{"abstract":"This award provides travel support for approximately 26 students to attend the 2013 SIAM Data Mining (SDM 2013) Conference (and the Doctoral Student Forum) that is being organized by the Society for Industrial and Applied Mathematics (SIAM) in cooperation with the American Statistical Association. SDM 2013 is being held in Austin, Texas, USA from May 2 to 4, 2013. The Doctoral Forum will consist of a poster session for Ph.D. candidates in data mining or closely related areas or Ph.D. students who have made significant progress towards Ph.D. candidacy. The Ph.D. student forum participants will be able to present their work, interact with their peers from other universities as well as hundreds of leading researchers in data mining from around the world. In addition, they will attend the technical sessions, plenary talks, and tutorials and workshops of their choice at the conference. Each student will be assigned a senior researcher to serve as a mentor on a variety of career-related issues.<br\/><br\/>Participation in premier research conferences in data mining is an integral component of the training of Ph.D. students in data mining. The SDM 2013 Doctorul Student Forum is aimed at providing an opportunity for Ph.D. candidates to present their work and receive constructive feedback and mentoring from established researchers in data mining. Such feedback and mentoring is expected to improve the quality of the students thesis research. Similarly, student recipient of a travel award will be able to attend technical sessions, plenary talks, panels, tutorials and workshops. They will interact with peers who share similar interests from other universities, as well as hundreds of leading researchers in data mining from around the world. This experience will be extremely formative and fruitful towards the shaping of their future research endeavors.<br\/><br\/>Data mining is playing an increasingly important role in many emerging data-rich sciences and application domains, such as healthcare informatics, bioinformatics, computational biology, link analysis, counterterrorism and security. The SDM 2013 Doctoral Student forum will enrich the education and training of student researchers at early stages in their careers. Attendance in SDM 2013 will expose students to cutting-edge research and to relevant applications in a variety of domains. The travel awards will help broaden the participation of women and members of under-represented groups within the Data Mining research community.","title":"Student Travel Support for the 2013 SIAM International Conference on Data Mining","awardID":"1319674","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[550519],"PO":["565136"]},"207358":{"abstract":"The project supports 10 students to attend the 22nd ACM International Symposium on High Performance Parallel<br\/>and Distributed Computing (HPDC-2013) to be held in New York, NY, June 17-21, 2013. HPDC 2013 comprises the main conference as well as 8 affiliated workshops, and is the premier forum for presenting the latest research findings on the design and use of parallel and distributed systems for high end computing, collaboration, data analysis, and other innovative applications. Student attendance at the conference will greatly benefit the students by exposing them to a variety of issues in high end computing.","title":"Student Travel Support for ACM HPDC 2013","awardID":"1333443","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["558495"],"PO":["565255"]},"208745":{"abstract":"This award will support student travel to the 2013 International Conference on Supercomputing (ICS), which is being held in Eugene. Oregon. ICS is a highly regarded international technical conference with a multi-disciplinary focus on high-end computing for scientific and engineering applications. The funds will help support U.S. students, focusing on Ph.D. students at an advanced stage in their program and students who would otherwise not be able to attend ICS. Supporting student travel to attend professional conferences and workshops is a very important mission of the NSF. Broader impacts include training the next generation of researchers in this important research area.","title":"Student Travel Grant Support for The 27th International Conference on Supercomputing","awardID":"1341921","effectiveDate":"2013-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":[559570],"PO":["565264"]},"208514":{"abstract":"Research and advances in Big Data is a high priority for the society. A week-long workshop on the applications of succinct data representations to Big Data analysis will bring together about forty mathematicians and computer scientists to exchange ideas about, and share current work on, succinct representations of data enabling sophisticated analysis, as in compressed sensing and streaming, sparsification, distributed sensing and data fusion, machine learning, optimization and complex query processing.  The workshop will be in cooperation with the Simons Institute on the Theory of Computing at UC Berkeley, and will take place on September 16-20 2013, during the Institute's semester-long program on algorithmic foundations of big data analysis, thus also engaging in its work the (more than thirty) participants of that program. The workshop will be open to all potential participants and the findings and video tapes of presentations will be distributed to the public for comments and engagements.","title":"\"Succinct Data Representations and Applications","awardID":"1340226","effectiveDate":"2013-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":[558880],"PO":["565251"]},"199176":{"abstract":"Software development is facing a paradigm shift towards ubiquitous<br\/>concurrent programming, giving rise to software that is among the most<br\/>complex technical artifacts ever created by humans. Concurrent programming<br\/>presents several risks and dangers for programmers who are overwhelmed by puzzling <br\/>and irreproducible concurrent program behavior, and by new types of bugs that elude <br\/>traditional quality assurance techniques. If this situation is not addressed, we are <br\/>drifting into an era of widespread unreliable software, with consequences ranging <br\/>from collapsed programmer productivity, to catastrophic failures in mission-critical systems.<br\/><br\/>This project will take steps against a concurrent software crisis, by<br\/>producing verification technology that assists non-specialist programmers<br\/>in detecting concurrency errors, or demonstrating their absence. The<br\/>proposed technology will confront the concurrency explosion problem that<br\/>verification methods often suffer from. The project's goal is a framework<br\/>under which the analysis of programs with unbounded concurrency resources<br\/>(such as threads of execution) can be soundly reduced to an analysis under<br\/>a small constant resource bound, making the use of state space explorers<br\/>practical. As a result, the project will largely eliminate the impact of<br\/>unspecified computational resources as the major cause of complexity in<br\/>analyzing concurrent programs. By developing tools for detecting otherwise <br\/>undetectable misbehavior and vulnerabilities in concurrent programs, the <br\/>project will contribute its part to averting a looming software quality crisis.","title":"CAREER: Verifying Threaded Software Using Resource Bounds -- An Approach Towards Dependable Concurrency","awardID":"1253331","effectiveDate":"2013-05-01","expirationDate":"2018-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[534268],"PO":["565264"]},"202102":{"abstract":"Texas A & M University will organize, conduct, and evaluate the Academic Career Mentoring Workshops for Underrepresented Participants annually in 2013-2015. During years 2014 and 2015, partial support will come from the institutions of the junior faculty. The Academic Career Mentoring Workshop series targets mid-level faculty, junior faculty and senior graduate students from the following underrepresented groups: African American, Hispanic, Native American, and People with Disabilities. The goals of this workshop series are to mentor underrepresented junior faculty about the tenure and promotion processes, launching a successful research program, writing solid research proposals, and encouraging senior graduate students to enter the professoriate. The proposed Mentoring Workshops will include cultural issues with respect to topics such as Starting a Research Program, Networking, and Navigating the Tenure Process. Further, the panelists will be asked to address issues such as \"Maintaining One's Identity & Culture\" and \"Overcoming Misconceptions.\" The series includes such discussions to address frustrations unique to faculty and graduate students from underrepresented groups. The Academic Career Workshops for Underrepresented Participants complement the existing CRA-W Workshops, which focus on gender, and CRA Workshops, which do not target particular issues faced by women or ethnic minorities.","title":"Academic Careers Workshops for Underrepresented Participants","awardID":"1301783","effectiveDate":"2013-05-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[541641],"PO":["560704"]},"202223":{"abstract":"Despite comprehensive civil rights legislation for Americans with disabilities, many city streets, sidewalks, and businesses remain inaccessible. The problem is not just that street-level accessibility affects where and how people travel in cities but also that there are few, if any, mechanisms to determine accessible areas of a city a priori. Traditionally, sidewalk assessment has been conducted via in-person street audits, which are labor intensive and costly, or via citizen call-in reports, which are done on a reactive basis. And while efforts exist for visualizing the walk-ability, bike-ability, and availability of public transport in cities, there are no analogous efforts for accessibility. Thus, wheelchair users, for example, often avoid going to new areas of a city where they don't know about accessible routes. The PI plans to address this problem by means of a two-pronged approach in which he will first develop scalable data collection methods for acquiring sidewalk accessibility information using a combination of crowd-sourcing, computer vision, and online map imagery; he will then use the new data to develop and evaluate a novel set of navigation and map tools for accessibility. To these ends, the PI and his team will collect and analyze interview and survey data both from mobility impaired persons and from ADA streetscape design experts, and will seek to understand how people with mobility impairments can make use of interactive mapping information to enhance mobility. They will study methods for efficiently and effectively crowd-sourcing map labeling tasks, evaluating existing approaches empirically and designing novel, more effective approaches. They will develop new computer vision algorithms for the analysis of street scenes, which will be used to help scale the data collection by focusing human labeling efforts on locations that are most likely to contain significant problems. And they will design, implement and evaluate new accessible-aware map-based tools to aid people with mobility impairments in navigating their cities. As appropriate for each phase of the research, user evaluations will include both lab and field studies.<br\/><br\/>Broader Impacts: Roughly 30.6 million individuals in the United States have physical disabilities that affect their ambulatory activities, and nearly half of these individuals report using an assistive aid such as a wheelchair, cane, crutches, or walker. The outcomes from this research will have a significant impact on the ability of these Americans to travel independently, by transforming the ways in which accessibility information is collected and visualized for every sidewalk, street, and building façade in America. Project outcomes will include a publicly accessible web site where both the labeled data collected during this work and the new prototype tools developed will be made available for general use. Furthermore, the PI and Co-PI will advise and mentor both graduate and undergraduate students throughout the course of the project, including two PhDs and two MS students who will obtain a cross-disciplinary education in human-computer interaction and computer vision.","title":"HCC: Medium: Combining Crowdsourcing and Computer Vision for Street-level Accessibility","awardID":"1302338","effectiveDate":"2013-05-01","expirationDate":"2017-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[541954,541955],"PO":["565227"]}}