{"1210":{"abstract":"Sonar is an attractive sensing modality for robotics because it is relatively simple to implement and process, has low cost and energy consumption, can be used in conjunction with camera vision, and for some applications it is the only practical sensing modality. This research investigates a form of adaptive sonar sensing, in which the sensor changes its physical configuration during the sensing process in reaction to the observed echoes. This approach, analogous to some approaches to active computer vision, is motivated by biological systems that turn their ears toward the direction of the sound source and move to observe an object from different directions. As part of this research, signal processing algorithms are investigated to develop a sensing system that can identify objects by their acoustic signatures. The current model of echo production is extended to predict the echoes observed by the sonar system. The sonar allows the robot to navigate around an unstructured environment precisely and to construct accurate sonar maps by using environmental objects as naturally-occurring beacons. This approach should support more autonomous and flexible operation of both mobile robots and robot arms, thus improving their functionality in manufacturing applications.","title":"REU: Adaptive Sonar Sensing","awardID":"9504079","effectiveDate":"1995-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["210985"],"PO":["179262"]},"1485":{"abstract":"Davis This project addresses a range of sparse matrix problems, from data structures, to algorithms, to applications. The unifying theme is the unsymmetric-pattern multifrontal method: its implementation, data structures, and applicability to difficult sparse matrix problems in semiconductor device and process simulation. The unsymmetric-pattern multifrontal method encompasses both the multifrontal technique and an approximate degree update algorithm that is much faster (asymptotically and in practice) than computing the true degrees. Although this method uses upper bounds, the ordering quality for both the unsymmetric (Markowitz cost) and symmetric (minimum degree) algorithms does not suffer. The investigator and his colleagues develop parallel factorization and ordering algorithms based on these approaches. They also develop parallel memory allocators (a fast-fits algorithm), a dynamic task graph (dynamic, since the pivot ordering determines the task dag), the development of both pessimistic and optimistic synchronization methods for frontal matrix ``collision'' in the combined uni\/multifrontal approach, and other distributed data structures (such as a distributed priority queue for finding pivots of low approximate degree) required for these algorithms. The algorithms and data structures they develop are applied to semiconductor device and process simulation. This is a challenging application, placing a burden not only on the numerical factorization, but on the symbolic ``overhead'' as well. The problems in this domain are based on irregular, adaptive grids (both 2D and 3D). Both direct methods and iterative methods are used. The iterative method used is a preconditioned biconjugate gradient algorithm, with an incomplete LU factorization as the preconditioner. The investigators develop and employ an incomplete multifrontal factorization algorithm, and a multifrontal-based approach for computing the sparse inverse for use as a prec onditioner. The parallel methods the investigators develop are widely applicable to many computationally intensive problems, in particular the modeling of complex physical phenomena: structural stress and fluid-flow in and around the space shuttle, thunderstorms and tornados, circuits and semiconductor devices, the mixing and combustion of complex turbulent reacting flows, the flow of oil in a reservoir, the optimal distillation of gas and petroleum products, and so on. Parallel sparse matrix algorithms and the data structures they require can help to solve these problems. Where will a tornado hit? How fast can you make a CPU chip run? How can automobile emissions be reduced and gas efficiency be increased at the same time? How do we get more gas out of the same amount of crude oil, and how do we get more crude oil out of an oil reservoir? Answering these questions accurately requires a great deal of computation - and much of that computation involves large, sparse matrices. High-speed computation is required - it does no good to predict where a tornado will hit after it has already passed by and done its destruction. Thus the need for parallel algorithms and data structures. The methods the investigators develop are made widely available to researchers in these and other areas. To ensure that the methods are in fact useful for ``real world'' problems, they are incorporated into a widely-used semiconductor simulation package, the Florida Object-Oriented Device\/Process Simulator (FLOODS\/FLOOPS). FLOODS\/FLOOPS is in use in dozens of companies and universities, and its methods form the basis of many commercial semiconductor simulation packages.","title":"Mathematical Sciences: Sparse Matrix Problems: Data Structures, Algorithms, and Applications","awardID":"9504974","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[3435,"485200","44883"],"PO":["562372"]},"4686":{"abstract":"9521074 Brett A Directory Services testbed based on the WHOIS++ protocol, is proposeed for locating people and resources on the Internet. WHOIS++ provides a highly flexible client\/server environment that allows a user to search across multiple distributed databases located on multiple servers, without prior knowledge of the architecture of the database or the network location of the desired information. This project proposes to deploy a medium-scale (>450,000 entries) WHOIS++ database distributed across at least 13 servers (which contain the actual directory data base entries), and utilizing at least six centroids (data bases of indexes which point to the individual servers) in a three-level mesh (centroids which point to lower-level centroids which, in turn, point to the lowest level of centroids which point to the actual data base servers). In addition, this project proposes to develop a widely-usable access method based on clients for the World Wide Web (e.g., Netscape or Mosaic), create interface modules to allow the use of a number of different database technologies to store the WHOIS++ data, determine and implement the security and privacy issues likely to be required for use in the commercial sector, and determine whether the protocol will scale to serve the Internet at large.","title":"WHOIS++ Directory Service Testbed","awardID":"9521074","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["264215",11443,11444],"PO":["63644"]},"5786":{"abstract":"The mental process of predicting the reasonable consequences of a change in the design of an artifact is an important step in the design process. This research addresses issues in developing a theory of design change. The premise is that the incremental changing of the geometric design of an artifact may be formally explained by logical and mathematical theories, similar to those in automated planning and simulation systems which are used in many fields. Topics being investigated are representation of designs, designer intentions, and constraints. A computational model of the deductive process of changing a design is being developed. The model uses frame laws and default constraints expressed in the modal quantificational logic Z. Other work includes exploring problems of automated deduction of facts in three dimensional geometry, consistency analysis, and developing a taxonomy of appropriate engineering design actions and intents.","title":"Research on a Theory of Design Change","awardID":"9526532","effectiveDate":"1995-08-15","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["504404"],"PO":["321058"]},"3047":{"abstract":"The research involves empirical and theoretical inquiry into techniques for combining simple oscillators to produce new and more complex robot behaviors from existing simpler ones. Previously funded work in the PI's laboratory has already demonstrated that simple oscillators can be used to confer upon a robot superlative but narrow dynamical dexterity. The present study attempts to demonstrate that effective coupling techniques for such existing behavioral mechanisms can confer a much broader range of behavior. The empirical project addresses a robotic manipulation scenario termed ``Sensor Driven Dynamical Pick and Place.'' In this scenario, the robot uses a flat paddle to acquire balls thrown into the workspace; balance or bat them as required through a clutter; loft them into an out-of-reach destination receptacle; and resistunanticipated perturbations along the way. The recourse to oscillators reflects an almost exclusive theoretical focus on event driven manipulation. Such a commitment to feedback control addresses the fact that failures in machine reliability frequently occur because of events which are not intrinsically unrecoverable but which violate our models dramatically and cannot be anticipated. The focus on error detection and recovery in a dynamical setting brings into correspondence the concerns of the decade old (and still vigorously developing) fine motion planning literature and certain concepts and analytical tools from the century old (and still vigorously developing) dynamical systems literature that have proven useful in the PI's previously funded work.","title":"Dynamically Dexterous Robots via Switched and Tuned Oscillators","awardID":"9510673","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["527916"],"PO":["335186"]},"2366":{"abstract":"IRI-9508191 Sycara, Katia Carnegie Mellon University $50,000 - 12 mos Task-Based Coordination of Intelligent Agents Due to advances in technology, diverse and voluminous information is becoming available. This presents the potential for improved decision support, but poses challenges in terms of building tools to support users in accessing, filtering, evaluating and fusing information from heterogeneous information sources to support user tasks. Current explorations of Intelligent Agent technology have considered a single agent for each task that acts as a user's assistant. This project explores coordination among different agents that will collectively interact with other agents on a user's behalf to find, fuse and utilize information in problem solving in support of user task. A key component of the proposed research will be collaboration with Dr. Lemaitre of the LANIA Research Institute in Mexico. Because of its bi- national nature, the research effort is expected to have additional benefits, such as promotion of international scientific collaboration, and additional opportunities for experimental testing of our theories and research results.","title":"Task-Based Coordination of Intelligent Agents","awardID":"9508191","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["553661"],"PO":["503214"]},"3224":{"abstract":"9511504 HUMMEL This research will develop a computer system to model how people learn schemas from examples. Schemas are knowledge structures that describe general situations, events, rules, or relationships. For example, a Restaurant Schema might specify the kinds of events that take place in restaurants, and the relationships between the actors in those events (e.g., chefs, waiters, and customers, etc.); a Family Relation Schema might specify the kinds of relationships that define various family members, such as sisters, brothers, parents, uncles, etc. A schema is very general, in that it refers to many specific situations, and also highly structured, in that it specifies the relationships between objects, events, or even between other relationships. Psychologists and computer scientists have long recognized the utility of schemas as a basis for reasoning: If one can recognize an object or situation as an instance of a general schema, then one can use the schema to reason about the specific object or situation. For example, the Family Relation Schema tells us to expect that Mom's brother, Bob, is our uncle, and that if Bob has children, then they will be our cousins. Due to the schema, it is not necessary to learn the family relations for every individual separately. Although the generality and structured nature of schemas make them extremely useful forms of knowledge, they also make them very difficult to model: Traditional symbolic approaches to computer modeling are good at representing structured information, but they have difficulty flexibly matching specific instances to general facts; by contrast, connectionist models are good at flexibly matching instances to general categories, but they have great difficulty representing structured information (such as rules and relationships). Perhaps for this reason, no one has ever developed a formal and general model of schema-based learning and reasoning. Hummel and Holyoak have developed a computer mo del of analogy that combines a connectionist architecture with the capacity to represent and learn relational structures. The model's capacity to represent structured information in a flexible, general manner makes it an ideal vehicle for simulating human schema learning and use. The research will apply the model's approach to the representation of structure to the problems of representing, learning, and using schemas. The result will be a model that can (a) learn general schemas from specific examples, (b) match new instances to learned schemas, and (c) use the schemas to make inductive inferences about the new examples. The model will be the first formal theory of human schema-based reasoning, and will contribute substantially to our understanding or human reasoning is a wide variety of domains. It will also be the first working computer system to use schemas to reason flexibly about general knowledge domains. ***","title":"Schema Induction in a Structure-Sensitive Connectionist Model","awardID":"9511504","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["238591","66479"],"PO":["179748"]},"1772":{"abstract":"This award, under the U.S.-Mexico CONACyT Initiative, is concerned with an in-depth scientific understanding of the nature of the relationship between mobile robotic agents and their environment. The research addresses the agent-environment relationship directly using schema theory and neurophysiological and ethological models to ultimately provide credible, generalizable, and useful results in this domain. These systems will ultimately be grounded in both simulations and actual robotic hardware. An in-depth understanding and dynamic modeling of the relationship a robot has with its environment (i.e., the overall ecology) is important to ensure that fielded robotic systems don't compete inappropriately with other agents that can do the task more effectively (and by competing, reduce their usefuless); that the robots are successful competitors within the ecological system and can potentially displace less efficient agents; and that they are ecologically sensitive so that agent-environmental system dynamics are well-modeled and as predictable as possible whenever new robotic technology is introduced. The research efforts will be tied together through the use of software tools already in existence or under development at both sites, including NSL, a neural simulation language; ASL, an abstract schema language; and MissionLab, a schema-based mission-oriented simulation and robot implementation environment.","title":"NSF-CONACyT: Ecological Robotics: A Schema-Theoretic Approach","awardID":"9505864","effectiveDate":"1995-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["549387",4124,"486236"],"PO":["475621"]},"4951":{"abstract":"9521987 Dickson This project connects eleven Texas community and technical colleges to the Internet. They are: Angelina College Northeast TX Community College Cisco Junior College Paris Junior College Frank Phillips College South TX Community College Grayson County College Texarkana College Kilgore College TX State Technical College - North Central Texas College Harlingen Faculty and students at the schools benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Connecting Texas Community and Technical Colleges to Internet","awardID":"9521987","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12098,12099],"PO":["121202"]},"4974":{"abstract":"This is a Planning Grant to develop a five year continuing grant proposal under the Minority Institutions Infrastructure (MI-I) program. The institution plans to develop activities which are part of their long range plan, Project RAISE, Research Advancement in Science Education. As a part of these activities, a proposal for a five-year continuing grant will be developed. Winston Salem State University is one of sixteen institutions comprising the University of North Carolina System. It is a predominately African-American undergraduate institution serving the educational needs of Winston-Salem and the northwest Piedmont area. There are currently 226 students majoring in computer science and the project, if successful as a five-year proposal, has the potential ultimately to significantly increase the number and quality of students graduating in computer science.","title":"Minority Institutions Infrastructure: Project RAISE","awardID":"9522067","effectiveDate":"1995-08-01","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[12162,"542298"],"PO":["564412"]},"1476":{"abstract":"Sethian The investigator and his colleague study the motion of singularities in solutions of differential equations, in particular, the motion of interfaces as described by level-set methods and applied to problems in interface motion, and the motion of vortices in three space dimensions, as described by vortex methods and other Lagrangian techniques. The interface techniques exploit Hamilton-Jacobi methodology coupled to upwind schemes for hyperbolic solvers; new work focuses on developing fast methods, methods for multiple interfaces, and the incorporation of effects of visibility, surface diffusion, and reflection\/re-emission in surface profile motion. The vortex motion through Lagrangian methods develops machinery from renormalization methods and polymer analysis from statistical physics applied to fluid phenomena through linkage with Shenoy-Williams methodology, and Kosterlitz-Thouless formulations. The investigators develop methods to follow the motion of interfaces and vortices. Such problems arise in flows of materials, for instance, and whenever the places where objects or materials meet or end change with time. These are common situations throughout science and engineering. The work is applied to a number of areas. In etching, deposition, and lithography in the manufacture of microelectronic components, the work is used to analyze process steps leading to higher yield and efficiency of electronic devices. In image enhancement, segmentation, and recognition applied to medical imaging, the work leads towards automatic software for recognizing cardiac data in CT and MRI scans. In grid generation, the techniques are used to develop new techniques for building grids around complex bodies, as required in aircraft and engine design. The Lagrangian and vortex particle work focuses on generation of large turbulent structures in wakes, motions of polymers in superfluids, and fundamentals of superconductivity.","title":"Mathematical Sciences: Computational Techniques from Geometry and Statistical Physics Applied to Fluid Mechanics and Interface Problems","awardID":"9504950","effectiveDate":"1995-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1265","name":"GEOMETRIC ANALYSIS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550327","517554"],"PO":["562372"]},"1597":{"abstract":"Concerns about the effects of human interference in the oceanic environment upon the life and habits of marine mammals have been recently raised. In response, researchers have taken interest in processing all relevant information to better understand this interference with the hope and goal of protecting marine life. In this context, the development of signal processing methods for the exploration of sounds generated by marine mammals in the ocean is being pursued. Success of this research will enable the tracking of mammals, and the reconstruction of the signals they produce, through remote acoustic sensing. Localizing marine mammals in the ocean and identifying the sounds they generate requires the establishment of a link between physics (acoustics) and signal processing. The normal modes approach is being adopted for modeling the acoustic signal propagation in the oceanic environment Models will then be sought that capture the time and frequency structure of biological signals. The combination of acoustics and signal analysis is expected to facilitate inversion of the acoustic field measured at an array in the ocean for the estimation of the location of sound-transmitting marine mammals and the actual form of the signals they transmit.","title":"Signal Processing for Marine Mammal Localization and Deconvolution of Biological Acoustic Transients","awardID":"9505362","effectiveDate":"1995-08-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["560441"],"PO":["564898"]},"4523":{"abstract":"9520501 Anderson Research will be conducted to develop critical enabling technologies and systems for precise, minimally invasive delivery of localized treatment for tumors and other soft tissue lesions. The goal to register 3-D rendered CT images with real-time fluoroscopy to identify and locate tumors in the liver and to use this information to direct a remote center-of-motion robotic manipulator for fast and accurate targeting of the lesion and to deliver a preplanned pattern of localized therapy using percutaneous approaches. Success with this research would replace more costly surgery or provide a therapeutic alternative to individuals in whom surgery would be contraindicated. This technology has a significant potential to reduce health care costs and to improve the quality of life for a very large number of patients. 3D image-guided surgery and therapy is a challenging and important new field of medicine that holds enormous promise to benefit the patient while simultaneously reducing the cost of doing the procedure. ***","title":"Image Guided Percutaneous Robotic Assisted Therapy","awardID":"9520501","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["553223","31436",11071,11072,11073],"PO":["317420"]},"2378":{"abstract":"9508239 Mukherjee This project will (i) explore new architectures for the next generation of networks employing optical technology, in particular wavelength-division multiplexing (WDM), for wide-area (nationwide) coverage, and (ii) evaluate and stress-test the performance of these networks by employing realistic workload (traffic) models. This ``almost-all-optical'' wide-area WDM network will utilize wavelength multiplexers and optical switches in a routing node, so that an arbitrary virtual topology can be imbedded on a given physical fiber network. The virtual topology, which is packet switched and which consists of a set of ``all-optical lightpaths'', is set up to exploit the relative strengths of both optics and electronics -- packets of information are carried by the virtual topology ``as far as possible'' in the optical domain, but packet forwarding from lightpath to lightpath is performed via electronic switching, whenever required. This WDM-based network architecture provides high aggregate system capacity due to spatial reuse of wavelengths, support for a large and scalable number of users given a limited number of wavelengths, and very lenient requirements on the wavelength-tunable optical devices of the individual users. On a microscopic level, this research will optimize the cost, efficiency and throughput of the WDM routing node. On a macroscopic level, we will (a) investigate the overall design, analysis, upgradability, and optimization (including cost vs. performance tradeoffs) of a nationwide WDM network consistent with device capabilities; (b) examine related device issues such as optical amplification, fiber nonlinearities, etc.; (c) study traffic control issues related to switching, routing, and performance management of the network to develop ``adaptive reconfiguration algorithms'' in order to reconfigure the virtual topology when the pattern of offered traffic changes; and (d) develop optical hardware support and algorithms for emerging networking services such as multicasting. *** ******* Darleen Fisher Program Manager Networking and Communications Research Program 4201 Wilson Blvd. Room 1175 Arlington Va 22230 (703) 306-1949 (703) 306-0621 (FAX)","title":"Next Generation Wide Area Optical Networks","awardID":"9508239","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["518063"],"PO":["150490"]},"7548":{"abstract":"The advent of new generation of massively parallel computers has caused previously efficient numerical algorithms to be reexamined. Massively parallel computers are comprised of many hundreds, sometimes thousands of processors. For a numerical algorithm to fully exploit the power of such machines it must be able to be 'decomposed' into largely independent pieces which can be distributed across the available computer processors. The waveform relaxation method is such a method for solving systems of ordinary differential equations and time-dependent partial differential equations. In addition to its advantages in parallel processing, it also allows different integration step sizes to be used for different subsystems, resulting in substantial savings in computation for some applications. The theoretical and experimental studies suggest that the waveform relaxation method has a great potential for developing reliable, scalable efficient parallel algorithms for solving a wide range of differential equations. The objective of this research is to further investigate the nature of the waveform relaxation method, and develop fast scalable parallel algorithms for solving certain type of ordinary differential equations and time-dependent partial differential equations. The long term goal of this research is to make the developed algorithms applicable to real-world computational problems, such as the real time integration of torpedo or missile trajectories, modeling of earthquake effects on buildings, and simulation of fluid-structure interaction. This work will involve the algorithm design, theoretical analysis with a possible focus on the search of optimal convergence rate, and numerical testing on sequential and parallel computers. Interactive activities include: teaching a course at the graduate level on numerical linear algebra, numerical partial differential equation, or on parallel numerical computation; and leading an interdisciplinary research seminar seri es on scientific computation and applications to which both local and national researchers will be invited to participate.","title":"VPW: Waveform Relaxation Method","awardID":"9550154","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"9225","name":"VISITNG PROFESS FOR WOMEN"}}],"PIcoPI":["494506"],"PO":["180153"]},"1542":{"abstract":"Todd The investigator and his colleagues undertake broad studies of optimization algorithms and the mathematical theory underlying them. The project covers continuous and discrete optimization algorithms, both exact and approximate, their computational complexity, practical large-scale implementation, performance guarantees (in the case of approximate algorithms), and applications in the physical sciences such as elementary particle tracking, as well as more conventional applications in manufacturing and logistics. Particular projects include: - a continuation of large-scale computational testing of implementations of minimum-cost network flow algorithms; - development and testing of algorithms for large-scale nonlinear minimization problems with bound constraints; - performance guarantees for efficient approximation algorithms for machine-scheduling problems with budget constraints and for other combinatorial optimization problems; - development of more efficient interior-point methods for convex programming and for linear programming problems where no initial interior feasible solution is known; - studies of the polyhedral structure of combinatorial problems in graph theory and partially ordered sets, as well as in applications such as crew scheduling -- computational implementation and testing have been an integral aspect of these studies; and - further development of complexity theory for continuous nonconvex problems. These projects range from modeling through algorithm development and analysis to implementation and testing. Optimization addresses questions like: - How do you schedule the production of hundreds of items with varying demands over several months to minimize setup and holding costs, subject to resource limitations and capacities? - How do you determine the geometric conformation of a protein (how it ``folds\") given an approximate en ergy functional for any position? Indeed, complex systems arising in the engineering, physical, and biological sciences, and in the manufacturing and service industries, involving hundreds to millions of interacting variables, frequently lead to optimization problems when one wishes to control or predict their behavior. The investigators study a number of specific projects related to modeling and algorithm development for a variety of applications, ranging from traditional settings like resource allocation, planning, logistics, and distribution problems to new application areas such as airline crew-scheduling, elementary particle tracking, and shop scheduling. A common thread is the search for efficient methods to solve exactly large-scale instances of such problems, or, if that is not likely to be possible, for efficient algorithms that are guaranteed to obtain a solution that is close to optimal in a precise sense. The investigators also test these algorithms computationally on representative instances of such problems using serial and parallel computers.","title":"Mathematical Sciences: Computational and Mathematical Investigations in Optimization","awardID":"9505155","effectiveDate":"1995-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["392859",3576,"78948","78949"],"PO":["562372"]},"1257":{"abstract":"The aim of this research project is to increase the benefits and to reduce the costs of automated reasoning across a wide variety of applications. The project both supports and derives motivation from the ongoing development of the Larch Prover (LP), an interactive proof assistant for multisorted first order logic. Experience with previous versions of LP suggests four important ways to improve the cost\/benefit ratio: reducing the amount of detail required in proofs, supporting modular descriptions of theories and proofs, closing the gap between the logical and operational meaning of theories, and integrating LP into applications. To reduce the amount of detail required in proofs, the project seeks to combine different reasoning techniques in seamless and efficient ways. Early versions of LP emphasized equational term-rewriting. A recent version reduced the length of many proofs by using cooperating decision procedures for the theory of equality and for linear arithmetic. The project is exploring fruitful interactions between equational term-rewriting and decision procedures. The project is addressing both logical and operational issues for using independently developed logical modules in larger proofs and for ensuring that proof scripts are replayable after changes to formalizations. For almost all applications of automated reasoning, there is an unavoidable gap between logical content (e.g., the consequences of a specification) and operational content (e.g., the proof techniques and\/or sequence of lemmas required to prove a particular consequence). The project is studying how to narrow this gap, where possible, and how to provide useful information about the nature of the gap, particularly when proofs fail. Finally, the project is seeking to improve the cost\/benefit ratio for formal reasoning by integrating LP into applications. The goals of tighter integration are to enable users to think in application-specific terms, to make LP work better in the context of particular applications, and to understand the interface reasoning tools should present to applications. The project is seeking to achieve tighter integration by eliminating the need for transcribing designs and by developing application specific improvements in LP's expressive and deductive power (e.g., for reasoning about probability).","title":"Automated Reasoning in Software Engineering","awardID":"9504248","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["202940"],"PO":["150697"]},"5734":{"abstract":"This research, in the Small Grants for Exploratory Research mode, investigates the area of fault tolerance for robotics. This activity has produced a series of potentially valuable individual ethods. The goal of this project is to develop the foundations for a rigorous approach to robotic fault tolerance. The research involves synthesis of a protective operating system shell environment for robots, and incorporation of this environment into a new approach for provably fault tolerant robotic systems. The operating system shell is designed to protect the robot from the effects of errors in the lower level manipulator system and the higher level plan. This shell is composed of a number of fault tolerance tasks at a discrete decision making level. These tasks will be identified and outlined for a three link planar robot during the year of exploratory work. The robot will be enhanced with two sensors per joint and will be kinematically redundant for positioning tasks in the plane. This level of hardware redundancy will provide fault tolerance capabilities to the robot. A formal model will be developed for this simple example robot and used to demonstrate the potential benefits of the research approach. This work will provide formal methods to verify fault tolerance for lower and higher level subsystems of a robot system. The key overall goal is to combine diverse techniques for robotic fault tolerance into a provably correct methodology. The development of formal tools for the approach will be important in proving rigorous results about robot fault tolerance. In the one year of the SGER project, a series of fundamental examples will demonstrate how the above approach can significantly impact this emerging research area.","title":"SGER: Dynamic Fault Tolerance Methods for Robotics","awardID":"9526363","effectiveDate":"1995-08-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["50058","563342"],"PO":["125480"]},"2016":{"abstract":"Model selection, parameter estimation, and spectral analysis are three important areas in statistical signal processing. This research explores some difficult and unresolved problems in these disciplines by exploiting Bayesian theory. Topics of interest include the derivation of model selection rules based on asymptotic assumptions and their applications to problems in array processing, rank determination in time series analysis, and segmentation of vector fields; analysis of transient signals and parameter estimation of highly nonlinear models such as threshold signal models and bilinear models; and, Bayesian spectral analysis of nonstationary signals. This effort primarily consists of three equally important components. The first is a theoretical investigation into these problems that leads to an improved understanding of various signal models and concepts. The second is the practical application of the solutions, which includes automatic segmentation of medical images and the processing of single channel patch clamp currents. The third is purely educational. Students are given a practical exposition into the versatility of Bayesian inference and its applicability for solving a wide range of signal processing problems.","title":"Bayesian Solutions to Model Selection, Parameter Estimation, and Spectral Analysis","awardID":"9506743","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["563567"],"PO":["564898"]},"1478":{"abstract":"The objectives of this project are (1) to carry out research on iterative algorithms for solving large sparse systems of linear algebraic equations with emphasis on systems arising from problems involving partial differential equations and on the use of parallel computers, (2) to develop research-oriented prototype software based on the algorithms, and (3) to test the algorithms and software on a range of problems. Among the algorithms to be considered are parallel alternating-type methods, periodically generated iterative methods, rational iterative methods, and iterative methods for solving large sparse nonsymmetric linear systems.","title":"Interative Algorithms and Software for Parallel Architectures for Partial Differential Equations","awardID":"9504954","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["544107","89958"],"PO":["187585"]},"4503":{"abstract":"IRI-9520434 Shapiro, Linda G. University of Washington $50,000 - 12 mos. SGER: A Domain-Model Approach to Reconstruction of 3D Environments for Virtual Reality This award is in the Small Grants for Exploratory Research mode. Reconstruction of 3D environments from sensed data is a computer vision problem with important application to the area of virtual reality and other visual information systems. The relatively new research area of virtual reality requires 3D models of entire environments, and presents several significant new challenges for computer vision, including the ability to deal with multiple moving objects in the scene, integration of information about color and textures, and the need for close attention to domain constraints, to improve the reconstruction of a 3-D model of the environment. The new approach in this research is to use domain knowledge to simplify and improve the 3D environment-acquisition process. This approach is knowledge-driven and attempts to understand the physical structure of the environment and of the individual objects in the environment. This award supports preliminary research to explore the feasibility of development of physical domain models that define the physical constraints of a particular domain. Such models might include information about possible 3D surface classes, possible materials, surface relationships, common 3D primitive solids, functional relationships among the 3D primitives, and fixed or constrained lighting.","title":"SGER: A Domain-Model Approach to Reconstruction of 3-D Environments for Virtual Reality","awardID":"9520434","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["334068"],"PO":["125480"]},"1126":{"abstract":"The goal of this continuing research project is to develop more systematic theorems and methods for analyzing difficult algorithms. These methods are briefly characterized as follows: (1) Perturbation theory for recurrence equations in computer science. Perturbation theory is a mathematical technique which was developed for analyzing difficult differential equation problems in mathematical physics. The research objective is to develop a tool kit of theorems that can apply to recurrences ranging from advanced issues in hashing to the elementary concerns of basic irregular divide-and-conquer algorithms; (2) Replacing operator methods in performance analysis. Operator methods also arise in the analysis of physical methods, and have been used to establish conservation laws, and compute the time evolution of fundamental quantities such as energy in complicated physical processes. A variation on these methods has been used to analyze several complicated processes in computer science, including coalesced hashing. However, recently it has been shown that coalesced hashing can be analyzed more completely and more easily by standard analytic methods. The goal in this part is to capture algebraic properties of operator methods, to translate them into analytic formulations, and to use these translated formulations to analyze difficult algorithms; (3) Probabilistic estimates. A growing number of computer science results use large deviation bounds, including fault tolerance analysis, the analysis of throughput in probabilistic situations, and the analysis of probabilistic algorithms. Many computer science applications introduce varieties of extra constraints, which render the standard theorems inapplicable. The final goal is to continue research on probabilistic estimation methods.","title":"Analyzing Algorithms: Advanced Methods for Recurrence Equations, Probabilistic Estimates, and Operator Methods","awardID":"9503793","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["112992"],"PO":["150516"]},"1137":{"abstract":"This project investigates the use of hierarchical methods for accessing and visualizing large and complex multi- dimensional data sets. Visualization can provide an efficient and powerful means of exploring such data However, most visualization methods are developed for moderately sized non-hierarchial data sets that can be imaged acceptably fast on graphics workstations. In practice, there are many data sets that cannot be effectively explored using these methods. The project is developing and implementing visualization approches designed for very large, multi-dimensional data sets over a variety of grid types. Such data sets present significant problems in the management of time and space resources, which will be addressed by this research. The unifying theme will be the use of hierarchical data structures to manage both resources effectively. Addressing time efficiency, techniques are being developed for the selective traversal and rapid interactive imaging of the data. For space efficiency, various data models, such as wavelets, are investigated to achieve compression, while being directly amendable to visualization. These hierarchies are being integrated with existing visualization techniques for isosurface extraction, direct volume rendering, and flow visualization, many of which have already been developed at UC Santa Cruz and elsewhere for non-hierarchial data. Techniques for rectilinear, structured, and unstructured grids are studied. Parallelization of these methods of SIMD and MIMD machines is also is being explored. This research is developing new algorithms for visualization of large, complex data sets, as well as making software systems available for use by scientists. Software is modular to facilitate integration with existing visualization packages. While the main objective is visualization, the hierarchical methods developed will also be of use for any data analysis hampered by access problems in dealing with very large data sets.","title":"Hierarchical Exploration and Visualization of Large and Complex Multi-Dimensional Data Sets","awardID":"9503829","effectiveDate":"1995-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["114053","62499"],"PO":["197478"]},"1038":{"abstract":"9503514 Moore Centre College proposes to install and maintain a 1.5 Megabit (T1) communications circuit for the purpose of establishing a permanent connection to the Internet. This line will enable Centre College to replace the current temporary connection to the Internet and to expand current services to two public school systems and the Kentucky School for the Deaf. This connection will also afford improved sharing of resources by and with other educational institutions by providing connectivity with federal and state agencies and institutions of higher education worldwide.","title":"Centre College Educational Community Connection NSFNET","awardID":"9503514","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2368,2369,2370],"PO":["57343"]},"1049":{"abstract":"9503544 Binder Maryville College is seeking support in connecting its campus to INTERNet by installing a node on campus. The support would be in the form of computer hardware, communications software, and communication services. Maryville College currently has dial-in access to INTERNet through the University of Tennessee in Knoxville for most of its faculty and staff, but this service is quite limited, and it is not available to students. By connecting to INTERNet via a node, Maryville College would be able to greatly improve and expand its current computer services to its constituents, especially its students. These connections will provide operations management and information services and it will give the college a 56 thousand bits per second connection to the NSFNET, a high speed (1.5 - 45 million bits per second) National Backbone network. The benefits of the NSFNET connection include e-mail between local and remote researchers and educators, file transfer capability and the ability to use remote computer resources. Also the college will have the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"INTERNet Connection to U.S. INTERNET Inc","awardID":"9503544","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2399,"396455","530954"],"PO":["57343"]},"1984":{"abstract":"9506039 Miller This research project in communication protocols focuses on the study of formal modeling of communication protocols which spans the areas of protocol specification, verification, testing and performance. Goals of the project are to provide a unification of the formulation techniques across all of these areas from specification to testing and to add the capability of studying performance within the same kind of formulation. Currently the approaches used to formally specify a protocol are different from those used to verify the logical correctness of a protocol. There is also a gap between the verification formulations and the conformance test generation formulations. The research studies in this project are aimed at closing these two gaps and thereby providing a more integrated approach to the design of communication protocols from specification to verification to testing. In addition, the studies aim to allow one to investigate the performance of the protocol at an early stage of the design, again using the same formulation techniques as in specification and verification. ***","title":"Network Design and Traffic Recovery Procedures for Survivable Wide Area Packet Networks","awardID":"9506652","effectiveDate":"1995-08-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["531589"],"PO":["150490"]},"1775":{"abstract":"This research is exploring the application of optical systems for high-speed database processing. It is combining a parallel model of computation, associative processing based on the use of content addressable memory, with an inherently parallel technology, optics. The purpose is to integrate into one study the elements of parallel architectures, parallel algorithms, device technology, and laboratory demonstrations which will test and demonstrate the advantages of optics for high-speed database processing. The approach taken on this project provides direct hardware support for database operations. It consists of identifying the basic fundamental operaitons required for data base processing and aprallelizing them as much as possible. This is followed by developing an optical parallel architecture that directly implements the parallelized operations. Parallel algorithms for database processing are then developed that build on these fundamental operations. Consequently, the optical architecture will support database applications in a truly parallel fashion.","title":"Development and Realization of an Optical Content Addressable Parallel Processor for High-Speed Database Processing","awardID":"9505872","effectiveDate":"1995-08-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["559883"],"PO":[4132]},"1302":{"abstract":"This research addresses issues of image registration, texture image segmentation, and quantification of minor differences between texture patterns, for example in medical images. The premise behind the outlined algorithms is that 2-D image registration cannot counteraffect 3-D positioning differences. The problem of precise image registration is surmounted by comparing regions, in a manner similar to analysis done by medical experts. The criteria for region identification include location and intensity characteristics. The selection procedure is divided into: (i) selection of control points in two images (external markers and\/or selected internal points that have unique characteristics) to determine locations of centers of regions to be compared, and (ii) determination of region extent by image segmentation, thus ensuring that the comparison is carried out between statistically homogeneous regions. Hierarchical region splitting is proposed as a means of achieving region size sensitive to subtle intensity changes. Both intensity statistics and texture measurements are included in region comparison procedure and decision making about a region status. The results of these basic investigations should be valuable in attacking the problem of early breast cancer detection based on comparison of different screenings of the same patient.","title":"Monitoring Changes in Time Sequences of Texture Images","awardID":"9504363","effectiveDate":"1995-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["430923"],"PO":["475621"]},"4724":{"abstract":"9521267 Burns This award provides 56Kbps Internet access to seven sites through Westnet: College of Santa Fe Santa Fe, NM Luna Vocational Technical Las Vegas, NM Institute Navajo Community College Shiprock, NM The School of American Research Santa Fe, NM San Juan College Farmington, NM University of Wyoming Family Casper, WY & Practice Residency Program Cheyenne, WY Faculty and students at the schools benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"New Connections to Westnet - 1995","awardID":"9521267","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["542085"],"PO":["121202"]},"1237":{"abstract":"Persistent programming languages provide a simple mechanism to make data persistent without the impedance mismatch that occurs when storing data in a database. As a result, persistent programming languages greatly facilitate the development of software that uses persistent data. A serious problem exists when maintaining programs written in persistent programming languages. The storage format for persistent data is derived from the structural representation of the data's type as defined in the program. When the representation is changed, the software is no longer able to access existing persistent data. This research addresses the problems of type evolution . It is developing algorithms to recognize complex type changes, to assist the software engineer in assuring that persistent data conform to modified semantics of the software, and to assist in identifying and updating code affected by structural changes to a type. The approach relies on persistent types defined as abstract data types. Type changes are identified by comparing the interfaces to the types, the structural representations of the types, and constraints attached to the types. The algorithms are being incorporated into a tool that provides computer-aided type evolution support. The primary goal of the tool is to manage the complexity of type evolution and provide assurance that evolution issues are addressed by the software engineer while not restricting the ways in which the software engineer modifies type definitions. A secondary goal is to automate data evolution for a collection of well-understood type changes. The combination of flexibility, automation, and concern with semantic issues is expected to provide advances over existing type evolution support systems. Experimentation is using histories collected from the development of real systems to evaluate the effectiveness of the algorithms.","title":"Evolution of Persistent Abstract Data Types","awardID":"9504170","effectiveDate":"1995-08-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["124900"],"PO":["150697"]},"1138":{"abstract":"Problems in propositional logic, such as Boolean satisfiability, are studied from the point of view of developing practical algorithms, although the problems are often NP-complete or co-NP-complete. Such problems are of practical importance in VLSI design verification, test generation, related CAD applications, as well as automated verification. Many other applications also occur naturally. E.g., higher order theorem provers require a satisfiability checker as a module. Recent hardware advances bring solution of some of these problems within reach. Algorithms are being implemented and tested for performance in typical applications, such as test pattern generation, sequential circuit verification, and program verification. Model search (usually called the Davis-Putnam method) and resolution are two well known, but somewhat conflicting, strategies for solving propositional satisfiability. Model search ``succeeds'' by discovering a satisfying assignment, whereas resolution ``succeeds'' by detecting that no such assignment exists. Some work on combining the two ideas in one algorithm has recently appeared. This project investigates more powerful combinations of these methods. Besides resolution, recognition can be valuable. The goal is to identify contexts in which resolution, equality recognition, and other inferences can be beneficial in reducing the search space. Equally important is to find implementations, usually requiring advanced data structures. Another goal is the development of application-independent methods. Heuristics described in the literature for particular applications are examined to determine whether the application content can be abstracted away, making the heuristic applicable to a logic problem without knowing its origin.","title":"Practical Algorithms for Problems in Propositional Logic","awardID":"9503830","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["62499"],"PO":["187585"]},"1666":{"abstract":"IRI-9505561 Marschak, Thomas University of California-Berkeley $450,000 - 36 mos The Information Superhighway and the Decentralization of Organizations The \"Information Superhighway\" promises to lead to the massive dispersion of information-handling activities. What does a large organization lose and what does it gain when it replaces face-to- face exchange of information among a large group of persons with decentralizion to many remote sites? How does a decentralized organization, which has a common task, make the best use of the information infrastructure that ties it together? How should the costs of the infrastructure, and of the local networks that connect to it, be measured and how should the costs be divided up among the users. This research project aims to clarify and study these complex questions. One segment of the program is the modeling of real organizations; another is the development of new theory; and a third is the empirical study of a continually accumulating database on Internet usage at Berkeley, which will convert into a \"testbed\" for the experimental study of alternative schemes for allocating network resources among users. One aim of the empirical work is the (paper) design of an \"On- line University\". In all parts of the research project, problems will be studied from the viewpoints of several disciplines: economics, computer science, electrical engineering, and operations research.","title":"The Information\/Communication Networks and the Decentralization of Organizations","awardID":"9505561","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["554417","165632","441185","402689","560233"],"PO":["495796"]},"1677":{"abstract":"9505597 Pursley The 1995 IEEE International Symposium on Information Theory will be held in Whistler, British Columbia, Canada, on September 17-22, 1995. Papers presented will address new results in: applications of information theory, image and speech coding, communication systems, multi-user information theory, cryptography and security, neural networks, data compression, optical communications, data networks, pattern recognition, detection and estimation, Shannon theory, distributed information processing, signal processing, error-control coding, source coding, and stochastic processes. This symposium is a premiere meeting in the field of Information theory. Travel through this grant will provide travel support for U. S. participants, primarily graduate students and new faculty members, whose papers are selected for presentation at the symposium, but who lack the funds required to travel to the conference. ***","title":"1995 IEEE International Symposium on Information Theory","awardID":"9505597","effectiveDate":"1995-08-15","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":[3897],"PO":["409909"]},"1238":{"abstract":"This project describes work in portable, high performance algorithm development, with experimental system support for I\/O intensive programs. For these programs the data access time is the predominant component of the running time. The work has three thrusts. (1) Multiprocessor Multi-disk File Systems. In ongoing research, an experimental multiprocessor multi-disk file system has been built, which runs on Intel Paragon. The file system was built to support a prototype for a standard application programmer interface; the interface has been designed to facilitate the production of portable programs. A major portion of this project is to evaluate the efficiency of theoretically optimal data access algorithms that have already been designed, and to validate the paradigms used to design these algorithms for a two-level memory hierarchy. (2) Additional Two-Level Memory Model Algorithms. LAPACK is a natural (and very appropriate) package for upgrading to accommodate for out-of-core data sets. A portion of these algorithms will be redesigned and implemented as prototypes for testing and validation. Completed programs will be released for public use and evaluation. (3) Three-level Memory Model. A significant research goal is to develop a memory which captures critical performance and latency behavior between main memory, disk systems, and tape systems, for many of the contemporary computer architectures. Such a model is intended to support the development of I\/O- efficient algorithms.","title":"Managing the Memory Hierarchy: From Theory to Implementation, Application, and Practice","awardID":"9504175","effectiveDate":"1995-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["112992"],"PO":["150516"]},"5715":{"abstract":"This award, in the Small Grants for Exploratory Research mode, supports initial explorations of the use of acoustic conduction properties to differentiate among materials. The focus of the exploration is an initial determination of the potential for the acoustics-based approach to produce useful information about material properties, while invariant to object shape. Useful analogs will be sought from results on visual invariants. If it is found that there are acoustic features that are shape invariant, then longer-term research in this area may lead to new robotic sensing systems with more capabilities for guiding materials handling opreations.","title":"Shape-Invariant Acoustic Features of Materials","awardID":"9526323","effectiveDate":"1995-08-01","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[14016],"PO":["125480"]},"4879":{"abstract":"9521747 Courter MCNC requests support from NSF for connection of North Carolina Center for Independent Higher Education to the Internet through the NC-REN regional network. NC-REN is the midlevel network located in the state of North Carolina that will provide operations and network information services. It will provide the North Carolina Center for Independent Higher Education with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The college needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the North Carolina Center for Independent Higher Education.","title":"Internet Connection Proposal for the North Carolina Center for Independent Higher Education","awardID":"9521747","effectiveDate":"1995-08-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11903,11904,"478564"],"PO":["121202"]},"1018":{"abstract":"9503460 Abraham This project connects Siena Heights College to the Internet over a T1 (1.544 thousand bit per second) line through MichNet. Faculty and students will benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they will be able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"NSFNET Connection For Siena Heights College","awardID":"9503460","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2315,2316],"PO":["57343"]},"1766":{"abstract":"This project is evaluating a new architectural paradigm that can extract and exploit the parallelism in sequential code. This new approach uses both software scheduling in the compiler, as in VLIW, and hardware scheduling at run-time, as in superscalar architectures. The compiler segments code into large blocks of instructions that form subgraphs of the control-flow graph, though not necessarily basic blocks. The compiler appends synchronization information to each block that describes which registers must be shared with blocks. The compiler appends synchronization information to each block that describes which registers must be shared with other blocks. The blocks or tasks are passed to separate identical parallel execution units, each of which executes its task sequentially. Tasks are scheduled optimistically, so that some tasks may be executed by a unit when they would not be executed in a sequential system; in such cases, the tasks are \"squashed,\" which means that their results are not written to memory or registers. At the end of each task, it blocks until the system determines that the task will not be squashed; at that time results are committed. The collection of execution units appears logically to be one unit, with a single register file. Shared register values are passed on an inter-execution-unit network, and tasks that need shared values block until the values are produced. During the first two years of this award is devoted to compiler design for the new architecture, to comparison with other architectures using simulation, and to conceptual refinement of the architecture. During later years, work is expected to focus on implementation.","title":"Prototyping Multiscalar Processors","awardID":"9505853","effectiveDate":"1995-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["552216","438221"],"PO":["179487"]},"2756":{"abstract":"This project addresses computational issues for finite groups that are currently beyond the scope of current algorithms and existing technology. The groups are represented either as permutation groups or as matrix groups defined over finite fields. The questions of interest concern both group theoretic structure and applications of the group theory. A central motivation for the research is the construction of representations for matrix groups defined over finite fields. This is an important part of a large-scale international effort to develop a suite of computational tools for performing matrix group computations. The tools to be developed have application to problems in the physical sciences, engineering, and those parts of mathematics dealing with high dimensional matrix representations of groups. A second research area computational techniques for solving the minimum word problem for finite groups. This problem arises in many contexts, such as routing in interconnection networks and coding theory, and is known to be computationally difficult. The research will lead to new algorithms which use group automorphisms to prune the search tree of possible solutions. A third research area is the development of a software architecture to bring parallel computers to bear on large scale problems in computational group theory, such as the construction of very large matrix and permutation representations. Such as integrated, interactive environment will enable researchers to quickly overcome the initial learning barrier for effective use of parallelism. They will be able to combine readily available networks of workstations at their home site (such as student labs), with an already familiar language, such as GAP or LISP.","title":"Applications of Group Theory to Large Scale Computation","awardID":"9509783","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["67140","521812"],"PO":["187585"]},"1315":{"abstract":"This project is extending the Alewife multiprocessor to explore two aspects of future scalable multiprocessors. One aspect is protection. Protection is required on accesses to hardware resources, with as little software overhead as possible. For example, when a message sender and receiver are part of the same application, they should be able to directly access network hardware. The other aspect is address translation, so that each application can have its own address space. All processors executing an application must have the same address space, however. To ensure this, memory mapping hardware is placed at each node of the multiprocessor, and must be kept coherent. The FUGU system provides three modes of interprocessor communication. Shared memory is provided by hardware synthesized messages among nodes, which maintain cache coherence. Short messages can be sent directly by performing loads and stores to I\/O registers that are in each node's address space. Longer messages are managed by a DMA engine that is separate from the processor. Translation and protection for shared memory and for short messages are provided by hardware enhancements that maintain coherence in the translation lookaside buffers and ensure that messages are received only by the processes that they are addressed to. For long messages, only minimal support for address translation is provided by the hardware since the need for such translation is likely to be rare. Any needed translation will be provided by software.","title":"Protection and Translation in Multimodel Multiprocessors: The MIP FUGU Workstation","awardID":"9504399","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["467768"],"PO":["549626"]},"4418":{"abstract":"For doing medical diagnosis, one may wish to design a learning algorithm which attempts to determine from test data which combinations of symptoms indicate that a person will develop a certain disease. The test data may consist of a collection of patient profiles, with the outcomes of a large number of tests on each patient, and a bit indicating whether the patient subsequently developed the disease. One may further assume that whether a patient develops the disease depends only on the presence or absence of a few symptoms, and all other symptoms are irrelevant. In that case, a good learning algorithms should output a hypothesis that is also a function of a small number of symptoms. A hypothesis can be used to predict whether future patients will develop the disease. If the hypothesis depends on only a small number of clinical tests, it saves time and money. In recent work, the investigator has shown a polynomial time PAC (Probably Approximately Correct) algorithm which learns k-term disjunctive normal form formulae which depend on at most r variables (where r is unknown and may be a function of the total number of variables) by creating a disjunctive normal form (DNF) hypothesis which contains at most poly(r) variables. An initial goal of this project is (a) to demonstrate a similar result for the class of decision lists. Additional goals include: (b) the exploration of different paradigms where extracting relevant information is important; (c) the discovery of efficient algorithms for the current problems; (d) the development of a theoretical framework for measuring relevance under which universally applicable techniques for reducing irrelevant information can be found. In addition to the research described above, the PI will teach a graduate seminar on computational learning theory with the expectation of attracting graduate students to the area.","title":"Relevance in Learning Theory","awardID":"9520134","effectiveDate":"1995-08-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[10822],"PO":["150516"]},"2625":{"abstract":"This research aims at demonstrating that visual motion analysis can be improved (1) by replacing the analysis of optical flow (the motion of image points) with that of image deformations (their motion relative to each other) and (2) by spanning a wider field of view. The advantages of image deformations are akin to those of differential amplifiers for the detection of weak signals in a noisy background: if noise affects both inputs equally, it is canceled by taking their difference. In the analogy, image motion caused by camera rotation is the noise, and that caused by translation is the useful signal. As to the field of view, the literature shows that a viewing angle of 60 degrees or more leads almost to a quantum improvement in the conditioning of the reconstruction problem. This lead is being pursued by a theoretical and empirical investigation of shape reconstruction from the deformations of wide-angle images induced by camera motion. The two ideas of image deformations and a wide field of view, already proven successful in preliminary studies, are being investigated theoretically and experimentally. The final contribution will be a multiframe shape and motion reconstruction method that works reliably and for perspective images.","title":"From Optical Flow to Image Deformations","awardID":"9509149","effectiveDate":"1995-08-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["513187"],"PO":["475621"]},"4903":{"abstract":"9521799 Crandell Spring Arbor College requests support from NSF for connectio of its campus network to MichNet. MichNet is the midlevel network located in the state of Michigan. MichNet will provide operations management and information services and it will give the Spring Arbor College connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The College needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff, and students of Spring Arbor College.","title":"NSFNET Connectivity for Spring Arbor College","awardID":"9521799","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11970,11971,11972,11973],"PO":["43608"]},"1306":{"abstract":"This project concentrates on three areas: (1) Average-case complexity: Tuning up the average-case reduction theory, finding more average-case complete problems, and proving average-case hardness of real- life problems; (2) Finite model theory: Investigating whether semantical properties (such as monotonicity) have any syntactic characterizations on finite structures, determining whether parts of polynomial time properties can be captured by polynomial-time-bounded logics, and studying finite structures with weights in infinite structures (such as arithmetic); (3) Evolving algebras: Examining a new computation model (evolving algebras) in order to use these algebras to specify and verify real-life algorithms.","title":"On Foundational Issues in Computer Science","awardID":"9504375","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["70021"],"PO":["150516"]},"2637":{"abstract":"9509195 Zelditch This research will extend studies of the ontogeny (the development of single individuals from egg to adult) of body form to be informative about phylogeny, and to provide information that was not available from comparisons of other body features. The proposed research will extend these studies of the ontogeny of body form, as part of an ongoing revision of piranha fishes. %%% The significance of the work is that it involves use of a novel morphometric method and investigation of the strengths and weaknesses of this method and its utility to systematic biology. Specifically, the research will address general questions regarding the relationship between ontogeny and phylogeny. One general question concerns the potential constraints that ontogeny may impose on morphological evolution. A commonly invoked constraint is Odevelopmental integrationO the association among the parts of an ontogeny. One specific hypothesis is that developmentally integrated features will exhibit congruent phylogenetic patterns because, in effect, they are not independent characters. This has been an important issue in systematics and evolutionary morphology and will be examined in this research. ***","title":"Systematics of Piranha Shape and Ontogeny","awardID":"9509195","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1171","name":"PHYLOGENETIC SYSTEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1197","name":"BIOLOGICAL RESEARCH COLLECTION"}}],"PIcoPI":["310581","510275"],"PO":["271822"]},"1835":{"abstract":"This award in the CONACyT Initiative funds a joint research project between two groups: the Robotics Laboratory of the Department of Computer Science at Stanford University and the Center for Artificial Intelligence at ITESM in Monterrey (Mexico). There have been several mutually beneficial exchanges (visits, courses, research) between these two groups over the last four years. The purpose of this project to expand this cooperation, not only in basic research, but also on applications such as manufacturing and robot-assisted surgery. The technical goal of this project is to integrate object-tracking techniques from computer vision and motion-planning techniques from robotics, in order to build a new tool, called the Intelligent Observer (IO for short), that will facilitate collaborative experimental research among geographically dispersed groups. While this project builds upon the two groups' strength in vision, planning, control, and robotics, the resulting Intelligent Observer will be a tool to enhance their future research capabilities in these domains. This tool will be used interactively by people at one or several geographical locations to observe and participate in an experiment implemented at another site. The hardware of the IO will consist of one or more vision sensors mounted on mobile platforms available at the experimental site. The software of the IO will accept high-level commands input by the users on their workstations, plan and control the motions of the platforms to allow the vision sensors to acquire enough visual information to meet the users' requests, apply image understanding techniques to extract information pertinent to the users' requests, and for each user, provide a pertinent graphic rendering of the experimental scene on a display. In addition to facilitating remote collaborations in research, the IO technologies should also benefit operations such as telepresence, teleconferencing, surveillance, and interactive TV.","title":"NSF-CONACyT: The Intelligent Observer: A Tool for Collaborative Experimental Research Among Geographically Dispersed Groups","awardID":"9506064","effectiveDate":"1995-08-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["264577","513187"],"PO":["125480"]},"19012":{"abstract":"","title":"An Imperative Mixed-Constructive Type Theory for Program Verification","awardID":"9696065","effectiveDate":"1995-08-28","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[48280],"PO":["150697"]},"2605":{"abstract":"A solution to an over determined linear system, where there may be errors in both the data matrix and the target vector, is required in many important applications in sciences and engineering. Recently, a new technique called Structured Total Least Norm (STLN) has been developed for obtaining the solution that preserves any affine structure, after the data are perturbed to account for the errors. It also permits the error to be minimized in various norms. The STLN algorithm is being investigated and developed into an efficient and practical solution method for many applications. Its computational performance is being studied and a more complete convergence theory is under development. Significant algorithmic and improvements are being made in order to efficiently handle large-scale problems and special structures. A particular study is being conducted to apply the STLN method to the model reduction by Hankel norm approximation problem. The effect of different norms are being explored. The STLN algorithm is being extended to solve more general problems where the structured matrix is a differentiable function of parameters to be estimated, and its performance is to be compared to other parameter estimation methods such as Prony's method.","title":"Solution of Structured Total Least Norm and Parameter Estimation Problems","awardID":"9509085","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["278441","562362"],"PO":["187585"]},"1825":{"abstract":"This research project in communication protocols focuses on the study of formal modeling of communication protocols which spans the areas of protocol specification, verification, testing and performance. Goals of the project are to provide a unification of the formulation techniques across all of these areas from specification to testing and to add the capability of studying performance within the same kind of formulation. Currently the approaches used to formally specify a protocol are different from those used to verify the logical correctness of a protocol. There is also a gap between the verification formulations and the conformance test generation formulations. The research studies in this project are aimed at closing these two gaps and thereby providing a more integrated approach to the design of communication protocols from specification to verification to testing. In addition, the studies aim to allow one to investigate the performance of the protocol at an early stage of the design, again using the same formulation techniques as in specification and verification.","title":"Research in Communication Protocols","awardID":"9506039","effectiveDate":"1995-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[4244],"PO":["150490"]},"1528":{"abstract":"Dear Al, Alex has kept me in the loop as you and he have converged on a revised scope of our proposed investigation into partitioning and ordering methods that take advantage of knowledge of coefficient magnitude, instead of coefficient structure only. Thanks for your support of this work, whose outcomes could feed directly into several other projects. To complete what I believe you need before processing this grant further, he and I have abstracted the project into the following two paragraphs for peers and nontechnical readers. I hope it is okay. Best Regards, David ========================================================================== Solution-adaptive Grid Partitioning and Variable Ordering for PDEs Alex Pothen and David E. Keyes The proposers consider grid partitioning and variable ordering problems that come to the fore in the parallel computation of problems modeled by partial differential equations discretized on unstructured grids. Partitioning algorithms that maintain load balance among the processors while incurring low communication costs for distributed memory parallelism have been developed in earlier work. Here solution-adaptive partitioning methods are proposed that strive, in addition, to attain good convergence rates in such data parallel contexts. Communication volume per iteration may rise, but only modestly for moderate-granularity parallelism, while the more important number of message-startups per iteration should not be strongly affected. Solution-adaptive ordering methods are also proposed for the fast solution of the problems on the local partitions. Two recently developed classes of partitioning and ordering algorithms that have proved to be successful in non-adaptive contexts will feature prominently in both the partitioning and ordering phases of this proposal. One class consists of spectral algorithms, (i.e., algorithms that make use of an approximation to a certain eigenvector of a Laplacian matrix derived from the grid and the discretization sche me), while the second class includes multilevel algorithms. Both algorithms will be generalized to the solution-adaptive context. Many computational problems in science and engineering can be modeled by partial differential equations, and subsequently solved as a system of algebraic equations defined on an unstructured grid. The most natural form of parallelism for such problems requires the original domain to be decomposed into subdomains, which are mapped whole on to individual processors. Iterative domain decomposition algorithms fit naturally into this framework, wherein a solution is assembled from subproblems whose boundary conditions are set by transmitting a limited amount of information between nearest neighbors. The partitioning and ordering methods proposed herein will be useful for solution methods of such domain decomposition type, which are designed with respect for the high communication-to-computation cost ratio in contemporary distributed-memory computers. The key opportunity to be exploited in this work is that of synergistically joining two ideas that have matured separately, and are usually used as ``black boxes''-- partitioning and ordering based on sparsity structure only, and domain-blocked iteration based on understanding the physical dependencies reflected in the coefficients. The software tools developed in this work will be demonstrated for ``grand challenge'' problems in application areas such as aerodynamics and geophysics.","title":"Mathematical Sciences: Solutions-Adaptive Grid Partitioning and Variable Ordering for PDEs","awardID":"9505110","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["518525","369299"],"PO":["562372"]},"19025":{"abstract":"","title":"Orthogonal Spline Collocation Methods for Partial Differential Equations","awardID":"9696078","effectiveDate":"1995-08-31","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["353756","269011"],"PO":["187585"]},"4939":{"abstract":"9521946 Hallas Edison Community College requests support from NSF for connection of their Charlotte County Campus network to SURAnet. SURAnet, a midlevel network will provide operations management and information services and it will give the Edison's Charlote County Campus a 128KB connection to the Internet connection, a collection of interoperable networks that connect most research and education organizations in the United States. The College needs the Internet connection to be able to access information resources throughtout the state, the nation and the world. The connection will benefit the faculty, staff students of Edison Commmunity College Charlotte County campus.","title":"Connection to NSFNET","awardID":"9521946","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12063,12064],"PO":["57343"]},"1827":{"abstract":"9506048 Lam During the course of this project, the principal investigator will investigate the design and performance of a new class of packet switching networks, called Burst Scheduling networks, for supporting multimedia applications. Burst Scheduling networks are designed for carrying video, audio, and data traffic, and characterized by: (i) use of virtual clock values in channel scheduling, (ii) packet flows (in particular, video flows) processed efficiently in bursts, and (iii) delay and delay jitter guarantees provided to packet flows that satisfy a Flow Specification (a new model of packet video motivated by our recent study of MPEG video). The primary objective of the proposed project is to investigate network design issues, such as, statistical versus deterministic performance guarantees, demand assignment strategies, efficient scheduling algorithms, fault-tolerant architecture and protocols, modeling of audio and delay-sensitive data traffic, flow control and buffer management strategies. The secondary objective of the proposed project is to investigate the design and prototyping of a transport protocol that makes use of performance guarantees provided by Burst Scheduling networks to support multimedia applications. Some of the proposed research problems will be investigated using mathematical methods. All of the research problems will be investigated experimentally in the Networking Research Laboratory of the Department of Computer Sciences. Specifically, we plan to add capabilities to a simulator of Burst Scheduling networks to enable the proposed research activities. The simulator will be run on a high-performance workstation and will be connected to other workstations where the prototype transport protocol and a real multimedia application will be run, supplying video, audio, and data flows to the simulator. *** ******* Darleen Fisher Program Manager Networking and Communications Research Program 4201 Wilson Blvd. Roo m 1175 Arlington Va 22230 (703) 306-1949 (703) 306-0621 (FAX)","title":"Packet Network Architecture and Prorocols for Video Services","awardID":"9506048","effectiveDate":"1995-08-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["516340"],"PO":["125800"]},"4819":{"abstract":"This research project, in the area of on-line algorithms, focuses on deterministic and randomized algorithms for the k-server problem and some natural generalizations of it. Many important questions related to these problems are examined. Their resolution will impact the area of on-line algorithms, and will help to bridge the gap between the theory of competitive analysis and its numerous applications in robotics, data and memory management and programming languages. Additional areas of investigation include complexity theory, the theory of circuits, approximation algorithms, and novel search strategies.","title":"On-line Algorithms","awardID":"9521606","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["157704"],"PO":["150516"]},"1608":{"abstract":"Numerical methods are developed for solving large scale matrix problems arising in applications. These applications are quite diverse and include such areas as statistical modeling and quantum chromodynamics (QCD). The basic tool for these computations comes from the classical theory of moments and numerical quadrature. These problems are equivalent to estimating upper and lower bounds for a quadratic form. One area of particular interest is computing the generalized cross validation parameter. This technique is used in solving ill-posed least squares problems by regularization methods. A numerical procedure is developed which enables one to analyze very large data sets. Also, a method for computing a parameter which is of importance in solving ill-conditioned sparse least squares problems is developed. The basic objective of this research is to develop new and robust algorithms for solving very large scale linear problems.","title":"Computational Methods in Linear Algebra Using the Theory of Moments","awardID":"9505393","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["320271"],"PO":["187585"]},"4908":{"abstract":"9521815 Hall This project connects Aims Community College to the Internet over a T1 line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"New Connections from AIMSNet to the Internet","awardID":"9521815","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11985],"PO":["57343"]},"891":{"abstract":"9503064 Hollan This award provides support for visualization facilities, servers to support distributed simulation, and a high-speed cluster network. In addition the University of New Mexico will establish a National Information Infrastructure (NII) Experimental Laboratory in the Science and Engineering Library to serve as a shared research testbed, as well as to facilitate efforts in distributed simulation and research collaborations in Biology, with the Santa Fe Institute and the National Laboratories. The Laboratory equipment will include graphics workstations connected via a high-performance local area network to high-end symmetric multiprocessing systems, an SGI Power Onyx and Power Challenge, and to remote high-performance facilities at the Maui High Performance Computing Center's IBM SP-2, the Sandia National Laboratory's Intel Paragon, and the Los Alamos National Laboratory's CM-5. The University will build on its existing strengths in adaptive computation, human computer interaction, information analysis, and simulation to focus on adaptive multiscale interfaces; distributed computation, communication, and security for network-based applications; data mining and filtering; and improved access to distributed simulation.","title":"CISE Research Infrastructure: Effective Information Access: Computer Science Research Fundamental to Creation of a National Information Infrastructure","awardID":"9503064","effectiveDate":"1995-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["531861","550599","123164"],"PO":["557609"]},"550":{"abstract":"9501637 Fujimoto This award provides support for infrastructure at Georgia Institute of Technology in the form of three distributed laboratories where individuals at geographically distinct locations can interact with each other on-line using powerful, distributed computational tools, to solve shared problems. The infrastructure will include a multi-granular compute server and ATM switch, a video server with high-performance multi-media workstations, and network equipment. The research topics to be explored include interactive steering, distributed simulations, collaborative systems; large-scale community, ATM and wireless networks.","title":"CISE Research Infrastructure: Distributed Laboratories","awardID":"9501637","effectiveDate":"1995-08-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["523077","518043","536648","549757",1265],"PO":["297837"]},"342":{"abstract":"9500991 Myers This award provides support for the research infrastructure necessary to investigate the viability of building scalable systems from commodity components. Hardware components will include workstations and ATM switches. Research topics to be conducted include the design of an operating systems that scales with processor performance; and the design, implementation and experimentation of five different scalable systems: DNA Assembly Server, Scalable Storage Server, Cluster-C* applied to remote sensing, a general computing environment based on an efficient fine-grain parallelism on multiple processors, and a parallel simulator.","title":"CISE Research Infrastructure: A Laboratory for Scalable Systems","awardID":"9500991","effectiveDate":"1995-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["229088","118484","560046"],"PO":["557609"]},"970":{"abstract":"This project involves a number of fundamental problems in several areas of algorithm design and analysis. The first area is pattern matching and in particular, one-dimensional string matching. A major goal is to obtain tight bounds on the performance of string matching algorithms (measured in comparisons). The second is the amortization and the performance of splay trees. This effort is directed towards making further progress on conjectures relating to splay trees, conjectures such as the Split Conjecture, the Traversal Conjecture and the Optimality Conjecture. The third is the area of parallel algorithms. The goal is to obtain work-optimal algorithms which run as fast as possible. Future work on two problems, graph connectivity and Voronoi Diagrams is described.","title":"Networks, Pattern Matching and Parallel Algorithms","awardID":"9503309","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518072"],"PO":["150516"]},"761":{"abstract":"The approach of this Career Research Project is to apply weak classifiers in machine learning systems to produce better learning rules. Weak classifiers are those that do not allow correct concept identification all the time, but that work better than random guesses. Alone, they are not good enough for applications, but in combinations, they may be useful. There are two major considerations - efficiency of learning and generalization error. Within this approach, the goal of this research is to rigorously investigate the fundamental problems of learning systems in supervised learning performance and efficiency (2) to apply adaptive learning machines to intelligent network management.","title":"Approximating Optimal Solutions Using Polynomial-Time Learning Machines and Applications in Intelligent Network Management","awardID":"9502518","effectiveDate":"1995-08-01","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["432210"],"PO":["565227"]},"794":{"abstract":"IRI-9502671 Pratt, Lorien Colorado School of Mines CAREER: Development of Techniques for Neural Network Transfer, as Applied to Hazardous Waste Characterization. In recent years, neural network systems have been used to provide solutions to a variety of problems, from speech recognition and manufacturing control to forensic hair analysis and medical diagnosis. This project uses an application to a problem of national interest -- remediation of hazardous waste sites -- as the focus of a program of research with broader implications. Networks built as part of this project are being used to aid in the interpretation of data supplied by noninvasive sensors such as magnetic devices and ground penetrating radar, in order to characterize the location and nature of buried waste before it is dug up or treated in situ. Students at both the undergraduate and graduate levels are involved in this project, which serves both educational and research purposes. Within the work on waste remediation, research is being undertaken on transfer of knowledge. Neural networks are automatically constructed (\"trained\") from a set of data representing desired system input and output, and neural network transfer addresses the question of how a network trained for one task can be used to aid in training a network for a new but related task. Without transfer, training times for a new task can be lengthy, and a large amount of training data can be required. With transfer, both of these factors can be reduced. Transfer applied to the hazardous waste remediation problem addresses important practical concerns in that type of application. For example, a network trained to interpret sensors at one site can be used to facilitate training for a network with different geophysical characteristics. Also, a network trained on data generated from a synthetic sensor model can be used to facilitate training on field data.","title":"Development of Techniques for Neural Network Transfer, as Applied to Hazardous Waste Characterization","awardID":"9502671","effectiveDate":"1995-08-01","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[1786],"PO":["54008"]},"542":{"abstract":"The proposed project is focused on the theory, structure and design methods for the perfect-reconstruction (PR) \/ncar-perfect- reconstruction (NPR) filter banks and their applications in signal conversion, detection and adaptation. High performance filter banks with high attenuation are needed in many applications such as audio compression algorithms, high-bandwith high-resolution A\/D converters, wideband signal detection systems and adaptive filtering algorithms. The design of these filter banks are very difficult because of the nonlinear relations between the parameters and the objective function. New structures and design methods will be investigated. They will open up new classes of filter banks, some of which are addressed in the project. They are the biorthogonal cosine-modulated filter bank, the infinite-impulse- response (IIR) cosine-modulated filter bank, and the nonuniform filter bank. These filter banks will be used in several applications such as high-performance A\/D converter, nondestructive evaluation, echo cancellation and adaptive noise cancellation systems. The education part consists of writing an undergraduate textbook on the theory and design methods of filter bank wavelets, establishing an internet site for the storage of design programs and coefficients of filter banks and developing a new course on time- frequency and time-scale analysis.","title":"Theory and Design of Filter Banks and Wavelets with Applications in Signal Conversion, Adaptation, Detection and Classification","awardID":"9501589","effectiveDate":"1995-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["279723"],"PO":["564898"]},"784":{"abstract":"This research involves the development of efficient, reliable, and real-time realizable coding algorithms and techniques for compressing and transporting audio-visual signals, targeting particularly the visual-telephone application. For a total channel bit-rate of 64 kb\/s or less, our goal is to achieve superior grade-of-service by treating the compression of the audio (speech) and video signals as an integrated problem. Our thrust centers around the use of vector quantization techniques, and schemes that jointly optimize the signal analysis and quantization functions. We place particular emphasis on finding an efficient representation of the displacement (\"motion\") field for motion compensated prediction of the video signal. To facilitate personal wireless communications, we are exploring adaptive coding schemes that exploit the prioritized transmission of encoded data. For compressing speech signals, we are exploring variable rate coding schemes, and are allocating bits between the speech and video signals to optimize the overall grade-of-service. Achieving our goal would give significant impetus to the development of the emergent Information Superhighway, which can form part of an infrastructure for supporting high performance computing. Educational activities undertaken in conjunction with the above research include but are not exclusive to: the development of undergraduate digital signal processing laboratory courses; the introduction of graduate courses in the area of audio-visual information processing and communications; increasing the use of computer-based multimedia instruction in the classroom; assisting in speeding up the digitization of the library and networking of its databases.","title":"Audio-Visual Signal Compression Using Vector Quantization","awardID":"9502629","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[1753],"PO":["564898"]},"18957":{"abstract":"","title":"RIA: Fast Simulation of Computer Architectures Using Field-Programmable Gate Arrays as Hardware Accelerators","awardID":"9696010","effectiveDate":"1995-08-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["517778"],"PO":["549626"]},"335":{"abstract":"Trefethen The investigator studies problems in the mathematical sciences involving highly non-normal matrices and operators. Approximately speaking, this means matrices and operators whose eigenvectors or eigenfunctions are far from orthogonal. Most matrices and operators that arise in applications are normal or close to normal, but the highly non-normal cases constitute an important minority, one that has been poorly handled by traditional methods based on eigenvalues. The emphasis of this project is on methods that avoid the use of eigenvalues. Some of these make use instead of certain sets in the complex plane known as pseudospectra, defined in terms of perturbations of the spectrum or equivalently as regions bounded by level curves of the norm of the resolvent. The applications investigated fall in three areas: numerical solution of non-self-adjoint partial differential equations; iterative solution of large-scale matrix problems; and fluid dynamics, specifically hydrodynamic stability and transition to turbulence. This work is connected with some major ongoing developments in science and engineering. One is a basic change in the prevailing view of how fluid flows become unstable and eventually turbulent, with potential applications across many branches of mechanical, aeronautical, and civil engineering as well as in meteorology, geophysics, and other scientific fields. A second, less accessible to the public but still of great importance, is the great shift underway in computational science from \"direct\" to faster \"iterative\" methods for solving large-scale linear algebra problems. The work of the investigator's group in both of the areas just mentioned has had considerable visibility. It is also having a growing educational impact through the idea of \"pseudospectra\" mentioned above, a way of visualizing these mathematical problems on a computer that many students (and professors!) find visually and conceptually appealing.","title":"Mathematical Sciences: Non-Normal Matrices and Operators: Analysis, Computations, Applications","awardID":"9500975","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["54389"],"PO":["565027"]},"787":{"abstract":"9502639 Kurose This award provides support to equip a networked, experimental testbed to enable research in the development of the operating system, I\/O, networking, object management, and information retrieval components of future networked multimedia information systems. The testbed will consist of two shared-memory multiprocessor facilities attached to several parallel mass storage I\/O devices and a high-speed ATM network. The research team will be developing several key hardware and software technologies needed to support future networked, multimedia information systems. Specific research areas include operating systems, I\/O, networking, object management and information retrieval.","title":"CISE Research Infrastructure: Infrastructure to Support Research on Networked Multimedia Information Systems","awardID":"9502639","effectiveDate":"1995-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["499259","152242","533875","550864","545655","507668","519591","550342"],"PO":["557609"]},"5061":{"abstract":"This is a Research Planning Grant for women who have nt had prior independent Federal research. The award is allowing the PI to develop a research program in the area of multicast communications for highly parallel computing systems. The planning activities are concentrated on the investigation of routing contronl strategies for multicast networks from the following aspects: 1) designing new routing control strategies which can more effectively reduce the non-uniformity of multicast connections; 2) developing a network simulator to simulate the multicast networks under these routing control strategies, and gather a large amount of statistical performance data to compare different control strategies and guide the theoretical analysis in the later phase of the research systems.","title":"Routing Control Strategies for Multicast Networks","awardID":"9522532","effectiveDate":"1995-08-01","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550688"],"PO":["549626"]},"700":{"abstract":"Flexibility and adaptability of a robotic manipulator can be achieved by incorporating vision and sensory information in the feedback loop. Previous research by the PI introduced a framework called ``controlled active vision'' for efficient integration of the vision sensor in the feedback loop. This framework emphasized eye-in-hand robotic systems (where the vision sensor is mounted on or close to the manipulator's end-effector) and was applied to the problem of robotic visual tracking and servoing with very promising results. This research extends the framework to other problems of eye-in-hand robotic systems such as the derivation of depth maps from controlled motion; the vision-guided, automatic grasping of moving objects; the active calibration of the robot-camera system; the problem of automatically detecting moving objects of interest; and the computation of the relative pose of the target from the camera. In addition, the new work investigates issues such as the stability and the robustness of the algorithms. All the work is experimentally verified on the Minnesota Robotic Visual Tracker (a flexible eye-in-hand robotic system). This research has potential applications to transportation (e.g., pedestrian detection and tracking, vision-based vehicle following), inspection, and assembly (e.g., vision-guided manipulation of moving objects).","title":"CAREER: Eye-In-Hand Robotic Systems","awardID":"9502245","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["557449"],"PO":["475621"]},"865":{"abstract":"9502979 Du This award provides support to develop a prototype distributed computing, storage and scientific visualization facility for the National Information Infrastructure (NII). Key elements of the facility include a distributed parallel storage system with several physically distributed RAID systems with high speed ATM connections and a high-bandwidth disk system with direct connection to a FIBER Channel swith, a distributed computing server with clusters of high-end workstations and multiprocessors, a high resolution display unit, and a high-speed local, metropolitan, and wide area network infrastructure. Projects include technology development in the areas of multimedia servers and database servers; network research in the areas of network design, control and performance; and research in parallel architecture and system software. Applications areas to be supported include manufacturing, healthcare, scientific computing, and scientific visualization.","title":"CISE Research Infrastructure: Application Over High-Speed Networks: A Pilot Project for the NII","awardID":"9502979","effectiveDate":"1995-08-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["563608","543507","382574","383980"],"PO":["557609"]},"799":{"abstract":"Representing curved shape is a fundamental problem in geometric modeling and design. A variety of approaches currently exist for modeling curved shape, by far the most popular of which is a boundary representation (B-rep) whose surfaces are trimmed NURBS (non-uniform rational B-splines). Unfortunately, building a modeler based on trimmed NURBS is exceedingly difficult for at least two reasons. First, trimming two NURBS patches to agree along a common edge usually involves complex surface\/surface intersection algorithms and substantial approximation. Second, even in the absence of sharp edges, patching is often required since a single NURBS patch is capable of modeling only surfaces topologically equivalent to planes, cylinders, and tori. Modeling surfaces of other topological types (even those as simple as a sphere) require the surface be decomposed into a quiltwork of individual NURBS patches. Complicated continuity conditions must then be imposed to guarantee that adjacent patches join smoothly. Subdivision provides a promising alternative to NURBS. Using subdivision, a polyhedron is mapped to a sequence of denser polyhedra whose limit is a curved object. Each new polyhedron is derived from the previous polyhedron by splitting each of its faces into four new faces and positioning its new vertices using a fixed averaging mask. Different masks yield surface features such as corners, curved edges, or smooth faces in the limit object. The method is simple, requiring only polyhedral modeling. The method is general, producing objects with smooth faces and sharp curved edges without trimming or patching. Finally, subdivision provides a hierarchical representation that allows the design of efficient multi-resolution processing algorithms. This research addresses a combination of theoretical and applied problems whose solution is essential if subdivision is to be of use as a practical method for modeling curved shape. Specifically it develops: Curvature continuous subdivision methods; Subdivision methods for local refinement and introduction of shapes and edges; Functional subdivision methods over irregular triangulations (necessary for FEA) and algorithms for: Conversion to and from other representations such as NURBS, Editing and display of subdividion surfaces, Finite element analysis over subdivision surfaces, Computing the intersection, union, or difference of subdivision surfaces.","title":"Subdivision Methods for Computer-Aided Design and Engineering","awardID":"9502694","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[1796],"PO":["187585"]},"5392":{"abstract":"9523651 Bishop The Southwestern Michigan College requests support from NSF for a connection to the Internet through the MichNet regional network. MichNet is the midlevel network located in the state of Michigan that will provide operations and network information services. It will provide the Southwestern Michigan College with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The college needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Southwestern Michigan College.","title":"Internet Connectivity for Southwestern Michigan College","awardID":"9523651","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[13196,13197,13198,13199],"PO":["57343"]},"5161":{"abstract":"This grant provides funding to support the travel of students selected to present research papers at the first student conference of the South-Central Computational Science in Minority Institutions Consortium (SC-COSMIC). The consortium includes major research institutions, minority universities and colleges, community colleges, and independent school districts located in Louisiana, Texas, Oklahoma, Arkansas, New Mexico, and Arizona. Students from all of the institutions in the consortium are expected to present papers at the conference, which is scheduled for Oct.22-25,1995","title":"Special Project: A Student Conference on Computational Science and Engineering for Minority Institutions in the South-Central United States","awardID":"9522903","effectiveDate":"1995-08-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["24590"],"PO":["564412"]},"9671":{"abstract":"","title":"Presidential Faculty Fellow Award: Intermediate Languages for Enhanced Parallel Performance","awardID":"9596184","effectiveDate":"1995-08-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["399214"],"PO":["250083"]},"910":{"abstract":"This project concerns two topics in numerical linear algebra: the numerical treatment of Markov chains and regularization of ill-posed linear systems. The topics share common features: singular or nearly singular matrices; use of iterative methods for large-scale problems; problems in matrix perturbation; and connections with infinite dimensional problems. The computation of the steady-state vector of a Markov chain as well as other important quantities are being investigated. In particular, algorithms are being developed and analyzed for calculating mean first passage times and for computing the recurrence matrix of M\/G\/1 type queues. In addition aggregation methods with overlapping blocks and the behavior of chains with sluggish transients are being considered. When ill-posed problems are discretized they result in ill-conditioned linear systems which must be regularized to yield accurate solutions. There are three main goals in this work. The first is to prove the folk theorem that if the components of the data vector with respect to the singular vectors decay sufficiently fast then the conjugate gradient iteration will produce a regularizing set of solutions. The second is to treat problems with errors in the matrix by a regularized total-least-squares approach. The third is to further preconditioning strategies for iterative solution methods.","title":"Numerical Methods for Ill-Posed Problems and Markov Chains","awardID":"9503126","effectiveDate":"1995-08-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["450658","279149"],"PO":["187585"]},"503":{"abstract":"This project investigates the topic of approximation algorithms in computational geometry, with focus on the two problems: polyhedral surface modeling and Euclidean shortest paths. In surface modeling, one tries to construct a polyhedral model of a complex surface, based on a set of unordered sample points. The complexity of constructing and manipulating the model depends on its number of vertices and faces, and therefore a natural optimization goal is to minimize these features in the model without exceeding a pre-specified error tolerance. The project studies various surface-modeling problems within the formal framework of computational geometry, and analyzes the issues of computational complexity. The problem of computing shortest paths is central to robotics and autonomous navigation. The research investigates approximation algorithms for shortest path problems in two and three dimensions. In two dimensions, the query version of the shortest path problem is studied: preprocess a set of polygonal obstacles so that given two points p and q, the distance between them can be determined in polylogarithmic time. In three dimensions, the goal is to design simpler and more practical alternatives to the exact algorithms for shortest paths among polyhedral solids or on a polyhedral surface.","title":"Approximation Algorithms in Computational Geometry","awardID":"9501494","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["536698"],"PO":["187585"]},"746":{"abstract":"The need to design, assemble, and manipulate synthetic models of the physical world is common to many task domains in science, engineering, education, and medicine. In robotics, attention has focused recently on modular robots and modular robot tasks. A modular robot is one which is assembled from a predefined set of parts. Typically, the set of parts is a small set; however, the space of robots that can be built from the parts set is large. This research focuses on creating powerful interactive virtual environments that will enable users to modify, study, and experiment and interact with modular robots and modular robot tasks. This research explores the creation of a software environment in which one can take things apart and reassemble them (perhaps incorrectly!); design, build and experiment with simulated physical mechanisms and objects; and in general explore and manipulate the environment without being limited to some small set of anticipated actions. A fundamental requirement for such an environment is that it possess physical solidity -that is, objects in the environment must be treated as impenetrable objects. Modeling physical solidity in simulated environments is extremely difficult and as yet has only been dealt with on a special-case basis. The research work in this project centers on constructing and demonstrating virtual environments that model contact, collision and friction in a general manner. Topics of concern are fast compute-times, an extremely high level of reliability, and the ability to handle a diversity of models and environments.","title":"CAREER: Physical Simulation For Assembling Robots and Robot Assembly","awardID":"9502464","effectiveDate":"1995-08-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[1676],"PO":["335186"]},"999":{"abstract":"The development of numerical methods for large systems is central in the development of efficient codes for fluid dynamics, elasticity, and other core problems of continuum mechanics. Many other tasks in such codes parallelize relatively easily. The importance of the algebraic system solvers is therefore increasing with the appearance of parallel and distributed computing systems, with a substantial number of fast processors, each with relatively large memory. The development of improved methods will, together with more powerful computer systems, make it possible to carry out simulations in three dimensions, with quite high resolution, relatively easily. Work will continue in developing iterative substructuring and other domain decomposition methods for increasingly difficult elliptic problems. Domain decomposition algorithms are iterative methods, often of conjugate gradient type, for the parallel solution of the large linear, or nonlinear, systems of algebraic equations that arise when partial differential equations are discretized by finite elements, finite differences, or spectral methods. In each iteration step, local problems representing the restriction of the original problem to a potentially large number of subregions are solved approximately. The subregions, which can be allocated to individual processors of a parallel computer, form a decomposition of the entire domain of the problem. In addition, the inclusion of a coarse subproblem substantially increases the efficiency of the preconditioner. In this study, which combines mathematical analysis with the design and numerical testing of algorithms, a special emphasis is on the study of elements and other high order finite element methods, on nonconforming methods such as the mortar finite elements, and on the difficulties which are related to distorted subregions or elements.","title":"Iterative Substructuring Methods for Elliptic Problems and Related Algorithms","awardID":"9503408","effectiveDate":"1995-08-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["517232"],"PO":["187585"]},"704":{"abstract":"The objective of this project is to scale up the applicability of planning algorithms developed in the field of Artificial Intelligence. The basic research component of the project is to first investigate techniques for improving scalability of planning using parallel techniques, then to explore machine learning techniques for reusing and refining generated plans. Industrial applications of AI planning algorithms have been limited largely by the computational complexity of the planning task. The significant speedup that can be obtained using parallel hardware and machine learning techniques can bridge the gap between research and a wide variety of industrial applications. To demonstrate the power of the techniques developed here, they will not only be formally verified but will be applied to such applications as automated assembly and cooperative planning of unmanned ground vehicles. The CAREER project will also impact graduate and undergraduate education. Existing seminar courses in Parallel AI and in Planning and Robotics will be refined. An industrial team will be formed to suggest topics and to oversee class projects. All course materials developed for these classes will be packaged and available for general dissemination over the Internet.","title":"Scaling Up Planning Systems Using Parallel Hardware and Machine Learning","awardID":"9502260","effectiveDate":"1995-08-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["547675"],"PO":["565227"]},"858":{"abstract":"9502956 Schnabel This award provides support for high-speed networking equipment, high-performance multiprocessor workstation servers. a high-speed disk array, and multimedia devices for collaboration, exposition and visualization. The University of Colorado department of Computer Science will be addressing issues of data movement in Grand Challenge and National Information Infrastructure (NII) applications. This in conjunction with the floating point needs of Grand Challenge computations, leads to their request for high-speed computation and communication infrastructure. The research associated with the infrastructure falls into four inter-related projects in the area of scientific computing, distributed systems, and resource discovery. These four projects are data movement in Grand Challenge computing, global optimization algorithms for molecular configuration problems, compiler-assisted network runtime systems, and resource discovery and information sharing.","title":"CISE Research Infrastructure: High Performance Infrastructure for Computational Science","awardID":"9502956","effectiveDate":"1995-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["63347","425934","542513","543625"],"PO":["557609"]},"2382":{"abstract":"9508267 Franciosi Lasell College requests support from NSF for connection of the campus networks to BBN Planet. BBN Planet, a midlevel network will provide operations management and information services and it will give the Lasell College a 56KB connection to the Internet connection, a collection of interoperable networks that connect most research and education organizations in the United States. The College needs the Internet connection to be able to access information resources throughtout the state, the nation and the world. The connection will benefit the faculty, staff students of Lasell College.","title":"Connection to NSFNET","awardID":"9508267","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[5533,"68508",5535],"PO":["57343"]},"1095":{"abstract":"This research addresses principles for organizing predictable and flexible behavior in complex sensorimotor systems operating in unstructured environments. The central hypothesis of the work is that large classes of correct behavior can be constructed at run-time through the use of a small set of properly designed control primitives (the control basis) and that the skillful use of these sensorimotor primitives generalizes well to other tasks. A control basis is designed to represent a broad class of tasks, to structure the exploration of control policies to avoid irrelevant or unsafe alternatives, and to facilitate adaptive optimal compensation. The Discrete Event Dynamic Systems (DEDS) framework is used to characterize the control basis and to prune inappropriate control composition policies. Dynamic programming (DP) techniques are used to explore safe composition policies in which sensory and motor resources are bound to elements of the control basis to maximize the expected future payoff. An adaptive compensation policy is designed to extend the control basis and to incrementally approximate optimal control policies. A program of theoretical development and empirical analysis is undertaken to demonstrate the utility of this approach in robotics and machine learning applications.","title":"A Control Basis for Learning and Skill Acquisition","awardID":"9503687","effectiveDate":"1995-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["391847","513288"],"PO":["475621"]},"4473":{"abstract":"9520315 Teter This award is one made through the FY95 Computational Approaches to Real Materials competition. Funding is provided through the Divisions of Materials Research, Mathematical Sciences and Advanced Scientific Computing, as well as by the Office of Multidisciplinary Activities in the Mathematical and Physical Sciences Directorate. The research combines algorithm and code development with materials theory to address important materials problems for which computational breakthroughs can produce large payoffs. As such, the research spans the strategic initiatives in High Performance Computing and Communications and Advanced Materials and Processing Phase transformation and electronic structure properties of realistically modeled crystalline and amorphous materials will be studied using a new tight binding molecular dynamics code. This new technique represents a compromise between computationally infeasible ab initio techniques and faster - but less accurate - methods that employ classical potentials. The tight binding molecular dynamics method has non-orthogonal basis functions and handles electrostatic interactions. This will allow the study of inhomogeneous systems such as amorphous materials and interfaces, as well as ceramic materials which have significant ionic character in their bonding. The method will build on previous linear scaling techniques which are explicitly parallelizable. The codes will be implemented on the Cornell SP-2. This new technique will allow the study of a variety of physical systems and processes, inaccessible by previous methods, such as solid\/liquid and solid\/solid phase transformations, defect diffusion in materials and amorphous materials. Besides Cornell, the team includes participants from Corning, Los Alamos National Laboratory, Oxford University, AT&T Bell Laboratories, IBM and DEC. %%% This award is one made through the FY95 Computational Approaches to Real Materials competition. Funding is provide d through the Divisions of Materials Research, Mathematical Sciences and Advanced Scientific Computing, as well as by the Office of Multidisciplinary Activities in the Mathematical and Physical Sciences Directorate. The research combines algorithm and code development with materials theory to address important materials problems for which computational breakthroughs can produce large payoffs. As such, the research spans the strategic initiatives in High Performance Computing and Communications and Advanced Materials and Processing The research will involve a complementary team who will apply fundamental aspects of materials physics to understand and simulate the large scale processing of materials. Such processing phenomena as solid\/solid phase transformations and solid\/liquid phase transformations will be modeled. In addition, the simulations will be large enough so that the effects of defects and their kinetics will be studied. The use of new algorithms and their implementation on massively parallel computers enable these ambitious calculations to be done. The results will be a major contribution to the design and processing control of new materials. ***","title":"Molecular Dynamics Simulation of Materials Processing Using Linear-Scaling Tight Binding Models","awardID":"9520315","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["489793","118965"],"PO":["145396"]},"2582":{"abstract":"The central theme of this research is the development of a fuller theoretical description of the behavior of memoryless-error- function (or Bussgang) type blind equalization algorithms, in particular CMA, as used in practice with finite-length, fractional spacing, higher-order (non-constant modulus, non-uniformly distributed) source constellations, (deterministic and stochastic) correlated source time series, and modest channel noise. The initial target is the behavior of fractionally-spaced CMA with a correlated (or periodic) source, which appears capable of causing misbehavior in practice. We plan to use analytical tools from topologically based, algebraic-geometry (in particular Bernstein's theorem, relaxation methods, and Morse theory) non typically associated with the study of adaptive filters in addition to averaging theory tools popular in adaptive systems analysis. The ultimate intent is to convert an expanded theory into situation dependent design guidelines for stepsize, length, fractional- spacing, initialization selection, and failure recovery tricks for the use of CMA as a start-up scheme (with a subsequent switch to decision-direction) for high data throughput applications. We plan to translate our analytical advances on CMA to fractionally-spaced realizations of other blind equalizer algorithms of the memoryless error function class (including refinements to CMA), for which actual operating data can be obtained industrially as for CMA. We also plan to use our behavior insights into CMA to help provide fair comparisons on actual operating data to competing schemes such as symbol-spaced decision feedback equalizers and similar complexity algorithms based on second-order correlation statistics of single-input, multiple- output models of fractionally-spaced equalization.","title":"Blind Adaptive Fractionally-Spaced Linear Equalizer Behavior","awardID":"9509011","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["466890"],"PO":["564898"]},"1020":{"abstract":"This research is on techniques for testing VLSI circuits directly at functional levels, while ensuring that standard testing quality goals are met. A high-level fault model called the induced functional fault (IF) model is being investigated. With this model, an IF fault class can be coupled to a physical fault class so that detection of IF faults ensures detection of physical faults. Advantages of this approach are easy derivation of near- minimal test sets, and reuse of tests in other circuits. The construction, use and reuse of precomputed tests for sequential circuits are being explored. In this regard, the application of balance and functional properties to simplifying test generation and improving fault coverage are being studied. Built-in self- testing methods that facilitate the implementation of functional testing methods and the detection and elimination of design errors are also being explored.","title":"Functional Testing of Complex Digital Systems","awardID":"9503463","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["549712"],"PO":["321058"]},"1141":{"abstract":"The supercomputing industry is now dominated by parallel architectures. In many such systems, memory is physically distributed among processors in order to achieve better scalability, requiring nodes to communicate through a network. In order to reduce communication latency, many systems have the wormhole-routing switching strategy, in which messages are pipelined through and a single destination, or collective. Communication operations may be either point-to-point, which involves a single source and a single destination, or collective, in which more than two processes participate. Collective communication operations are particularly important in scientific computing, where large data arrays are distributed over the local memories of the nodes, but are manipulated through single operations. This research project addresses the design of collective communication operations for wormhole-routed networks. The research is intended to explore architectural and algorithmic alternatives in the design of communications subsystems for next generation wormhole-routed networks. The project can be divided approximately into four subareas. First, both models will be used to develop new algorithms for collective operations in addition to those already under investigation. Target platforms will include both direct networks, as well as wormhole-routed switch-based interconnects. Second, the resulting algorithms will be applied in order to support higher-level parallel programming constructs, such as virtual process topologies, parallel I\/O operations and distributed shared memory. Third, the resulting communication services will be used to improve the performance of parallel applications, in particular parallel numerical algorithms. Finally, the use of the new models will be investigated in wormhole-routed systems that serve purposes other than parallel computing, such as high speed local area networks. The methods used will be analysis, simulation, and experimental studies on commercial wormhole-routed systems. The significance of this research is that it will provide new solutions to the communication needs of parallel applications. Besides providing a better understanding of the issues and problems that must be addressed in design and use of collective operations in wormhole-routing systems, this project will produce tangible results in the form of new protocols, prototype implementations of new algorithms, and new applications software, all of which will be made publicly available for use by other researchers.","title":"Collective Communication in Wormhole-Routed Massively Parallel Computers","awardID":"9503838","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["472159"],"PO":["74434"]},"1383":{"abstract":"9504605 Barden The five Tribally-Controlled Community Colleges in North Dakota - Ft. Berthold Community College, Little Hoop Community College, United Tribes Technical College - are seeking to connect to the NSFNET. These two year colleges are located in remote areas of North Dakota. These are all relatively small and offer a complete range of course selections including transfer curricula, para- professional, and pre-engineering. Each campus includes use of the state's On-line Dakota Information Network and other library resources to improve student ability to deal with information. This is a particularly important task given the isolation of Indian reservations and their need for information. The colleges will work with North Dakota's sophisticated, higher education network to accomplish the connection. The North Dakota Information Network will provide technical assistance and will provide the gateway service. Each college will begin their work toward connection by installing appropriate local area networks. Then training in the use of the connection will be accomplished with the help of Electronic Pathways, an organization devoted to helping Indians connect to the Internet.","title":"Connecting North Dakotas Tribal Colleges: The Internet Comes to Indian County","awardID":"9504605","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7263","name":"NETWORKING INFRASTRUCT-EDUCAT"}}],"PIcoPI":[3192],"PO":["57343"]},"717":{"abstract":"This research deals with the implementation of continuous-time analog VLSI chaps for processing of sensory signals. Two specific analog sensors are being developed: 1) a single-chip visual time- to-contact sensor that reports the amount of time until the chip collides with an oncoming obstacle (assuming constant relative motion), and, 2) a sound localization chip that computes the direction (in two-dimensions) of a sound source using signals from two microphones. Though these projects may appear to be unrelated, the proposed solutions using adaptive analog computation in CMOS hardware lead to many common problems that must be solved. By providing a cross-fertilization between auditory and visual processing, it is hoped that the underlying biological computational primitives and neuronal representations will be discovered. The resulting low-power analog devices have obvious applications in such areas as collision warning sensors for intelligent automobiles and improved, low-power hearing aids. The educational plan at both the undergraduate and graduate level has a strong interdisciplinary emphasis. Too often students are taught to specialize in a narrow area and are consequently unable to relate their work to an overall system objective. Teaching objectives are: 1) to stress the interdisciplinary nature of real- world systems, and 2) to introduce students to problem solving techniques for real-world signal-processing applications. In existing classes, the use of laboratories and computer experiments where students can do hands-on experimentation with concepts is emphasized. New courses at the undergraduate and graduate levels that give students more exposure to real-world experimentation in laboratories will be designed.","title":"Analog VLSI Sensory Processing","awardID":"9502307","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["492015"],"PO":["564898"]},"1163":{"abstract":"9503911 McNamara This project connects Fremont Newark Community College District to the Internet. This connection provides faculty and staff access to the resources available on the Internet (including, but not limited to e-mail and educational LISTSERV discussion groups) and provide students access to the resources available on the Internet. These connections provide operations management and information services and give the college a 56 thousand bits per second connection to the Internet. The benefits of this connection include e-mail between local and remote researchers and educators, file transfer capability and the ability to use remote computer resources. Also the college obtains the ability to investigate innovation in educational resources and incorporate them into their curricula.","title":"Connections to NSFNET","awardID":"9503911","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[2665,2666],"PO":["57343"]},"629":{"abstract":"The evolution of geometric and photometric attributes of 2D organizational structures can not only provide evidence for the underlying structure and motion but also help infer complex motions. This research will develop a computational theory to extract structural and motion information from long image sequences by exploiting perceptual organizational principles. Simple motions will be grouped to infer about complex motion. An efficient computational framework will be developed to monitor the evolution of the organizational structures. Detection of the 2-D organizations isbased on graph theory and voting methods, and a modification of Bayesian networks. These 2D organizations are then tracked through the image sequence to generate traces of their photometric and geometric properties. This research will open up possibilities for the development of new tools for motion understanding using organizational principles.","title":"CAREER: The Role of Perceptual Organization in Motion Analysis","awardID":"9501932","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["522400"],"PO":["475621"]},"1680":{"abstract":"The main objective of this research is to investigate the issures related to hardware designs and performance evaluations of a number of innovative cache design techniques. These design techniques are currently being developed for single-chip general purpose processors and multiprocessors. Specifically, the focus of the research includes: 1) minimization of area cost of on-chip caches by CAT--caching address tags: 2) maximization of cache hit ratios by evenly distributing data across cache sets with the help of a few tag bits that change frequently during program executions; 3) investigation of potential impacts of the new CAT cache designs for various cache configurations as well as multiprocessor caches; and 4) devising analytical models, and performing trace-driven simulations and execution-driven simulations for evaluating implementation costs, performances, and design trade-offs of various designs.","title":"Exploring the Design Space for High Performance and Low Cost Memory Hierarchies","awardID":"9505601","effectiveDate":"1995-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["414327"],"PO":[3904]},"4772":{"abstract":"9521458 Hotaling The Keuka College requests support from NSF for a connection to the Internet through the NYSERNET regional network. NYSERNET is the regional network located in the state of New York that will provide operations and network information services. It will provide the Keuka College with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The college needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the students, faculty and staff of the Keuka College.","title":"Connection to NYSERNET (New York State Educational Research Network)","awardID":"9521458","effectiveDate":"1995-08-15","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11649],"PO":["43608"]},"5674":{"abstract":"This award, in the Small Grants for Exploratory Research mode, will examine and test a first-principles approach for determining the relative depths of objects in images using only knowledge about the medium and the intensities acquired in a single view. Most methods for inferring depth (or range) in computer vision have depended on the use of multiple cameras and normally require the identification of corresponding points in the resulting images. Alternatively, rangefinder methods depend on sharpness-of-focus measures that require calibrated-focus lenses and an unambiguous definition of focus. The planned approach is based on the physics of light transmission and attenuation in a translucent diffuse medium. These investigators have shown, in theory and with a small set of experiments (in simulated biological tissue), that it is straightforward to infer the relative depths of structures when they are embedded in such a medium. This work is particularly exploratory because the original results arose as a byproduct of other research and so the extent of its applicability in a more general setting is not known. Two of the questions to be probed are: what are the limitations (e.g., minimum detectable depth difference) and sensitivities (to assumptions, and to changes in parameters) of the model; and what is the effect of the size and shape of the object on determination of its relative depth. The research is aimed at the development of a capability to identify unambiguously the relative depths of structures in an image, and thus to prevent confusion about which structures overlie which others. Because a single view is sufficient, it will be possible to make this identification retrospectively, as long as the properties of the medium are known. This should be useful in evaluating images arising, for example, in underwater, biological, and atmospheric applications, as well as in more-turbid environments.","title":"SGER: Depth from Physics in Computer Vision","awardID":"9526210","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["463712"],"PO":["125480"]},"5388":{"abstract":"This project automatically detects discourse structure in digitally recorded lectures and uses this structure to facilitate rapid browsing of the recording. Discourse structure is the relationship between topics, including sub-topics and embedded remarks. Boundaries of the segments representing the structure (but not content) are conveyed by pauses, pitch range variation, and cue phrases. Discourse structure is hierarchical, with multiple levels of major and minor topics. Analysis of a corpus of lectures provides quantitative correlation between acoustic features and discourse structure, and the basis of an automatic segmentation algorithm. A unified approach merges hints from these multiple acoustic cues to map hierarchical discourse structure to time offsets in the recording. Derived discourse structure is used to browse the recording, at various levels of detail and summarization. Presentation is highly interactive, allowing the user to manipulate playback via a physical interface which is the product of iterative design and evaluation. Hand gestures control the level of detail, speed, an d random access during playback. More productive access to audio recordings makes it possible to manage information from a wider variety of sources and in more situations than conventional computer graphic displays.","title":"Acoustic Cues to Discourse Structure for Interactive Speech Skimming","awardID":"9523647","effectiveDate":"1995-08-01","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[13187],"PO":["183208"]},"5399":{"abstract":"Bytes Tran The research issue is representing and reasoning about interactive discourse during a human-computer natural language interaction. During an interaction, a computational system must be able to take conversational control and release control to another participant to simulate the turn- taking that takes place in task-oriented interactions. In addition to representing and reasoning about when to take control, an artificial agent (a computational system) must know how to signal what it is doing through its choice of content and linguistic cues. The system must also be able to recognize when the human participant is taking control and reason about whether or not to allow it. Three problems will be addressed in this investigation: reasoning about control, representing discourse to accommodate conversational role change, and producing\/interpreting linguistic cues that indicate who has control. Methods that will be applied to development of a model are use of a uniform representation for domain and discourse information, and reification of conversational roles as collaborative modes. As part of the p roposed planning period, a prototype model will be developed, implemented, and evaluated using two different application domains: an interactive spreadsheet and a medical tutoring system. It is unquestioned that natural language is a useful tool for for human- computer interaction. The ability to interact in natural language provides a flexible and efficient means of communication to systems that are becoming increasingly complex to use because of their capabilities","title":"ROW: A Computational Model for Mixed Initiative InteractiveDiscourse","awardID":"9523666","effectiveDate":"1995-08-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["439630"],"PO":["183208"]},"6257":{"abstract":"9528079 Vaina This project is a Small Grant for Exploratory Research. The feasibility of new approaches to vision applied to recognition problems of use to the visually impaired is investigated. These approaches combine coarse, easily obtainable, visual data with novel adaptive learning algorithms to recognize features such as moving objects and terrain irregularities. The results of this research project will be feasibility study as to the robustness and practicality of this approach in developing a \"magic hat\" - an aid to the visually impaired consisting of a sensor and computation ring that would be worn by users as a hat and which adaptively warn the user of hazards. ***","title":"Special Project: The Magic Hat: An Adaptive Solution for Enhancing Visually Guided Mobility of the Visually Impaired","awardID":"9528079","effectiveDate":"1995-08-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["143822",15370],"PO":["564412"]},"5840":{"abstract":"IRI-9526703 Chow, Randy University of Florida $50,000 - 12 mos SGER: Inter-domain Authentication and Authorization for Large Information Systems The ultimate goal in this exploratory research is to develop models and tools to facilitate the development of a secure logical network in an untrusted physical environment. Cooperative users should have the flexibility to define their own security enforcement mechanisms and implementation, yet they must also conform to the overall security policy of the system. This research will address the fundamental issues involved in achieving this goal. This capability is needed to permit commercial and governmental users to take full advantage of the recent technological advances in high speed computers, high bandwidth communication, high capacity storage devices, and Internetwork systems such as the world-wide web. Both coordination and security across autonomous domains (independent system administrations) are required for large, distributed information systems, particularly ones implementing multimedia infoware designs, and increasingly available CSCW (Computer Supported Cooperative Work) applications.","title":"SGER: Inter-Domain Authentication and Authorization for Large Information Systems","awardID":"9526703","effectiveDate":"1995-08-15","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["530417","490245"],"PO":["503214"]},"4762":{"abstract":"In this Research Planning Grant, the PI will develop a research plan in the area of systematic fault-tolerant design. The research is based on the idea to progressively relax the system invariant assertion in the presence of processor failures. When there are no failures, a strong assertion will be established and the system will operate at peak performance. As processors fail, weaker assertions are ensured, and the system may operate at a reduced performance. During the planning period algorithms to implement the multiple invariant assertions approach to fault- tolerance in multiple server systems will be developed. A successful completion will lead to an expansion of the research to permit a wider class of failures, as well as techniques for more complex transactions supported by the multiple server systems.","title":"Systematic Integration of Fault Tolerance in High Performance Parallel Programs","awardID":"9521419","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["492042"],"PO":[11627]},"4883":{"abstract":"9521754 Stone The Woods Hole Research Center requests support from NSF for a connection to the Internet through the WHOInet network. WHOInet is the network located in the state of Massachusetts that will provide operations and network information services. It will provide the Woods Hole Research Center with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The center needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the staff of the Woods Hole Research Center.","title":"Internet Connection for the Woods Hole Research Center","awardID":"9521754","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["388764","501796"],"PO":["57343"]},"4476":{"abstract":"9520319 Wilkins This award is one made through the FY95 Computational Approaches to Real Materials competition. Funding is provided through the Divisions of Materials Research, Mathematical Sciences and Advanced Scientific Computing, as well as by the Office of Multidisciplinary Activities in the Mathematical and Physical Sciences Directorate. The research combines algorithm and code development with materials theory to address important materials problems for which computational breakthroughs can produce large payoffs. As such, the research spans the strategic initiatives in High Performance Computing and Communications and Advanced Materials and Processing. The halogen-bridged transition-metal linear-chain compounds are unique in their wide chemical tunability with respect to their ground state and their energy gap. Momentum-space computation has indicated that these materials may have technological importance. Real space computation will allow much larger systems to be studied due to transitioning from calculations scaling as the cube of the number of particles being considered to those scaling linearly with the number of particles. The larger systems will enable more accurate optical properties to be calculated and enable accurate treatment of defects, including polarons and solitons, which will allow realistic calculations of optical and magnetic properties. Computational aspects of the work include development of specialized parallel sparse matrix algorithms; use and development of load-balancing heuristics; development of parallel disk-based algorithms for fast Fourier transforms and other matrix operations; and, use of shared data-space model such as provided by High Performance Fortran. Codes will be run on a variety of platforms. %%% This award is one made through the FY95 Computational Approaches to Real Materials competition. Funding is provided through the Divisions of Materials Research, Mathematical Sciences and Advanced Scientific C omputing, as well as by the Office of Multidisciplinary Activities in the Mathematical and Physical Sciences Directorate. The research combines algorithm and code development with materials theory to address important materials problems for which computational breakthroughs can produce large payoffs. As such, the research spans the strategic initiatives in High Performance Computing and Communications and Advanced Materials and Processing. The research will focus on a class of materials called halogen-bridged compounds. These compounds can be readily modified by varying their structure and components in order to achieve desired electronic, optical and magnetic properties. Thus, they are Odesigner materials.O Present computational techniques only hint at these possibilities. The present research will develop computational techniques in order to deal with much more realistic systems of these compounds. Consequently, successful completion of this research will advance computation on state-of-the-art computers, will assist in fundamental understanding of the properties of these compounds and will enable the accurate design of a class of materials for a variety of applications. ***","title":"Real Space Method for First Principles Calculation of Electronic, Magnetic, and Spectroscopic Properties of Halogen-Bridged Transition Metal Compounds","awardID":"9520319","effectiveDate":"1995-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["532951","558685",10962],"PO":["145396"]},"4487":{"abstract":"9520371 Atlas This project is part of the Computational Approaches to Real Materials (CARM95) program. The Division of Materials Research, Division of Advanced Scientific Computing, and Division of Mathematical Sciences are all supporting this research. The investigator is collaborating with researchers at Sandia National Laboratory and Los Alamos National Laboratory, and the computing will take place on the University of New Mexico parallel supercomputer located in Kihei, Hawaii. The project focuses on the microscopic properties of copper and aluminum grain boundaries and defects, and the impact of substitutional impurities and vacancies on the chemistry of these intergranular interfaces. The work is motivated by the failure of Cu and Al interconnects used in semiconductor chips. These problems arise from a phenomenon called electromigration in which the electron wind caused by high current densities results in the formation of voids that diffuse and aggregate along grain boundaries, ultimately forming cracks in the metal and leading to catastrophic failure. These calculations represent some of the largest ab initio materials calculations ever attempted. The investigator is writing the parallel molecular dynamics code using the portable, parallel C++ class library that she has developed in collaboration with the Object-Oriented Particle Simulation Project at the Los Alamos Advanced Computing Laboratory. The defect physics is coupled across quantum and mesoscopic length scales through successive ab initio refinements of the interatomic forces used in dynamic simulations. %%% This project is part of the Computational Approaches to Real Materials (CARM95) program. The Division of Materials Research, Division of Advanced Scientific Computing, and Division of Mathematical Sciences are all supporting this research. The investigator is collaborating with researchers at Sandia National Laboratory and Los Alamos National Laboratory, and the computing wil l take place on the University of New Mexico parallel supercomputer located in Kihei, Hawaii. The project is motivated by the failure of copper and aluminum interconnects used in semiconductor chips. The project simulates defects in these materials and how they evolve in the presence of high electric currents, eventually leading to failure resulting from small cracks. These calculations represent some of the largest first- principle materials calculations ever attempted. A better understanding of the atomic-level principles that apply in the simulations will help to design interconnects that have improved properties. ***","title":"Energies and Dynamics of Defects in Copper and Aluminum ULSI Interconnects","awardID":"9520371","effectiveDate":"1995-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["462978"],"PO":["145396"]},"5015":{"abstract":"9522194 Poulson Olivet College requests support from NSF for connection of the campus networks to MichNet. MichNet is the midlevel network located in the north central United States. It will provide operations management and information services and it will give the college a 56KB connection to the Internet connection, a collection of interoperable networks that connect most research and education organizations in the United States. The College needs the Internet connection to be able to access information resources throughtout the state, the nation and the world. The connection will benefit the faculty, staff students of Olivet College.","title":"Connection of Olivet College to NSFNET","awardID":"9522194","effectiveDate":"1995-08-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["415445",12270,"483477",12272],"PO":["43608"]},"6269":{"abstract":"9528103 Binder The IETF is a part of the successful evolution of the Internet and its fundamental role in the evolving National Information Infrastructure. The IETF activities are an outgrowth of efforts started by the US Government during the late 1970s to manage the evolution of the Internet. Under a Cooperative Agreement with the National Science Foundation, the Corporation for National Research Initiatives created and provided a functioning IETF Secretariat, and has been helping to organize and support these activities which involve thousands of individual participants and contributors from the US and abroad. To ensure the continued evolution of the Internet and its contribution to the emerging NII, CNRI proposes to provide the IETF Secretariat for a period of three years. The continuation of the Secretariat with US Government funding will provide stability and continuity to the IETF during important transitions of the Internet involving significant architectural change and increased commercial activity. CNRI also proposes to create a Planning Group, inclose consultation with the Government and the IESG (IETF Steering Group), to develop a plan for generating long-term IETF Secretariat funding.","title":"Support for Research Internetting","awardID":"9528103","effectiveDate":"1995-08-01","expirationDate":"1997-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[15399],"PO":["121202"]}}