{"164385":{"abstract":"This is funding to support a doctoral research consortium (workshop) of approximately 15 promising graduate students from the United States and abroad, along with a panel of about 6 distinguished research faculty mentors. The event will take place in conjunction with the ACM 2010 Conference on Human Factors in Computing Systems (CHI 2010), which will be held April 10-15 in Atlanta, and is sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI). This is the leading international forum for the presentation and discussion of human-computer interaction (HCI) research and practice, and is attended by approximately 2,500 HCI professionals from around the world. Research reports published in the CHI Conference Proceedings and the CHI Extended Abstracts are heavily-refereed and widely cited; they are among the most scientifically respected and impactful research publications in the field of HCI. More information about the conference is available at http:\/\/www.chi2010.org. <br\/><br\/>The Doctoral Consortium is a research-focused meeting that has taken place annually at the CHI conference since 1986, and has helped to launch the careers of many outstanding HCI researchers. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their research during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on April 10-11, with follow up activities planned during the technical program of the conference. Extended abstracts of the students' work will be published in the CHI 2010 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars; many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field. In an effort to further broaden the impact of the event, the organizers have undertaken to use NSF funds to support participation by no more than one student from any one institution. They will try explicitly to identify and include the broadest possible group of highly-qualified participants, and in particular will consider gender in the participant selection process with a target of a 50\/50 split.","title":"Human-Computer Interaction Doctoral Research Consortium at ACM CHI 2010: Human Factors in Computing Systems","awardID":"0967511","effectiveDate":"2010-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["549540"],"PO":["565227"]},"159206":{"abstract":"This award supports a Doctoral Colloquium (DC) at the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW) to be held February 6-10, 2010 in Savannah, GA. The CSCW conference brings together researchers from the fields of organizational behavior, information systems, social informatics, information sciences, and human-computer interaction (HCI). As such the conference is a critical link between the research communities supported by IIS and the broader social, behavioral, and management sciences. The primary intellectual contributions of this project lies in bringing together a diverse set of advanced PhD students from across the range of research represented in CSCW. This workshop enables both close mentoring and the development of a group of future intellectual leaders within the CSCW community. Furthermore, bringing together these students in close contact with key CSCW researchers, both during the workshop itself and during conference poster presentations, will support the development of interdisciplinary dialogs, creating an environment for exchange and conversation that will further enable progress on the projects in the DC. There are short and long-term benefits from this work. In the short term, we will provide significant feedback to the specific students participating in the DC and more general feedback that can spread amongst other student attendees of the conference. In the long-term, we expect that students who have participated in the DC will then give back to the community by engaging as mentors to undergraduate students, and in the future to doctoral students. Furthermore, we expect these exceptional students to be the future leaders of the CSCW community.","title":"WORKSHOP: Computer Supported Cooperative Work Doctoral Research Colloquium 2010","awardID":"0940080","effectiveDate":"2010-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["519772"],"PO":["565342"]},"165015":{"abstract":"While the subject of numerical linear algebra dates back to before the first computations were performed by computers, it continues to be a vibrant topic of research. It is central to practical fields like optimization, data mining, signal and image processing, and control, to name a small subset. Recent advances in computer architecture, including the emergence of hardware accellerators like GPGPUs and the Cell Broadband Accellerator, have forced a fresh look at perturbation (e.g., because such processors often do not support IEEE standard arithmetic and\/or mix precisions), performance (how to unleash the promised performance), and portability (programmability) issues. This conference will bring together leading experts in the field to examine recent and possible future advances related to these issues.<br\/><br\/>A two day event will be held in the Advanced Computing Engineering and Sciences (ACES) building on the UT-Austin campus, July 19-20, 2010. The meeting will examine past and present contributions as well as future opportunities in the field of computational linear algebra, a key subject within mathematics and computer science that supports computational science. The conference includes invited talks by established authorities as well as rising stars in the field. An opportunity for more junior researchers (graduate and postdoctoral students) to showcase their research is included in form of a poster session. A panel discussion will examine the state of the field and future opportunities. The participation by individuals who do not have other federal support, and by students, postdocs, women, minorities, and persons with disabilities will be encouraged.","title":"Conference on Numerical Linear Algebra: Perturbation, Performance, and Portability","awardID":"1000622","effectiveDate":"2010-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7934","name":"PARAL\/DISTRIBUTED ALGORITHMS"}}],"PIcoPI":["556801"],"PO":["565027"]},"154026":{"abstract":"The notion of location is broad, ranging from physical coordinates (latitude\/longitude) to logical locations (like Starbucks, WalMart, museums). Logical locations are gaining importance because they express the context of the user, allowing applications to carry out context-specific interaction. For instance, a person entering Starbucks may receive an advertisement for purchasing coffee. Evidently, such applications expect to learn the existence of the user within the confines of a logical place (like Starbucks). The rich body of localization literature based on GPS\/WiFi\/GSM is dominantly physical in nature, and translating them to logical locations is error prone. This is because a dividing wall may separate two logical locations and an error margin of few meters may place the mobile device on the incorrect side of this wall. <br\/><br\/>This proposal proposes a unique system called SurroundSense that breaks away from physical localization and investigates direct methods of recognizing logical locations. The main idea in SurroundSense exploits the observation that a logical place has a distinct ambience in terms of its background sound, light, color, RF signals, and layout. The attributes of the ambience can be sensed through mobile phone sensors and suitably combined to form a fingerprint of that place. This fingerprint can then be used to identify the logical location of the phone by comparing it against an existing database of location-fingerprints. As an example, a Starbucks may include sound signatures from coffee machines and microwaves that are different from the clinking of forks and spoons in restaurants. Similarly, signature colors in the decor may vary from store to store, lighting styles and store layouts may be different, and so will the WiFi SSIDs audible at that location. The combination of all these attributes, a fingerprint, is likely to exhibit reasonable diversity for high quality, logical localization.","title":"NeTS: Small: Collaborative Research: Logical Localization for Mobile Devices through Ambience Sensing","awardID":"0916955","effectiveDate":"2010-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560207"],"PO":["557315"]},"161572":{"abstract":"Symbolic finite-state model checking is a technique for analyzing properties of computational systems. This project rethinks symbolic model checking to achieve scalable performance on multi-core and networked computers. Current attempts to parallelize model checking use standard algorithms and techniques, but this project takes a new approach in which parallel threads share Boolean clauses, which are lemmas of the final proof. It is hypothesized that such clauses represent the appropriate quantum of shared information for parallelization: neither so simple as to cause excessive communication, nor so complex as to cause threads to duplicate work. If the hypothesis is correct, implementations will achieve near-linear scaling with the number of computer cores. The work also investigates the tradeoffs between verifying correctness of properties versus checking properties for counterexamples, exploring performance implications of the tradeoffs.<br\/><br\/>Symbolic model checking has applications in a wide range of areas, from verifying sequential circuits and security protocols to analyzing biological processes. Advances in model checking allow one to analyze systems of increasingly higher complexity. The project will integrate research and education by developing curriculum that increases the workforce's proficiency in logic, as well as develop educational material on computational thinking for secondary school students.","title":"CAREER: Clause Generation: A New Perspective on Parallel Symbolic Model Checking","awardID":"0952617","effectiveDate":"2010-01-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["518588"],"PO":["564388"]},"167447":{"abstract":"This project seeks to investigate architectural design approaches to enable pervasive community-shared sensor grids composed of contributed sensor nodes from multiple sensor networks across different administrative domains and ownership. Two fundamental components of this research which allow controlled sharing of sensor nodes? hardware resources and software programmability are: (1) a low-overhead virtualization of the nodes themselves, including layer-2 bridging support and the ability to switch the mote network context among multiple application entities to form transient -underlays- that connect motes across multiple domains, and (2) a P2P overlay network of the sensonet-Internet gateways that is responsible for dealing with authentication, authorization, formation and teardown of these underlays. <br\/>The expected outcome of the research is set of network applications that will enable Internet users to contribute their sensor hardware and to carve their own sensor network from these shared resources in a GENI-style sharing. This has the potential for promoting participatory sensing among ordinary citizens, for playing a role in urban sensing and emergency response system in the future, and for influencing the development and commercialization of embedded sensing platforms. A more short-term impact during the course of the project is recruitment and retention of students by coupling class projects with experimentation on design prototypes, especially targeted towards engaging students from under-represented groups into research.","title":"NeTS: Small: Realizing an Architecture for Community Sensor Grids","awardID":"1011931","effectiveDate":"2010-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[448647,448648],"PO":["565303"]},"161551":{"abstract":"The Internet provides data communication that is essential for business, personal communication, E-Government, and entertainment. Our society's reliance on the broad availability of data communication networks makes these system a critical part of today's infrastructure. The need to support emerging technologies and networking paradigms has led to numerous ongoing efforts to develop novel network architectures that can improve and replace existing network systems. Many new network designs use a virtualized network infrastructure on which networks with different protocol stacks can be instantiated. To implement such dynamic deployment of data communication networks, programmable routers with embedded packet processing systems are used. The introduction of these new systems into the network opens the doors for new cyber attacks that use the network or target the network itself.<br\/><br\/>This work will study the security issues that arise in this new virtualized and programmable networking environment and develop techniques that can be used to identify, mitigate, and possibly avoid attacks. The researchers will study how attacks can be characterized in next-generation network and how novel anomaly detection algorithms can be developed. The algorithms will use cooperation between protocol layers and distributed detection mechanisms between nodes and autonomous systems to achieve high detection capabilities that aid in defending the network infrastructure. The ability of programmable nodes to aid in the detection process will be leveraged.<br\/><br\/>The intellectual merit of this work lies in providing insights on vulnerabilities and possible defenses in emerging network designs, which are fundamentally different from today's Internet.<br\/><br\/>The broader impact of this work aims at providing the technology necessary to protecting the next-generation Internet from cyber attacks.","title":"EAGER: Exploring Security Issues in Next-Generation Networking Infrastructure","awardID":"0952524","effectiveDate":"2010-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7937","name":"NETWORK CODING AND INFO THEORY"}}],"PIcoPI":["485542"],"PO":["564924"]},"161673":{"abstract":"In many complex problems related to discovery, detection, and diagnosis, researchers and practitioners alike are continually faced with the question ?What data should I gather next?? When the possibilities for data collection are overwhelming, and experiments or measurements are costly or time-consuming, this question becomes all the more critical.<br\/>This research investigates guided sensing algorithms, which make recommendations about the next measurements to gather, with the understanding that a domain expert makes the final decision. Motivated by applications in emergency response and high-throughput cell-based analysis, this work develops new methods for guided sensing that account for temporal and task-based constraints, missing data, and environmental noise as well as human error.<br\/><br\/>The research makes two primary technical contributions. First, it generalizes classical query-based learning algorithms to be robust to noise, with input and output designed to match users? needs. To accomplish this, greedy decision tree algorithms are designed with respect to new performance measures that reflect task-specific objectives and constraints. Second, this work develops interactive, nonparametric methods for statistical matching, a fundamental problem in data fusion. The approach is grounded in new methods for nonparametric clustering with missing data, and for unsupervised sequential experimental design.","title":"CAREER: Guided Sensing","awardID":"0953135","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["518011"],"PO":["564898"]},"163588":{"abstract":"The \"holy grail\" of artificial intelligence research for decades has been to design computers with robust, integrated, human-like intelligence. This goal has proven elusive, in spite of a massive amount of research. But another goal is just now becoming feasible, and so has been the subject of much less research: using vast computer networks to create new kinds of intelligent entities that combine the best of both human and machine intelligence. One key to designing such human-centered computing systems is better ways of measuring the collective intelligence they exhibit. That is the focus of this research, which represents a collaborative effort among researchers at MIT (lead institution), CMU and Union College. The PIs will first use analogies with what is already known about measuring individual intelligence to suggest new ways of measuring the collective intelligence of complex human-machine systems. For instance, they will determine whether the striking pattern of correlations across tasks that characterizes individual human intelligence even exists for human-machine groups. Next, a series of statistically validated tests will be developed to measure the key components of collective intelligence in human-machine groups. Then, to better understand the \"active ingredients\" of collective intelligence, the PIs will use what is already known about how groups of people interact effectively to measure micro-level behavior in human-machine groups. A key goal will be to find critical factors (such as group size, technological support, or individual capabilities) that contribute to a human-machine group's adaptability across a wide range of tasks.<br\/><br\/>Most people and computers today are parts of larger human-machine systems that must cope with a wide range of problems. This research will provide powerful new tools for managing and designing such systems. Imagine, for instance, that one could give a short \"collective intelligence test\" to a top-management team, a product development team, or a collection of Wikipedia contributors. Imagine that this test could predict the team's future performance on a wide range of important tasks. And imagine that the test could also help suggest changes to the team that would improve its flexibility. Or imagine that designers of new collaboration software tools could use a single test to predict how well their tools would improve a group's effectiveness on many different tasks. From the smallest business work groups to our largest societal challenges, there are now many new opportunities for people and computers to solve problems together, not just more efficiently, but also more intelligently. This work will help build a firmer scientific foundation for doing this.<br\/><br\/>Broader Impacts: With individual humans, it is relatively easy to measure intelligence, but it is difficult to increase that intelligence or to observe the detailed events inside the brain that give rise to it. With human-computer groups it is much easier to observe and change factors (such as group size, composition, and technological support) that are likely to determine the group's collective intelligence. Thus, there is a profound intellectual opportunity, not just to learn more about how to design intelligent human-computer systems but also to gain new insights into the very nature of intelligence in complex systems. The results of this research, therefore, will be of interest not only to researchers in computer-supported cooperative work, human-computer interaction, and artificial intelligence, but also more broadly to fields such as cognitive science, social psychology, and organization theory.","title":"Collaborative Research: Measuring Collective Intelligence","awardID":"0963285","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551789"],"PO":["565227"]},"162499":{"abstract":"Recent studies have demonstrated the powerful abilities of deep architectures for statistical pattern recognition. Deep architectures transform their inputs through multiple layers of nonlinear processing. Inspired by the connectivity of biological neural networks, the hidden layers of deep architectures encode hierarchical, distributed representations of complex sensory input. Theoretical results suggest that such representations are needed to solve the most difficult problems of artificial intelligence. <br\/><br\/>Previous applications of deep architectures include visual object recognition, statistical language modeling, and nonlinear dimensionality reduction. Building on these successes, this project develops new applications of deep architectures for problems in speech and audio processing. Current front ends for these problems are dominated by traditional methods in statistical modeling and signal processing. Deep architectures have the potential to <br\/>overcome many limitations of current approaches. <br\/><br\/>This project has two research components with interrelated and overlapping goals. The project's first component explores unsupervised learning in convolutional neural networks. The goal of learning in these networks is to discover new features for audio event detection and automatic speech <br\/>recognition. The project's second component investigates the possibility of deep learning in kernel machines. This possibility is suggested by a recently discovered family of kernel functions that mimic the computation in large, <br\/>multilayer networks. <br\/><br\/>The project's research components are tightly integrated with its educational activities. The project supports two graduate students, including one female student. An important goal is to develop publicly available software for use by other researchers.","title":"Collaborative Research:EAGER:Deep Architectures for Speech and Audio Processing","awardID":"0957560","effectiveDate":"2010-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["525662"],"PO":["491702"]},"162532":{"abstract":"Recent studies have demonstrated the powerful abilities of deep <br\/>architectures for statistical pattern recognition. Deep <br\/>architectures transform their inputs through multiple layers of <br\/>nonlinear processing. Inspired by the connectivity of biological <br\/>neural networks, the hidden layers of deep architectures encode <br\/>hierarchical, distributed representations of complex sensory input. <br\/>Theoretical results suggest that such representations are needed to <br\/>solve the most difficult problems of artificial intelligence.<br\/><br\/>Previous applications of deep architectures include visual object <br\/>recognition, statistical language modeling, and nonlinear <br\/>dimensionality reduction. Building on these successes, this project <br\/>develops new applications of deep architectures for problems in <br\/>speech and audio processing. Current front ends for these problems <br\/>are dominated by traditional methods in statistical modeling and <br\/>signal processing. Deep architectures have the potential to <br\/>overcome many limitations of current approaches.<br\/><br\/>This project has two research components with interrelated and <br\/>overlapping goals. The project's first component explores <br\/>unsupervised learning in convolutional neural networks. <br\/>The goal of learning in these networks is to discover new <br\/>features for audio event detection and automatic speech <br\/>recognition. The project's second component investigates <br\/>the possibility of deep learning in kernel machines. <br\/>This possibility is suggested by a recently discovered family <br\/>of kernel functions that mimic the computation in large, <br\/>multilayer networks.<br\/><br\/>The project's research components are tightly integrated with <br\/>its educational activities. The project supports two graduate <br\/>students, including one female student. An important goal <br\/>is to develop publicly available software for use by other <br\/>researchers.","title":"Collaborative Research:EAGER:Deep Architectures for Speech and Audio Processing","awardID":"0957742","effectiveDate":"2010-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["497149"],"PO":["491702"]},"163632":{"abstract":"The \"holy grail\" of artificial intelligence research for decades has been to design computers with robust, integrated, human-like intelligence. This goal has proven elusive, in spite of a massive amount of research. But another goal is just now becoming feasible, and so has been the subject of much less research: using vast computer networks to create new kinds of intelligent entities that combine the best of both human and machine intelligence. One key to designing such human-centered computing systems is better ways of measuring the collective intelligence they exhibit. That is the focus of this research, which represents a collaborative effort among researchers at MIT (lead institution), CMU and Union College. The PIs will first use analogies with what is already known about measuring individual intelligence to suggest new ways of measuring the collective intelligence of complex human-machine systems. For instance, they will determine whether the striking pattern of correlations across tasks that characterizes individual human intelligence even exists for human-machine groups. Next, a series of statistically validated tests will be developed to measure the key components of collective intelligence in human-machine groups. Then, to better understand the \"active ingredients\" of collective intelligence, the PIs will use what is already known about how groups of people interact effectively to measure micro-level behavior in human-machine groups. A key goal will be to find critical factors (such as group size, technological support, or individual capabilities) that contribute to a human-machine group's adaptability across a wide range of tasks.<br\/><br\/>Most people and computers today are parts of larger human-machine systems that must cope with a wide range of problems. This research will provide powerful new tools for managing and designing such systems. Imagine, for instance, that one could give a short \"collective intelligence test\" to a top-management team, a product development team, or a collection of Wikipedia contributors. Imagine that this test could predict the team's future performance on a wide range of important tasks. And imagine that the test could also help suggest changes to the team that would improve its flexibility. Or imagine that designers of new collaboration software tools could use a single test to predict how well their tools would improve a group's effectiveness on many different tasks. From the smallest business work groups to our largest societal challenges, there are now many new opportunities for people and computers to solve problems together, not just more efficiently, but also more intelligently. This work will help build a firmer scientific foundation for doing this.<br\/><br\/>Broader Impacts: With individual humans, it is relatively easy to measure intelligence, but it is difficult to increase that intelligence or to observe the detailed events inside the brain that give rise to it. With human-computer groups it is much easier to observe and change factors (such as group size, composition, and technological support) that are likely to determine the group's collective intelligence. Thus, there is a profound intellectual opportunity, not just to learn more about how to design intelligent human-computer systems but also to gain new insights into the very nature of intelligence in complex systems. The results of this research, therefore, will be of interest not only to researchers in computer-supported cooperative work, human-computer interaction, and artificial intelligence, but also more broadly to fields such as cognitive science, social psychology, and organization theory.","title":"Collaborative Research: Measuring Collective Intelligence","awardID":"0963451","effectiveDate":"2010-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551787"],"PO":["565227"]},"153535":{"abstract":"Utilizing real-time networking techniques to optimize urban traffic signals can significantly improve the transportation system performance. The objective of this project is to apply communications technologies and communications networking techniques to control both traffic signals and vehicles. This is an interdisciplinary proposal that will combine the optimization techniques based on uncertainties in the measured data that are used in traffic engineering, with distributed control strategies, based on real-time measurement and data dissemination that are used in communication networks. The research effort is organized into an orderly progression that uses increasing amounts of information and processing complexity to determine the incremental value of the procedures. We will start by optimizing the flows at isolated traffic signals, then progress to flows on arterials, and finally to flows in the entire traffic network. Initially we will control the traffic signals based on real-time flow information, then progress to using the signals to control the paths of vehicles, using deflection routing techniques, and finally perform route planning for individual vehicles. We will use clustering techniques and information reduction techniques, such as fish-eye routing, that are being developed in ad hoc networks, to scale techniques that are applicable to small networks to the traffic networks in large urban areas. The challenges of understanding and influencing traffic control open up new research issues in network flows, communication, optimization, and statistical modeling. All of the procedures will be tested using real data from a selected area of Manhattan.<br\/><br\/>The broader impacts of this project includes: (1) It will reduce fuel consumption and commute time by reducing the time spent at traffic signals; (2) It will establish collaboration between two complementary areas with the similar goals of increasing throughput and optimizing flows in networks; (3) It will actively engage graduate and undergraduate students by developing learning modules and encouraging minority students to be involved in this interdisciplinary effort. The work will be widely disseminated to the transportation and networking communities.","title":"NetSE: Small: Collaborative Research: Integrating Real Time Traffic Signal Control with Networking Control Strategies to Optimize Urban Traffic Networks","awardID":"0915026","effectiveDate":"2010-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["553512"],"PO":["565090"]},"164568":{"abstract":"The USENIX Association is one of the premier groups addressing research issues in information technology and systems (e.g., the LISA conference, OSDI, FAST, NSDI, and more). USENIX recently created the Workshop on Sustainable Information Technology (SustainIT 2010). This proposal requests funding to assist approximately 15 U.S.-based graduate students to attend this first workshop. This workshop brings together researchers and industry practitioners in a forum which presents the latest research and practices. The workshop will discuss energy-related issues and their tradeoffs (e.g., security, performance, reliability, etc.--all vs. energy). The workshop especially encourages papers which discuss not just energy issues alone, but how they interact with other dimensions, and look at the overall long-term sustainability of computing. The scope of this workshop is broad, covering research, theory, hardware, software, applications, techniques, etc.--all related to making computing systems greener, from construction to use to disposal. Participation in SustainIT and similar conferences is a valuable and vital part of the graduate school experience. It provides students with the opportunity to interact with more senior researchers in the field, and exposes students to leading edge work in the field. Such a workshop can steer students to a life-long involvement with sustainability topics, and create a new workforce for decades to come. This is all the more urgent given the importance of sustainability for humanity as a whole.","title":"Student Travel Support for the First USENIX Workshop on Sustainable Information Technology (SustainIT 2010)","awardID":"0968748","effectiveDate":"2010-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["543574"],"PO":["535244"]},"161741":{"abstract":"Multi-hop wireless networks that are envisioned to form the backbone of many future communication systems are: typically subject to restrictive and unpredictably changing resource constraints; required to operate using low complexity and scalable operations; envisioned to serve essential applications with a range of long-term (e.g. throughput-greedy, long-duration applications) to short-term (e.g. delay-sensitive, short-duration applications) requirements. Yet, there is a huge gap in our understanding of how to design wireless network controllers operating under such harsh conditions that can efficiently serve diverse applications, especially those that have various degrees of delay sensitivities.<br\/>This research fills this gap by developing a rigorous theoretical foundation for the methodical design of communication strategies for effectively supporting diverse applications in general multi-hop wireless networks. To that end, it first reveals the significant impact of several unexplored design choices, including the service discipline, traffic shaping strategy, and delay-aware decision making, on the achieved application performances. Then, it systematically exploits these new design dimensions for optimally serving both delay-related short-term and throughput-related long-term application requirements by developing new approaches and mathematical tools within non-convex optimization, stochastic network control, and randomized\/approximate algorithms. <br\/>The insights and mathematical tools developed within this project are expected to play an instrumental role in the design of efficient communication protocols for tomorrow's networks serving vital services with a range of delay sensitivities and throughput requirements (in health-care, rescue operations, security, automated control, etc.). The society will also benefit from the educational aspects of the project in the training of future engineers and researchers.","title":"CAREER: Theoretical Foundations for Wireless Network Algorithm Design: Satisfying Short-Term and Long-Term Application Requirements","awardID":"0953515","effectiveDate":"2010-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[432497],"PO":["557315"]},"161763":{"abstract":"The cognitive radio technology is a promising technology to overcome the imbalance between the increase in the spectrum access demand and the inefficiency in the spectrum usage by allowing dynamic spectrum access. Seamless mobility is considered as a critical component to ensure the success of cognitive radio network (CRN) deployment, but unfortunately, is under-explored in the literature. <br\/><br\/>The research objective of this project is to develop new policies and algorithms for providing seamless mobility support in cognitive radio wireless networks (CRNs). The approach involves identifying the new issues in the mobility support caused by the changing spectrum environment in CRNs, exploiting the varying spectrum opportunities in time and space domains, proactively utilizing the spectrum opportunities for mobility preparations, and optimizing the performance via spectrum-adaptive mobility management schemes.<br\/><br\/>This project will provide innovative mobility support techniques to numerous applications of the CRN technology. It will also have significant impacts on research in emerging technologies with high mobility scenarios, such as vehicular networks, and opportunistic interconnections of heterogeneous wireless networks. This project provides an excellent opportunity for graduate and undergraduate research students to gain valuable educational training and research experiences. The research results will be presented at IEEE journals and international conferences. In addition, the PI plans to organize a workshop and a journal special issue to enhance the understanding and promote research discussions on seamless mobility in wireless networks.","title":"CAREER: Towards Seamless Mobility in Cognitive Radio Wireless Networks","awardID":"0953644","effectiveDate":"2010-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560198"],"PO":["565303"]},"161698":{"abstract":"This research studies how people use social media tools (e.g. blogs, wikis, electronic social networks) to work together more effectively to advance individual, group, organization, and community objectives. Despite high-profile success stories, we actually know very little about how best to use social media to enable effective collaboration among individuals or within organizations. The mere adoption of these tools by individuals or organizations is unlikely to have the desired effect unless people know how to use these tools to enable more effective collaborative processes. This research will employ qualitative content analysis to provide a rich picture of social media collaboration, conduct quantitative analysis on large-scale datasets to identify macro-level trends, and develop computer simulations to predict how social media might affect organizations in ways not yet observed. The educational activities of this proposal will focus on how to employ social media in the classroom to improve educational processes. I plan to introduce five different social media enabled innovations -crowdsourcing exams, wiki-based peer review, in-class blogosphere, video podcasting lectures, and in-class electronic social networks - and empirically test the effects of these innovations on classroom outcomes.<br\/><br\/>The broader impact of this research is to better understand how social media tools can be used to improve processes in a wide range of organizations and settings. These tools have been shown to have important economic, political, societal, and educational impacts. Regardless of whether particular social media tools endure in coming years, the technological features and collaborative capabilities they represent will continue to persist and evolve.","title":"CAREER: Using Social Media to Manage Knowledge","awardID":"0953285","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[432407],"PO":["564456"]},"161017":{"abstract":"This proposal seeks NSF support for a Indo-U.S. Workshop on Parallelism and the<br\/>Future of High-Performance Computing that will take place on January 7 and 8, 2010, just before the PPoPP and HPCA Symposia, in Bangalore. Funds are requested to partially cover travel expenses for up to 20 senior US-based researchers and 20 students. In addition to the proposed US participants the workshop attendees will include prominent Indian researchers listed in the proposal. Most of the U.S. workshop team members will be invited speakers and panelists.<br\/><br\/>The objective of this workshop is to initiate interactions between Indian students, senior researchers, and developers and their US counterparts in the area of parallel programming and computing in order to improve mutual understanding and create opportunities for collaborations. The proposed workshop is expected to result in innovative research directions, due to the participation of the experts in the field. Research ideas resulting from the discussions can have far reaching impact in the way HPC systems are used worldwide. In the future, international collaborations might produce joint research proposal(s) to funding agencies in India and\/or the U.S.","title":"Indo-US Workshop on Parallelism and the Future of High-Performance Computing","awardID":"0949178","effectiveDate":"2010-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["533380"],"PO":["565272"]},"168937":{"abstract":"Traffic access control polices play a critical role in the security and performance of computer networks. This proposal presents a theoretical foundation and practical techniques to study of the impact of policies on network security and performance. This project proposes to develop a framework to validate end-to-end security properties across different security devices. Ideally, such a framework would enable the discovery of policy inconsistencies and of security violations, and assist to correct the problems. The second part of this proposal presents novel traffic-driven statistical policy optimization techniques that adapt the policy structure dynamically to minimize packet matching overhead and distribute the filtering load. Special effort has been taken to show that these techniques are efficient, robust, and practically deployable.<br\/><br\/>We expect the results of this research to lay foundations for new research directions in the area of policy verification, and optimization. Moreover, the results of this research can benefit other areas such as security testing and evaluation, anomaly detection, and network defense. Thus, in general, we expect this project to significantly improve both the enforcement and performance of network security.","title":"Global Verification and Dynamic Optimization of Network Security Polices","awardID":"1019222","effectiveDate":"2010-01-01","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["563217"],"PO":["497499"]},"158905":{"abstract":"Current high-end computing (HEC) applications explicitly manage persistent data, including both application state and application output. This practice not only increases development time and cost, but also requires an application developer to be intimately aware of the underlying platform-dependent storage mechanisms to achieve good application I\/O performance. Such vertical development also makes the application software less portable.<br\/><br\/>The Software Persistent Memory (SoftPM) project builds a lightweight infrastructure for streamlining data management in next generation HEC applications. SoftPM eliminates the duality of data management in HEC applications by allowing applications to allocate persistent memory in much the same way volatile memory is allocated and easily restore, browse, and interact with past versions of persistent memory state. This simplifies the implementation of three broad capabilities required in HEC applications -- recoverability (e.g., checkpoint-restart), record-replay (e.g., data-visualization), and execution branching (e.g., simulation model-space exploration).<br\/><br\/>The SoftPM project is organized in three modules. The first module builds an evolvable SoftPM API and addresses memory management issues. The second module addresses high-performance I\/O and the atomicity of persistence points for local storage and parallel file systems. The final module builds several HEC application case-studies to illustrate the different capabilities supported by SoftPM in HEC environments.","title":"Streamlining High-End Computing with Software Persistent Memory","awardID":"0937964","effectiveDate":"2010-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7952","name":"HECURA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}}],"PIcoPI":["550842",424669,"534488"],"PO":["565272"]},"161831":{"abstract":"A backscatter communication enables development and implementation of battery-less sensors, miniaturized (MEMS) robots, or even nano devices. However, the current stat-of-the-art technology limits communication scenario to a direct transmission between active and passive devices, for example in radio frequency identification (RFID) system between a reader and a passive tag. In contrast, the goal of this project is to develop a novel multi-hop network that utilizes backscatter signal as communication for passive, battery-less devices. The objectives of this work include mathematical representation of such passive multi-hop networks and development of novel cross-layer communication protocols and control schemes with learning methodology for beam-forming. The expected contributions include an improved theoretical understanding of the multi-hop network of battery-less devices and a novel cross-layer optimization framework of network protocols that are feasible and practically viable. The end result of this effort would lead into a truly pervasive, backscatter-based networking paradigm.<br\/>The proposal?s outcomes include extending the range and improved capabilities of RFID systems to support larger and more complex sensing applications while lowering cost and minimizing environmental impacts (batteries-less operation). Moreover, a set of outreach activities include engagement of women and students from under-represented minorities through Missouri S&T Student Diversity Programs' office and Project Lead the Way (K-12 outreach). In long term, the outcomes will support various applications of MEMS and nano devices through facilitating a communication and control of such devices, with a potential to transform the healthcare, manufacturing into something that now is considered a science fiction.","title":"CAREER: Backscatter Propagation-based Multi-hop Networks for Battery-less Devices","awardID":"0954031","effectiveDate":"2010-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["546041"],"PO":["565303"]},"168938":{"abstract":"ConfVeal: Automated Testing of Security Conguration Enforcement in Access Control Devices As network security devices constantly updated in their implementation to accommodate new features, or new hardware optimization, the enforcement of the security conguration becomes questionable. In this project, we propose a fully automated pseudo-live testing system (called ConVeal) of security conguration enforcement of access control devices. Our system, ConfVeal, has two novel components: (1) Segmentation-based Test Trac Generator: it uses a novel technique that translates policy congurations into coarse and ne-grain segments in trac space and then generates packets intelligently according to the segment criticality in order to achieve high test space coverage, and (2) Comprehensive Policy Generator: it generates comprehensive policy proles considering various policy structures, eld values, rule complexity and interactions based on customized proles or learned features of existing policy conguration. This research will investigate fundamental issues related to security devices quality assurance. This is important for vendors, government and general consumers. We believe that our proposed research agenda will promote deployment new ecient techniques for access control conguration testing by vendors. New concepts and tools for testing security systems which will stimulate modeling and theorizing pseudo-live conguration testing in research and education. The project will integrate research and education through a close interaction between faculty and both graduate students.","title":"CSR-DMSS, SM: ConfVeal: Automated Testing of Security Configuration Enforcement in Distributed Networks","awardID":"1019223","effectiveDate":"2010-01-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563217"],"PO":["565255"]},"161678":{"abstract":"There is currently a surge of interest in service robotics, a desire to have robots leave the labs and factory floors to help solve issues facing society. But if robots are to play a useful role in domains ranging from eldercare to education, they will need the ability to interact with ordinary people and to acquire new relevant skills after they are deployed; we cannot pre-program these robots with every skill they might conceivably need. The PI's approach to solving this critical issue is Socially Guided Machine Learning (SG-ML). In this project she will explore ways in which machine learning agents can exploit principles of human social learning. An important question for SG-ML is \"What is the right level of human involvement?\" Previous efforts in machine learning systems that use human input have tended to hold this level constant (e.g., guidance oriented approaches that are completely dependent on human instruction in order to learn, and exploration oriented approaches with limited input from a human partner). The PI, taking her inspiration from human learning and from her prior work in robot learning, posits that a robot should be able to explore and learn on its own, while also taking full advantage of a human partner's guidance when available. The PI's goal in this work is to successfully incorporate self and social learning within a single SG-ML framework, enabling a robot learner to dynamically adjust to varying levels of human involvement in the learning process. To this end, the PI will seek to make progress toward four main objectives:<br\/><br\/>1) Motivations for learning: Typically machines learn because they are programmed to do so, unlike children and animals who learn because they are motivated to master their environment. A key component of this work is computational motivations that drive a robot to good learning opportunities.<br\/><br\/>2) Multiple learning strategies: As mentioned above, an SG-ML framework should have a repertoire of self and social learning mechanisms working together. A central issue of this research is how the robot should best arbitrate and manage the use of multiple strategies.<br\/><br\/>3) Transparency devices: Learning is a collaborative activity. The learner's behavior has to be understandable, and has to express a certain level of internal state to help the teacher guide the learning process. Transparency is a fundamental issue of this work, developing robot behaviors that successfully communicate the progress of the learning process.<br\/><br\/>4) Engagement mechanisms: In human social learning, teaching is a rewarding process for both the learner and the teacher. This is a positive feedback loop from which a machine learner could benefit. A primary component of this work is to develop mechanisms that make the teaching process rewarding.<br\/><br\/>Broader Impacts: The long-term promise of this research is robots in society able to adapt and learn from everyday people. The core principles developed in this work will one day enable robots to adapt and learn about the changing needs of people in their homes, or staff in a hospital. The lessons learned about social learning with robots will be relevant both to computational devices and to human-computer interaction in general. The PI will exploit the fact that social robot projects like this one generate particular interest in the community to conduct outreach programs in local area high schools, to raise awareness about the work of women in science, and to stimulate the American public's interest in science.","title":"CAREER: Socially Guided Machine Learning","awardID":"0953181","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550868"],"PO":["565227"]},"161800":{"abstract":"This project is a three-pronged program of research and education focused on information in networks - its distribution, diffusion, value, and consequences for social and economic outcomes. First, this project will map the flow of information in real organizations over time and will combine economic theories of production with social network theory to estimate the effects of information diffusion on the productivity of individuals and teams. This work will advance economic theory concerning information worker production and productivity; sociological theory concerning the movement of information in social networks; technical methods for analyzing information content in digital networks while preserving privacy; and statistical methods to identify causal relationships between network structure and productivity. Second, the research will utilize data on online social networks to identify estimates of peer influence in product adoption and demand, and it will develop and apply new statistical techniques to separate influence from selection, homophily and confounding factors to optimize targeted peer-to-peer information diffusion. Third, the research will develop a general class of network-based models of the diffusion of behavior change in social networks, and parameterize and validate these models using empirical data on social relationships and health related behaviors from five massive networked datasets.<br\/><br\/>The central goals of the project are: 1) to estimate and enhance the productivity of information workers, 2) to model, measure and improve peer-to-peer viral marketing and demand estimation, and 3) to improve health-related prevention and intervention strategies. The proposed activities are designed to have broader impact for science, education and society. Our understanding of information worker productivity is a cornerstone of our future economic growth and thus our prosperity and welfare. The project also aims to improve intervention and prevention strategies for behaviors and outcomes such as disease prevention, obesity, and drug use. Developing reliable, scalable statistical methods for establishing causality in the diffusion of disease, obesity, smoking and delinquency can change social policy to ensure health interventions are appropriately targeted. Development of technical infrastructures to deal with large dynamic networked datasets, privacy preserving text analysis, and statistical methods for estimating the impacts of information diffusion in networks have implications for telecommunications, epidemiology, medicine, social policy and any industry or social sphere characterized by network externalities and local network effects. Educationally, the project will utilize the research program in classes to highlight the importance of networks and information for business strategy, society and health. Workshops will develop a new collaborative research community across academia and industry around topics related to information diffusion in networks.","title":"CAREER: Social and Economic Consequences of Information Diffusion in Networks","awardID":"0953832","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[432619],"PO":["565342"]},"175825":{"abstract":"The Internet has the potential to transform our democracy.a potential that has begun to receive substantial <br\/>scholarly attention. This attention has focused on the potential transformational effects of the technology on civil society, and, in the political realm, how the Internet might transform political discourse. Researchers have devoted little attention, however, to how the Internet might transform existing institutions for connecting citizens to elected officials. This relationship is the fundamental building block of a epresentative <br\/>democracy, and it has come under increasing strain as our country has grown since the time of the founders, as the number of matters the state is involved in has multiplied; and as policy problems have grown more complex. The Internet offers a set of tools that might help to arrest this trend, and to fundamentally alter the level of participation of citizens in the consultative process with their representatives. Strikingly, this potential for change has largely been unrealized and unstudied. While there has been a considerable amount of scholarship on the impact of the Internet on government, governance, and society, there has been little systematic research on how Members of Congress use or should use the Internet to provide information to and interact with their constituents. <br\/><br\/>This research has both a qualitative and a quantitative component, where each of these components complement and inform the other. In the statistical component, longitudinal data to will be collected to explain the diffusion patterns of web-based technologies among the congressional offices. All congressional websites will be assessed along such dimensions as their informational value, accessibility, usability, and interactivity. Data will be collected on factors that might plausibly affect adoption ecisions.e.g., regarding the characteristics of districts, Members, the mechanisms for information spread in Congress, and so on. <br\/><br\/>The qualitative component will entail fieldwork in approximately 12 offices, stratified by the degree of web <br\/>technology adoption, as well as by political party and tenure. This in-depth field will allow study of the dynamic micro-processes that underlie and ultimately explain the aggregate patterns of technology diffusion, and will allow exploration of the internal practices and the relative efficiency of how congressional offices manage digitally-mediated information and feedback from constituents. <br\/><br\/>An important partner in the work will be the Congressional Management Foundation, which will provide unique access to data and individuals.<br\/><br\/>The intellectual merit of the project has several dimensions. The research combines rigorous quantitative and qualitative research to address novel questions regarding the practice of digital government in legislative settings. The research will contribute directly to the political science research on congressional behavior and institutions, and in particular to an emerging literature on entrepreneurial behavior among legislators in the U.S. House of Representatives. The research also will contribute to political scientists' and sociologists' research on the processes for the diffusion of innovations, and would be the first study of the role social networks play within the U.S. Congress in the timing of adoption of new forms of governance and new institutions for legislative representation. <br\/><br\/> The research team includes political science and information technology research faculty at four major research universities, who are linked through the National Center for Digital Governance (NCDG) <br\/>at Harvard University. The research will produce a series of conference papers, academic journal articles, <br\/>and an academic press book on democracy in the digital age. In addition, the Congressional Management Foundation and the U.S. Congress itself will help to ensure that the knowledge that emerges through this research will help to transform the adoption and use of digital technology in Congress through a series of best practice reports, debriefing sessions, and annual conferences.","title":"Collaborative Research: Connecting to Congress: The Adoption and Use of Web Technologies Among Congressional Offices","awardID":"1057868","effectiveDate":"2010-01-31","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["529970"],"PO":["543481"]},"161856":{"abstract":"This project aims at transformational approaches for the design and analysis of efficient and reliable network coding schemes for wireless networks. The network coding technique has a significant potential for improving the throughput, reliability, and security of wireless networks by taking advantage of the broadcast nature of wireless medium. The research focuses on a broad range of network coding problems that arise in the context of single and multi- hop wireless networks and develops a new integrative methodology for analyzing fundamental performance characteristics of wireless network coding schemes. The goals of this research include design and analysis of efficient algorithms as well as development of novel routing and scheduling protocols and physical-layer network coding schemes.<br\/><br\/>The project includes two major thrusts. The first thrust focuses on single-hop connections and considers a broad range of scenarios in which a several wireless nodes are collaborating to exchange information and perform a joint computational task. The second thrust focuses on multi-hop wireless networks and provides methodology for increasing the number of coding opportunities through efficient routing, scheduling, and congestion-control protocols. <br\/><br\/>This project will significantly advance the state of the art by developing analytical tools, algorithms, and design methodology for wireless network coding systems. The methodology developed for this project will lead to improved performance of wireless systems and contribute to their overall maturity. The research outcomes of this project will be broadly disseminated to academic and industrial communities.","title":"CAREER: Wireless Network Coding: Analysis, Complexity, and Algorithms","awardID":"0954153","effectiveDate":"2010-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[432736],"PO":["557315"]},"165904":{"abstract":"Utilizing real-time networking techniques to optimize urban traffic signals can significantly improve the transportation system performance. The objective of this project is to apply communications technologies and communications networking techniques to control both traffic signals and vehicles. This is an interdisciplinary proposal that will combine the optimization techniques based on uncertainties in the measured data that are used in traffic engineering, with distributed control strategies, based on real-time measurement and data dissemination that are used in communication networks. The research effort is organized into an orderly progression that uses increasing amounts of information and processing complexity to determine the incremental value of the procedures. We will start by optimizing the flows at isolated traffic signals, then progress to flows on arterials, and finally to flows in the entire traffic network. Initially we will control the traffic signals based on real-time flow information, then progress to using the signals to control the paths of vehicles, using deflection routing techniques, and finally perform route planning for individual vehicles. We will use clustering techniques and information reduction techniques, such as fish-eye routing, that are being developed in ad hoc networks, to scale techniques that are applicable to small networks to the traffic networks in large urban areas. The challenges of understanding and influencing traffic control open up new research issues in network flows, communication, optimization, and statistical modeling. All of the procedures will be tested using real data from a selected area of Manhattan. <br\/><br\/>The broader impacts of this project includes: (1) It will reduce fuel consumption and commute time by reducing the time spent at traffic signals; (2) It will establish collaboration between two complementary areas with the similar goals of increasing throughput and optimizing flows in networks; (3) It will actively engage graduate and undergraduate students by developing learning modules and encouraging minority students to be involved in this interdisciplinary effort. The work will be widely disseminated to the transportation and networking communities.","title":"NetSE: Small: Collaborative Research: Integrating Real Time Traffic Signal Control with Networking Control Strategies to Optimize Urban Traffic Networks","awardID":"1004528","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["493567"],"PO":["565090"]},"164938":{"abstract":"Applied Computer Security Associates, Inc. (ACSA), the sponsor of the Annual Computer Security Applications Conference (ACSAC) requested funding to support undergraduate and graduate students attendance at the 25th ACSAC, to be held December 7-11 2009.<br\/><br\/>The ACSAC conference, currently celebrating its 25th anniversary, is a top-tier academic security conference which averages about 200 highly skilled security professional attendees per year. <br\/><br\/>ACSAC regularly brings together the foremost minds in academic, governmental and commercial computer security to both address the most pressing problems in applied computer security, as well discuss seminal works in Computer Security. Besides our keynotes (the \"Invited Essayist\" and \"Distinguished Practitioner\"), in 2000, ACSAC introduced the \"Classic Papers\" series, in which two or three authors of seminal papers in computer security are invited to update those papers and present lessons learned. These papers, available free on the ACSAC web site, familiarize a new generation of students with key security research developments of the past, and provide a valuable resource for undergraduate and graduate instruction.<br\/><br\/>NSF funding will provide worthy students with an opportunity to meet and interact with notable figures at the conference, whose past attendees have included luminaries such as Whitfield Diffie (Sun), Stephanie Forrest (U of New Mexico), Brian Snow (NSA), Steve Lipner (Microsoft), Gene Spafford (Purdue), Peter Neumann (SRI), and Steve Bellovin (Columbia). There have been many examples where speakers at ACSAC have been seen \"holding class\" with attendees after the formal session has ended.","title":"CNF: TC: ACSAC 2009 Conference Support","awardID":"0970183","effectiveDate":"2010-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["565327"],"PO":["497499"]},"150936":{"abstract":"A recent trend in the commercial, high-technology sector has been to make large-scale, proprietary computing and storage infrastructure available to the public. Companies such as Amazon, Google, and many others, enable access to these vast resource collections via the Internet, and provide a wide range of services for accessing them (tools, APIs, resource scheduling and accounting, etc.). Users are encouraged to think of the infrastructure as a an opaque computing ``cloud'' that delivers compute and storage capabilities in the same way that the network ``cloud'' delivers network connectivity: through a client-provider relationship governed by well-defined interfaces.<br\/>Unfortunately, at present, cloud computing technologies provide support for only a limited set of applications from the web service domain. As a result, remotely managed web hosting is, by far, the most prevalent usage model for cloud systems.<br\/><br\/>With this research, the PIs propose to design, implement, and evaluate the extensions to the services offered by the two most prevalent cloud purveyors (Amazon.com and Google) to facilitate usage by a more broad developer base (e.g., scientists and students) who require support for general compute-intensive applications. The basis of this work will be two novel research projects that are able to implement commercial cloud computing functionality in academic settings: AppScale and Eucalyptus.<br\/>The PIs will employ these infrastructures to investigate and contribute the three fundamental technologies that are missing from extant cloud technologies but that are necessary to enable support of high-performance, compute intensive applications within cloud-based<br\/>clusters: efficient support of shared-memory inter-process communication, high-performance file system support, and system-wide, adaptive performance monitoring and analysis.","title":"CSR:Medium: Systems and Software Research for Compute-Intensive Cloud Computing","awardID":"0905237","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["561463",402357],"PO":["565255"]},"161705":{"abstract":"CAREER: Symbolic-Numeric Constraint-Based Solutions for Real-World Scientific Problems PI:Martine Ceberio, University of Texas at El Paso ABSTRACT Numerical constraint solving (NCS) techniques have proven to be efficient to solve real problems ranging from electronic circuit to aircraft design. Yet they are under-utilized. The lack of user support of the solvers can partly explain this, but most importantly NCS techniques have isolated themselves into a jargon (constraints) and a schema (propagation\/reduction) that disconnect them, respectively, from real problems and real needs (e.g., scalability, flexibility, and distributivity). The goal of this career plan is to make NCS better adapted to real-world needs while making it more accessible. In order to achieve the goal, this project will concentrate on theory and algorithms at the crux of the efficiency, reliability, and distributivity aspects of problemsolving techniques. In particular, the following research objectives will be pursued: RO1 To open NCS to novel techniques, improving scalability and reliability. The research will be oriented towards designing new algorithms that lie between local consistency techniques and global constraints: symbolic-numeric approaches will be studied from the theoretical point of view, and algorithms will be developed and embedded in a new solving toolbox; RO2 To assist users facing over-constrained problems. New methods based on the topology of the search space, in terms of satisfaction of the constraints, will be designed to provide users with alternative solutions; and RO3 To extend the distributed use of NCS to reflect the emerging networked social structure. The structures of social groups and their potential to support distributed systems will be studied, resulting in new and more complete algorithms for distributing constraints. The results of the research objectives will feed into the work carried out to pursue our education objectives: EO1: to enhance the problem-solving skills and interest in advanced studies for 8-16 students; and EO2: to enhance the participation ofwomen and Hispanics in computing. Intellectual Merit. The success of the Career project will contribute to the NCS and decisionmaking body of knowledge. The proposed work will advance knowledge about: i. NCS algorithms: Along with theoretical results about the quality of the solution, the proposed work will address the noise in solution sets, as well as continuums of solutions; ii. Soft constraints: By developing decision algorithms for over-constrained problems, it will be possible to (semi-)autonomously determine the most relevant soft constraints scheme to solve the original problem; iii. Constraints distribution over different social groups structures: the expected communication algorithms will combine theory from speculative constraints with frameworks of social structures to improve the time to solution of given constraints. Broader Impacts. The project will result in a new Matlab toolbox, expected to enhance the way users approach problem solving and appeal to more users, in particular the Matlab community. The progress and results of the project will be disseminated through the PIs constraintsolving.com website, widely accessed by various communities. Moreover, the PI holds a CoProD workshop that annually brings together NCS researchers and practitioners. The project will take place at UTEP, an institution with more than 75% Hispanic citizens and a leader in the education and advancement of Hispanics. With UTEPs infrastructure and the proposed educational activities, the project will train a new generation of diverse computer scientists with strong problem-solving skills. It will also result in new constraint-based courses, including material that can contribute to a textbook on NCS that will have impact beyond UTEP. Workshops and constraint-oriented hands-on activities will be offered at one middle-school and three high-schools, one of which is a women-only high-school, with potential to inspire students to engage in computing disciplines. It is expected that over 450 students will be involved in outreach activities over the course of the grant.","title":"CAREER: Symbolic-Numeric Constraint-Based Solutions for Real-World Scientific Problems","awardID":"0953339","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":[432421],"PO":["565251"]},"163619":{"abstract":"The \"holy grail\" of artificial intelligence research for decades has been to design computers with robust, integrated, human-like intelligence. This goal has proven elusive, in spite of a massive amount of research. But another goal is just now becoming feasible, and so has been the subject of much less research: using vast computer networks to create new kinds of intelligent entities that combine the best of both human and machine intelligence. One key to designing such human-centered computing systems is better ways of measuring the collective intelligence they exhibit. That is the focus of this research, which represents a collaborative effort among researchers at MIT (lead institution), CMU and Union College. The PIs will first use analogies with what is already known about measuring individual intelligence to suggest new ways of measuring the collective intelligence of complex human-machine systems. For instance, they will determine whether the striking pattern of correlations across tasks that characterizes individual human intelligence even exists for human-machine groups. Next, a series of statistically validated tests will be developed to measure the key components of collective intelligence in human-machine groups. Then, to better understand the \"active ingredients\" of collective intelligence, the PIs will use what is already known about how groups of people interact effectively to measure micro-level behavior in human-machine groups. A key goal will be to find critical factors (such as group size, technological support, or individual capabilities) that contribute to a human-machine group's adaptability across a wide range of tasks.<br\/><br\/>Most people and computers today are parts of larger human-machine systems that must cope with a wide range of problems. This research will provide powerful new tools for managing and designing such systems. Imagine, for instance, that one could give a short \"collective intelligence test\" to a top-management team, a product development team, or a collection of Wikipedia contributors. Imagine that this test could predict the team's future performance on a wide range of important tasks. And imagine that the test could also help suggest changes to the team that would improve its flexibility. Or imagine that designers of new collaboration software tools could use a single test to predict how well their tools would improve a group's effectiveness on many different tasks. From the smallest business work groups to our largest societal challenges, there are now many new opportunities for people and computers to solve problems together, not just more efficiently, but also more intelligently. This work will help build a firmer scientific foundation for doing this.<br\/><br\/>Broader Impacts: With individual humans, it is relatively easy to measure intelligence, but it is difficult to increase that intelligence or to observe the detailed events inside the brain that give rise to it. With human-computer groups it is much easier to observe and change factors (such as group size, composition, and technological support) that are likely to determine the group's collective intelligence. Thus, there is a profound intellectual opportunity, not just to learn more about how to design intelligent human-computer systems but also to gain new insights into the very nature of intelligence in complex systems. The results of this research, therefore, will be of interest not only to researchers in computer-supported cooperative work, human-computer interaction, and artificial intelligence, but also more broadly to fields such as cognitive science, social psychology, and organization theory.","title":"Collaborative Research: Measuring and Modeling Collective Intelligence","awardID":"0963404","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551767"],"PO":["565227"]},"161816":{"abstract":"This research aims to enable the development of the next generation of collaborative technologies and to study their effects on human collaboration. It does so by improving our theoretical understanding of how various features of shared visual context affect communication, coordination and collaboration. The research develops and makes available the code for a new dual eye tracking methodology that can be used to study coordination and collaboration. It also develops a new set of metrics that can be more generally used to understand coordinated eye movements as they relate to dialogue and conversation. The results of this work will add to knowledge in a number of disciplines, including human-computer interaction, language technologies, computer science, computational linguistics, communication studies, cognitive science, and social and cognitive psychology.<br\/><br\/>As recent efforts in telemedicine, distance education, and remote training and repair attest, there exists enormous potential for technologies to support these activities at a distance, ultimately resulting in widespread benefits such as equal access to quality education and medical care. The education activities in this research include: (1) developing a new Ph.D. course that teaches a theory-driven design approach; (2) developing a series of course modules that use the dual eye tracking methodology to teach behavioral coding, statistics and machine learning; (3) developing a publicly available multimodal corpus with a set of tutorials, and (4) developing a series of international workshops on dual eye tracking. Finally, the research will simultaneously advance discovery and understanding while training both graduate and undergraduate students in interdisciplinary research methods and will contribute to the development of traditionally underrepresented individuals in the fields of computer and information sciences.","title":"CAREER: A Multi-Disciplinary Approach to the Next Generation of Collaborative Technologies","awardID":"0953943","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["562931"],"PO":["564456"]},"159060":{"abstract":"This CPATH award funds an extension of a prior community building award to expand the studio learning model on a national scale. A team of four computing faculty and three evaluators will address this challenge in a carefully orchestrated 30-month national project in which faculty development workshops will train ten to fifteen computing educators to teach up to twenty courses taken by a variety of computing and IT majors at ten to fifteen community colleges and universities across the country, with each course taught once in a studio-based format and once in a traditional format. A rich set of data, including pre- and post-tests, pre- and post-surveys, student interviews, and instructor reports, will be collected and analyzed in order to evaluate the impact of SBL. <br\/><br\/>The instructional methods most commonly employed today in computing education are not a good match for computing careers of the future. Instruction tends to focus more on programming and less on computational thinking, design, and problem solving. Labs and homework assignments are generally geared toward individual and isolated work rather than communication, collaboration, presentation and critiquing. This not only runs the risk of turning students off to computing as a discipline, but also fails to prepare students for tomorrow?s computing careers that require skills in communication, collaboration and critical analysis, as well as computational thinking, design and problem solving. The Studio-Based Learning (SBL) model has the potential to train students in these skills, make learning computing both engaging and effective, and thus trigger a fundamental shift in computing education. <br\/><br\/> Intellectual merits: The broad implementation and systematic evaluation of the SBL model has the potential to significantly expand the knowledge base on effective and engaging methods of computing education. Since the investigators' work on SBL dates back to the late 1990s, by the end of the proposed project, the collaborative group will have accumulated over a decade of data, theoretical analyses and practical information on the implementation and impact of SBL. Furthermore, five years' worth of systematic implementation and evaluation results will have accrued from a variety of computing courses, from a variety of institutions across the country, and for a broad spectrum of undergraduate students, making this one of the longest and most systematic evaluation of a pedagogical approach in computing education. Results from the project will therefore enrich both the theory and practice of computing education. <br\/><br\/>Broader impacts: The national implementation should enable a large and diverse group of undergraduates in a variety of computing majors from across the country, in different types of institutions, and in different levels and types of computing courses, to benefit from SBL. In turn, this has the potential to form the beginnings of a convincing case for an even broader adoption of the approach. The ultimate benefit will be not only that students find the computing curriculum less intimidating and more engaging, but also that they are prepared for careers that increasingly require skills of computational thinking, design and problem solving, collaboration and communication. The project includes implementation in several EPSCOR states and minority-serving institutions. The activities of this project, evaluation results, and practical resources will be widely disseminated not only through the traditional means of papers, presentations and meetings, but also through a feature-rich community portal and other non-traditional means. Finally, this project's results could also benefit other science and engineering curricula because design and problem solving play important roles in all of science and engineering.","title":"CPATH-2: Collaborative Research: Broadening Studio-Based Learning in Computing Education","awardID":"0939055","effectiveDate":"2010-01-01","expirationDate":"2014-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":["203833","426671",425137],"PO":["564181"]},"159083":{"abstract":"This CPATH award funds an extension of a prior community building award to expand the studio learning model on a national scale. A team of four computing faculty and three evaluators will address this challenge in a carefully orchestrated 30-month national project in which faculty development workshops will train ten to fifteen computing educators to teach up to twenty courses taken by a variety of computing and IT majors at ten to fifteen community colleges and universities across the country, with each course taught once in a studio-based format and once in a traditional format. A rich set of data, including pre- and post-tests, pre- and post-surveys, student interviews, and instructor reports, will be collected and analyzed in order to evaluate the impact of SBL. <br\/><br\/>The instructional methods most commonly employed today in computing education are not a good match for computing careers of the future. Instruction tends to focus more on programming and less on computational thinking, design, and problem solving. Labs and homework assignments are generally geared toward individual and isolated work rather than communication, collaboration, presentation and critiquing. This not only runs the risk of turning students off to computing as a discipline, but also fails to prepare students for tomorrow?s computing careers that require skills in communication, collaboration and critical analysis, as well as computational thinking, design and problem solving. The Studio-Based Learning (SBL) model has the potential to train students in these skills, make learning computing both engaging and effective, and thus trigger a fundamental shift in computing education. <br\/><br\/> Intellectual merits: The broad implementation and systematic evaluation of the SBL model has the potential to significantly expand the knowledge base on effective and engaging methods of computing education. Since the investigators' work on SBL dates back to the late 1990s, by the end of the proposed project, the collaborative group will have accumulated over a decade of data, theoretical analyses and practical information on the implementation and impact of SBL. Furthermore, five years' worth of systematic implementation and evaluation results will have accrued from a variety of computing courses, from a variety of institutions across the country, and for a broad spectrum of undergraduate students, making this one of the longest and most systematic evaluation of a pedagogical approach in computing education. Results from the project will therefore enrich both the theory and practice of computing education. <br\/><br\/>Broader impacts: The national implementation should enable a large and diverse group of undergraduates in a variety of computing majors from across the country, in different types of institutions, and in different levels and types of computing courses, to benefit from SBL. In turn, this has the potential to form the beginnings of a convincing case for an even broader adoption of the approach. The ultimate benefit will be not only that students find the computing curriculum less intimidating and more engaging, but also that they are prepared for careers that increasingly require skills of computational thinking, design and problem solving, collaboration and communication. The project includes implementation in several EPSCOR states and minority-serving institutions. The activities of this project, evaluation results, and practical resources will be widely disseminated not only through the traditional means of papers, presentations and meetings, but also through a feature-rich community portal and other non-traditional means. Finally, this project's results could also benefit other science and engineering curricula because design and problem solving play important roles in all of science and engineering.","title":"CPATH-2: Collaborative Research: Broadening Studio-Based Learning in Computing Education","awardID":"0939157","effectiveDate":"2010-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":["492735"],"PO":["564181"]},"159085":{"abstract":"This project is developing and offering a course in computational thinking for non-computer science undergraduate students at Baylor University. In this course, computational thinking is viewed algorithmically, thus it helps students to develop the skills needed to effectively solve problems with algorithms. It includes such topics as problem abstraction and decomposition, fundamental programming concepts, and the practical and theoretical limits of computation.<br\/><br\/>There are several distinctive aspects to this course. First, it is intended for all students rather than only those in science-related disciplines. Second, it is collaborative. Students work in small groups that change weekly. Third, it is problem-based. Students learn computational thinking by solving real problems. Finally, problems given in the course come from disciplines outside of computer science. Faculty members from across the university are helping to develop the set of problems to be used in the class. Because the course focuses on how computational thinking may be used in other disciplines, it will better train non-computer science majors than the existing introductory course for computer science majors.<br\/><br\/>The first year of the project is focused upon curriculum development, including defining a canonical list of problem types, gathering problems for the course, and selecting appropriate software for student implementation. The course will be offered twice in the second year of the project, once each semester. Given the enrollment in traditional introduction to computer science courses, demand for the course is high.<br\/><br\/>Intellectual Merit<br\/>This introductory course for non-majors gives a broad introduction to computational thinking for non-computer scientists. The principal investigators each have years of experience using problem-based, collaborative learning to teach computational thinking to computer science majors at all levels. A problem-based curriculum, using problems from external disciplines, serves to motivate the computational topics. The course also educates students about the breadth of computation?s application, and introduces them to other fields.<br\/><br\/>This course has the potential to be transformative by becoming a model for the introduction to algorithmic computational thinking. It brings together students and problems from multiple disciplines, and unites them under a common theme. The efficacy of the course in training students in computational thinking will be rigorously evaluated and compared with a traditional introductory computer science course.<br\/><br\/>Broader Impacts<br\/>If technology is to continue to have a positive impact on society, it is essential for the people who interact with technology to understand how to effectively use and create with it. To this end, the proposed course broadens participation in computing by serving students outside the discipline.<br\/>It also broadens the participation of faculty members by including external faculty in course development. The course enhances education infrastructure by providing a curriculum, software tools, and a body of problems to be made publicly available. The PIs have broad support for this course, both from inside the computer science department and across the faculty in many other departments at Baylor.","title":"CPATH-1: An interdisciplinary, problem-based, collaborative course on computational thinking","awardID":"0939167","effectiveDate":"2010-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":[425242,425243,425244],"PO":["564181"]},"159053":{"abstract":"This CPATH award funds an extension of a prior community building award to expand the studio learning model on a national scale. A team of four computing faculty and three evaluators will address this challenge in a carefully orchestrated 30-month national project in which faculty development workshops will train ten to fifteen computing educators to teach up to twenty courses taken by a variety of computing and IT majors at ten to fifteen community colleges and universities across the country, with each course taught once in a studio-based format and once in a traditional format. A rich set of data, including pre- and post-tests, pre- and post-surveys, student interviews, and instructor reports, will be collected and analyzed in order to evaluate the impact of SBL. <br\/><br\/>The instructional methods most commonly employed today in computing education are not a good match for computing careers of the future. Instruction tends to focus more on programming and less on computational thinking, design, and problem solving. Labs and homework assignments are generally geared toward individual and isolated work rather than communication, collaboration, presentation and critiquing. This not only runs the risk of turning students off to computing as a discipline, but also fails to prepare students for tomorrow?s computing careers that require skills in communication, collaboration and critical analysis, as well as computational thinking, design and problem solving. The Studio-Based Learning (SBL) model has the potential to train students in these skills, make learning computing both engaging and effective, and thus trigger a fundamental shift in computing education. <br\/><br\/> Intellectual merits: The broad implementation and systematic evaluation of the SBL model has the potential to significantly expand the knowledge base on effective and engaging methods of computing education. Since the investigators' work on SBL dates back to the late 1990s, by the end of the proposed project, the collaborative group will have accumulated over a decade of data, theoretical analyses and practical information on the implementation and impact of SBL. Furthermore, five years' worth of systematic implementation and evaluation results will have accrued from a variety of computing courses, from a variety of institutions across the country, and for a broad spectrum of undergraduate students, making this one of the longest and most systematic evaluation of a pedagogical approach in computing education. Results from the project will therefore enrich both the theory and practice of computing education. <br\/><br\/>Broader impacts: The national implementation should enable a large and diverse group of undergraduates in a variety of computing majors from across the country, in different types of institutions, and in different levels and types of computing courses, to benefit from SBL. In turn, this has the potential to form the beginnings of a convincing case for an even broader adoption of the approach. The ultimate benefit will be not only that students find the computing curriculum less intimidating and more engaging, but also that they are prepared for careers that increasingly require skills of computational thinking, design and problem solving, collaboration and communication. The project includes implementation in several EPSCOR states and minority-serving institutions. The activities of this project, evaluation results, and practical resources will be widely disseminated not only through the traditional means of papers, presentations and meetings, but also through a feature-rich community portal and other non-traditional means. Finally, this project's results could also benefit other science and engineering curricula because design and problem solving play important roles in all of science and engineering.","title":"CPATH-2: Collaborative Research: Broadening Studio-Based Learning in Computing Education","awardID":"0939017","effectiveDate":"2010-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":["551105"],"PO":["564181"]},"143292":{"abstract":"Chip multiprocessors (i.e., multicores) are rapidly emerging as the dominant platform for computing. This computing environment features parallel computing with shared-memory and a hierarchy of caches. This research project will develop a theory of multicore computing, which will include (but is not limited to) the following aspects: Developing and refining abstract theoretical models for multicore computing; designing and analyzing efficient algorithms for multicores for important problems, including cache-oblivious and processor-oblivious algorithms; designing schedulers for efficient execution of parallel algorithms on multicores; and developing lower bounds to delineate the inherent limitations of multicore computing.<br\/><br\/>The outcome of the project will be a new set of methods for the efficient use of multicores. Since multicores are widely expected to be the dominant compute platform for the foreseeable future, these results are likely to have broad applicability to all fields that rely on compute-intensive tasks.","title":"Theory and Algorithms for Multicore Computing","awardID":"0830737","effectiveDate":"2010-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["550960"],"PO":["565251"]},"159671":{"abstract":"Computing-others (35) <br\/><br\/>This project bridges the boundaries between computer science (CS) and natural sciences, as well as the gap between institutions of higher education and K-12 by teaching Computational Thinking (CT). Recent attention to CT as a \"fundamental skill for everyone\" is shifting the curricular focus in computing from programming to design and applications in such a way as to bring scientific thinking into mainstream education. It is producing an inventory of CT modules and assessment tools that are being developed for use in new undergraduate courses, including a general education introductory CT course and an upper-level Computational Scientific Thinking course for teacher candidates and STEM - Science, Technology, Engineering and Mathematics majors.<br\/><br\/>These courses are using a scalable game design. Through the progression from designing games to simulations, students are learning many skills including computer science concepts, computational problem-solving, mathematical modeling, analysis of system evolution through simulations and visualization, and experimentation with applications.<br\/><br\/>Computational science serves the nation as both a teaching pedagogy and a workforce strategy. In teaching, the project stimulates a systemic change in undergraduate education that reflects computation becoming an essential and permanent element in sciences. The project is providing CT skills to a wide audience of undergraduate students (CS & non-CS majors), including teacher candidates.","title":"Development of Collaborative Computational Thinking (Colla-CT) Inventory for General Education and Teacher Education Courses","awardID":"0942569","effectiveDate":"2010-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1536","name":"S-STEM:SCHLR SCI TECH ENG&MATH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7494","name":"CCLI-Type 1 (Exploratory)"}}],"PIcoPI":["495554"],"PO":["563736"]}}