{"209957":{"abstract":"Discrete optimization lies at the core of computer science and its applications. Except for a few special cases, exact optimization is computationally intractable. Approximation algorithms seek to resolve this issue by providing computational efficiency and at the same time provable guarantees on the quality of solutions. The current project addresses fundamental open questions about approximation algorithms. The project will use strong relaxations, especially the sum-of-squares method, as a lens to shed light on these questions.<br\/><br\/>The Unique Games Conjecture has fueled many recent advances in our understanding of approximation algorithms. A proof of this conjecture would show that for a large classes of problems the approximation guarantees of a concrete algorithm are best possible. On the other hand, a refutation of the conjecture would likely lead to major improvements of approximation algorithms for a wide range of problems. Recent works of the PI and coauthors identified a candidate algorithm to refute the Unique Games Conjecture. This algorithm is able to solve previously proposed constructions of hard instances for problems that the conjecture predicts to be NP-hard. An integral part of the research project is to resolve whether this algorithm indeed refutes the conjecture.<br\/><br\/>The candidate algorithm comes from a meta-algorithm, called sum-of-squares method. The current project will also study the approximation guarantees of this method beyond the Unique Games Conjecture, and investigate the thesis that for a large class of problems, the sum-of-squares method is an optimal meta-algorithm in terms of approximation guarantee and time complexity.<br\/><br\/>A broad range of academic disciplines apply optimization techniques and computational efficiency is an important factor in these applications. In practice, meta-algorithms are often a popular choice, e.g., belief propagation, MCMC methods and SAT solvers, but lack provable approximation guarantees. The sum-of-squares method has the potential to achieve the same versatility as other meta-algorithms but with the additional benefit of provable guarantees.","title":"CAREER: Approximation and Hardness from Strong Relaxations","awardID":"1350196","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[562828],"PO":["565157"]},"210023":{"abstract":"The effects of cybersickness (i.e., motion sickness caused by immersive simulation, such as virtual reality) on healthy users has been one of the fundamental research areas in virtual reality (VR) for many years, but its impact on persons with physical disabilities is still unknown, even though it could have a significant an impact on VR-based physical rehabilitation for this population. This project investigates cybersickness for persons with disabilities, specifically for persons with multiple sclerosis with a moderate level of mobility impairment and no cognitive impairment. The expected outcome of this research is to minimize the negative effects of cybersickness for people with disabilities, and to thereby significantly improve the effectiveness of VR-based physical rehabilitation and the quality of life for people with motor impairments.<br\/><br\/>The first objective of this project is to determine the best way to measure cybersickness in people with disabilities, and the second is to then figure out the main factors that contribute to cybersickness in persons with disabilities, specifically for people with proprioceptive and balance deficits (e.g., due to neurological, vestibular, balance issues). Based on preliminary data, the central hypothesis is that VR-induced cybersickness will be magnified for persons with disabilities as compared to persons without disabilities because of differences in balance and proprioception abilities. To test this hypothesis, the project will (a) determine how disability correlates with VR-induced cybersickness, (b) determine the most effective objective measures of VR-induced cybersickness for people with disabilities, (c) determine the main contributing aspects of VR design that affect cybersickness in people with disabilities and (d) create, disseminate, and maintain an open database of (anonymized) cybersickness data from people with disabilities.<br\/><br\/>Broader Impacts: The project will take a critical step towards the challenge of universal usability in VR and offer a deeper understanding of the effectiveness of VR as a medium for rehabilitation. The project will impact the way that people with disabilities are able to engage in VR-based rehabilitation and exercises, which could potentially have long term impact on the effectiveness and efficacy of the rehabilitation and ultimately the quality of life for these people. The project will actively engage graduate and undergraduate students in research, integrate results from research into a novel course on accessible user interfaces and universal usability, and collaborate with national advocacy societies for persons with disabilities to promote education and motivation for VR-based rehabilitation.","title":"CAREER: Measuring and Reducing Cybersickness in Virtual Reality Physical Rehabilitation","awardID":"1350995","effectiveDate":"2014-02-15","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562961],"PO":["565362"]},"210089":{"abstract":"The research objective of this Faculty Early Career Development (CAREER) Program award is to improve the effectiveness of Mixed Integer Programming (MIP) by developing and using a new paradigm for constructing linear and nonlinear MIP formulations. Such formulations are used to describe the selection among a finite number of alternatives in optimization models and their attributes can significantly affect the performance of the software employed to solve these models. Unfortunately, there is often a strong trade-off between favorable formulation attributes. The research in this award will result on methods to systematically reduce these trade-offs. The approach to develop these methods will include a mathematical analysis of the proposed paradigm, the design of algorithms to construct the associated MIP formulations and extensive computational experiments to evaluate their effectiveness. The deliverables of this work include new mathematical techniques for constructing and analyzing MIP formulations, algorithms and software for using and evaluating advanced MIP formulations, and educational material for engineering students and practitioners. <br\/><br\/>If successful, the results of this research will provide tools to improve the effectiveness of optimization software for a wide range of MIP applications in business, science and engineering. Recent examples of such applications include efficient energy production and dispatch, clinical trial design and analysis, and trajectory optimization of unmanned aerial vehicles. Results from this research will be disseminated through various channels to allow their integration into commercial optimization software. In addition, all developed techniques will be implemented in open-source software tools available through a variety of modeling languages. The educational material developed in this award will help students at all levels develop crucial mathematical modeling skills. Graduate and undergraduate students will further benefit from this award through lectures and research experience.","title":"CAREER: Advanced Mixed Integer Programming Formulations","awardID":"1351619","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":[563098],"PO":["565139"]},"210640":{"abstract":"This grant funds student travel to the International Conference on Software Engineering (ICSE 2014), to be held in June 2014 in Hyderabad, India. This is the flagship conference in the Software Engineering field for researchers, practitioners and educators to present and discuss the most recent innovations, trends, experiences, etc. Funding for student travel has significant broader impacts because of the the opportunity it gives the students to become part of the research community, discuss their research with others, meet leaders in the field, and have experiences toward building the future, global workforce. The funds are for US-based students with attention to broadening participation from underrepresented groups.","title":"Travel Support For ACM\/IEEE International Conference on Software Engineering (ICSE 2014)","awardID":"1360923","effectiveDate":"2014-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[564387],"PO":[564388]},"210893":{"abstract":"This project supports hosting the three day 19th edition of the GENI Engineering conference (GEC), including organizing and hosting the demo session, to be held Mar 17 - 19, 2014 at the Georgia Institute of Technology in Atlanta, GA. Both the conference and the demonstration session will be held at the University or in university owned conference facilities in order to minimize costs. Event planning and logistical support for GEC 19 will be coordinated by a team from GaTech?s Institute for People and Technology which has extensive experience in conference planning and support at the local, national, and international levels. <br\/><br\/>The Global Environment for Network Innovations (GENI) is a virtual instrument that is rapidly emerging in prototype form across the United States. GENI aims to transform experimental research in networking and distributed systems, as well as emerging research into very large socio-technical systems, by providing a suite of infrastructure for 'at scale' experiments in future internets. <br\/><br\/>There are three GECs per year, in which the entire GENI community meets to review current status, and to decide on subsequent steps in GENI's evolution. The GECs include community-based working groups leading GENI's design and planning, and demonstrating progress with live experiments. About 250 to 300 leading researchers and Ph.D. students from diverse US institutions will gather in Atlanta to showcase their ideas and results. In the demo session over 35 live demos will be provided with a wired connection to the GENI infrastructure. The demo evening will be held in the first floor event space of the Technology Square Research Building located immediately across the street from the conference hotel and will be provided with high-speed connectivity to Internet2, the NLR, and the SoX regional network. Each GEC demo project will be issued with temporary campus-wide wireless credentials that will grant access to the campus wireless infrastructure and commodity Internet for the duration of the demo evening. <br\/><br\/>The GEC meeting and demo sessions provide graduate students with both an opportunity to demonstrate and explain their work to the GENI community prior to formal publication. It is a key part of helping new graduate students understand what is being done with GENI and who amongst their peers at other institutions might be valuable resources. It also supports outreach to new community members, including the emerging US Ignite community. GENI is already being used as an instrument for research, this project supports the continued development and community development of that instrument.","title":"GENI Engineering Conference","awardID":"1412797","effectiveDate":"2014-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[564992],"PO":[564993]},"211036":{"abstract":"This project provides funding for travel awards to graduate students in order to attend the 2014 IEEE International Symposium on Performance Analysis for Systems and Software (ISPASS-2014). ISPASS is a premier forum for presenting, discussing, and debating advanced academic and industrial research work focused on performance analysis in the design of computer systems and software.<br\/><br\/>This project is focused primarily on broader impacts through the education students will receive from attending the technical sessions of ISPASS, mentoring that they will receive through the interaction with senior researchers, and networking opportunities they will receive through numerous different conference activities.","title":"Student Travel Support for the 2014 IEEE International Symposium on Performance Analysis of Systems and Software (ISPASS-2014)","awardID":"1420090","effectiveDate":"2014-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[565318],"PO":[565319]},"210993":{"abstract":"This is funding to support a Doctoral Consortium (workshop) of about 15 promising graduate students from the United States and abroad, along with 6 distinguished research faculty mentors. The event will take place in conjunction with the ACM 2014 Conference on Human Factors in Computing Systems (CHI 2014), which is sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI) and will be held April 26-May 1 in Toronto, Canada. The annual CHI conference is the leading international forum for the presentation and discussion of human-computer interaction (HCI) research and practice, and is attended by approximately 3,400 HCI professionals from around the world. Research reports published in the CHI Conference Proceedings and the CHI Extended Abstracts are heavily refereed and widely cited; they are among the most scientifically respected research publications in the field of HCI. More information about the conference is available online at http:\/\/chi2014.acm.org.<br\/><br\/>The Doctoral Consortium is a research-focused meeting that has taken place annually at the CHI conference since 1986, and has helped to launch the careers of many outstanding HCI researchers. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will present their work during the two full days of the Consortium on April 26-27. Each student will have a 45-minute time slot in which to make a formal presentation and receive feedback from the faculty panel, which is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The program for the two full days of the Consortium will also include substantial informal opportunities for discussion and additional feedback, with follow up activities planned during the technical program of the conference. Extended abstracts of the students' work will be published in the CHI 2014 Extended Abstracts, which is distributed to all conference registrants and included in the ACM Digital Library. SIGCHI's conference management committee will evaluate the event, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars; many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is HCI-related, regardless of the fields in which they are earning their degrees. In accordance with CISE policy, NSF funds will be used solely to support participation by students enrolled in graduate programs in the United States, although there will also be a number of international participants in recognition of the fact that the HCI field embraces educational and cultural traditions that vary in different parts of the world. The organizers have undertaken to work to identify and include the broadest possible group of highly qualified participants; as a consequence, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field. To further promote diversity no more than one student will be accepted from any given institution, except in the case where including a second student from the same school would allow a woman to be a participant.","title":"WORKSHOP: Doctoral Research Consortium at ACM CHI 2014","awardID":"1418913","effectiveDate":"2014-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565224],"PO":["565227"]},"210784":{"abstract":"Contemporary efforts to document the world's endangered languages are dependent on the widespread availability of modern recording technologies, in particular digital audio and video recording devices and software to annotate the recordings that such devices produce. However, despite well over a decade of dedicated funding programs aimed at the documentation of endangered languages, the technological landscape that supports the activities of those involved in this work remains fragmented, and the promises of new technology remain largely unfulfilled. Moreover, the efforts of computer scientists, on the whole, are mostly disconnected from the day-to-day work of documentary linguists, making it difficult for the knowledge of each group to inform the other.<br\/><br\/>The ComputEL workshop will address this state of affairs by bringing together field linguists and computer scientists to explore how computational techniques and tools can be created to better aid in the analysis of endangered languages. A particular focus will be on how to facilitate the process through which research results in this domain can be developed into software that is well-supported for use by those documenting endangered languages in the field.<br\/><br\/>The workshop will be co-located with the Association for Computational Linguistics Annual Meeting in Baltimore in June 2014. This will allow it to reach a wider audience than would otherwise be possible, while taking advantage of its East Coast location to involve participants from nearby areas. Its first day will consist of research presentations scheduled as a part of the ACL meeting. On the following day, participants will take part in discussions designed to lay out a near-term agenda for the improved application of computational methods to the study of endangered languages.<br\/><br\/>The papers from the workshop will be published in the Association for Computational Linguistics conference proceedings, and an additional report will be produced summarizing the conclusions of the closed meeting. Smaller speaker communities worldwide will benefit from the results which will support better documentation and preservation of endangered languages.","title":"ComputEL: A workshop to explore the use of computational methods in the study of endangered language; Baltimore, MD - June 2014","awardID":"1404352","effectiveDate":"2014-02-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7719","name":"DEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[564749],"PO":[564750]},"210014":{"abstract":"Much of today's economic activity and resource allocation takes place on systems with many strategic actors. Examples include auctions and exchanges for advertising space, matching markets for labor and capital, and congestion-aware GPS navigation systems. These systems have grown larger than ever before in today's networked world, and their behavior is necessarily a confluence of the preferences, beliefs, and strategic behaviors of many, rather than a system designer's intent. Nevertheless, there are two main \"knobs\" that a designer of such a system can turn in order to influence the equilibrium behavior of its participants: the incentives provided to players in the game, and the information available to them.<br\/><br\/>This proposal adopts the perspective of a designer looking to influence equilibrium outcomes in such systems. The proposed work will separately consider both modes of intervention, namely structuring the incentives provided and carefully revealing information. In each case, the PI will examine the associated algorithmic question: Given the designer's objective, can a near-optimal intervention be computed efficiently? On the incentives front, the focus will be on refining existing theoretical models and algorithmic techniques with the goal of broadening their impact, in particular to settings where heuristic mechanisms and auctions have seen success in practice. On the information front, the proposed work will lay the foundations of an algorithmic theory of information in games, and begin a systematic examination of the computational complexity of intervention through information revelation.","title":"CAREER: Algorithms, Incentives, and Information in Strategic Settings","awardID":"1350900","effectiveDate":"2014-02-15","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[562943],"PO":[562944]},"210554":{"abstract":"This site is co-funded by the CISE Secure and Trustworthy Cyberspace (SaTC) Program. This funding establishes a new Research Experiences for Undergraduates (REU) Site at the University of Arkansas Little Rock. Undergraduate students will participate in summer research focused on the integration of fundamental security and forensics research with the latest technical advances in mobile computing, cloud computing, and social networks. The research is led by an experienced faculty team that plans to offer a balance of theory, applications, and practical skills as well as mentoring and professional development opportunities for the students. The site will focus on recruiting students from the South Central region of the United States using established regional connections.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in research areas that are current and address national priorities. The site will leverage its National Security Agency designated Center of Academic Excellence in Information Assurance Education and NSF funded Cloud Computing Research Instrument and Computational Research Center to enhance and enrich participants' competitive research experiences. The undergraduate student participants will be able to gain a broad and unified picture of the significance of security and forensics through interactions with university professors, professionals and researchers in forensics labs, practitioners in IT industry, and security officers in military service. The research has the potential to contribute to the research core of the emerging field of cyber security.<br\/><br\/>The broader impacts are centered on the opportunities for a diverse pool of students to gain research experiences in cyber security and forensics. The site will capitalize on the established collaborations and communication channels with regional institutions for student recruitment. Through extensive research training and careful mentoring, this program has a great potential to attract fresh young minds into graduate schools and advance the state of the art of research and education in cyber security and forensics at undergraduate level in the South Central part of the United States.","title":"REU Site: CyberSAFE@UALR: Cyber Security and Forensics Research at the University of Arkansas at Little Rock","awardID":"1359323","effectiveDate":"2014-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[564179,564180],"PO":[564181]},"211016":{"abstract":"The objective of this project is to broaden participation of women and underrepresented groups in visualization. The PI proposes to establish an annual two-day workshop and other activities designed to increase the participation of women and underrepresented groups in visualization.Visualization plays a significant role in the exploration and understanding of data across all disciplines with a universal goal: gaining insight into the complex relationships that exist within the data. The need to diversify a field with such far reaching influences by providing career mentoring advice, overviews of past accomplishments, and future research directions in visualization is important. The proposed workshops will inform, inspire and encourage participants to engage in the multidisciplinary dynamics of visualization.<br\/>The first supported workshop is scheduled for February 10-11, 2014, and will be hosted at Clemson University in South Carolina. <br\/>A total of 20 participants at the undergraduate, graduate, post-graduate, and early career faculty level will be invited to participate in the workshop. The workshop will be organized as a series of presentations, panels with networking opportunities, and mentoring activities. To encourage collaborations, participants will present their work and explore the work of others during a poster session. Participants will be recruited via a number of different venues including, but not limited to: The Anita Borge Institute\/Grace Hopper listserv, association listservs (CRA, CRA-W, CDC, AAPHDCS, Hispanics in Computing, and Women in Machine Learning), Broadening Participation Communities (A4RC, EL Alliance) and discipline-specific mailing lists (IEEE-Vis). Undergraduates will be recruited by on-campus organizations (Women in Science and Engineering and The Charles H. Houston Center). The inclusion of undergraduates will ensure the level of interest in visualization spans across academic and professional domains. Outcomes of the workshops will be assessed by surveying participants at the start and at the end of the workshop.","title":"Broadening Participation in Visualization (BPViz) Workshop","awardID":"1419415","effectiveDate":"2014-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":[565271],"PO":[565272]},"205725":{"abstract":"Explosive growth in data volume, heterogeneity, and complexity imposes unprecedented challenges in data analysis and organization in data centers. RAID particularly XOR-based RAID plays an important role to provide both reliability and high performance storage services for these data centers. However, they suffer from problems on the scalability issue due to multi-folded factors, including: heterogeneous RAID layouts and various erasure codes, high overhead of existing scaling process to significantly downgrade the storage performance, and lack of bidirectional scaling support. <br\/><br\/>The objective of this project is to address the scalability challenge for storage systems in large data centers. This project designs novel techniques to exploit XOR-based parity codes to achieve efficient scaling, develops a series of scalable XOR-based erasure codes to bridge the relations among heterogeneous RAID forms for interoperability, and integrates various erasure codes in a framework to provide a unified user interface for RAID scaling. <br\/><br\/>The research will facilitate the storage systems to effectively tackle the scalability challenge in large data centers. It cohesively investigates how to utilize and integrate proper RAID scaling technologies to improve the scalability of storage systems. This project will yield fundamental contributions to research on efficient big data management in high-performance data centers, and greatly contribute to enabling high-performance computing systems to stay on track of their historic scaling, and hence benefit numerous real-life data-intensive applications such as biology, chemistry, earth science, health care, and so on.","title":"SHF: Small: ASF: An Adaptive Scaling Framework for High Scalability of XOR-Based RAID Systems","awardID":"1320349","effectiveDate":"2014-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[550809],"PO":["563661"]},"210027":{"abstract":"With the demand on improving performance and energy-efficiency, novel technologies including non-volatile memory (e.g., spin-transfer torque RAM (STT-RAM)), 3D integration technology (3D), and near-threshold voltage computing (NTC) have been increasingly deployed in the state-of-the-art throughput processors. Since the novel technologies are not designed for dependable computing, the reliability challenges, which have been a crucial issue in conventional throughput architecture design, become the major obstacle for integrating them into next-generation throughput processors. There is a pressing need for the investigation of innovative techniques that are able to take advantage of throughput processors' unique features for characterizing and improving the reliability of the next-generation new-technology based throughput architecture design. <br\/><br\/>The paramount reliability challenges in throughput processors include particle strikes induced soft errors, hard errors driven by aging effects, and manufacturing process variations. The principle investigator is building new foundations for vulnerability characterization and prediction, error detection, and fault tolerance against those dominant reliability challenges in throughput processors integrated with novel technologies. The project objectives include: (1) modeling and analyzing the vulnerability of novel-technology (e.g., STT-RAM, NTC, and 3D) enabled throughput processors in the presence of soft error, aging effects, and process variations; (2) fast and accurate predictive model to forecast the vulnerability phase behavior of throughput processors under new technologies; (3) developing the light-weight error detection mechanisms; and (4) exploring the opportunities and challenges introduced by the novel technologies to cost-effectively tolerate various types of errors in next-generation throughput architecture design. The proposed research will significantly promote the capability of architecting reliable throughput processors in future technologies beyond CMOS, making it possible to fulfill the Moore's Law without suffering the negative effects caused by various fault mechanisms. Moreover, this project will realize the desire of applying throughput processors into a wide range of computing scale from mobile computing to cloud computing, and increasing the deployment of throughput processors in support of supercomputing in science and engineering (e.g., finance, medical, biology, petroleum, aerospace, and geology). This project will also contribute to society through engaging high-school and undergraduate students from minority-serving institutions into research, expanding the computer engineering curriculum with reliability modeling and optimization techniques on throughput processors, attracting women and under-represented groups into graduate education, and disseminating research infrastructure for education and training of US IT workforce.","title":"CAREER: New Foundations for Next-Generation Reliable Throughput Architecture Design","awardID":"1351054","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["539562"],"PO":["366560"]},"210545":{"abstract":"This funding renews a Research Experience for Undergraduates (REU) Site at the University of Missouri - Columbia. Undergraduate students will engage in summer research involving a variety of interesting and challenging technical issues in consumer networking. Experienced faculty mentors will lead projects in five major research areas including software defined networking, social media computing, social health networking for eldercare, body-area sensing and emotion recognition, and network performance optimization. The students will participate in the faculty mentors' on-going funded research, investigate technically challenging issues, and develop viable solutions and insights. They will have opportunities to present their research results at various venues at the university, national, and international levels. The site will focus on recruiting students from non-PhD granting institutions with particular emphasis on institutions in and around the state of Missouri.<br\/><br\/>The intellectual merit of the project rests with the leadership an experienced research group with excellent expertise and experience in the research area. The research activities will lead to a better understanding of the multitude of efficiency, performance, reliability, scalability, and security issues and tradeoffs in emerging consumer networking technologies. The approach of integrating future Internet technologies such as Internet-of-Things and software-defined networking in the REU Site will foster the rapid deployment of advanced consumer networking services and applications that are of significance to the economy and quality of life in areas such as social computing and health care.<br\/><br\/>The broader impacts include providing a unique opportunity for undergraduate students with limited research opportunities to experience research in the interdisciplinary areas of consumer networking. With an already established recruitment network, the project team plans to reach the targeted students and encourage applications from women engineers and under-represented minorities as well as students from predominantly undergraduate institutions. The program should be of great interest to undergraduate students due to its close interaction between daily life and exciting consumer networking technologies. The research experiences offer students insight into the requirements of advanced degrees by closely working with faculty mentors and graduate students, and may lead to students ultimately pursuing advanced degrees and fulfilling careers in science and engineering. The professional evaluation by an external assessment specialist should contribute to educational research on effective structures for involving undergraduates in research.","title":"REU SITE: Research in Consumer Networking Technologies","awardID":"1359125","effectiveDate":"2014-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[564155,564156],"PO":["564181"]},"210006":{"abstract":"Whether one is concerned about data-center carbon footprint or battery life of mobile devices, the microprocessor is a dominating consumer of energy. Transistor technology scaling, whose rate is expressed by Moore?s Law, is a regular progression of transistor size reductions down to nanometer dimensions. Historically, this scaling has led to significant improvements in performance and energy efficiency, but more recently scaling has created severe reliability challenges due to difficulties in building components at near-atomic scale. To ensure correctness, chips are operated with static and worst-case safety margins that account for more than 70% of the total energy used by a CPU. This research program specifically addresses that energy wastage by intelligently tightening safety margins and making them dynamic in order to ensure reliable operation with dramatic reductions in expended energy. The success of this research effort will lead to substantial reduction in energy wasted by semiconductor devices for the purpose of improving battery life, environmental impact, and operating costs. It will also encourage the use of continuous self-adjustment and adaptation across an array of computing technologies.<br\/><br\/>In addition to being dependent on the power supply voltage and device temperature, the power and switching delay of a transistor varies substantially with random dopant fluctuation and aging. In current practice, the worst-case combination of factors that affect transistor power consumption and delay are used to size device geometries and define an operating voltage guard band. This ensures reliable operation but leads to unnecessary energy wastage, as the worst-case combinations are unlikely to occur in reality. In this work, machine learning is used to correlate environmental and controllable factors that affect circuit delay and power and dynamically predict the minimum safe guard band. If error-resilient components are used, the guard band can be eliminated entirely. To realize maximum benefit, the system design is optimized across the boundaries of circuit, architectural, and software layers. Combining machine learning, proactive closed-loop control, and a cost\/benefit-driven approach to actuator and on-chip sensor allocation, circuit designers and architects are provided with a comprehensive methodology for creating introspective computing devices that dramatically lower energy and adapt automatically to all environmental and workload conditions.","title":"CAREER: Sustaining Moore's Law Through Introspective Computing: A Comprehensive System For Reliability and Energy Optimization in Modern Computing Devices","awardID":"1350740","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562927],"PO":["366560"]},"210028":{"abstract":"This research is building an understanding of what data is useful to attackers and what data is private for its legitimate owners so that security systems can incorporate these values into a data-driven, defense-in-depth approach to securing our digital lives.<br\/><br\/>We are exploiting the fact that both users and attackers must sift through vast amounts of data to find useful information. This system, called contextual data protection, enables users to passively manage their private and potentially lucrative stored data with minimal overhead, adding extra protection to private data which greatly lowers the risk inherent in long lived archives.<br\/><br\/>Simultaneously, we are creating effective defenses for data by improving our understanding of cybercrime, information use habits, and acceptable usability tradeoffs for data access. Building on previous research analyzing the financial successes of spam-based cybercrime, we are developing a methodology and apparatus for understanding the illicit value of stolen information. By understanding what is discoverable and valuable to attackers, we can develop techniques to focus security efforts on lucrative information, thereby preventing cybercriminals from turning a profit.<br\/><br\/>Ultimately, our goal is to create a set of general techniques that use tools from cryptography that defend users' data by exploiting a deeper understanding of its value to both the users and the attackers. This research will shed light on the meaning of information value, ownership, and protection in this era of long-lived digital storage.","title":"CAREER: Contextual Protection for Private Data Storage and Retrieval","awardID":"1351058","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[562973],"PO":[562974]},"210029":{"abstract":"Introduction and motivation. Life is full of amazingly sophisticated programs encoded in genomes, orchestrating molecules to sense, to compute, to respond, and to grow. Towards rationally designing and synthesizing molecular systems with programmable behaviors as sophisticated as life itself, this project will take an approach that is biologically inspired and computer science centered. On one hand, nature has been very successful in evolving and selecting the most efficient and powerful biological programs made of simple individual molecules. In order to use the full potential of molecules to create complex and programmable systems, one needs to borrow the information processing principles in biology. On the other hand, computer science has been very successful in mastering complexity, and devices with billions of electronic components have been manufactured. In order to build ever-more-complex molecular devices, one needs to borrow the concepts that enabled the success of computer engineering. <br\/><br\/>Intellectual merit. If successful, this project will transform the frontiers of understanding about what possible behaviors a network of interacting molecules can exhibit and how one can rationally design such behaviors. In particular, the project will seek answers for the following questions: (1) How can spatial organization improve the performance of molecular circuitry and machinery? Inspired by spatial organization in biology such as neural wiring and scaffold proteins, the project will develop molecular systems that are spatially organized on the surface of DNA nanostructures, to build faster and more reliable biochemical circuits, efficient molecular Turing machines, and DNA cellular automata with complex spatial and temporal behaviors. (2) How can the brain-like principle of learning from examples be embedded within a network of interacting molecules? Inspired by the learning and memory-forming rules in the brain, the project will explore simple and efficient learning algorithms to create synthetic DNA neural networks that learn from their biochemical environment and recall patterns of biochemical signals. (3) How can sophisticated collective behaviors arise from simple individual behaviors of molecular motors? Inspired by collective behaviors in animals, such as ant foraging and termite clustering, the project will build molecular robots that have simple functions as individuals but as groups perform complex tasks such as cargo sorting and maze solving.<br\/><br\/>Broader impact. This project will bring computer science into areas of molecular sciences in a way that is fundamentally different from the existing approaches in computational biology and bioinformatics: it is not just about using computer algorithms and programs to aid the design and analysis of molecular systems, but it is more about adapting the principles of computer science to create biochemical systems that can carry out instructions to perform tasks at the molecular level. If successful, this project will help extend computer science from the traditional electronic substrates to new molecular substrates that can execute new biologically-inspired algorithms, and create new frontiers in chemistry and biomedical sciences with potential solutions to smart autonomous chemical synthesis and complex disease diagnostics and therapeutics. The project will contribute to education and educator development by designing innovative courses, providing students and postdocs with teaching and mentoring experiences, supporting undergraduate research and student competitions, creating a highly interdisciplinary research environment, and involving more women in science. This project will also increase public engagement with science and technology by developing open-source software tools, producing research videos on YouTube, giving open lectures, and interviewing for science TV series.","title":"CAREER: Robust and systematic molecular engineering with synthetic DNA neural networks and collective molecular robots","awardID":"1351081","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562975],"PO":["565223"]},"210816":{"abstract":"Today's Internet is significantly over-provisioned for a number of reasons, e.g., to absorb traffic bursts, to handle the extra (rerouted) load when failures occur, and for long-term traffic growth without frequent upgrades in the field. This overprovisioning adds significant capital costs to the Internet.<br\/><br\/>The ACTION project enables adaptation of the Internet to changing needs and demands by dynamically adjusting its \"optical highway\" capacities based on network resource utilization. The project name ACTION stands for \"Applications Coordinate through Transport Interfaces with Optical Networks,\" implying that the capacity of the Internet optical highways is a time-adjustable commodity, which can be intelligently controlled by the applications via specially designed interfaces. For example, part of the optical spectrum can be freed on highways with low traffic volume and either reassigned to other highways where needed or switched off to conserve energy. Such flexible highways are achieved by combining WDM (Wavelength Division Multiplexing) Flexible Grid technology in the metro-core with DSCM (Digital Subcarrier Multiplexing) technology in the campus\/access. The ACTION research activities will culminate in a final demonstration on the Japan Gigabit Network-extreme (JGN-X) test-bed.<br\/><br\/>The ACTION project will actively engage undergraduate students in Senior Thesis and Design Projects, recruit women and under-represented minorities by leveraging the UVA Center for Diversity in Engineering and the UTDallas long-standing relationship with CONACYT (National Council for Science and Technology of Mexico). Findings, documents, links to publications and software will be disseminated through a wiki-based Web site. All instructional materials developed will be made available at TeachEngineering.com.","title":"NeTS: JUNO: Collaborative Research: ACTION: Applications Coordinating with Transport, IP, and Optical Networks","awardID":"1405405","effectiveDate":"2014-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564819,564820,564821],"PO":["564993"]},"210807":{"abstract":"Today's Internet is significantly over-provisioned for a number of reasons, e.g., to absorb traffic bursts, to handle the extra (rerouted) load when failures occur, and for long-term traffic growth without frequent upgrades in the field. This overprovisioning adds significant capital costs to the Internet.<br\/><br\/>The ACTION project enables adaptation of the Internet to changing needs and demands by dynamically adjusting its \"optical highway\" capacities based on network resource utilization. The project name ACTION stands for \"Applications Coordinate through Transport Interfaces with Optical Networks,\" implying that the capacity of the Internet optical highways is a time-adjustable commodity, which can be intelligently controlled by the applications via specially designed interfaces. For example, part of the optical spectrum can be freed on highways with low traffic volume and either reassigned to other highways where needed or switched off to conserve energy. Such flexible highways are achieved by combining WDM (Wavelength Division Multiplexing) Flexible Grid technology in the metro-core with DSCM (Digital Subcarrier Multiplexing) technology in the campus\/access. The ACTION research activities will culminate in a final demonstration on the Japan Gigabit Network-extreme (JGN-X) test-bed.<br\/><br\/>The ACTION project will actively engage undergraduate students in Senior Thesis and Design Projects, recruit women and under-represented minorities by leveraging the UVA Center for Diversity in Engineering and the UTDallas long-standing relationship with CONACYT (National Council for Science and Technology of Mexico). Findings, documents, links to publications and software will be disseminated through a wiki-based Web site. All instructional materials developed will be made available at TeachEngineering.com.","title":"NeTS JUNO: Collaborative Research: ACTION: Applications Coordinating with Transport, IP, and Optical Networks","awardID":"1405171","effectiveDate":"2014-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564799],"PO":["564993"]},"209990":{"abstract":"The overarching goal of the project is to understand the power and limitations of algebraic computation, and the main foci are the problems of showing lower bounds for arithmetic circuits and polynomial identity testing. These problems have played a central role in various areas of Theoretical Computer Science, and they form the algebraic analog of the P vs NP question. This project will develop several new approaches and techniques for advancing our understanding of both questions. Algebraic techniques have also seen several unexpected connections in pseudorandomness and coding theory. The potential of these methods is still far from understood. In this project the PI will develop these methods, in particular the method of multiplicities and partial derivatives, to give more powerful lower bounds, and new strengthened constructions of pseudorandom objects. <br\/><br\/>The research direction proposed in this project brings together ideas and tools from a broad array of disciplines and witnesses a lot of fruitful interaction between mathematics, computational complexity, as well as practical applications to information storage and retrieval. The PI will disseminate research findings by giving lectures, talks and developing new courses and making the material available online. The PI will be actively involved in mentoring young researchers, including high school students and minorities, who want to pursue research in Theoretical Computer Science. The PI will also organize a specialized workshop for women in Theoretical Computer Science, which will bring together women researchers from all over the world.","title":"CAREER: New Directions in Arithmetic Computation","awardID":"1350572","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[562895],"PO":["565157"]},"209980":{"abstract":"Touchscreen interfaces are becoming increasingly prevalent as the interface with which people interact with computers and yet, for people with motor impairments, many touchscreen commands are difficult or impossible to execute. With the increased deployment of touchscreen interfaces, it becomes critically important for hardware and software developers to ensure that such devices are accessible to a broad range of users. While these challenges can be partially offset by multimodal (speech) input, touch and gesture remain necessary for fully functional, efficient, and socially acceptable use of many touchscreen devices. This is a serious concern for the almost 20 million people in the U.S. who have motor impairments that affect their upper body, a number that will only rise with the unprecedented increase in America's senior population.<br\/><br\/>This project pursues a research program to advance a fundamental understanding of how decreased motor ability impacts touchscreen interaction and, in turn, how touchscreen interactions can be personalized to support each user's abilities. While substantial user-interface-development effort has focused on personalizing content, personalized-interaction interfaces, such as to alter the means of issuing the taps, swipes, and clicks that underlie the use of touchscreen devices, have received much less attention. The increased use of touchscreens presents a tremendous opportunity for software-based modifications because the entire interactive surface is software-controlled, an advantage that this researcher has already leveraged to adapt touchscreen keyboards to how motor abilities for people without disabilities change in some situations such as while walking. This project goes far beyond this preliminary work to provide great benefits to people with permanent motor impairments.<br\/><br\/>The project consists of two complementary major activities. The first major activity employs large-scale studies to reliably assess and predict the impact of motor abilities on touchscreen interaction. By developing new methods to leverage user-generated content (e.g., videos, tweets) and by employing large-scale online experimentation, the large-scale studies will provide a more in-depth and ecologically valid characterization of how motor ability impacts touchscreen use than has been previously possible. The second major activity of the project builds on findings from the first major activity to design and evaluate new approaches for personalizing touchscreen interaction. The second activity will contribute new techniques for personalizing mobile interactions, generate new algorithms and predictive models of touchscreen performance, and identify design guidelines for personalizing mobile interaction.<br\/><br\/>Broader Impacts: This work will transform mobile accessibility for people with motor impairments. Enabling mobile access can lead to greater empowerment and independence for people with disabilities. Many of the proposed techniques will also likely benefit users more broadly. This work also has implications for the accessible design of the next generation of mobile devices, including wearables and 3D-gesture interfaces. Many of the techniques should be applicable in a commercial context, which is important to insure that new commercial interfaces are accessible to all users. Education plans include two courses related to accessibility, one of which establishes a partnership with the DC Public Library on touchscreen training for people with disabilities.","title":"CAREER: Scaling Up Mobile Accessibility Through Touchscreen Personalization","awardID":"1350438","effectiveDate":"2014-02-15","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562875],"PO":["565362"]},"209991":{"abstract":"Debugging is one of the most time consuming aspects of software development costing the economy billions of dollars annually. Any automation that reduces the manual effort involved in debugging can have a significant impact on software productivity. An integral part of all debugging activities is the task of fault localization. Once undesired behavior is spotted in a program, the actual defect has to be identified before a fix can be developed. Most existing fault localization techniques rely on the availability of high quality test suites, which limits their applicability. One promising alternative is techniques that statically analyze the faulty program fragment and do not rely on testing. The goal of this project is to develop practical static fault localization algorithms. If such algorithms were available, they would broaden the scope of programs to which automated debugging tools can be applied and enable the creation of novel tools that have the potential to change the way in which software is developed and maintained.<br\/><br\/>The main research hypothesis of this project is that practical static fault localization algorithms can be realized. To validate this hypothesis the PI will explore abstractions that conservatively over-approximate the behavior of faulty programs. The precision of these abstractions must be targeted so that the error-relevant portions of the program are preserved and the defect is precisely identified. The hypothesis that the construction of such targeted abstractions can be automated is supported by the observation that there exists a connection between fault localization and formal verification. The proposed work will explore new techniques and algorithms that leverage this connection. These algorithms will be implemented and evaluated in a static fault localization tool that will serve as a vehicle for studying advanced automated debugging techniques.","title":"CAREER: Abstracting Programs for Automated Debugging","awardID":"1350574","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562897],"PO":["565264"]},"209970":{"abstract":"Users of software are all too familiar with its shortcomings: software<br\/>is slow, software is buggy and software is insecure. When a complex<br\/>software system fails, it is unhelpfully simplistic to blame the<br\/>implementors of the system as incompetent. The truth is that software<br\/>engineers are uniquely disadvantaged among the traditional engineering<br\/>disciplines because they lack a viable predictive model for the<br\/>systems they design and build. That is, a software engineer cannot<br\/>predict the behavior of software in practice in the same way that a<br\/>civil engineer can predict the behavior of a bridge under load. The<br\/>primary intellectual merit of this research is that it lays the<br\/>critical, systematic foundations for the science of prediction for<br\/>software. The broader impacts are to enable engineers to build better<br\/>software with the aid of predictivity. Moreover, this research also<br\/>seeks to develop courses and educational material to train the next<br\/>generation of software engineers in the art of constructing fast,<br\/>safe, reliable and secure software in this fashion. As this research<br\/>transfers into practice and engineers adopt this methodology, it will<br\/>significantly strengthen the foundation of national<br\/>cyberinfrastructure.<br\/><br\/>The core technical thrust of this research is the development of a<br\/>systematic method for the synthesis of static analyzers for complex,<br\/>modern programming languages. It also explores whether or not this<br\/>methodology can be automated in whole or in part. To motivate the<br\/>development of this method, this research applies the method to the<br\/>synthesis of intensional static analyzers for popular scripting<br\/>languages such as JavaScript, Perl, PHP, Ruby and Python?many of which<br\/>happen to be the languages powering modern, web-based software. The<br\/>foundational technical concept of this research is the systematic<br\/>transformation of small-step interpreters into static analyzers.<br\/>Small-step analyzers promise unique advantages over traditional<br\/>techniques, including more opportunities for optimizing speed and<br\/>precision, and clearer, easier reasoning about the soundness of the<br\/>results of the analysis.","title":"CAREER: Static-Analysis-Driven Engineering of Modern Software Systems","awardID":"1350344","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["564587"],"PO":["564588"]},"209982":{"abstract":"With continuous advancements in the semiconductor industry, transistors with smaller than 20 nm feature size have enabled the integration of multi-billion transistors on a single die. A large proportion of the circuit blocks is either inactive or in a reduced-power state at any given time to satisfy the power and thermal constraints. This utilization wall has urged the semiconductor community to compromise the chip area and the speed of the circuit to reduce the overall power consumption. Despite the significant amount of research and growing necessity for a holistic power optimization technique, existing efforts to minimize power dissipation are typically not coherent and are disjointed into two pieces: i) the dynamic and static power loss at the load circuits is minimized or ii) the power loss during power-conversion is minimized. As a result, more than 32% of the overall power is dissipated during high-to-low voltage conversion before even reaching the load circuits in modern mobile platforms. Neither the preliminary works of the PI nor the previous studies present a holistic approach for the design and management of distributed on-chip power delivery and are of limited use to attain high overall voltage conversion efficiency and thermal-aware design.<br\/><br\/>The ultimate goal of this project is to revisit and fundamentally tailor the design and management of on-chip power delivery infrastructure. As compared to the conventional schemes where the power network is designed targeting the full utilization of the overall chip area, the proposed research will provide an adaptive power delivery infrastructure that is tailored to provide high voltage conversion efficiency during both fully-utilized and under-utilized modes of operation. Novel voltage regulation techniques and support circuits, physical design of power delivery networks, and power management schemes will be proposed. Specific emphasis will be placed on parallel voltage regulation and delivery where the allocation, size, and type of individual regulators are optimized synergistically considering various possible tradeoffs. Regulator-gating will be used specifically to: i) force individual voltage regulators to operate in their most power-efficient region, ii) spread the concentrated heat that causes local hotspots, and iii) turn on the voltage regulators close to the active circuits to reduce noise. The research component of this project has broad implications across all sub-areas of semiconductor-related research as power efficiency has become the primary bottleneck. The education component of this project will provide guidelines on how different teaching techniques can be integrated in undergraduate and graduate level courses to enhance the engineering education. The PI will promote the participation of women and underrepresented minorities in STEM fields and build strong ties with a local historically black college to increase the enrollment of underrepresented minorities at the University of South Florida's Electrical Engineering Department.","title":"CAREER: Regulator-Gating (ReGa): A New On-Chip Power Delivery Architecture","awardID":"1350451","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562879],"PO":["366560"]},"209993":{"abstract":"In modern signal processing, one is frequently faced with statistical inference problems involving massive datasets. For example, the experiments at the Large Hadron Collider at CERN generate hundreds of petabytes of data each year, which must be stored and processed efficiently in order to further our understanding of particle physics. Similar challenges also arise in seismic monitoring where massive amounts of data are acquired over large areas via cellphone accelerometers. Analyzing such large datasets is usually viewed as a substantial computational challenge. However, if data are a signal processor?s main resource then access to more data should be viewed as an asset rather than as a burden, and larger datasets should lead to a reduction in the runtime of data analysis algorithms.<br\/><br\/>This project blends concepts from computer science and from statistical signal processing to address the challenge with massive datasets by developing ?algorithm weakening? frameworks in which a data analysis procedure backs off to simpler methods as the data scale in size, leveraging the growing inferential strength of the data to ensure that a desired level of statistical accuracy is achieved with reduced runtime. The approach is concretely illustrated across a range of statistical estimation tasks, with convex relaxation techniques playing a prominent role as an algorithm weakening mechanism. In seeking a precise characterization of the computational and statistical tradeoffs obtained via convex relaxation, the investigator formalizes and studies new measures for characterizing the quality of approximation of one convex set by another. An interesting feature of this research is that convex relaxations which provide poor performance in combinatorial optimization problems may nonetheless yield useful solutions when employed in problems with inferential objectives.","title":"CAREER: Computational and Statistical Tradeoffs in Massive Data Analysis","awardID":"1350590","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[562901],"PO":["564898"]},"209994":{"abstract":"Technical Description:<br\/><br\/>Information signals are abundant in modern complex systems, and the encoding needed to provide security during communication and storage becomes one of many important security concerns. This research project will develop theory and technology for providing a critical degree of security to information signals, which will allow an engineer to optimize the tradeoff between the expense of security resources and the security guarantees that the system can provide. The underpinnings of this work are information theoretic in nature. The Pincipal Investigator has demonstrated the emergence of new theory for understanding partial secrecy.<br\/><br\/>Much of the focus in secure communication research is on mechanisms for providing security resources, usually in the form of a private authenticated channel or an authenticated secret key. This might be accomplished through cryptography, information theoretic physical layer security, or quantum key exchange. This project will address the question of how to efficiently use those resources to protect signals (source coding). Prior information theory literature on secure source coding typically either is limited to perfect secrecy or uses normalized mutual information as a metric for the level of secrecy provided. This project has two key innovations. First, privacy guarantees come in the form of limits on what an adversary can do with eavesdropped information. This is measured, for example, by average distortion or payoff guarantees, analogous to rate-distortion theory. Second, an adversary is assumed to independently obtain additional information about the signals in real time, to assist in their attack. These innovations have already lead to interesting theoretical discoveries as well as unusual encoding and stochastic decoding mechanisms for efficiently achieving secrecy.<br\/><br\/>The plan for this project involves investigating the theoretical implications of important practical constraints, such as delay in the communication, delay in the adversary's information, uncertainty about the information signal, complex signals, multi-user settings, etc. These theoretical results provide guidelines for how secrecy should be designed. To bridge theory to application, this project has two areas of emphasis. The first is a study of the use of cryptography as the security resource. This involves complexity analyses of the codecs used as well as a theoretical understanding of the consequences of differing types of resources (i.e., private channel vs. secret key). The second is the application of these technologies to secure distributed control.<br\/><br\/>Broader Significance and Importance:<br\/><br\/>Security is relevant to important societal infrastructure, such as energy, transportation, and communication networks. This project aims to fill an important gap in information theory and the understanding of digital communications. Although a rich mathematical theory for encoding and compression of information is known in the field, the security counterpart to this theory, which incorporates constraints on security resources, is conspicuously lacking. This project aims to provide new fundamental understanding to the field.<br\/><br\/>The educational component of this project will engage in the swelling movement of high quality and freely available education resources. Princeton University has recently partnered with Coursera, a non-profit organization that collaborates with research and education institutions to provide open (free) access to high quality education. This mode of teaching not only increases outreach but enables innovative teaching features through technology. The P.I. has engaged with Coursera to create an undergraduate signals and systems course. Additionally, he will create and teach graduate courses containing research discoveries from this project.<br\/><br\/>This funding will support Ph.D. students in their education and research. The P.I. has a track record of mentoring female students (two out of six current Ph.D students). Undergraduates are also incorporated into the discovery process through independent work mentoring.","title":"CAREER: Digital Encoding of Information Signals for Security with Limited Resources","awardID":"1350595","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[562903],"PO":["564924"]},"209962":{"abstract":"Wireless Sensor Networks (WSNs) are being envisioned to monitor health and vitals of the nation?s critical infrastructure, e.g. bridges, roads, and buildings. Other applications include monitoring remote space stations and off-earth structures, e.g. the inflatable lunar habitats. A significant challenge in making remote monitoring a reality is data collection from the sensors, as their batteries do not allow long-range transmission. This research enables data collection and inspection via Unmanned Aerial Vehicles (UAVs), invoking subsequent investigation in dynamic task allocation, distributed path planning, and collaborative navigation in GPS-denied\/indoor settings. In particular, this study develops the theoretical foundations for autonomous monitoring and inspection, where WSNs operate in a complete harmony with a network of UAVs. The WSN provides intelligible information to the UAVs for responsive and diagnostic actions; while the UAVs coordinate (and may also bring outside directives) to adapt the WSN to the environment and application demands.<br\/><br\/>To undertake this effort, this research casts the predominantly nonlinear UAV control, navigation, and planning problems in a completely linear framework. The linearity of the underlying dynamics builds upon some of the classical work in convex geometry and Euclidean metrics. Subsequently, the distributed control problem is formulated using structured systems theory, by which efficient graph-theoretic controllability and actuation methods are developed. These features play a significant role in establishing rigorous analytical arguments and in implementing a fully functional remote monitoring and inspection prototype. The transformative approach adapts to the application needs and is robust to imperfections in the underlying communication and environment uncertainties. The study further involves several outreach efforts via social coding platforms and workshops for minority, women in engineering, and K-12 students.","title":"CAREER: Smart Monitoring and Inspection with Unmanned Aerial Vehicles","awardID":"1350264","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[562838],"PO":["564898"]},"209995":{"abstract":"Social choice theory is the field that studies the aggregation of individual preferences toward a collective choice. While the artificial intelligence (AI) community has so far played a dominant role in the study of the computational aspects of social choice, the interaction between core AI paradigms and social choice theory has been surprisingly limited. <br\/><br\/>This project is enhancing the interaction between the two fields through a synthesis of social choice with the following AI areas: (i) decision making under uncertainty, by building on models studied in AI to create new ways to model, analyze, and make decisions in environments where preferences are dynamically changing; (ii) multiagent systems, by studying settings where agents randomly vote over multiple states, and investigating the connection between normative properties and system performance; and finally (iii) machine learning, by employing insights about strategic behavior under structured preferences, developed in the social choice literature, in order to design regression learning algorithms that discourage strategic manipulation.<br\/><br\/>An overarching goal of this project is to demonstrate the potential of social choice theory to AI researchers, and ultimately to establish social choice theory as a standard paradigm in AI. Equally importantly, this project is expected to increase the scope of social choice theory. Broader impacts include a new web-based voting system, which has the potential to serve and educate hundreds of thousands of users; dissemination through a new book on computational social choice; and a workshop on computational social choice, which will help set a new agenda for the field.","title":"CAREER: A Broad Synthesis of Artificial Intelligence and Social Choice","awardID":"1350598","effectiveDate":"2014-02-15","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[562905],"PO":["565035"]},"209985":{"abstract":"The influence that computers have on our daily lives is enabled by efficient algorithms. A vast body of research is devoted to algorithmic design, but we still cannot solve most of the important computational problems that arise in science and engineering. This is captured by the famous P vs NP problem in computational complexity, which is the most important mathematical problem of our times.<br\/><br\/>In this project, the PI describes a plan to address some of the challenges of computational complexity by exploring deep mathematical questions about algebraic and combinatorial structures and their applications to fundamental problems in computer science. Specifically, the focus of this proposal is on two mathematical themes: (1) low rank and combinatorial structure in matrices and (2) structure of low-degree polynomials. The unified view of the common mathematical framework allows us to relate techniques, results and problems between seemingly unrelated fields in computer science, such as: algorithm design, communication protocols, error correcting codes, de-randomization, and computational lower bounds. This research is also tightly related to some fundamental problems in mathematics, in particular in combinatorics and number theory.<br\/><br\/>The PI plans to organize interdisciplinary workshops that will bring together researchers in complexity theory and other disciplines in order to learn and collaborate. The educational plans are integrated with the research and include undergraduate and graduate course development, experimentation with innovative instructional approaches, in particular the flipped classroom, mentoring of students, and outreach to engage pre-college students from diverse socio-economic backgrounds.","title":"CAREER: Algebraic and Combinatorial Structures In Complexity Theory","awardID":"1350481","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[562885],"PO":["565157"]},"209997":{"abstract":"Researchers have predicted that, in the coming years, the computer industry?s steady gains in computing performance will slow and even cease all together because of a condition known as Dark Silicon. Dark Silicon is the result of an increase in power density that will make it necessary to leave sections of a microchip powered off. The consequences of Dark Silicon could be widespread, limiting the increasing benefits all aspects of society---from medicine, commerce to entertainment----have reaped from advances in computing. One solution is specialization. With the advent of high-level synthesis tools capable of generating circuits from high-level programming languages such as C, it is now possible to realize specialized accelerators for any application with 10-100x the efficiency of general purpose microprocessors. The computing industry needs new architecture paradigms to organize thousands of these accelerators. This project envisions the computing platform of the future as comprised of domain specific tiles, each with 10-100 specialized accelerators. The research team will advance this vision with innovations in two aspects. First, by inventing a new memory-interconnect subsystem capable of keeping these specialized cores fed with data. Second, canonical tiles will be invented for different application domains that can be studied by the wider research community.<br\/><br\/>The team will study memory-interconnect systems for tiles in a manner that recognizes the unique features of many-accelerator architectures: intermittent usage of accelerators, bursts of communication, and the need to share memory between specialized cores. While designing tiles of many-accelerators, the team will develop a new description language that describes the computation and communication capabilities of a tile and matches them with a graph representation of the workload. To provide broader impact, the tools, canonical designs, and models developed by this project will be made available to the wider research community to enable the study and eventual commercialization of specialized architectures. As increasing the technological literacy of the general public is essential to cultivating responsible behavior, the integrated educational plan focuses on all age groups: it reaches K-12 students through workshops and presentations; undergraduate and graduate students through research opportunities and course offerings; and the greater Philadelphia community.","title":"CAREER: Combating Dark Silicon through Specialization: Communication-Aware Tiled Many-Accelerator Architectures","awardID":"1350624","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562909],"PO":["366560"]},"210030":{"abstract":"The evolution of data storage in modern operating systems (OSes) brings challenges for fine-grained data protection. While traditional OSes offer simple, relatively low-level data abstractions -- files and directories -- modern operating systems, including Android and iOS, embed much higher-level abstractions, such as relational databases and object-relational models. The new abstractions complicate file structures and access patterns, greatly challenging existing protection systems, such as encrypted file systems, deniable file systems, antiviruses, and anomaly detectors, which, fallen behind the times, continue to operate at file level.<br\/><br\/>In this project, we are investigating new data protection abstractions that are better attuned to modern OSes. One example is a logical data object (LDO). An LDO corresponds to an application-specific resource -- such as an email, a document, or a bank account -- and includes all the data related to it, no matter how or where it is persisted (e.g., rows in databases, objects in object-relational models, files in the file system, etc.). Protection systems use LDOs to acquire rich semantics about the data to refine their effectiveness. Using LDOs, we are building HideIt, a fine-grained object hiding system that lets users select, through the familiar UIs of their unmodified applications, arbitrary objects -- such as individual emails, documents, bank accounts -- and hide or unhide them. By creating new, convenient protection abstractions, and teaching students and the broader community about them, we hope to promote a responsible approach to data management, in which users manage their data carefully, minimizing its exposure to attacks.","title":"CAREER: New Abstractions for Sensitive Data Management in Modern Operating Systems","awardID":"1351089","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[562977],"PO":["565327"]},"209987":{"abstract":"Visual matching is a fundamental problem in computer vision (CV) and intensive research efforts have been devoted to building correspondence between a pair of visual objects. By contrast, finding correspondence among an ensemble of objects remains challenging. This project develops a unified framework for this problem and to apply the framework to different applications. The research establishes a close correlation between the classical multi-dimensional assignment (MDA) problem and low-rank tensor approximation. Such correlation paves a way of using high-order tensor analysis for groupwise visual matching that assumes an MDA formulation. Along the way, a series of algorithms are developed to address challenging issues such as computational efficiency and context modeling. These algorithms are then deployed to different tasks including simultaneous tracking of multiple targets, tracking of deformable structures, and batch alignment of visual ensembles. <br\/><br\/>This project can generate broad impact on areas of computer vision, computer graphics, combinatorial optimization, oral and maxillofacial radiology, image-guided intervention, physical therapy, security and defense, education research, etc. On the one hand, the fundamental importance of visual matching makes the project transformative to many other CV problems. On the other hand, the project benefits a wide range of fields outside the CV community through the use of interdisciplinary applications as test beds. This project also integrates tightly research and education with highlights on supervising students from underrepresented groups, combining computer vision and education research, and involving undergraduates in research.","title":"CAREER: High-order Tensor Analysis for Groupwise Correspondence: Theory, Algorithms, and Applications","awardID":"1350521","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[562889],"PO":["564316"]},"210570":{"abstract":"One of the most severe and challenging threats to Internet security and privacy is phishing, which uses fake websites to steal users' online identities and sensitive information. Existing studies have evaluated younger users' susceptibility to phishing attacks, but have not paid sufficient attention to elderly users' susceptibility to phishing in realistic environments. As the elderly population in the United States and the world continues to grow rapidly, the elderly Internet user population also continues to grow, and seniors have become very attractive targets for online fraud. <br\/><br\/>Traditional forms of phishing have been prevalent for over a decade; in contrast, web single sign-on phishing is a more modern strategy, with unique characteristics that make it more profitable, insidious, and harder to detect than traditional phishing. The goal of this project is to systematically compare younger and older computer users' susceptibility to both the traditional and the newly emergent web single sign-on phishing. We build a comprehensive computer testbed that measures phishing susceptibility in a realistic environment. We hypothesize that older adults will differ from younger adults in terms of their susceptibility to both types of phishing, and that this susceptibility can be explained by differences in cognitive abilities, specifically executive functioning and decision-making skills. <br\/><br\/>The results of this project will advance our knowledge on how and why elderly users may fall victim to phishing, and will provide a solid basis for researchers to further design effective mechanisms to protect elderly users against phishing from both technical and cognitive perspectives.","title":"EAGER: Investigating Elderly Computer Users' Susceptibility to Phishing","awardID":"1359542","effectiveDate":"2014-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[564221,564222],"PO":[564223]},"209834":{"abstract":"With the advent of the world wide web and the resulting technologies such as social media, smart phones and sensor networks, the amount of data being collected has increased tremendously in recent years. Managing, storing, processing, analyzing and disseminating such massive amounts of data gives raise to many security and privacy challenges. To address these security and privacy challenges of managing and analyzing big data, an NSF Workshop on Big Data Security and Privacy has been proposed. Specifically, the workshop explores research topics including: policy management for big data; security and privacy for big data management and analytics; secure infrastructures and secure storage for big data; securing and analyzing massive networks; and big data analytics for security problems. The workshop participants are expected to be from academia, industry and government labs, consisting of interdisciplinary researchers in the fields of higher performance computing, systems, data management and analytics, cyber security, network science and policy and social sciences. They will come together and determine the strategic direction for big data security and privacy. Since research in big data security and privacy is of growing importance, this workshop is expected to have very high broader impacts.","title":"Big Data Security and Privacy Workshop","awardID":"1348558","effectiveDate":"2014-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[562519],"PO":["562974"]},"206766":{"abstract":"The problem of controlling biomechatronic systems, such as multiarticulating prosthetic hands, involves unique challenges in the science and engineering of Cyber Physical Systems (CPS), requiring integration between computational systems for recognizing human functional activity and intent and controlling prosthetic devices to interact with the physical world. Research on this problem has been limited by the difficulties in noninvasively acquiring robust biosignals that allow intuitive and reliable control of multiple degrees of freedom (DoF). The objective of this research is to investigate a new sensing paradigm based on ultrasonic imaging of dynamic muscle activity. The synergistic research plan will integrate novel imaging technologies, new computational methods for activity recognition and learning, and high-performance embedded computing to enable robust and intuitive control of dexterous prosthetic hands with multiple DoF. The interdisciplinary research team involves collaboration between biomedical engineers, electrical engineers and computer scientists. The specific aims are to: (1) research and develop spatio-temporal image analysis and pattern recognition algorithms to learn and predict different dexterous tasks based on sonographic patterns of muscle activity (2) develop a wearable image-based biosignal sensing system by integrating multiple ultrasound imaging sensors with a low-power heterogeneous multicore embedded processor and (3) perform experiments to evaluate the real-time control of a prosthetic hand.<br\/>The proposed research methods are broadly applicable to assistive technologies where physical systems, computational frameworks and low-power embedded computing serve to augment human activities or to replace lost functionality. The research will advance CPS science and engineering through integration of portable sensors for image-based sensing of complex adaptive physical phenomena such as dynamic neuromuscular activity, and real-time sophisticated image understanding algorithms to interpret such phenomena running on low-power high performance embedded systems. The technological advances would enable practical wearable image-based biosensing, with applications in healthcare, and the computational methods would be broadly applicable to problems involving activity recognition from spatiotemporal image data, such as surveillance.<br\/><br\/>This research will have societal impacts as well as train students in interdisciplinary methods relevant to CPS. About 1.6 million Americans live with amputations that significantly affect activities of daily living. The proposed project has the long-term potential to significantly improve functionality of upper extremity prostheses, improve quality of life of amputees, and increase the acceptance of prosthetic limbs. This research could also facilitate intelligent assistive devices for more targeted neurorehabilitation of stroke victims. This project will provide immersive interdisciplinary CPS-relevant training for graduate and undergraduate students to integrate computational methods with imaging, processor architectures, human functional activity and artificial devices for solving challenging public health problems. A strong emphasis will be placed on involving undergraduate students in research as part of structured programs at our institution. The research team will involve students with disabilities in research activities by leveraging an ongoing NSF-funded project. Bioengineering training activities will be part of a newly developed undergraduate curriculum and a graduate curriculum under development.<br\/><br\/>The synergistic research plan has been designed to advance CPS science and engineering through the development of new computational methods for dynamic activity recognition and learning from image sequences, development of novel wearable imaging technologies including high-performance embedded computing, and real-time control of a physical system. The specific aims are to: <br\/>(1) Research and develop spatio-temporal image analysis and pattern recognition algorithms to learn and predict different dexterous tasks based on sonographic patterns of muscle activity. The first aim has three subtasks designed to collect, analyze and understand image sequences associated with functional tasks. (2) Develop a wearable image-based biosignal sensing system by integrating multiple ultrasound imaging sensors with a low-power heterogeneous multicore embedded processor. The second aim has two subtasks designed to integrate wearable imaging sensors with a real-time computational platform. (3) Perform experiments to evaluate the real-time control of a prosthetic hand. The third aim will integrate the wearable image acquisition system developed in Aim 2, and the image understanding algorithms developed in Aim 1, for real-time evaluation of the control of a prosthetic hand interacting with a virtual reality environment.<br\/><br\/>Successful completion of these","title":"CPS: Synergy: A Novel Biomechatronic Interface Based on Wearable Dynamic Imaging Sensors","awardID":"1329829","effectiveDate":"2014-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[553609,553610,"565089",553612],"PO":["565136"]},"209956":{"abstract":"Types are a structure imposed upon programming languages. As with any structure, types offer useful support, but they also impose restrictions. As such, different communities have adopted types to different degrees. This provides programmers with a wealth of options, each with their own tradeoffs. Unfortunately this diversity proves problematic when programs written in different languages need to interact. The intellectual merit of this project is a principled form for gradual typing for mixing typed and untyped code together while retaining compatibility with expectations and methodologies of industry developers. In particular, we focus on mixing statically-typed object-oriented languages using generics and variance with dynamically-typed structural object-oriented languages. The latter class includes major languages like Java, C#, and Scala, whereas the former includes JavaScript, Python, and PHP.<br\/><br\/>In addition to improving the language resources for developing web technologies, the broader impact of this project also includes a plan for exploiting those technologies in order to provide an entirely online interactive program-development environment targeted towards building interactive web pages. The intent is to make programming engaging and accessible to interested individuals who solely have access to a modern web browser. In addition to improving accessibility, this educational platform, along with our industry collaborations, will help with widespread adoption of the technologies we develop.","title":"CAREER: Gradual Typing for Industry Programming","awardID":"1350182","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[562826],"PO":["564588"]},"210022":{"abstract":"U.S. economic growth, energy security, and environmental stewardship<br\/>depend on a sustainable energy policy that promotes conservation,<br\/>efficiency, and electrification across all major sectors. Buildings<br\/>are the largest sector and therefore an attractive target of these<br\/>efforts: current Federal sustainability goals mandate that 50% of U.S.<br\/>commercial buildings become net-zero energy by 2050. A range of<br\/>options exists to achieve this goal, but financial concerns require a<br\/>data-driven, empirically-validated approach. However, critical gaps<br\/>exist in the energy and water measurement technology, and indoor<br\/>climate control science, needed to benchmark competing options,<br\/>prioritize efficiency investments, and ensure occupant comfort.<br\/><br\/>To address these challenges, this project proposes a new kind of<br\/>\"peel-and-stick\" sensor that can be affixed to everyday objects to<br\/>infer their contributions to whole-building resource consumption. To<br\/>use the sensors, occupants or building managers simply tag end loads<br\/>like a ceiling light, shower head, or range top. The sensors monitor<br\/>the ambient conditions around a load and, using statistical methods,<br\/>correlate those conditions with readings from existing electricity,<br\/>gas, or water meters, providing individual estimates without intrusive<br\/>metering. The sensors are built from integrated circuit technology<br\/>laminated into smart labels, so they are small, inexpensive, and<br\/>easy-to-deploy. The sensors are powered by the same ambient signals<br\/>they sense, eliminating the need for periodic battery replacement or<br\/>wall power. Collectively, these properties address cost and coverage<br\/>challenges, and enable scalable deployment and widespread adoption.<br\/><br\/>The intellectual merit of this proposal stems from the insight that<br\/>the transfer and use of energy (and other resources) usually emits<br\/>energy, often in a different domain, and that this emitted energy is<br\/>often enough to intermittently power simple, energy-harvesting sensors<br\/>whose duty cycle is proportional to the energy being transferred or<br\/>used. Hence, the mere activation rate of the sensors signals the<br\/>underlying energy use. The power-proportional relationship between<br\/>usage activity and side channel harvesting, when coupled with<br\/>state-of-the art, millimeter-scale, nano-power chips and whole-house<br\/>or panel-level meters, enables small and inexpensive sensor tags that<br\/>are pervasively distributed with unbounded lifetimes. But, networking<br\/>and tasking them, and making sense of their data, requires a<br\/>fundamental rethinking of low-power communications, control, and data<br\/>fusion to abstract the intermittent, unreliable, and noisy sensor<br\/>infrastructure into actionable information.<br\/><br\/>This project's broader impact stems from an integrated program of<br\/>education, research, and outreach that (i) creates a smart objects<br\/>focused curriculum whose classroom projects are motivated by research<br\/>needs, (ii) provides research experiences for undergraduates and<br\/>underrepresented minorities, (iii) mentors students on all aspects of<br\/>successful research from articulating hypotheses to peer-reviewing<br\/>papers, (iv) disseminates teaching materials on embedded systems and<br\/>research pedagogy, (v) produces students who bridge disciplines,<br\/>operating at the intersection of measurement science, information<br\/>technology, and sustainability policy, and (vi) translates scientific<br\/>discovery and technical knowledge into beneficial commercial products<br\/>through industry outreach and internships, and (vii) engages with the<br\/>National Labs to ensure that the research addresses pressing problems.","title":"CAREER: Scalable Sensor Infrastructure for Sustainably Managing the Built Environment","awardID":"1350967","effectiveDate":"2014-02-01","expirationDate":"2019-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[562959],"PO":["565136"]}}