{"77709":{"abstract":"Advances in network and middleware technologies have brought computing with many widely-distributed and heterogeneous resources to the forefront, both in the context of Grid Computing and of Internet Computing. These large distributed platforms allow scientists to solve problems at an unprecedented scale and\/or at greatly reduced cost. The high level goal of this work is to further the development of software methodologies and algorithms to enable scientists,<br\/>engineers and others to use large heterogeneous distributed systems.<br\/><br\/>Application domains that can readily benefit from such platforms are many; they include computational neuroscience, factoring large numbers, genomics, volume rendering, protein docking, or even searching for extra-terrestrial life. Indeed, those applications are characterized by large numbers of independent tasks, which makes it possible to deploy them on distributed platforms with high network latencies. More specifically, in this work we assume that all application data initially resides in a single repository, and that the time required to transfer that data is a significant factor. Efficiently managing the resulting computation is a difficult and challenging problem, given the heterogeneous and typically dynamic attributes of the underlying components. Such an approach allows for adaptivity and scalability, since decisions and changes can be made locally. <br\/>This approach is particularly effective for scheduling in environments that are heterogenous, dynamic, and unstructured, such as global and peer-to-peer computing platforms consisting mostly of home PC's.<br\/><br\/>This research develops a simple yet general computation and communication model for Grid and Internet platforms, and autonomous and decentralized scheduling techniques based on this model. It analyzes the optimality of these techniques in terms of steady-state and overall application performance. Further, it encorporates adaptability and fault-tolerance, and evaluates the resulting techniques by both simulating and running real applications on actual testbeds. Its overall impact to the scientific community is to enable scientists to solve important classes of problems faster and in a more cost-effective fashion.","title":"SOFTWARE: Autonomous Scheduling on Large Distributed Systems","awardID":"0234233","effectiveDate":"2003-02-15","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["481145","218864","397101"],"PO":["565272"]},"81826":{"abstract":"Grids are evolving towards supporting a dynamic, collaborative, multidisciplenary problem-solving environment coined the virtual organization (VO). To date, adaptivity has been treated in an ad-hoc fashion leading to application-specific solutions that cannot be reused. In this proposal, a framework for exposing, exploiting, and coping with adaptivity in Grids is proposed. The key elements of this framework are the definition of OGSA-compliant adaptive Grid service classes for high-end services common to parallel\/distributed scientific computing as well as adaptive resource provider services. To ease the implementation of adaptive Grid services, reusable middleware will be designed as part of this project. This next-generation middleware addresses four fundamental issues required to construct adaptive services: <br\/>(1) adaptive service interfaces,<br\/>(2) dynamic performance prediction,<br\/>(3) adaptive resource management, and <br\/>(4) adaptive run-time infrastructure for MPI. Several novel approaches are proposed including algorithms for dynamically selecting performance estimators as well as selecting resource management strategies.","title":"NGS: A Framework for Dynamic Service Adaptation in the Grid","awardID":"0305641","effectiveDate":"2003-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["543508"],"PO":["551712"]},"80906":{"abstract":"ABSTRACT<br\/>0301666<br\/>JOHN J. WILD<br\/>ELLEN L. WILD <br\/><br\/>It is proposed to finalize development, construction, testing and evaluation of the tentative prototype of a novel system for mapping from the surface ectopic foci within pleomorphic soft tissues. The research will produce an entirely distinctive approach to scanning, detecting, and characterizing the presence of abnormal foci in soft tissues. The proposed system is expected to provide far more accurate, numerical, objective characterization of soft cellular tissues as compared to that of extant leading technologies.","title":"Integrated System for the Detection of Differential Sonic Energy Reflection by Soft Tissues","awardID":"0301666","effectiveDate":"2003-02-01","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[210648],"PO":["564898"]},"78480":{"abstract":"The goal of this project is the automated reconstruction of highly accurate photorealistic descriptions of large-scale 3D scenes with a minimum of human interaction and increased computational efficiency. Recent developments in laser-range sensing technology make possible the acquisition of accurate 3D scans of large-scale scenes. Dense and complex 3D range data-sets along with high resolution color imagery (ground and aerial-based) will be utilized. Research will be carried in the areas of range segmentation (in order to handle the geometric complexity), automatic registration between range and 2D images, 3D modeling, fusion of aerial photography, and visualization. The proposed research is going to directly affect applications in the areas of urban planning, urban design, disaster prevention, electronic journalism, architecture, archeology, historical preservation, and entertainment. The novel solutions that will be developed will have a direct effect on the educational agenda of the PI and on his outreach activities. The cross-fertilization between Computer Science, Geography, and Film and Media departments is another priority. Finally, collaboration with institutions such as museums, and with companies concentrated on 3D site modeling and site construction is an essential step for forwarding this research out of the academic environment.","title":"CAREER: Photorealistic 3-D Modeling of Large-Scale Scenes: Integration of 3-D Range and 2-D Intensity Sensing in a Complete System","awardID":"0237878","effectiveDate":"2003-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["409474"],"PO":["564318"]},"78450":{"abstract":"ABSTRACT<br\/>0237727<br\/>Aylin Yener<br\/>Pennsylvania State University- Univ. Park<br\/><br\/>The importance of wireless access is ever increasing. The wide social impact of becoming tetherless ranges from providing constant reachability in emergency situations; to providing better educational services in schools with wireless network access. Future wireless systems are expected to provide much higher capacity due to emerging applications that demand data oriented and multimedia communications services. This research involves the exploration of attainable performance limits of wireless communication systems. The scarcity of wireless bandwidth dictates that future systems must utilize multiple antennas in addition to temporal and frequency resources. The premise of this research is that a significant improvement in wireless system capacity can be achieved by designing transmitters and receivers that jointly optimize all system resources.<br\/><br\/>The investigator considers interference limited multiuser wireless communication systems where users ``share'' the transmission medium in a non-partitioned manner. The signal processing framework developed is for a most general shared channel where multiple transmit and receive antennas are used, code division grants sharing of time and frequency resources, and multiple data streams are transmitted per user. The<br\/>focus is on understanding the performance limits under different channel\/system constraints as well as methods that achieve these limits. The research issues considered include: characterization of the maximum number of users that can be supported when jointly optimum temporal-spatial transmission and temporal-spatial reception techniques are employed; characterization of the optimum transmitters<br\/>(and receivers) and design and analysis of algorithms that converge to these transmitters (and the corresponding receivers); investigation of the robustness of the techniques and results under different channel\/system conditions as well as when partial\/inaccurate information is available about these conditions; implementation of the resulting algorithms on a wireless testbed.","title":"CAREER: Signal Processing for Multiuser Multiantenna Wireless Communications","awardID":"0237727","effectiveDate":"2003-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550356"],"PO":["564898"]},"78472":{"abstract":"Semiconductor technologies exhibited explosive growth in complexity and speed over the last two decades. Since the early 1980s, the operating frequencies have increased from a few megahertz to several gigahertz and the operating frequencies of leading microprocessors are expected to exceed 10 gigahertz in few years. Also, the spacing between devices and interconnect have dramatically decreased due to the continuous scaling down of the technology feature size. These trends have led to issues and challenges in the design and analysis of high performance integrated circuits that previous generations did not exhibit. Most of these issues are at the circuit and interconnect (physical) levels. Also, these issues are expected only to increase in importance in future generations of integrated circuits since frequencies and device densities will only increase. <br\/> This project involves a five-year plan to develop rigorous research among many of these high-performance deep submicrometer issues, which is necessary for correctly designing future generations of integrated circuits with operating frequencies in excess of ten gigahertz. This research is also directly applicable to many emerging technologies and nanotechnologies due to the common issues at such high frequencies. This research specifically investigates the following issues: 1-Increased coupling and crosstalk noise, 2- Frequency dependent interconnect models, 3- High temperature effects on the performance of integrated circuits and the reliability of interconnect, and 4-Physical design techniques including noise and power as parameters. <br\/> As part of this effort, the education plan aims at creating a dynamic curriculum that copes with the advances in the VLSI field, since the VLSI field is one of the fastest changing areas of knowledge. Another goal of this education plan is to increase and stress intuitive understanding in VLSI education which is necessary for efficient problem solving and innovation. Another primary goal of the education plan is to encourage collaboration between industry and academia via internships and industrial research partners.","title":"CAREER: Investigating Circuit and Physical Level Issues in High-Performance Deep Submicrometer Circuits","awardID":"0237822","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["293032"],"PO":["562984"]},"78441":{"abstract":"This project aims to enable multiple intelligent agents to learn to act both individually and in coordination with one another towards individual and\/or common goals in real-time, noisy, collaborative and adversarial environments. The approach taken will be to study complete agents in specific, complex environments, with the goal of drawing general lessons from the specific implementations. Fundamental research will be conducted in four main areas. First, multiagent reinforcement learning will be scaled up to handle larger and more complex problems than has been previously possible. Second, new state representations suitable for learning will be proposed and<br\/>tested. Third, game theoretic approaches to improving agent performance by predicting the responses of other agents will be investigated. Fourth, strategies for learning autonomous bidding<br\/>agents will be developed and tested. Application domains will include: robotic soccer, both in simulation and with real robots; and autonomous bidding agents in multiple realistic scenarios.<br\/>The rich simulation environments to be used for this research are ideal substrates for teaching students about complete intelligent agents, including perception, cognition, and action. The educational goals of this project include leveraging the appeal of these domains to students into challenging, exciting, and instructive undergraduate and graduate courses.","title":"CAREER: Learning Agents in Dynamic, Collaborative, and Adversarial Multiagent Environments","awardID":"0237699","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["553684"],"PO":["564456"]},"76683":{"abstract":"Abstract<br\/><br\/>Proposal : IIS-0229808<br\/>Institution: Michigan State University<br\/>PI: Mark Kornbluh<br\/><br\/><br\/>This project, proposes to advance methods of higher-level analysis of diigital spoken word repositories. Starting with a rich collection of digitized audio resources, associated texts and images, and a set of integrated online annotation tools, the project will build integrated tools aimed at overcoming the lengthy and repetitive search and browse activity associiated with the use of such archives. The poject willl also test the benefits to undergraduate learning of integrating the new resources into courses at the undergraduate level by measuring the effects of such indicators as the pace of content introduction and retention, and gains in aural literacy. The IT research is primarily concerned with integration of existing technologies into custom tool kits for online learning environments. This is a collaborative effort of Michigan State University, Northwestern University and Glasgow Caledonian University in partnership with the National Archives and Records Adminiistration and the BBC-Information & Archives.","title":"The Spoken Word: New Resources for Teaching and Learning","awardID":"0229808","effectiveDate":"2003-02-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["497354","281302","281301"],"PO":["565136"]},"78421":{"abstract":"The overall objectives of this project are to (1) create more effective pedagogical agents by incorporating novel methods of figure animation into them, and (2) rigorously assess the performance of these agents in K-12 classrooms. The research is divided into two components. The first component will develop and integrate a system for stylistically variable low-level motion specification, both full-bodied and facial, into the high-level cognitive components of a pedagogical agent. The particular pedagogical agent that will serve as the research infrastructure is called a ``teachable agent.'' The second component of the research will deploy the system in K-12 classrooms as each stage is developed, and conduct controlled multi-method studies to assess the influence of the animated agent on learning-related outcomes. The significance of the proposed work is its potential to improve the education of children, particularly in the domain of science. Additionally, controlled studies on the value of animated pedagogical agents in the area of K-12 education are rare. These studies should further the scientific understanding of the components<br\/>of compelling animation, and result in a broader understanding of the proper role of graphics and animation in learning systems. An interdisciplinary course in computer science and education is being co-developed for the web and will be co-taught with faculty from the field of education. Finally, by introducing education as an important application of graphics and animation, the plan is to broaden the appeal of computer science to those who are traditionally under-represented.","title":"CAREER: Implementing and Assessing Human Animation in Pedagogical Agents","awardID":"0237621","effectiveDate":"2003-02-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["486038"],"PO":["564456"]},"78542":{"abstract":"The performance, cost, and power requirements of future applications will strain the incumbent sequential processing models. Simultaneously, implementation trends point towards partitioned (rather than monolithic) designs. Correctness-performance partitioning (CPP) is a promising approach that exploits partitioning while accommodating existing sequential software. CPP divides execution responsibilities among multiple processing partitions. The correctness (C) partition produces the sequential instruction stream expected by the programmer and inter-operating applications. One or more optional performance (P) partitions accelerate the C-partition by warming up its caches and supplying it with pre-computed values. With minimal performance responsibilities, C-partitions can be simple, compatible, and reusable. With<br\/>no correctness requirements, P-partitions can be simple, powerful, and efficient. C and P partitions can be composed to form efficient designs for different processing niches. A single C-partition can be used in isolation (or with a simple P-partition) as a power-conscious embedded processor. Multiple C and P partitions can be combined to create a high-performance server processor. The CPP approach simplifies both software and hardware development.<br\/><br\/>Two instances of CPP have been previously studied. We have developed a new value-communication mechanism that enables others. We will explore the theoretical aspects of CPP and the practical implications of promising schemes.","title":"CAREER: Correctness-Performance Partitioned (CPP) Architectures","awardID":"0238203","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["451152"],"PO":["550859"]},"78553":{"abstract":"Advances in robotics and computer-based technology have enabled complex work to be performed via remote control, such as in minimally invasive surgery (MIS). The long-term goals of this research are to improve the development and integration of robotic technology into surgical practices and the training of surgical skills in MIS, which will have a significant impact on patient safety and healthcare delivery. The specific aims are to 1) study the effects of robotic technology on the surgical process in MIS, 2) develop methodologies for analyzing complex surgical processes in MIS, and metrics for assessing technology and surgeon performance in MIS, 3) design effective interfaces and informational aids to enhance surgeons' performance, 4) support the training of surgeons in MIS with modular computer-based training tools, 5) contribute to the theoretical understanding of human performance and error remediation in dynamic remote environments, 6) develop and promote the interdisciplinary approach to complex systems analysis and design in graduate and undergraduate curriculum, using the proposed research activities as course material for realistic case-based problem-solving exercises, 7) develop and promote hands-on learning through project related research activities in undergraduate education, and 8) train successful research scientists and human factors engineers through teaching and mentoring activities.","title":"CAREER: Adapting to technology in minimally invasive surgery","awardID":"0238284","effectiveDate":"2003-02-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[204737],"PO":["564456"]},"79411":{"abstract":"Proposal 0242218<br\/>Group Travel Grant to 2003 IEEE International Conference on Robotics and Automation<br\/>PI: Yuan Zheng<br\/>Ohio State University<br\/><br\/>The annual IEEE International Conference on Robotics and Automation (ICRA), sponsored by the IEEE Robotics and Automation Society, is the best event in terms of quality and quantity in the areas of robotics and automation, and has served as a forum gathering international researchers for presentation and discussion of emerging technologies. This project is to support about 45 U.S. researchers to participate in the 2003 ICRA that will be held in Taipei, Taiwan, May 12-17, 2003. The primary objective is to help U.S. researchers participate in this key international conference, who could not otherwise attend the Conference. U.S. researchers will maintain a highly competitive position in research by presenting research results, discussion, and exchange information with researchers from all over the world. This project strongly supports minority group researchers and students who would need financial support for their participation in the 2003 ICRA.","title":"Group Travel Grant to 2003 IEEE International Conference on Robotics and Automation","awardID":"0242218","effectiveDate":"2003-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["518511"],"PO":["335186"]},"76265":{"abstract":"Proposal : IIS-0228012<br\/>Institution: Carnegie Mellon University<br\/>PI: Jamie Callan<br\/><br\/><br\/>The proposal requests travel expenses for US researchers to participate in a US-EU\/DELOS working group on \"Personalisation and Recommender Systems in Digital Libraries.\" The working group will meet over the next year to discuss and evaluate fruitful joint activities and research paths for collaborative activities in this general topical area.<br\/>This working group continues the planning and research agenda initiated by an earlier workshop , the Joint DELOS-NSF Workshop on Personalisation and Recommender Systems in Digital Libraries held at Dublin City University, Ireland, June 18-20, 2001. http:\/\/la.lti.cs.cmu.edu\/callan\/Workshops\/delos01\/cfp2.html. Prior research on personalisation and recommender systems was primarily in the context of commercial environments with a limited set of goals. This planning activity is meant to help develop a broader research agenda in environments such as academic and research libraries with the goal of broadening the overall beneficial impact of these technologies.","title":"Travel Support for DELOS\/NSF Working Group on Personalisation and Recommender Systems in Digital Libraries","awardID":"0228012","effectiveDate":"2003-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["541869"],"PO":["564456"]},"78587":{"abstract":"The research supported by this five-year continuing award will attempt to improve the quality and reliability of automatic (\"machine\") translation between human languages. Although automatic translation services abound on the Web, they are more often a source of entertainment than a source of useful information. Real advances in this technology can promote communication and understanding between people from different cultures, and grease the wheels of international commerce.<br\/><br\/>The main vehicle for this research will be a new formalism called Structured Models of Translational Equivalence (SMoTEs). SMoTEs express the translational equivalence relation between the linguistic structures of two or more languages. SMoTEs combine the best of the rationalist and empiricist approaches to building machine translation systems. They are induced from real data, for broad coverage, for graceful degradation, and for rapid adaptation to new domains. Yet, unlike existing statistical translation models, SMoTEs explicitly represent the structures hidden in linguistic data. By modeling linguistic structure, SMoTEs can capture important linguistic generalizations that enable them to make more accurate predictions in a wider variety of contexts. SMoTEs are based on a new class of formal grammars, which is a multidimensional generalization of some well-understood existing classes of grammars. The connection between the formal foundations of SMoTEs and the formal foundations of much previous research lays the groundwork for adopting many current and future monolingual techniques, such as parsing and grammar factoring, in the service of multilingual applications. Thus, SMoTEs have the potential to become a catalyst for rapid progress in machine translation.<br\/><br\/>Long-term progress in machine translation will depend on future generations of language researchers and engineers. For this purpose, an ambitious educational program will complement the research supported by this award. The centerpiece of this program will be several new courses in language engineering at NYU's Department of Computer Science. Other educational goals include the creation of a machine translation research group, and expanded community outreach through the New York City NLP Forum.","title":"CARRER: Empirical Methods for Machine Translation","awardID":"0238406","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["250539"],"PO":["565215"]},"81052":{"abstract":"EIA-0302353<br\/>Hsinchun Chen<br\/>University of Arizona<br\/><br\/>DGPort: Intelligent Web Searching for Digital Government Research<br\/><br\/>This Small Grant for Exploratory Research will support exploration of the use of automated agents, or spiders, to gather web material related to the topic of digital government, and to explore the results of the agent's efforts in new ways to support analysis and knowledge discovery. Since the topic of digital government is quite broad, this work presents a stiff challenge, but with a potentially large payoff. The PI will work with several current grantees of the NSF Digital Government Research Program.","title":"SGER: DGPort: Intelligent Web Searching for Digital Government Research","awardID":"0302353","effectiveDate":"2003-02-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["548216"],"PO":["371077"]},"78401":{"abstract":"The long term goal of this research problem is to tackle these problems. The proposed project is to develop automatic visual 3D modeling approaches that can deal with objects, people and complete environments, including complex shapes, reflectances and non-rigid motions. The resulting models should make it possible to render new images, possibly with different lighting, and to perform 3D measurements, opening up a wide range of applications. An important aspect will consist of also recovering camera motion and calibration during acquisition. <br\/><br\/>More specifically the research will address the following topics: (1) removing limitations of existing approaches and increase flexibility and speed, (2) extension from static to dynamic scenes using single and multi-camera approaches, (3) extension towards capturing complete (immersive) environments using standard and\/or panoramic cameras and (4) extensions towards recovering more complex reflectance properties and disentangling reflectance and illumination. This research will be developed towards making it possible to simply capture the appearance of real objects, people and environments, adapt some properties if necessary (e.g. pose, lighting) and then seamlessly (re)combine different real and virtual scene elements. <br\/><br\/>The educational component forms an integral part of this project. Existing courses will be further enhanced and additional courses will be developed to provide a complete computer vision course offering. Important aspect will be to ensure integration and complementarity with the computer graphics courses provided within the department and to closely link courses and research. To ensure a broader dissemination, I intend to publish a book and to organize courses at specialized conferences as well as to provide application results for exhibits open to the broader public.","title":"CAREER: Visual 3D Acquisition, Modeling and Rendering of the Real World","awardID":"0237533","effectiveDate":"2003-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["218101"],"PO":["564318"]},"78599":{"abstract":"The VLSI design productivity crisis, that is, the fact that the number of<br\/>available transistors grows much faster than the ability to design them<br\/>meaningfully, has become the greatest threat to the growth of semiconductor<br\/>industry. Silicon complexity, which refers to the impact of previously <br\/>ignorable physical phenomena, is at the center of this crisis. Based on our beliefs that<br\/>the only effective way to improve productivity is to maintain design complexity<br\/>at a manageable level, and that formal methods are the right techniques for<br\/>complexity control, the objective of this research is to improve design<br\/>productivity by applying formal methods to silicon complexity problems such as<br\/>inductive\/capacitive couplings and process variabilities.<br\/><br\/>The research develops methodology, models, and algorithms to handle silicon<br\/>complexity through the application of formal methods. By treating timing <br\/>analysis as extracting semantics of a circuit, a timing analysis system is developed <br\/>that handles both inductive and capacitive coupling delay variations. The system<br\/>develops and uses a range of inductive coupling models with different accuracy<br\/>and complexity. Based on that, timing macromodels for coupling delays are <br\/>created for library characterization and IP specification. Clock scheduling and <br\/>retiming algorithms are developed to separate signal switching times for coupling delay<br\/>optimization. Signal switching time information is also explored in routing and<br\/>placement to minimize coupling between sensitive wires. For process <br\/>variability, statistical models are developed and combined into the timing analysis <br\/>system to compute the statistical performance of a circuit, and stochastic <br\/>optimization is used to optimize the statistical performance. The integrated education <br\/>activities aim at two aspects of computer engineering education: 1) educating students in<br\/>formal methods, especially their applications to nanometer VLSI design, thus<br\/>bringing needed mathematical rigor into the discipline; 2) introducing students<br\/>to silicon complexity and its impacts on VLSI design so that they are equipped<br\/>with necessary background for modern high performance VLSI design.","title":"CAREER: Formal Methods for Silicon Complexity in Nanometer VLSI Design","awardID":"0238484","effectiveDate":"2003-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485312"],"PO":["562984"]},"81152":{"abstract":"DIMACS, the Center for Discrete Mathematics and Theoretical Computer Science, will run a workshop entitled \"Software Security.\" The workshop is aimed at providing leadership to the field of information security by bringing together in a single forum experts from a variety of relevant fields to assess the current state of the art, identify research needs, and establish directions for collaborative future work. The workshop will investigate building secure software, including topics such as software risk managment, programming languages and platforms, auditing software, design for security, security flaws, and testing for security. The workshop will also investigate application security, including topics such as sandboxing code, protection against malicious code, locking down executables, monitoring programs as they run, enforcing software use policy with technology, and dealing with extensible systems.","title":"DIMACS Workshop on Software Security","awardID":"0302708","effectiveDate":"2003-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}}],"PIcoPI":["264120"],"PO":["529429"]},"77731":{"abstract":"Modern science is an increasingly distributed enterprise, particularly when addressing challenging scientific problems with multidisciplinary researchteams, where team members are routinely assembled from multiple universities,the national labs, and industry participants. A problem pervasive to suchdistributed endeavors is the need to efficiently share scientific data across<br\/>multiple teams, sites, applications, and machines. <br\/><br\/>This project's focus is on the ability to represent such data so that it is easily shared across research teams that each use their own, well-defined and domain-specific data representations. S(cientific)-XML is a suite of tools that translate user-friendly XML-based meta-information about shared data to\/from the application-specific, efficient, binary-based data structure descriptions used by high performance scientific codes. With S-XML, end users can conveniently express and view their structured data, but all data manipulation and exchanges are performed using efficient binary data representations. Complementing these tools is the XML-ECho adaptive XML-conscious peer-to-peer communication infrastructure, which implements the wide-area exchange of the large-scale binary data used in scientific collaborations.<br\/><br\/>This middleware uses runtime adaptation to dynamically adjust its data transport and manipulation actions to meet application-level quality of service needs. Specifically, via XML-based descriptions of data structure, end users can dynamically express and alter interest expression that state what data is most important to them and should therefore, be transported preferentially.<br\/><br\/>The resulting Adaptive-XML tools and data exchange middleware will enable<br\/>effective collaboration in scientific endeavors that remain infeasible with today's technologies, a concrete example being the Terascale Supernova Initiative now being undertaken by a large research team distributed across U.S. universities and national labs. Project outcomes will also benefit U.S. corporations, as evident from our discussions with companies like Schlumberger and also from the deployment of some of our technologies in industry testbed (e.g., at Delta Air Lines).","title":"SOFTWARE: Adaptive-XML: Tools for Collaborative Network Computing","awardID":"0234323","effectiveDate":"2003-02-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["523077","532971","501621","501622"],"PO":["565272"]},"78402":{"abstract":"Power is becoming increasingly as important, if not more important than <br\/>performance in many digital systems ranging from PCs and servers to <br\/>Internet routers and embedded systems-on-a-chip. While there has been <br\/>substantial research exploring the power efficiency of the processing <br\/>and memory elements of digital systems, research investigating the power<br\/>consumption of communication elements has been lagging. As a wide range <br\/>of digital systems becomes increasingly interconnected, it is now<br\/>both timely and critical to explore power-aware interconnection networks.<br\/><br\/>In this proposal, we outline our plans to research, develop and build <br\/>self-regulating power-aware interconnection networks that trade off <br\/>power and performance automatically while meeting design constraints. In <br\/>these networks, power-aware router and link mechanisms export knobs by <br\/>which network power and performance can be adjusted. Policies then <br\/>control these knobs to deliver network power-performance that meet <br\/>design goals. Self-regulating power-aware networks alleviate designers <br\/>from the daunting task of reconciling two highly divergent goals -<br\/>high performance, and low power.<br\/><br\/>In highlighting and demonstrating the importance of power awareness in <br\/>networks, our proposed research advances a deeper understanding of <br\/>networks from a fresh perspective, with a potential for high-impact <br\/>contributions in research. In addition, we see our research leading to <br\/>power efficiency being an integral part of networking curriculum.","title":"CAREER: Self-Regulating Power-Aware Interconnection Networks","awardID":"0237540","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["446736"],"PO":["550859"]},"78424":{"abstract":"ABSTRACT<br\/>0237633<br\/>Minh N. Do<br\/>U of Illinois @ Urbana Champaign<br\/><br\/>The enormous growth of visual information in digital form has produced an urgent need for more powerful and effective image processing applications. At the foundation of many of these image processing tasks is an efficient representation that can capture significant image information using a small description. Recently, it has become evident that the commonly used separable extensions from one-dimensional transforms, such as Fourier and wavelet, are not necessarily best suited for images. There is strong motivation to search for more powerful schemes that can capture the intrinsic geometrical structure that is key in pictorial information. Achieving this step will lead to fundamental advances in a number of areas in image processing.<br\/><br\/>This project involves developing new \"true\" two-dimensional representations that can deal more effectively with typical images having smooth contours. The focus is on the development of directional and multiresolution image expansions using non-separable filter banks, in much the same way that wavelets were constructed from filter banks. In essence, the investigator pursues non-separable extensions of wavelets and multiresolution techniques so that they can capture the directional information -- an important and unique feature of multidimensional signals. In parallel, newly developed image representations are explored in a variety of applications, where substantial improvements over current methods are expected. The educational part of the project maximizes the benefits of the research results and recent related discoveries through: designing a new course to teach fundamental processing methods that were<br\/>specially developed for multidimensional signals; developing computational toolboxes and reproducible experiments to train students using these methods proficiently; and exposing students to well-designed projects to gain hands-on experiences.","title":"CAREER: Directional Multiresolution Image Processing: Theory, Algorithms and Applications","awardID":"0237633","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["518402"],"PO":["564898"]},"76488":{"abstract":"Abstract<br\/><br\/>Proposal : IIS-0229076<br\/>Institution: Columbia University<br\/>PI: Kate Wittenberg<br\/><br\/><br\/>This project, entitled \"Teaching and Learning Anthropology: Using Scalable Digital Library Platforms and Innovations in Approaches to Content\" is a collaborative effort of Columbia University and the London School of Economics, UK. Starting from a focus on concrete learning outcomes, the primary aim will be to develop a series of digital tools, methods, and approaches with the potential to change the teaching and learning of anthropology. Once the investigators have developed a series of teaching methods and tools, they will then embed them in a digital learning environment for wider use. This environment will comprise a stable, flexible, and scalable digital library infrastructure, and it will allow for customized use across a wide range of academic fields . The project results will be made available on an \"open source\" basis, for use in diverse cultural, technological, and educational settings at the undergraduate level.","title":"Teaching and Learning Anthropology: Using Scalable Digital Library Platforms and Innovations In Approaches to Content","awardID":"0229076","effectiveDate":"2003-02-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["381230",199325,199326,"485773"],"PO":["433760"]},"78601":{"abstract":"Over the past decades, most of the previous graphics and visualization systems are polygon based. However, with the advent of scientific simulations and advanced biomedical and industrial acquisition devices, more and more objects of unprecedented size are produced with discrete samples as natural representations. In this proposal, the PI will generalize image resampling theory to describe the fundamental resampling problem of graphics rendering. Guided by this theory, practical approaches to performing high quality and efficient resampling will be designed and further applied to the rendering of various discrete objects, including 2D image warping, volume rendering, and point-based rendering. The developed theory will also used to guide the design of new point-based representation, so that discrete primitives as well as polygons can be rendered in a unified rendering system. <br\/><br\/>The newly designed algorithms will be validated and disseminated through application to mainly two real-world applications that the PI has already been collaborating on. The volume rendering algorithms will be used to visualize large simulations, in areas such as aerodynamics, astrophysics, and chemical contamination dispersion. The point-based modeling and rendering algorithms will be used to build point-based models from modern laser range scans and ultimately provide an interactive system for digital architecture design. This validation and dissemination are achieved by pursuing a vigorous education plan, undertaking a number of complementary initiatives: (1) developing new graduate and undergraduate courses at the University of Minnesota; (2) developing educational software for teaching; and (3) other activities including organizing workshops and tutorials. <br\/><br\/>Intellectual Merits: The algorithms coherently designed using the resampling theory represent improved rendering techniques for scientific visualization systems by delivering higher quality and better efficiency. The proposed research is well built upon the PI's solid knowledge and extensive experience with image and volume resampling and antialiasing, as well as accelerated volume and polygon rendering. <br\/><br\/>Broader Impacts: The proposed career development plan will not only advance the state-of-the-art of scientific visualization and computer graphics, but also make significant contributions to many other research fields which are facilitated by advanced scientific visualization, besides the ones being used for methodology validation and dissemination during the course of this project. Possibilities in these fields will likely open, stimulating even more applications of the technology than originally conceived.","title":"CAREER: High Quality and Efficient Rendering of Discrete Primitives for Interactive Visualization","awardID":"0238486","effectiveDate":"2003-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["287014"],"PO":["532791"]},"78579":{"abstract":"Data mining is the process of automatically extracting useful information hidden in large<br\/>data sets. This emerging discipline is becoming increasingly important as advances in<br\/>data collection have lead to the explosive growth in the amount of available data. This<br\/>project aims to develop a wide-range of novel data mining algorithms suitable for the<br\/>characteristics of scientific data sets arising in genomics and fluid dynamics. <br\/><br\/>Our research will focus on developing algorithms both for sequential datasets and for<br\/>datasets that can be represented by directed labeled graphs. The graph-based modeling<br\/>enables us to capture in a single and unified framework many of the spatial, topological,<br\/>geometric, and other types of relational characteristics present in scientific datasets.<br\/><br\/>The specific research tasks that we plan to address are: (i) Development of scalable<br\/>algorithms for finding frequently occurring patterns in graph data sets and algorithms for<br\/>finding patterns whose frequency decreases as a function of the pattern-length. (ii)<br\/>Development of scalable and high quality clustering algorithms for sequence and graph<br\/>data sets which operate directly in the native feature space. (iii) Development of scalable<br\/>and accurate classification algorithms based on automated sequential or relational feature<br\/>extraction approaches. These algorithms will be validated by analyzing data sets arising<br\/>in genomic and turbulent fluid flow.<br\/><br\/> The project integrates the data mining research with an educational plan that focuses on initiating undergraduate and graduate students to the various computational and data analysis aspects of genomic research and developing a comprehensive bioinformatics curriculum whose goal is to foster multi-disciplinary research and collaboration. In addition, a comprehensive set of software tools will be developed and made available that can be used both to train students in using data mining techniques and to conduct novel research expanding the levels of understanding in various scientific disciplines.","title":"CAREER: A Peer-to-Peer Framework for Decentralized Resource Administration and Management in Grid Computing","awardID":"0238379","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["550994"],"PO":["565272"]},"77722":{"abstract":"A growing concern among corporate information technology (IT) managers is the elevating gap between the increasing system maintenance and administration cost of the IT infrastructure and the decreasing hardware\/software acquisition cost. <br\/>This gap is escalating because system administration and management<br\/>is still relatively labor-intensive and thus non-scalable, despite extensive research\/commercial efforts to automate the process. In view of this trend,commercial enterprises resort to IT out-sourcing in order to share expensive and precious system management expertise. Despite its compelling cost saving advantage, IT out-sourcing so far has not been the mainstream, chiefly because the lack of technology to enforce and certify the so-called Service Level Agreement (SLA) between the out-sourcing and out-sourced parties. <br\/><br\/>This proposal will develop a multi-dimensional storage virtualization system called Stonehenge, which is able to guarantee a wide variety of storage-related Quality of Service (QoS) metrics and thus provides the enabling technology toenforce SLAs associated with storage service in particular and Internet services in general. The set of techniques developed in the Stonehenge system will carry the storage virtualization field one large step further because they allow virtualization of storage resource almost in all possible performance attributes that can be associated with physical disks. <br\/>As a result, Stonehenge allows creation of virtual disks that are as tangible as physical disks, and yet much more flexible and easier to manage and maintain. As an integral component of this project, we will also develop a unified and reusable implementation framework that could quickly convert, with zero or minor modification, a given cluster-based Internet service into QoS-aware, such that they are capable of supporting contractual SLAs that are described in terms of service-specific performance metrics.<br\/><br\/>Besides its intellectual contributions, this project will make a major impact on the undergraduate and graduate education of the CS department at Stony Brook by introducing a series of system management courses, which will use the Stonehenge prototype as a case study on the functionality and implementation details of production-grade enterprise storage management systems.","title":"SOFTWARE: Resource Virtualization for Cluster-Based Network Storage Service","awardID":"0234281","effectiveDate":"2003-02-15","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":[202714],"PO":["565272"]},"81320":{"abstract":"EIA 0303541<br\/>V. Arunachalam <br\/> Carnegie-Mellon University<br\/><br\/>Special Projects: Workshop on Research Agenda for Enabling Tools, Technologies and Policies for Sustainable Development<br\/><br\/>Information and Communications Technology (ICT), because of its reach and richness, offers very significant opportunities for improving human development and economic growth in sustainable ways. While some enabling tools and technologies are already available for such opportunities, more will have to be developed through vigorous R&D programs. This grant supports a workshop with participation from professionals working in diverse areas of human and social development, to identify and prioritize new and imaginative R&D efforts in ICT that would be needed to solve many debilitating problems of deprivation affecting human society. As a part of the workshop, a report will be generated incorporating the recommendations of the participants and suggesting future options for ICT research for sustainable development.","title":"Special Projects: Workshop on Research Agenda for Enabling Tools, Technologies and Policies for Sustainable Development","awardID":"0303541","effectiveDate":"2003-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1631","name":"CIVIL INFRASTRUCTURE SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1440","name":"ENVIRONMENTAL ENGINEERING"}}],"PIcoPI":[211876],"PO":["371077"]},"81386":{"abstract":"EIA-0303785 Andrew D. Ellington University of Texas- Austin Detection of Nucleic Acid Ligand Interactions on Microfabricated Surfaces<br\/><br\/>By putting effector-activated nucleic acid catalysts (aptazymes) on nanoscale mechanical and electronic devices, is allowing for a new paradigm for the integration of the biological world with electronic instrumentation. The aptazymes can sense a wide variety of analytes, such as metabolites, proteins, and even cell surfaces, and transduce the information directly to the mechanical or (ultimately) electronic devices. This most basic circuit for the transmogrification of biological and chemical information into electronic information should enable the construction of extremely novel devices not only for sensing, but also for actuation. Ultimately, these types of experiments will lead to a better integration of organismal physiology with instrumentation.","title":"SGER: Detection of Nucleic Acid Ligand Interactions on Microfabricated Surfaces","awardID":"0303785","effectiveDate":"2003-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["507106"],"PO":["565223"]},"83168":{"abstract":"Bioinformatics is an emerging collaborative area of research spanning many disciplines, including biology, computer science, and statistics. Explosive growth in the amount and variety of data has changed the research landscape to one where pattern analysis, data mining, information fusion and efficient access to large, diverse, distributed data sources have become important. The workshop will bring together researchers in biology and databases. Because the meetings is associated with an international conference on data engineering, many leaders in the area of databases will be present. Invited speakers and refereed papers and panel presentations will insure cross-disciplinary representation. The impact of the workshop will not only be the introduction of new faculty and students to an interdisciplinary set of problems, but also highlight the area of bioinformatics in data engineering.","title":"Workshop on Bioinformatics in conjunction with ICDE 2003 to be held in Bangalore, India on March 5-8, 2003.","awardID":"0310675","effectiveDate":"2003-02-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["536697"],"PO":[216753]},"78526":{"abstract":"Computing devices and applications are rapidly infiltrating every aspect of our everyday lives. The move of computing from the office desktop to ubiquitous presence in homes, in communities, and at play poses a challenge to human-computer interaction, because many of the attributes that are most important for workplace computing such as efficiency, problem-solving functionality, and standardization, are less central for other parts of our lives. Designing everyday computing applications that are appropriate for everyday life requires rethinking and adapting our methodologies; otherwise, we risk making all of our life like work. In this project, the PI will exploit cultural theory to analyze the cultural context of everyday life and develop appropriate computer science technologies and methodologies that support open-ended activity, user reflection, variations in style of living, personal meaning, and everyday values. These themes will be studied within the context of three applications: a system that monitors a home's emotional climate and provides users with open-ended feedback about it; information appliances for the home that support awareness of consumption; and an affective wearable device that explores emotional issues in backpacking. The project integrates activities across the disciplines that make up Cornell's new Information Science program, and supports the consolidation of the currently fragmented interdisciplinary community of researchers working in this area. It will also educate students from a variety of backgrounds and interests to integrate technical and cultural perspectives through interdisciplinary courses and involvement in the PI's research.","title":"CAREER: Using Cultural Theory to Design Everyday Computing","awardID":"0238132","effectiveDate":"2003-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["517929"],"PO":["565227"]},"78559":{"abstract":"This is a 5-year continuing award. The goal of the Listening Machine project is to develop techniques that can analyze everyday sonic environments into objects and events similar to those perceived by human listeners. Rather than viewing an audio file as an opaque, undifferentiated dataset, we want to be able to treat it as a combination of sound-source objects with more or less specific characteristics - for instance, the voice of a particular person plus background hum plus door closing followed by footsteps, etc. The kinds of recognition analyses to be developed by the PI will make possible rapid browsing of recordings, by segmenting and summarizing them in terms of the sounds of the objects contained - discussion with multiple people, ride inside a vehicle, outside on the street etc. Analyzing such recordings in terms of separate objects is particularly challenging, because the sounds almost always overlap and interfere. It is not adequate simply to train a recognizer on the sound of, say, a telephone ringing, because that sound changes completely when it is heard against a background of music on the radio. Instead, the PI will adapt and develop emerging techniques from speech recognition that classify signals based on partial observations, simultaneously recognizing subsets of the time-frequency information and inferring a segmentation into regions dominated by different sound sources, to maximize the probability that the explanation matches the observations. The techniques to be devised will support a new range of applications in which machines can stand in for human listeners, including new ways to search online multimedia content, interactive robots with a human-like awareness of their environments, and prosthetic devices for the hearing impaired. The educational contributions of the project will center around a Laboratory for Recognition and Organization of Speech and Audio (LabROSA), which the PI will establish with a unique focus on intelligent analysis of general audio. In addition to supporting students working within the group, research results will feed into course- and project-based educational activities in the form of new topic content and new tools and demonstrations. The immediacy of audio illustrations developed as part of this work will make these ideal demos for Columbia University's outreach to local high school students through periodic Engineering Open Houses.","title":"CAREER: The Listening Machine - Sound Source Organization for Multimedia Understanding","awardID":"0238301","effectiveDate":"2003-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["554699"],"PO":["565227"]},"77735":{"abstract":"Since its debut in 1995, Java has gained acceptance rapidly among software developers as the language of choice for many applications where portability and reliability are paramount. Java's support for clean object-oriented (OO) design, write once, run anywhere portability, comprehensive static type checking, automatic storage management, and safe execution semantics have dramatically improved programmer productivity and software reliability.<br\/>Despite of this high level of interest, Java has made little headway in the arena of high-performance<br\/>computing because it is too slow. The performance penalty is particularly acute when Java programs are written in a clean, object-oriented style that makes extensive use of polymorphism. Our recent studies of Java performance show that applications written in this object-oriented style incur performance penalties of a factor of ten or more over applications coded in a more tedious style similar to Fortran and C. If this performance gap cannot be bridged, the object-oriented benefits of Java will not be realized for compute-intensive applications, squandering an opportunity to revolutionize high-performance programming.<br\/>We propose to address this problem by conducting research into compiler technologies that make<br\/>it possible to develop applications and component libraries using the full power of the Java language<br\/>without sacrificing significant run-time performance. Although these strategies are suitable for use<br\/>in a compiler, we will incorporate the resulting technologies into a source-to-source optimization<br\/>tool. This tool will use application developer interaction to help optimize and package the Java<br\/>software.<br\/>We believe that the development of Java implementation technology suitable for high-performance<br\/>software could catalyze a revolution in the way compute-intensive applications are constructed<br\/>enabling the solution of more difficult scientific problems and the development of web applications<br\/>that have heretofore been out of reach. A large number of computational scientists share this vision, as evidenced by the experimental use of Java reported in the Java Grande Forum.<br\/>The optimization of object-oriented programs has been an active area of programming language<br\/>research for nearly twenty years, but little attention has been focused on the optimization technology required for high-performance numerical computation. Prior to Java, type-safe object-oriented languages were not considered candidates for numerical applications. To achieve high performance for polymorphic numerical code, the language implementation must perform class specialization, which clones a type-specific version of a class containing polymorphic fields, object inlining, which replaces a variable containing a reference to an object by a tuple of variables containing the object's fields and method inlining, which replaces method calls by specialized versions of the correspondingmethod body.<br\/>We believe that a judicious application of these three transformations combined<br\/>with standard instruction-level code optimization can translate polymorphic object-oriented source<br\/>programs to machine code comparable in quality to optimized Fortran.<br\/>In addition to these necessary optimizations, we propose two novel compilation strategies: almostwhole-program compilation, which relaxes the above optimizations' requirement of whole-program compilation to allow for more programming flexibility, and semantics modifying transformations which improve the communication between the compiler and the programmer to allow for even more aggressive optimizations.<br\/>We also propose to apply the technologies resulting from this research to optimize several scientific applications written in Java.","title":"SOFTWARE: Compiler Techniques for High-Performance Computing in Java","awardID":"0234345","effectiveDate":"2003-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["24590",202746],"PO":["565272"]},"78516":{"abstract":"EIA-0238061 Pamela A. Abshire University of Maryland College-Park CAREER: Physical Information Efficiency for Sensing, Communicating, and Computing<br\/><br\/>In physical computational efficiency, there is no free lunch. Tradeoffs of performance versus resources are everywhere, placing limits on performance and efficiency. To streamline technological processes, we may study and even mimic biology's highly efficient integrated systems that get the most bang for their resource bucks - the ultimate small smart systems that will revolutionize application design microelectronics, bioengineering, nanoscience and other fields. This line of intellectual inquiry opens up vistas to engage the minds of scientist and lay people alike. Consider a miniaturize autonomous cell clinic able to navigate your bloodstream and deliver therapy directly to damaged cells. Or environmental micro bots for security, monitoring and situation awareness. All are possible once we pinpoint ways to boost communication and computation to use resources in the most efficient ways. This research is laying critical groundwork for comparative analysis and application across biological and technological systems. Lunch may never be free-but it can become much cheaper and more nutritious.","title":"CAREER: Physical Information Efficiency for Sensing, Communicating, and Computing","awardID":"0238061","effectiveDate":"2003-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["474354"],"PO":["521045"]},"83489":{"abstract":"This exploratory project investigates the effectiveness of natural language processing (NLP) techniques for facilitating curation and ontological development efforts of model organism databases. This research will enhance the infrastructure for research and education by increasing the productivity of curators and using computerized methods to assist in development of a standardized ontology of biomolecular relations.<br\/><br\/>This project will address the following issues through a series of studies: a) what types of information are needed to actually reduce the work of curators, b) how should that information be presented, c) how much effort can actually be saved, and d) what level of performance is required? The studies will be performed utilizing curators and an existing NLP relation extraction system called GENIES that was shown to perform effectively.<br\/><br\/>This project will also investigate how output from an NLP relation extraction system (GENIES) can be used to develop a standardized ontology of relations. This will involve exploration of how to organize and visualize the extracted relations for ontological work. The utility of a flexible XML-based visualization tool that allows users to view relations according to different dimensions, such as by agent, by target, or by frequency will be explored.","title":"SGER: Facilitating Database Curation via Natural Language Processing","awardID":"0312250","effectiveDate":"2003-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["516887"],"PO":["565136"]},"78528":{"abstract":"Systems with distributed computation across open networks share many characteristics with economies, with individual computational devices that are largely autonomous and represent the self-interest of multiple users, including both individuals and businesses. A fundamental challenge is to design useful mechanisms to solve distributed problems in these open systems despite the self-interest of individual agents. This work proposes a foundational study into the issues that arise in computational mechanism design with computationally-bounded agents. One component proposes the study of indirect revelation mechanisms, in which agents are able to participate without computing, or revealing, complete information about their preferences or local constraints. Another component proposes the study of mechanisms that provide approximations to game-theoretic desiderata, such as strategy proofness. In both cases, the research agenda calls both for new theories and for new computational methods, that leverage the theory constructively within systems. The broader impact of the work promises the continued integration of game-theoretic and economic methods into computational systems, with applications ranging from automated mediation in e-marketplaces, to automated negotiation between devices in open systems. An important component involves the development of innovative graduate and undergraduate curricula, to help to educate students about problems at the interface between computer science and economics.","title":"CAREER: Mechanism Design for Resource-Bounded Agents: Indirect Revelation and Strategic Approximations","awardID":"0238147","effectiveDate":"2003-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["541779"],"PO":["564456"]},"91585":{"abstract":"DMS-0138440<br\/>James R. Arvo<br\/><br\/>The most familiar principle of geometrical optics asserts <br\/>that a ray of light impinging on an ideal mirror will emerge <br\/>in such a way that the angle of reflection equals the angle of incidence. The trajectory of a photon (or a billiard ball, <br\/>using another common metaphor), is thus completely determined <br\/>by its initial conditions and the geometry of the mirrors it subsequently encounters. The geometry of such trajectories <br\/>has been of interest in numerous fields, including plane <br\/>geometry, computational geometry, and computer graphics, <br\/>yet they comprise a vanishingly small subset (a set of <br\/>measure zero) within the class of all optical paths that <br\/>fall within the purview of geometrical optics. In particular, <br\/>optical paths resulting from non-specular reflections <br\/>constitute a vastly larger class. Moreover, they are of far <br\/>greater importance to image synthesis as they result from <br\/>physically realizable models of reflection. Nonetheless, <br\/>non-specular paths have thus far been largely overlooked as <br\/>a source of interesting geometrical problems. The main <br\/>objective of this research is therefore to launch an<br\/>initial investigation into the basic geometrical properties <br\/>of non-specular optical paths, both in the traditional <br\/>combinatorial sense, such as finding a optimal paths <br\/>connecting two points, and in the continuous sense, such <br\/>s finding extremal paths, or computing the measure of all <br\/>k-segment paths connecting two regions. A secondary <br\/>objective is to explore connections with probabilistic <br\/>methods, such as standard Monte Carlo visibility techniques <br\/>and Metropolis light transport, which will likely be the <br\/>first direct beneficiaries of this work.<br\/><br\/>This work is expected to contribute primarily to the<br\/>mathematical foundations of image synthesis by identifying<br\/>optical paths as interesting geometrical entities in <br\/>themselves, and by exposing some of their fundamental <br\/>properties in terms of density, measure, and computational <br\/>complexity. Moreover, it is expected that this new <br\/>perspective will ultimately be instrumental in studying <br\/>the accuracy and computational complexity of realistic <br\/>image synthesis in general, about which very little is <br\/>known currently. While the problems investigated here <br\/>will invariably have much in common with previous work on<br\/>direct and indirect illumination problems in computational<br\/>geometry, the approaches taken will have a distinctly more<br\/>continuous flavor, drawing heavily from fields such as <br\/>measure theory, differential geometry, and geometric <br\/>probability. Finally, it is expected that this work will <br\/>serve as a segue into a longer-term investigation of <br\/>computational complexity in computer graphics by <br\/>establishing basic tools and connections with other disciplines.","title":"Computational and Algorithmic Representations of Geometric Objects - CARGO: The Geometry of Optical Paths: Intrinsic Properties, Complexity of Approximation, and Applications","awardID":"0353203","effectiveDate":"2003-02-10","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"X871","name":"DARPA-COMP & ALGORITHMIC  REP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["239874"],"PO":["565280"]},"76516":{"abstract":"Proposal : IIS-0229210<br\/>Institution: University of California, Santa Barbara<br\/>PI: Michael Freeston<br\/><br\/><br\/>This project, entitled \"Digital Libraries Supporting Innovative Approaches to Learning and Teaching in Geography\" is a collaborative effort of University of California, Santa Barbara and the Pennsylvania State University in the USA and the Universities and Southampton and Leeds in the United Kingdom. The project also informally engages partners at other institutions. The primary aims of the proposed project are to develop a distributed enabling information infrastructure for the support of learning and teaching Geography and to devise innovative approaches to teaching and learning based on this infrastructure. The project will deliver shared UK\/US electronic resources associated with course in several topic areas, including Human Geography, Geographical Information Science, Geomorphology and Earth Observation. The project will build on a variety of impressive digital resources which have been created by government agencies, universities and other organizations. A primary resource will be the Alexandria geo-referenced digital library, developed within the previous NSF-led Digital Library Initiatives.","title":"Digital Libraries Supporting Innovative Approaches to Learning and Teaching in Geography","awardID":"0229210","effectiveDate":"2003-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["256033","558093","351262",199402,199403],"PO":["433760"]},"76869":{"abstract":"Proposal : IIS-0230450<br\/>Institution: Stanford University<br\/>PI: Larry Leifer<br\/><br\/><br\/>This project, entitled \"Accelerating globally Distributed Team Innovation: Building an Experimental Testbed to Leverage Digital Libraries in the Transformation of Design Engineering Education\" is a collaborative effort of Stanford University and Strathclyde University, Scotland. The project also informally engages partners at other institutions. The project proposes the development, implementation and use of a testbed to improve the teaching and learning of students participating in global team based design projects. The project aims to fundamentally change the way design engineering is taught by combining the use of digital libraries with virtual design studios. The goal of the project is to enhance student learning opportunities by enabling them to partake in global, team based design engineering projects, in which they directly experience different cultural contexts and access a variety of digital information sources via a range of appropriate technology.","title":"Accelerating Globally Distributed Team Innovation: Building an Experimental Testbed to Leverage Digital Libraries in the Transformation of Design Engineering Education","awardID":"0230450","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["504037"],"PO":["433760"]},"78948":{"abstract":"SGER Proposal 0240148<br\/>DDMCMC Algorithms for Rapid Search and Detection<br\/>PI: A.L. Yuille<br\/>University of California, LA<br\/><br\/><br\/>The proposed study is to design and implement a rapid visual search algorithm called DDMCMC, which uses data-driven feedforward visual cues to drive a Monte Carlo algorithm. This approach combines the speed of feedforward algorithms with the high quality performance of top-down model instantiation algorithms. DDMCMC was developed for the image segmentation problem by the Co-PI and was demonstrated to give fast and very accurate segmentation results on large datasets (with groundtruth). DDMCMC is generalized to the search and detection task by using techniques such as AdaBoost learning to determine effective feedforward algorithms to drive the MCMC algorithm. <br\/><br\/>The broader impact is to develop computer vision algorithms to help the blind and visually impaired (though we will also use this grant to train graduate students). To achieve this, a pilot study of the DDMCMC algorithm will be developed for the specific task of searching for, and then reading, informational signs (the results can be communicated to a visually impaired user by a speech synthesizer). This study will be aided by researchers at the Smith-Kettlewell Eye Research Institute (SKERI) who include two blind engineers. The proposed algorithms will be designed and tested on image datasets taken by blind volunteers using head or body mounted cameras (to ensure the realism of our approach). Researchers at SKERI will also give feedback on the practicality of the approach and how it compares with alternative technologies for this task (none of which use computer vision). Computer vision has enormous potential to help the visually disabled provided fast and effective algorithms are developed.","title":"SGER: Stochastic Algorithms for Visual Search and Recognition","awardID":"0240148","effectiveDate":"2003-02-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["549461","456867"],"PO":["234178"]},"78607":{"abstract":"The goal of this research is to develop robust and effective techniques to model, simulate and interact with soft objects. The physical modeling of deformable objects is one of the fundamental and crucial components of many graphics and scientific visualization application providing an effective way to display and interact with virtual objects that better represent true physical nature, beyond unrealistic rigid-body approximation. Soft object modeling has been studied extensively using both discrete models and continuum mechanics-based models. However, two major issues still pose a significant challenge. First, the conflicting demand between computational efficiency and biomechanical realism directs us to take trade-offs or to sacrifice one for the other. Second, the robust treatment of interaction between soft objects and intuitive control is often overlooked, being represented by a single point of contact or given external forces. The PI will address issues in the following areas: 1) domain decomposition method to represent a complex object structure; 2) adaptive refinement and simplification of the model while preserving overall dynamic behavior; 3) robust constraint-based collision and contact analysis between deformable objects; 4) constrained manipulation for intuitive and flexible user interface; and 5) fast cluster computing environment and associated parallel algorithms. <br\/><br\/>The educational component of this project includes 1) development of a new physically-based modeling and simulation curriculum, 2) development of a realistic tissue deformation model for a virtual surgery system which will be used for training medical students and surgeons, 3) development of functional anatomy online visualization system for K-12 students and the general public, and 4) hosting \"How Things Work\" workshop and animation contest to foster research experiences for undergraduate and graduate students in their early academic careers.","title":"CAREER: Constraint-based Adaptive Simulation of Deformable Objects","awardID":"0238521","effectiveDate":"2003-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[204855],"PO":["550859"]},"79809":{"abstract":"0243764 <br\/>Khokhar<br\/><br\/>Description: This award supports a US-Pakistan Workshop on Information Technology to be held in Islamabad, Pakistan, April 2003. The organizers are Dr. Ashfaq Khokhar, Department of Electrical Engineering and Computer Science at the University of Illinois at Chicago and Dr. S.M. Junaid Zaidi, Rector of the COMSATS (Commission on Science and Technology for Sustainable Development in the South) Institute of Information Technology in Islamabad, Pakistan. The purpose of the workshop is to exchange information between the US and Pakistani sides on advances in information technology and to discuss R&D needs that may be met through cooperative research projects. The key areas chosen for this workshop include: role of IT in large scale enterprise infrastructure, security and protection of IT infrastructure, network centric information and computing, IT based applications including digital government, e-commerce, e-learning and bioinformatics, and higher education and research in IT. Several parallel sessions will be organized to make use of the expertise of expatriate and other US-based leading researchers. The workshop will include plenary sessions to introduce cutting edge research in each of the four identified areas, and two panel sessions to discuss future research trends in IT. The workshop will provide a platform for fostering research collaborations among the researchers from US and Pakistan and initiate research and development projects related to key IT research areas. <br\/><br\/>Scope: This project enables US and Pakistani scientists to discuss an area of great importance to both countries, and to identify potential collaborative research where the two sides can complement each other's capabilities. Dr. Khokhar is an experienced researcher with a strong record of NSF-funded projects. He is also familiar with the science scene in Pakistan. Dr. Zaidi is also an experienced scientist who leads a major specialized institute for IT in Pakistan and who will have the backing of that country's Ministry of Science and Technology. Among the US participants are five junior scientists. The project will increase collaboration in science and technology with Pakistan in an area of great importance to both countries. This project is being supported by the Office of International Science and Engineering and the Division of Computer and Communications Research.","title":"US-Pakistan Workshop: Research and Development in Information Technology, Islamabad, Pakistan, April 2003","awardID":"0243764","effectiveDate":"2003-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["438744","532978"],"PO":["540599"]}}