{"49270":{"abstract":"","title":"CAREER: Principled Foundations for Programming with Objects","awardID":"9996250","effectiveDate":"1998-08-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["563479"],"PO":["150697"]},"49161":{"abstract":"","title":"CAREER: Computer Aided Design Tools for Fault-Tolerant and Highly-Reliable Scalable VLSI Systems","awardID":"9996139","effectiveDate":"1998-08-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550604"],"PO":["562984"]},"27591":{"abstract":"This project concerns the design and implementation of symbolic, numeric and geometric algorithms for the creation, manipulation and visualization of polynomial (algebraic) curves, surfaces and splines. Such algorithms form the science base for diverse applications ranging from computer graphics game environments to computer aided geometric design for simulation based design prototyping. The project has an abstract data type orientation. In this framework, the choice of which representation of the polynomial curve or surface patch to use is determined by the desired optimality of the algorithms for the operations. Research will therefore be done on different representations of algebraic curve and surface splines for specific operations of display, finite element mesh generation and polynomial spline model construction. Piecewise polynomial or rational functions or surfaces of some fixed degree d and continuously differentiable up to some order r are known as algebraic splines or finite elements. While it is possible to model a general closed surface of arbitrary genus as a single algebraic surface patch, the geometry of such a global surface is difficult to specify, interactively control, and display. This research will covers both implicit and parametric algebraic surface splines (algebraic patches and non-uniform rational B-spline patches).","title":"Modeling and Visualization with Algebraic Surfaces and Splines","awardID":"9732306","effectiveDate":"1998-08-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["517319"],"PO":["179846"]},"49063":{"abstract":"","title":"NSF Young Investigator: Concurrent Object-Oriented Programming Support for Irregular Parallel Applications","awardID":"9996040","effectiveDate":"1998-08-21","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["556381"],"PO":["150697"]},"27361":{"abstract":"This project involves the dual pursuit of core theoretical investigations in computational geometry and experimentation with geometric codes. Theoretical investigations will address lower bounds, geometric sampling techniques and derandomization. Experimentation will involve the implementation of algorithms as well as the development of tools to make future implementations easier. Special emphasis will be given to problems of simplification and multiresolution of shapes in 3D, sampling and optimization, algorithm animation and experimentation tools.","title":"Design and Experimentation in Computational Geometry","awardID":"9731535","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["450650","213809"],"PO":["179846"]},"28131":{"abstract":"The goal of this research is to develop machine-learning approaches for integrating additional resources into the inductive-learning paradigm and to apply these new approaches to numerous real-world problems. Many scientific and industrial problems can be better understood by learning from samples of the task under consideration. For this reason, the machine learning and statistics communities devote considerable research effort in generating inductive-learning algorithms that try to learn the true concept of a task from a set of its examples. Often times, however, once has additional resources readily available, but largely unused, that can significantly improve the concept that these learning algorithms generate. These resources include prior knowledge describing what is currently known about the domain as well as available computer cycles. The focus of this proposal is to extend and apply a successful learning system that consists of utilizing a novel combination of inductive learning (focusing on ensembles, genetic algorithms, and neural networks), anytime learning, and background knowledge. Natural applications of this framework include information filtering, object recognition in digital images, drug design, as well as many other domains traditionally tackled with expert systems. http:\/\/www.cs.umt.edu\/CS\/FAC\/OPITZ\/NSF_CAREER.html","title":"CAREER: Knowledge-Based Ensemble Approach to Real-World Data Analysis","awardID":"9734419","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["140328"],"PO":["564456"]},"28076":{"abstract":"The objectives of this research and educational program are to develop new formalisms and methods for artificial intelligence by combining a sound theoretical approach with a principled experimental component, to provide a practical evaluation of the proposed models and relate them to real-world applications and challenges, and to educate the next generation of computer science students about the ambitious and challenging goals of artificial intelligence. To develop successful applications, general search and reasoning has been avoided in recent years by explicitly incorporating large amounts of domain-specific knowledge. Such a knowledge-intensive approach has been successful in, for example, expert systems; but in areas such as general planning or reasoning, progress has been disappointing, and specific knowledge acquisition is often difficult and expensive. However, recent advances in general methods combined with faster hardware and better implementations provide strong evidence that a compute-intensive approach is not only suitable for dealing with the combinatorial nature of many AI formalisms, but may also be required to supplement domain-specific knowledge. This research studies fast general reasoning and search methods, with an emphasis on stochastic procedures, which are a promising recent development for solving computationally hard problems. It also investigates the various sources of complexity in hard problems, using both theoretical and experimental methods, exploring interesting connections between computer science, artificial intelligence, and statistical physics. In addition, it is studying issues in problem representation, including robustness of encodings, abstraction, compilation, and approximation methods. The result is expected to be new general approaches to artificial intelligence that are applicable to a wide variety of problems in such areas as planning, operations research, and computational biology. http:\/\/simon.cs.cornell.edu\/home\/selman\/","title":"CAREER: Compute Intensive Methods for Artificial Intelligence","awardID":"9734128","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["560669"],"PO":["564456"]},"27450":{"abstract":"This project aims to improve the quality of computer graphic images of outdoor, natural scenes. To date, renderings of outdoor terrain have had a cartoon-like quality that significantly distracts from a sense of realism. Partially, this is due to computational and source data constraints that limit the geometric complexity of terrain that can be rendered. The thesis of the research described here is that illumination and material properties play an equally important role in creating a sense of realism from these scenes. Moreover, there are important interactions between geometry, illumination, and material properties in a model of outdoor terrain that should be understood when real-time constraints must also be satisfied. Significant progress has been made in the last decade in understanding how to generate realistic renderings of indoor scenes. The general approach is to analyze the physics of light transport in such environments and then to embody approximations to the physics in computational algorithms. Correct modeling of illumination and material properties is vital. It is now known that a sense of realism depends critically on accounting for shadows, secondary illumination, and non-uniform reflectance functions. Accurately approximating the effect of these properties involves great computational expense. As a result, methods for rendering realistic imagery almost always exploit assumptions about the nature of the geometric structure and illumination and materials properties likely to be encountered. Most of these assumptions derive from a presumption of indoor environments. Outdoor scenes present very different computational characteristics. While the physics is the same, geometry, illumination, and reflectance properties are all distinctly different. Many of the techniques developed to support realistic rendering of indoor scenes will require substantial modifications for natural, outdoor environments. The most difficult computational prob lem to overcome is the need to be able to aggregate the effects of micro-structures into large enough units that they can be rendered effectively, while at the same time preserving key aspects of visual appearance. This problem exists across a wide range of scales, ranging from foliage, in which a collection of individual leaves generates a collective appearance that is quite different than that of the constituent members, to distant landmarks, where detail must be suppressed without removing those properties that make landmarks distinctive and thus useful.","title":"Realistic Computer Graphics for Natural Scenes","awardID":"9731859","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["560997","292838","139560"],"PO":["179846"]},"29496":{"abstract":"The main focus of this proposal is on \"pattern matching\", the identifying of an object, called the \"pattern\", in a larger body, often called the `text\". The pattern might be a DNA sequence and the text a (large) collection of DNA sequences. While it is fairly well understood how to find exact matches of an object, finding similar instances of an object is not as well understood, or at least it is not known how to find them nearly as efficiently. Further, it is natural to suppose that this task can be carried out progressively more efficiently the greater the similarity between the objects being matched. But, by and large, achieving this remains problematic. The aim of this project is to develop methods whose efficiency improves in tandem with increased similarity. Motivating problems include the already mentioned DNA matching, matching of words or phrases in bodies of text, and matching of objects in images. A secondary focus for this proposal is the study of network switches; more specifically, the devising of methods for sending (routing) messages and designs for facilitating such routings.","title":"Exact and Approximation Pattern Matching, and Network Routing","awardID":"9800085","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518072"],"PO":["528421"]},"49110":{"abstract":"","title":"Microstructural Evolution in Sintering - Experimental, Mathematical and Numerical Study","awardID":"9996087","effectiveDate":"1998-08-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1715","name":"METALS, CERAMICS, & ELEC MATRS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1771","name":"METAL & METALLIC NANOSTRUCTURE"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1774","name":"CERAMICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["556350"],"PO":["240955"]},"29475":{"abstract":"Quantum computation is an important new area that has shaken the foundations of computational complexity theory and algorithms. This project investigates several aspects of this subject: Use of \"negative probabilities\" to design efficient quantum algorithms for random generation and approximate counting. Further exploration of the new Fourier transform relationship between the `spins world\" and the \"subgraphs world\" to solve the Ising model Gibbs sampling problem in the case that all interactions are negative. The study of further group theoretic properties of the Fourier transform to design efficient quantum algorithms for problems such as graph isomorphism. In particular, this involves studying the linear representations of non-commutative groups such as the symmetric group. The study of new error models for quantum computers based on NMR experiments in quantum computation currently underway at Berkeley. The formulation of formal criteria to demonstrate that the computation in these experiments is inherently quantum mechanical. The comparison of the class BQP to classical complexity classes, including the polynomial hierarchy, and most notably approximate counting. The study of the quantum analog of NP. In addition this project studies classical randomized algorithms for a fundamental algorithmic task - clustering: A sequence of points is sampled from a probability distribution in R, which may be any member of a family of distributions which have several modes (regions of concentrated probability). Is there an efficient algorithm to infer an accurate estimate of the distribution being sampled? This formalizes a very general problem related to clustering. Given a graph, partition its vertices into two sets such that the ratio of the number of crossing edges to the number of vertices in the smaller sets is with in a constant factor of the minimum. The weighted version of this problem is the famous problem of estimating the conductance of a graph to with in a constant factor. It formulizes a clustering problem in a concrete setting.","title":"A Proposal for Research on Quantum Computation and Clustering Algorithms","awardID":"9800024","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["402689"],"PO":["528421"]},"28177":{"abstract":"Stochastic and population-based search methods (simulated annealing, metropolis, WalkSAT, genetic algorithms) have been successful as optimization heuristics in a number of application areas. However, very little is known about which problems they succeed at, which instances they do well on, or how to make implementation choices to tailor the method to a given application. To address this, recent theoretical work on population-based methods will be used as a guide in an experimental study of the structure of search spaces. Population- based algorithms (in particular go-with-the-winners local optimization, will be used to sample uniformly from the part of the search space that meets a certain minimal standard of optimality. Such samples will be used to discover combinatorial characteristics of search spaces, and then to predict and improve the performance of optimization heuristics. Social Impact: There will be collaboration between theorists and experimenters. This will help forget ties between the two research communities. Graduate students will learn to balance theoretical skills, programming institution, and concern for applications","title":"Empirical Analysis of Search Spaces Using Population-Based Sampling","awardID":"9734880","effectiveDate":"1998-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["76213","515842"],"PO":["150516"]},"34052":{"abstract":"9812800 Marc Rotenberg Association for Computing Machinery Special Project: Student Fellows Programs at ACM Policy 98 Conference This grant provides funding for twelve policy98 Student Fellows to attend and participate in the ACM Policy98 Conference. The conference provides a multidisciplinary forum planned to stress the contributions that computer professionals can make in policy-making by providing informed testimony and expanded policy options. The purpose is to forge stronger links between computing professionals and policy makers. The conference includes distinguished keynote speakers, technical panels and workshops and is primarily funded and administered by ACM. The twelve Fellows that will be funded by this grant all have strong interests in public policy issues and several are pursuing graduate degrees in this and related topics.","title":"Special Project: Student Fellows Program at ACM Policy '98 Conference","awardID":"9813800","effectiveDate":"1998-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[85699],"PO":["564181"]},"27441":{"abstract":"The focus of computational geometry is designing algorithms for solving geometric problems. These arise in a number of application contexts, including manufacturing, graph drawing, robotics, and graphics. The project's concentrations touch on all these application areas. Research on shortest paths and geodesics on polytopes is relevant to robotics and to texture mapping in graphics. Folding and unfolding of research is connected to a variety of manufacturing concerns. And visibility algorithms see use in graphics and graph drawing. A collection of fundamental open problems in these areas will be pursued, both theoretically and through experimentation with code. Progress on geodesics, on folding, on floodlight illumination, and on visibility graphs can be expected. Female undergraduate students will be engaged in all aspects of the research, and all software developed will be freely distributed on the Internet.","title":"RUI: Topics in Computational Geometry","awardID":"9731804","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["271511","550373"],"PO":["179846"]},"29597":{"abstract":"The primary focus of this work is on the theoretical design and analysis of error-correcting codes. The Shannon bound puts limits on the decoding capabilities of such a code, given its rate. The fundamental goal of this research, with applications to different areas of science and communication, is to design sequences of codes that are asymptotically good (achieve the Shannon bound) and have linear time encoding and decoding algorithms. Recently, linear time erasure codes have been designed based on the construction of random graphs with well-defined structure. The novelty of the approach is that the ``intelligence'' is in the structure of the random graph, and ``naive'' algorithms are used to encode and decode. The proposed work starts with the same basic approach used for erasure codes and attempts to extend it to the harder problem of designing linear time asymptotically good error-correcting codes.","title":"Efficient Algorithms for Encoding and Decoding Asymptotically Good Error Correcting Codes","awardID":"9800452","effectiveDate":"1998-08-15","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[74796],"PO":["150697"]},"37485":{"abstract":"EIA-9870740 Levy, Henry M. Karlin, Anna R. University of Washington ESS: Distributed Resource Management in Local-Area and Wide-Area Networks Advances in network and processor technology are greatly changing the communication and computational power of networked computers. However, current software systems are unable to utilize the capabilities of modern hardware components, because they are designed for last-generation hardware. The goal of this research is to enable more effective use of future networks and processors through design and implementation of new software structures and algorithms better suited to the characteristics of future hardware. The research focuses on two related but independent domains. First, in local-area networks (clusters), this work seeks to improve the performance of applications through distributed, cluster-wide resource management. It will develop algorithms that permit the tight-knit sharing of all cluster-wide network resources: processors, network, memory, and disk storage. Second, this research seeks to apply experience in global resource management to a much broader domain -- the global Internet. The project will develop and test algorithms that optimally and dynamically locate both data and computation in the Internet, in order to improve data-access latencies and reduce network bandwidth utilization. A significant component of this research is the construction of a software simulation infrastructure to test hypotheses applied to such a large-scale system as the world-wide web.","title":"Experimental Software Systems: Distributed Resource Management in Local-Area and Wide-Area Networks","awardID":"9870740","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["450764","450784","485574","463055"],"PO":["179487"]},"49178":{"abstract":"","title":"CAREER: Development of a Mobile Architecture (Mobi-Arch)","awardID":"9996156","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["546219"],"PO":["234222"]},"39025":{"abstract":"","title":"CAREER: A Partial Evaluation Tool Set for Automatically Customizing Adaptable Software","awardID":"9896354","effectiveDate":"1998-08-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["563763"],"PO":["397849"]},"49068":{"abstract":"","title":"Computational Methods for Pythagorean-hodograph Curves in CAD\/CAM Applications","awardID":"9996045","effectiveDate":"1998-08-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["181687"],"PO":["187585"]},"29477":{"abstract":"This project encompasses three lines of research, all related to computational learning theory. (1) The well-known ``probably approximately correct'' (PAC) model of learning---and other models---have provided a robust framework within which various notions of learning have been formally analyzed. However, learning is a broad concept, and some senses of learning have not been captured well by existing models. This project develops a framework for analyzing one such type of learning, that of learning search-control rules within the context of task planning. In addition to developing this framework, lower and upper bounds on learnability within the framework will be sought. Based on preliminary work, graph-theoretic approaches appear to be particularly promising in producing such bounds. (2) Several fundamental questions within existing learning models still remain open. Some of the best answers to related questions have been obtained using Fourier analysis of function classes along with associated Fourier-based algorithms. Thus, Fourier and other techniques will be applied to several of these remaining questions. (3) Fourier-based algorithms that have been produced thus far, while efficient in the sense of running in polynomial time, are not used in practice in part because of somewhat large exponents in the running time. This project seeks to produce algorithms with noticeably better running times.","title":"RUI: Learnability: Framework, Concepts, Algorithms","awardID":"9800029","effectiveDate":"1998-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["348029"],"PO":["150516"]},"33591":{"abstract":"This project is investigating computer architectures based on a distributed, decentralized (DD) approach to computing. It is now necessary to re-examine traditional concepts of processor architecture because the gap between processor cycle time and relative memory access time is increasing, distributing a high-speed synchronous clock to billions of transistors is difficult, and as processors become more complex and compiler analysis becomes more intelligent, their interface must be improved. In this research, the underlying processor model used is both distributed and decentralized in resource allocation, consisting of multiple independently programmable processing elements, elasticity connected to one another and to memory via FIFO queues. This approach is capable of tolerating memory latency, overcoming the clock distribution problem, and facilitating the transfer of compiler information to the hardware. This project includes the development of compiler technology and a hierarchical simulation framework to demonstrate these claims.","title":"Multi-Level Parallel Execution on Decoupled Systems","awardID":"9812415","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["486140","485983"],"PO":["113883"]},"33481":{"abstract":"This research seeks to develop and apply recent advances in algorithmic methods for the construction of real time space-variant active vision systems. The term space-variant refers to sensor architectures in which pixel size, and possibly neighborhood topology, vary with position. Although inspired by biological vision (e.g. foveal vision, and its cortical expression in terms of the log-polar mapping) , space-variant architectures form a natural synergy with active vision: movement of the fixation point of a sensor, either via electronic pan-scroll, or via robotic actuators, is mandatory for space-variant systems. Since it has been shown that log-polar architecture can provide a form of data reduction that is on the order of two to three orders of magnitude for current computer vision systems, there is an important niche for application of space-variant imaging in robotic and computer vision. During the past year, an extension of the 2D Fourier Transform to log-polar image formats (the exponential chirp transform) has been developed. This transform has been demonstrated to provide the analog of a full-field (space-variant) 2D Fourier Transform at real-time rates on standard PC platforms. The goal of this research is to apply the exponential chirp transform to develop applications in the areas of real-time image tracking, template matching for recognition and motion de-blur, and to provide demonstrations indicating the achievement of complex visual functionality with minimal hardware and software complexity, for application on small, lightweight, and mobile active vision systems.","title":"Space Variant Active Vision","awardID":"9812143","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["268907"],"PO":["234178"]},"35297":{"abstract":"The 2nd IEEE Signal Processing Society Multimedia Signal Processing Workshop will take place in Redondo Beach, CA, in December 1998. The first workshop was held in Princeton, NJ, in June 1997. The objective of the workshop is to bring together experts in areas, which are increasingly being required to interact with each other, as emerging integrated media systems become available. As an example, the list of topics includes areas such as databases, communications, processing and interfaces. The objective of the workshop is to study how issues arising in the above fields affect signal processing for multimedia systems. The goal of the funds requested in this proposal is to facilitate the participation of students. The student support will come in the form of reduced registration fees and\/or travel support. Reduced registration will made available to as many students as possible.","title":"1998 Workshop on Multimedia Signal Processing","awardID":"9817222","effectiveDate":"1998-08-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["451991"],"PO":["564898"]},"29511":{"abstract":"9800117<br\/>Wilde<br\/><br\/>This three-year award supports U.S.-France cooperative research on functional programming languages for sequential and parallel computing machines. It involves Doran Wilde at the Brigham Young University and graduate students and Sanjay Rajopadhye at IRISA\/INRIA (French National Institute for Research in Informatics and Applied Mathematics) in Rennes, France. The investigators will explore new methods and develop new tools for co-designing (or compiling) an algorithm to execute concurrently in reconfigurable hardware and in software.<br\/><br\/>The US investigator brings to this collaboration expertise in VLSI design, programming languages and compilers, and computer arithmetic. This is complemented by the French researcher's expertise in regular algorithms, systems of recurrence equations, parallel processing systems and formal parallelization methods. The project will advance understanding in the area of adaptive computing.","title":"U.S.-France (INRIA) Cooperative Research: Mapping of Regular Algorithms onto Different Architectures","awardID":"9800117","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[74576],"PO":["323582"]},"29687":{"abstract":"9800785 This proposal concerns links between programming language theory and semantics and probabilistic computation, with applications to security analysis. The proposed work is to develop an analysis of cryptographic protocols based on programming languages, but using the probabilistic techniques of cryptography. This is a departure from most formal analyses of cryptographic protocols, which treat cryptographic operations as \"black boxes\". The proposed work will include the development of a modal-typed, concurrent programming language for defining communicating systems of probabilistic polynomial-time processes. A novel property of the proposed language is the use of probabilistic rather than nondeterministic scheduling of processes. A related notion of observational equivalence for sets of probabilistic processes will play a central role in reasoning about this language and in its applications to security analysis. The proposed research will develop methods for reasoning about observational equivalence (or some approximation to observational equivalence such as probabilistic trace equivalence or bisimulation) and use these methods to establish security properties of various protocols. The proposed framework will provide a useful analysis tool for working backwards from security properties of a protocol to derive necessary properties of underlying encryption primitives.***","title":"A Probabilistic, Language-Based Security Analysis","awardID":"9800785","effectiveDate":"1998-08-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["381704"],"PO":["397849"]},"28026":{"abstract":"This research and teaching program involves the investigation of the relationships between information technology (IT) investments and organizational practices and the implications of these relationships for organizational performance. Drawing on prior work on the economics of organizations and the economic theory of production, formal empirical models are developed that identify specific sets of work practices and organizational structures that are complementary to IT investments. These models are then tested by combining existing secondary data sources with an extensive program of data collection on work organization, workforce characteristics and organizational structure from individual firms. The results of this program will enable managers and technologists to identify the appropriate organizational changes that should accompany the implementation of computer systems, improve the general understanding of how information technology influences economic performance, and inform teaching of information technology management. http:\/\/grace.wharton.upenn.edu\/~lhitt\/","title":"CAREER: The Economics of Information Technology, Organization and Productivity: Theory Development and Empirical Analysis","awardID":"9733877","effectiveDate":"1998-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["281586"],"PO":["495796"]},"29489":{"abstract":"Logic forms a basic framework for artificial intelligence, including machine learning and knowledge discovery in databases. Predicate logic, which is used by several machine learning systems, poses both open problems of learning complexity and questions that do not arise in other approaches to learning. There are algorithmic approaches to knowledge discovery in databases that suggest several open problems for propositional and predicate logic, and complexity theory. Some of the learnability issues specific to predicate logic that will be studied are the role of background knowledge, the efficiency of the algorithmic techniques of logic learning, such as least general generalizations, the complexity of learning multiple predicates, and types of noise that either are specific to predicate logic, or appear to behave differently for predicate logic. The first two issues will be studied using the producthomomorphism method. This technique, introduced by one of the PI's and developed further by both PI's, enables the use of combinatorial tools in constructing learning algorithms. One extension to be studied is learning certain broader classes of logic programs, which are useful for practical applications. The complexity of the general product-homomorphism problem will also be investigated. In the area of noise-tolerance, one topic to be studied is the complexity of learning Boolean conjunctions in noise models that are more difficult for the learner than random classification noise. This could lead to extensions of previous work of the PI's on learning noisy logic programs. Expanding the scope of learning problems studied in learning theory, the project will construct algorithms for relations definable in a finite model by restricted classes of formulas, such as formulas with a bounded number of variables. This continues the model theoretic approach to learning, studied earlier by one of the PI's. Another, related family of problems involves classes of atomic f ormulas satisfying first-order constraints. In knowledge discovery in databases, a logic- based approach is to find the theory of the database, which means identifying all interesting statements that hold in the database, using an appropriate notion of interesting statement. Algorithmically, this requires polynomial-delay listing algorithms for different classes of objects, such as the maximal frequent sets of a 0-1 matrix. The project will study the possibilities of gaining efficiency by taking into account the structure of the database. This leads to questions about restricted classes of threshold circuits, and generalized versions of the minimal hitting set listing problem. The methods to be used are primarily combinatorial, such as products and homomorphisms of graphs, and model- theoretic games. This project will contribute to the understanding of the limits of efficient learnability in predicate logic. It will also develop new algorithms that may be useful for practical machinelearning systems, and contribute to the methodology for tolerating noisy data. The overall goal of this work is to gain a better understanding of the computational complexity aspects of learning using logic.","title":"Logic-Based Approaches to Learning and Knowledge Discovery","awardID":"9800070","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["528421","409637"],"PO":["528421"]},"32283":{"abstract":"Tiling is a well-known optimization technique that has been used to obtain orders of magnitude performance improvements on certain types of computer programs -- ones with nicely structured loops and regular memory accesses. This research will extend tiling and related optimization techniques to a larger class of programs. The methods employed to carry out these goals are: (1) Collect a corpus of scientific applications, including unstructured programs and programs with irregular memory accesses. (2) Build a high- level analysis tool to study this corpus and to provide information that can be used to guide program transformations. (3) Develop more powerful transformations to extend tiling to this corpus. These transformations will be embodied in a source-to- source program restructurer. (4) Build an architecturally-driven guidance system to guide the choice of transformations. This system will model the multitiered parallelism and memory hierarchies of modern computers. (5) Evaluate the new transformations compared to hand-optimized versions of the applications. The projected impact of the work is the development of compiler technology that will automatically improve the performance of a broad class of computer programs for scientific applications.","title":"Coordinated Restructuring of Programs and Storage","awardID":"9808946","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["481145","218864"],"PO":["209879"]},"31096":{"abstract":"Most current digital video systems merely replace existing modes of analog video delivery with their more efficient digital counterparts. However, as packet-based networks, such as the Internet, start to be an essential component of the communications infrastructure and general purpose computers become the predominant communication terminal, there is a need to provide a new set of algorithms for video compression and processing, which are optimized for an endto- end software processing environment. The challenge is then to find efficient ways of embedding video data on a fundamentally asynchronous transmission\/processing infrastructure. To address this challenge this project concentrates on two main areas: (i) computation\/bandwidth scalable coding and (ii) robust asynchronous video transmission algorithms. The Internet is a heterogeneous network, both in terms of its components (hosts, routers) and in terms of available bandwidth and processing speed. Thus bandwidth\/computation scalable algorithms are desirable to enable less complex encoding\/decoding at the expense of a reduction in video quality. This project is developing a design methodology for variable complexity, input dependent coding\/decoding algorithms where the goal is optimizing average (instead of \"worst-case\") complexity performance, robust asynchronous video transmission algorithms are also being developed, as motivated by the limited transmission reliability offered by the Internet. Video is sensitive not only to losses of information (e.g. packets being dropped due to congestion) but also to excessive delay. This work concentrates on new compression techniques for asynchronous video transmission where each video unit (a part of a frame) has a ``lifetime'' during which it is useful, and which can span more than a single frame time interval. This area includes novel work in both rate control and image domain error correction\/detection techniques.","title":"Tools for Image and Video Transmission over Heterogeneous Network","awardID":"9804959","effectiveDate":"1998-08-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["451991"],"PO":["564898"]},"24155":{"abstract":"The project builds on work on algorithms, tools, and applications for parallel\/distributed Symbolic and Algebraic Computation (SAC). Existing tools for parallel SAC will be refined. Additional tools will be built and applications to the algorithmic solution of specific problems in computer algebra will be made. The project also investigates the design of a system to make mathematical computations easily accessible and conveniently interoperable on the Internet. The research also involves design and implementation of experimental software that can become very useful for scientific research and mathematics education. The research focuses on the following specific areas: I. Parallel computation of GCD, factors, Grobner Basis, and Characteristic Sets of polynomials. 2. Building and refining PVM (MPI) based tools for parallel\/distributed SAC. 3. Initial Design of a distributed system for Internet Accessible Mathematical Computing (IAMC).","title":"Parallel\/Distributed Symbolic Computation","awardID":"9721343","effectiveDate":"1998-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["277844"],"PO":["321058"]},"27488":{"abstract":"This work concerns two topics in numerical linear algebra: 1) Regularization of ill-posed linear systems; 2) Solution of large, sparse eigenvalue problems. These topics share common features: a wide range of application problems; the use of iterative methods for large-scale problems; and interesting problems in matrix perturbation theory. When continuous ill-posed problems are discretized they result in ill-conditioned linear systems which must be regularized to yield accurate solutions. This part of the work has several goals. The first is to prove the folk theorem that if the components of the data vector with respect to the singular vectors of the matrix decay sufficiently fast then the conjugate gradient iteration will produce a regularizing set of solution vectors. The second is to compare the numerous formulations of discrete ill-posed problems to see which are most effective. The third is to further develop preconditioners to speed convergence of solution algorithms. The fourth is to improve data-gathering techniques so that the attainable accuracy from imaging is better, thus, for example, revealing smaller tumors or more information about distant stars. Over the past decade many new algorithms for finding clusters of eigenvalues of large matrices have been proposed. Although the effectiveness of some of these algorithms has been demonstrated empirically, analytic results are sparse. Fortunately, a large number of these methods share a common framework, so that it is possible to develop analytic tools that are widely applicable. As a start toward this goal, attention is focused on a new, promising method---singular vector enhancement---that fits in the framework. A preliminary analysis of a special case has already yielded valuable results on the relation of eigenvalues and singular values. The results of this project will impact the solution of ill-posed problems such as medical image enhancement, astronomical data processing, nondestructive testing, and spectroscopy, as well as eigenvalue problems arising in systems modeling (Markov chains), computational chemistry, and structural analysis.","title":"Numerical Methods for III-Posed Problems and Large Scale Eigenvalue Programs","awardID":"9732022","effectiveDate":"1998-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["450658","279149"],"PO":["179846"]},"30590":{"abstract":"Author: vjohn at nsf18 Date: 6\/16\/98 1:42 PM Priority: Normal TO: adthomas Subject: abstract for 9803387 ------------------------------- Message Contents ------------------------------- Abstract Proposal No: 9803387 Proposal Type: Investigator Initiated - RUI Principal Investigator: Jian Ma Affiliation: Amherst College This grant is jointly awarded through the Separations and Purification of the Chemical and Transport Systems Division and the Condensed Matter Physics Porgram of the Division of Materials Research. The principal investigator is Dr. Jian Ma at Amherst College. The research project delineates specific studies to develop a set of experimental and modeling tools to characterize porous media. The project consists of a series of adsorption-desorption isohterm and dynamic measurements on a variety of porous materials that have different intrinsic pore geometries and network structures. The measurements are complemented by computer modeling. Porous materials are ubiquitous and have diverse applications in chemical processes. Despite extensive efforts, a comprehensive understanding of the correlation between pore structure and adsorption behavior has been lacking, due to the complexity of porous materials. Given the significant advancement in statistical mechanics and the tremendous improvement in computing power in the last decade, it is timely to develop a package of experimental\/modeling tools to characterize porous solids. Such fundamental understanding will help improve our ability to design new adsorbents, catalysts, membranes etc., and will impact the knowledge base in environmental processes.","title":"RUI: Adsorption and Desorption Studies of Porous Media","awardID":"9803387","effectiveDate":"1998-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1417","name":"CHEMICAL & BIOLOGICAL SEPAR"}}],"PIcoPI":["25139"],"PO":["428476"]},"28138":{"abstract":"The promise of the information age is the delivery of more information than has ever been available before. Unfortunately, human ability to manage and process information remains mostly unchanged. The result of this mismatch is information overload. This project extends one approach to alleviating information overload--collaborative filtering--to provide a new way to assist individuals in personal information selection. Collaborative filtering uses the opinions of member of a community about information objects to recommend a subset of those objects to each individual in the community. The technique works well for small communities in which each user has evaluated many of the information objects. This project uses sophisticated statistical and computation techniques to extend collaborative filtering to communities with millions of users who may have evaluated only a fraction of a percent of the available items. As part of this work, the researchers are developing measures of confidence to help users determine how much faith to place in a particular recommendation. This research project will allow an already booming personalization industry to move from niche markets into mainstream communities and markets; at the same time, it will provide the measures needed for other researchers to evaluate new filtering algorithms and techniques. http:\/\/www.cs.umn.edu\/Research\/GroupLens","title":"CAREER: Algorithmic Issues in Collaborative Filtering","awardID":"9734442","effectiveDate":"1998-08-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["550380"],"PO":["565227"]},"31284":{"abstract":"9805538 Hughes, Herman D. Michigan State University CISE Postdoc: Experimental Research on Wireless ATM Network This research focuses on investigating extensions of the Asynchronous Transfer Mode (ATM) signaling protocol to support connection hand-offs in a hybrid network environment. A hierarchical hand-off scheme is developed to support connection hand-offs for the integration of the wireless and wireline ATM networks. This hand-off scheme combines the clustering, the incremental connection re-establishment, and the virtual hierarchical network techniques to provide fast and efficient connection re-routings. A special mechanism is included in this scheme to reroute undelivered and mis-routed cells to their destination, which in turn reduces cell loss due to connection hand-offs. The hand-off procedure under consideration is evaluated by using two approaches. First, an analysis to be conducted presents the theoretical performance, determining metrics such as connection disruption time, buffer requirement, and cell loss rate. Second, experiments (via wireless devices and emulations) are to be conducted by using the High Speed Networking and Performance (HSNP) Laboratory ATM testbed. This research is significant because it deals with key interoperability issues relating to wireless ATM networks. The Postdoctoral Research Associate will play a pivotal role in all aspects of this project, including the experimental portion.","title":"CISE PostDOC: Experimental Research on Wireless ATM Network","awardID":"9805538","effectiveDate":"1998-08-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["140260"],"PO":["564318"]},"31053":{"abstract":"The goal of this research is to study complexity issues, develop algorithms, and perform experiments with adaptive data compression algorithms, both lossless and lossy. We build upon our previous research and continue a blend of theoretical and experimental work. We are interested in methods that both compress well and can be implemented to run in real-time in high bandwidth applications where robustness with respect to channel errors \/ storage corruption may be required. General areas of research addressed are error resilience, 2D lossless compression, adaptive methods for (lossy) image and video compression, parallel algorithms and architectures, and automated browsing based upon the \"learning\" employed by adaptive compression methods.","title":"High Performance Adaptive Data Compression","awardID":"9804845","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["139931"],"PO":["188393"]},"32153":{"abstract":"It is believed that there are two major challenges in the overall success of multi-threaded architectures: (1) Building multi-threaded systems with off-the-shelf components and, (2) Providing effective programming language and compiler support for common imperative languages (like C and Fortran). At the University of Delaware Gao's research group has successfully built a multi-threaded machine from off-the-shelf components. The remaining challenge is to demonstrate successful use of imperative languages for such architectures. This project proposes to investigate whether aggressive interprocedural analysis and transformations, combined with accurate alias analysis, can be applied to irregular applications coded in imperative languages for compilation and efficient execution on multi-threaded systems. Novel analysis, transformation and code generation techniques are being developed to examine the strengths (and weaknesses) of using imperative languages for multi-threaded systems. The major challenge in generating code is partitioning the sequential code into strands, such that the code for each strand can be executed without requiring any remote memory references. Before strand partitioning, interprocedural code motion and loop transformations will be used to reduce the frequency of off-processor references and enable better strand partitioning. Developing new analyses for these transformations, which take into account the possibility of aliasing and the cost functions for multi-threaded architectures is one of the main focus of this project. Also, since registers are not reallocated during a context switch in these systems, new inter-strand register allocation techniques are also being developed.","title":"Compiling Irregular Applications on a Multi-threaded Architecture","awardID":"9808522","effectiveDate":"1998-08-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["527984","558505","475422"],"PO":["250083"]},"34584":{"abstract":"The objective of this research is an initial exploration of developmental learning by machines. This is motivated by human cognitive development from infancy to adulthood. It requires a fundamentally different way of addressing the issue of machine intelligence. The basic goal of the proposed developmental learning algorithm is to enable a machine to develop its cognitive capability, after its \"birth,\" through direct interactions with its environment. The developmental learning concept does not mean just from small to big and from simple to complex. It requires the system to learn new tasks and, as a special case, new aspects of a complex task without a need for reprogramming. The basic nature of developmental learning plays a central role in enabling a human being to incrementally scale up his or her level of intelligence from ground up. In the proposed exploratory study, the major basic concepts for developmental learning will be crystallized and some preliminary experimental results will be produced for the focused task category of recognition through interactive training.","title":"SGER: Exploratory Study for Interactive Development of An Object Recognizer","awardID":"9815191","effectiveDate":"1998-08-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["99531"],"PO":["475621"]},"32176":{"abstract":"Java is designed to be a mature, object-oriented programming languagemainly for Web-based programming. However, Java can support general stand-alone applications as well, such as scientific codes that consist of independent components using exceptions as a control mechanism between components. Although Java is too new to have been used extensively in applications, it is clear that user-defined exceptions will be ubiquitous in Java programs, causing them to exhibit distinctive control flow, different from previous object-oriented languages. The proposed research concentrates on combining new analysis techniques with two optimization strategies, namely speculative and non- speculative, using a testbed of scientific applications for validation. Exceptions pose new challenges to optimizing compilers since they introduce implicit control flow and their semantics requires access to user-visible state at any raised exception. Optimization strategies may either preserve exceptions and their visible states, or perform speculative optimizations by ignoring exceptions, and restore the visible state if an exception is raised. New static analyses are needed to provide an accurate estimate of control flow within and across method boundaries, including concrete type inference and subsequent def-use analyses. The resulting information is crucial for the effectiveness of many optimizations, including code specialization, code motion, register allocation, and instruction scheduling.","title":"Effective Compilation in the Presence of Exceptions","awardID":"9808607","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["421129","503521","438877"],"PO":["209879"]},"27556":{"abstract":"This project investigates the design and analysis of asymptotically efficient algorithms for finite matrix groups. While three decades of work in computational group theory have resulted in a thorough understanding, both theoretical and practical, of many algorithmic aspects of permutation groups, virtually no efficient algorithms have been designed until recently in the potentially more important domain of matrix groups. This latter area, however, is currently experiencing explosive growth. This research focuses on theoretical aspects and polynomial time algorithms. Past experience shows that this approach has the potential of yielding important insights which may lead to efficient implementations. Indeed, algorithms inspired by the polynomial-time paradigm have made their way into the widely used group theory package GAP. The main objective is to map out the normal structure of a matrix group given by a list of generators. Components of this project include a number of problems to be handled in the more general context of \"black-box groups\" (the group operations are performed by a \"black box\"). A key ingredient is the black-box recognition of finite simple groups. Another component consists in \"getting past\" a simple top quotient. The methods include the statistical analysis of number theoretic properties of the orders of elements in finite simple groups (based on the classification of finite simple groups). One of the main obstacles seems to require the study of modular representations of simple groups. Combinatorial methods seem to be called for in the analysis of random sampling heuristics which are required for most existing matrix group algorithms.","title":"Algorithms in Finite Groups","awardID":"9732205","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["451412"],"PO":["321058"]},"37368":{"abstract":"Modern computers rely on memory hierarchies (which consist of disks, main-memory and hardware caches) for high performance and low cost. Technology trends, however, have continued to increase the access-time gaps between the layers. The gaps threaten to reduce the effectiveness of memory hierarchies unless novel techniques can be found to improve hit ratios and data movement efficiencies. The research focuses on three such techniques: adaptive virtual memory, near-optimal page coloring, and coherence- miss reduction. Adaptive virtual memory targets the disk and main- memory layers. It improves performance by observing applications' page fault patterns and adjusting page replacement and prefetching policies accordingly, and by integrating dynamic swap allocation with page managements. Near-optimal page coloring targets the main- memory and hardware cache layers. It increases cache hit ratio by carefully placing the pages into cache sets. The research studies the theoretical aspects of the problem and designs practical algorithms including profile-based optimizations based on the theoretical foundation.Coherence-miss reduction targets multi- processor caches. It uses a database system as a case study to identify common data structures and algorithms that contribute the most to cache coherence misses, and design and evaluate alternatives that perform better.Combined, the three techniques promise to improve memory hierarchy performance significantly.","title":"Adaptive Memory Hierarchy Management","awardID":"9870238","effectiveDate":"1998-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[94533],"PO":["250083"]},"29514":{"abstract":"This research addresses problems in a variety of computational settings, In each case, a significant goal of the research is to obtain new lower bounds on the problems' complexity. The prime computational setting of interest is that of the complexity of proofs in propositional tautologies is fundmental in that it is equivalent to the NP versus co-NP question. Analysis of the complexity of specific methods of proof is important in its own right as well as for practical questions of automated theorem- proving and may yield insight into the NP versus co-NP question. The research in this area is concerned with extending the range of proof systems in which complexity bounds are currently known, with particular emphasis on the study of randomly chosen k-CNF formulas. Based on past experience, methods from the study of circuit complexity are expected to be useful in this analysis. The second setting of interest is the complexity of computations on random access machines able to operate on word-level quantities at unit cost. Surprisingly efficient algorithms for a number of problems, such as sorting, have been shown in this model. The goal of the research in this area is to understand the limits of the algorithmic improvements possible in this model. The final setting is that of the complexity of representing Boolean functions so that they are easy to manipulate and compare, important properties for symbolic model checking algorithms. The major question to investigate in this area is whether representations which are easy to manipulate and compare can efficiently represent non-linear as well as linear functions.","title":"Computational and Proof Complexity Bounds","awardID":"9800124","effectiveDate":"1998-08-01","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517581"],"PO":["528421"]},"29657":{"abstract":"The goal of this research is to develop an intelligent workbench for Computer Supported Cooperative Work (CSCW), that will be used to explore research issues related to coordinated work. Promising information analysis and information visualization techniques are used to address such CSCW problem as: idea convergence difficulty, information overload, vocabulary difference, increased cognitive demand, and interface\/display problems. Evaluation of the feasibility and effectiveness of these technological mixes is carefully performed in lab experiments. The results of this research will provide insights to designs for human-computer interaction and collaboration, with possible applications in groupware, digital libraries, and Internet searches. http:\/\/ai.bpa.arizona.edu","title":"An Intelligent CSCW Workbench: Analysis, Visualization, and Agents","awardID":"9800696","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["548216",74947],"PO":["495796"]},"30691":{"abstract":"This project will develop methods to give mobile computers timely access to changing data through improved data replication. When remote replicas of files stored on a mobile computer are updated, the system must balance data staleness against using scarce and expensive network bandwidth to fetch the new version. This research will investigate methods to automatically predict when files replicated on a portable computer should be reconcilied with remote replicas, which files are of most importance to reconcile, and which remote replica is likely to have the freshest data. The project will build on the success of the Seer predictive file hoarding system. The predictive methods developed will rely on information already kept for other purposes, plus a modest amount of newly gathered information. Simulation, analytic modeling, and measurement will be used to determine suitable methods. The project will produce a working prototype system. This research will improve the quality of data for portable computer users. It will be applicable to other types of data, such as database fragments or cached Web pages.","title":"Improved Data Accesibility for Mobile Computers Through Predictive Methods","awardID":"9803658","effectiveDate":"1998-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["485932"],"PO":["250083"]},"27513":{"abstract":"This research concerns the development and analysis of numerical algorithms for the solution of eigenvalue and singular value problems, with applications to least squares and total least squares problems. Much of the work grows out of perturbation theory for generalized singular value problems. This theory is also applicable to certain generalized eigenvalue problems. The theory will thus be applied to algorithm development for various singular value and least squares problems. Specific problems to be addressed are 1. Development and analysis of methods for computing the sparse generalized singular value decomposition. 2. A more accurate procedure for computing a bidiagonal reduction of a matrix. This is the first step in the most efficient stable methods for computing the singular value decomposition. 3. An algorithm for the eigenvectors of symmetric arrow matrices that requires less communication on distributed architectures. 4. An algorithm for the solution of recursive total least squares problems using rank--revealing decompositions.","title":"Numerical Solution of Eigenvalue and Singular Value Problems with Applications","awardID":"9732081","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485393"],"PO":["179846"]},"27788":{"abstract":"This project studies how caches affect the performance of algorithms. There are two component problems to study: (i) the problem of how to analyze the cache performance of algorithms, and (ii) the problem of how to design algorithms with good cache performance and good overall performance. In order to analyze cache performance, an algorithm is modeled by its pattern of memory accesses. Models that approximate patterns of memory accesses will be investigated and analyzed to approximate the number of cache misses. The validity of the approximation is determined empirically using trace-driven cache simulation. With a better understanding of the cache performance of algorithms, algorithms that are optimized to improve cache performance, will be designed, implemented and evaluated.","title":"Design and Analysis of Algorithms in the Presence of Caches","awardID":"9732828","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["485574"],"PO":["528421"]},"27557":{"abstract":"This project investigates the synthesis of effective algebraic and numerical algorithms and on their practical and theoretical improvement. This includes the comprehensive study of practical numerical algorithms for polynomial rootfinding, which is a central subject of algebraic computing. The study should include many technical novelties. Another fundamental subject covered by the project and having ubiquitous applications to many areas of scientific and engineering computing and signal processing is the computations with structured matrices. The project also includes various extensions and applications of polynomial rootfinding and structured matrices, in particular to approximating polynomial gcd, to polynomial interpolation and multipoint evaluation, and to solving polynomial systems of equations. The work also applies to sign determination and modular reduction, which is a central subject of algebraic and geometric computations, and on decoding the BCH error-correcting codes, in particular Reed-Solomon codes most important in practice.","title":"Synthesis of Algebraic and Numerical Algorithms","awardID":"9732206","effectiveDate":"1998-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485895"],"PO":["562362"]},"49029":{"abstract":"","title":"Model-Based Free-Form 3D Object Recognition","awardID":"9996004","effectiveDate":"1998-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["313372"],"PO":["234178"]},"30230":{"abstract":"This project supports -- under the ``Faculty in Industry'' activity of NSF's GOALI program -- the visit of Professor C. Richard Johnson, Jr. (School of Electrical Engineering, Cornell University) to Applied Signal Technology (Sunnyvale, CA) for the 12-month period from August 1998 to July 1999. As co-PI, Dr. Michael G. Larimore of Applied Signal Technology monitors, expedites, and collaborates in all of the major activities of the visit, including presentation of a short course on adaptive equalizer theory and design, development of a monograph on blind equalizer design (based on over 12 years of experience at Applied Signal Technology and 10 years of theoretical work at Cornell), and participation in a product development team utilizing adaptive digital signal processing in an emerging communication system. The benefits of this bilateral technology and pedagogy exchange include a heightening of the relevance (and commensurate shrinkage of the theory- practice gap) in Professor Johnson's future research and teaching efforts and broad dispersion of course and reference materials on adaptive equalization theory and design tuned to the needs of the practicing communication systems development engineer.","title":"GOALI: Adaptive DSP in Emerging Communication Systems","awardID":"9802375","effectiveDate":"1998-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["466890"],"PO":["564898"]},"34520":{"abstract":"Machine vision systems have had rather limited success in achieving understanding of image content in general cases, and the problem remains very difficult. This award, in the Small Grants for Exploratory Research mode, supports an initial exploration of machine classification of image context, as a basis for further application of context-specific approaches to image understanding. This effort will investigate methods to automate the identification of the type of an image (such as geographical map or wiring diagram) in the initially-limited domain of drawings, and then seek a top down strategy for further image analysis once the image type is known.","title":"SGER: Exlporatory Research on Context Interence","awardID":"9815047","effectiveDate":"1998-08-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[86870],"PO":["475621"]},"32496":{"abstract":"This award funds a workshop on Shape Computation. This event continues discussions began at an earlier event on the same set of topics sponsored by UCLA in May of 1997.Shape computation is focused on the study and application of shape grammars. Shape grammers were developed originally to compute with shapes directly in pen and pencil, paper drawings and physical models, with no requirement for intermediate stmbolic structures or abstract representations. The approach is novel in that shape grammars possibly allow for any arrngement of spatial elements (points, curves, surfaces, and solids) to be seen and interpreted in many ways within a fixed computational scheme - shapes can be divided into parts at any time within a computation. Shape grammars have been successful in furthering the process of design in many topical areas. This workshop will concentrate on theoretical refinements, computer implementation, applications in design sciences and applications in library and information sciences.","title":"Workshop on Shape Computation","awardID":"9809669","effectiveDate":"1998-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[81819],"PO":["433760"]},"34257":{"abstract":"An international seminar on self-stabilization is supported with the goal of establishing the state of the art in this field and setting the course for future research. The seminar, to be held August 17-21, 1998 in Wadern, Germany, focuses on practical applications of self-stabilization in the design, control, and maintenance of fault-tolerant distributed systems and computer networks. It brings together forty researchers including leading figures in the self-stabilization community, as well as selected young researchers and students. Its format makes it possible for participantsto give more in-depth presentations than is customary at conferences; it also includes problem-solving sessions and panel discussions.","title":"U.S. Attendance at the International Dagstuhl Seminar on Self-Stabilization","awardID":"9814315","effectiveDate":"1998-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["499286"],"PO":["250083"]},"24159":{"abstract":"The bandwidth required for accessing over the internet 3D models that support interactive graphic applications in manufacturing, scientific, commercial, and entertainment areas exceeds the capabilities of current personal computers and phone connections by several orders of magnitude. Anticipated technology improvements are offset by the growing need for more detailed models of oceans, cities, factories, aircrafts, virtual malls, appliances, molecules, or atomic reactions. This project will investigate new theories, architectures, datastructures, and algorithms for a 3D geometry server that will significantly reduce the delays experienced by internet client-users when first accessing complex 3D databases, when interactively navigating through the model, and when inspecting specific details. The project will explore the acceptable visual error limits in common applications and will exploit these tolerances to significantly improve on existing techniques for 3D simplification, geometric compression, and progressive transmission of 3D models. The project will develop new compact multi-resolution datastructures and new algorithms that combine 3D simplification and compression. Anticipated results may impact software products and standards for the internet exploitation of the broadly available interactive 3D graphics technology.","title":"3-D Server for Internet Access to Complex Geometric Databases","awardID":"9721358","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["370776"],"PO":["179846"]},"27569":{"abstract":"Three-dimensional \"alpha shapes\" will be explored and evaluated as a technique for describing and recognizing objects. This problem has important applications in biomedical research and instruction, clinical practice, and scientific visualization. Alpha-shapes have a well developed theory and appear promising. The first task is to complete a global correspondence scheme. Next, a pose-determination algorithm will be developed, based on matching Delaunay graphs. Initially, scenes to be described and recognized will consist of single, isolated objects. Eventually, methods will be developed to decompose complex scenes into subparts.","title":"Object Recognition using 3D Alpha Shapes","awardID":"9732240","effectiveDate":"1998-08-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["254872"],"PO":["179846"]},"32651":{"abstract":"Both microprocessor performance and on-chip densities have been growing exponentially for decades. This trend shows no signs of abatement. However, interchip communication costs are not improving nearly as rapidly, so that if present trends continue, computation will increasingly be limited by pin-bandwidth constraints, or by exotic packaging costs. This project is focused on architectures that will address the emerging bandwidth limitations in order to build cost- effective, high-performance systems. In particular, we are investigating (1) future memory hierarchies, exploring alternatives at the levels of physical design, logical organization, and system design; (2) DataScalar architectures, exploiting redundant computations to minimize communication requirements; and (3) Hybrid parallel execution, combining the DataScalar ideas with parallel threads to support multiple computation models simultaneously.","title":"Billion-Transistor Architectures","awardID":"9810114","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["138985"],"PO":["564388"]},"34587":{"abstract":"ECS-9815196 Srikant The goal of this workshop is to bring together researchers who work on various aspects of communication networks, with the aim of facilitating an enchange of information between system theorists and the rest of the networks community. Specifically, the workshop would bring together researchers working in the areas of control theory, signal processing , communications, computer science and operations research, from different institutions such as universities, industry, national laboratories and other government agencies to foster the creation of new research directions in the area of communication networks. The emphasis of this workshop would be wireless networks, including physical layer phenomena, and congestion control, scheduling and pricing in high-speed networks such as the Internet and ATM networks. A total of about 80 people will be invited to the workshop, of which there will be about 15-20 speakers, with enough time for discussions. The presentations will emphasize on an overview of the research area and open problems, thus promoting the goal of the workshop which is to set new research directions.","title":"Workshop on Future Directions in Systems and Control Research in Communications Networks, Airlie, VA, November 1998","awardID":"9815196","effectiveDate":"1998-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["509442"],"PO":["564728"]},"33961":{"abstract":"Over the last two decades there has been an explosive growth in online data storage of various forms. These large datasets have motivated the rapid development of data mining methods. However, until now, there has been a lack of an online repository of large data sets for researchers to evaluate and compare their methods. In this project, an online repository of large and difficult data sets are being gathered that are representative of the diverse character of many important scientific and business domains. This repository includes high-dimensional data sets as well as data sets of different data types (time series, spatial data, transaction data, and so forth). The primary role of the repository is that of a benchmark testbed to enable researchers in data mining (including computer scientists, statisticians, engineers, and mathematicians) to scale existing and future data analysis algorithms to very large data sets. Each data set in the respository contains online documentation, metadata, and links to relevant background domain information such as prior published work. Availability of a standard set of large benchmark data sets will directly stimulate and foster systematic progress in data mining related research, similar to the affect that the UCI Machine Learning Data Repository has had on machine learning research. This repository will play a substantial role in brokering the gap between research-oriented algorithm development in the laboratory and the real-world practicalities and challenges of very large data sets. http:\/\/www.ics.uci.edu\/~mlearn\/MLRepository.html","title":"SGER: An Online Repository of Large Data Sets for Data Mining Research and Experimentation","awardID":"9813584","effectiveDate":"1998-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["166660","420347","550872"],"PO":["563751"]},"30584":{"abstract":"9803365<br\/>Valen E. Johnson<br\/><br\/>This project develops statistical models for automatic image analysis. The image models developed are defined by arbitrarily placing a large number of points, called facets, in a template image. The facet points are organized hierarchically, and are arranged either on grids of increasing resolution or determined using more sophisticated criteria, e.g., they may be located at local extrema in the scale-space of the image. Object shapes are established by connecting facets in a tree-like structure, and then using the shape of the tree in the image template to model expected shapes of facet trees in observed images from the class. Typically, thirty to forty thousand facets are positioned within a two-dimensional image template, whereas one-quarter to one-half million facets are placed within three-dimensional image sets (e.g., magnetic resonance images or positron emission tomography images).<br\/><br\/>Models generated under this proposal facilitate computationally efficient high-level analysis of generic images. These models are applicable to a wide range of image modalities, and require only that a template image or prototype image be available for the group of images under investigation. Given an image template for the class, derived models can be applied with little or no operator intervention to obtain automatic segmentation, object identification, and volumetric analysis for available image data.","title":"Discrete Models for High-Level Image Analysis","awardID":"9803365","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["460691"],"PO":["452372"]},"31233":{"abstract":"We consider the problem of blind adaptive filtering in high- dimension vector spaces with limited data sample support. The focus application is joint space-time adaptive processing for DS\/CDMA communications systems with antenna arrays. The objective is the development of fast, low complexity optimization procedures that exhibit superior disturbance (multiple-access- interference and channel noise) suppression characteristics in small data support situations. The low optimization complexity objective implies that matrix inversion and\/or eigen decomposition operations are highly undesirable. In this context, the core subject of this investigation is the development and analysis of inductive, conditional optimization procedures in the form of a sequence of weighted auxiliary vectors that are orthonormal to each other and to the joint space-time vector direction of interest.","title":"Joint Space-Time Auxiliary-Vector Filtering for DS\/CDMA Systems with Antenna Arrays","awardID":"9805359","effectiveDate":"1998-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["490699","490695"],"PO":["150411"]},"32950":{"abstract":"Much of the research on workflow management has assumed a centrally-controlled work environment where common definitions for tasks and information are known and respected by all workgroups using the system. Autonomous groups, however, may be free to redefine or eliminate individual activities or sequences, making predefined coordination with others highly problematic. While the general problem of unconstrained workflow coordination is difficult, some classes of inter-operating workflows are constrained enough to be manageable and studyable---for example, repetitive, operations-level workflows that constitute the much of the work performed in many organizations. This project aims to produce a conceptual and formal model of coordinating interoperating workflow management systems (WFMSs) that allows compensations for task redefinitions to be fully or partially automated. The model will be partially validated by constructing an executable version of the model, and exercising the model with a set of test cases. An approach of progressive model refinement will be used to gain the ability to \"grow\" the model, using the executable model as a simulator and incorporating simulation findings back into the model. The transparent, well-articulated architecture of the model will improve understanding of dynamic task coordination and will enable improved functionality of interoperating WFMS in dynamic environments.","title":"Modeling Dynamic Task Coordination in Inter-Operating Workflow Management Systems","awardID":"9810901","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["371338"],"PO":["495796"]},"30552":{"abstract":"There is a wide gap in current knowledge about the types of conflict, conflict management strategies, and how management strategies are best linked to particular conflicts. Existing knowledge in this area has not been systematized or made formal and computational. This gap has significant practical impact, particularly in the important domain of collaborative design and concurrent engineering. Complex manufactured goods and software are increasingly designed using large-scale collaborative processes. Current, mainly manual, conflict management practices are being overwhelmed by the sheer scale and complexity of modern-day design challenges, leading to severe impacts on cost, timeliness, and effectiveness of product designs. This research will develop, within the MIT Process handbook, a formally represented, publicly accessible repository of conflict management knowledge organized in a way that helps reveal building blocks, key dimensions and regularities, and thereby (2) facilitates important uses such as learning about conflict management and developing general theories of multi-agent conflicts and exceptions. This work makes important intellectual and practical contributions---it will be a key building block for better computational algorithms for managing exceptions (including conflicts) in collaborative work. The repository itself will help researchers carry on a more cumulative ans systematic exploration of the phenomena. http:\/\/ccs.mit.edu\/klein.html","title":"A Systematic Repository of Conflict Management Expertise for Collaborative Design","awardID":"9803251","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["551789","508612","427334"],"PO":["565227"]},"33412":{"abstract":"The problem of injuries to nurses and other health care workers that are caused by lifting is a very serious and longstanding one. The objective of this research is to determine the fundamentals for the design and control of assistive devices that are either worn or directly operated by health care personnel for the purpose of augmenting human physical strength with the device's mechanical strength, while the wearer's intellect acts as the central control system for manipulating the device. In this research work all common maneuvers needed for lift and transfer patients will be studied first. To meet the maneuverability requirements determined in this study, several architectures for the device will be designed. Then the actuators will be designed and built to behave inherently like Hill's model of the human arm. Adaptive control rules will be developed for this assist device which prevent human-induced instability in the presence of variations in the human dynamics. The control algorithm in the device also transfers to the nurse's arms, as feedback, a scaled-down value of the patient's actual weight. The hypothesis is that these devices, when used by nurses to maneuver patients, reduce the risk of back injuries in the nurses.","title":"REU: Preventing Back Injuries in Nurses and other Health Care Personnel","awardID":"9811941","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["549674"],"PO":["234178"]},"32202":{"abstract":"This project will investigate the nature of constraint systems that can be used to solve problems in the compile- time analysis of programs that manipulate arrays. Accurate analysis of array references is critical to the automatic optimization of scientific programs for parallel supercomputers. Empirical evidence has shown that this analysis can be described accurately using constraints (which is not surprising), and that the resulting constraints can be manipulated efficiently (which is quite surprising, given the constraint system involved). This project will investigate the apparent discrepancy between the worst-case complexity of the general constraint solver (2^2^2^n) and the observed efficiency of constraint-based dependence analysis, seeking a formal description of a constraint system that includes many of the cases that arise during analysis of benchmark programs but can still be manipulated efficiently. Such a formal description will provide a deeper understanding of the practical applications of constraint manipulation algorithms and provide a guide for potential users. The new constraint manipulation algorithms will be implemented within the framework of the National Compiler Infrastructure and made freely available.","title":"RUI: Constraint Systems for Analysis of Scientic Programs","awardID":"9808694","effectiveDate":"1998-08-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["518493"],"PO":["209879"]},"32389":{"abstract":"This project is establishing a lasting collection of tools for converting speech to text and for speech understanding. The collection is based on an extensible C++ speech recognition system, for which both source code and object modules are available. Public access to this system is encouraged in three ways: by a web site, with community-wide design reviews, and with educational materials. The website includes the C++ software, together with a toolkit for evaluation of speech-recognition software and a set of Java applets for educational purposes. The design reviews are similiar to workshops, and cover topics such as software design and algorithm selection for new versions of the publicly available speech system. Finally, educational web sites and tutorials lower the barriers to performing research in speech-to-text systems.","title":"CARE: Internet-Accessible Speech Recognition Technology","awardID":"9809300","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["543480"],"PO":["179487"]},"31179":{"abstract":"This project addresses methods for increasing the density and robustness of data storage systems. Specifically, it extends our work on combined maximum transition run (MTR) coding and signal space detection to recording channels at very high densities and to cope more efficiently with realistic noise and nonlinearity encountered in such channels. In particular, MTR coding and other distance-enhancing code constraints will be investigated for use in future high density recording channels. Generalized signal space detection methods which will be used in conjunction with the distance-enhancing codes will also be studied. The proposed research tasks are: 1) performance analysis of MTR codes in the presence of medium noise and nonlinearity; 2) distance analysis and search for other distance-enhancing code constraints incorporating the data-dependent nature of transition noise and nonlinearity; 3) derivation of optimal hyperplanes better suited to data-dependent noise and nonlinearity; and 4) finding generalized signal space partitioning methods in higher dimensions to develop efficient constrained-delay detectors.","title":"Combined Coding and Detection for High Density Storage Channels","awardID":"9805195","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["347819"],"PO":["150411"]},"37516":{"abstract":"Current microprocessor design directions are towards chips that provide greater instruction-level parallelism (ILP). Unfortunately, large amounts of ILP hardware and aggressive instruction scheduling techniques put large demands on a machine's register resources. With large levels of ILP, it is difficult to maintain a single register bank. The number of ports required for such a register bank severely hampers access time and may require too much chip space. As a result,partitioned register banks with limited connectivity are needed forhigh ILP architectures. The use of partitioned register banks,however, inhibits ILP when data is fetched from another register bank. This research addresses methods to reduce the overhead associated with partitioned register banks in a machine-independent fashion. Specifically, the research addresses the following issues 1. A machine-independent program representation modeling communication and parallelism. 2. New algorithms to partition data amongst a machine's register banks. 3. Loop transformations that expose the data parallelism at the instruction level. 4. Clustering schemes that allow a group of functional units to access a single register bank. As a result of this research, higher levels of ILP will be more attractive due to a lower overhead associated with partitioned register banks.","title":"Code Generation for ILP Architectures with Partitioned Register Banks","awardID":"9870871","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["530278","397863"],"PO":["209879"]},"30773":{"abstract":"9803853 Information Theory-Based Measurement of Software Designs is a research project that is defining and validating a new generation of software design metrics, based on information theory, which in turn, will facilitate a new level of cost- effective improvement to software quality. This project is developing metrics of cohesion and coupling on abstractions of software that are created during high-level design, so that quality problems may be detected early in the life cycle. Since many design abstractions are represented by graphs, metrics of graph attributes will likely find broad application. Many traditional software metrics count features, as if all items were equally important in the design process. Information theory is an alternative approach that focuses on the amount of information in an attribute, rather than a count. This project is establishing a new generation of information theory-based software design metrics by definition and empirical validation of metrics for cohesion and coupling. Collaboration with a large telecommunications equipment manufacturer is providing the basis for credible case studies, where the system studied is being developed by a group of professionals in an industrial environment, and is large enough to be comparable to other industry projects.***","title":"Information Theory-Based Measurement of Software Designs","awardID":"9803853","effectiveDate":"1998-08-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["112972"],"PO":["150697"]},"30542":{"abstract":"----------------------------------------------------------------------- Proposal Number: DMS 9803226 PI: Werner Stuetzle, Brian Curless, Tom Duchamp Institution: University of Washington Project: 3D Scanning: Acquiring and Modeling Surface Properties Abstract: 3D scanning is the inverse of computer aided manufacturing: given a physical object, such as a clay model of a car, a sculpture, a chair, or a house, create an electronic representation capturing its shape and appearance. 3D scanning is similar in principle to a number of other important technologies (like digital audio, digital photography, document scanning, and digital video) that quickly, accurately, and cheaply record useful aspects of physical reality. These technologies have had an enormous impact, primarily because electronic representations can be used in ways the original physical objects cannot. For example, they can be stored in, searched for, and retrieved from databases, transmitted electronically over long distances, manipulated and edited in software, and used as templates for making electronic or physical copies. Research in 3D scanning promises to have a similar impact on a number of areas, including the Federal Strategic Areas of high performance communication, civil infrastructure, and manufacturing, as well as virtual museums, entertainment, and product marketing. This research group and others have made significant progress in capturing, modeling, and displaying geometric shape. The task of acquiring and computing surface properties such as appearance, however, has received far less attention. The research effort in this project focuses on three aspects of the problem: (i) texturing, bump mapping and selective refinement of multiresolution meshes, (ii) capturing, modeling and displaying radiance (color as a function of position and direction), and (iii) generally estimating functions over surfaces.","title":"3D Scanning: Acquiring and Modeling Surface Properties","awardID":"9803226","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["274681","224804","438138"],"PO":["517983"]},"30696":{"abstract":"This project develops a novel architecture for the construction of scalable Internet servers from commodity hardware and modular application software components. The architecture targets network servers based on clusters of workstations or PCs, and allows servers to fully realize the performance potential of this platform. Off-the-shelf server applications are executing on the server nodes in a modular fashion and are unaware of the existence of multiple server nodes. As a result, ScalaServer leverages both existing server applications and the price\/performance curve of commodity hardware. The design of the ScalaServer architecture will be based on the results of extensive tracedriven simulations. Prototype systems for both single-node and cluster servers will be disseminated to the research community. It is expected that the project will significantly advance the state-of-the-art in highperformance, scalable, and cost-effective network server design and implementation, an area that is critical to the future global information infrastructure. The project will also contribute to the education of scientists and engineers in this important area, both at the graduate and undergraduate level.***","title":"ScalaServer: System Support for Scalable Network Servers","awardID":"9803673","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["191820","282239"],"PO":["209879"]},"32643":{"abstract":"9810098 Simon The objective of this research is to extend porohyperelastic transport swelling (PHETS) field theories developed by the investigators for the coupled structural and transport properties of large arteries. New finite element models based on the extended theories will be implemented and used to analyze the results of experiments on the transport of charged and neutral species in excised rabbit carotid arteries under various loading conditions. With PHETS material parameters for nonlinear anisotropic tissue elasticity, permeability, diffusivity, mechano-chemical coupling, and convection thus identified from the analysis of the experimental studies, the new models will be able to predict the results of in-vivo conditions that can not readily be performed experimentally and to characterize the action of intravascular local drug delivery systems. Experimental studies in de-endothelialized rabbit carotid arteries will examine the transport of fluorescence-labeled charged and neutral species under pressure loading alone as well as combined pressure and flow conditions. ***","title":"Poroelastic Transport of Neutral and Charged Species in Arterial Tissue","awardID":"9810098","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["560057",82203],"PO":["564986"]},"27507":{"abstract":"Computer programs to perform symbolic calculations to solve mathematical, scientific, and engineering problems have become popular and highly useful in the last decade. However, systems for symbolic computation in noncommutative algebras have not attained the generality of systems for commutative algebra. This project develops a system for symbolic computation in Hopf algebras, and supports algebras and Hopf algebras. The project relies on multidisciplinary interaction between algebraists and computer scientists. The Hopf system uses the GAP system as a foundation upon which to build more advanced functions. GAP is freely distributed over the Internet, as is the Hopf system. The Hopf system is able to support advanced research in noncommutative algebras and their applications to science, especially mathematics and physics.","title":"A System for Symbolic Computation in Hopf Algebras","awardID":"9732068","effectiveDate":"1998-08-15","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["176513","473966"],"PO":["179846"]},"33645":{"abstract":"ABSTRACT: UMass, W. Burleson, PI<br\/><br\/>This CISE Educational Innovation project supports the development of a series of multimedia instructional modules in areas of computer engineering. The modules are presented with innovative multimedia techniques thus providing a direct example of the technology that they discuss. The project also includes development of an archive of design projects related to multimedia systems and linked to the instructional modules at various levels. The modules and design projects are developed in the context of six different undergraduate courses at the university. Dissemination is accomplished through use of Digital Video Disks (DVD) and through the Video Instructional Program at the institution, a distance education program with a 23-year history of use. Underrepresented groups are involved, through the Women's Engineering and Minority Engineering programs at the University and through the involvement of Smith College, a women's college, and the University of Massachusetts-Boston and Springfield Technical College, both of which serve significant numbers of minority students.","title":"Educational Innovation: Multimedia Systems - An Ingtegrated Modular Curriculum","awardID":"9812589","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["251935","443993","553615","550433","438750"],"PO":["289456"]},"34767":{"abstract":"9815727<br\/>Katehi, Linda<br\/>University of Michigan<br\/><br\/>The objective of the workshop is to identify the R&D needs for enabling and supporting the next generation Wireless Technologies and Information Networks. The workshop will address fundamental research issues and the technological challenges that must be resolved to enable the wireless technologies and facilitate their full and optimized utilization in a wide variety of applications central to the society's effective performance in the next millennium. The focus in the workshop will be on the physical devices used in wireless networks and on the networking\/communications algorithms and the signal processing techniques employed by those devices.","title":"Workshop:Wireless Technology and Information Networks","awardID":"9815727","effectiveDate":"1998-08-15","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7430","name":"UNDERGRAD FACULTY ENHANC PROGR"}}],"PIcoPI":["513776"],"PO":["395818"]},"31038":{"abstract":"In 1993, a group of French researchers announced the invention of ``turbo-codes,'' a fundamentally new approach to the problem of attaining near Shannon limit performance on a variety of communications channel models. Many researchers believe that turbo codes are the most important new idea in error-correcting codes since Shannon's original paper. Professor McEliece's work under this NSF grant is motivated by the desire to provide a sound theoretical explanation for the experimentally verified iterative turbo decoding algorithm, which is the key innovation of the French group. McEliece's research has led to the discovery of a close connection between the turbo decoding algorithm and a number of other algorithms known in the cryptography, information theory, digital communications, signal processing, statistics, and artificial intelligence communities. McEliece and his co-workers have shown that all of these algorithms can be unified by a single technique which he calls the generalized distributive law, or GDL. In this work, the goal is to exploit the GDL to (a) search for a theoretical explanation of the turbo decoding algorithm, and (b) to devise new decoding algorithms in non-turbo situations.","title":"The Turbo Decoding Algorithm and its Relatives","awardID":"9804793","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["279563"],"PO":["188393"]},"37957":{"abstract":"This award funds an NSF Research Planning Workshop on Self-reconfiguring Robots, to be held in the Fall of 1998 at the Minary Center, New Hampshire. The workshop will investigate the scientific and engineering challenges in building and using self-reconfiguring robots to increase the flexibility of robot systems. Self-reconfiguring robots consist of a set of identical modules that can dynamically and autonomously reconfigure in a variety of shapes, to best fit the terrain the robot has to navigate, the shape of the object the robt has to manipulate, or the sensing needs of the task. A modular robotic structure that can metamorphose into a different geometric structure by reorganizing internally its modules supports multiple modalities of navigation, manipulation, and sensing. Self-reconfiguration provides a paradigm shift for studying the fundamental principles of organization and reorganization in physical systems. In robotics, self-reconfiguration defines a rich class of questions about designing, controlling, and using massively distributed systems of robots. The scientific foundations of self-reconfiguring robotics are only beginning to emerge. Progress in this field will be enabled by advances in mechanical design, distributed systems, and planning. The workshop on self-reconfiguring robotics will bring together leading experts in this field to discuss the current state of the field and to set short term and long term research goals. A summary of the discussion will be provided as a Web site and as a Dartmouth computer science technical report.","title":"Workshop on Self-Reconfiguring Robots","awardID":"9873671","effectiveDate":"1998-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["527733"],"PO":["475621"]},"37847":{"abstract":"AST-9872665 Crutcher The 8th annual conference on Astronomical Data Analysis Software and Systems (ADASS) will be held at the University of Illinois, Urbana, Illinois, November 1-4, 1998. The seven previous ADASS meetings have established this series of conferences as the leading world forum for scientists and programmers to discuss issues of common interest regarding algorithms and software systems for the acquisition, reduction, analysis, archiving, and retrieval of astronomical data. Due to the success of the ADASS conferences, ADASS is now the sole forum for discussions of astronomical software and techniques. The goal of these conferences is to facilitate the exchange of information and to foster continuing communication between software developers (including those in the computer industry at large) and users in the astronomical community. ADASS 98 has the following components. There will be two formal short workshops taught by leading experts: An Introduction to Parallel Computing and Topics in Java Application Development. There will be invited talks on the special topics scheduled for ADASS 98: The Future of Astronomical Computing, Advanced Visualization Technologies, PCs in Astronomy, Measuring the Cosmological Constant via Automated Supernova Detection, and Computer Security in a Scientific Environment. In addition, there will be contributed talks, poster papers, and informal Birds of a Feather sessions. ***","title":"Astronomical Data Analysis and Systems VIII Conference: November1-4, 1998 at the University of Illinois, Urbana","awardID":"9872665","effectiveDate":"1998-08-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1219","name":"SPECIAL PROGRAMS IN ASTRONOMY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["497504"],"PO":["469023"]},"30720":{"abstract":"Meeting the requirements of dependable distributed real-time systems poses considerable challenges. Many of the systems to be built are required to be both hard real-time and to use off-the- shelf commercial hardware and software components. The need for using off-the-shelf components conflicts fundamentally with the classical ``guaranteed response'' hard real-time design methodology. The aim of the proposed research is to develop novel services, algorithms and system design methodologies that are applicable to the design of hard real-time distributed systems built from off-the-shelf components. A second goal is to embody these novel services, algorithms and design methodologies into a prototype distributed fault-tolerant application development environment that would allow hard-real time services and soft-real time services to co-exist harmoniously. A third goal is to investigate means for making such systems and services secure to adverse attacks. Initially the project will focus on continuing an on-going exploration of the fail-aware design paradigm, as a middle of the road approach between the ``guaranteed response'' hard real-time design methodology and the ``best effort'' soft real time paradigm. More broadly, it is expected that other aspects of specifying, designing, securing and validating dependable distributed real-time systems will be considered.","title":"Dependable Distributed Real-Time","awardID":"9803743","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["451956",77514,77515],"PO":["241298"]},"31710":{"abstract":"9807015 Perlin This U.S.-Brazil award will support a research collaboration between Drs. Kenneth Perlin and Robert Rowe of New York University to work with Professor Jodo Antonio Zuffo at the Laboratorio de Sistemas Integraveis da Escola Politecnica (LSI-USP) at the University of Sao Paulo and with Professor Mauricio V. Kritz at the Laboratorio Nacional de Computacao Cientifica (LNCC) in Rio de Janeiro, as well as with Professor Luiz Velho at Instituto de Matematica Pura e Aplicada (IMPA) in Brazil on multi-media research. Specifically they will work with two major software platforms, Pad and Improv, creating believable embodied agents combining procedural animation techniques, behavioral scripting, and distributed environments. The Experimental and Integrated Activities Program of the Computer and Information Science and Engineering Division is providing part of the support. This collaboration continues a relationship among colleagues from three labs in Brazil, which was started in 1992 by Perlin. Perlin's work with IMPA involves an investigation of procedural multiresolution paint textures involving Pad, which provides a mechanism to generate a large number of details with a simple and compact representation. With LNCC, they are working on recursive hypergraph representation to model interactions in biological systems. NYU and LSI-USP are working on an integration of their animation research with their work on multimodal input and output devices. The project will involve graduate students from both sides in the collaboration. ***","title":"U.S.-Brazil International Collaboration for Multimedia Research","awardID":"9807015","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["482097"],"PO":["493911"]},"30995":{"abstract":"The goal of this research is to develop scalable, automated methods to design high-performance embedded systems - particularly those with real-time latency and throughput requirements. In such systems, computations flow through heterogeneous interacting components, which are managed by local resource-schedulers and drivers. Hence, a key design problem is that of balancing and tuning the local resource-managers, so that they collaboratively meet the global end-to-end performance objectives. The proposed approach involves parametrically transforming the end-to-end constraints into local (per-component) constraints, and then solving them for optimal on-line performance. Specifically, the method works by (1) extracting performance models for key stages along the all data paths; (2) hierarchically grouping the per- component models into larger system-level prototypes; and (3) using the system-level models to help calibrate the local resource management policies. Step (3) is called \"design synthesis.\" To carry it out, the proposed method relies on off-line algorithms to synthesize optimal CPU\/IO bandwidth allocations for all pipeline stages. After synthesis, the analytic estimates are checked via simulation. Then the system is integrated, and rechecked via on- line benchmarking. Two reference applications are proposed to validate this framework: (1) A software realization of a large- scale radar signal processor, to be run on several workstation- clusters; and (2) a video server system connected via 100Mbs partitioned Ethernet.","title":"Parametric Design of Embedded Real-Time Systems","awardID":"9804679","effectiveDate":"1998-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[78173,"548322"],"PO":["241298"]},"35978":{"abstract":"This award is to provide the Division of Information and Intelligent Systems (IIS) the use of Friday Systems to perform support services related to the NSF program Soliciation \"Digital Libraries Initiative - Phase 2 (NSF-98-63.","title":"Proposal Processing and Data Entry Support for the Digital Libraries Initiative-Phase 2","awardID":"9819272","effectiveDate":"1998-08-28","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["234671","126623"],"PO":["433760"]},"31623":{"abstract":"EIA-9806718 Mairson, Harry G. Bawden, Alan Brandeis University ESS: Linear Naming: Experimental Software for Optimizing Communication Protocols The goal of our research project is to design and implement significantly new forms of procedure calling protocols for local and distributed communication. This project combines development of applications technology with foundational research on programming language design. The research focuses on the implementation of a new procedure-calling protocol that incorporates the desirable semantics of call-by-value with the efficiency of call-by-name. The implementation depends on the technology of sharing values as well as the sharing of computation threads. Closely linked is the development of language primitives for handling values and control structures in a symmetric manner. The pragmatics of sharing is intimately connected to the crucial role of \"linear naming\" in distributed network computation, especially when named computations are mobile. Procedure-calling protocols and their interaction with naming form the glue that holds complex computations together. In a distributed environment, parts of an evolving computation can become separated from each other. A fundamental problem is bringing these parts back together again when the appropriate time arrives---this is what naming is for. Proper attention to linearity in naming can make cross-network references cheap, can support highly mobile data structures, and can facilitate heuristics to effectively migrate tasks on demand without explicit guidance.","title":"Experimental Software Systems: Linear Naming: Experimental Software for Optimizing Communication Protocols","awardID":"9806718","effectiveDate":"1998-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["370683",79679],"PO":["539087"]},"30424":{"abstract":"This project aims to develop a new visual exploration paradigm emphasizing integrated data\/metadata analysis and to use it to enhance the capabilities of the DEVise (Data Exploration and VISualization Environment) tool. From a research standpoint, several issues require attention in developing such tools, including optimization and evaluation techniques to support scalability for large datasets, integrated presentation of data and metadata, combination of database-style querying and visualization, and support for collaborative analysis. This is expected to lead to significantly improved interactive visual interfaces to large, distributed databases, with potential applications in a wide variety of commercial and scientific domains. The results will be published in articles, and embodied in a prototype tool that will be freely distributed in binary form. http:\/\/www.cs.wisc.edu\/~devise","title":"Interactive Visualization and Collaboration Analysis of Very Large Datasets","awardID":"9802882","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["560467","284906"],"PO":["563751"]},"30699":{"abstract":"The goal of this research is to make it possible for parallel programs, running on asynchronous shared-memory multiprocessors, to share data flexibly, efficiently, and reliably. Specifically, the research seeks to develop algorithms for building system software that (1) make it easy to implement any shared data structure, (2) ensure that accesses to implemented shared data structures are fast, and (3) ensure that the implemented shared data structures are fault-tolerant. A wait-free implementation of a shared data structure ensures that the data structure remains accessible to correct processes even if some processes in the system crash. A universal construction is an algorithm that makes it easy to design a wait-free implementation of any shared data structure. To realize the goal stated in the previous paragraph, this research seeks a universal construction with low worst-case time complexity and strong parallelism: concurrent operations run in parallel even if they access common parts of the data structure, provided that the commonly accessed parts are only read, and not modified. Universal constructions often require strong synchronization operations, such as compare & swap. Porting these constructions to weaker architectures that do not support such operations is another objective of this research. A final objective is to understand the intrinsic limitations of universal constructions.","title":"Efficiently Implementing Wait-Free Shared Objects on Multiprocessors","awardID":"9803678","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[77465],"PO":["209879"]},"30226":{"abstract":"9802367 Babuska The project will address the following topics: 1) A posteriori error estimation in the finite element method. It will focus on the error estimation of the values of engineering interest as error in the solution, the gradients (stresses) in the entire domain as well as subdomains, the values of the functionals, etc. The upper and lower a- posteriori bounds will be addressed. The effectivity and robustness of these estimates will be theoretically and computationally investigated. The linear elliptic equations and problems occurring in engineering practice will be focussed on and also the nonlinear and parabolic ones will be investigated. The results will also be applied in the adaptive procedure. 2) The generalized finite element method. A flexible form of FEM allowing one to use special shape functions will be designed and theoretically analyzed. The classical h- and p- version is a special case. The method will be implemented in two dimensions and possibly later, three dimensions as well. This method can typically be applied for solving problems of heterogeneous material, solutions with boundary layers and oscillatory character. 3) The problem of composites. This is a multi-scale problem with particular focus on composite fibrous materials. The main interest will be on a fiber scale. The study will be both deterministic and stochastic. The stochastic formulation is essential because the position of the fiber scale statistical character. The work will be performed in collaboration with the Aeronautics Institute of Sweden. 4) The p-version of FEM. This work will be focused on resolving various aspects of the p-version in 3 dimensions although first the methodology will be used on the two-dimensional setting. The theory will utilize new functional spaces which are needed for addressing the problems occurring in engineering. The work is a continuation of the results of results obtained in the past. The planned research addresses problems with a high level of importance in the engineering computations. It will focus on the reliable and accurate a-posteriori error estimations and adaptive procedures in the Finite Element Method, which are essential for confidence in the computed data. In this way, various accidents could be avoided. Although the finite element method is a major tool in engineering computations, various important problems are practically unsolvable by the standard approach. Hence a new generalized flexible finite element method will be designed with the goal to increase the effectivity of the method when solving unusually difficult problems. The problem of the composite material with the focus on the fiber scale is one of these types of problems when millions of fibers are present with only statistical character in regard to knowledge of their position. Here new approaches which are very tight to the experimental studies are needed and will be addressed.","title":"Reliability of Computational Analysis","awardID":"9802367","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["514847"],"PO":["209579"]},"32657":{"abstract":"The objective of this RPG is to assist the PI in developing a full proposal in the area of Distributed Memory Computers (DMCs). Code optimization is an important part for today's high performance DMCs. This research concentrates on developing new techniques for performing interprocedural analysis for high performance computing applications. This information is vital in order to allow further transformations of the code in optimizing compiler. This research will initially be based on tools available over the Internet such as Parafrase and MPI. These packages will be imported and changes to the code will be performed in order to test our algorithms on various application programs. This project includes a component for undergraduate education at the University of Puerto Rico- Mayaguez. These students will be heavily involved in using the available tools for interprocedural analysis and in developing and testing new strategies.","title":"Distributed Memory Computer Research at the University of Puerto Rico - Mayaguez","awardID":"9810138","effectiveDate":"1998-08-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[82235],"PO":["250083"]},"27817":{"abstract":"This research is aimed at supporting interaction with large databases that include handwritten documents. The objective is to advance understanding of methodologies for interactively querying large document databases. Examples of such documents include medical and insurance information systems into which volumes of paper records have been scanned, government security systems, and electronic historical document collections, such as the collections created by the Model Editions Partnership. An existing, high-performance handwritten recognition algorithm will be adapted to the research problem. The questions to be addressed include: Which global, word-level training objective functions result in better performance? Which character class confidence measures result in better system performance? And, which character-based, word level confidence estimators results in better system performance? Experiments will focus on comparison of different methodologies for training; of different objective functions, optimization criteria, and optimization methodologies; and of different methods of estimating character confidence.","title":"Interactive Handwritten Database Query Research","awardID":"9732914","effectiveDate":"1998-08-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["348906"],"PO":["565227"]},"37618":{"abstract":"EIA-9871196 Sethuraman, Jayaram Srivastava, Anuj Florida State University MRI: Acquisition of Equipment for Research in Image Understanding This proposal centers around research focused on analyzing and interpreting images of objects, rigid and flexible, obtained through standard sensors (cameras, resonance imaging, radars). Image understanding relates to the representation and analysis of knowledge about complex physical systems. Recent advances in computer technology have enabled researchers to study massive databases using sophisticated mathematical models which are more realistic for real life applications. Due to continuous advances in sensing technology, the databases to be analyzed and understood are massive, up to several hundred megabytes for a typical application. In addition to computational power, visualization and database storage, there is also need for high speed networking among distant collaborators and distributed tasking of processing power. To handle these computer requirements, it is proposed to enhance existing resources by adding the following equipment: a high-performance Silicon Graphics Onyx2 workstation as a central server for database handling and major computing operations, two Silicon Graphics Octane workstations, two O2 workstations and accessories such as a laser printer, a VCR\/monitor head, and a personal computer.","title":"MRI: Acquisition of Equipment for Research in Image Understanding","awardID":"9871196","effectiveDate":"1998-08-15","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["261845",95280,"550508"],"PO":["430923"]},"38949":{"abstract":"","title":"CAREER: Signal Processing for Software Radio Wireless Systems","awardID":"9896275","effectiveDate":"1998-08-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4730","name":"PROTOTYPING TOOLS & METH PROGR"}}],"PIcoPI":["52879"],"PO":["564898"]},"30843":{"abstract":"9804061 Reusable object-oriented software components often must be adapted to fit into a new application that also uses other, independently developed components. This research investigates Binary Component Adaptation (BCA), a new way to integrate components. Component adaptation takes place after the component has been delivered to the reusing programmer, and the component is directly modified in place in order to make changes. By directly rewriting binaries, BCA combines the flexibility of source-level changes without incurring its disadvantages. BCA can rewrite component binaries at load time and also guarantees release-to-release compatibility. That is, an adaptation is guaranteed to be compatible with a new binary release of the underlying component as long as the release does not modify the public interface except by adding new elements. A BCA system will be constructed for Java to show that an efficient implementation is feasible, and will be made available publicly to allow an evaluation of BCA's usefulness based on the feedback received from external users. BCA promises to solve a number of important integration and evolution problems; if successful, it could significantly improve the reusability of Java components, thus reducing software development costs.***","title":"Binary Component Adaptation","awardID":"9804061","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[77826],"PO":["397849"]},"30755":{"abstract":"9803815 This research concerns models for concurrent computation. The central problems are (1) building truly concurrent models for concurrent languages, and (2) building models for unbounded nondeterminism. Traditional models for concurrency resolve the parallel composition of two processes into all possible interleavings of the sequential actions of each. True concurrency directly implements concurrent computation as a primitive operator. This research will combine domain-theoretic approaches with automata-theoretic techniques and trace theory to build new models for concurrent computation based on true concurrency. The goal is a better understanding of the difference between nondeterminism and parallelism. Potential applications are models of object-based concurrency and modeling the parallelization of serial code. Applications to modeling security issues, especially denial of service attacks are also being explored. A process is unboundedly nondeterministic if it has infinitely many choices of possible actions to perform. Models for this construct could be used to extend existing models for bounded nondeterminism to ones supporting unbounded nondeterminism. This would afford the potential to reason about processes exhibiting unbounded finitary behavior without also exhibiting infinitary behavior; for example, a process which is capable of doing an action any finite number of times, but incapable of doing it forever. Applications involve specification and refinement, as well as fairness.***","title":"Semantics Models for Concurrency","awardID":"9803815","effectiveDate":"1998-08-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["536741"],"PO":["150697"]},"30337":{"abstract":"The design of application-specific embedded computing systems is done as hardware\/software co-design to jointly optimize the hardware platform and software executing on that platform. This research is investigating two aspects of the co-analysis of embedded computing systems: memory systems and sensitivity analysis. The goal is to obtain co- synthesis analysis methods which can guide synthesis decisions. Embedded computers have hierarchical memory systems with caching to keep the processors busy. Since these systems are often real-time, the software must execute to performance bounds even in the presence of caching to keep the processors busy. Models for finding bounds on execution time in the presence of caches, and make effective use of available hardware, are being studied. Also, co- synthesis algorithms need to analyze the sensitivity of the system to the characteristics of the components. Sensitivity analysis can tell how much system performance changes as the execution speed of a component changes. Sensitivity measures, which can be used in the inner loop of co-synthesis to help guide optimization choices, are being explored. The co-analysis methods are being evaluated in the context of co-synthesis algorithms.","title":"Co-Analysis and Co-Synthesis of High-Performance DistributedEmbedded Systems","awardID":"9802661","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["431683"],"PO":["197478"]},"32416":{"abstract":"The rapid proliferation of new instruction set architectures that support instruction-level parallel processing has created great compiler and microarchitecture research opportunities. The IMPACT compiler, with its advanced features such as predicated compilation, instruction level parallelism optimizations, compiler engineered speculation, profile-based optimizations, advanced machine description facilities, scheduling frameworks for resource sensitive code optimizations, and pointer-based dependence analysis and tracking facility, has become a premier compiler technology base for major U.S. companies as well as academic researchers. This software capitalization project enables the use of IMPACT's state-of-the-art compiler framework by a large number of researchers. This will be accomplished by enhancing existing documentation and developing new documentation and tutorials, further strengthening the software interfaces, building and maintaining a web-based support infrastructure, and making the software as stable as possible through the aggressive use of a regression-test environment and timely response to users' bug reports. This project's software and documentation will be released in several phases over two years and the end product will be a high-quality and readily-available compiler environment that supports a wide variety of advanced instruction-level parallel processing research.","title":"Sharing the IMPACT ILP Compiler Technology with US Researchers","awardID":"9809404","effectiveDate":"1998-08-01","expirationDate":"2000-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["474312",81620,81621],"PO":["250083"]},"30811":{"abstract":"Modern telecommunication systems demand high performance circuit components that can operate at billions of cycles per second. Such components must also work in extreme environment such as high and low temperature. For example, components in a cellular phone must operate properly whether it is used in Texas during the summer or in Alaska during the winter. Furthermore, these components must be economically competitive. These strict technical and economical challenges call for new approaches at the component level. The recent advances in fabrication of minute mechanical devices may make possible the implementation of high-frequency components that can address the aforementioned challenges. This research involves the design of micromachined electro-mechanically tunable capacitors for RFIC applications in the 1-2 GHz range. The investigators are examining the effects of various physical phenomena such as gravity, shock, ware, and temperature on tunable capacitor characteristics. The researchers are also studying the feasibility of RF voltage controlled oscillators and electronically tunable filters based on these micromachined devices. RF switches are also being investigated. A prototype two-plate micromachined varactor is being fabricated in MUMPS polysilicon surface micromachining technology and has a nominal capacitance of 2 pF, a tuning range of 1.5:1, a maximum control voltage of 4 Volts, and a Q-factor of 20 at 1 GHz. The first prototype voltage controlled oscillator based on such micromachined tunable capacitor oscillates at 1.35 GHz, has a tuning range of 2 percent, and has a phase noise of -98.5 dBc\/Hz at 100 kHz offset from the carrier.","title":"Micromachined Varactors and Their Applications to RF\/Analog Intergrated Circuits","awardID":"9803962","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["104076",77742],"PO":["564898"]},"31317":{"abstract":"There has been recently a big increase in the number of studies related to the statistical analysis and mathematical modeling of traffic measurements from modern communication networks. While many of the measured traffic traces differ from each other in their high-frequency behavior, they typically exhibit a number of statistical characteristics that tend to be insensitive to the constant changes that real-life data networks experience over time. Such robust characteristics are sometimes called \"traffic invariants\", and include such phenomena as long-range dependence and\/or heavy tails. Long-range dependence occurs when the correlations of the traffic processes at hand decay to zero slowly as the lag increases (i.e., power-law decay) and causes traffic to exhibit pronounced larger-than average ``bursts'' and lower-than-average ``lulls''. Heavy tails refer to the power-law decay of the underlying probability distributions and capture the notions of extreme variability and ``intermittancy''. In the networking context, long-range dependence and heavy tails abound and have been observed at practically all layers in the networking hierarchy. This research focuses on these traffic invariants: how to detect and measure them, how to explain their presence in realistic networking situations, what is their effect on queuing\/loss performance, and also how to identify other potential invariants, especially within the apparent chaotic structure in the high-frequency domain. One of the open problems in understanding the dynamic nature of network traffic is when the underlying traffic (e.g., packet rate process), in addition to exhibiting strong temporal dependencies, is itself non-Gaussian and exhibits heavy tails. This research aims to develop physical models that can explain the joint presence of long-range dependence and heavy tails at the macroscopic level. These models should be useful in practice, give rise to efficient traffic generation methods that result in synthetic traces with realistic features, and provide novel insights into the wide area of network performance analysis. Another problem area concerns the nature of network traffic at the microscopic level, where we will build upon the recent discovery of the presence of multiplicative mechanisms that cause network traffic over fine time scales to exhibit multifractal scaling properties. This research also focuses on the Web and plans to track how self-similarity, heavy-tails, and multifractals fare in a constantly changing Internet. How does the ever increasing variability in access speeds (e.g., traditional modems on one hand, cable modems, 100 Mbps Ethernet on the other) and the more and more heterogeneous nature of access technologies (e.g., phone modems, cable modems, ADSL) will affect the nature of currently considered workload models and how they will impact the scaling (i.e., self-similarity) properties of aggregate packet traffic. This project involves the collaborative effort of the P.I. (Murad S. Taqqu) at Boston University and the Co-P.I. (Walter Willinger) at AT&T-Labs Research. For more details please refer to the web site AREF=\"http:\/\/math.bu.edu\/people\/murad\"> http:\/\/math.bu.edu\/people\/murad<\/A>.","title":"Long-range Dependence and Heavy Tails in Communication Networks","awardID":"9805623","effectiveDate":"1998-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["545356","551079"],"PO":["234222"]},"33407":{"abstract":"This research is exploring Complexity-Adaptive Processors (CAPs), a new microarchitecture within which hardware complexity, latency, and clock speed tradeoffs can be made on-the-fly at runtime. CAPs employ dynamic hardware structures for the major hardware functions of the processor and memory hierarchy. The organization and delay of these structures, as well as the clock speed of the chip, can be modified by the compiler, runtime system, or on-chip hardware to match application characteristics. This project is investigating CAP design options in order to assess the performance potential of this approach. Specific tasks being carried out include: (1) Investigating the dynamic hardware requirements of a variety of applications; (2) Evaluating the timing aspects of CAP hardware structures, including the tradeoff between varying latency and clock speed; (3) Devising configuration scheduling strategies for matching the hardware to the application; (4) Evaluating dynamic clocking alternatives; (5) Using simulation coupled with timing analysis to quantify the performance potential of the CAPs approach.","title":"Complexity-Adaptive Processors: Dynamic IPC\/Critical Path Optimization","awardID":"9811929","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550887"],"PO":["197478"]},"31626":{"abstract":"EIA-9806741 Grama, Ananth Y. Park, Kihong Purdue University ESS: ISAC: Integrated System Support for Adaptive Communication and Computation Control in Clustered Environments This project aims to build an integrated software system (ISAC) for application development in cluster-computing environments. ISAC addresses issues of communication control and load balancing to facilitate an effective parallel platform. In contrast to traditional approaches, ISAC views communication and computation control in an integrated system. It dynamically schedules computation and communication making use of their repetitive nature to achieve optimal performance. End-to-end congestion control is augmented by a group communication mechanism that conjointly schedules communication and computation. Scheduling is carried out assuming a best-effort network environment in which resources are shared among a pool of applications. Communication control is adaptive, and scheduling is performed dynamically as a function of network state. Assuming that routers implement a form of weighted fair queuing wherein resource reservations can be affected, ISAC implements guaranteed-bandwidth channels either per-connection or per-multicast group using a form of admission control. In conjunction with process scheduling support at host stations, this allows critical applications to achieve guaranteed progress impervious to network and processor loads. It also allows applications to deal with heterogeneity among hosts and networking environments transparently. ISAC will significantly enhance the programmability and performance of cluster-computing applications ranging from scientific computing to distributed web and database servers.","title":"Experimental Software Systems: ISAC: Integrated System Support for Adaptive Communication and Computation Control in Clustered Environments","awardID":"9806741","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["409715","540776","438434"],"PO":["241298"]},"32605":{"abstract":"Biomolecular molecular computation (BMC) uses biochemical methods to do computation at the molecular level. The goal of this research is to determine key required capabilities of a distributed operating system (BMC-OS) for BMC, including: (i) distributed flow of control,(ii) distributed message transmission and message handling, (iii) distribution and retrieval of data and files,(iv) locality optimizations, (v) data integrity assurance, an(vi)distributed I\/O. The effort is focusing on a few key topics which have the most impact on the design of a BMC-OS :(a) Integrity Assurance, Decreased I\/O and Error Resiliency--a combination of computer science and biochemical techniques are being used to do data fingerprinting and a very high fan-out data distribution method (using redundant coding) will be used to increase data error resiliency. (b) Models and Simulation Software for BMC-OS--Parameterized performance models are used to reflect the geometric and other constraints (e.g., solution and reagent concentration, spatial distribution of DNA strands, temperature, salinity, etc.) on the BMC-OS control, including the application of MEMs technology to automate BMC.","title":"SGER: Design of a Biomolecular Distributed Operating Systems","awardID":"9810000","effectiveDate":"1998-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550822"],"PO":["250083"]},"34839":{"abstract":"Partial funding is being awarded for the 1998 Artificial Intelligence and Manufacturing Workshop. Artificial Intelligence concepts and techniques continue to find favor - and offer even more promise - in manufacturing, and these applications and potential applications continue to provide challenging drivers for fundamental research in the field. This workshop follows another in 1996, and surveys progress, as well as problems still outstanding. The development of intelligent computer integrated design and manufacturing systems is still on the horizon, but meetings like this to evaluate the state of the art and practice and discuss particulars of needed research, the advance toward that horizon can more efficiently be undertaken.","title":"1998 AAAI Sigman Workshop","awardID":"9815915","effectiveDate":"1998-08-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["560676"],"PO":["565227"]},"30825":{"abstract":"9804010 Project LEAP investigates the use of lightweight, empirical, anti-measurement dysfunction, and portable approaches to software developer improvement. A lightweight method involves a minimum of process constraints, is relatively easy to learn, is amenable to integration with existing methods and tools, and requires only minimal management investment and commitment. An empirical method supports measurements that can lead to improvements in the software developers skill. Measurement dysfunction refers to the possibility of measurements being used against the programmer, so the method must take care to collect and manipulate measurements in a ``safe'' manner. A portable method is one that can be applied by the developer across projects, organizations, and companies during her career. Project LEAP evaluates the strengths and weaknesses of this approach by creating a LEAP-compliant toolset and method for process data entry and analysis. The toolset and method will be experimentally evaluated at a number of industry sites, and used to explore the effects of the toolkit on the quality of empirical data collected by the Personal Software Process. Web- based materials for distance-based education on empirical software engineering will be deployed using the toolset.***","title":"Project LEAP: Lightweight, Empirical, Anti-Measurement Dysfuntion, and Portable Software Developer Improvement","awardID":"9804010","effectiveDate":"1998-08-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["451116"],"PO":["564388"]},"30847":{"abstract":"9804075 This project will focus on the detection in real time of system misuse. This will be achieved through the dynamic measurement of software systems. This technique has been quite successful in the dynamic determination of software reliability. Through a shift in perspective the variation of the behavior that determines system reliability also provides a convenient vehicle for the detection of security violations. The research effort will center around three distinct software system attributes: granularity, scalability, and the operating milieu of the target software system. Thus, initial project phase will concentrate on the instrumentation and measurement of O\/S kernel level program activity. The next project phase will center on the dynamic determination of specific application (user) profiles. The third project phase will shift the measurement focus to network-wide software applications. This new metaphor for secure systems will focus on the functionality that the system is executing and the impact that the functionality has on program modularity, as opposed to the existing view of the system's software as a monolithic system being stimulated by an aggressive and hostile user. A system will be measured as it executes its many functionalities, profile will be established for normal activity, and subtle shifts in the profiles that represent the execution of security breach functionalities will be identified and modeled.***","title":"Measuring System Dynamics for the Direct Assessment of Software Security Violation Characteristics","awardID":"9804075","effectiveDate":"1998-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[77834,"456424","162171","522597"],"PO":[77838]},"30815":{"abstract":"The project proposes research on distributed systems that monitor the positions of various moving objects and process queries and triggers referring to their positions. Applications of such systems, called Moving Object Information (MOI) applications, typically occur in transportation systems in the civilian sector and in the digital battlefield management in the military. This proposal considers two different architecture models for the MOI systems; in the first one a single central server (CS) monitors the position of the objects and answers queries; the second architecture is fully distributed in which the moving objects communicate with each other to answer the queries and to monitor trigger conditions. The project proposes various location update policies for maintenance of the position information of the objects in the CS model. All these policies maintain the position of an object as a dynamic attribute that changes with time. The project plans to investigate the cost effectiveness of these policies through analytical and experimental studies. A query language based on Future Temporal Logic (FTL) is proposed for specifying spatial and temporal queries and trigger conditions on the moving objects. The language permits specification of the desired levels of uncertainties in the answer. Research towards the development of efficient query\/trigger processing mechanisms in the two architectures are proposed. The proposed mechanisms will be evaluated in an experimental testbed.","title":"Triggers and Queries in Distributed Software Systems for Moving Objects","awardID":"9803974","effectiveDate":"1998-08-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["389044","550555","557651"],"PO":["209879"]},"30859":{"abstract":"9804112 This research focuses on the development of specification-based testing techniques for concurrent programs. The techniques being investigated are a combination of model-based and constraint- based testing techniques. For a given finite-state machine M, model-checking tools are used to find a list of temporal logic constraints that are satisfied by M. The constraints explicitly characterize M's logical branching structure, which otherwise appears only implicitly in the states and transitions of the finite-state machine. Test sequences are selected to cover the logical branches identified by the constraints. The objective of this research is to develop a structural testing methodology for finite state machine specifications that is not based on covering every state or transition. Two methods for addressing the state explosion problem during model-based test generation are being investigated. The first method, called specification slicing, is used to partition a finite-state model into several smaller sub- models that are used for test generation. The second method is called compositional testing. During compositional testing, test coverage properties are established for sub-models and these properties automatically hold for the whole system. Whether these two methods can be used to avoid the costly construction of complete system models for test generation is being investigated.***","title":"Specification-Based Testing of Concurrent Programs","awardID":"9804112","effectiveDate":"1998-08-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[77869],"PO":["397849"]}}