{"119416":{"abstract":"Project Abstract<br\/>CT-ISG: Trustworthy Spectrum Sharing in Software Defined Radio Networks<br\/><br\/><br\/>Software defined radio (SDR) is a revolutionary technology that promises to alleviate the spectrum shortage problem and bring about improvements in spectrum utilization efficiency. Conventional radios are built using ASIC (application specific integrated circuit) technology. Changes to such devices require highly technical skills and specialized equipment, thus making unauthorized changes to the devices infeasible for most adversaries. The emergence of SDR technology raises new security implications. It is quite possible for adversaries to modify user services or reconfigure RF parameters of an SDR by revising its radio software. This raises serious questions among regulators, operators, and users about the security vulnerabilities in SDR systems. The current focus of the SDR research and standardization efforts is on preventive security measures based on cryptosystems. Preventive security measures are measures that secure the radio software download process or schemes that thwart the tampering of the software once it has been downloaded. Recent studies, however, have shown that the possibility of inappropriate operation of SDRs due to malicious software cannot be precluded. To address this concern, in this project, we study security issues that pose the greatest threat when an adversary is able to install malicious software or modify already installed software on an SDR, with particular focus on threats that cannot be addressed using cryptographic techniques. Specifically, the focus of the research is on studying security vulnerabilities in the PHY and MAC layers of SDR networks. This research serves a critical need in the SDR research community by addressing security issues that have not been studied previously. It is expected that the research findings from this project will benefit regulators, service providers, and manufacturers involved in SDR development.","title":"CT-ISG: Trustworthy Spectrum Sharing in Software Defined Radio Networks","awardID":"0627436","effectiveDate":"2007-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["564848","560140","548204"],"PO":["529429"]},"120681":{"abstract":"The University of Alaska, Fairbanks (UAF) proposes a project to encourage Alaska Native student participation in computing. The proposal builds on well-documented evidence that the learning styles and educational goals of Alaska Natives differ from traditional \"western\" computing students, and that current programs do not effectively meet their needs. The PIs will create a supportive ecosystem - based on extending existing relationships - through which students, advisers, faculty, industrial partners, mentors, families, and the organization structures that support them work together towards the goal of increasing the participation of Alaska Natives in computing. The approach is founded upon four keys to success: developing the students' disciplinary knowledge, helping student develop their identity with respect to the field of computing, establishing processes by which the students move through the institutional contexts of their computing education, and contributing through which the students can return to their home communities and share their knowledge. Activities will include needs assessment, outreach, modifications to course delivery mechanisms, faculty training, increased course offerings, and augmentation of transition programs.","title":"Encouraging Alaska Native Participation in Computing","awardID":"0634540","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["528503",320657,320658,"528504"],"PO":["561855"]},"135751":{"abstract":"Our emotions and moods play a central role in our everyday experiences. To design interfaces that more adequately engage this full range of human experience, some researchers now advocate affective computing, in which computers automatically sense, process, and respond to human emotions, but having computers measure and report on intimate data without users' explicit awareness and consent raises substantial concerns around who is in control. Furthermore, it is challenging to accurately sense complex and elusive emotions influenced by many physiological, individual, and cultural factors that are unavailable to computational sensors, and the need to simplify emotions in order to computationally model them may lead to interfaces that flatten our emotional experiences rather than engaging our emotions in their full everyday richness. Such problems are based on a fundamental affective gap, a disjunction between the subjective, situated, cultural, and social ways in which people think about and experience emotions and the objective, formalized ways in which computers model them. In this project the PIs will attempt to close the affective gap by sharing the burden of affective interpretation between people and machines. In this model, people and machines collaborate to construct affective experiences; machines track user behavior and supply feedback, which users interpret to develop affective awareness. Shifting the center of interpretation and reflection from the system towards the user keeps users in charge of emotional meaning-making, addresses emotions that computational systems alone cannot truly understand, and focuses our design efforts not on formalizations of affect but on rich, complex, idiosyncratic, and potentially enigmatic emotional experiences. Systems requiring active user interpretation pose serious challenges for design and evaluation in HCI, since we no longer have direct control of system meaning but instead design and evaluate for unexpected appropriation. Drawing from the arts, humanities, and critical design, the PIs' systems will encourage interpretation by reflecting the complex, ambiguous nature of affect, allowing people to actively make sense of the system's output in the context of their everyday lives and relationships.<br\/><br\/>Broader Impacts: The PIs will develop systematic design and evaluation strategies, a theoretical foundation, and detailed case studies that make affective presence a sustainable, reproducible contribution to HCI. The work will lead to new technology that leaves users in charge of the interpretation of their emotions yet allows construction of systems that touch on intimate issues without being intrusive, supports user reflection on the role of affect in technology, and enables designers to create a new, wide range of emotional experiences even though computers have difficulty modeling those experiences.","title":"Collaborative Research: Closing the Affective Gap","awardID":"0752684","effectiveDate":"2007-01-31","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["536597"],"PO":["565227"]},"122463":{"abstract":"The wireless networks of the next 10 years are expected to consist of a plethora of microprocessor-sensor devices embedded in clothes, shoes, cars, buses, as well as the traditional portable handhelds, and laptops. Since information is expected to flow through thousands to millions of wireless devices themselves in these networks (rather than a few gateways), it is essential that an aggregate view of the essential qualities of the mobile network be built and made available. Quality-of-Service (QoS) decisions (regarding energy consumption, delay and throughput) will play a prominent role in making intelligent decisions in these large-scale networks.<br\/><br\/>The major research contribution of this project is the development of methodologies for tracking and disseminating QoS metrics in mobile, wireless networks of microprocessor-sensor devices by building QoS maps in the joint memories of the nodes over relevant time scales. QoS potential functions are constructed over space by the nodes via path integration methods, and distributed via information exchange during node encounters. Novel concepts, such as the coherence time of QoS metrics, enable the application of signal processing methods to the refinement of QoS maps.<br\/><br\/>This project opens the way to building the first-generation large-scale networks of small, mobile, microprocessor-sensor devices in civilian settings, which will transform the way our society operates, utilizing a plethora of sensors and supporting semantic devices that translate this information to useful actions. This project integrates the traditionally separate signal processing and networking techniques in graduate coursework, and develops an early career focus program for minority undergraduate students.","title":"CAREER: QoS Maps for Large-Scale, High-mobility Wireless Networks","awardID":"0643946","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["409902"],"PO":["557315"]},"122474":{"abstract":"While the advent of mobile and tiny computing devices furthers the pervasion of our society's digital backbone, adequate programming support addressing the needs of adaptivity, versatility, autonomy, and reactivity of pervasive applications is still lacking. <br\/><br\/>We advocate for event correlation as core interaction paradigm embracing the asynchronous and decoupled nature of pervasive systems. Applications define events, which are triggered by sources and multicast to sinks; sinks are characterized by their interests in combinations of events involving criteria on type, value, time, and --- typical of many applications in pervasive systems --- location. Our contributions are threefold. First, we propose a model which generalizes previous approaches and unifies one-to-one, one-to-many, and many-to-many interaction. Second, we devise programming language support for this model, both through specific extensions to mainstream programming languages, as well as through general-purpose programming language constructs conceived to support also alternative inter-process interaction models. Third, we propose novel location-based routing algorithms and protocols devised for overlay networks tailored to event correlation, making use of randomization, compression, hashing, and error coding techniques to tame complexity while achieving secure, reliable and efficient event dissemination. <br\/><br\/>This research will advance the state of the art in event-based programming support by combining expertise in areas considered largely independently so far, such as computer networks and programming languages. The resulting cross-fertilization will furthermore facilitate the education of tomorrow's designers and developers of pervasive systems.","title":"CAREER: Pervasive Programming with Event Correlation","awardID":"0644013","effectiveDate":"2007-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["486086"],"PO":["561889"]},"122485":{"abstract":"The past few years have witnessed a growing number of large-scale<br\/>networked systems. Most of these systems are built following an<br\/>overlay approach, with each of them regularly and independently<br\/>probing its environment to guide path selection algorithms, route<br\/>around faulty links and replicate content for availability. As these<br\/>systems grow in popularity, such an approach will result in an<br\/>unsustainable degree of monitoring and restrict the variety, number<br\/>and span of distributed services.<br\/><br\/>The thesis of this project is that a large fraction of<br\/>globally-distributed systems can be built to ensure sustainable<br\/>scalability by strategically reusing the view of the network gathered<br\/>by long-running, ubiquitous services such as CDNs and P2P<br\/>systems. This work defines and explores \"3R\" - a new approach to the<br\/>design and implementation of distributed systems that focuses on<br\/>minimizing aggregated control and administrative overhead by<br\/>strategically reusing environment's views and recycling previously<br\/>gathered measurements. In particular, we are designing efficient<br\/>techniques for maintaining, accessing and reusing this information for<br\/>building next-generation streaming multicast, content distribution and<br\/>data sharing applications.<br\/><br\/>The work explores the tradeoffs in the recycling\/reuse of<br\/>environmental measurements, and their implication in<br\/>distributed-system design. Ultimately, it will facilitate deployments<br\/>of wide-area applications, benefiting society at large. The research<br\/>agenda is complemented by a thorough education and outreach plan for<br\/>strengthening experimental systems education and contributing to<br\/>minority recruitment and retention.","title":"CAREER: Ensuring Sustainable Scalability for Globally-Distributed Systems","awardID":"0644062","effectiveDate":"2007-01-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518224"],"PO":["561889"]},"122496":{"abstract":"Recent headlines about ``network neutrality'' speak to the deep uncertainty about the future regulatory infrastructure (if any) that should govern the Internet. Perhaps most surprising about this policy debate is that it has not been informed by technical considerations: i.e., the technology and architecture of the Internet. This CAREER project closes this gap, by ensuring that robust architectural design and economic sustainability are viewed as complementary features of a successful communications infrastructure. We study the influence of technology and architecture on contracting models for the Internet, to determine those which will lead to an economically sustainable network. Two high-level questions drive the majority of the research agenda: (1) What contracting models are \"incentive compatible\", i.e., align individual incentives with global network sustainability? (2) What contracting models ensure the network eventually converges \"dynamically\" to a sustainable operating point? We use these questions as the backdrop to first evaluate the shortcomings of the current Internet contracting system. We then evaluate how a sequence of technological or architectural changes enable more sophisticated contracting models, ultimately suggesting a \"contracting protocol\" that enables value transmission over multiple timescales between nodes of the Internet. A broad-based education and public outreach program complements the research endeavors.<br\/><br\/>Broader Impacts:<br\/><br\/>This project educates a new generation of leaders and the public at large about the role that technology and architecture play in the economic structure of the Internet. Successful completion of the project ensures that this coupling is a central theme in the national policy debate about the future of the Internet.","title":"CAREER: An Economically Sustainable Internet: From Technology and Architecture to Contracting Models","awardID":"0644114","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["560159"],"PO":["565090"]},"119428":{"abstract":"Somesh Jha<br\/>University of Wisconsin, Madison<br\/>Collaborative Research: CT T Towards Behavior-Based Malware Detection<br\/>0627501<br\/>Panel P060975<br\/><br\/>Abstract<br\/><br\/><br\/>Malware is code with malicious intent that can adversely affect the<br\/>host on which it executes or the network over which they are<br\/>transmitted. A malware detector classifies a program as malware or<br\/>benign. Malware writers continuously test the limitations of malware<br\/>detectors in an attempt to discover techniques to evade<br\/>detection. This leads to an arms race, where malware writers find new<br\/>ways to create malware that are undetected by commercial malware<br\/>detectors, and where researchers working on malware detection respond<br\/>by devising new detection techniques. Attackers create new malware<br\/>using two main approaches: program obfuscation and evolution. There is<br\/>strong evidence that malware writers are using obfuscation and<br\/>evolution because the number of new malware families is growing at a<br\/>much slower rate than the number of malware instances. For example,<br\/>according to Symantec threat reports, in the first half of 2005 there<br\/>were 10,866 new virus and worm variants but only 170 new families of<br\/>malware. This data also indicates that signature-based techniques for<br\/>malware detection will not be able to cope with the increase in the<br\/>number of malware instances. Recent results by one of the PIs also<br\/>suggests that current commercial malware detectors are not resilient<br\/>to obfuscation and evolution techniques used by malware writers. All<br\/>this evidence clearly suggests that we need a new approach to malware<br\/>detection.<br\/><br\/>We propose to explore behavior-based malware detection: our algorithm<br\/>focuses on detecting malicious behavior (such as mass-mailing behavior<br\/>used by certain worms) rather than searching for syntactic<br\/>patterns. We specify malicious behavior in a formal language and then<br\/>perform static analysis on the code to determine whether it contains<br\/>the specified behavior. Prior work by the investigators demonstrated<br\/>that this behavior-based malware detector can detect families of<br\/>malware using a single specification. However, there are challenges<br\/>that need to be addressed in the context of behavior-based malware<br\/>detection. We propose tasks to address these challenges. Solutions to<br\/>the proposed tasks will lead to malware detection techniques that will<br\/>resist evasion techniques used by malware writers better than existing<br\/>malware detectors. Behavior-based malware detectors can also detect<br\/>new malware that are variants of old malware..","title":"Collaborative Research: CT-T: Towards Behavior-Based Malware Detection","awardID":"0627501","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["459025","521593"],"PO":["497499"]},"120561":{"abstract":"Engineering - Electrical (55)<br\/><br\/>This project is creating a student-centered learning environment where students are challenged to think critically, to be effective team players, and to be self-directed lifelong learners. To appeal to diverse learning syles, the investigators are developing instructional materials based on a hybrid of Problem-Base Learning (PBL) and Active\/Cooperative Learning (ACL) techniques that incorporate both visual, interactive teaching methods and extensive use of modern computational approaches. They are mapping the department's objectives and ABET outcomes to the electromagnetic courses to identify objectives and outcomes for each course. Each course has a \"Course Portfolio\" with six or seven PBL modules containing instructional and assessment materials along with suggested teaching strategies. MATLAB-based interactive programs and in-class ACL activities are being developed and included in the material. The evaluation effort, led by an local expert in evaluation, uses quantitative and qualitative techniques to assess instructional materials, the learning process, student learning, and retention. The materials and results are being disseminated through conferences, journal papers, and websites and through a faculty workshop. The broader impacts include the dissemination of the materials and the involvement of a substantial number of Hispanic students at this institution.","title":"Hybrid of PBL and ACL to enhance Student Learning in EM Undergraduate Courses","awardID":"0633746","effectiveDate":"2007-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1536","name":"S-STEM:SCHLR SCI TECH ENG&MATH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7494","name":"CCLI-Type 1 (Exploratory)"}}],"PIcoPI":[320243,320244,"323304"],"PO":["563675"]},"122530":{"abstract":"The need for comprehensive monitoring and analysis of complex environments has brought wireless sensor networks (WSNs) to the forefront of research. To be effective in practice, WSNs need to capture system state, monitor complex properties, and model physical phenomena accurately and robustly, without any biases. Currently, most efforts in this area employ parametric models and other a priori assumptions that postulate known phenomena and system properties. The characteristics of emerging complex applications, however, are often unknown and hard to predict. Thus, optimizations using models based on a priori assumptions often have limited effectiveness.<br\/><br\/>This research plan develops novel data-driven modeling methods, scalable modular structures, and application optimization algorithms that comprehensively abstract, capture and operate on traces of deployed WSNs. While the research thrusts are intended to provide applicable models, development tools, and system software for WSNs, they simultaneously advance the theory and practice of statistical modeling and optimization algorithms. The models and algorithms are coordinated: the models are built so that they facilitate consequent optimizations, while the optimization algorithms are created in such a way that they take into account the structure and uncertainties of the models. The results are intrinsically interdisciplinary and have impact on a broad range of other fields. This project integrates research and educational activities by engaging students in the research and by incorporating the research into both undergraduate and graduate levels. The research results and educational material are promptly disseminated via academic publications, the Connexions platform, and other WWW sources.","title":"CAREER: Coordinated Data-Driven Modeling and Optimization for Wireless Sensor Networks","awardID":"0644289","effectiveDate":"2007-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["485958"],"PO":["565303"]},"122486":{"abstract":"Patrick Schaumont<br\/>Virginia Polytechnic Institute and State University<br\/>CAREER: Hardware\/Software Codesign for Secure Embedded Systems: Methods and Education<br\/>0644070<br\/>Panel ID: 070111<br\/><br\/>Abstract<br\/><br\/><br\/><br\/>The implementation of a secure cipher within the embedded electronics of a smart-card can have a large number of weak points, which are unrelated to the cryptographic strength of that cipher. Side-channel information leaks may disclose internal secrets through the cipher's power consumption, execution time, and other physical implementation effects. Affecting hardware as well as software, these leaks show that a secure embedded system is no stronger than its weakest link.<br\/>This project creates a systematic design approach that iteratively partitions an embedded system into a security-critical and a non-critical part. The partitioning goes across the boundaries of hardware and software and is guided by side-channel estimators. The partitioned components are then safely integrated using secure hardware-software interfaces. The result is a flexible yet secure system design, that combines the flexibility of software with the robustness of hardware.<br\/>The project's intellectual merit is a design methodology for secure embedded system design. The methodology complements a traditional embedded design approach that focuses on performance and design-cost but not on security and side-channel information leaks.<br\/>The project trains computer engineers at the undergraduate level in hardware\/software codesign, and at the graduate level in secure embedded systems design. The training software from this course forms the basis of the secure design flow, and it is freely distributed on CD-ROM. The software is serving other academic institutions that establish similar undergraduate courses. The secure methodology enables collaboration between embedded system designers and cryptographers, and helps them to build embedded systems that are less prone to attacks and fraud.","title":"CAREER: Hardware\/Software Codesign for Secure Embedded Systems: Methods and Education","awardID":"0644070","effectiveDate":"2007-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["548205"],"PO":["565264"]},"120661":{"abstract":"Rensselaer Polytechnic Institute proposes a project to extend the use of Culturally Situated Design Tools (CSDTs) to engage underrepresented minorities in computing. CSDTs are web-based applets are based on ethnomathematics: the mathematical knowledge embedded in cultural designs such as cornrow hairstyles, Native American beadwork, and Latino percussion rhythms. They allow students to use these underlying mathematical principles to simulate the original cultural designs, create new designs of their own invention, and engage in specific math inquiries. They have been used in K-12 schools with large numbers of African-American, Latino, and Native American students, and preliminary evaluations indicate statistically significant increase in both math achievement and attitudes toward technology-based careers. This proposed work is two-fold. First, it will develop a new user interface for CSDTs in which students create designs by entering pseudocode, thus shifting the learning content emphasis from mathematics to computer programming. Second, it will utilize the CSDTs in the Student Leadership Corps (SLC) of the BPC-sponsored STARS alliance, allowing undergraduate SLC members to provide new training and resources to students with outreach projects in grade 7-12 and out-of-school education. SLC students will also have the opportunity to develop CSDTs of their own creation, following a design protocol that ensures respectful use of cultural materials by a participatory process involving local members of educational and cultural communities. The project evaluation will examine the impact of CSDTs on both SLC students and their outreach constituency.","title":"Collaborative Research: BPC-DP: Improving Minority Student Participation in the Computing Career Pipeline with Culturally Situated Design Tools","awardID":"0634329","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["385622","503742"],"PO":["561855"]},"120672":{"abstract":"Rensselaer Polytechnic Institute proposes a project to extend the use of Culturally Situated Design Tools (CSDTs) to engage underrepresented minorities in computing. CSDTs are web-based applets are based on ethnomathematics: the mathematical knowledge embedded in cultural designs such as cornrow hairstyles, Native American beadwork, and Latino percussion rhythms. They allow students to use these underlying mathematical principles to simulate the original cultural designs, create new designs of their own invention, and engage in specific math inquiries. They have been used in K-12 schools with large numbers of African-American, Latino, and Native American students, and preliminary evaluations indicate statistically significant increase in both math achievement and attitudes toward technology-based careers. This proposed work is two-fold. First, it will develop a new user interface for CSDTs in which students create designs by entering pseudocode, thus shifting the learning content emphasis from mathematics to computer programming. Second, it will utilize the CSDTs in the Student Leadership Corps (SLC) of the BPC-sponsored STARS alliance, allowing undergraduate SLC members to provide new training and resources to students with outreach projects in grade 7-12 and out-of-school education. SLC students will also have the opportunity to develop CSDTs of their own creation, following a design protocol that ensures respectful use of cultural materials by a participatory process involving local members of educational and cultural communities. The project evaluation will examine the impact of CSDTs on both SLC students and their outreach constituency.","title":"Collaborative Research: BPC-DP: Improving Minority Student Participation in the Computing Career Pipeline with Culturally Situated Design Tools","awardID":"0634461","effectiveDate":"2007-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["339065"],"PO":["561855"]},"122421":{"abstract":"Making Music Documents Accessible in Musical Terms<br\/>One of the key problems facing us in the 21st century is information retrieval and management. Finding ways to automatically index, label, and access multimedia content (such as music documents) in meaningful ways is an open research question that increases in importance as multimedia databases proliferate and grow. Music collections, such as the 3.5 million recordings in Apple Computer's iTunes repository, comprise one of the most popular categories of on-line multimedia content.<br\/>For scholars, musicians and even casual listeners, the music document is only the beginning, a tool to initiate the task at hand. Musicians may be interested in remixing a musical recording even though all they have available is the final mix. Scholars may wish to analyze the harmonies in a piece. Others may want karaoke that follows the singer's expressive timing, or a way to remove the sound of an unwanted cell phone ring from a recording of their daughter's flute recital.<br\/>The objective of this research is to develop two key facilitating technologies to enable these kinds of interactions: score alignment and source separation. Score alignment, involves aligning an audio performance and to the events in a machine-readable music score. When aligned to a score, a performance can be addressed by melodic and harmonic content. We propose to advance the state-of-the-art by enabling a machine to follow partially specified scores (such as Jazz lead sheets). This alignment require significant inference about likely surface structures (the note sequence in an improvised solo) from deeper structural descriptions in the score (the chords in a lead sheet). This will enable alignment of entire classes of music, such as much Jazz, Pop and Rock, that cannot currently be aligned to scores.<br\/>The second technology, source separation, is the process of isolating individual source signals, given mixtures of the source signals. With source separation, individual instruments and sounds can be accessed, identified and manipulated in ways beyond the power of commercial audio search and editing software. We will advance the field through score-informed separation, as well as new iterative methods for approximating source models from acoustic mixtures.<br\/>The idea is to develop a synergistic system for music-information-retrieval and interaction that uses multiple document modalities (written scores, audio files, MIDI) to infer more about the music structure than is possible using a single modality.<br\/>This research will impact the signal-processing community (source separation), the music information retrieval community (music indexing and search) and the artificial intelligence community (tools for intelligent abstraction of real-world data). To broadly disseminate the work, demonstration tools will be made available over the internet and results will be published in relevant journals and conferences. The PI is committed to involving undergraduates and members of historically underrepresented groups in research, working with the SROP and UROP programs to make this happen. The PI also teaches the course \"Machine Perception of Music\" where research results will be disseminated to a wide variety of students.","title":"CAREER: Making music documents accessible in musical terms","awardID":"0643752","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["485732"],"PO":["563751"]},"122454":{"abstract":"The objective of this NSF CAREER research is to develop process variation aware design methodologies for the synthesis of embedded systems in nanometer scale CMOS technology. Many embedded systems are heterogeneous multiprocessor system-on-chip (MPSoC) architectures. The reliance on deep sub-micron process technologies for the fabrication of embedded multiprocessor system-on-chips gives rise to concerns about process variations, which can cause significant performance variations for a design. Although designing for worst-case process margins is the traditional approach to deal with outliers, the degree of variability encountered in the new process technologies makes this option nonviable. The existing deterministic embedded system design methodologies may result in unexpected performance discrepancy or a pessimistic performance estimation, and may end up using excess resources to guarantee real-time constraints, due to overly conservative design approaches. <br\/><br\/>This research proposes a design paradigm shift from today's deterministic design to statistical or probabilistic design. Specifically, this proposal aims at: (1) developing hierarchical statistical analysis methodologies to facilitate embedded MPSoC synthesis; (2) developing process-variation-aware hardware synthesis techniques; (3) developing process variation aware software worst case execution time (WCET) analysis and optimization techniques for embedded applications; (4) developing process variation aware hardware\/software co-synthesis techniques. The education part of this program includes: the enhancement of existing curriculum by integrating new course modules on process variations to complement and upgrade the core courses; the broad dissemination of the results via research publications, courses, seminars, tutorials, and workshops; and the development of software components that are disseminated to the research community and beyond.","title":"CAREER: Process Variation Aware Embedded MPSoC Synthesis","awardID":"0643902","effectiveDate":"2007-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518504"],"PO":["561889"]},"122267":{"abstract":"Proposal 0642882<br\/>\"CAREER: A Unified Architecture for Learning of, and reasoning with, Task Models: Theory and Applications\"<br\/>PI: Hector Munoz-Avila<br\/>Lehigh University<br\/><br\/>The focus of this project is the use of Hierarchical Task Networks (HTN) in planning. Humans learn complex skills by incrementally acquiring and combining simpler skills into skills of increasing complexity. Consequentially, many cognitive architectures use hierarchical models to represent relations between skills of different complexity. Over the years, the problem of automatically learning such hierarchical models has taken a backstage. Frequently, it is assumed that these models are given and research has instead concentrated on their use. This project drops this assumption and studies ways to learn the hierarchical models and use them for automated planning. The centerpiece of this project is a unified architecture for (1) learning hierarchical models from STRIPS plans and for (2) a multi-phase combination of lazy and eager learning using a common hierarchical task network (HTN) plan representation. Lazy learning produces hierarchical knowledge that directly represents the input examples. Eager learning produces hierarchical knowledge that generalizes multiple input examples. The unified architecture learns and plans with constructs whose generalization varies between these two extremes. The project also incorporates educational activities based on the multi-phase learning principles formulated in this work. This includes a pilot study, aimed at G6-12 students, to provide hands-on experience on introductory AI. Other broader impacts of this work include possible uses of HTN planning techniques in a wide range of potential applications that are amenable to hierarchical modeling, including project management for public events, software engineering project planning, and developing strategies for automated players in computer games.","title":"CAREER: A Unified Architecture for Learning of, and Reasoning with, Task Models: Theory and Applications","awardID":"0642882","effectiveDate":"2007-01-01","expirationDate":"2013-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518015"],"PO":["491702"]},"156048":{"abstract":"NSF Award Abstract<br\/><br\/>There is a fundamental change ongoing in the computer industry. Instead of increasing clock frequency, which increases power dissipation, CPU chip manufacturers are using advances in semiconductor technology to increase the number of cores on a processor chip. This shifts the burden of improving program performance from chip manufacturers to software developers. Many industry experts believe that programming multicore processors is now the most important challenge facing the software industry.<br\/><br\/>Compiler technology for parallel architectures is not effective for irregular applications that use linked data structures such as trees and graphs. These data structures are ubiquitous in important application areas like graphics, mesh generation and linear system solvers.<br\/><br\/>This project develops a new approach for parallelizing and optimizing irregular programs for multicore processors. The key insight is that optimistic parallelization is essential for irregular programs. Transactional memory is an attractive way to implement optimistic parallelization; this project will design, implement and evaluate new transactional models that exploit properties of high-level program abstractions rather than simply tracking low-level reads and writes.<br\/><br\/>Results will be disseminated through publications and by making the software transactional memory system available for downloading. Technology transfer to leading companies is another avenue for disseminating results.","title":"CSR-AES: Parallelizing Irregular Applications for Multicore Processors","awardID":"0923907","effectiveDate":"2007-01-01","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["556730"],"PO":["551712"]},"131552":{"abstract":"The etiology of complex diseases involves multiple genes and environmental factors. Since each individual gene locus is only a small part of the whole picture, association studies based on correlating variation at one or a few gene loci to disease outcomes may miss significant larger-scale associations. An attractive alternative that may be more revealing is to base association studies on correlations between disease outcomes<br\/>and haplotypes across selected genomic regions, A prerequisite for association studies, whether they are based on a few loci or on larger-scale haplotypes, is an accurate method for haplotype frequency estimation in a given population. The differences between the haplotype frequencies in a healthy population and in a population of<br\/>affected individuals may be subtle. Thus, getting an accurate estimate for the haplotype frequencies is extremely important for disease association studies. Estimating haplotype frequencies is a non-trivial task because current sequencing methods may produce noisy or incomplete data and typically yield genotypes, whose resolution into pairs of haplotypes is ambiguous. Existing methods for haplotype frequency estimation are mainly heuristic in nature, and they are only suitable for large samples of unrelated individuals from a homogenous population over short genomic regions. Any deviation from these conditions may result in inaccurate estimates. The main goal of this project is to develop efficient and accurate tools for haplotype frequency estimation under different conditions, and to integrate these methods with novel tools for disease association studies. In particular, the following activities are proposed: develop accurate, efficient and robust methods for haplotype frequency estimation over short and long genomic regions; extend these methods to deal with small sample size and deviations from Hardy-Weinberg equilibrium due to population substructure, and incorporate pedigree<br\/>information into the haplotype frequency estimator; integrate the resulting tools with a systematic tool for disease association studies that looks for candidate loci automatically using multiple calls to the haplotype frequency estimator; and launch a web server that will allow geneticists to upload their data and run the programs developed in the project on the fly through the web server.<br\/><br\/>The direct effect of the project would be to reduce the sample size needed for association studies, thus making more studies possible under the same budget constraints. This in turn will lead to a better understanding of complex diseases, which may speed up the search for diagnosis and treatment tools. The mathematical models introduced in this project may shed light on haplotype structure and on evolution. Furthermore, the project will address optimization problems and statistical learning<br\/>problems that may be of use beyond the scope of genetics. The diverse tasks of this project include algorithm design and implementation, software integration and biological modeling. Thus, there is a wide range of activities that are suitable for students of all levels. This will give students an exciting exposure to multidisciplinary research involving computer science, statistics, genetics and mathematics. The methods developed in this project will be integrated in bioinformatics courses at UCSD, and<br\/>the material will be publicly available as PowerPoint presentations on the web.<br\/>The software developed in this project will be integrated with the existing publicly available web server HAP.","title":"Collaborative Research: SEIII: Estimating Haplotype Frequencies","awardID":"0731455","effectiveDate":"2007-01-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":["554197"],"PO":["565136"]},"122510":{"abstract":"`The ideal vehicle for extensive aquatic monitoring is mobile underwater sensor network (M-UWSN). M-UWSN is significantly different from terrestrial sensor networks: (1) radio channels do not work well under water. They must be replaced by acoustic channels, which feature long propagation delays, low communication bandwidth and a high channel error rate; (2) while most ground sensors are static, underwater sensor nodes may move with water, as introduces passive mobility. Due to the complex environment properties and the unique characteristics of acoustic channels, M-UWSN demands new research at every level of the protocol suite. In this project, we investigate three key networking problems for M-UWSN: multiple access, multi-hop routing and reliable data transfer. For multiple access, we study a reservation-based approach for dense networks and an adaptive protocol for unevenly-distributed networks. For multi-hop routing, we design a scalable geo-routing protocol and improve its robustness by effectively handling routing \"holes\". For reliable data transfer, we explore both FEC (Forward-Error-Correction) coding and network coding approaches, aiming to enhance network robustness while reduce communication cost. The accomplishment of this research will enable and\/or enhance a wide range of aquatic applications in scientific research and national security\/defense. The results will include (1) a set of protocols and algorithms for the three networking problems; (2) integrated solutions and user guidelines for different aquatic applications; (3) a simulation platform and real testbeds. The research results will be incorporated into both undergraduate and graduate courses. Both the simulation platform and real testbeds will be accessible to the community.","title":"CAREER: Tackling Fundamental Networking Problems in Underwater Acoustic Sensor Networks","awardID":"0644190","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["526410"],"PO":["565303"]},"122521":{"abstract":"A wide range of resource-constrained wireless networks including wireless sensor networks have shown considerable promise in bringing many envisioned applications and services to reality, such as healthcare, search and rescue operations, watch-my-child\/aging-parent, power grid control and operations, battlefield surveillance, etc. However, due to the nature of their resource-constrained design and ways of being deployed and used, they are vulnerable to attacks. The failure of these applications may cause catastrophic damage or unwanted impacts that affect public safety, personal privacy, homeland security, the economy and society. The objective of this project is to develop methodologies for providing practical solutions in support of secure and resilient data-centric applications and services for resource-constrained wireless networks. The project will focus on addressing fundamental security and resilience problems and challenging issues due to the resource-constrained device design and the complicated situations brought by the use of network coding techniques. The proposed research will provide efficient, provably secure, and resilient solutions for filtering false data reports, localization verification, and dynamic sensor revoking and re-tasking. This project has immediate and significant impacts. The developed solutions can serve as an important foundation to effectively provide secure and resilient support for data-centric applications and services. Integrated educational activities are another important part of this proposal and will expose a large number of students at various levels and the general public to this new knowledge. Accordingly, this project benefits society in a variety of meaningful ways.","title":"CAREER: Practical Scheme Design for Supporting Secure and Resilient Resource-Constrained Wireless Networks","awardID":"0644238","effectiveDate":"2007-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"H284","name":"CIA"}}],"PIcoPI":["509531"],"PO":["565264"]},"122466":{"abstract":"CAREER: Etiquette for Collaborative Communications and Networking<br\/>NSF 0643954, PI: Daniela Tuninetti<br\/><br\/>Abstract<br\/><br\/>Wireless networks have traditionally been deployed with interference avoidance as the primary objective to ensure high throughput. Recently, a new and exciting paradigm has emerged in which interfering communications from different users are viewed as a way to spread \"common information\" across the network, thereby allowing for cooperation among otherwise uncoordinated transmitters. Cooperative communications holds the potential to enhance the communication capabilities of all users in the network simultaneously if users share their resources with their neighbors. This research aims at establish a theoretical foundation for collaborative communications by identifying the optimal resource sharing conduct, here referred to as etiquette, among users in peer-to-peer wireless networks. It is centered on the interference channel with generalized feedback, a novel information-theoretic network model that incorporates the knowledge a communicating pair of users can infer about other concurrent communications from information overheard. This research has two main thrusts: (1) developing innovative coding and signaling techniques for resource sharing to improve capacity, and investigate the associated scaling laws, (2) designing efficient and distributed multi-access and routing protocols to realize the benefits of collaborative communications with minimal overhead. The goal is to shed light on a richer and more powerful class of cooperation modes than currently proposed multi-hop relaying, and to lay the foundations for a deeper understanding of the ultimate tradeoffs involved in peer-to-peer networking. The technical approach includes comprehensive theoretical analysis and extensive computer simulations on real network data. In addition, a new multidisciplinary course that bridges Information Theory and Networking Theory is developed to expose students to the benefits of cross-fertilizations of the two disciplines to the design of collaborative communication networks.","title":"CAREER: Etiquette for Collaborative Communication and Networking","awardID":"0643954","effectiveDate":"2007-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["518391"],"PO":["564924"]},"123577":{"abstract":"CNS-0649158<br\/>PI: Haibin Lu<br\/>Institution: University of Missouri - Columbia<br\/>Title: REU Site: Undergraduate Research in Home Networking Technologies<br\/><br\/><br\/>This project creates a new Research Experience for Undergraduates site focused on the area of home networking technologies. During the experience, students investigate viable solutions on a home network test platform that they construct. The projects allow students to achieve a better understanding of the technical issues, performance, and trade-offs in areas of multimedia communications, wireless networking, copyright protection, and network security. A regional recruitment process selects cohorts of undergraduate students to participate in a ten-week summer research program at the host institution. Particular emphasis is placed on recruitment of students from institutions where they may have had limited opportunities for research experiences. The goals are to expose students a collaborative research environment, foster student enthusiasm for science and engineering, and develop the skills the students need to pursue advanced research degrees. The project includes mentorship by the experienced faculty members, technical seminars and workshops, team building activities, student presentations, and other professional development opportunities.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects involve an emerging research area that is timely and important to the field as well as attractive to the students. The students participate in a full range of research activities from preparing research literature review to production and dissemination of research results.<br\/><br\/>The broader impacts of the project include providing a quality research experience for undergraduate students, particularly students from underrepresented groups and community college students. The participating faculty members are committed to recruiting and engaging women and students from underrepresented groups in their research. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning. The project will also provide a better technically educated workforce to meet national security and economic priorities.","title":"REU Sites: Undergraduate Research in Home Networking Technologies","awardID":"0649158","effectiveDate":"2007-01-15","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["564155","564155",327917],"PO":["564181"]},"122367":{"abstract":"This project aims to build a self-tuning multimedia streaming service that optimizes the user viewing experience by analyzing user behavior, inferring personalized quality of service (QoS) requirements, and tuning system and network resources to maximize utilities of all users. The advent of peer-to-peer (P2P) technology has provided the ideal playground for this research. Traces from operating P2P streaming systems provide rich datasets with which to study the influence of QoS factors on users' viewing experience. In addition, the affordability of a P2P streaming testbed provides both the sandbox to test research ideas and a general educational platform accessible to a large Internet user base.<br\/><br\/>This CAREER project has two complementary tracks: use-level QoS modeling and QoS-aware resource allocation. On the modeling track, the user utility function is formulated using statistical tools such as regression analysis to infer the influence of individual network- and system-level QoS factors on the user behaviors (e.g., skipping, changing channel, or premature leave), which reflect the subjective user viewing experience. On the resource allocation track, the problem is studied using a time-aware multi-dimensional optimization framework, which helps address the unique challenges posed by the semantics of a P2P system, e.g., how to inclusively optimize the resource allocation under heterogeneous user utility functions. <br\/><br\/>Broader Impact:<br\/><br\/>This research plan is expected to incubate the emergence of an extremely cost-effective and scalable P2P service platform as the innovation hotbed to significantly lower the entry barrier for new media-rich applications. The analytical outcome from user behavior study will also bring strategic insights and design guidelines applicable to all multimedia service paradigms beyond P2P.","title":"CAREER: Achieving Self-Tunability of Peer-to-Peer Streaming Service through User-Level QoS Inference","awardID":"0643488","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["520355"],"PO":["564993"]},"122389":{"abstract":"In a remarkably short time since their discovery, core-sets have emerged as a powerful <br\/>tool for the study of geometric optimization problems. The main idea behind the technique <br\/>is to compute a small subset of the input, called the Core-Set, that `approximates' the <br\/>input and allows the optimization problem to be solved on this concise representation. <br\/>Core-sets are exciting because of their prospect in the development of powerful, practical <br\/>and general methods that are applicable to a large class of problems from various <br\/>applications including automotive and aircraft industries, space exploration, civil <br\/>surveyors, the movie, computer gaming and medical industries, and developers of security <br\/>and geographic information systems.<br\/><br\/>This NSF Career proposal focuses on the design and implementation of efficient methods <br\/>for geometric optimization problems and their applications to real-world problems using <br\/>the paradigm of core-sets. As part of this proposal, application of core-sets to <br\/>problems like curve and surface reconstruction from massive unorganized point clouds <br\/>will also be explored. A key characteristic of the proposal is that it will help advance <br\/>the knowledge across disciplines like computational geometry, convex optimization and <br\/>machine learning. The use of core-sets will result in the design of algorithms that will <br\/>be easier to code and will be faster and more robust. Furthermore, the PI plans to continue <br\/>incorporating his research results in: (1) course development, (2) mentoring of graduate <br\/>and undergraduate students by maintaining a careful balance between theory, applications, <br\/>algorithms and computational projects, (3) development and maintenance of software <br\/>solutions related to core-sets and their applications.","title":"CAREER: Core-Sets for Geometric Optimization and their Applications.","awardID":"0643593","effectiveDate":"2007-01-15","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["539289"],"PO":["564924"]},"127757":{"abstract":"Research in search techniques was a critical component of the first generation of the Web, and has gone from academe to mainstream. A second generation \"Semantic Web\" is being built by adding semantic annotations that machines can understand and from which humans can benefit. Modeling, discovering and reasoning about complex relationships on the Semantic Web will enable this vision and transform the hunt for documents into a more automated analysis enabled by semantic technology. The beginnings of this shift from search to analysis can be observed in research and industry as users look beyond finding relevant documents based on keywords to finding actionable information leading to decision making and insights. Large scale semantic annotation of data (both domain-independent and domain-specific) is now possible because of an accumulation of advances in entity identification, automatic classification, taxonomy and ontology development, and metadata extraction. The next frontier, which fundamentally changes the way we acquire and use knowledge, is to automatically identify complex relationships between entities in this semantically annotated data. Instead of a search engine that returns documents containing terms of interest, there will be a system that returns actionable information (with the associated sources and supporting evidence) to a user or application. The user interacts with information universe through a hypothesis driven approach that combines search and inferencing, enabling more complex analysis and deeper insight. The research will focus on the design, prototyping and evaluation of a system, called SemDIS (Semantic Discovery) that supports indexing and querying of complex semantic relationships and is driven by notions of information trust and provenance and models of hypotheses and arguments under investigation. Such a capability greatly enhances the capacity of intelligence analysts to obtain (in time) information leading to a more secure homeland and world. Corresponding to the breadth and depth of the topics involved in the challenge undertaken, this is a collaborative project involving researchers at UGA's LSDIS lab and UMBC. <br\/><br\/>SemDIS will have broader impacts beyond the education and training of graduate students, and the publication of research findings. Results from the research will be integrated with courses, both existing and new. Institutional mechanisms in place will seek participation of students from underrepresented groups. The work will also gain from several academic-industry collaborations of the investigators. There will be an opportunity to leverage commercial infrastructure and raw metadata provided by Semagix. The researchers will collaborate with industry, and the students will be encouraged to intern at collaborating industrial labs. Within a broader social context, emerging knowledge-centric technologies raise legitimate privacy and civil liberties concerns. Building upon past policy making experience, the investigators will comment on potential implications of their scientific progress. <br\/><br\/>More information can be found at http:\/\/http:\/\/lsdis.cs.uga.edu\/SemDIS\/ and at http:\/\/www.cs.umbc.edu\/SemDIS\/","title":"Collaborative Proposal: ITR-SemDIS: Discovering Complex Relationships in the Semantic Web","awardID":"0714441","effectiveDate":"2007-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["560054"],"PO":["563727"]},"127878":{"abstract":"The Intellectual Merit of the proposed research project lies in the development of interactive PHY-MAC design techniques for capacity enhanced wireless networks and in the development of analytical and evaluation tools that are broadly applicable to related communication problems. First, we explore new design philosophy for random access protocols. Taking a mutually interactive MAC-PHY (physical layer) perspective, we introduce a new dimension of freedom into the design space. In addition, the proposed MAC design, in combination with collision-free multiple access techniques, lays a solid foundation for high capacity access control in heavily loaded wireless networks.<br\/>The Broader Impacts resulting from the proposed research project are multifold. On the technical side, the proposed capacity reaching random access protocols lay a solid foundation for efficient access control in both single band and multi-band wireless networks. The greatly improved random access mechanisms will help secure an ideal human-technology platform for fast and reliable information exchange. Furthermore, future wireless standards can benefit from the advanced design methodology and analysis\/evaluation tools on random access to be developed in this research.<br\/>On the education side, one major impact of this research project is the education and training of students through direct student participation in the research activities. Additionally, by integrating the technological advances into the undergraduate\/graduate curricula, and through outreach activities, significant impacts are expected from this project on training a highly-skilled and diverse workforce in the areas of wireless communications and networking.","title":"SGER - Capacity Enhanced Random Access Protocols","awardID":"0714845","effectiveDate":"2007-01-15","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["523634"],"PO":["348215"]},"120663":{"abstract":"The Pennsylvania State University proposes to increase the number of women entering computing by creating a developmental learning community: A community including high school girls, undergraduate women in CISE majors, and female faculty and alumni professionals engaged in collaborative activities that scaffold the participation, understanding, and skills of young women as they encounter and engage the concepts and practices of computing. The community will provide younger members with mentors and social models at multiple stages of CISE careers. Some community interactions will be face-to-face, but for the most part the group will be maintained and enhanced through an <br\/>on-line community system. Through a participatory design process, female undergraduates will develop and deliver workshops in which high school girls' work together to build software applications specifically designed to appeal to them. The alumni will develop similar workshops for the undergraduate community members. In the course of planning and fielding these outreach activities; community members will develop and use an online community system for their collaborative work.","title":"BPC-DP: A Developmental Community for Recruiting and Maintaining Women in CISE Education","awardID":"0634337","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["549540","549541"],"PO":["561855"]},"120674":{"abstract":"The University of Cincinnati (UC) aims to provide urban (primarily African-American) high school students with exposure to computing-related problem-solving activities and undergraduate mentors. The undergraduates will have had have significant co-operative education experience and will undertake mentoring and teaching computing topics as part of their capstone design project. They will be trained to mentor youth and to introduce them to computing topics and activities. The undergraduates will also conduct research in designing, developing, and searching a repository for digital learning objects. The project will include two community partners that serve Cincinnati Public School students: the Cincinnati Youth Collaborative (CYC) and the Cincinnati Arts and Technology Center (CATC). UC students will be trained as mentors and participate in CYCs program for fostering college success; they will build relationships with youth in the program and, guided by the PI and a graduate student, they will extend the CYC college access curriculum to include computing topics, making their lessons available in a web-based repository. UC students will also assist in a summer digital media workshop for CATC at-risk high school students, thereby gaining training in digital art software that can be used to facilitate their lesson plan development and experiencing a successful model for UC outreach activities.","title":"BPC-DP: Mentoring for Connections to Computing (MC2)","awardID":"0634473","effectiveDate":"2007-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":[320619],"PO":["561855"]},"131267":{"abstract":"The preparative work for producing biological threat agents is often disguised using a variety of methods, from heat, to treatment with bleach, to flooding the area with a common nonpathogenic organism. Detection has focused on the presence of native materials, such as DNA or proteins. A variety of agents will be subjected to reagents and new methods used to stabilize cells to preserve potential macromolecular analytes for identification. The antibody recognition results of toxins that have been heat-modified will be characterized and generalized. A related problem is seen from environmental samples, where agents such as heat, sunlight or high salinity may have the same effect. A further study on selective agents and the recovery of specific signatures will enable the development of new forensic assays. In many instances, consideration of the exact mechanism of modification can give clues for the maintenance of detectable levels of macromolecules of interest. The broad applicability and utility of the research in environmental science and threat assessment is noted.","title":"Detection of Decomposing Threat Agents","awardID":"0729654","effectiveDate":"2007-01-24","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}}],"PIcoPI":["490938"],"PO":["565136"]},"122335":{"abstract":"CAREER: Robotic BioTelemetry<br\/><br\/>Abstract<br\/><br\/>This project aims to develop new algorithms and systems to quantitatively measure natural habitats and animal activities via remotely controlled networked robotic cameras. Since human activity can be very disturbing to the animal under scrutiny and its colony, the project will develop new non-intrusive biotelemetry methods based on emerging advances in high-resolution networked robotic cameras and long-range wireless networking. With the potential of changing the way to study nature, the project will allow groups of scientists, via the internet, to remotely identify and measure in real-time important variables such as quantity, size, volume, speed, motion pattern, and behavior characteristics. Since objects or its collection in a natural environment are often nonlinear, non-deterministic, non-convex\/concave, irregular, deformable, and time-variant \/ transient, the challenging problem requires new algorithm and system development. Collaborating with natural scientists, the project undertake this long term effort by building prototypes and investigating new metrics, mathematical models, algorithms, and architectures for robot biotelemetry systems in a five-year integrated research and educational project that will emphasize active robotic actuation, automation, collaboration, and optimal system design.","title":"CAREER: Robotic BioTelemetry","awardID":"0643298","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550010"],"PO":["562760"]},"122368":{"abstract":"Important applications in science and business depend on automatic classification of large volumes of items (examples) into predefined classes. Multi-label learning refers to the classification problem where each example can be assigned to multiple class labels simultaneously. The classification problem is germane to many different domains, such as natural language processing, computer vision, human computer interaction, bioinformatics, health care, and physiology. Existing machine learning technologies are unsuitable for large-scale multi-label learning because they are unable to handle rare class classification problems and poorly distinguish classes with similar input patterns. <br\/><br\/>To overcome the limitation of the existing approaches, the project is developing a relation propagation framework for multi-label learning that explicitly exploits the similarity of examples and the correlation among classes simultaneously. In particular, this project includes research to (1) develop efficient optimization algorithms for the proposed relation propagation framework; (2) develop effective algorithms for learning the similarity of examples and the correlation among classes; (3) develop effective active learning algorithms for multi-label learning; and (4) evaluate the proposed framework for multi-label learning through three real world applications: text categorization, image annotation, and prediction of gene expression patterns.<br\/><br\/>The project will advance the state of the art of techniques for large-scale multi-label learning through the development of relation propagation framework, which in return will have a significant impact on a wide range of applications. The research results will also enhance the current machine learning curricula, involve students in interdisciplinary research and improve the education of the information technology workforce. The project Web site (http:\/\/www.cse.msu.edu\/~rongjin\/) will be used for research results dissemination.","title":"CAREER: Large-Scale Multi-label Learning","awardID":"0643494","effectiveDate":"2007-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["45437"],"PO":["563751"]},"124216":{"abstract":"The initiative must be designed to attract the best researchers from both the Theoretical Computer Science (TCS) community and, crucially, the other scientific and engineering disciplines in which the ideas are to be applied. In preparing a detailed initiative, it is essential to incorporate the advice and cooperation of leading researchers in all these fields. For this purpose it is proposed to hold two two-day planning workshops, with thirty to forty participants in each. About a third of the participants will be invited speakers, a third will be<br\/>invited discussants, and a third will be selected from the TCS community. The distinguishing feature of these workshops will be their multidisciplinary nature; experts from different areas will be invited and asked to focus on the computational lens and its use in solving problems from their field. The first workshop is tentatively planned for early December, 2006 at Princeton University, and the second for mid-March, 2007 at Caltech. Because of the wideranging nature of the scientific disciplines involved, the first workshop will focus on Biological and Earth Sciences, and the second on Physical and Mathematical Sciences. A report for the NSF based on the workshops will be completed by Summer, 2007.<br\/><br\/>The intellectual merit of this proposal is the development of viable, promising courses of future interaction between CS and other disciplines. The broader impact will be that upon follow-on research: both directly by participants in the workshops, but ultimately much more widely if the workshops lead to an NSF<br\/>cross-cutting initiative.","title":"SGER: Planning for a Cross-Cutting Initiative in Computational Discovery","awardID":"0652536","effectiveDate":"2007-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["550549"],"PO":["499399"]},"127637":{"abstract":"Summarization evaluation is an important and challenging problem in language processing. While text summarization dates back as far as 40 years, speech summarization started only recently. A particular domain of speech data is multiparty meetings, which pose new challenges to evaluation metrics. Meetings differ from news article in many dimensions, such as the dialog structure in meetings, speaker turn, topic, and conversational speaking style. This exploratory work focuses on the impact of these differences on speech summarization definition and evaluation. <br\/><br\/>First, different human extractive summaries are generated for the meeting data from different points of views, such as based on topics, speakers, or discussion flow. These enable the examination of the impact of the meeting style on the consistency of the human generated summaries. Second, this project evaluates the correlation of the automated measurements, such as the ROUGE scores, with human judgments, and then develops metrics to take into account the characteristics in meetings.<br\/><br\/>The outcome from this exploratory project will help the research community to better understand the characteristics of the meeting domain, define the summarization task in meetings in a more consistent way, improve speech summarization evaluation metrics, and allow the wide use of speech summarization techniques in many applications (such as generating meeting minutes or lecture outlines). In addition, different summaries are created for the meeting corpus and will be released to the research community. <br\/>Experimental results will be disseminated through conference and journal publications.","title":"A Study on Definition of Speech Summarization in Meetings and Its Evaluation Metrics","awardID":"0714132","effectiveDate":"2007-01-15","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["563325"],"PO":["565215"]},"122457":{"abstract":"CAREER: Geometry and High-Dimensional Inference<br\/><br\/>Mikhail Belkin<br\/>Ohio State University<br\/><br\/>Machine learning techniques for high-dimensional inference are becoming progressively more important as many sources of abundant data ranging from MRI, medical imaging and biological data to sensor networks and to more traditional speech and computer vision data become avail- able and require automated processing. This project will address theoretical and algorithmic issues surrounding manifold and geometric methods for high- dimensional inference.<br\/><br\/>Intellectual Merit: Three of the fundamental challenges for modern machine learning can be summarized as follows:<br\/>. High dimensionality of the data.<br\/>. Complex nonlinear structures in the data.<br\/>. A large amount of data obtained from modern data sources is unlabeled.<br\/>A promising line of research, known as Manifold Learning, emerged in recent years as a way to use certain geometric ideas to construct compact low- dimensional representation of the data and to use unlabeled data for learning. These algorithms have now been successfully used for a variety of applications from motion segmentation to Markov decision processes.<br\/>However, our theoretical understanding of these methods is still in its infancy. The main focus of this project is to develop a theoretical framework for analysis of algorithms utilizing geometry of high-dimensional data. Such a framework will bring together techniques from computer science, statistics and mathematics to gain insight into properties of real-world data.<br\/>This framework will provide guidelines for designing better algorithms for existing problems as well as extending existing methods to new domains, such as analysis complex output spaces and time dependent data. The PI also plans to investigate usefulness of these ideas in Computer Vision.<br\/><br\/>Broader impacts: This project aims to build a theoretical foundation for a new class of inference algorithms as well as to design new algorithms for high- dimensional inference and to consider its application. A rigorous theoretical understanding of unlabeled data and its use in learning tasks is likely to have a significant impact in algorithms design and in applications of machine learning techniques in practice. This project will provide research and education opportunities for graduate and undergraduate students, and acquaint researchers from other areas and industry with recent developments and encourage collaborations through interdisciplinary workshops and a Machine Learning school.<br\/><br\/>http:\/\/www.cse.ohio-state.edu\/~mbelkin\/nsfcareerresearch","title":"CAREER: Geometry and High-Dimensional Inference","awardID":"0643916","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562318"],"PO":["562760"]},"123018":{"abstract":"In recent years the enrolment in colleges and universities has become balanced in gender demographics, with a trend for more female students than male students. However, in computer science the numbers of female students, especially in graduate degrees are dropping. The goal of this project is to motivate the high school girls to study more science and math in their time in high school, and thus to have them better prepared and more motivated to pursue a computer science degree when they attend college or to select a computer science or information technology career. <br\/><br\/>This exploratory project plans to have fourteen and fifteen-year-old girls (some of whom are Native Americans) exposed to various computer science activities during two week-long summer workshops extended with further mentoring during the school year. Curriculum for the workshop includes a brief introduction to computer science, principles of programming, and multiple hands-on activities with robots and computers (e.g., building web pages; creation of a database for their own music files, etc.). In addition, local professional women in the computer science-related areas are involved in the program, so that they can interact with the girls and when the weeks on campus are over, the women act as mentors during the next two school years. The project is carried out with support from the local high schools in Bozeman, Montana.<br\/><br\/>One of the goals of this exploratory project is to identify the types of activities that are most successful in motivating and retaining the interest of young women, especially the Native Americans, in computer science studies and careers. The computer science researchers involved in this project are collaborating with education evaluation researchers in designing the activities and analyzing the project's impact. The results will be published and presented at relevant computer science and educational conferences.<br\/><br\/>The project has significant potential for broad impact nationally by providing a methodology for increasing the number of women who choose computer science or a closely related field as their major in their academic education or career. The project web site<br\/>(http:\/\/www.cs.montana.edu\/defrance\/WorkshopMentoring\/) will provide further information as the project proceeds.","title":"SGER: Bringing Historical Minorities to Computer Science","awardID":"0646651","effectiveDate":"2007-01-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[326489,326490],"PO":["563751"]},"120951":{"abstract":"Carbon is a unique element, forming the chemical basis for life as we know it. When living things die, their remains are often oxidized or consumed and thereby recycled in the earth's atmosphere, hydrosphere, and biosphere. Under appropriate conditions, some organic matter is trapped in accumulating sedimentary basins, and thus, cycled through the earth's crust and mantle. This carbonaceous material has many significant consequences, such as comprising deposits of coal, petroleum and natural gas. But aside from economically important accumulations of fossil fuels, the fate of small, dispersed bits of organic matter in rocks of the earth's crust can tell us much about ancient sedimentary environments, the history of life, and geochemical processes that operate in crustal environments. This project will investigate the physical and chemical processes that ultimately convert carbonaceous material in sediment into the mineral graphite. This conversion, known as graphitization, involves reorganization of the carbon and loss of other elements, and occurs in response to heat, pressure and deformation during metamorphism. As our understanding of this process improves, so will our ability to use carbonaceous material to better constrain the temperature-pressure-deformation history of geological events, and also to possibly recognize differences in the organic matter originally deposited in ancient sediments.<br\/><br\/>The objectives of this research are to clarify the relationship between metamorphic temperature and the structural state of carbonaceous material (CM) and graphite, and to correlate the conversion of CM to graphite with the exchange of carbon isotopes between graphite and calcite. This project will use laser Raman spectroscopy to characterize the crystallinity of CM and graphite in low- to high-grade marble and compare that for the first time with temperature dependent calcite-graphite isotopic fractionations. Raman analytical techniques and results will be critically evaluated for reproducibility, within-sample variability, across-outcrop variability, preparation methods, and retrograde metamorphism. The fractionation of stable isotopes of carbon between calcite and graphite is temperature dependent and useful as a geothermometer in middle amphibolite to granulite facies marble, however, the isotopic fractionations observed in lower temperature rocks do not agree with theoretically expected fractionations. Different size fractions of CM will be studied isotopically and by laser Raman to relate graphite coarsening with isotopic exchange, and will reveal whether or not prograde isotopic zoning exists in graphite. Comparing the structural state of graphite with the extent of the carbon isotope exchange will help us better understand the isotopic exchange processes and may lead to new tools for unraveling the thermal history of moderate- to low-temperature rocks.","title":"RUI: Raman Spectroscopy and Stable Isotope Investigations of Graphite in Marble","awardID":"0635816","effectiveDate":"2007-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1573","name":"PETROLOGY AND GEOCHEMISTRY"}}],"PIcoPI":[321344],"PO":["563192"]},"120665":{"abstract":"Rensselaer Polytechnic Institute proposes a project to extend the use of Culturally Situated Design Tools (CSDTs) to engage underrepresented minorities in computing. CSDTs are web-based applets are based on ethnomathematics: the mathematical knowledge embedded in cultural designs such as cornrow hairstyles, Native American beadwork, and Latino percussion rhythms. They allow students to use these underlying mathematical principles to simulate the original cultural designs, create new designs of their own invention, and engage in specific math inquiries. They have been used in K-12 schools with large numbers of African-American, Latino, and Native American students, and preliminary evaluations indicate statistically significant increase in both math achievement and attitudes toward technology-based careers. This proposed work is two-fold. First, it will develop a new user interface for CSDTs in which students create designs by entering pseudocode, thus shifting the learning content emphasis from mathematics to computer programming. Second, it will utilize the CSDTs in the Student Leadership Corps (SLC) of the BPC-sponsored STARS alliance, allowing undergraduate SLC members to provide new training and resources to students with outreach projects in grade 7-12 and out-of-school education. SLC students will also have the opportunity to develop CSDTs of their own creation, following a design protocol that ensures respectful use of cultural materials by a participatory process involving local members of educational and cultural communities. The project evaluation will examine the impact of CSDTs on both SLC students and their outreach constituency.","title":"Collaborative Research: BPC-DP: Improving Minority Student Participation in the Computing Career Pipeline with Culturally Situated Design Tools","awardID":"0634342","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["561854"],"PO":["561855"]},"121105":{"abstract":"Abstract<br\/><br\/>Approximately 70 percent of the world's surface is ocean, and the ocean remains one of the last frontiers for exploration. This exploration is hampered by the lack of high band width communications. Radio waves do not propagate in sea water, and acoustic communication systems operate at relatively low bandwidth. Recent developments in blue\/green semiconductor light sources suggest an alternative technology path to high bandwidth underwater optical communications. <br\/><br\/>Intellectual Merit: The technical challenge of this proposal is to understand how the propagation of light underwater impacts optical communication system design and to develop methodologies to compute accurate communication link budgets for different ocean water conditions. To accomplish this, underwater optical communication systems will be built and tested in different water conditions. Understanding the role of absorption and scattering on the attenuation and dispersion of the signal is especially important to quantify. The scattering of light underwater also places special requirements on the dynamic range of the receiver, as well as the collection optics and pointing requirements. In addition to underwater optical communication links, short range optical wireless links integrated with solid state lighting systems and autonomous robotic vehicles will be considered.<br\/><br\/>Broader Impact: High bandwidth underwater communications would be enabling for many scientific disciplines that investigate the ocean environment. Presently there is a proliferation of research that relies on autonomous underwater vehicles for data collection, and increasing numbers of people and robots work underwater, performing surveys, examining cables and pipelines, or working on oil rigs. Working underwater is dangerous and difficult and is consistently hampered by poor communications. The proposal also has a strong outreach component that involves numerous undergraduates in the underwater robotics club, and senior design program. The community is involved in the proposal through interaction with community college and middle school students.","title":"TCHCS: Defining the Boundaries of Free Space Underwater Communications","awardID":"0636603","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T885","name":"DIA-MASINT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0700","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7680","name":"ENG DIVERSITY ACTIVITIES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"T668","name":"NAVY-DEFIN THE BOUNDARIES OF U"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"T776","name":"NAVY-OPTICAL WIRELESS LINKS"}}],"PIcoPI":["556339"],"PO":["564441"]},"132403":{"abstract":"In this project, the PI from Washington University in St. Louis, Missouri and Co-PI from Texas Tech University in Lubbock, Texas propose to study the role of oscillatory patterns as an analog computational device. Specifically, the oscillatory patterns are generated by a spatially distributed array of weakly coupled dynamical systems, where the coupling is predominantly local, with perhaps a few long range interactions. Additionally, some of the dynamical systems in the network are driven by external inputs which modulate the spatiotemporal signal generated by the entire network.<br\/><br\/>The pattern generating circuit would be implemented in an array of MEMS (micro electro mechanical systems), in an array of coupled LASERS and in an array of coupled NEURONS. Each of the three arrays is well known for their ability to generate oscillatory patterns. For example, in the visual cortex of turtles, coupled neurons produce a propagating wave of activity that seems to respond to the visual input to the turtle retina. Like wise, an array of coupled LASERS seems to phase-lock into a sustained level of oscillation with a certain phase relation between two adjacent LASERS. Finally, an array of MEMS devices can be used to implement electro-statically controlled micro-actuators. These can be used to control locomotion of a land crawler or a swimmer.<br\/><br\/>For each of the three pattern generating circuits, the relationship between the controlled input and the generated oscillatory pattern would be studied with the following two specific tasks in mind. If the input is a sensory input, viz. visual input to the retina, the generated oscillatory patterns encode the sensory signals. For example, the location and velocity of a target is encoded in the spatiotemporal response of the generated cortical waves. An important task is to localize targets and to predict its future location by measuring the oscillatory patterns in the circuit. If the input to the circuit is a control input, viz. electrostatic input to a MEMS array, each element of the array is viewed as a signal generator that provides control input to a local actuator. An important task in locomotion is \"gait control\" which involves maintaining and switching between gaits. To achieve this task one needs to switch from one oscillatory pattern to another, perhaps as quickly as possible. <br\/><br\/> In summary, pattern generating circuits will be used for the purpose of sensory encoding and decoding with a specific aim towards \"target tracking\". They will also be used to provide coordinated control signals to a large number of actuators with a specific aim towards \"locomotion control\". An important extension of the proposed problem is \"gait control\" which involves smoothly switching between patterns in minimum time.","title":"BIC: Pattern Generating Circuits for Computation and Control","awardID":"0736514","effectiveDate":"2007-01-01","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["457288"],"PO":["565223"]},"122404":{"abstract":"CAREER: Distributed Estimation and Active Sensing with Mobile Robot Networks<br\/><br\/>Abstract<br\/><br\/>The objective of this research effort is to address current limitations on the autonomous operation of large, geographically distributed groups of robots and sensors collaborating for detecting events and objects of interest, and estimating their key parameters. The unifying theme throughout this endeavor is that communication, coordination, and performance evaluation are intertwined aspects of a new category of problems, specific to distributed systems, whose solution requires a holistic approach. <br\/><br\/>This research effort will focus on developing detailed models that quantify the effect on the accuracy of distributed estimation tasks of important factors such as the size of the robot team, type and precision of sensors, frequency of observations, and availability of communication and processing resources. Examples of cases that will be considered are cooperative localization, mapping, tracking, and detection with robots navigating in 3D under realistic sensing, communication, and processing limitations. This analysis will culminate in a concrete set of rules and methods that will be used to direct the design of robotic groups capable of achieving their mission objectives as described by user-imposed requirements on the expected precision and time to complete their task. The direct impact of this work will be significant cost savings during the design phase of a robotic team and throughout the robots' operation. Furthermore, this performance evaluation effort will empower robotics engineers with the ability to extrapolate from current design paradigms and reason for their selections based on formal analysis. The analytical results from this work will also be used as the basis for determining the optimal motion and communication strategies that maximize the efficiency of distributed sensing and estimation tasks. These algorithms will advance the state of the art in robot coordination for information acquisition, communication, and management by providing adaptability to changing conditions and increasing the reliability of mobile robot networks.","title":"CAREER: Distributed Estimation and Active Sensing with Mobile Robot Networks","awardID":"0643680","effectiveDate":"2007-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["553283"],"PO":["543539"]},"122547":{"abstract":"The project proposes improvements in tools for analyzing and modeling of Protein-Protein Interaction (PPI) networks. A PPI network is a mathematical representation of the physical interactions amongst proteins in a cell: it is a graph in which nodes represent proteins and edges between the nodes represent possible physical interactions between the corresponding proteins. Currently available PPI networks are partial and mostly resulting from various high throughput proteomics experiments that attempt to discover as many PPIs as possible in a number of organisms. The resulting PPI data sets are large including tens of thousands of interactions amongst thousands of proteins even for a unicellular eukaryotic organism such as baker's yeast.<br\/><br\/>The project introduces new, more sensitive measures of network local structure that are based on enumeration of \"graphlets\", small induced subgraphs of large graphs, as well as on distinguishing during the enumeration between the nodes in a graphlet that cannot be mapped to one another by an automorphism (an isomorphism of a graph with itself). In this way, the degree distribution is generalized into the spectrum of \"graphlet degree distributions\". These new measures produce graphlet-based network \"feature vectors\" that are further used to heuristically compare synthetic (model based) networks to experimentally determined PPI networks. The project's preliminary results indicate that geometric random graphs provide a superior fit to the currently available PPI networks than do other network models including scale-free networks. The project proposes to build upon these preliminary results towards an efficient PPI network alignment heuristic that would incorporate biological information of the proteins in the networks being aligned, such as protein functional, structural, and amino-acid sequence similarity. Furthermore, the project proposes to use geometric random graph models of PPI networks as the basis for algorithmic strategies that would optimize the cost of experimentally exploring the entire space of protein-protein interactions in the cell. The use of geometric random graph models and associated graphlet-based network feature vectors can be extended to other network modeling applications, such as epithelial planar cell polarization, chemical informatics, social network analyses, etc.<br\/><br\/>It is expected that the project will lead to better algorithms for various network comparison problems on PPI and other networks. Exploitation of a network model may significantly reduce the cost of characterizing the interactomes of various organisms.<br\/><br\/>The PI is involved in training high school, undergraduate and graduate students, including two female students. This work is being included in various UC Irvine courses. The software will be provided as a free open-source toolkit for other researchers. Additional information will be available at http:\/\/www.ics.uci.edu\/~natasha\/.","title":"CAREER: Tools for Analyzing, Modeling, and Comparing Protein-Protein Interaction Networks","awardID":"0644424","effectiveDate":"2007-01-15","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["456878"],"PO":["560586"]},"122405":{"abstract":"Accountability in computer systems is typically provided by preserving a history of activities and data. This allows past events to be analyzed to detect breaches, maintain data quality, and to audit compliance with security policies. In some settings, however, retaining a history of past data or operations poses a serious threat to privacy. Privacy and accountability are both important goals, and system designers need to carefully manage the balance between them. This CAREER research is building a database system capable of securely managing history, thus balancing the needs for privacy and accountability. In settings that require it, the system is configurable as ``memoryless'', protecting privacy by resisting unauthorized attempts to trace activities or recover deleted data. This is achieved by removing data safely when it is deleted, providing an accurate view of the data that is retained, and by offering bounds on the lifetime of sensitive data items stored in the system. In other settings, the system supports accountability by retaining desired history, permitting its efficient analysis, and protecting it from unwanted disclosure. <br\/><br\/>The broader impact of this project includes a publicly-available prototype database system embodying the goals above, along with curriculum extensions that bring privacy and system accountability themes into undergraduate education. In addition to enriching existing programs at UMass Amherst for training undergraduates in Information Assurance, this project will foster collaboration among the campuses of the Five College consortium of Western Massachusetts. The project results including the prototype source code and documentation and the project publications will be made available via the project website (http:\/\/dbgroup.cs.umass.edu\/securing-history).","title":"CAREER: Securing history: privacy and accountability in database systems","awardID":"0643681","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7486","name":"INFORMATION PRIVACY & SECURITY"}}],"PIcoPI":["449017"],"PO":["565136"]},"122516":{"abstract":"CAREER: Self-Managing Resource Allocation in Unsupervised Distributed Systems<br\/><br\/>Recent years have seen a growing deployment of distributed computing<br\/>infrastructures such as Grids, PlanetLab, @home, and peer-to-peer systems,<br\/>that run a variety of Web, commercial, and scientific applications.<br\/>Many of these infrastructures are unsupervised---they consist of large number <br\/>of loosely-connected nodes that contribute computational and storage <br\/>resources but are not centrally managed. Such unsupervised infrastructures <br\/>are characterized by uncertainty in their resource availability caused by <br\/>failures, varying load conditions, and node churn, thus putting undue burden on<br\/>application writers and system administrators for the successful<br\/>deployment and execution of applications. This project is developing a <br\/>self-managing resource allocation framework that would hide<br\/>the infrastructure uncertainties and dynamics from applications, <br\/>while transparently adapting to changing conditions within the infrastructure.<br\/>As part of this framework, this project is developing techniques for:<br\/>(i) Predictable resource aggregation to provide resource guarantees to <br\/>applications in the presence of dynamic loads and changing resource availability,<br\/>(ii) Reliability-aware resource management to provide desired levels<br\/>of reliability and availability, and<br\/>(iii) System inference and prediction to enable decentralized inference<br\/>of global system conditions for proactive response to dynamic infrastructure changes.<br\/>These techniques are based on cooperation and redundancy among nodes in the <br\/>infrastructure to provide scalability and decentralization. <br\/>The proposed research will have significant impact on distributed <br\/>computing by enabling effective deployment of large-scale scientific <br\/>and commercial applications on resource-rich but unreliable infrastructures.","title":"CAREER: Operating System Support For Transactional Memory: Construction and Performance Scalability of Parallel Programs","awardID":"0644205","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["555324"],"PO":["561889"]},"122549":{"abstract":"CAREER: A Behavior-Based Framework for Detecting Internet Worms<br\/>Jun LI<br\/>University of Oregon<br\/>0644434<br\/>Panel ID: 070111<br\/><br\/>Abstract<br\/><br\/>Accurate detection of Internet worms in their early stages remains an unsolved problem. One could scan Internet traffic for worm signatures or suspicious byte patterns, but worm signatures are often useless for unknown worms that exploit new software vulnerabilities, and suspicious byte patters are problematic because worms can carry virtually arbitrary payloads. Processing and analyzing traffic payloads is also expensive. These limitations have motivated investigations into the behaviors that self-propagating worms may display. However, for a behavior-based approach to succeed, researchers must now identify the precise or essential behaviors that worms will display. <br\/><br\/>The objective of this research is to systematically define, extract, and leverage essential worm behaviors while watching the inbound and outbound traffic of an infected domain, and to understand the effectiveness and limitations of a behavior-based approach in detecting and classifying worms and identifying infected hosts. <br\/><br\/>This research proposes the design, development, and evaluation of a framework called SWORD to study the causality and payload-independent similarity of worm connections, their destination visiting patterns as compared to normal connections, and their continuity as a worm spreads, with the consideration that certain legitimate connections may appear worm-like and that smart worms can attempt to hide themselves.<br\/><br\/>This research is a critical step towards preventing the severe economic and social disruption that Internet worms can cause. The research results and artifacts will be made available to the academic community through dissemination of security curricula and software tools, and to the public through publications and technology transfer.","title":"CAREER: A Behavior-Based Framework for Detecting Internet Worms","awardID":"0644434","effectiveDate":"2007-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["446168"],"PO":["564388"]},"127917":{"abstract":"Frazzoli, Emilio<br\/>CAREER: High-Confidence Software for Aerospace Embedded Systems<br\/>CCR-0133869<br\/><br\/>This research project is developing new tools and techniques for the design and analysis of high-confidence software for complex, distributed, reconfigurable aerospace embedded systems, and to transfer these methods to undergraduate and graduate students, other researchers, and industry. Examples of problems of direct interest are those arising in the control and coordination of multiple autonomous air and space vehicles, and in the detection and resolution of conflicts in Air Traffic Control. The techniques developed in this project are also applicable to other systems which require similar levels of reliability and performance, such as highway traffic automation systems, health care systems, power networks, and financial services.<br\/><br\/>Of particular interest for this project is a better understanding of the interactions between real-time software and dynamical systems. This will lead to new and powerful tools and techniques for the design and analysis of embedded systems, as well as an improved approach to the requirement specification for real-time systems.<br\/><br\/>The main core of the research project is aimed at dramatically reducing the complexity of embedded and hybrid systems design and verification by exploiting the geometric structure of the underlying physical system in the modelling effort, and by preserving this structure in the design of control laws and algorithms. This will make feasible for the analysis of the complete system, including its physical and software components, otherwise poorly scalable techniques such as abstract interpretation and model checking, and will provide the means for the effective use of techniques based on compositional<br\/>reasoning.<br\/><br\/>For example, group symmetries in vehicle dynamics give rise to families of equivalent controlled trajectories: such sets are called motion primitives for single vehicles, and motion coordination primitives for groups of vehicles. A maneuver automaton is a collection of a finite number of motion primitives. In other words, a maneuver automaton is a discrete model of the vehicle dynamics, which leads to a dramatic reduction of the complexity of describing and controlling the vehicle behavior, by providing a high level of abstraction, and at the same time providing invariants which ensure that the physical state remains within some known bounds.<br\/><br\/>The educational part of the project is implemented through new course and curriculum development, and student mentoring. The main educational objective is to provide both undergraduate and graduate students with the knowledge and the skills to understand the key issues and to ensure technical leadership in the current and future aerospace information technology arenas. Finally, a special effort is devoted to the development of an interactive web site, where it is possible to access all the relevant information and software developed for the courses, and as a result of the research project.","title":"CAREER: High-Confidence Software for Embedded Aerospace Systems","awardID":"0715025","effectiveDate":"2007-01-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["526913"],"PO":["561889"]},"120669":{"abstract":"Cornell University proposes a project, called BPC-DP: Worlds for Information Technology and Science (WITS), that will broaden the participation of women and minorities in computing through the use of service learning. Service learning has been shown to appeal to higher percentages of women and underrepresented minorities by providing contextualized learning and community building that enhances self confidence. The proposed project includes the development of a new three-credit course, Computing in Context, which integrates concepts of computer and information science into a curriculum that includes undergraduate mentoring of middle school students as an outreach component. As the undergraduates guide middle school student teams in the building of virtual computer and information science fair exhibits in a cyber-based science museum of online virtual worlds, called CyCentr, the undergraduates apply their own learning of design concepts for collaborative environments, including working knowledge of networks, file systems and formats, communication protocols, and security. To ensure scalability and adaptability, the approach will be tested at three geographically dispersed university institutions providing different higher education and middle school environments.","title":"BPC-DP: Worlds for Information Technology and Science (WITS)","awardID":"0634418","effectiveDate":"2007-01-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":[320597,"382897"],"PO":["561855"]},"126928":{"abstract":"The purpose of this award is to plan and hold a two-day workshop which brings together leading international researchers in the field of natural language generation (NLG), with the aim of establishing a clear, community-wide, position on the role of shared tasks and comparative evaluation in NLG research. In recent years, shared-task evaluation campaigns (STECs) have become increasingly popular in natural language understanding. In a STEC, different approaches to a well-defined problem are compared based on their performance on the same task. The NLG community has so far withstood this trend, but there are a significant number of researchers in the community who believe that some form of shared task, and corresponding evaluation framework, would be of benefit in providing a focus for research in the field. However, there is no clear consensus on what such a shared task should be, or whether there should be several such tasks, or what the evaluation metrics should be.<br\/><br\/>The aim of the workshop is to provide a forum that provides the time and involvement required to subject the different views to rigorous debate. We expect the workshop to result in the working out of a number of clearly argued positions on the issue, including basic specifications for a variety of shared task evaluation campaigns that can then be considered by the wider community.<br\/>The outcomes of the workshop will be documented in a report, disseminated via the workshop website, summarizing the workshop discussions and including the participants' contributions.","title":"A Proposal for a Workshop on Shared Tasks and Comparative Evaluation in Natural Language Generation","awardID":"0710730","effectiveDate":"2007-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["553805",336800],"PO":["565215"]},"120659":{"abstract":"The Rochester Institute of Technology proposes a planning activity to develop Project ACE: Accessible Education for visually impaired students. Despite advances in assistive technologies, relatively few visually impaired students participate in university-level computing courses. Significant factors in this under representation include lack of relevant precollege preparation, lack of role models, access to resources, and the highly visual nature of modern computing. Visually based notations, tools and user interfaces have lead to visually intensive instruction, making it difficult for students with visual impairments to follow traditional classroom activities. This planning grant will develop a project to increase the participation of students with visual impairments in computing through the development of accessible class materials, resources, and teacher professional development. Potential activities include summer and year-round, theme-based activities for students and parents that encourage exploration in networking, programming, and robotics. These activities will provide a foundation for teacher workshops in accessible lesson development. In addition, online resources will be expanded to provide students and education access to tutorials, tools, and discussion to bring together industry practitioners, educators, and students to promote the exploration of issues and successes regarding participation in computing by the visually impaired.","title":"BPC: Project ACE: Accessible Computing Education for Visually Impaired Students","awardID":"0634319","effectiveDate":"2007-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["527961","530220"],"PO":["561855"]},"122408":{"abstract":"Embedded networked sensing devices are becoming ubiquitous across many activities that are important to our economy and life. The physical locations of the sensor nodes greatly impact the system design in all aspects from low-level networking and organization to high-level information processing and applications.<br\/><br\/>This project takes a geometric approach to study algorithms in sensor networks and investigates a number of fundamental ideas about <br\/>o how the geometric embedding of sensor networks influences how the network can operate?<br\/>o how to exploit the geometric characteristics for efficient and scalable network design?<br\/><br\/>The project addresses a number of important architectural components where geometry has a fundamental influence, including localization, topology discovery, naming and routing, information discovery and brokerage, and mobility, in a harsh environment in which sensor networks operate:inaccuracy or unavailability in location information, limited resources such as bandwidth and energy, noisy or incomplete data, preferable distributed computation and high link or node failure rate. Expected results include the exploration of new models and abstractions, and novel geometric algorithms with provable performance guarantee in a probabilistic, dynamics and information incomplete world.<br\/><br\/>We expect that the exploration of sensor networks' rich geometric properties will reveal key insights that enable the creation of large-scale sensor networks. In addition, this interdisciplinary project provides a bridge between communities of computational geometry and wireless networking - identifying important geometric problems for the computational geometry community as well as supplying efficient algorithmic solutions for the networking community.","title":"CAREER: Geometric Algorithms for Wireless Sensor Networks","awardID":"0643687","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["519259"],"PO":["557315"]},"120836":{"abstract":"Abstract for CCF-0635355, Aspects of Algorithmic Number Theory<br\/>PI: Eric Bach<br\/><br\/>This project deals with the design and analysis of algorithms for solving problems in number theory, and the mathematics that underlies these algorithms. Number-theoretic algorithms are basic to the nation's infrastructure, as they are used continually for public key encryption, encoding of messages to resist transmission errors, and pseudo-random number generation. They also form the innermost layer of any computer algebra system. In addition, many fundamental questions in computational complexity theory are linked to number theory.<br\/><br\/>The research focuses on five specific areas: <br\/>a) Arithmetic functions related to factoring and the uniform generation of decomposable objects; <br\/>b) Optimality testing, including generalizations of Carmichael numbers; <br\/>c) Algorithms for factoring polynomials over finite fields; <br\/>d) Algorithms for discrete logarithms;<br\/>e) Combinatorial computations of an arithmetic nature. <br\/>Broader impacts of the research include helping to train the next generation of computationally oriented researchers, contributing to better systems for secure and reliable communication, and enhancing local computational infrastructure and local, national, and international intellectual collaboration.","title":"Aspects of Algorithmic Number Theory","awardID":"0635355","effectiveDate":"2007-01-15","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":[321051],"PO":["565251"]},"120826":{"abstract":"Ultrasound is an important medical imaging modality because of its non-invasive, real-time, low-cost nature, and its ability to delineate soft tissues. As digital signal processing hardware becomes more sophisticated and more economical, it is now possible synthesize complex transmission waveforms to enhance image quality. This research studies the design and optimization of ultrasound waveforms, and the accompanying signal processing techniques and image formation algorithms. <br\/> <br\/>The investigator considers three types of waveform design problems with different objectives. (1) Coded excitation pulse with the objective of maximizing SNR, which is most appropriate in object detection applications. The primary approach here is coded modulation technique addressing the unique frequency dependent attenuation of ultrasound waves. (2) Adaptive pulse selection with the objective of maximizing mutual information between the image and the transmitted waveform. Such waveforms are optimal for imaging extended objects such as biological tissues. The algorithm is to successively compute new transmission pulse based on previous returns, thus making the transmission pulses object dependent. (3) Design of novel beamforming basis functions with the objective of maximizing spatial resolution. Standard delay-and-sum beamforming is intuitive and easy to implement, however it is not optimized for spatial resolution particularly in the near field. The investigator's approach establishes rigorous mathematical objective functions quantifying resolution and uses modern optimization tools to obtain the solutions of optimal spatiotemporal basis functions for image formation.","title":"Advanced Signal Processing and Image Formation Algorithms for Medical Ultrasound","awardID":"0635288","effectiveDate":"2007-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["328588",321030],"PO":["564898"]},"120728":{"abstract":"Intellectual Merit<br\/>Attaining broadcast channel capacity relies on dirty paper coding using nested lattice codes and quantization<br\/>to codewords from a given coset; this in turn can be reduced to nearest-neighbor or maximum likelihood<br\/>decoding, solved in principle by the Viterbi algorithm applied to trellis codes. Capacity-approaching codes,<br\/>however, have trellis descriptions with prohibitive complexities, restricting this technique to (lower performance)convolutional codes. Code word quantization via iterative decoding, which has links to constrained maximum likelihood sequence estimation, regrettably fails here as well, as documented within.<br\/>To overcome these limitations, we investigate successive code word quantization in two forms: the<br\/>first draws on the rich structure of reduced-order Hankel-norm approximation from system theory, and<br\/>pursues its adaptation to trellis descriptions of capacity-approaching codes over finite fields. The goal is to<br\/>obtain a reduced order (hence, lower complexity) trellis description amenable to Viterbi decoding, which in<br\/>turn serves as the initial point for finer code word quantization. A parallel approach studies quantization<br\/>decoding\" using the variable code rate structure innate to nested codes; quantization is first performed using<br\/>a higher rate code, which rate is progressively reduced to the target rate.<br\/>The second problem concerns code book generation for multiple access channels. This draws on pseudorandom<br\/>interleaver design using modular arithmetic over prime factor fields, in order to parametrically generate<br\/>distinct user codes with minimal overlap. Unlike direct-sequence CDMA, whose spreading sequences<br\/>are repetition codes devoid of coding gain, users are distinguished by their channel codes without additional<br\/>rate loss from spreading sequences. The proposed technique generalizes the recently introduced interleaver<br\/>division multiple access (IDMA) scheme, and preliminary results indicate improved performance in specific<br\/>scenarios. In addition, by recasting interleavers as decryption keys, relations to secrecy systems will likewise be developed. The proposed framework accommodates secrecy suitable for mobile wireless systems,<br\/>offering negligible overhead and freedom from export restrictions that may accompany strong encryption,<br\/>as a first-line defense that must accompany the ubiquity of wireless network expanstion.<br\/>Broader Impact<br\/>In addition to the direct benefits to multi-user communications from the expected results, many of the<br\/>coding\/decoding configurations to be studied in the proposed research will be integrated into senior and<br\/>graduate level courses taught at the Catholic University of America, in the form of design projects that enhance students' abilities to master the interaction between information theory and reliable communications.<br\/>In addition, Hankel norm approximation tools, which have traditionally been better developed in the control<br\/>field, may serve to bridge some traditional divides between systems and communications researchers.","title":"MUCHO: Two problems in Multi User Coding for High Occupancy Channels","awardID":"0634757","effectiveDate":"2007-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["564924"],"PO":["432103"]},"129361":{"abstract":"This project will develop the architecture and components to automate configuration and management of a large, mixed-use server cluster. The cornerstone of the architecture is a cluster site manager called Cluster on Demand (COD) that adds a fundamental new capability to manage a cluster as a multi-purpose modular resource hosting different environments in isolated partitions. COD will support secure isolation of multiple user communities, pushbutton control over software environments subject to appropriate authorization controls, and dynamic policy-based resource provisioning. The COD design leverages widely used open-source components to support diverse hardware platforms and software configurations, and to evolve rapidly with new technology. The project will develop a COD software release integrated with other components of the NMI software suite, and evaluate it through test deployments at Duke University and MCNC, with grid connections to the NC BioGrid.<br\/><br\/>Intellectual Merit and Broader Impact - The project will facilitate the deployment of clusters to advance science and education, reduce costs and improve return on investments in cluster infrastructure, and remove key barriers to sharing cluster resources across organizational boundaries. The project will also provide research experiences for graduate students and promote participation by underrepresented groups. Among the students participating in the project are two female PhD students. The project will also create opportunities for Duke's Research Experiences for Undergraduates (REU) program to mentor underrepresented undergraduates (primarily African-Americans) during summer internships.","title":"NMI: Collaborative Research: A Grid Service for Dynamic Virtual Clusters","awardID":"0721419","effectiveDate":"2007-01-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4089","name":"NETWORK CENTRIC MIDDLEWARE SVC"}}],"PIcoPI":[342755],"PO":["7594"]},"127010":{"abstract":"Information Technology is making great progress in the operating room. In the practice of minimally invasive surgery, three-dimensional modeling techniques are enabling preoperative planning, new image acquisition and display techniques, and superior dexterity through teleoperated robotic systems. However, one sensory channel is presently ignored in these technological improvements: touch. In manual surgeries, haptic feedback is crucial for palpation, suture manipulation, and detection of puncture events. Sensation of forces is particularly important for invasive tool-tissue interaction tasks such as grasping, cutting, dissection, and percutaneous (GCDP) therapy. Lack of haptic information overloads the visual sensing required of the surgeon, requiring a demanding level attention. For information technology to truly enhance the practice of surgery, multiple sensory channels must be utilized. <br\/> <br\/>We propose to develop instrumentation and algorithms for modeling the haptic aspect of tool-tissue interaction in four common surgical tasks, namely: grasping, cutting, dissection, and percutaneous therapy. This system will significantly enhance information display in three ways. First, data acquired in real time will be used to provide feedback to the surgeon during model-based teleoperated procedures, increasing the transparency. of the robot-assisted surgical system. Second, real-time modeling techniques will enable model-based teleoperation, removing the strict constraints imposed by time delays in traditional, direct teleoperation. Third, realistic surgical simulations will improve training, increasing surgeon competence and patient safety. The instrumentation and modeling algorithms will be used to determine parameter values for different tissue types, particularly liver, prostate, spleen, and kidney. Ex-vivo tissues and phantom hydrogel tissues will be used in these experiments. Once the instrumentation and modeling techniques are developed, we will proceed to extensive validation of the three applications of enhanced information display. Performance experiments will verify improvements in accuracy and precision for direct and model-based teleoperation, and a computer vision\/force sensing system will determine the realism of force and deformation models developed for surgical simulation. This proposal addresses the ITR challenge for developing an information-enhanced display with computational, simulation, and data analysis methods for modeling common surgical GCDP tasks for which currently there is no systematic model. <br\/> <br\/>Intellectual merit: The specific goal of this project is to significantly improve the information-enhanced operating room through the sensing and acquisition of models representing haptic information during tool-tissue interactions in minimally invasive surgery. This research will significantly impact: (a) tool-tissue interaction models that reflect the actual forces and deformation occurring during surgery, (b) haptic feedback to the surgeon during direct or modelbased teleoperation, thereby improving surgical outcomes, c) the development of realistic simulations for training current and future health care professionals, and d) the development of instrumented smart tools for both traditional minimally invasive and robot-assisted surgeries. <br\/> <br\/>Broader Impacts: The PIs from both institutions have an excellent history of involving undergraduate students (both men and women) in research projects through Research Experience for Undergraduates (REU). Additionally, the Drexel Research Experience for Teachers (RET) site proposal recommended for funding by NSF, along with an established RET program at Johns Hopkins, will involve high-school math and science teachers from high schools to participate in summer research projects related to this proposal. These activities will enhance participation of underrepresented groups from inner-city schools and lead to broader dissemination of scientific and technological education of the students and teachers. <br\/>For graduate students, the interdisciplinary nature of this research offers new opportunities in education, broadening the interaction of mechanical engineers and medical professionals. Finally, the proposed research will lead to improvements in surgical outcomes, benefiting the patient and the society at large. <br\/> <br\/>Due to the diverse areas of research required by this project, the proposed research will benefit from the collaboration of PIs from Drexel and JHU. Drexel has expertise in haptics, FEM modeling, grasping\/dissection tasks, and phantom tissues while JHU has expertise in reality-based modeling for cutting\/percutaneous therapies, haptics, and validation experiments for human-machine systems. The unique facilities and collaborations at both institutions, along with strong ties to medical professionals, make this work appropriate as a collaborative research project.","title":"ITR: Collaborative Research: Modeling and Display of Haptic Information for Enhanced Performance of Computer-Integrated Surgery","awardID":"0711040","effectiveDate":"2007-01-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}}],"PIcoPI":["379044"],"PO":["521045"]},"126042":{"abstract":"The proposal requests partial support for young researchers and graduate students to participate in 2007 IEEE Communication Theory Workshop to be held in the Hilton Sedona Resort & Spa, Sedona, AZ. The NSF support will provide opportunities for approximately 25 young participants to interact with established researchers in a small and inspiring workshop setting. The focus of the workshop is on the interplay among communication theory, information theory and network theory.<br\/>The broader impact of the proposal is fostering an environment of technical discussions and debates among two different communities of communication theorists and networking researchers. In addition, the workshop is set out to encourage participation by young scientists and researchers.","title":"A Proposal to Support Young Scientists and Graduate Students in 2007 IEEE Communication Theory Workshop in Sedona, Arizona, USA","awardID":"0706670","effectiveDate":"2007-01-15","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["518327"],"PO":["348215"]},"122270":{"abstract":"Proposal 0642906<br\/>\"CAREER: Synthesis of Search Procedures for Constraint Programs\"<br\/>PI: Laurent D. Michel<br\/>University of Connecticut<br\/><br\/>Abstract<br\/><br\/>This research aims at synthesizing constraint programs (CP) from high-level constraint programming models. Constraint programming is a method for solving complex optimization applications, which are ubiquitous in our society, are critical to many industries, and affect almost every aspect of our daily lives. However, current constraint programming methodologies require significant expertise to design and program search procedures, and consequently, are not yet widely used by optimization modelers. This is in contrast with modeling languages for mathematical programming, which are now highly automated.<br\/><br\/>This project investigates the automatic synthesis of constraint programs from high-level models. Its approach exploits the ability of constraint programs to express combinatorial structures in individual constraints to derive key properties like symmetries or dominance for entire models. From these properties, it can reformulate and synthesize search procedures adapted to the underlying solver technology, such as constraint programming, local search, integer programming, or even hybrids. To educate the next generation of engineers, the PI is developing material targeting high school math and science teachers and will disseminate these efforts via the DaVinci initiative at the University of Connecticut. The Broader Impacts of this project include the development of a new generation of modeling languages and systems based on recent advances in programming languages, compilers and artificial intelligence; these will be able to serve a wider audience of optimization modelers.","title":"CAREER:Synthesis of Search Procedures for Constraint Programs","awardID":"0642906","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[324828],"PO":["562760"]},"122392":{"abstract":"Intent-based Network Management<br\/><br\/>This research is developing a framework for better managing IP<br\/>networks using an intent-based network management approach to address<br\/>the performance and robustness issues associated with managing complex<br\/>IP networks. The goal is to automatically generate needed network<br\/>configurations by requiring only high-level objectives as input while<br\/>also ensuring network-level objectives such as performance and<br\/>reliability. The research develops design principles applicable to<br\/>managing both current and future networks and provides insight into<br\/>designing networks for manageability. Using abstraction-based<br\/>representations, the framework enables high-level specifications to<br\/>automate low-level tasks, so that one can directly manage the network.<br\/>Three main obstacles in today's network management are addressed:<br\/>insufficient visibility, inability to predict the outcome of network<br\/>configuration changes, and hidden errors in configurations due to<br\/>assembly-language-like interfaces. The research develops these key<br\/>techniques: (1) Measurement-based derivation of network protocols'<br\/>operational models to elicit undocumented limiting behavior. (2)<br\/>Methods to quantify limitations of measurement methodologies to enable<br\/>more accurate result interpretation. (3) Privacy-preserving,<br\/>incentive-compatible data sharing across networks. (4) Systematic<br\/>evaluation of trade-offs by developing metrics for quantifying network<br\/>properties and abstractions encapsulating device details. (5)<br\/>Real-time decision support for what-if analysis and automated<br\/>intent-based configuration generation. (6) Joint control and data<br\/>plane management.<br\/><br\/>The research will advance the state of the art in managing IP networks<br\/>by addressing key challenges in achieving automated, evolvable, and<br\/>robust network management. Any developed software will be publicly<br\/>available. The research results will be integrated into undergraduate<br\/>and graduate curriculum.","title":"CAREER: Intent-Based Network Management","awardID":"0643612","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["549845"],"PO":["565327"]},"119412":{"abstract":"With the continuing growth of the use of the Internet for business purposes, the consequences of a possible cyber attack that could create a large scale outage of long time duration is an increasingly important economic issue. In 2003, the President's National Strategy to Secure Cyberspace stated that government action is warranted where alleged \"market failures result in underinvestment in cyber security\". However, there is scant empirical evidence and\/or theoretical support for such \"market failure\". While there exists a large body of technical literature on cyber security, research on the economics of cyber security is still in its very early stages.<br\/><br\/>This project contributes to a better understanding of the economics of Internet security through a combination of theoretical and empirical research efforts. First, the economic motivations for investment in added Internet security by Internet Service Providers (ISPs) are analyzed using game theoretic models. Customer's sensitivity to quality of service and depreciation of investments in added security play key roles in determining the ISPs' investment incentives. However, these incentives may not be perfectly aligned with the social value (derived from Internet usage) at stake during a cyber attack. Empirical research is undertaken to estimate to what extent private incentives for investment may lead to a situation of underinvestment in cyber security.<br\/><br\/>The results of this research project will have a broader impact in informing the process of regulatory policy-making towards securing cyberspace. In addition, the interplay between the economic and <br\/>technological issues associated with the provision of Internet will be the subject of a number of educational initiatives both at graduate and undergraduate levels. These include: a graduate seminar on cyber security, new material for existing courses in E-commerce and the economics of engineering systems and \"Capstone\" projects (senior theses). The research findings will be reported in the project web site (http:\/\/www.people.virginia.edu\/~ag7s\/economics_of_internet_security.htm","title":"CT-ISG: The Economics of Internet Security: Theoretical and Empirical Analysis","awardID":"0627399","effectiveDate":"2007-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["540771","540770",316689],"PO":["565327"]},"122470":{"abstract":"Abstract<br\/><br\/>Due to the growing complexity of software applications, increasing dependence on the services offered by these applications, and decreasing resources available to build and maintain them, reliability assessment of an application must provide systematic, quantitative guidance for cost-effective reliability improvement. The guidance must also consider the interplay of reliability with other attributes such as performance, cost, and effort to strike the right balance between them. Architecture-based software reliability analysis offers the potential to provide such early guidance considering the tradeoffs among multiple attributes. The project will enable advances in architecture-based software reliability analysis through the development of: (i) modeling techniques to consider the characteristics of real-life software applications including concurrency, deterministic execution times of components, interface failures, failure severities, and architecture styles, (ii) analysis techniques to facilitate component prioritization and quantification of confidence intervals, (iii) estimation techniques to determine model parameters from different software artifacts, and (iv) optimization techniques to allow two-way and three-way tradeoffs between performance, reliability, cost, and effort. Evaluation and validation of the developed techniques will be based both on controlled experiments and real-life case studies. <br\/><br\/>The outcomes of the research will be disseminated via publications and will be implemented in a user-friendly tool which will be made available via the Web. A comprehensive education plan is integrated with the project. The plan comprises: (i) curriculum development of graduate and undergraduate courses, (ii) short courses and tutorials for presentation at conferences and industrial and research institutions, (iii) international educational visits, (iv) involvement and participation of high school and middle school students and their teachers, and (v) involvement of underrepresented groups and minorities.","title":"CAREER: Architecture-based Assessment of Software Reliability","awardID":"0643971","effectiveDate":"2007-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["465137"],"PO":["535244"]},"126243":{"abstract":"This is funding to support a workshop of approximately 30 graduate students and recent graduates from master's and doctoral programs in diverse communities (including computer science, engineering, psychology, cognitive science, and communications), along with distinguished research faculty. The event will take place on Thursday, March 8, 2007, in Arlington, Virginia, immediately preceding the Second Annual Human Robot Interaction Conference (HRI'07), to be held March 9-11, which is sponsored by ACM and cosponsored by IEEE. This workshop is designed to complement the conference by providing a forum for students and recent graduates in the field of human-robot interaction to present their current research to their peers and to a panel of senior researchers in a setting that is less formal and more interactive than the main conference. Student and faculty participants will talk about the important upcoming issues in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. The workshop will include three types of sessions: student presentations, breakout sessions, and group presentations. Participants will hear short presentations on current research from 12 selected participants, with time allotted for questions and discussion after each of these talks. Breakout sessions will divide the participants into 2-4 groups to discuss a focused question on common research themes posed by the organizers. The morning session will pose questions related to levels of interaction (individual, group, and organization\/public), and relationships between types of interaction (physical, cognitive, social, emotional). The afternoon breakout session will involve a small group project, in which participants must work together to address some facet of HRI in a given domain\/application (e.g., design parameters, methods and techniques, relevant technologies). Following a keynote address from a distinguished researcher in the field, the group presentation session will provide each breakout group with the opportunity to present a summary to the entire workshop. It is anticipated that workshop Proceedings will be published in conjunction with the conference Proceedings. <br\/><br\/>Broader Impact: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (e.g., computer science and engineering, psychology, robotics, human factors and ergonomics, and human-computer interaction). This is important for the field, because it has been recognized that advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming year. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Young HRI Researchers Workshop","awardID":"0707290","effectiveDate":"2007-01-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["372103","565226"],"PO":["565227"]},"122361":{"abstract":"Internet growth has outpaced the development of tools and techniques to understand its flaws and faults. Users have assumed the role of administrators of small networks without the background and skills of their professional counterparts. To address this changing domain, this project focuses on techniques for embedding diagnostic techniques into commonly-used wireless and transport protocols. In this new design, diagnostic information bypasses the narrow error-reporting interface used by \"sockets\" and instead reports directly to the user such performance faults as a congested wireless domain, a failed cable modem connection, or significant queuing that degrades voice performance. With this diagnostic information, the new administrators of small networks may make more informed decisions about hardware purchasing and service provisioning. Software module prototypes to extend the Linux kernel TCP implementation and atheros 802.11 driver, as well as an intelligent user interface to diagnostic reports are planned.<br\/><br\/>Broader Impact: <br\/><br\/>Developments in techniques for understanding the network as operators and users will enhance the educational experience for students, exposing them to real network behavior without sacrificing focus on fundamental concepts of naming, routing, and transport protocols. Students trained in this project will be well-equipped to develop new protocols, conduct systems experiments on the PlanetLab test-bed, and validate measurements of network faults.","title":"CAREER: Self-Diagnostic Network Protocols","awardID":"0643443","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["438680"],"PO":["565090"]},"122372":{"abstract":"CAREER: Self-Managing Resource Allocation in Unsupervised Distributed Systems<br\/><br\/>Recent years have seen a growing deployment of distributed computing<br\/>infrastructures such as Grids, PlanetLab, @home, and peer-to-peer systems,<br\/>that run a variety of Web, commercial, and scientific applications.<br\/>Many of these infrastructures are unsupervised---they consist of large number <br\/>of loosely-connected nodes that contribute computational and storage <br\/>resources but are not centrally managed. Such unsupervised infrastructures <br\/>are characterized by uncertainty in their resource availability caused by <br\/>failures, varying load conditions, and node churn, thus putting undue burden on<br\/>application writers and system administrators for the successful<br\/>deployment and execution of applications. This project is developing a <br\/>self-managing resource allocation framework that would hide<br\/>the infrastructure uncertainties and dynamics from applications, <br\/>while transparently adapting to changing conditions within the infrastructure.<br\/>As part of this framework, this project is developing techniques for:<br\/>(i) Predictable resource aggregation to provide resource guarantees to <br\/>applications in the presence of dynamic loads and changing resource availability,<br\/>(ii) Reliability-aware resource management to provide desired levels<br\/>of reliability and availability, and<br\/>(iii) System inference and prediction to enable decentralized inference<br\/>of global system conditions for proactive response to dynamic infrastructure changes.<br\/>These techniques are based on cooperation and redundancy among nodes in the <br\/>infrastructure to provide scalability and decentralization. <br\/>The proposed research will have significant impact on distributed <br\/>computing by enabling effective deployment of large-scale scientific <br\/>and commercial applications on resource-rich but unreliable infrastructures","title":"CAREER: Self-Managing Resource Allocation in Unsupervised Distributed Systems","awardID":"0643505","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["543510"],"PO":["561889"]},"122450":{"abstract":"David R. Martin<br\/><br\/><br\/>Abstract<br\/><br\/>Machine vision systems can now do amazing things: Reading irises and faces, helping to drive autonomous cars in real environments, locating and measuring anatomical structures in medical scans -- these are just a few examples of capabilities that have emerged in recent years.<br\/>Special-purpose domains still mark the limit of our success, however.<br\/>The goal of human-level machine vision is still out of reach because the solutions found to these problems do not require the machine to understand the rich structure of visual information.<br\/><br\/>It is essential to take an empirical approach to the problem of visual perception. The primary goal of this project is to build a dataset of ground truth image annotations that provides the perception of scenes at the level of surfaces, objects, and basic 3D scene geometry. This dataset will be unprecedentedly rich and detailed, providing precisely the information and representations needed to bring general purpose capabilities to machine vision systems. A secondary goal of this project is to create the associated benchmarks and methodologies for evaluating machine systems with respect to the ground truth data.<br\/><br\/>Intellectual Merit: At the heart of this proposal is the design of a dataset for mid-level vision. The mid-level representation of visual information proposed in this project is of fundamental importance, because there is currently no viable mid-level representation in machine vision. A good mid-level representation is both computable from images as well as useful for higher level tasks. A generic, concrete, and testable mid-level representation is perhaps the most important deliverable of the proposed project.<br\/><br\/>Broader Impact: The proposed project will have broad impact on the machine vision and human vision research communities. Machine vision models require complex ground truth data for training and benchmarks for evaluation, while psychophysics modelers face the challenge of data from natural images. Additionally, this project will make all its data and tools freely available to the research community. In general, this is an exciting time for machine vision. We are at the threshold of building machines that attain human-level visual perception, which would dramatically alter the relationship between people and machines. With datasets targeting the strategic research problems, significant progress is at hand.<br\/><br\/>URL: http:\/\/vision.bc.edu\/~dmartin\/MidLevel","title":"CAREER: Ground Truth Dataset and Benchmarks for Mid-Level Vision","awardID":"0643887","effectiveDate":"2007-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["478866"],"PO":["564316"]},"123561":{"abstract":"Abstract<br\/>CNS-0649105<br\/>PI: Caroline Eastman<br\/>Institution: University of South Carolina<br\/><br\/>Title: REU Site: Multidisciplinary Research in Computing<br\/><br\/><br\/>This project renews an exemplary CISE Research Experience for Undergraduates site focused on the areas of information secure and reliable software. A regional recruitment process is used to select cohorts of undergraduate students to participate in a summer research program at the host institution. The project includes mentoring by the experienced faculty members, technical seminars and workshops, student presentations, and field trips and other professional development opportunities. It also includes a special ethics in information technology and research component. The project refines the recruitment, selection, and performance evaluation processes developed in the previous REU site project at the institution.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in current research areas that are of interest to the community at large and that and can lead to the development of more effective tools for the engineering of secure, reliable, and effective software. The students participate in a full range of research activities from preparing research literature to production and dissemination of research results.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups using established collaboration with the South Carolina Alliance for Minority Participation (SCAMP) program. The participating faculty members are committed to under-represented minority students in their research. The institution has an outstanding record of supporting undergraduate research with many of the undergraduates selecting to go on to graduate school as a result of the experience. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Sites: Multidisiciplinary Research in Computing","awardID":"0649105","effectiveDate":"2007-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["444741","444742"],"PO":["564181"]},"117764":{"abstract":"This project, acquiring audio visual equipment to create a laboratory environment to carry out usability studies on humans and their interactions with user-interfaces, emphasizes people with disabilities, both permanent and situational, including instances when the person is too busy and cannot interact with the computer (e.g., a person whose phone\/PDA is ringing while driving). The faculty (9 involved) conduct controlled experiments of human performance and satisfaction, investigations of how technology functions with respect to human capabilities, and field studies use in context. The research involves<br\/><br\/>-Lab-based 1-on-1 classical testing, Focus groups, Field-based testing, <br\/>-Computer Mediated Communication (CMC) and Computer-Supported Cooperative Work (CSCW) ; and<br\/>-Distance Learning, and CMC-Assisted Learning<br\/><br\/>By investigating the design, implementation, and evaluation of interactive information technologies (IT), the Human-Computer Interaction (HCI) work aims at producing theoretical contributions. This research focuses primarily on the challenges involved in supporting groups working together to address a common goal, information seeking activities, and personalized\/adaptive interfaces. The Universal Access (UA) research addresses the difficulties individuals experience interacting with IT as a result of either health-related or situational-induced impairments and disabilities. Stemming from investigation of the IT difficulties experienced by individuals with high-level spinal cord injuries, this research has expanded to address a broad range of interaction issues, with an emphasis on physical disabilities.","title":"MRI: Acquisition of Equipment to Establish a Research Infrastructure to Support HCI and UA Research","awardID":"0619379","effectiveDate":"2007-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[311750,"466602","324577","319086"],"PO":["557609"]},"118645":{"abstract":"For the HSD initiative, Embryo research provides a case study of rapidly changing science within radically contested contexts. As with any science, embryo research is embedded in webs of unsettled ethical, legal, political, religious, cultural, and social negotiations that shape the conduct of science, its diverse meanings, and the spectrum of decisions built upon such understandings. Embryo research starts with a scientific drive to understand development of the individual organism and is shaped by three clusters of factors: (1) technical, including experimental techniques, equipment, and the way results are presented (in publications and presentations) and represented (in images and models); (2) actors, laboratory settings, institutions, and local contexts of scientific and technical work; and (3) social\/cultural\/ intellectual\/economic environments in which the work is done. These clusters of Technical, Actors\/Places, and Social\/Cultural all impact and are impacted by the science. Understanding each requires different disciplinary research approaches, and understanding interactions requires multi-disciplinary research strategies and methods. The factors combine to serve as \"Agents of Change\" shaping science in society. This project explores those agents of scientific change in a dynamic, interactive, integrative, interdisciplinary, international research environment. With regards to Intellectual Merit, we will accomplish two major intellectual goals. First is a rich understanding of the history and current state of embryo research, the factors involved, and the multiple contexts in which research is done. Because of the importance of embryo research, this is of powerful intellectual value itself. Furthermore, in bringing together multiple otherwise disparate areas of study related to this particular case, we will achieve a much richer understanding of the Agents of Change influencing each case of scientific change. Our hypotheses focus on selected episodes in which different factors had different relative importance, and we seek to analyze and understand the Agents of Change over time. All results will be part of the digital working environment of the Virtual Laboratory (VL) in collaboration with the Max Planck Institute for the History of Science in Berlin. We will archive research materials to be shared among different working teams, and will add scholarly interpretive essays and articles that will make up an on-line Resource Collection accessible to multiple users, in addition to traditional scholarly publications. With regards to Broader Impacts, this project has a several: (1) Working with a network of nearly 2 dozen collaborators in 6 countries and multiple disciplines, we will develop a true \"collaboratory.\" By sharing materials and research questions, we will ask new questions within each discipline and learn of research materials, questions, and interpretations across disciplines. (2) The VL tested digital working environment makes that research possible by making all research materials and scholarly interpretations available to all users at all times. (3) The research will allow us to demonstrating how Agents of Change affect this case of Embryo Research in its societal contexts, including interpretations of the emerging patterns shaping science and societal decisions. This should also inform future decisions processes and policy-making. (4) In the final stages, we will develop Educational Materials for multiple user groups. A Postdoctoral Fellow, Graduate Student, and Undergraduates will all be members of the research team, and each will be trained individually while helping to add to the accumulating community results.","title":"Understanding Agents of Scientific Change: the Case of Embryo Research","awardID":"0623176","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7318","name":"HSD - AGENTS OF CHANGE"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7603","name":"SCIENCE, TECH & SOCIETY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}}],"PIcoPI":["535906","430976","535907","413368","434023"],"PO":["563324"]},"119756":{"abstract":"Although the literature of the past 20 years on research ethics has focused increasingly on investigation and definition of research misconduct, little of that work has addressed how to teach emerging researchers - our graduate students - about responsible conduct and dissemination of research. Charges of research and publication misconduct abound in the media and in academia. Questions of what is right and what is wrong with respect to intellectual property become increasingly complicated, as the means of research and publication are multiplied every day by newfound digital capabilities. The confusion is compounded by ongoing debates over questions such as how do the rules of plagiarism or presentation of data differ between different fields; and how does the Internet change the boundaries of intellectual property. Some argue that the time has come for a complete re-examination of our notions of copyright and fair use. So it is no wonder that graduate students are unprepared for the challenges of academic research. In this project, the PIs will build upon the web-based framework recently developed for their successful Professional Responsibility Modules for Engineering (PRiME) project, which supports flexibile, appealing and engaging module delivery. In collaboration with experts and practitioners in the fields of engineering ethics and engineering education from UT Austin and three outside institutions (North Carolina State University, University of Washington, and Virginia Tech), the PIs will develop, assess, and disseminate a unified curricular package that prepares graduate engineering students for the ethical conflicts and dilemmas they are likely to face as academic and professional researchers in the conduct of research and in publication and dissemination of data. Ultimately, the project will result in four web-based learning modules: on falsification and fabrication of research, on plagiarism, on presentation of data, and on intellectual property. These modules can either be incorporated as discrete units into existing courses, or taught all together as a short course on Foundations of Research Ethics for Engineers. The modules will be specifically aimed at a graduate audience, and supported by an instructor's guide. They will foster a deeper understanding by graduate students and faculty of the complex ethical issues involved in research, and increase their ability to analyze, synthesize, and judge for themselves as such issues arise.<br\/><br\/>Broader Impacts: The project proposed will have significant and substantial impact on approaches to teaching research ethics in engineering at the graduate level by providing materials where currently there are few if any. Senior faculty will teach and disseminate the materials in several universities and begin the process of wider dissemination. Moreover, because many of the target audience of the proposed materials are preparing to enter careers in academia themselves, the project will have far-reaching impact. First of all, the curricular package will benefit all graduate students exposed to it. The increased awareness and understanding of research challenges are benefits those students will carry with them after they receive their graduate degrees. Those who become academic researchers and faculty themselves will carry that increased understanding to the next generation of students. As faculty, they too can avail themselves of the project's customizable educational materials when they introduce their students to research ethics.","title":"The Foundations of Research Ethics for Engineers: A Proposal to Develop a Curricular Package for Graduate Engineering Programs","awardID":"0629475","effectiveDate":"2007-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["328577",317670,317671],"PO":["564181"]},"119459":{"abstract":"Sanjit Seshia<br\/>University of California, Berkeley<br\/>Collaborative Research: CT T Towards Behavior-Based Malware Detection<br\/>0627734<br\/>Panel P060975<br\/><br\/>Abstract<br\/><br\/><br\/>Malware is code with malicious intent that can adversely affect the<br\/>host on which it executes or the network over which they are<br\/>transmitted. A malware detector classifies a program as malware or<br\/>benign. Malware writers continuously test the limitations of malware<br\/>detectors in an attempt to discover techniques to evade<br\/>detection. This leads to an arms race, where malware writers find new<br\/>ways to create malware that are undetected by commercial malware<br\/>detectors, and where researchers working on malware detection respond<br\/>by devising new detection techniques. Attackers create new malware<br\/>using two main approaches: program obfuscation and evolution. There is<br\/>strong evidence that malware writers are using obfuscation and<br\/>evolution because the number of new malware families is growing at a<br\/>much slower rate than the number of malware instances. For example,<br\/>according to Symantec threat reports, in the first half of 2005 there<br\/>were 10,866 new virus and worm variants but only 170 new families of<br\/>malware. This data also indicates that signature-based techniques for<br\/>malware detection will not be able to cope with the increase in the<br\/>number of malware instances. Recent results by one of the PIs also<br\/>suggests that current commercial malware detectors are not resilient<br\/>to obfuscation and evolution techniques used by malware writers. All<br\/>this evidence clearly suggests that we need a new approach to malware<br\/>detection.<br\/><br\/>We propose to explore behavior-based malware detection: our algorithm<br\/>focuses on detecting malicious behavior (such as mass-mailing behavior<br\/>used by certain worms) rather than searching for syntactic<br\/>patterns. We specify malicious behavior in a formal language and then<br\/>perform static analysis on the code to determine whether it contains<br\/>the specified behavior. Prior work by the investigators demonstrated<br\/>that this behavior-based malware detector can detect families of<br\/>malware using a single specification. However, there are challenges<br\/>that need to be addressed in the context of behavior-based malware<br\/>detection. We propose tasks to address these challenges. Solutions to<br\/>the proposed tasks will lead to malware detection techniques that will<br\/>resist evasion techniques used by malware writers better than existing<br\/>malware detectors. Behavior-based malware detectors can also detect<br\/>new malware that are variants of old malware..","title":"Collaborative Research: CT-T: Towards Behavior-Based Malware Detection","awardID":"0627734","effectiveDate":"2007-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["497138"],"PO":["497499"]},"119349":{"abstract":"0627085 Kazovksy<br\/><br\/>This project develops a hybrid optical and wireless access network, which combines advantages of both networks the high capacity provisioned by optical network, and the flexibility and cost-effectiveness provisioned by wireless mesh network. The network architecture consists of optical grid and wireless mesh networks for broadband access. The optical grid network provides broadband and efficient backhauling, enabled by reconfigurable optical grid nodes and hierarchical loop routing algorithms, so that the backhauling network is highly adaptive to real time traffic demand. The wireless mesh network, which penetrates into users' neighborhood, is designed to facilitate cost-effective, ubiquitous links in the last\/first hundreds of feet, and extend the wireless coverage without sacrificing system bandwidth. A hybrid optical\/wireless routing algorithm is developed and a high-performance RF over fiber in sub-carrier multiplex optical channels is built to improve the system performance. A novel reconfigurable grid node technology is developed for flexible and efficient traffic routing in the optical grid network. The research effort includes routing algorithm design, device design and implementation, optical and wireless subsystem design, and hybrid network testbed implementation and performance evaluation.<br\/><br\/>Broader Impact: The guiding principle of this project is to build a prototype broadband access network for anyone, anywhere, anytime and any media. By providing a cost-effective and ubiquitous broadband link to many end-users, this work could facilitate the way people communicate, interact and work. If successful, the hybrid optical\/wireless approach in this project could influence the way future access network are designed.","title":"NeTS-NBD: Grid Reconfigurable Optical and Wireless Network (GROW Net)","awardID":"0627085","effectiveDate":"2007-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["483588","168746"],"PO":["565090"]},"122451":{"abstract":"CAREER: Decentralized Control and Optimization Techniques for Autonomic Performance Management of Distributed Computing Systems<br\/><br\/>PI: Nagarajan Kandasamy, Drexel University, Philadelphia, PA 19104<br\/><br\/>Summary<br\/><br\/>To operate distributed computing systems effectively in an uncertain and dynamic environment, multiple performance-related parameters such as resource provisioning to applications, relative priority between applications, and application operational modes, must be dynamically tuned to match time-varying application requirements and operating conditions. To cope with their growing scale and complexity, these systems must become autonomic, i.e., capable of managing themselves given high-level objectives from administrators. This project aims to develop the theory and practice of designing autonomic computing systems. The specific research objectives are to: (1) Develop a decentralized framework, using concepts from model-predictive and optimal control, to manage large-scale computing systems; (2) Analyze the performance of the control algorithms in terms of stability and robustness properties; and (3) Validate the control techniques using trace-based simulations and actual implementations on a Blade-server cluster. The expected outcome of this project is a set of technologies to convert a significant number of system management tasks into systematic processes using proven control-theoretic techniques. This will reduce system operating costs while ensuring the smooth operation of applications supporting the business, science, and engineering communities. The obtained results will be disseminated to the research community via relevant journals and conferences, and software artifacts will be freely available via the project web site.<br\/><br\/>The educational plan seeks to: (1) Tutor high-school students in the computer sciences as part of a community-based educational support project in Chester, Pennsylvania; (2) Enhance undergraduate course offerings at Drexel University; and (3) Create a new graduate course on autonomic computing.","title":"CAREER: Decentralized Control and Optimization Techniques for Autonomic Performance Management of Distributed Computing Systems","awardID":"0643888","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["543564"],"PO":["535244"]},"122396":{"abstract":"CAREER: Making Computer Vision Successful in Scattering Media<br\/><br\/>PI: Srinivasa Narasimhan<br\/>Carnegie Mellon University<br\/><br\/>In recent years, computer vision has seen significant advances in the core areas of image sensing and interpretation. This success has resulted in great demand for vision techniques in application domains ranging from intelligent transportation and security to oceanography (underwater imaging), to astronomy (telescope and satellite imaging), to even biology and medical systems (microscopic and medical imaging). Unfortunately, there is one fundamental hurdle that can stop vision from having successful impact in these areas --- the assumption that light propagates in a transparent medium (pure air) without any alteration. Thus, today vision systems fail to perform in the presence of light scattering by a wide range of particulate media, such as bad weather (fog, mist, haze, snow, rain), murky water, smoke, dust, smog and biological tissue.<br\/><br\/>This research is devoted to making computer vision successful in scattering media. In computer vision, image formation has been defined as \"a geometric mapping from the 3D world to the 2D image\", which inherently leads to loss of information. The PI strongly argues that light scattering must not be viewed as \"noise\" that a traditional vision algorithm needs to overcome, but rather as a new form of \"encoding\" of light and hence, the images themselves. The key idea then is to derive a series of compact physically based analytic (or semi-analytic) models for light transport to represent image formation in scattering media. These models encode the \"lost third dimension\" back into images. The analytic forms of the models<br\/>--- though not as elaborate as the slow simulations in computational physics --- are accurate enough to model the aggregate scattering effects in images and thus make it possible to invert light transport. The inverse light transport methods will then be applied in conjunction with traditional vision algorithms to match their performances in clear air.<br\/><br\/>The results from this research will have broad and long-term impact across a wide variety of domains. The (semi-)automatic intelligent transportation systems that assist drivers in navigation will be able operate in common bad weather conditions such as fog, snow and rain, indeed when they are most required. Similarly, field robots will navigate better in hazardous environments such as smoke and dust. Underwater exploration, safety, and rescue tasks can be made possible in murky underwater conditions.<br\/>Understanding optical properties of tissues can assist doctors in medical diagnosis of tumors and cancers. Finally, the derived models can be used to also add realistic effects of scattering to imagery for digital entertainment (movies and video games), scientific education and training.<br\/><br\/>URL: http:\/\/www.cs.cmu.edu\/~srinivas\/CAREER\/","title":"CAREER: Making Computer Vision Successful in Scattering Media","awardID":"0643628","effectiveDate":"2007-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549608"],"PO":["564318"]},"124343":{"abstract":"HPCA is one of the top-tier conferences in the field of Computer Architecture. This year's<br\/>program has twenty-eight technical papers selected from 174 submissions (an acceptance rate of<br\/>16%). The conference addresses a broad spectrum of foundational concerns for computer<br\/>architecture and computer design including microarchitecture, cache and memory system design,<br\/>parallel computer architectures, power-efficient architectures, embedded and reconfigurable<br\/>architectures, I\/O systems, and performance evaluation.<br\/>This year's conference is also the host to eight workshops and three tutorials. Detailed<br\/>descriptions of the workshops, tutorials and the full technical program are available on the<br\/>conference web site, http:\/\/www.hpcaconf.org. The conference is sponsored by the IEEE<br\/>Computer Society's Technical Committee on Computer Architecture and is held annually. The<br\/>lead organizers for the 2007 conference include Professor Ahmed Louri of The University of<br\/>Arizona (general chair) and Mazin Yousif of Intel Corporation (co-general chair), and Professor<br\/>Trevor Mudge of The University of Michigan (program chair).","title":"Student Travel Grants for the 13th High Performance Computer Architecture Conference","awardID":"0653039","effectiveDate":"2007-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["559883"],"PO":["565272"]},"133099":{"abstract":"Abstract: CNS-0406345<br\/><br\/>Executive Summary:<br\/><br\/>The project will design and implement a pre-compiler and runtime system that will enable an existing parallel C or Fortran program, which uses MPI or OpenMp library calls for parallelism, to checkpoint and restore its computational state. Unlike the checkpoints taken by a system like Condor, the checkpoints produced by these system will be portable in the sense that they can be used to restart the application on another machine of a direrent processor type and conguration. The projects goal is to accomplish this with minimal impact on the performance and scalability of the application. The project will develop, whereas a complete system-level checkpoint for the same application on a large machine will need to save terabytes of data to disk. In a grid environment, the checkpoints taken by system-level checkpointing are not portable, so computations cannot migrate to take advantage of changing resource availability.<br\/><br\/>At present, programmers who wish to use application-level checkpointing must analyze and instrument their code manually. Our proposal system will automate this, requiring only minimal input from the programmer. Accomplishing this requires new checkpoint protocols for process coordination, some of which we have already developed and implemented. It also requires inter-procedural program analysis techniques and a sophisticated runtime system, which we will implement in this project. The approach we are taking requires expertise in high-performance computing, program analysis runtime system design, and distributed computing. We believe our project team can rise to the challenge.","title":"NGS: A System for Semi-Automatic Application-Level Checkpointing of Parallel Programs","awardID":"0739601","effectiveDate":"2007-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["556730"],"PO":["551712"]},"123177":{"abstract":"This project creates a new Research Experience for Undergraduates site focused on the areas of computer security and reliability engineering. A nationwide recruitment process led by the Women in Engineering program selects cohorts of undergraduate students to participate in a ten-week summer research program at the host institution. Particular emphasis is placed on recruitment of students from under-represented populations and from community colleges. The project includes mentorship by the experienced computer science faculty members, technical seminars and workshops, team building activities, student presentations, and other professional development opportunities.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. The students participate in a full range of research activities from preparing research literature to production and dissemination of research results.<br\/><br\/>The broader impacts of the project include providing a quality research experience for undergraduate students, particularly students from underrepresented groups and community college students. The participating faculty members are committed to engaging women and under-represented minority students in their research. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning. The project will also provide a better technically educated workforce to meet national security and economic priorities.","title":"REU Sites: Undergraduates Engaged in the Experimental Evaluation of Computer Security","awardID":"0647321","effectiveDate":"2007-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["441321","519631"],"PO":["564181"]},"126246":{"abstract":"The Doctoral Consortium at The Human Language Technology Conference -- North American chapter of the Association for Computational Linguistics annual meeting (NAACL HLT) 2007 is a forum wherein PhD students in their final years of research present and receive feedback on their research from a panel of experts in the field of human language technologies, including computational linguistics, speech processing, information retrieval, and other related areas.<br\/>Participants submit an application containing an overview of their research and are selected based on a blind evaluation process involving established researchers in the area. The participating students reflect the variety of research areas of the NAACL HLT conference and particularly include groups underrepresented in science and engineering.<br\/><br\/>Broader Impacts:<br\/><br\/>The event provides an opportunity for senior PhD students to discuss their research and career objectives with a panel of established researchers in their field. The event is also an opportunity for students to gain exposure for their work among the Human Language Technology research community, especially from professionals outside of their thesis committee. Students also attend professional development sessions and present their work to a broader audience during a poster session held during the main NAACL HLT conference. The event is primarily organized and run by students -- providing all the students involved with invaluable opportunities for professional growth and interaction with senior researchers on the organizing committee of the main conference.","title":"Doctoral Consortium at The Human Language Technology Conference - North American chapter of the Association for Computational Linguistics annual meeting (NAACL HLT) 2007.","awardID":"0707305","effectiveDate":"2007-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["511614"],"PO":["565215"]}}