{"49943":{"abstract":"","title":"ITR Preproposal Panels","awardID":"0001371","effectiveDate":"1999-12-20","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0500","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["130583"],"PO":["192509"]},"58642":{"abstract":"","title":"NSF Young Investigator: Testing Object-Oriented Programs","awardID":"0096321","effectiveDate":"1999-12-31","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["530729"],"PO":["150697"]},"36604":{"abstract":"9820955 Uzi Vishkin University of Maryland<br\/><br\/>The PI will work towards rapid compiler prototyping for the Explicit Multi-Threading (XMT) project at the University of Maryland. This target \"approximate\" compiler will correctly translate a high-level code into the assembly code for the XMT architecture; the performance of the assembly code is expected be within some small percentage from optimal. One graduate student will devote a full year to this effort. In a second project, the PI plans to design an on-chip interconnect for the memory system. This will explore several alternative ways for connecting the local registers in eash thread control unit (TCU) with the first level of the memory, which is to be interleaved; this is a demanding challenge as the interconnect needs to provide high bandwidth and low latency.<br\/>A second graduate student will devode a full year to this effort.","title":"Seeking Increased Impact for the Parallel Algorithmics Technology","awardID":"9820955","effectiveDate":"1999-12-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["508237"],"PO":["297837"]},"45089":{"abstract":"This work investigates distributed information processing over <br\/>networks involving interference, noise, feedback and congestion. <br\/><br\/>Also studied are distributed data compression, communication in networks,<br\/>distributed computation, and the role of feedback in communication networks.<br\/>Most of these problems are advanced by using an information theoretic point <br\/>of view. The principal tools involve information theory, communication <br\/>theory and quantum mechanics. <br\/><br\/>The interesting role of quantum phenomena in communication is <br\/>investigated by studying the role of quantum entanglement <br\/>in distributed communication and computation, as well <br\/>as energy bounds for computation, the physics of quantum memory and a <br\/>development of the understanding of the physics of information.","title":"Distributed Information Networks","awardID":"9973134","effectiveDate":"1999-12-15","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["321034"],"PO":["188393"]},"45339":{"abstract":"Modern IC's face many reliability problems and therefore online error detection mechanisms are necessary. Fault injection experiments are crucial in validating the correctness and in accessing the capability of these error handling or detecting designs. Prof. Lo is exploring the feasibility of using nanotechnology, specifically the nanofabrication of defects, in fault injection experiments. The faults are injected onto the silicon surfaces of commercial microprocessors\/microcontrollers and FPGAs using the atomic force microscope (AFM)\/scanning tunneling microscope (STM) with resolution down to hundreds of angstroms. The purpose is to create or at least emulate the effect of real-life run-time faults due to component aging, manufacture imperfections, electromigration and many others. Another goal of the project is to monitor the physical phenomena of the device under test. These include the power supply current level, thermal condition and electromagnetic activities. The proposed method is superior in that: (1) An accurate and repeatable fault injection experiment can be easily achieved; (2) The resolution of AFM\/STM ranges from tens of micrometers to hundreds of angstroms; and (3) No radioactive material is involved","title":"SGER: Hardware Fault Injection using Nano Technology","awardID":"9974038","effectiveDate":"1999-12-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[115160],"PO":["564898"]},"46246":{"abstract":"The PI will develop a cognitively plausible reinforcement learning (RL) architecture as a model of instrumental learning in animals and robots. Although RL was initially inspired by animal learning phenomena, the field has since developed mainly by addressing AI concerns. A major limitation of current RL architectures as cognitive theories is the representation of state space. Models that maintain explicit state representations (such as Q~tables) are limited to simple domains with only a few variables, while models that represent the state space implicitly (e.g., using a neural net function approximator) require large amounts of training data and unreasonably long training times compared to real animals. The PI's approach is to develop specialized representations of state space that are appropriate for modeling animal behavior and can support desired generalizations. The simulated animal's working memory will encode sensory stimuli, state change events, and the animal's own actions. An explicit state representation would encode the conjunction of all these variables, generating a combinatorial explosion. The proposed alternative approach is for the model to form conjunctions of selected variables, allowing it to incrementally expand its state description while focusing on just those dimensions that are relevant to the task being learned. Heuristics based on fast, single-layer neural net learning will be developed to select useful conjunctions as a function of recent experience. The PI also will investigate matching the current state of working memory with records of entire past states, or episodes, in order to predict reward. A flexible architecture will be developed for representing actions in a parameterized manner (so as to provide infinite variability), and with temporal duration (allowing stimuli and rewards to arrive in the midst of execution). Finally, there will be mechanisms for coping with failure of an action to execute successfully or to produce an expected reward; this will provide the basis for modeling phenomena such as effects of partial reinforcement schedules and increased behavioral variability during extinction. If successful, this work will advance the state of the art of reinforcement learning by introducing new techniques for handling complex state and action spaces. This has important implications for theories of animal cognition, for robots that learn by exploration and experimentation, and for robots intended to learn from human teachers.","title":"Memory-Based Operant Learning","awardID":"9978403","effectiveDate":"1999-12-15","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["502937"],"PO":["491702"]},"69326":{"abstract":"","title":"Scalable Program-Analysis-Based Testing and Maintenance: Infrastructure and Experimentation","awardID":"0196145","effectiveDate":"1999-12-31","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["530729","485900",179485,"548132"],"PO":[179487]},"46638":{"abstract":"9980440<br\/>Wu<br\/>This grant supports theoretical research on the statistical mechanics of lattice models. It is supported by the Divisions of Materials Research and Mathematical Sciences. Lattice models play an essential role in the modern theory of critical phenomena, which finds wide applications in physics, materials research and other disciplines including engineering and mathematics. This research involves theoretical studies of lattice models with emphases on exact and rigorous results and their applications.<br\/><br\/>Exact analyses of lattice models have been restricted in the past mostly to systems in two dimensions. This project proposes to study 3-dimensional systems relevant to real physics. The study of a directed percolation model in three dimensions will also be conducted. In addition, investigation of 2-dimensional systems will be carried out including: the Ising model; dimer statistics; Fisher zeroes of the Potts model; quantum spin systems; applications to crystal surfaces; and, applications in mathematics.<br\/>%%%<br\/>This grant supports theoretical research on the statistical mechanics of lattice models. It is supported by the Divisions of Materials Research and Mathematical Sciences. Lattice models play an essential role in the modern theory of critical phenomena, which finds wide applications in physics, materials research and other disciplines including engineering and mathematics. This research involves theoretical studies of lattice models with emphases on exact and rigorous results and their applications.<br\/>***","title":"Lattice Models and Applications","awardID":"9980440","effectiveDate":"1999-12-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1287","name":"MATHEMATICAL PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1267","name":"TOPOLOGY"}}],"PIcoPI":["53576"],"PO":["145396"]}}