{"47581":{"abstract":"Geometric problems arise in numerous application areas such as computer<br\/>graphics, geographic information systems (GISs), spatial database systems,<br\/>computer aided design, robotics, physics, and meteorology. The field of<br\/>computational geometry is largely motivated by this fact. In the last<br\/>twenty years impressive progress has been made in the field. However, even<br\/>though computational geometry is now a rich and mature discipline, the<br\/>algorithms and techniques developed in the field have had too little<br\/>practical impact in application areas. One reason for this disparity is<br\/>that the goal of traditional algorithms design has been to optimize<br\/>internal memory computation time (CPU efficiency). However, many geometric<br\/>applications frequently involve massive amounts of data. Often the datasets<br\/>are too large to fit in main memory and must reside on disk, and<br\/>communication between internal and external memory, and not actual<br\/>computation time, is the bottleneck in the computation. This effect arises<br\/>from the huge difference in access time of fast internal memory and slower<br\/>external memory such as disks.<br\/><br\/>This project contains a challenging career development plan focusing on<br\/>Input\/Output-efficient (or I\/O-efficient) computational geometry<br\/>algorithms. Key components of the plan are the rich and important<br\/>possibilities for interplay between theory and practice in the area, as<br\/>well as the exciting possibilities the area gives for interdisciplinary<br\/>collaboration and for bringing research into the classroom. Theoretical<br\/>work will concentrate on developing I\/O-efficient algorithms and data<br\/>structures for geometric problems. A main goal is to develop simple and<br\/>practically efficient algorithms, and in order to do so, theoretically<br\/>developed algorithms will be implemented and tested using real-life<br\/>data. In this work, focus will be on problems with direct practical<br\/>applications and on collaboration with researchers in other areas of<br\/>computer science, as well as with researchers in application areas. A key<br\/>objective of the career plan is for the PI to obtain a certain level of<br\/>expertise in select application areas and to build up a ``track record'' in<br\/>these areas. Curriculum development is also an integrated part of the plan.<br\/>Work will be done on incorporating I\/O-efficiency into the curriculum of<br\/>undergraduate and graduate algorithms classes, and new classes, as well as<br\/>educational material, will be developed.<br\/><br\/>Altogether, the outcome of the project will not only be theoretical<br\/>advances in I\/O-efficient geometric algorithms, but also the development<br\/>and implementation of practical efficient algorithms as well as curricular<br\/>innovations. At the same time the project will build a strong foundation<br\/>for the PIs continued work in research and education.","title":"CAREER: I\/O-Efficient Geometric Algorithms","awardID":"9984099","effectiveDate":"2000-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["172543"],"PO":["321058"]},"47185":{"abstract":"Computing ion permeation through channels directly from atomically detailed models is far from trivial due to the time scale limitation of the popular Molecular Dynamics approach. The goal of this work is to use an atomically detailed model of the channel to compute its function. A novel computational method, based on a stochastic path formulation, will be used to study the channel kinetics on relevant biological time scales. <br\/>The new technique extends time scales of simulations by many orders of magnitude. A novel kinetic cycle that provides an easier sampling procedure to compute differences in the weights of trajectories (and relative rates as a function of different voltages, different ions, mutations, etc.) will be employed.<br\/><br\/>Interiors of cells are separated from the rest of the world by membranes that prevent uncontrolled entries and exits of solvated molecules. Channels (protein molecules that are embedded in the membrane) enable selective permeation that is essential for the survival of the cell. The goal of this research is to study ion transport through a channel, using a novel computational technique that was developed recently. This new technique makes it possible to compute atomically detailed trajectories of ion transport at relevant time scales. Computing the experimental observables, with a direct link to biological function, will open new opportunities for synergy of theory and experiment and will further advance quantitative knowledge of structure-function relationship in ion channels. <br\/><br\/>This project is supported by the Molecular Biophysics and Signal Transduction Programs in the Division of Molecular and Cellular Biosciences in the Directorate for Biological Sciences and the Computational Mathematics Program in the Division of Mathematical Sciences in the Mathematical and Physical Sciences Directorate.","title":"Kinetics of Ion Channels by Atomically Detailed Computer Simulations","awardID":"9982524","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1114","name":"Cellular Processes"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1136","name":"SIGNAL TRANSDCTN\/CELL REGULATN"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1144","name":"Biomolecular Dynam,Struc,Func"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1164","name":"MOLECULAR BIOPHYSICS"}}],"PIcoPI":["517321"],"PO":["564395"]},"47791":{"abstract":"This is the first year of fimding of a 4-year continuing award. The P1 will investigate the perceptual<br\/>dimensionality associated with an interface, with the goal of exploring the possibility that a new approach<br\/>based on psychophysical experimentation will allow herto overcome the crucial limitation of the traditional<br\/>method of multidimensional scaling (MDS) that it cannot deal with the situation where the dimensionality of<br\/>the perceptual space exceeds that of the physical space. The information transmission capabilities of several<br\/>human-machine interfaces will also be assessed, with the goal of developing an efficient paradigm for<br\/>obtaining reliable estimates of information transfer. Work on these two issues will be performed in the context of a commercially available force-feedback display, a new haptic directional display, and a novel sensing chair. By working on these interfaces with very different sensor and actuator technologies, the P1 hopes to develop a general information-based framework with applications to other areas of <br\/>HC1. The new information-based framework will be integrated in several ways into the graduate and <br\/>undergraduate curriculum and research projects, including hands-on research opportunities for undergraduate students wherein they practice their leadership skills through technical excellence and mentoring of K-12 school children; these activities will be conducted in part in collaboration with NASA through involvement in its Reduced-Gravity Student Flight Opportunities Program (colloquially known as the \"vomit-comet\").","title":"CAREER: A Human-Centered Approach to Haptic Human-Machine Interface Research","awardID":"9984991","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["464438"],"PO":["565227"]},"47890":{"abstract":"This is the first year funding of a four-year continuing award. The goal of this CAREER project is to develop the theoretical framework, algorithms, and computational tools for improved data representation, analysis, and visualization. To that end, we propose to develop data-adaptive algorithms for both low-level signal processing tasks (e.g., interpolation) and high-level data interrogation tasks. For the high-level tasks, we propose to develop hybrid representations for volumetric data (multiresolution volumetric deformable models) that will be useful for both detection and simulation. The proposed representations and algorithms will be tested on 3D MR data (breast cancer detection and surgery planning) and seismic data (detection of sequence stratigraphy derived objects). The educational component seeks to address some important challenges in the effective teaching and training of students in the Visual Computing field. In particular, the educational goals of this CAREER plan are the following: (1) to promote an interdisciplinary Visual Computing education at the University of Houston by fostering cross-departmental teaching activities, (ii) to provide a practitioner's perspective in Visual Computing education and to address \"real-world\" problems in the Visual Computing Curriculum, and (iv) to attract incoming students into Visual Computing and to motivate high-school students towards the sciences. A project on a prototype minimal invasive heart surgery simulator will be used as a demonstration paradigm for the interdisciplinary teaching of Visual Computing. Domain expertise and domain data will be provided through close collaborations with the M.D. Anderson Cancer Center and Veritas Exploration Services.","title":"CAREER: An Integrated Framework for Data-Adaptive Representations and Algorithms in Visual Computing","awardID":"9985482","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["554348"],"PO":["234178"]},"47694":{"abstract":"The objective of this research is to conduct a study of wavelet<br\/>representations for complex surfaces and volumes with the goal of<br\/>demonstrating their potential for 3D scientific and engineering computing<br\/>applications. Multiresolution techniques recently described in the computer<br\/>graphics literature will be extended to develop high performance algorithms<br\/>and implementations for simulating the partial differential equations of<br\/>common physical processes on general three-dimensional domains, including<br\/>potential problems, scattering problems and problems in elasticity.<br\/>Emphasis is placed on unifying the mathematical analysis and<br\/>signal-processing perspectives of wavelets, as this provides new insights<br\/>for the large-scale simulation of a wide range of problems.<br\/><br\/>The research consists of two interrelated thrusts. The first develops the<br\/>mathematical foundations, including surface and volume wavelet constructions<br\/>for PDEs, practical discretization strategies for linear and nonlinear PDEs,<br\/>matrix compression, preconditioner design, adaptive refinement, accuracy<br\/>estimates and error control strategies. The second thrust focuses on the<br\/>practical issues of algorithm and data structure design, robust<br\/>implementation for large-scale problems involving complex geometry,<br\/>parallelization, and the interpretation and visualization of output aided by<br\/>the multiresolution representation. This will result in a suite of<br\/>multiresolution techniques and tools that provide (i) researchers with a<br\/>context for conducting domain-specific studies (ii) engineers with<br\/>application libraries for simulating large-scale real world problems and<br\/>(iii) students and professionals with an environment for learning about<br\/>wavelet theory and applications.<br\/><br\/>The educational objectives of this project are closely linked to the<br\/>research program. The continuing development of a course on wavelets and<br\/>filter banks will enable the dissemination of fundamental knowledge on<br\/>multiresolution techniques and it will serve as a conduit for the<br\/>integration of research experience into the curriculum. Additional courses<br\/>are oriented toward issues of computation and information technology more<br\/>generally within the graduate and undergraduate engineering curriculum. The<br\/>integration of educational and research activities will be facilitated by<br\/>seminars, short courses, and new and continuing collaborations with industry<br\/>and other institutions.","title":"CAREER: Wavelet Theory and Applications in 3D Physical Simulation","awardID":"9984619","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[121982],"PO":["532791"]},"47684":{"abstract":"With the continued scaling of VLSI technologies, interconnects play a dominant role in determining system performance, power, reliability, and cost. To ensure timing closure of designs, impacts of interconnects must be considered at every design stage. This research is directed at developing an interconnect-centric design methodology that emphasizes interconnect planning and synthesis during physical design flow. Research activities being carried out under this grant include: (a) Developing routability-driven repeater planning algorithms for the optimization of multiple global nets during floorplanning and placement; (b) Developing novel layout synthesis techniques -- topology construction, wire-sizing\/splitting and spacing, and repeater insertion -- for the optimization of interconnect delay and signal integrity of on-chip RLC interconnects; (c) Developing global routing algorithms that perform simultaneously the routing of multiple nets and the synthesis of dedicated current return paths; (d) Developing reliable clock synthesis techniques that minimize the risk of current induced noise associated with the switching activities of circuits.","title":"Career: Interconnect Planning and Synthesis of Physical Layout for Deep Submicron VLSI Design","awardID":"9984553","effectiveDate":"2000-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["475378"],"PO":["562984"]},"50093":{"abstract":"0001796<br\/>Fredkin, Edward<br\/>Carnegie Mellon University<br\/><br\/>SGER: The Digital Perspective Project<br\/><br\/>The Digital Perspective Project is an attempt to use discrete models for a wide variety of physical phenomena. In contrast to continuous analytic models, such as differential equations, discrete models offer understanding of phenomena that are discrete, or quantized at the microscopic level. These phenomena include electric charge, light, genetics, and some mechanical phenomena such as vibration. Early work in this field has shown that purely digital models such as cellular automata can conserve the digital values of physical quantities exactly.<br\/><br\/>The work to be done under this project combines a seminar at Carnegie Mellon University with a series of public lectures. Researchers from around the world who have made contributions to discrete models in several areas will participate in both activities. Distinguished Lectures will be presented in both Pittsburgh and Washington, and will be made available on the World Wide Web. The seminar and lectures will provide a spur for the further development of discrete models of physical phenomena.","title":"The Digital Perspective Project","awardID":"0001796","effectiveDate":"2000-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["254137"],"PO":["557609"]},"43251":{"abstract":"EIA -9912218<br\/> Manoj, Franklin<br\/> Shuvra Shikhar, Bhattacharyya<br\/>University of Maryland, College Park<br\/><br\/>Research Experiences for Undergraduates: REU CRISP (Computer Research Internship Scholastic Program)<br\/><br\/> The Computer Research Intership Scholarstic Program (CRISP) incorporates research projects in the following areas of research: Computer Architecture, Embedded Systesm, Software Engineering, Real-time Systems, VLSI Design, CAD for VLSI, LowPower Design, and Optimizing Compilers. In addition to work in the lab, students participate in weekly meetings that include technical presentations from leaders in computers and visits to local companies. These activities are done jointly with two other undergraduate research programs currently undertaken by the department under the MERIT (Maryland Engineering Research Intership Teams) pogram. The professional d development activities consist of seminars\/workshops on technical writing, oral communcations, graduate educations, academic careers, industrial careers, and professional ethics. At the end of the summer, representatives from indsutry serve as judges for the MERIT fair where students from the CRISP program and other similar research experience programs present the results of their research and compete against each other for the best project award.","title":"REU: REU CRISP (Computer Research Internship Scholastic Program)","awardID":"9912218","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["225924","539717"],"PO":["564181"]},"58553":{"abstract":"","title":"CAREER: Key Problems in Wireless Communications","awardID":"0096227","effectiveDate":"2000-04-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["549356"],"PO":[150411]},"47564":{"abstract":"PI: Prashant Shenoy<br\/><br\/>The rapid growth of the Internet coupled with advances in computing<br\/>and communication technologies has led to the emergence of a variety<br\/>of distributed multimedia applications. Realizing such applications<br\/>requires the development of large-scale information servers that can<br\/>efficiently manage heterogeneity in data characteristics and<br\/>application requirements. The main objective of the proposed research<br\/>is to develop scalable, high-performance information servers to enable<br\/>Internet-based multimedia applications and utilize the results of this<br\/>research to enhance the effectiveness of imparting education.<br\/><br\/>The proposed research will address three key issues: (i) the design of<br\/>a scalable, general-purpose multimedia file system based on<br\/>network-attached storage, (ii) the design of a coordinated resource<br\/>management framework for efficiently managing resources on large<br\/>servers, and (iii) the design of a multimedia proxy cache architecture<br\/>for efficiently delivering data to applications over wide area<br\/>networks. The research methodology for addressing these problems is<br\/>eclectic, relying on a combination of analysis, simulation, and<br\/>prototype implementation.<br\/><br\/>The proposed teaching efforts will focus on the development of a<br\/>curriculum in multimedia systems and the use of multimedia technology<br\/>to improve the effectiveness of distance and classroom education. The<br\/>proposed effort will: (i) lead to development of hands-on,<br\/>laboratory-based graduate and undergraduate courses in multimedia, and<br\/>(ii) explore the use of multimedia technology to develop more<br\/>effective pedagogical aids.","title":"CAREER: Scalable High-Performance Information Servers for Internet-based Multimedia Applications","awardID":"9984030","effectiveDate":"2000-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["558563"],"PO":["309350"]},"47630":{"abstract":"This research studies asynchronous computer architecture as a means to tackle three major challenges facing modern computer architects: power dissipation in high-performance architectures, correctness on first silicon, and system integration. The project addresses the following issues: (a) the development of a framework for the optimization of power and performance in asynchronous designs; (b) the design of asynchronous architectural components having varied power\/performance characteristics; (c) the design of tools that analyze asynchronous systems for their ease of pipelining in support of the formal synthesis approach to asynchronous design; and (d) the extension of the asynchronous formal synthesis methodology to heterogeneous systems.","title":"CAREER: Asynchronous Computer Architecture","awardID":"9984299","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["475375"],"PO":["562984"]},"47652":{"abstract":"This project will develop a new class of robust and parallelizable<br\/>preconditioners for the solution of sparse linear systems arising from<br\/>partial differential equations. The approach is based on a hierarchical<br\/>decomposition of the matrices associated with the linear system, and is<br\/>designed to improve the effectiveness of the preconditioner without<br\/>compromising the parallelism inherent in the computation. A formal<br\/>methodology will be developed for construction, application, and<br\/>analysis of these preconditioners. Effectiveness of these techniques<br\/>will be tested on problems in incompressible fluid simulations. Parallel<br\/>implementations of these preconditioners will be developed and their<br\/>performance evaluated for various multiprocessor platforms. Parallel<br\/>libraries will also be developed and made available to others via the<br\/>internet. As part of the educational plan innovative techniques will be<br\/>employed for curriculum development in computational science and<br\/>engineering, and university wide workshops and seminars will be<br\/>organized for the research community.","title":"CAREER: Robust Preconditioners for Sparse Linear Systems","awardID":"9984400","effectiveDate":"2000-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["258835"],"PO":["321058"]},"48665":{"abstract":"An ever-increasing segment of the population suffers from low vision resulting from complications of disease and old age. Surveys conducted by one of the Co-PIs as part of a previous project have determined, that the key information which is not available to people with low vision is textual information, usually of a directive or warning nature. For example, shopping in a large department store in a mall might involve looking for signs indicating where the store is, reading aisle signs in the store, and looking at product names, at labels and prices. This research will develop a \"seeing-eye\" computer to help people with low vision to observe and receive such information, so that they can participate more efficiently and comfortably in every day activities, and thereby lead more fulfilling and productive lives. The system will be composed of a digital video camera, computer, user interface, and speech or magnified visual output that can detect textual information in the environment, understand it using OCR, and provide it to the user who either has low vision or is blind. To achieve these goals, the PIs will in collaboration with colleagues at Johns Hopkins University build, over the first six months and then over the first two years, prototype systems using mostly existing technology and extensions to vision algorithms we have developed for identification of text regions in images and OCR, which can be evaluated on volunteer patients at the Wilmer Ophthalmological Institute and the National Federation for the Blind.. The functionality and range of applicability of our prototypes will necessarily be limited. Simultaneously, the PIs will work on long-term research problems that must be addressed to develop next generation seeing-eye computers with greater scalability and capability. In year three patient-volunteers at Wilmer and at the NFB will perform evaluations of the developed prototypes Subsequently, successful results will be commercialized and brought to the larger patient body (as have previous developments at Wilmer). Fundamental research problems to be addressed include: real-time algorithms for detection and rectification of text on planes and cylinders subject to perspective distortions; OCR from digital video, and OCR for text on textured backgrounds; and more robust and efficient algorithms and systems for stabilization and super-resolution of text blocks from video streams.","title":"Textual Information Access for the Visually Impaired","awardID":"9987944","effectiveDate":"2000-04-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["564721","532931",124572],"PO":["565227"]},"48940":{"abstract":"Graphical models have become a unifying focus for interdisciplinary research in the areas of probabilistic inference, learning and decision-making. Referred to in various settings as Bayesian networks, Markov random fields, influence diagrams, decision networks, or structured stochastic systems, the graphical model formalism is general enough to encompass a wide variety of classical probabilistic systems in AI and engineering, while providing a firm mathematical foundation on which to design new systems. This research will focus on approximation algorithms for large-scale problems to provide a significantly deeper empirical and theoretical understanding of graphical models. The approach will be based on probability propagation, variational and Monte Carlo methods for inference, learning and decision-making, the aim being to understand the kinds of graphical models for which these methods are appropriate. The PI will extend the scope of approximation methodology to include hybrid graphical models and decision networks, and to provide theoretical convergence analyses and error analyses for them. He will also test out the new methods empirically on standard benchmarks and in a variety of application areas. The ultimate goal of the research is to establish probabilistic graphical models as a full-fledged engineering discipline capable of providing robust, systematic solutions to large-scale problems in inference, learning and decision-making. A successful approximation methodology for graphical models would allow an engineer to design a graphical solution to meet performance specifications for a given problem, where these specifications are given in terms of time \/ accuracy tradeoffs and estimation \/ approximation tradeoffs. Even partial progress towards these goals will have wide impact in fields where large-scale probabilistic systems are used, including information retrieval, medical diagnosis, biological sequence analysis, source and error-control coding, speech recognition, and machine vision","title":"Approximation Methods for Inference, Learning and Decision-Making","awardID":"9988642","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["497161"],"PO":["491702"]},"47676":{"abstract":"The proposed research will focus on three partly related<br\/>directions in multiresolution methods: (I) subdivision schemes<br\/>and wavelets in the geometric setting, (II) the advantage of redundant<br\/>systems and (III) ideal data representation in higher dimensions.<br\/><br\/>Subdivision and multiresolution methods in the geometric setting<br\/>is a recently launched research area.<br\/>Prompted by the extremely high interests in applications such as terrain<br\/>modeling and 3-D scanning technology, this research direction has attracted<br\/>the attention of both computer scientists and applied mathematicians.<br\/>Existing subdivision schemes for surface generation do not promise<br\/>well-defined curvature everywhere in a resulted surface. In various<br\/>applications it is desirable to work with curvature smooth surfaces.<br\/>In the regular setting the proposer recently constructed a family of<br\/>C^2 subdivision schemes with a small interpolating stencil.<br\/>Underlying this construction is a variety of tools from optimization,<br\/>wavelet theory and multivairate interpolation theory. This project will<br\/>further refine these tools in order to resolve the original open problem<br\/>and such that these tools can be applied to other settings as well.<br\/><br\/>For various applications in image reconstruction\/processing, it<br\/>was found that highly redundant wavelet-like image representations<br\/>significantly outperform the standard non-redundant orthogonal<br\/>wavelet transforms used ubiquitously in the image coding<br\/>community. On the one hand, there is currently no complete theory<br\/>for explaining the fundamental advantages of redundancy. On the<br\/>other hand, researchers have just started to realize the<br\/>fundamental limits of wavelet transforms in higher dimensions and<br\/>have proposed a wide variety of novel data representation schemes<br\/>that address these fundamental limits. Research activity<br\/>under this project seeks to develop mathematical theory and<br\/>computational tools in the general area of adaptive methods of<br\/>representing and analyzing images and other multidimensional data.<br\/><br\/>The educational plan proposes a new way of teaching<br\/>computational science. The project<br\/>will develop teaching materials for our numerical computing courses<br\/>that better suit the needs, interests and mathematical ability<br\/>of computer science students. The goal of<br\/>this project is to develop a set of<br\/>electronic lecture notes for our future senior numerical computing<br\/>course. These lecture notes will add two new dimensions to any of<br\/>the existing textbooks: (i) An interactive computational<br\/>environment (based on QPE's such as Matlab or Octave)<br\/>will be integrated into the notes so that a student can easily reproduce<br\/>any computational result presented and derive any new<br\/>computational experiments. (ii) Applications<br\/>areas such as computer graphics, computer vision, data-mining and<br\/>computational fluid dynamics will be<br\/>used in various places of<br\/>this notes to illustrate the role of numerical methods in industry.","title":"CAREER: Subdivision Schemes and Wavelets: New Tools, New Settings","awardID":"9984501","effectiveDate":"2000-04-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485505"],"PO":["321058"]},"47698":{"abstract":"The growing use of both microprocessors and FPGAs to implement digital systems illustrates the trend towards programmable, commodity hardware and product differentiation through software. Unfortunately, FPGAs lack the abstract model that makes software design practical, and microprocessor architectures lack spatial relationships between operators that are essential to performance in interconnect-dominated technology. This project is developing abstractions that hardware designers can use to make their designs portable and scalable into deep-submicron processes. In addition, this project is exploring how these abstractions can be leveraged within a standard processor architecture to exploit the massive parallelism of media-centric computing. The goals of this project are to: (1) develop hardware virtualization techniques that apply to a broader class of applications than the strict hardware pipelines supported by PipeRench, (2) improve the scalability of these programmable architectures by localizing interconnect without sacrificing \"compile-ability\" or performance, and to (3) understand how these techniques can be leveraged within the context of a standard microprocessor.","title":"CAREER: Scalable Reconfigurable Computing","awardID":"9984630","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["194169"],"PO":["562984"]},"47720":{"abstract":"This award supports the study of computational principles and neural mechanisms underlying active perception -- the active gathering of information to construct, update and improve a system's representation,knowledge and understanding of its environment. The PI will develop an integrated multidisciplinary research and educational program that utilizes techniques from computer and information science, system engineering, neuroscience and psychology to study how monkeys and humans use eye movement to actively analyze visual scenes in different visual tasks and how the neural machinery and representations are transformed in these processes. To prove the theoretical framework he is developing, he will build an adaptive active vision system that will learn to see. Along with the research, he will enhance the traditional computer science and computer vision curriculum at Carnegie Mellon by introducing problems,theories and practice from neuroscience and neural computation to computer science classrooms and laboratories to prepare a new generation of interdiscciplinary computer scientists for the new challenges in computational biology.","title":"CAREER: Computational Representations and Processes in Active Perception","awardID":"9984706","effectiveDate":"2000-04-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}}],"PIcoPI":["550942"],"PO":["234178"]},"47841":{"abstract":"9985229<br\/>Van Roy<br\/><br\/>This proposed research is devoted to the development of streamlined and reliable computational methods for value function approximation. A successful outcome would be approximation algorithms that are widely-accessible and effective in the control of complex systems.<br\/><br\/>Proposed approximation methods build on work in the area of neuro-dynamic programming which is sometimes called \"Approximate Dynamic Programming\" or \"Reinforcement Learning.\" Algorithms that will be developed are based on approximate value iteration, temporal-difference, learning, and linear programming. A method for \"feature selection\" involving the use of value functions associated with simplified problems will also be explored.<br\/><br\/>To promote a pragmatic view of methods under development, and to provide a testbed for evaluation of ideas, two applications have been chosen to play integral roles in the project: dynamic risk management and the control of multiclass queuing networks.<br\/><br\/>The educational component of this project includes a new graduate level course on neurodynamic programming together with a realignment of current courses to incorporate a greater emphasis on computation, to foster an appreciation for the use of approximations when system become more complex, and to promote a unified view of stochastic control problems across many disciplines.<br\/>***","title":"CAREER: Value Function Approximation for Control of Complex Systems","awardID":"9985229","effectiveDate":"2000-04-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V050","name":"NSA-WORLD RENOWNED EXPERTS FRO"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["440832"],"PO":["563109"]},"47863":{"abstract":"CCR-9985332<br\/>Dan Wallach<br\/>Rice Univ.<br\/><br\/>Abstract <br\/><br\/>Type-safe language runtime systems are being used as mechanisms for evaluating untrusted computations within a wide range of applications from Web browsers and proxy servers to databases and agent systems. Most current language-based systems have insufficient resource controls for aggregate use of memory, CPU, network bandwidth, and so<br\/>forth. This research aims to implement resource management support within language-based systems, allowing for widespread use of a promising new technology. This research will design and implement language runtime mechanisms within a commercial Java system to accurately and efficiently account for memory and CPU use, and to allow for safe termination of a computation. These mechanisms will be<br\/>supported by rigorous mathematical models allowing their security and efficiency to be formally studied, and their applicability to extend to a wide class of language-based systems. Educational activities at Rice University will be integrated with this research, building on topics across the traditional computer science curriculum. Course developments will teach techniques for building secure systems, emphasizing both formal methods and practical software engineering techniques with an understanding of how hackers work in practice. Additionally, community outreach will work to dispel common misconceptions about computer security through the popular press and various speaking engagements.","title":"CAREER: Security and Resource Management in Type-safe Language Environments","awardID":"9985332","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["548177"],"PO":["564388"]},"47654":{"abstract":"There have been substantial developments in computational methods<br\/>and capabilities for material sciences applications. These include<br\/>the theory and practice of material point methods (MPM), multiple<br\/>temporal and spatial scale methods, domain decomposition methods,<br\/>together with increases in memory capacities, processing rates, and<br\/>software capabilities for distributed computing. We will develop<br\/>and combine these methods and capabilities in a Multi-Level<br\/>Multi-Material Problem Solver Environment (MLMM PSE). The MLMM PSE<br\/>will target applications such as crack propagation, granular materials,<br\/>impact problems, fragmentation, damages among others. We will<br\/>demonstrate the PSE for a novel and important engineering application<br\/>in semisolid materials.<br\/>The complexity inherent in this combination demands a computational<br\/>framework that provides broad-based infrastructure. As a<br\/>{\\it computational aim} of this project we will construct this<br\/>infrastructure in the MLMM PSE for material sciences applications.<br\/>We will create effective computational modules and interfaces that<br\/>will be necessary to build the MLMM PSE. These modules will be<br\/>integrated with parallel AMR and nonlinear solvers libraries, which<br\/>will facilitate code development, efficiency, load balancing and<br\/>portability on a variety of parallel platforms and will support<br\/>visualization capabilities. As a {\\it theoretical aim}, we will design,<br\/>analyze, and develop innovative numerical methods to enhance accuracy,<br\/>efficiency, scalability and robustness of the MLMM PSE. We will<br\/>investigate hierarchical simulation involving explicit and implicit<br\/>time dependent adaptive grid and particle refinement. This important<br\/>and novel area presents considerable mathematical and computational<br\/>challenges. As an {\\it educational aim}, we will develop with<br\/>undergraduate students web-based MLMM PSE courseware that illustrates<br\/>the computational solution of problems that have arisen in our research.","title":"CAREER: Multi-Level Multi-Material Problem Solver Environment with Semisolid Material Applications and Education","awardID":"9984404","effectiveDate":"2000-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["557365"],"PO":["321058"]},"47896":{"abstract":"This research aims at developing efficient techniques for modeling and simulation of complex systems-on-a-chip with millions of transistors, which contain mixed analog and digital circuits, even mixed-technology devices (microelectromechnical, optical, microfluid, etc). The focus is to explore behavioral modeling, simple-yet-accurate mathematical modeling, of a circuit in terms of its behavior. A systematic method based on symbolic network analysis is being developed to generate behavioral models from a circuit netlist. Application of traditional symbolic network analysis to large circuits is hindered by the exponential growth of the number of product terms with the size of a circuit, a problem known as term explosion. This project addresses the term problem by exploring determinant decision diagram (DDD) technology. To generate efficient simulatable code, this project explores compilation techniques to compile behavioral models and to select models of right complexity. A new paradigm for parallel and distributed simulation is being developed to exploit the maximum currency and latency in mixed analog\/digital and mixed-technology systems.","title":"CAREER: Behavioral Modeling and Simulation of Mixed-Signal\/Mixed-Technology VLSI Systems: An Integrated Research and Education Program","awardID":"9985507","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["182786"],"PO":["562984"]},"47479":{"abstract":"The gap between the processor and memory speeds is a major bottleneck in today's computer systems. Increasing DRAM bandwidth and reducing access time are keys to solving the memory latency problem. There is a relative dearth of architecture studies on DRAM devices and systems; there are therefore many fundamental questions representing open research in the field. This project investigates into the effects of various techniques in designing a DRAM system. Examples include supporting concurrent accesses and determining the extent to which modern CPUs can exploit such support; the effect of multiple channels and whether they be ganged together to increase bandwidth or should they operate independently; and the effect of banking and its optimal degree for DSP and embedded applications. For burst-mode DRAMs, the optimal burst size to accommodate both concurrency and fast end-to-end latency is analyzed in this project. The tradeoffs between the degrees of banking and interleaving, and between bus width and bus speed in power, performance, and cost are also analyzed. The educational plan involves developing a course on memory-systems design and optimization.","title":"CAREER: Architecture Issues in DRAM Devices and Systems","awardID":"9983618","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["283200"],"PO":["180163"]},"47579":{"abstract":"This is the first year of funding of a 4 year continuing award. This project will investigate new approaches to the classification, analysis, and resynthesis of sound. The research plan is composed of three elements: The majority of the effort will focus on the development of algorithms and techniques for sound parameterization and synthesis. The PI will explore ways to sort and match sounds with algorithms, voice algorithm parameters, and test human subjects to determine success of synthesis. He will develop classification and analysis software to automate existing algorithms, eliminating the human guidance andjudgment currently required. He will develop new algorithms for classes of sounds that do not yield to existing parametric synthesis algorithms. He will also work on novel interfaces for controlling sound, and create systems that can take advantage of flexible sound synthesis and control. By the end of the project, machine algorithms will have been developed that can take certain (large) classes of sounds as input, select the appropriate synthesis algorithm, extract parameters for resynthesis, and predict human responses as to the quality of the synthesized sound; simple systems will have been constructed which demonstrate the utility of the synthesis algorithms. This research will yield new tools at both the input and output ends of the interactive sound chain to benefit diverse applications such as portable computers, virtual reality, augmented reality, awareness systems, teleconferencing and remote collaboration applications.","title":"CAREER: Parametric Synthesis and Control of Sound for the Computer Mediated Experience","awardID":"9984087","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["497799"],"PO":["565227"]},"36613":{"abstract":"Graphs model many specific structures, including transportation networks, roads, rails, and flight-paths, computer networks, and VLSI circuits. Although graphs are very general, they have a great deal of structure that makes it possible to solve graph optimization problems more efficiently than less-constrained optimization problems. Thus, graph optimization has developed as a large subfield of mathematical optimization.<br\/><br\/>Randomization gives several important benefits in the design of optimization algorithms for graphs. Randomized algorithms often run faster and give better answers than their deterministic counterparts. Furthermore, since they are often simpler than deterministic algorithms, randomized algorithms can be easier to implement and maintain and can perform better in practice.<br\/><br\/>This project investigates the uses of randomization in several central optimization problems on graphs. The maximum flow and minimum cut problems, which are perhaps the most widely studied and applicable graph optimization problems, can be solved exactly__the major objective is designing faster, simpler, and more practical algorithms for arriving at the right answer. Other problems, such as graph coloring and bisection, analysis of network reliability, and construction of low-cost high-connectivity networks, are extremely hard to solve exactly__the major objective is to find efficient algorithms that give answers as close as possible to the elusive optimum.<br\/>The algorithms developed will be of only theoretical interest unless they are actually implemented. Therefore, experimental analysis of the algorithms will be undertaken, comparing their performance in practice to that of other algorithms.","title":"Randomizationin Graph Optimization","awardID":"9820978","effectiveDate":"2000-04-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["486265"],"PO":["543507"]},"48724":{"abstract":"The starting point for many tasks of data-driven knowledge discovery is a data matrix whose rows are individuals, columns are numeric and\/or symbolic features, and entries are feature values. The usual goals of discovery or data analysis include finding classifiers, clusters, association rules, and Bayesian networks. The new question posed by the PI in this work about a data matrix is: Given one individual (or row) that is of special interest, what is unique about that individual? That is, concisely articulate that individual's niche within the overall context. One challenge the PI intends to address here is to better understand what statements of individual uniqueness people tend to find understandable and interesting. Preliminary results indicate that the criteria for these two properties are mostly general, and only partly domain-dependent. A prototype implementation of niche finding, using a set covering approach, has been applied to a newly assembled dataset on 236 major U.S. universities described by 123 features. The PI will extend the methods by adding new feature types, scaling up to larger datasets, comparing against alternative approaches and different approximation algorithms, and by applying niche finding to significant problems in science and other professional fields. The overall goal is to make niche finding as usual a discovery task as the others cited. The PI expects to show that there is a new, simple, and interesting question to ask about datasets that has broad applicability in science and other professional fields. He also intends to enhance public appreciation for knowledge discovery and information processing by developing special versions for baseball, with plans for use on public media and as a museum exhibit","title":"Niche Finding - A New Task of Knowledge Discovery","awardID":"9988084","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["428481"],"PO":["564456"]},"46689":{"abstract":"Multiple-access communication channels arise in a great <br\/>variety of applications, among which are some of the most <br\/>rapidly growing areas of technology development today:<br\/>cellular telephony, wireless \"last mile'' systems, indoor wireless <br\/>LAN's, nomadic computing, high-speed digital subscriber lines, etc. <br\/>New performance requirements are constantly being imposed <br\/>on such systems in order to provide high-quality, multimedia services <br\/>to an exponentiating user population. A major approach<br\/>to meeting these requirements is through the use of advance <br\/>signal processing techniques to mitigate the manifold physical <br\/>impairments arising in such channels. This research addresses <br\/>a number of key issues in this field.<br\/><br\/>Multiple-access channels arise in the above-noted systems as the<br\/>result of several physical conditions, including non-orthogonal <br\/>multiplexing in CDMA systems, cross-talk in xDSL systems, <br\/>multipath in TDMA systems, and co-channel interference in most<br\/>types of cellular systems. Multiuser detection, developed over the <br\/>past fifteen years, has provided a very useful theoretical basis for <br\/>the study of optimal signal processing problems in multiple-access<br\/>channels. This research is concerned with problems in which <br\/>multiuser detection must be combined with other signal processing<br\/>functions, such as beamforming, channel decoding, impulse-noise<br\/>mitigation, etc. The basic approach is to apply algorithms that<br\/>iterate between signal-processing functions. In particular, this<br\/>research examines the general structural and performance properties<br\/>of such algorithms, their implementation, and their application in<br\/>three specific technologies: indoor wireless networks, digital <br\/>subscriber lines, and underwater acoustic modems.","title":"Iterative Methods for Multiuser Detection: Impulsive Noise, Coded Channels, and Multiple-Antenna Sytems","awardID":"9980590","effectiveDate":"2000-04-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["560130"],"PO":["223414"]},"43258":{"abstract":"EIA-9912247<br\/>Sutherland, Karen<br\/>Augsburg College<br\/><br\/>Research Experiences for Undergraduates: Robot Navigation using Composite Landmarks<br\/> <br\/> These research projects draw from the areas of robotics, behavior learning and cognitive science within an environment of robot navigation. The PIs use small robotic vehicles to test their algorithms and model the behavior of the desert ant, Cataglyphis Bicolor. This ant uses landmarks consisting of more than one point (composite) as opposed to simple point landmarks. Examples of composite landmarks in everyday environment are ridgelines, saddle points and peak formations. Projects focus on development and testing of algorithms for recognizing composite landmarks, development of learning algorithms to map sensory input to motor output, and comparing the use of composite versus simple landmarks. The projects include building Lego test vehicles, writing simulations and implementation of image processing techniques. The program has an emphasis on technical writing and speaking skills.","title":"REU: Robot Navigation using Composite Landmarks","awardID":"9912247","effectiveDate":"2000-04-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["291712",109514],"PO":["564181"]},"47405":{"abstract":"EIA-9983386<br\/>Etchemendy, John W.<br\/>Stanford University<br\/><br\/>Digital Government: Heterogeneous Reasoning Tools for Design Support<br\/><br\/>This is a planning grant proposal to explore the development and usefulness of software to support the solution of problems involving heterogeneous goals, representations, and rationales. Such problems arise frequently in all information processing areas. In this grant, the work will be focused on the design and administration of complex government statistical survey instruments. The government partners are the Bureau of Census and the Bureau of Labor Statistics. The work is expected to result in a larger and more encompassing proposal later. The funding will support exchange of information relative to the agencies' missions. Exploration of the feasibility of deploying tools based on the Openproof framework, and identification of other government agencies and industrial partners who may be interested in collaboration","title":"Digital Government: Heterogeneous Reasoning Tools for Design Support","awardID":"9983386","effectiveDate":"2000-04-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[121344],"PO":["371077"]},"42863":{"abstract":"EIA-9911077<br\/>Ning XI<br\/>Michigan State<br\/><br\/>CISE Research Instrumentation: Dual Manipulator Mobile Robot<br\/><br\/>The Department of Electrical and Computer Engineering at Michigan State University will purchase a dual-arm mobile robot system consisting of a mobile platform equipped with a dual-arm manipulator and various sensors. This equipment will be dedicated to support research in the area of computer and information science and engineering. The equipment will be used for several research projects including in particular: Planning and Control for Cooperative Operation of Multiple Mobile Manipulator in a Perceptive Frame; Task Scheduling and Control of a Reconfigurable Manufacturing Workcell; Heterogeneous Function-Based Human\/Robot Cooperation; Multi-Sensor Fusion in Robot Action planning and Control. The objectives of these projects aim at developing theoretical foundations for intelligent planning and control of robotic and manufacturing systems to improve the reliability and efficiency of operations. The requested equipment will provide unique capability to experimentally implement and test new theoretical findings.","title":"CISE Research Instrumentation: Dual-Manipulator Mobile Robot","awardID":"9911077","effectiveDate":"2000-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550894","387321"],"PO":["557609"]},"50004":{"abstract":"The PI will investigate cellular automata self-replication programming, to pave the way for more complex studies of this subject in the future. In preliminary work, the PI has been able to construct systems where self-replicating structures emerge in a randomly initialized space, and also systems where self-replicating structures can solve a restricted version of the satisfiability (SAT) problem. Both models take advantage of the massively parallel nature of the underlying cellular automata space within which structures replicate and evolve. This has led the PI to conjecture that self-replication programming may constitute a new paradigm for developing massively parallel algorithms to solve computationally expensive problems. With this long term goal in mind, the PI will study during the coming year two relatively easier subgoals: the design of compact self-replicating structures where more data for computation can be stored in the same size cellular space than currently possible, and new bisexual self-replicating models that incorporate the crossover operator from genetic algorithms. To provide the requisite testbed for this work, the PI will utilize the Java Virtual Machine to extend his high level Trend cellular automata programming language and simulation environment to a variety of computer platforms.","title":"SGER: Preliminary Studies of Cellular Automata Self-Replication Programming","awardID":"0001542","effectiveDate":"2000-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["393510"],"PO":["564456"]},"48904":{"abstract":"Knowledge compilation has been emerging recently as a new direction of research for dealing with the computational intractability of general propositional reasoning. In this approach, the reasoning process is split into two phases: an off-line compilation phase and an on-line query-answering phase. In the off-line phase the propositional theory is compiled into some target language, which is typically a tractable one. In the on-line phase, the compiled target is used to efficiently answer a (potentially) exponential number of queries. The main motivation behind knowledge compilation is to push as much of the computational overhead as possible into the off-line phase, in order to amortize that overhead over all on-line queries. Another motivation behind compilation is to produce very simplistic on-line reasoning systems, which can be embedded cost-effectively into primitive computational platforms, such as those found in consumer electronics.<br\/><br\/>The focus of this research is on a new compilation target language, known as Decomposable Negation Normal Form (DNNF) which is universal (contrary to Horn theories), supports more polynomial-time operations than Horn theories and prime implicates, is more space-efficient than OBDDs, and is very simplistic as far as its structure and algorithms are concerned. Therefore, DNNF represents a new, interesting point on the four-dimensional structure of universality, tractability, efficiency and simplicity. The class of polynomial-time DNNF operations is sufficient to fully implement relatively complex AI applications, such as model-based diagnosers and universal planners. Moreover, its space-efficiency establishes a very significant bottom-line for the effectiveness of DNNF-based compilations, given the current success of the OBDD community in compiling quite complex propositional theories.<br\/><br\/>There are four major objectives of this proposal. The first, and most central objective, is to push the DNNF compilation envelope along three dimensions: to develop algorithms that generate much smaller DNNF compilations than is currently possible; to develop a DNNF compiler which can incrementally change a DNNF compilation in light of incremental changes to the underlying theory; and to develop the theory of approximate DNNFs, which can be used to answer only a predetermined class of queries. The second objective is to pursue the applicability of DNNFs to the compilation of universal planners, an objective which is made possible by recent advances on satisfiability-based planning. The third objective is to develop a hardware implementation of some DNNF operations using Field Programmable Gate Arrays (FPGAs) in order to permit the compilation of certain diagnosis and planning applications into hardware. The fourth objective of this proposal is to conduct an investigation on some of the theoretical underpinnings necessary to fully understand the relationship between DNNF and other tractable forms, such as Horn theories and OBDDs.<br\/><br\/>This project will make a strong impact on the theory and practice of propositional reasoning in intelligent systems. On the theoretical side, it will shed new light on the compilability of propositional reasoning and on the relationship between various target compilation languages, such as OBDDs, Horn theories and prime implicates. On the practical side, it will yield on-line reasoning systems which are more tractable than is currently possible, and will enable the migration of certain AI applications (diagnosis and planning in particular) onto platforms with primitive computational resources. This may provide a solid foundation for embedded intelligence, as exercised in the powerful framework of propositional reasoning.","title":"Compiling Knowledge for Tractable and Embedded Inference","awardID":"9988543","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["486633"],"PO":["491702"]},"48618":{"abstract":"Machine learning systems are proving to be useful tools for knowledge discovery. Their abilities to process large amounts of data and to consider large hypothesis spaces complement the abilities of human experts to analyze in great depth a few data points and a few potential hypotheses. Nevertheless, except for the initial presentation of data and the final presentation of a hypothesis, current machine learning systems and human experts do not interact. The goal of this project is to explore ways to enable machine learning system and human experts to act more as a team, taking advantage of both the computer's speed and the human's knowledge and skills. The PI will study the issues involved in building and using collaborative machine learning systems, through the development and testing of a system with capabilities to do the following: 1) Maintain, cluster, and summarize alternative hypotheses that explain the data, rather than providing a single answer based on a general-purpose heuristic; 2) Propose to human experts practical sequences of experiments to refine or distinguish between competing hypotheses, and justify these experiments to the experts; 3) Provide non-numerical justification for hypotheses, such as relating them to prior beliefs or illustrative examples (in addition to providing numerical accuracy estimates); 4) Answer an expert's questions regarding alternative hypotheses; and 5) Consult the expert regarding anomalies or surprises in the data. For focus, the developed system will be a relational learning system. Such systems already have advantages for use as collaborators in knowledge discovery, because they can utilize declarative background knowledge provided by an expert, and return hypotheses in the form of human-comprehensible rules. For further focus, the project will apply collaborative learning systems to a family of challenging scientific discovery tasks within the general area of drug design. This research should impact the areas of knowledge discovery, machine learning, and data mining in bringing about a shift toward the development of systems that can be tailored by different users to application areas as diverse as genomics, logistics, education and economic forecasting, and which can then interact with human experts in these areas to make discoveries neither could have made alone. More specifically, a collaborative machine learning system called COLLEAGUE will be made publicly available as a research testbed for use on tasks where large or complex data sets must be analyzed and human knowledge or skills are required for success.","title":"Relational Learning Systems as Collaborators with Human Experts in Knowledge Discovery","awardID":"9987841","effectiveDate":"2000-04-15","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["419800"],"PO":["491702"]},"51644":{"abstract":"Sensing actions, which when executed change the state of an agent's knowledge without changing the world. are necessary when planning in the presence of incomplete knowledge about the world. The initial aim of this research is to develop a formal characterization of reasoning and planning with sensing actions. Questions to be addressed include: What kind of plans are necessary when planning with incomplete information? When is such a plan correct? What is the state-space in this case? How do we compactly represent states? How do we characterize noise in sensing? How do we specify goals? What is the complexity of planning with sensing? The answers to these questions will be used to develop planning algorithms and planners that are more tractable, and which use a sound (but not necessarily complete) reasoning about sensing actions.<br\/><br\/>Another thrust of this research is to use sensing actions for diagnostic problem solving in dynamic domains. The PI will formulate the notion of a diagnosis, given a set of observations about different time points. Since a particular set of observations may lead to multiple diagnoses, the PI will develop the notion of a diagnostic plan which when executed will lead the reasoner to a unique (or a smaller set of) diagnoses. He will then study the complexity of finding a diagnosis and constructing diagnostic plans, and develop and implement corresponding algorithms for tractable subclasses.<br\/><br\/>This project will lead to a theory of actions that allows sensing actions, which will allow us to: develop sound and complete planners as well as sound, but incomplete, but more tractable planners. It will extend applications such as agent control and diagnosis to the incomplete world, impacting diverse areas of computer science including the high-level control aspects of mobile robots, active databases, and program verification.","title":"Reasoning and Plannning with Sensing Actions and Their Applications","awardID":"0070463","effectiveDate":"2000-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["431233"],"PO":["491702"]},"46419":{"abstract":"Future Wireless Information Networks (WINs) will provide integrated services (e.g., voice, video, data, images, and multimedia) each with its own bandwidth and Quality of Service (QoS) requirements. To meet this challenge, it is necessary to design systems that deal effectively with bandwidth management, mobility, multipath fading, shadowing, interference, abrupt changes in link (channel) quality and network topology, variability in QoS re-quirements, and increasing user demand. Designs that deal effectively with the above issues will have to jointly optimize the operation of subsystems that potentially cut across several network architecture and protocol layers.<br\/><br\/>The proposed research aims at integrated designs of WINs that account for the interactions among layers and<br\/>takes advantage of these interactions to discover algorithms that deal effectively with the abovementioned issues.<br\/><br\/>We believe that the physical layer plays a crucial role in the performance of WINs because it is the least<br\/>controllable and predictable layer in the network architecture. This is why we propose to: (i) understand primarily the impact of the physical layer on the performance of the data link control, Media Access Control (MAC), network, and transport layers; and (ii) exploit this impact to develop a systematic approach to the integrated design of WINs. To achieve this goal, we propose to investigate single-hop and multi-hop problems separately, with the understanding that, eventually, an overall design will integrate, in an iterative manner, the issues critical for single-hop problems with those that are critical for multi-hop problems.<br\/><br\/>For single-hop problems, we will (i) investigate the interactions among components of the physical layer so<br\/>that we can improve the layer's design; (ii) exploit the impact of the physical layer on the data link control,<br\/>MAC, and transport layers in order to develop efficient Automatic Repeat reQuest (ARQ) algorithms, and dynamic resource allocation algorithms, and to develop mechanisms to improve the performance of Transmission Control Protocol (TCP) over wireless links. For multi-hop problems, we will (i) exploit the impact of the physical, data link control, and MAC layers on the network layer to develop efficient multi-hop routing, alternate routing, power control (topology control), load-balancing, and congestion control algorithms; (ii) take advantage of the impact of the physical, data link control, and MAC layer on the transport layer to design simple, efficient, and robust mechanisms of TCP in multi-hop WINs; (iii) design and validate simple communication protocols incorporating the algorithms and mechanisms developed in (i) and (ii).<br\/><br\/>The proposed activities in connection with other relevant research activities at the University of Michigan and Purdue University will provide an excellent vehicle for the training of future wireless information network engineers.<br\/><br\/>Keywords: Wireless networks, resource allocation, receiver architecture, fading channels, integrated services,routing and flow control.","title":"Integrated Design of Wireless Information Networks","awardID":"9979367","effectiveDate":"2000-04-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["239076"],"PO":["564898"]},"47619":{"abstract":"A career development plan is presented with the objective of developing an interdisciplinary eye tracking education and research program at Clemson University. The four development areas forming the program are described: (1)pedagogical innovation, (2) laboratory infrastructure, (3) interdisciplinary eye movement research, and (4) independent computer science research. Work in areas (1) and (2) has already begun. The long-term research directions outlined in areas (3) and (4) specify a research agenda designed to sustain and nurture the program's growth. This proposal defines two virtual reality eye tracking research projects, the results of which will serve as part of the foundation for future research and career development.<br\/><br\/>Pedagogical Innovation: A newly approved interdisciplinary course, commencing in Fall 1999, is described. This class features applied instruction in eye tracking methodology and thus presents a nationally distinctive course offering. The course content provides a context for ongoing and proposed eye tracking research. This proposal also discusses the strategies for the formative and surnmative evaluation of this curricular development.<br\/><br\/>Laboratory Infrastructure: Hands-on course instruction and related research is conducted within the newly installed eye tracking facility housed in Clemson's Virtual Reality Laboratory. The laboratory includes two top-of-the-line Head Mounted Displays (HMDs) from Virtual Research, one of which is outfitted with a binocular eye tracker from ISCAN. The HMI)s are driven by an SGI Onyx2 InfiniteReality graphics engine, which generates a myriad of complex stimuli, including graphics, virtual environments, digital images, and video. The binocular HMD-fitted eye tracker, the principal component currently used in virtual reality eye <br\/>tracking research, appears to be the first of its kind to be assembled in the United States.<br\/><br\/>Interdisciplinary Research: Related collaborative research directions are <br\/>outlined, with the support of faculty from Psychology, Marketing, and Industrial Engineering. Students from these departments can enroll in the eye tracking course and are expected to participate in ongoing research, <br\/>Supporting the burgeoning education program, the objective of the proposed collaborative efforts is to explore fundamental questions regarding dynamic vision and perceptual processes. Results from completed projects will be featured in the course as it evolves over time.<br\/><br\/>Independent Research: The underlying theme of this proposed research is display generation and processing, matching the dynamic nature of human vision as revealed by eye movements. <br\/>Although long-range computer science directions are specified within the areas of computer graphics, <br\/>human-computer interaction, and digital imaging, this<br\/>proposal focuses on two related projects pertinent to virtual reality <br\/>research. These projects constitute the primary<br\/>reason for requested funding. The aim of both projects is to develop <br\/>strategies to increase the display rate of com-<br\/>plex virtual environments through gaze-contingent object and scene <br\/>modeling. The proposed evaluation of the two<br\/>virtual environments is based on measurements of system and human <br\/>performance. Expected deliverables include<br\/>multivariate acuity-matching degradation functions suitable for either <br\/>model- or frame-based scene generation result-<br\/>ing in display-time compression. The development of the two proposed <br\/>projects is slated over a four-year period. The<br\/>schedule is summarized as follows:<br\/><br\/>1. First year: completion of software development for initial <br\/>gaze-contingent virtual environment construction;<br\/>completion of pilot studies; dissemination of preliminary results and <br\/>experiences.<br\/>2. Second year: implementation of gaze-contingent modeling strategies; <br\/>initiation of human subject experiments.<br\/>3. Third year: implementation of gaze-contingent visuotopic strategies; <br\/>initiation of human subject experiments,<br\/>4. Fourth year: completion of experiments and data analysis; dissemination <br\/>of project results.<br\/><br\/>The four-year duration of the two proposed projects presents an opportunity <br\/>to lay the groundwork for future career<br\/>development. Although this career development proposal is broad in scope, <br\/>it is tacitly assumed that the work outlined<br\/>herein forms the foundation for a lifetime of research and teaching <br\/>activities.","title":"CAREER: Development of an Eye Tracking Education and Research Program at Clemson University","awardID":"9984278","effectiveDate":"2000-04-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["408667"],"PO":["565227"]},"54628":{"abstract":"Proposal Number: 0080973<br\/>PI's Name: Bloom, Stephen L.<br\/>Institution: Stevens Institute of Technology<br\/>TITLE: Support for Student Speakers at MFPS '00<br\/><br\/> Abstract<br\/><br\/>This project provides funding to offset the cost of <br\/>graduate student attendance at the Workshop on Mathematical <br\/>Foundations for Programming Semantics, MFPS-2000, <br\/>to be held at Stevens Institute of Technology April 12-16, 2000.<br\/>Invited speakers for MFPS-2000 include Samson Abramsky, <br\/>Rance Cleaveland, Andy Gordon, Robin Milner, Peter O'Hearn, <br\/>and Dana Scott, each of whom is known for outstanding interaction <br\/>with students. MFPS has always been hospitable to graduate students, <br\/>usually attracting a good number of students, who present a <br\/>significant number of talks. In addition, because of the location, <br\/>graduate student participation could be unusually high.<br\/>Attendees at this event are expected to number less than 100, <br\/>permitting significant student-researcher interaction.","title":"Support for Student Speakers at MFPS","awardID":"0080973","effectiveDate":"2000-04-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["166259"],"PO":["150697"]},"51813":{"abstract":"In the real world, the identity of an object is often ambiguous due to noise or lack of information. This ambiguity can sometimes be reduced by utilizing extra information, referred to as context, provided by surrounding objects. Unfortunately, existing approaches that utilize context collapse when the number of context-bearing objects is large. Furthermore, there has been no attempt to separate relevant context from irrelevant context. In this project PI will develop algorithms that can reliably identify relevant context and then exploit it in a decision making process for pattern classification that is computationally tractable. The approach employs a Bayesian framework that incorporates \"partial\" context represented as the \"derivative\" of the identities of surrounding objects. The criteria for evaluation of context relevancy include information-theoretic measures such as mutual information and \"expected relative entropy\", as well as complete factorization of Bayesian networks. The development of the algorithms was initially motivated by and will be ultimately tested on two related yet different medical diagnostic applications: white blood cell differentiation and microscopic urinalysis image classification. The resulting classification will provide diagnostic information about real patients. Although the testbed applications relate to medical diagnosis, the results of this research will be general and can find an abundance of uses in other areas, so this work will impact the broader scope of knowledge discovery, data mining, machine learning, and pattern recognition where context plays a role.","title":"Pattern Classification in Context","awardID":"0070842","effectiveDate":"2000-04-15","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["338149","402216"],"PO":["564456"]}}