{"70406":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"0202755","effectiveDate":"2001-12-15","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}}],"PIcoPI":["398928"],"PO":["239522"]},"80604":{"abstract":"","title":"CAREER: Towards Practical Constraint Query Algebras","awardID":"0296195","effectiveDate":"2001-12-15","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["294776"],"PO":["563751"]},"70408":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"0202757","effectiveDate":"2001-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}}],"PIcoPI":["398928"],"PO":["279227"]},"64262":{"abstract":"The focus of this research is the development of algorithms, theory, and applications for the identification of all minimal representatives, for implicitly given monotone systems. Such systems are a frequent target of knowledge discovery as they represent important information hidden in large databases, complex networks, etc. Problems involving the determination of monotone systems arise naturally in a multitude of areas including: data mining (finding all maximal frequent, minimal infrequent sets); text mining (finding the best linear query in vector space models); machine learning (finding the best rules or patterns); hypergraph dualization (generating all minimal transversals); reliability theory (generating all minimal working and\/or maximal failing states); integer programming (generating all minimal feasible solutions); stochastic programming (constructing deterministic equivalents to certain stochastic models); etc. A coherent theory of identification problems for monotone systems based on several recent mathematical results will be developed. Tractable classes will be outlined, efficient algorithms for such classes created and realized by programs. The resulting new methods will be tested on a variety of applications, such as data mining, logical data analysis, machine learning and text mining.","title":"Identification of Threshold, Regular and Submodular Monotone Systems: Theory and Algorithms","awardID":"0118635","effectiveDate":"2001-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["508076",165644,165645],"PO":["563751"]},"67100":{"abstract":"EIA-0131905 -James Clark-Duke University-BDEI: Computation and Uncertainty in Ecological Forecasting.<br\/><br\/>Planning for global change and decision making will be improved by access to reliable forecasts of ecosystem change. A recent initiative by the Ecological Society of America identifies three challenges that must be met for forecasts to be successful: 1) computational approaches (algorithm development and data structures) that would permit simulation of complex systems, 2) feasible methods to track statistical uncertainty, and 3) data inadequacy.<br\/><br\/> The project \"BDEI: Computation and uncertainty in ecological forecasting\" is an incubation that addresses these three challenges with an integrated approach. We propose to develop new computational and statistical techniques that will provide the capacity to forecast at broader spatial and temporal extents than possible with current approaches. The success of the proposed techniques will be evaluated using the data gathered from field experiments. <br\/><br\/>A team of three researchers-an ecologist (Clark), a computer scientist (Agarwal), and a statistician (Lavine)- propose a working group for Fall and Spring 2002 that will focus on forecasting forest compositional change. The working group will integrate new computational techniques into stand simulators and use models to estimate<br\/>uncertainty. The working group will develop an agenda for a broad initiative in ecological forecasting as basis for future proposals.","title":"Biodiversity and Ecosystem Informatics - BDEI -Computation and Uncertainty in Ecological Forecasting","awardID":"0131905","effectiveDate":"2001-12-01","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["544491","554177","387239"],"PO":["371077"]},"67288":{"abstract":"EIA-0132707 -Harvard University-Marc D. Hauser-Primate-Inspired Specialized Learning in an Agent Architecture: Safe and Robust Adaptive Action Selection<br\/><br\/>The intended multi-year research project would build a library of computational modules or idioms for representing learning and action-selection in non-human primates. We will particularly focus on modeling why well-learned new behavior does not always over-ride more established behavior patterns, and under what circumstances it can come to be exploited. This modeling could be key to designing fail-safe mechanisms in highly adaptive intelligent systems.<br\/><br\/>In this exploratory project, we would adapt an existing agent architecture to model the specialized learning in Cotton-Top Tamarins, focussing on several completed experiments already documented in our laboratory. Conducting this research under an SGER will give us an estimate of the scale of the software project, the level of interaction we can expect between the modeling and our ongoing research, and the educational potential for this system. This will help us determine the level of staffing and funding requested in the full proposal.","title":"Primate-Inspired Specialized Learning in an Agent Architecture: Safe and Robust Adaptive Action Selection","awardID":"0132707","effectiveDate":"2001-12-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["345620"],"PO":["565223"]},"68652":{"abstract":"EIA-0138998-Genevieve Giuliano-University of Southern California-SGER: Better Freight Flow Data for Analysis and Planning<br\/><br\/>This grant will support preliminary explorations in integrating 10 datasets, some digital and some paper, related to the modeling of the flow of freight carried by trucks, rail, and ship in the greater Los Angeles area. The collaboration will be between information scientists and experts in transportation planning and policy and will involve the collaboration of several government agencies.","title":"Better Freight Flow Data for Analysis and Planning","awardID":"0138998","effectiveDate":"2001-12-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["487472","214166","486525"],"PO":["371077"]},"68786":{"abstract":"EIA-0139391<br\/>Shah, Mubarak<br\/>University of Central Florida<br\/><br\/>Special Projects: REU Site Principle Investigator Meeting<br\/><br\/> Each REU site in way is unique and follows different model for providing research experiences to undergraduates. It will be nice to bring together Pis of different REU sites in one place so thats and NSF program directors can share their experiences, and exchange ideas on Research Experience for Undergraduates. Therefore, we propose to organize a meeting of PIs of CISE REU sites in January 2002 in Orlando, Florida. This will be a one-day meeting, all twenty or so PIs of REU Sites will be invited to attend. Since Orlando has several tourist attractions, and January is a very good time to visit Florida, we expect maximum attendance.","title":"Special Project: REU Site Principal Investigator Meeting","awardID":"0139391","effectiveDate":"2001-12-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["505885"],"PO":["289456"]},"70386":{"abstract":"As noted in the proposal, optical networking actually encompasses a range of technologies which are under continuous improvement. Many universities and research organizations are currently interested in deploying a subset of these technologies using various strategies to enhance research and learning.<br\/><br\/>This proposal is for SURA to facilitate a workshop that <br\/>explores the current state of optical technologies,<br\/>assists in educating campus networking professionals about optical technologies,<br\/>explores current best practices involving the deployment of optical technologies in support of advanced academic networks at the local, regional and national level.<br\/><br\/>This will be a 2-day meeting in North Carolina, December 13-14, 2001. The long-term outcome of the conference is expected to be an Optical Networking Cookbook.","title":"SURA Optical Technologies Workshop; Research Triangle Park, NC; December, 2001","awardID":"0202726","effectiveDate":"2001-12-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["535422"],"PO":[182196]},"65326":{"abstract":"The proposal is to establish a US-EU\/DELOS working group on \"Spoken Word Digital Audio Collections.\" The working group will meet over the next year to discuss and evaluate fruitful joint activities and research paths for collaborative activities in this general topical area. The EU component of the effort is funded and managed by the DELOS Forum, a major organizer of digital libraries research and planning activities in Europe. DELOS receives support from the Information Societies Technologies (IST) 5th Framework Programme of the European Commission.<br\/><br\/>This effort continues the planning and assessment activities begun by an earlier NSF-EU working groups' process. In their final report \"An International Research Agenda for Digital Libraries\", delivered in Brussels in October 1998, increased levels of collaboration and interaction was seen as critical to building multi-lingual, multi-national digital libraries. The objective of the new working groups, of which this is one, is to define a research agenda on a specific topic and identify areas and activities for cooperation between EU and US researchers. The efforts of this particular group take the next step in the planning process by assessing fruitful research activities and resource development related to spoken word digital audio collections.","title":"EU-US Working Group for Spoken-Word Digital Audio Collections","awardID":"0123918","effectiveDate":"2001-12-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["497354"],"PO":["564456"]},"71003":{"abstract":"Information Technology will be playing an important role in addressing the research problems relevant to national security. The National Science Foundation will be calling upon its research communities to focus their research efforts on problems relating to national security. NSF has identified current projects that are important to this area, including but not limited to the following: Knowledge Discovery and Dissemination (datamining, knowledge representation, and knowledge sharing) and Biological Defense (bioinformatics, biosensing, pathogen normalcy baselining). This workshop is designed to bring selected university researchers together with NSF and other appropriate government staff to communicate their needs and get community input. CNRI will hold the workshop in order to assess some of the current programs and projects, gather government input, identify which projects hold the most relevance to the mission, and help identify new areas of research.","title":"ITR: KDD Workshop","awardID":"0204867","effectiveDate":"2001-12-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W295","name":"CIA-KNOWLEDGE DISC & DISSEMIN"}}],"PIcoPI":["210755","503343"],"PO":["565223"]},"70772":{"abstract":"Several lines of evidence suggest that there exists a strong analogy between natural languages and biological sequences, i.e. there appear to be organism-specific words, phrases and paragraphs in the collective of proteins encoded by the genomes of fully sequenced organisms. It is proposed that the biological analogy of meaning in a natural text is the ability of a protein sequence to fold into its functional three-dimensional fold. In natural languages, frequent words carry little meaning, while rare words often allow identification of the topic of a particular text. The hypothesis predicts, therefore, that rare stretches of amino acids indicate the location of folding initiators. The distribution of global properties along the sequence of lysozyme, a model protein for protein folding studies, indicated that features in these properties can be recognized when inverse frequencies of amino acid n-grams were plotted, supporting the analogy to natural languages. In the next 12 months the focus will be on studying the distribution of rare n-grams in the human genome. If a correlation between folding domains and distribution of rare n-grams can be established, this would (i) provide compelling support for the hypothesis and (ii) shed light on one of the major unsolved questions in biology today, the mechanism by which functional three-dimensional structures are formed from a one-dimensional sequence of amino acids.","title":"Applicability of Computational Language Technologies to Identify Independent Protein Folding Domains in Human Proteins","awardID":"0204078","effectiveDate":"2001-12-15","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}}],"PIcoPI":["499671","355022"],"PO":[183208]},"70465":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"0203032","effectiveDate":"2001-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}}],"PIcoPI":["398928"],"PO":["279227"]},"70059":{"abstract":"EIA-0210634 Paul Herrnson University of Maryland SGER: Human Factors Research on Voting Machines and Ballot Design: An Exploratory Assessment<br\/><br\/>This grant will support an exploratory assessment of the current state of knowledge regarding the human element in the voting process. The grantee will lay a groundwork for the systematic comparison of different methods of voting, including comparisons of the accuracy of different methods of voting, including ease of use and other factors related to voter confidence in the voting system. This work is especially relevant given the controversy surrounding the November 2000 national elections, and the movement of many political jurisdictions toward the purchase of new voting systems.","title":"Human Factors Research on Voting Machines and Ballot Designs: An Exploratory Assessment","awardID":"0201634","effectiveDate":"2001-12-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["214068","317018"],"PO":["371077"]},"60754":{"abstract":"EIA-0103594 Tomasz Haupt Mississippi State University Computational Vortals for Next Generation Scalable Computing<br\/><br\/>Computational Power constantly is opening new opportunities for numerical simulations, in turn opening opportunities for new science. This computational power is expected to be a low cost alternative for design and validation, boosting efficiency of manufacturing, and be a reliable source of forecast (e.g., weather earthquakes. the stock market, to name just a few domains), as well as all the other claimed and realized advantages for academic computing. This constant demand for faster and faster compute servers drives vendors to introduce more and more sophisticated; scalable architectures including scalable interconnects.<br\/><br\/>The PI's will develop high-level user directed assists to enable application programs to exploit cluster-computing resources; this will connect application level resource requirements with lower-level scheduler and middleware resources. The work will advance the usability of clusters by a significant class of applications.","title":"NGS: Computational Vortals for Next-Generation Scalable Computing","awardID":"0103594","effectiveDate":"2001-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["527384","379219"],"PO":["301532"]},"76517":{"abstract":"The common good of our information infrastructure depends on well designed network security that is embraced by the public and private sectors. Well designed network security requires well formed technical mechanisms and responsiveness to underlying moral and societal values, as well as a well thought out system of user interactions. In recent years, significant efforts have been directed toward developing the technical dimensions of network security, but little systematic work investigates and integrates the corresponding dimensions of human values and user experience. This collaborative project provides a model of interdisciplinary collaboration that can deepen our understanding of the cognitive, ethical and social implications of new types of inter-activity. It will study and implement security for a network browser that integrates these three key considerations: technical excellence, responsiveness to moral and societal values, and sensitivity to users' perceptions. It will: (1) develop a conceptual framework, or model, for network security that accounts for human values and user experience; (2) design and implement a working prototype of a network security system guided by the conceptual model; and (3) apply the experience of this project toward a better understanding of methodology for the general purpose of designing technology that is responsive to human values. Drawing on the technical, philosophical, and social science expertise of the three investigators, the work will begin with a close study of the network security in existing browsers such as Netscape 4.0 and Internet Explorer 4.0. The goal is to characterize the technical mechanisms, grasp value implications, and understand users' perceptions of these systems. Based on this study, the investigators will develop a conceptual model that represents the interaction among technical characteristics, values supported by (or embodied in) the system, and users' perceptions of their interactive experience with it. This model will guide the next phase of the project: to design and implement a prototype for a security configuration that is explicitly responsive to values and users' perceptions. User studies and further philosophical analysis of the prototype will help to refine the security configuration and, ultimately, to refine and assess the model itself. Through industry contacts and other traditional methods, the investigators will disseminate the results of their study, including the conceptual model, prototype, and aspects of the multidisciplinary methodology they develop.","title":"Collaborative Research: Network Browser Security and Human Values-Theory and Practice","awardID":"0229212","effectiveDate":"2001-12-31","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["563668"],"PO":["288903"]},"70401":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"0202749","effectiveDate":"2001-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}}],"PIcoPI":["398928"],"PO":["239522"]},"66838":{"abstract":"EIA-0130705 -University of Washington-Guang R. Gao-Adaptive Neurally-Inspired Computing: Models, Algorithms, and Silicon-Based Architectures<br\/><br\/>Rapid advances in silicon technology over the past few decades have allowed digital<br\/>devices to achieve ultra-high speeds in numerical computation. However, a majority of<br\/>these devices are prone to catastrophic failure when confronted with circumstances<br\/>unforeseen at programming time. Endowing such devices with the ability to adapt and<br\/>learn from experience is rapidly becoming a problem of fundamental importance in<br\/>information technology. We propose a new approach to solving this problem: building<br\/>information technology systems based on neurobiological computation and learning.<br\/><br\/>We intend to achieve this goal by developing computational models of plasticity and information processing in neurons and networks of neurons in selected sensory and motor areas of the brain; testing these models and their corresponding algorithms in software-based simulations, and designing real-time implementations of these algorithms in silicon using synapse transistors and field-programmable learning arrays (FPLAs).<br\/><br\/>We expect our research to provide a better understanding of computation within neuronal<br\/>networks, and to lead to a new generation of adaptive neuromorphic devices that could be<br\/>used for a variety of information technology applications, ranging from signal processing<br\/>and pattern recognition to ubiquitous computing and robotic control.","title":"Adaptive Neurally-Inspired Computing: Models, Algorithms, and Silicon-Based Architectures","awardID":"0130705","effectiveDate":"2001-12-15","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["550053","269393"],"PO":["521045"]}}