{"131890":{"abstract":"ABSTRACT<br\/><br\/>0541035\/0540948\/0541263<br\/>PI (lead\/UMass): Stephen F. Siegel<br\/>co-PI (UMass): George Avrunin<br\/>PI (UNL): Matthew Dwyer<br\/>PI (UChicago): Andrew Siegel<br\/><br\/>Collaborative Research: Finite-State Verification for High-Performance Computing<br\/><br\/><br\/>High performance computation (HPC) has revolutionized a wide range of scientific and engineering endeavors, including climate modeling, computational fluid dynamics, molecular engineering, and the design of<br\/>buildings, airplanes, and cars. Parallel computers, some of which contain over one hundred thousand processors, make this computation possible. Unfortunately, programming these machines is notoriously<br\/>difficult: parallel programs are extremely complex, difficult to debug, and can behave in unpredictable ways. As scientific applications increase in scale and complexity, the effort required to develop them is growing at an alarming rate, and there is an emerging consensus that new development methods are required.<br\/><br\/>The goal of this project is to develop a body of finite-state verification (FSV) techniques that will allow HPC developers to root out bugs and confirm that their programs meet specified requirements. FSV techniques involve the application of algorithmic methods to a formal model of the program being analyzed. While these techniques have been used successfully in some other programming domains, a number of challenges must be overcome before they can be successfully applied to HPC software. The ultimate result will be an increase in productivity of HPC developers and an increased confidence in the correctness of their programs.","title":"Collaborative Research: Finite-State Verification for High-Performance Computing","awardID":"0733035","effectiveDate":"2007-05-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["561781"],"PO":["564388"]},"131692":{"abstract":"The proposal request partial support for young researchers and students to participate in 2007 MobiSys Conference in San Juan, Puerto Rico. The NSF support will provide opportunities for 16 young participants to interact with established researchers. The focus of the conference is on the design, implementation, usage, and evaluation of mobile computing and wireless systems, applications, and services.<br\/><br\/>The broader impact of the proposal is fostering an environment of technical discussions and debates among the communities of mobile computing and wireless systems. In addition the conference is set out to encourage participation by young scientists and researchers. The intellectual merit of the 2007 MobiSys Conference will be advancing knowledge of mobile system design, implementation, and evaluation.","title":"A Proposal to Support Students and Young Scientists in 2007 ACM Sigmobile and the USENIX Association Mobile Systems, Applications, and Services Conference in Puerto Rico","awardID":"0732348","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["548310"],"PO":["434241"]},"131252":{"abstract":"This award supports a workshop on Federal Workforce Capabilities for Biosecurity, June 8-10, 2007, Linthicum, MD. The purpose of the workshop is to advance technical understanding of emerging challenges in biosecurity and to develop new strategies for training the Federal biosecurity workforce. The focus of the workshop is on training and assessment approaches that will enhance capability of the workforce to address new developments in biotechnology.","title":"Federal Workforce Capabilities for Biosecurity","awardID":"0729590","effectiveDate":"2007-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T814","name":"NSA-BTW"}}],"PIcoPI":["461485"],"PO":["561889"]},"126896":{"abstract":"This award enables graduate student participation and the inclusion of invited speakers in the 18th International Workshop on Principles of Diagnosis (DX'07), Nashville, Tennessee. The workshop is an annual event focused on theories, principles, and computational techniques for diagnosis, monitoring, testing, reconfiguration, fault-adaptive control, and repair of complex systems, as well as applications to industry-related problems. NSF funding amplifies the educational impact of the meeting by enabling graduate students to participate actively in a scientific and technical forum that addresses an important facet of high-confidence, survivable systems.","title":"Proposal for Supporting the 18th International Workshop on Principles of Diagnisis (DX'07)","awardID":"0710569","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["536406"],"PO":["561889"]},"126786":{"abstract":"ABSTRACT<br\/>0709983<br\/>Mitra, Partha<br\/>Cold Spring Harbor Lab<br\/>Engineering Principles in Bioogical Systems<br\/><br\/>Three workshops in a series entitled Engineering Principles in Biological Systems are proposed to take place at Cold Spring Harbor Laboratory's Banbury Center, Cold Spring Harbor, NY on May 6-8, 2007, May 4-6, 2008, and May 3-5, 2009. The purpose of these workshops is to bring together scientists with strong theoretical or mathematical backgrounds, and an active interest in applying engineering principles to the study of biological systems, for mutual education and future collaboration. Participants will be drawn from engineering and computer science, biology, and the physical sciences, and their topics of research will span cellular, systems and population biology. Intellectual Merit: Through the process of evolution, living systems retain accidentally found solutions to problems they must solve in order to survive. In the past, theoretical<br\/>biology has largely focused on explanations of the physico-chemical mechanisms behind such solutions, while explanation in the form of function-solution pairs has been studied in a relatively ad hoc manner and has not been approached from a disciplinary perspective. These workshops will promote the development of an emerging approach to theoretical biology with more formal emphasis on design or engineering principles. Here, the premise is that although solutions or designs in biological systems are not engineered but instead arise incrementally through natural selection, they may nevertheless be studied in their existing forms in the framework of engineering theories developed alongside human-engineered systems.<br\/>Goals of the workshops:<br\/>(1) Development of a theoretical canon: Refine a list of theories, rather than a theory of everything, applicable to studying engineering principles in biological systems. A starting point for these theories (as reflected in the proposed workshop sessions) can be drawn from courses taught in engineering departments. The idea is therefore to start with major existing engineering theories (controls, communication, computation) and to examine whether these apply to biological systems, and if not, what modifications are in order.<br\/>(2) Pedagogical goals: The workshops will provide an educational opportunity for biological researchers to learn about engineering theories which may be relevant to their work, and for engineering theorists and computer scientists to learn about biological problems they might help to be understood. Each session will have a tutorial overview of the corresponding engineering theory, followed by biological examples, chosen<br\/>specifically to span scales: from cellular and organism levels, as well as from population or evolutionary biology where appropriate. Dissemination and Broader Impact: The proposed workshops will foster this new<br\/>approach to understanding biological systems and the collaborative culture across disciplines that its success will require. The conference venue and format are ideal for encouraging open discussion and initiating collaborative efforts, and it is hoped that a continuing series of such workshops will also encourage the development of an enduring and progressive theoretical framework. To complement the direct training opportunity for workshop participants, talks presented at the workshop along with relevant supporting<br\/>material will be put on a publicly accessible website for the benefit of the general scientific community. In addition, a summary report reflecting the deliberations at the workshop will be prepared and disseminated through the website and submitted for publication in a review journal.","title":"Engineering Principles in Biological Systems","awardID":"0709983","effectiveDate":"2007-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1112","name":"Genetic Mechanisms"}}],"PIcoPI":["560613"],"PO":["562984"]},"135146":{"abstract":"City and county websites offer a new and innovative method to help citizens reduce the impacts of natural <br\/>disaster events. While most localities prepare a disaster plan and invest in local emergency management to respond after disasters, individual households are far less prepared, and preparedness rates are particularly low for racial\/ethnic minority households. The traditional modes of risk and preparedness communication have failed to reach or motivate residents to prepare for disasters. The community website is a potentially powerful tool to increase hazard preparedness. However, there is virtually no research on the development of local governments. web sites for hazard preparation or the usability of this information technology by community residents. <br\/> <br\/>This research will investigate the use of the World Wide Web by local governments and residents for delivering and receiving risk and preparedness information. Study areas will be communities in the Los Angeles and Miami; both areas are subject to natural disasters, earthquakes in the Los Angeles area and<br\/>hurricanes in the Miami region. Using multiple data collection methods and sources of data, the research will examine the local government decision-making process for website development for risk communication and hazard preparedness; usability of local government websites for hazard-related information; and the potential impact of risk communication and disaster preparedness Web pages in motivating residents to take proactive measures. Website evaluation data and resident survey data will be combined with secondary sources for<br\/>multivariate statistical analysis. Eight jurisdictions will be selected for case studies. Interviews with local government professional staff and officials will be conducted and these data, along with background materials, will be analyzed qualitatively. <br\/> <br\/>The results ofthis research will provide a unique contribution to the E-government and hazards literature of significant intellectual merit. The study brings together information technology, government, and citizens around a critical community issue: preparing for disasters. It will contribute significantly to our understanding of local government use of the web in general as well as for hazards; provide valuable information to policy makers and professionals about the use, coverage, and design of local government home pages; and examine the public decision-making process surrounding technology, community safety, and service to citizens. <br\/> <br\/>The research also will have broader impacts to education and society as a whole. The results of the research will provide valuable information to policymakers about risk communication via the web, and about impediments to use of their communities' websites for disaster preparedness. This knowledge can be used to remove barriers, improve hazard communication to racial\/ethnic minorities, motivate increased disaster planning by citizens, and thus, promises to contribute to a reduction in human and property losses from disasters.","title":"Collaborative Research: E-Government and the Preparation of Citizens for Natural Disasters","awardID":"0750165","effectiveDate":"2007-05-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T434","name":"HOMELAND SEC-CRIT INFRACT PROT"}}],"PIcoPI":["461421"],"PO":["371077"]},"120770":{"abstract":"Spectral Graph Theory or Algebraic Graph Theory, as it is also known,<br\/>is the study of the relationship between the eigenvalues and<br\/>eigenvectors of graphs and their combinatorial properties. Random<br\/>walks on graphs, expander graphs, clustering, and several other<br\/>combinatorial aspects of graphs are intimately connected to their<br\/>spectral properties. Recent approaches to the analysis of<br\/>high-dimensional data have exploited the fundamental eigenvectors of<br\/>the data. These data sets are large and ever increasing requiring<br\/>``real-time\" accurate responses to the given queries. This creates the<br\/>need for very fast algorithms, that also provide strict theoretical<br\/>guarantees on their output. Spectral techniques have been applied to image<br\/>processing, both by computers and in the primary visual cortex of<br\/>monkeys. Critical component to all these application is algorithms<br\/>with efficiency and accuracy guarantees for solving these linear system<br\/>and finding their fundamental eigenvectors.<br\/><br\/><br\/>A multidisciplinary team consisting of Theoretical Computer<br\/>Scientists, Machine Learning Scientist, and Neuroscientist will<br\/>develop and apply spectral graph theory to applications from data<br\/>mining to clustering, and image processing. Enabling technology<br\/>develop will include: 1) linear-work or O(m log m)-work algorithms<br\/>that run in poly-logarithmic parallel time for computing extreme<br\/>eigenvalues and generalized eigenvalues of diagonally-dominant<br\/>matrices, including Laplacian matrices, as well as algorithms of<br\/>similar complexity for solving the related linear systems. 2) Better<br\/>estimates for Fiedler values and generalized Fiedler values.<br\/>Application development: 1) Improvements in spectral image<br\/>segmentation. 2) The use of generalized eigenvalues in data mining and<br\/>image segmentation to combine multiple sources of information. 3) The<br\/>use of preconditioners for approximate inference in graphical models.<br\/>and 4) Combine insights into the problem of image segmentation gained<br\/>from spectral algorithms with knowledge gained from recent experiments in visual system<br\/>of monkeys to better understand how the primary visual cortex functions.","title":"Collaborative Research: Spectral Graph Theory and Its Applications","awardID":"0634957","effectiveDate":"2007-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["483530"],"PO":["550329"]},"130296":{"abstract":"The 2007 IEEE INFOCOM Conference on Computer Communications will be held in Anchorage, Alaska, USA from May 6 to May 12, 2007. This preeminent technical conference is the primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of paramount importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field. <br\/><br\/>Broader Impact: This proposal requests funding to support approximately sixteen graduate students in the United States to attend this premiere conference. The travel awards will target graduate students, in particular, women and under-represented minority students, since attending conferences is an important part of their educational experience, and they often have limited travel funds.","title":"NSF Travel Grant Support for IEEE INFOCOM 2007","awardID":"0725319","effectiveDate":"2007-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["525859"],"PO":["565090"]},"125544":{"abstract":"This award partially supports a series of three national and international Frontiers of Engineering (FoE) Symposia by the National Academy of Engineering. They are: German-American, April 26-28, 2007 in Hamburg, Germany; U.S., September 24-26, 2007 at Microsoft Company, Redmond, WA; and Japan-American, November 5-7, 2007, at HP Lab in Palo Alto, CA..<br\/><br\/>Many important and timely topics at the frontiers of engineering research and innovation will be covered, such as brain research and human behavior simulation, rocketry and aerospace technologies, smart and biomedical materials, engineering trustworthy computer and information systems, robotics and human-computer interaction, energy resources and drinking water safety, battery and biofuel technologies, etc.<br\/><br\/>Between 60 and 100 outstanding young engineers will be involved in each Symposium. The meetings will create the opportunities for sharing of research insights and techniques that may spur collaboration and serve as a reference point for many of the emerging frontiers work in the U.S.","title":"2007 Frontiers of Engineering Symposia (U.S., Japan-America, and German-American)","awardID":"0703833","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1402","name":"BIOCHEMICAL & BIOMASS ENG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}}],"PIcoPI":["543859"],"PO":["360556"]},"131276":{"abstract":"This is funding to support this year's Student Design Competition (SDC), which will be part of the 2007 annual RESNA conference to be held June 15-19 in Phoenix. RESNA is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. Comprised of over 1,000 individual and 200 institutional members - researchers, manufacturers, clinicians, suppliers, professionals and end-users of technology devices and equipment - the organization has as its purpose to improve the health and participation of people with disabilities in mainstream society. To this end, RESNA supports those individuals engaged in research, development, education, advocacy and the provision of technology through a number of programs and activities, which in addition to the annual conference include a credentialing program for assistive technology practitioners, suppliers and rehabilitation engineering technologists, as well as sponsored projects. RESNA serves as the ANSI-designated national body for development of voluntary standards for products used by persons with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference. Since then, over 200 designs have been identified as winning entries, chosen from more than 600 submissions by students from over 110 different universities. SDC entries must represent the work of STUDENTS ONLY, including the documentation of the design, but both undergraduate and graduate students are eligible to submit entries. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Support for past SDCs has been provided by nationally recognized disability organizations such as Easter Seals and Paralyzed Veterans of America, as well as by a subsidiary of the Johnson & Johnson Company. NSF has been a supporter since 2005, and this year's funding will enable the SDC to be further expanded and enhanced so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also sent out to major colleges and universities with engineering and design schools, including Historically Black Colleges and Universities. A team of 5 judges will pre-select entries with the final selections made at the RESNA Conference. Up to 15 teams will be invited to attend the conference with 5 teams ultimately selected as the final winners. A half-day platform session will be held in which the 15 teams will make presentations before the judges and public audience at the conference. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. Judges will make final decisions based on criteria using numeric scoring. After the judging contest, students will have an opportunity to exhibit and talk about their projects at the Exhibit Hall opening. More information is available online at http:\/\/www.resna.org\/Conference\/Conference.php.<br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a unique forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. In its new and expanded format thanks to NSF support for the third year now, the SDC is even better positioned to foster innovation and creativity, with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. Unique in its primary focus on undergraduates, the event will provide participants with experience and skills that assist them to be successful in their engineering and design careers, and will further encourage, support and mentor students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields","title":"Student Design Competition June 15-19, 2007 in Phoenix, AZ","awardID":"0729708","effectiveDate":"2007-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559082"],"PO":["565227"]},"122212":{"abstract":"The process of establishing human identity based on the physical (e.g.,<br\/>fingerprints) or behavioral (e.g., gait) attributes of an individual constitutes the core of biometrics. Despite the successful deployment of biometric systems in several applications, a number of fundamental issues in biometrics are yet to be addressed in a comprehensive fashion.<br\/>Indeed, establishing identity through biometrics is a complex and difficult problem due to the intrinsic challenges associated with the technology. <br\/><br\/>The objective of this research project is to systematically develop methods to overcome the limitations of existing biometric systems, thereby advancing the state of the art in this field. In this regard, the following tasks are being conducted: (a) modeling the biometric patterns of an individual using analysis-by-synthesis schemes, individuality analysis and manifold geometry; (b) designing efficient indexing methods for the rapid retrieval of identities from a large repository of biometric patterns; (c) enhancing the information content of biometric patterns using multibiometric fusion techniques; and (d) evaluating the performance of the aforementioned tasks on real-world biometric datasets. The models and techniques generated in this work are also applicable to other domains in pattern recognition and computer vision.<br\/><br\/>The results of this research project are expected to have a positive impact on the design and development of large-scale multibiometric systems for identity recognition management. In addition, the research activity will enhance the current biometrics curricula, engage students in cutting-edge research and promote use and effectiveness of biometric technology in diverse applications. The project's Web site (http:\/\/www.csee.wvu.edu\/~ross\/biometrics\/) will be used for results and information dissemination to broad communities of researchers, educators, students and biometrics practitioners.","title":"CAREER: Human Recognition - Models for Biometric Pattern Representation, Individuality, Indexing and Fusion","awardID":"0642554","effectiveDate":"2007-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["525557"],"PO":["563751"]},"127866":{"abstract":"The major objective of GENI (Global Environment for Network Innovation), a virtual laboratory for exploring future internets at scale, is to create major new opportunities to understand, innovate and transform global networks and their interactions with society. Dynamic and adaptive, GENI opens up new areas of research at the frontiers of network science and engineering, and increases the opportunity for significant socio-economic impact. <br\/><br\/>GENI will employ a flexible and adaptable framework that incorporates spiral development, i.e., iterative prototyping, and federation, i.e., connecting heterogeneous networks, substrates and technologies. It is expected that each turn of the spiral will take advantage of what currently exists, what has been learned from the previous spiral, what can fruitfully be federated and what might be achieved through new development and prototyping activities. Spiral 1 will allow academic-industry partners to create end-to-end GENI prototypes with a strong emphasis on the design and implementation of multiple GENI control frameworks. The ultimate goal is to design end-to-end prototypes of a virtual laboratory with a suite of infrastructure that will support future experiments and research challenges articulated by the Network Science and Engineering (NetSE) research community.<br\/><br\/>Intellectual Merit: This award gives funding to BBN Technologies to provide management and oversight of all GENI-related activities. GENI will 1) support at-scale experimentation on shared, heterogeneous, highly-instrumented infrastructure, 2) enable deep programmability throughout the network, promoting innovations in network science, technologies, services and applications, and 3) provide collaborative and exploratory environments for academia, industry, and the public to catalyze groundbreaking discoveries and innovation.<br\/><br\/>Broader Impact: Encouraging community engagement is critical to success. A GENI outreach plan will be developed and implemented. Each year, three GENI Engineering Conferences will be held. Open application for travel grants will ensure that researchers and students at underserved academic institutions and regions of the country will be able to participate. Potential partners in industry and international funding agencies will also be encouraged to attend. Students and young faculty will be hired as interns at BBN. As needed, interdisciplinary workshops will be convened that bring together researchers that don?t normally communicate, but from which GENI and the research community can benefit. <br\/><br\/>There is no pre-ordained outcome for these activities; the resultant GENI infrastructure suite could be an enahanced Internet, enhanced testbeds, federations of enhanced testbeds, something brand new (from small to large), federation of all of the above and\/or federation with related international efforts. The goal is to promote innovation, entrepreneurship, and economic growth.","title":"Establishing the GENI Project Office (GPO)","awardID":"0714770","effectiveDate":"2007-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"024F","name":"GENI CONCEPT\/DEVELOPMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7917","name":"NetS RESEARCH RESOURCES"}}],"PIcoPI":["521729"],"PO":["564993"]},"124137":{"abstract":"This symposium is a top-tier conference which brings together researchers from the microprocessor area of computer system architecture. A key emphasis of this conference is to bring about significant interaction between academic researchers and designers from industry to facilitate collaborations and technology transfer. This outreach activity supports travel for students and junior faculty to attend the symposium and have an outlet for exposure to economically transformative research of interest to industry.","title":"Support for the 39th Annual ACM\/IEEE International Symposium on Microarchitecture, 2006","awardID":"0652216","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["517241"],"PO":["550859"]},"130584":{"abstract":"This is funding to support travel by 20 students currently enrolled in PhD programs in the United States to participate in the AI-ED Doctoral Student Consortium, at the upcoming International Artificial Intelligence in Education Conference (AI-ED), to be held July 9-13, 2007, in Los Angeles, California. The AI-ED International Conference is the premier biennial event for promoting promotes rigorous research and development of interactive and adaptive learning environments for learners of all ages; AI ED will be the 6th event in the series. The interdisciplinary areas that AI-ED represents, comprising cognitive science, computer science, and educational technology, are critical research domains that enhance the effectiveness and usability of software learning systems. Active participation of young researchers in this conference is very important, both for the health of the field and for the researchers themselves. The AI-ED '07 Doctoral Consortium provides a unique opportunity for PhD students partway through their dissertation research to receive valuable feedback and individual mentoring from top researchers in the field. This support for doctoral students is particularly apt given that currently only 4% of the over 600 members of the AIED society are students, even with 44 countries represented. It is thus timely for NSF to offer this student support. The PI and co-PI both hold active leadership roles within AI-ED '07, and both hold over $2 million of NSF grants in the areas of human-language and advanced learning technologies. The AI-ED '07 Doctoral Consortium Committee will be comprised of the two PIs together with the current president of the AIED society. <br\/><br\/>Broader Impact: Bringing young and creative researchers to AI-ED '07 will help advance an important and socially valuable interdisciplinary research field. For many graduate students, the cost of attending the AI-ED conference exceeds their travel budget. Thus, NSF funding will significantly impact the careers of the next generation of AIED researchers, by enabling a number of them to take part in an important event they would otherwise have to miss; in particular, those who lack funding from other sources (e.g., advisor's grants). The students will have an opportunity to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. Participation will also help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The PI and co-PI have indicated that they will act to assure participation by members of traditionally under-represented institutions, and will pay close attention to inclusion of minorities and women.","title":"Student Support for the Artificial Intelligence in Education Conference, Los Angeles, CA -July 9-13, 2007","awardID":"0726616","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["482198","446708"],"PO":["388678"]},"132301":{"abstract":"0735857<br\/>Heileman<br\/><br\/>This award is for a Principal Investigators' (PIs) meeting associated with Future Internet Design (FIND) programmatic area of the National Science Foundation's Networking Technology and Systems (NeTS) program. This meeting was held at the Bishop's Lodge in Santa Fe, New Mexico on March 5-6, 2007. The three PIs are FIND-funded PIs who made the arrangements for the PI meeting.<br\/><br\/>Intellectual Merit. PIs funded under the FIND program are required to attend three PI meetings per year during the period they are funded. The purpose of the PI meetings is to review the progress of ongoing projects, and provide the opportunity for PIs to understand how their projects may intersect and work toward building new Future Internet architectures.<br\/><br\/>Broader Impacts. The goal of the FIND PI meetings is to afford PIs opportunities to meet and discuss the technical aspects of their projects, and to work towards forging a consensus around what design principles should be guiding their work. The hope is that these interactions will foster multi-disciplinary collaborations in the future are result in new Future Internet architectures.","title":"Future Internet Design (FIND) Principal Investigator's Meeting","awardID":"0735857","effectiveDate":"2007-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["465604",351588,"528342"],"PO":["565090"]},"122302":{"abstract":"Emerging wireless networks are envisioned to simultaneously support both delay-tolerant and delay-sensitive applications. Unfortunately, providing delay guarantees in wireless networks has been a challenging problem due to (i) the unreliable and resource-constrained wireless channel, and (ii) the inherent complex interactions across multiple protocol layers. The goal of this CAREER project is to provide an advanced suite of theoretical tools, algorithms, and protocols for supporting delay-sensitive applications on wireless networks. By combining large-deviation with Lyapunov stability, this project first develops a new unified theory for characterizing the delay performance of advanced MAC\/PHY mechanisms. This is then integrated into a unified cross-layer control and optimization framework for delay-sensitive applications, which leads to high-performance algorithms and protocols for MAC scheduling, advanced rate adaptation, admission control, multi-path routing, and pricing-based control. Finally, in one of the focused application areas, vehicular networks, the project develops tailored analytical tools and control algorithms to address the unique real-time requirements of highway safety applications.<br\/><br\/>Research results will have a broad impact on the wireless industry by providing novel analytical techniques and practical control protocols for wireless networks supporting delay-sensitive applications. Through the Center for Wireless Systems and Applications, the PI will actively share the results with industrial collaborators. The research is tightly integrated into the undergraduate and graduate curricula at Purdue. In particular, a vertically integrated Project team is formed to involve undergraduate students in research. The project will also benefit our society by improving highway safety and saving human lives.","title":"CAREER: A Theoretical Foundation for Supporting Delay-Sensitive Applications on Wireless Networks","awardID":"0643145","effectiveDate":"2007-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["382234"],"PO":["557315"]},"131256":{"abstract":"","title":"Workshop Proposal: New Directions in Complex Data Analysis for Emerging Applications Beckenridge, CO March 4-7, 2007","awardID":"0729601","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[348462],"PO":["564898"]},"125239":{"abstract":"Abstract:<br\/><br\/>The aim of the Tartan project is to create a high-performance energy-efficient computing system by understanding the space\/time trade-off in spatial computing. Tartan eliminates the abstraction of the ISA allowing the compiler to communicate all information necessary to manage the execution of the application. Tartan compiles complete applications into application specific circuit. These circuits can be quite large and challenge the scalability of commercial CAD tools. In this context, Tartan harnesses new techniques based on the global critical path to focus the optimizer on the truly critical elements of the circuit. This new approach to optimization is applicable to the entire CAD community.<br\/><br\/>The underlying computing substrate in Tartan is a reconfigurable fabric. This fabric is regular and thus amenable to manufacturing with future nanoscale technologies. To improve power and to ensure that the reconfigurable fabric is tolerant of the expected parametric variation in such technologies the fabric is implemented using clockless self-timed circuits. The tools used to implement these circuits in Tartan should have broad applicability, hopefully eliminating one the roadblocks towards the adoption of self-timed circuits.<br\/><br\/>One of the driving forces behind today's economy is the growth of information technology, which itself is driven by the constantly increasing availability, and decreasing cost, of computing. Research into Tartan will help to continue these trends well into the future.<br\/>Spatial computing has the potential to reduce design complexity, improve performance, improve energy efficiency, and support future nanoscale technologies.","title":"Tartan: A General-Purpose Spatial Architecture for Exploiting Future Technologies","awardID":"0702640","effectiveDate":"2007-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T778","name":"NSA-TARTAN"}}],"PIcoPI":[332333],"PO":["366560"]},"132236":{"abstract":"The PIs and Co-PIs of grants supported through the NSF-NIH Collaborative Research in Computational Neuroscience (CRCNS) program meet annually. This will be the third meeting of CRCNS investigators. The meeting brings together a broad spectrum of computational neuroscience researchers supported by the program, and includes poster presentations, talks and plenary lectures. The meeting is scheduled for June 3-5, 2007 and will be held in College Park, MD.","title":"Collaborative Research in Computational Neuroscience (CRCNS) PI Meeting held on June 3-5, 2007 in College Park, Maryland","awardID":"0735167","effectiveDate":"2007-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":["520590"],"PO":["564318"]},"122479":{"abstract":"After WLAN's phenomenal commercial success, multihop wireless networks, including wireless sensor networks, wireless mesh networks, and mobile ad-hoc networks, are expected to lead in the next wave of deployment. From a user's perspective, not only do these networks enable ubiquitous communication, but also they should provide means to support diverse application requirements, particularly, the ability to differentiate various types of data flows and ensure quality of service. The objective of this project is to design distributed algorithms and network protocols to solve several fundamental problems in multihop wireless networks, including end-to-end weighted bandwidth allocation, bandwidth assurance, and performance\/overhead tradeoff in traffic differentiation. The study covers a variety of network conditions, including single-commodity or multi-commodity flows, single-path or multi-path routing, and static or highly-dynamic wireless networks. The research focuses on two hop-by-hop, routing-independent, light-weight approaches based on aggregate state and packet labels, respectively. Without maintaining any per-flow state, these approaches are able to implement traffic differentiation under aggregate or weighted maxmin models and have great flexibility in adaptation based on network\/traffic conditions. The research results are expected to have significant intellectual and practical impact. Wireless sensor networks, mesh networks, and mobile ad-hoc networks will provide a pervasive communication infrastructure for modern societies and dramatically change the way people interact with cyberspace and physical environment. Traffic-differentiation capability allows these networks to meet diverse application requirements, which will promote their entrance into the marketplace. As an educational effort, this project actively involves senior undergrads and minority students.","title":"CAREER: Traffic Differentiation in Multihop Wireless Networks","awardID":"0644033","effectiveDate":"2007-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["485310"],"PO":["557315"]},"127968":{"abstract":"IIS-0715202<br\/>Thomas Finholt<br\/>University of Michigan<br\/>$25,008 - 12 mos<br\/><br\/>DOCTORAL COLLOQUIUM: Third International e-Social Science Conference<br\/><br\/>This is a 12-month standard award to support a Doctoral Colloquium program at the Third International e-Social Science Conference to be held in Ann Arbor, MI (October 7-9, 2007). This will bring together 20 dissertation stage doctoral students in the field of e-social science for one day of talks and interaction with 4 faculty members selected from among distinguished social science researchers.<br\/><br\/>Intellectual Merit<br\/>The focus of the Doctoral Colloquium will be the students' doctoral dissertations. These represent state-of-the-art research in the field of social science and e-social science. The Doctoral Colloquium provides both an opportunity for these projects to be shaped through intellectual exchange as well as communicating the character of the work to a key group of young scholars. In addition, the Colloquium will help spread ideas about e-social science within the US.<br\/><br\/>Broader Impact<br\/>The Doctoral Colloquium will bring together the best of the next generation of social science and e-social science researchers. This allows them to create a social network both among themselves and with several senior researchers, which will play a major role in their professional development. The diversity of Colloquium participants (nationality, scientific roots, methods), will broaden students' horizons at a critical stage in their education. As this is the first time the eSS conference has been held in North America, it offers a special opportunity for American students who have not been able to afford participation in the prior European conferences.","title":"Workshop: The Doctoral Colloquium at the Third International e-Social Science Conference; October 7-9, 2007 in Ann Arbor, MI","awardID":"0715202","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["498457"],"PO":["564456"]},"127869":{"abstract":"This award provides NSF support to hold a Ph.D. student forum on Deeply Embedded Real-Time Computing to be held in Tucson, AZ, December 3-6, 2007, in conjunction with the IEEE Real-Time Systems Symposium in 2007 (RTSS 2007). The aims of the Ph.D. student forum are to promote student involvement in the emerging area of cyber-physical systems, to discuss research challenges, and to reward innovative research and application ideas in deeply embedded real-time computing systems.","title":"CSR-EHS: A Ph.D. Student Forum on Deeply Embedded Real-Time Computing","awardID":"0714804","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553633"],"PO":["561889"]},"126549":{"abstract":"The collaborating Principal Investigators from the University of Pennsylvania, University of Colorado, University of Washington, and Columbia University are performing preliminary investigations into the feasibility of creating a treebank with multiple representations including both dependency structure and phrase structure.<br\/><br\/>Issues of interest include:<br\/><br\/> * To what extent can the conversion between dependency and phrase structure be automated, and to what extent is hand correction necessary after automatic conversion?<br\/><br\/> * How can we leverage experience from the creation of other treebanks?<br\/><br\/> To address these issues, the collaborating team is convening a working meeting of international scholars who have actively worked on treebanks representing many different formalisms and languages. Building on previous results in the conversion of phrase structure treebanks to dependency structures, tree adjoining grammar structures and combinatory categorical structures, a set of experiments is performed demonstrating the feasibiity of generating phrase structure from dependency structure. This requires well defined phrase structure and dependency structure guidelines for the language in question, currently limited to English. Other languages with tested guidelines for one of the two formalisms include Chinese, Korean, and Arabic (phrase structure) or Czech, German, Dutch, and Russian (dependency structure). The team is extending their conversion experiments to one of these languages as well, creating the necessary additional guidelines in the process. They are sharing a qualitative evaluation of our results with the colleagues at the workshop, and discussing the suitability of further experiments and alternative languages, as input into a resubmission of the CRI proposal.","title":"CRI:CRD Collaborative Research: General Techniques for Creating Treebanks with Multiple Representations: A Large-Scale Russian","awardID":"0708719","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["507284"],"PO":["565215"]},"127407":{"abstract":"Title: Workshop: Graduate Student Symposium at ACM Creativity & Cognition Conference (CC2007)<br\/>PI: Hollan, James D<br\/>Institution: University of California, San Diego<br\/><br\/>Abstract<br\/><br\/>This workshop supports the Graduate Student Symposium at the ACM Creativity & Cognition (CC2007) Conference. The symposium encourages young researchers currently pursuing a graduate degree in areas with emphasis on creativity and cognition by giving their work wider exposure in the community, helping to foster a sense of community among these young researchers, and providing an opportunity to obtain feedback and guidance from senior members of the research community in an interactive and supportive environment. Graduate students from different disciplines involved with understanding creativity and cognition will attend.<br\/><br\/>As computers become pervasive in all of society, there is a growing need to encourage<br\/>interaction between the disciplines of computer and information technology and the disciplines of digital arts, design, and cognition. Many envision that interactions across these disciplinary boundaries are fundamental to research advances. Involving young researchers during their graduate education is a key opportunity to seed and encourage such interactions. This is consistent with the new NSF initiative on Creativity in Information Technology, Science, Engineering, and Design (CreativeIT) and is a key intellectual merit of the symposium.<br\/><br\/>The broader impact of the Graduate Student Symposium is to substantially increase participation by young researchers pursuing a graduate degree in fields contributing to our understanding of creativity and cognition. The symposium will provide a supportive setting for feedback on graduate students' current work and guidance on future directions. Student participants will meet and discuss their work with each other and a panel of experienced researchers and practitioners.","title":"Workshop: Graduate Student Symposium at ACM Creativity & Cognition Conference (CC2007)","awardID":"0713037","effectiveDate":"2007-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["550599"],"PO":["424970"]},"122502":{"abstract":"Music contributes substantially to every culture on Earth, and the enjoyment of music is nearly universal. The appeal of music is that it provides expression to our own emotions, and it follows logically that individuals would want some creative input to that expression. Historically the primary exposure to music has been through live performance, providing audiences an opportunity for interaction with the musicians and music, but today the vast majority of music is experienced through recordings. And though recent digital audio technologies have had a tremendous impact on the world of recorded music, its fundamental nature remains unchanged: once a recording is made, that single \"performance\" is forever fixed, preventing any true interaction with the listener. The proposed work integrates research in digital audio technology with educational activities under a common vision of transforming the act of listening to \"recorded\" music into an interactive experience in which the \"performance\" responds to the creative input of the listener. Central to this vision is a concept known as Structured Audio, a semantic object-based representation of sound. <br\/><br\/>The specific work activity consists of the following efforts: . Structured Sound Modeling (SSM) of musical instruments, which uses a novel signal processing and machine learning framework to facilitate a greater degree of musically expressive control than can be achieved with existing models for sound synthesis. . Development of the Structured Audio Platform (SAP), consisting of devices and software that employ these new instrument models to provide an expanded artistic palette for music producers and interfaces enabling nonmusicians to interact with their music by controlling creative aspects of the \"performance.\" An outreach program that uses music technology to attract students to science, technology, engineering, and mathematics (STEM) by demonstrating the contributions of these disciplines to modern music production as well as the creativity inherent within STEM and related fields. <br\/><br\/>With respect to intellectual merit, there are many methods of modeling musical instrument sounds, but most are limited in their ability to capture the full expressive range of those instruments. The project will employ a novel framework for modeling time-varying sounds using jointly estimated parameters of an excitation-resonance model to derive a HiddenMarkovModel (HMM) of expressive sound. This framework employs an analysis\/synthesis scheme: input sound is parameterized by the model and can be regenerated from the model parameters. This process has been used to model the singing voice and can be applied to other instruments, resulting in high sound quality while retaining a full range of musical expression. Knowledge gained through this project will also benefit other machine listening applications, such as audio identification and sound sensing. The research activity includes the development of a custom platform of devices and interfaces that offer artists new creative options and allow non-musicians to also provide creative input to their music. A key area of research will investigate appropriate mappings from the expressive controls of SSM instruments to a simple, low-dimensional interface for musical novices. Creativity is a difficult subject to study quantitatively, but this project presents a framework from which a small subset of creative expression can be assessed and analyzed. <br\/><br\/>The educational activities of this project are designed to broadly impact students at many levels. The proposed outreach program will introduce high school students, particularly from underrepresented groups, to the technology of digital music, revealing the influence of science and engineering on music performance, recording, and listening. By engaging students' affinity for popular music the program seeks to foster curiosity in science and technology. The research component of the proposal will also be directly integrated into this program via custom music devices that allow students to creatively interact with music in Structured Audio format. This confluence of engineering and art has the potential to incubate interest in both fields. Given the diminishing support for music education in the public school system, this multi-disciplinary approach may be a solution to sustaining creative arts in the curriculum. The proposed research integrates knowledge from a wide range of areas. Participating graduate students will receive interdisciplinary training in fields such as acoustics, music theory, signal processing, performance practice, and machine learning.","title":"CAREER: Exploring Creative Expression through Music and Audio Technology","awardID":"0644151","effectiveDate":"2007-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["503250"],"PO":["565227"]},"127969":{"abstract":"This research focuses on novel self-phasing antenna array technology that allows secure communication within a distributed network of mobile agents that have no prior knowledge of their respective locations. The specific application of this proposal is for covert terrestrial sensor and nanosatellite networks. Despite the need for distributed intelligence systems to maintain reliable, up-to-date, uncompromised intelligence data dissemination capabilities throughout the entire network, they are often targeted by terrorist attacks. In many cases, these systems are easily detected by conspicuous antenna structures or the high concentration of radio-frequency emission in their vicinity. this research is to develop retrodirective antenna arrays to facilitate covert communications between a distributed terrestrial sensor network and an information gathering nanosatellite network. In contrast to conventional phased-array antennas, retrodirective arrays are self-phasing and are capable of providing self-steering, point-to-point radio crosslink. Retrodirective arrays located at the terrestrial sensors are used to autonomously uplink intelligence data to the satellite. Retrodirective arrays aboard the satellite are used to establish secure satellite-to-satellite crosslinks. The broader impacts of the proposed research will result in more secure, efficient data transmission in wireless networks that are of interest to the scientific, defense, and intelligence communities. The research will also support multidisciplinary training of students in areas that are of critical national importance.","title":"Retrodirective Antenna Arrays for Secure Data Transmission in Covert Terrestrial and Nanosatellite Sensor Networks (17U07UHShiro)","awardID":"0715203","effectiveDate":"2007-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H187","name":"DEFENSE INTELLIGENCE AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T885","name":"DIA-MASINT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}}],"PIcoPI":["498055","498056"],"PO":["565136"]},"122318":{"abstract":"Clusters and grids have achieved great successes in executing computation intensive workloads. However, executing data intensive workloads has proven to be much more difficult: data services are a serious bottleneck in large computing systems. To address this problem, cluster and grid computing systems must closely integrate computation with data storage. <br\/>A variety of new system structures are being developed according to this principle. <br\/>To provide scalable computation and storage, a cluster constructed from active storage units can serve as a combined archival file system and batch computing system. Distributed data structures built on active storage can guide data and computation placement in a coordinated manner. A new cluster programming language allows distributed data structures to be efficiently harnessed by large workloads. The result of this project will be a dramatic increase in the capacity of clusters and grids to process data intensive scientific workloads. This project will serve as an exciting environment for class projects in operating systems and distributed systems classes, and the software developed will be distributed as \"courseware\" for use by other educators. This work will have an impact on a wide variety of scientific disciplines, but will work particularly closely with active users in astrophysics, bioinformatics, biometrics, and molecular dynamics. The software created by this project will be disseminated in open source form for use by the broader community.In addition, this software will also be used as a vehicle for making live astrophysics data accessible to high school students and teachers through the Notre Dame Extended Research Community.","title":"CAREER: Data Intensive Grid Computing on Active Storage Clusters","awardID":"0643229","effectiveDate":"2007-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8010","name":"Computing in the Cloud"}}],"PIcoPI":["565244"],"PO":["565255"]},"120822":{"abstract":"Spectral Graph Theory or Algebraic Graph Theory, as it is also known,<br\/>is the study of the relationship between the eigenvalues and<br\/>eigenvectors of graphs and their combinatorial properties. Random<br\/>walks on graphs, expander graphs, clustering, and several other<br\/>combinatorial aspects of graphs are intimately connected to their<br\/>spectral properties. Recent approaches to the analysis of<br\/>high-dimensional data have exploited the fundamental eigenvectors of<br\/>the data. These data sets are large and ever increasing requiring<br\/>``real-time\" accurate responses to the given queries. This creates the<br\/>need for very fast algorithms, that also provide strict theoretical<br\/>guarantees on their output. Spectral techniques have been applied to image<br\/>processing, both by computers and in the primary visual cortex of<br\/>monkeys. Critical component to all these application is algorithms<br\/>with efficiency and accuracy guarantees for solving these linear system<br\/>and finding their fundamental eigenvectors.<br\/><br\/><br\/>A multidisciplinary team consisting of Theoretical Computer<br\/>Scientists, Machine Learning Scientist, and Neuroscientist will<br\/>develop and apply spectral graph theory to applications from data<br\/>mining to clustering, and image processing. Enabling technology<br\/>develop will include: 1) linear-work or O(m log m)-work algorithms<br\/>that run in poly-logarithmic parallel time for computing extreme<br\/>eigenvalues and generalized eigenvalues of diagonally-dominant<br\/>matrices, including Laplacian matrices, as well as algorithms of<br\/>similar complexity for solving the related linear systems. 2) Better<br\/>estimates for Fiedler values and generalized Fiedler values.<br\/>Application development: 1) Improvements in spectral image<br\/>segmentation. 2) The use of generalized eigenvalues in data mining and<br\/>image segmentation to combine multiple sources of information. 3) The<br\/>use of preconditioners for approximate inference in graphical models.<br\/>and 4) Combine insights into the problem of image segmentation gained<br\/>from spectral algorithms with knowledge gained from recent experiments in visual system<br\/>of monkeys to better understand how the primary visual cortex functions.","title":"Collaborative Research: Spectral Graph Theory and Its Applications","awardID":"0635257","effectiveDate":"2007-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["485891","475261","550942"],"PO":["565251"]},"131968":{"abstract":"ABSTRACT<br\/>CNS-0733419<br\/>PI: Lucinda Sanders<br\/>Institution: University of Colorado<br\/>Title: NCWIT and NSF BPC Joint Meetings <br\/><br\/>This project supports the organization of the annual alliance meetings of the National Center for Women in Information Technology and the NSF Broadening Participation alliance project participants. A Summit on K-12 Information Technology Education is also being held in conjunction with the other meetings. The meeting is to be held in May, 2007 in Boulder, Colorado. The National Center for Women in Information Technology is organizing the event. This meeting provides an opportunity for several groups to network and build a broader community to implement new models for broadening participation in information technology throughout the pipeline from K-12 to industry. The meeting provides an excellent mechanism to sustain and improve several well-developed communities and promote collaboration and success through participation in the community event. This award provides funding for the approximately 65 NSF Broadening Participation alliance participants.<br\/> <br\/>The intellectual merit of this project lies in the significant expertise involved in planning the meeting and participating in it. The meeting provides an opportunity of experienced investigators and researchers to discuss successes, failures, and lessons learned as well as the best ways to disseminate this information to broader communities. In particular, the K-12 summit provides an opportunity for the many national alliance members and partners to learn about the issues in K-12 education that impact all of their projects and to develop collaborative approaches to address the most significant areas of common concern.<br\/><br\/>The broader impacts of the project include providing a quality experience for a large group of national leaders in the area of increasing participation in information technology education and career paths. Thus this project has the potential to produce new models for developing a more diverse group of students and faculty members and to advance discovery and understanding while promoting learning in the information technology disciplines. The project will also provide a better technically educated workforce to meet national security and economic priorities.","title":"National Center for Women in Information Technology and the National Science Foundation Broadening Participation Joint Meetings","awardID":"0733419","effectiveDate":"2007-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["510151"],"PO":["564181"]},"130758":{"abstract":"This award provides funding to support a workshop on Engineering Solutions for Specialty Crop Challenges to be held in Arlington, Virginia, April 24-25, 2007. Different segments of the specialty crop industry (e.g., wine\/grape, citrus, apple, stone fruits, horticulture, etc.) have been organizing independently during the past several years to address critical research needs. However, because each segment, individually, only represents a relatively small portion of the overall specialty crop industry, many of their needs do not receive attention in national research programs. Consequently, those individual industry segments have created a research collective to examine common research needs across many different specialty crops. They have agreed that automation, robotics, precision agriculture, sensors, and other advanced technologies are needed to help their industries and its producers become more efficient, productive, and sustainable.<br\/><br\/>While other national efforts are underway to develop biological\/horticultural solutions to some of these problems, this workshop will be focused primarily on engineering science and technology approaches. Workshop participants from the specialty crop industry, equipment manufacturing, academia, and numerous federal agencies; such as, the United States Department of Agriculture (USDA), National Aeronautics and Space Agency (NASA), National Science Foundation (NSF), National Institute of Standards and Testing (NIST), and the National Oceanic and Atmospheric Administration (NOAA) will seek to identify both fundamental engineering science and applied engineering needs that will demand support from agencies such as the National Science Foundation (NSF) and the USDA, respectively. It is the specific objective of this workshop to enlist the combined expertise of the above listed workshop attendees to evaluate high priority specialty crop challenges to sustainability, and then develop a technology roadmap which will identify and prioritize a National engineering science research and development agenda for the specialty crops. <br\/><br\/>Engineering solutions in sensor technology, robotics, machine vision, remote sensing, controls, computational approaches, environmental protection and so on will be necessary in the future to insure that USA specialty crops can remain competitive in a growing global agricultural market, thus insuring a sustainable and secure USA specialty crop industries. As technological breakthroughs in fundamental science are discovered they will be incorporated into applied research and development programs, which will benefit the specialty crop industry and ultimately the American food chain. This workshop will seek to chart a course for Federal investments in specialty crop engineering science and technology for the next ten years.","title":"Workshop on Engineering Solutions for Specialty Crop Challenges; Arlington, Virginia; April 24-25, 2007","awardID":"0727333","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1468","name":"Manufacturing Machines & Equip"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1639","name":"SENSORS AND SENSING SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"5370","name":"SMALL BUSINESS INNOVATION PROG"}}],"PIcoPI":[346987,346988],"PO":["564988"]},"120837":{"abstract":"Spectral Graph Theory or Algebraic Graph Theory, as it is also known,<br\/>is the study of the relationship between the eigenvalues and<br\/>eigenvectors of graphs and their combinatorial properties. Random<br\/>walks on graphs, expander graphs, clustering, and several other<br\/>combinatorial aspects of graphs are intimately connected to their<br\/>spectral properties. Recent approaches to the analysis of<br\/>high-dimensional data have exploited the fundamental eigenvectors of<br\/>the data. These data sets are large and ever increasing requiring<br\/>``real-time\" accurate responses to the given queries. This creates the<br\/>need for very fast algorithms, that also provide strict theoretical<br\/>guarantees on their output. Spectral techniques have been applied to image<br\/>processing, both by computers and in the primary visual cortex of<br\/>monkeys. Critical component to all these application is algorithms<br\/>with efficiency and accuracy guarantees for solving these linear system<br\/>and finding their fundamental eigenvectors.<br\/><br\/><br\/>A multidisciplinary team consisting of Theoretical Computer<br\/>Scientists, Machine Learning Scientist, and Neuroscientist will<br\/>develop and apply spectral graph theory to applications from data<br\/>mining to clustering, and image processing. Enabling technology<br\/>develop will include: 1) linear-work or O(m log m)-work algorithms<br\/>that run in poly-logarithmic parallel time for computing extreme<br\/>eigenvalues and generalized eigenvalues of diagonally-dominant<br\/>matrices, including Laplacian matrices, as well as algorithms of<br\/>similar complexity for solving the related linear systems. 2) Better<br\/>estimates for Fiedler values and generalized Fiedler values.<br\/>Application development: 1) Improvements in spectral image<br\/>segmentation. 2) The use of generalized eigenvalues in data mining and<br\/>image segmentation to combine multiple sources of information. 3) The<br\/>use of preconditioners for approximate inference in graphical models.<br\/>and 4) Combine insights into the problem of image segmentation gained<br\/>from spectral algorithms with knowledge gained from recent experiments in visual system<br\/>of monkeys to better understand how the primary visual cortex functions.","title":"Collaborative Research: Spectral Graph Theory and Its Applications","awardID":"0635357","effectiveDate":"2007-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["486616"],"PO":["550329"]},"132706":{"abstract":"The Global Environment for Network Innovations (GENI) is a large-scale, experimental facility concept conceived by the computing research community. GENI promises to support the experimental exploration of robust new networking , distributed systems, and service architectures. It will advance and revolutionize large scale understanding and development of these areas. <br\/><br\/>In order to support the GENI design and development processes, BBN Technologies, Corp. will serve as the GENI Project Office (GPO). Working closely with the computing research community, the GPO will assume responsibility for the project management necessary to successfully complete all planning, design, and development activities essential to adequately prepare for GENI construction. <br\/><br\/>Intellectual Merit: GENI is envisioned as a comprehensive, continental-scale research facility that will allow controlled end-to-end experimentation with new architectures, protocols, services, data dissemination techniques, and more, running over an extensive national fiber optic infrastructure with next generation dynamic optical switching and routing, fully programmable core and edge nodes, heterogeneous sensor networks, wireless networks and other edge devices. All infrastructure will be shared among a large number of individual, simultaneous experiments and will be instrumented for the collection, analysis and pooling of measurements.<br\/><br\/>In order to manage such a complex endeavor, BBN Technologies will establish a dynamic and effective GPO that provides project management, high-level system architecture, engineering, and operations planning leadership. The GPO management structure and processes will include the broadest possible participation from both academic departments and industrial partners, so that nearly every mechanism in the GPO can be used to encourage broad community participation, throughout the planning phase. <br\/><br\/>This project entails two basic types of activities: (1) detailed planning documents must be prepared and pass review; and (2) construction risks must be identified and rapidly driven down, via analyses, prototypes, experiments, and trial integrations. <br\/><br\/>BBN understands all the technologies required in GENI, and has built large systems incorporating all of them, from optical networking, through field-deployed urban radio networks, to large-scale distributed software systems. BBN will bring discipline and clarity to the community's vision, and provide credible, realistic, and low-risk plans for constructing GENI -- the keys to successful design reviews. <br\/><br\/>Broader Impacts: The construction of GENI and the research that GENI supports is intended to lead to a revolution in information and communications technology as significant as the digitization of communication in the 1950s and the development of the Internet in the 1970s and 1980s. It is essential that everyone participate in this revolution, not just top-tier universities. Accordingly, BBN has structured every part of the GPO's planning processes to aggressively recruit underrepresented groups and institutions into GENI planning, including those of gender, ethnicity, disability, geography, etc. The project includes concrete actions, with objective metrics, for GPO success in building facilities, instrumentation, networks, and ongoing partnerships with underrepresented groups and institutions, for training and education, and for spreading the benefits of GENI experimentation broadly throughout society.","title":"Global Environment for Networking Innovations (GENI) Project Management","awardID":"0737890","effectiveDate":"2007-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"024F","name":"GENI CONCEPT\/DEVELOPMENT"}}],"PIcoPI":["521729"],"PO":["564993"]},"125260":{"abstract":"With the advent of processors with multiple layers of cache and\/or multiple processing cores it has become necessary to re-examine how matrices should be stored in memory. The investigators study how hierarchical data structures facilitate performance and reduce the programming effort when developing linear algebra libraries. Of particular interest is the impact on future multi-core processors, especially when the number of cores becomes large.<br\/><br\/>The project pursues the theory and practice of algorithms for linear algebra operations, and their implementations, when the matrices and\/or vectors are stored recursively by blocks (hierarchical matrices). The goal is to formalize abstractions for such data structures, to develop Application Programming Interfaces (APIs) that allow the practical development of entire dense and sparse linear algebra libraries specialized for these new data structures, and to develop a theory for optimal performance of blocked algorithms for sequential and parallel architectures, including multi-core architectures.","title":"Foundations and Applications of Hierarchically stored Matrices","awardID":"0702714","effectiveDate":"2007-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["556801",332388],"PO":["565272"]},"125161":{"abstract":"Abstract<br\/><br\/>The proposed research investigates lazy logic, a new design philosophy that has the potential to address many of the technological challenges that arise with nanometer-scale CMOS devices. Lazy logic rests on three principles: minimum clocking, which demands designs that use clocked storage only whenever absolutely required for correctness; pipeline avoidance, which encourages logic structures with multicycle delay paths and a scarcity of clocked latches; and lazy release, which promotes a lax resource allocation policy that avoids the power and delay overhead of utilization-efficient resource sharing by greedily holding onto resources across multiple invocations. When judiciously applied--either individually or in concert--these policies result in designs that are a better match for the realities of future nanometer technologies, since they reduce dynamic power, operating temperature, and relative static power. Furthermore, such designs are more tolerant of process variation, more likely to mask and less likely to latch and propagate combinational logic soft errors, and, due to their lower operating temperature and reduced activity rates, less prone to lifetime reliability problems. These benefits are realized with little to no detrimental effect on bandwidth or latency, and can result in surprising improvements in performance.<br\/><br\/>The research will have a specific and significant impact on the logic design and computer architecture communities, since it requires development and analysis of interesting and representative workloads, realization of state-of-the-art simulation and design infrastructure, and invention of powerful and useful evaluation methodologies. Since most of the development and research work will be conducted by graduate students, industry and academia will benefit from well-educated and trained employees as well as direct technology transfer when students graduate and begin employment elsewhere. Finally, the techniques and methods created will be applied towards the development of increasingly powerful and ubiquitous computing devices whose utility will have a substantial impact on the productivity and creativity of countless end users.","title":"Lazy Logic: Minimizing Activity to Reduce Processor Power Consumption","awardID":"0702272","effectiveDate":"2007-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["549841"],"PO":["559883"]},"125195":{"abstract":"The rise of chip multiprocessors (CMP) featuring tens to hundreds of processing units on a single chip promises to significantly boost the performance of desktop systems, rivaling the performance of yesterday's supercomputers. Supercomputing applications typically exploit a high degree of parallelism present in the application's computational tasks, which allows multiple processing units to work on solving the problem simultaneously to obtain a solution fast. <br\/>However, common software applications are not written for specialized supercomputer architectures and lack sufficient explicit exposure of parallelism to gain speedups from CMPs automatically. Therefore, a successful exploitation of CMPs requires a rethinking of design, coding, and debugging by application developers. Programming languages and program annotations that natively support parallel concepts will be increasingly more successful, as well as programming languages in which sequential code can be more easily converted into parallel code.<br\/><br\/>This research investigates the combination and enhancements of several successful approaches to expose more parallelism in program code automatically. Firstly, the investigators will merge flow- sensitive loop-variant variable detection and optimization with the chains of recurrences (CR) algebra together with the NLVI (nonlinear variable interval) test that is based on interval theory. This aims to reduce the number of false positives prohibiting parallelization of loops with array dependences. Secondly, techniques for speculative parallelization of loops will be enhanced with a new run-time dependence analysis algorithm based on the CR algebra, NLVI test, and the theory of axiomatic semantics. Thirdly, a set of program annotations will be introduced to support speculative parallelization. This benefits source-to-source compilers and programmers who can leverage these annotations to extract more parallelism from loops by exercising application-specific knowledge.","title":"Collaborative Research: Flow-Sensitive Program Analysis for Speculative Parallelization","awardID":"0702435","effectiveDate":"2007-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["538628","537233"],"PO":["565272"]},"139991":{"abstract":"In this project, an alternative approach to developing collaborative applications will be investigated. In this approach (called \"incremental specification and experimentation\"), the collaboration infrastructure provides only the most essential functionality by executing \"meta protocols.\" During the course of collaboration, new protocols are discovered and specified as they emerge. Both meta and emergent protocol snippets are plugged, unplugged, and replaced on the fly. The project includes: (1) domain modeling to find natural representations of meta and emergent protocols; (2) multi-user authoring tools to support end-user incremental specification of emergent protocols; (3) plug-n-play of protocols to support incremental experimentation; and (4) execution, monitoring and awareness mechanisms to provide the necessary context for coordination. This proposed research investigates incremental specification and experimentation of synchronous and asynchronous protocols in the same framework and attempts to develop more end-user oriented support. The results, when applied, are expected to improve the flexibility, and thus the usability and development\/deployment costs, of a variety of groupware applications. The development of a new graduate course on \"collaborative systems and models\" will give students concrete experience in experimentation with collaboration protocols. In undergraduate courses, students will work in teams using collaboration technologies to identify and analyze their collaborative activities and the underlying \"meta protocols\" implemented in those systems that they would like to change. Through a protocol modeling process, students will develop analytic skills and begin to understand the dynamic nature of cooperative work and the importance of flexibility in the design of collaboration infrastructures.","title":"CAREER: Incremental Specification and Experimentation of Collaboration Protocols and Infrastructure Support","awardID":"0813753","effectiveDate":"2007-05-31","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["416582"],"PO":["564456"]},"126472":{"abstract":"The collaborating Principal Investigators from the University of Pennsylvania, University of Colorado, University of Washington, and Columbia University are performing preliminary investigations into the feasibility of creating a treebank with multiple representations including both dependency structure and phrase structure.<br\/><br\/>Issues of interest include:<br\/><br\/> * To what extent can the conversion between dependency and phrase structure be automated, and to what extent is hand correction necessary after automatic conversion?<br\/><br\/> * How can we leverage experience from the creation of other treebanks?<br\/><br\/> To address these issues, the collaborating team is convening a working meeting of international scholars who have actively worked on treebanks representing many different formalisms and languages. Building on previous results in the conversion of phrase structure treebanks to dependency structures, tree adjoining grammar structures and combinatory categorical structures, a set of experiments is performed demonstrating the feasibiity of generating phrase structure from dependency structure. This requires well defined phrase structure and dependency structure guidelines for the language in question, currently limited to English. Other languages with tested guidelines for one of the two formalisms include Chinese, Korean, and Arabic (phrase structure) or Czech, German, Dutch, and Russian (dependency structure). The team is extending their conversion experiments to one of these languages as well, creating the necessary additional guidelines in the process. They are sharing a qualitative evaluation of our results with the colleagues at the workshop, and discussing the suitability of further experiments and alternative languages, as input into a resubmission of the CRI proposal.","title":"CRI:CRD Collaborative Research: General Techniques for Creating Treebanks with Multiple Representations: A Large-Scale Russian Application","awardID":"0708276","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["501444",335531],"PO":["565215"]},"122370":{"abstract":"Modern microprocessor designs are severely limited by wire delays within the chip. Like walking from one end of a building to the other, sending signals across a chip requires time and energy. Beyond a certain size, architects of buildings construct additional floors which can help reduce the distances traversed by the occupants. In a similar fashion, microprocessors of the future will be composed of multiple layers of circuitry arranged in a three-dimensional stack. This technology has the potential to significantly reduce the lengths of wires throughout the chip which can lead to an increase in performance with a simultaneous reduction in power consumption. The development of skyscrapers required the invention of new building architectures; likewise the 3D microprocessors of tomorrow will need new computer architectures to fully exploit this new technology. This project will research the impact of 3D integration technology on conventional single-core and multi-core processors as well as emergent \"many-core\" processors (many 10's or even 100's of cores on a chip). From these studies, new architectures specifically targeting a 3D technology will be developed. They key research challenges include answering how to best design the new architectures to extract performance and power benefits from the technology, how to cope with potential thermal problems that may arise from stacking multiple layers of highly active circuits, and how to build a compelling system using stacks of different types of devices (e.g., RF\/analog, DRAM, flash, CMOS).","title":"CAREER: Computer Architecture Foundations for 3D-Integrated High-Performance Microprocessors","awardID":"0643500","effectiveDate":"2007-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["332127"],"PO":["366560"]},"125153":{"abstract":"Modern high-end computer (HEC) architectures (comprised of tens-of-thousands of processors or more) have widened the performance gap between the computing power and the storage and I\/O performance that can support and sustain such calculations. With the petascale computing (1015 floating point operations per second) just over the horizon, the gap will be even more pronounced. This research is aimed at addressing both the limited bandwidth and the performance of today's I\/O storage systems. The main idea is to replace traditional rotary disks with a 'memory pool' - a massive grid of solid-state (flash) memories, and to introduce a new memory hierarchy model based on the improved access time and bandwidth of such grid. A memory pool embedded and distributed across the compute engine leverages the rapid progression of solid-state storage technology.<br\/><br\/>The I\/O-aware multithreaded program execution model takes full advantage of the tremendous bandwidth to the local memory pool, while tolerating the solid state storage access latency through proactive distributed pre-fetching and software-controlled memory caching. In particular, the responses to different patterns of solid-state storage communication requests (blocking and non-blocking, and of various block sizes), simulated solid-state storage module failures, extended shared memory responsiveness and management are examined. The effectiveness of the approach is observed through the most common set of third party I\/O benchmarks.<br\/><br\/>The intellectual merit of this research can be summarized as:<br\/>1) Development of a novel I\/O architecture model. for a class of high-end petascale computing systems. <br\/>2) Development of a corresponding RAS model<br\/>3) An experimental study on the new I\/O architecture and software model (in (1) and (2) above).","title":"A High Throughput Massive I\/O Storage Hierarchy for PETA-scale High-end Architectures","awardID":"0702244","effectiveDate":"2007-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["475422"],"PO":["565272"]},"125264":{"abstract":"Many applications including geographical information systems, scientific visualization and igh-dimensional databases include large data repositories up to terabytes in size. Although terabytes of storage space is now achievable, efficient retrieval is a challenging problem. This research involves novel schemes to distribute data among parallel disks for efficient retrieval including schemes using replication, efficient retrieval algorithms and self-organizing schemes that adapt to disk failures, disk additions and changing query patterns.<br\/><br\/>Declustering has attracted a lot of interest over the last few years and has applications in many areas including high-dimensional data management, geographical information systems and scientific visualization. Most of the declustering research have focused on spatial range queries and finding schemes with low worst-case additive error. This research investigates various aspects of declustering including novel declustering schemes, replicated declustering, heterogeneous declustering, adaptive declustering and declustering using multiple databases. The investigators approach every issue both theoretically and practically, study what is theoretically possible, what can be achieved in practice and try to close the gap between the two. The investigators study novel declustering schemes with solid theoretical foundations including number-theoretic declustering and design-theoretic declustering. Replication strategies for various types of queries including spatial range queries and arbitrary queries are studied. Retrieval algorithm for design-theoretic replication has linear complexity and guarantees worst-case retrieval cost. The investigators study tradeoffs in retrieval between complexity and retrieval cost and develop a suite of protocols for retrieval. This research involves adaptive declustering schemes that adapt to disk failures, disk additions and changing query types by moving buckets between disks during idle periods.","title":"High Throughput I\/O for Large Scale Data Repositories","awardID":"0702728","effectiveDate":"2007-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["397106"],"PO":["565272"]},"125221":{"abstract":"NSF 0702545<br\/>Weirich, Stephanie<br\/>U of Pennsylvania<br\/><br\/>A Practical Dependently-typed Functional Programming Language<br\/><br\/><br\/>Static type systems are a cost-effective form of lightweight program verification, providing a tractable way for programmers to express properties that can be mechanically checked. However, while helpful,<br\/>type systems used in practice verify relatively weak safety properties; they fall far short of program correctness. This inexpressiveness is partly by design---full verification is expensive, not fully automatable, and often unwarranted. Nevertheless, there are many situations where the ability to specify rich program properties would be useful. Among programming-language researchers, there is recent argument that techniques from dependent type theory provide a spectrum of possibilities between simple type safety and full verification<br\/><br\/>The goal of this project is to advance the design of practical dependently-typed functional programming languages. In particular, the research focuses on two approaches:<br\/> * To design a fully dependently-typed language, using an<br\/> effect-type system to ensure soundness.<br\/> * To employ a combination of global and local type inference so<br\/> that programming with dependent types may be done concisely.<br\/><br\/>The evaluation of these approaches is through the design of a prototype dependently-typed language. As well as the contributions listed above, this project aids the education of both graduate and undergraduate students.","title":"A Practical Dependently-Typed Functional Programming Language","awardID":"0702545","effectiveDate":"2007-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550615"],"PO":["564388"]},"126453":{"abstract":"The collaborating Principal Investigators from the University of Pennsylvania, University of Colorado, University of Washington, and Columbia University are performing preliminary investigations into the feasibility of creating a treebank with multiple representations including both dependency structure and phrase structure.<br\/><br\/>Issues of interest include:<br\/><br\/>* To what extent can the conversion between dependency and phrase structure be automated, and to what extent is hand correction necessary after automatic conversion?<br\/><br\/>* How can we leverage experience from the creation of other treebanks?<br\/><br\/>To address these issues, the collaborating team is convening a working meeting of international scholars who have actively worked on treebanks representing many different formalisms and languages. Building on previous results in the conversion of phrase structure treebanks to dependency structures, tree adjoining grammar structures and combinatory categorical structures, a set of experiments is performed demonstrating the feasibiity of generating phrase structure from dependency structure. This requires well defined phrase structure and dependency structure guidelines for the language in question, currently limited to English. Other languages with tested guidelines for one of the two formalisms include Chinese, Korean, and Arabic (phrase structure) or Czech, German, Dutch, and Russian (dependency structure). The team is extending their conversion experiments to one of these languages as well, creating the necessary additional guidelines in the process. They are sharing a qualitative evaluation of our results with the colleagues at the workshop, and discussing the suitability of further experiments and alternative languages, as input into a resubmission of the CRI proposal.","title":"CRI: CRD Collaborative Research: General Techniques for Creating Treebanks with Multiple Representations: A Large-Scale Russian Application","awardID":"0708183","effectiveDate":"2007-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["507533"],"PO":["565215"]},"126300":{"abstract":"The Fourth International School and Conference on Spintronics and Quantum Information Technology continues a tradition starting with Spintech I (Maui, 2001), and continuing with Spintech II (Brugge, 2003) and Spintech III (Osaka, 2005). Spintech IV will highlight both fundamental physical phenomena related to spin-dependent effects in semiconductors as well as advances in the development of new types of semiconductor spintronic materials and devices. This includes the current understanding of spin related<br\/>behavior in (magnetic) semiconductor and hybrid magnetic\/semiconductor structures and the prospects of exploiting these phenomena in future electronic, magnetic, or optical applications. The Spintech IV school will take place during the first half of the week to orient graduate students and new researchers to this emerging and exciting field. The Spintech IV conference will take place during the second half of the week and will be aimed at stimulating rapid progress in the fabrication, measurement, and theory of semiconductor spintronic systems. Participants will tackle the new challenges for materials and nanostructure designs that have emerged from measurements and calculations in this field, including electron and nuclear spin coherence times, electronic spin transport, measurement fidelity, and exchange interaction strength. <br\/><br\/>The requested funds will be used support approximately 22 Graduate Students for their attendance and participation in the Fourth International School and Conference on Spintronics and Quantum Information Technology in Maui, Hawaii","title":"WORKSHOP: The Fourth International School and Conference on Spintronics and Quantum Information Technology","awardID":"0707501","effectiveDate":"2007-05-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["544067"],"PO":["521045"]},"125167":{"abstract":"This project investigates multicore architectures, advanced design tools, and highly-parallel applications to exploit three-dimensional integrated circuits (3D ICs) for significantly higher performance and reduced power, compared to traditional two-dimensional multicore chips. The goal is to exploit and extend both dimensions into the next computational frontier: trillion Operations-per-Second (TeraOPS) performance with less than 10W of power dissipation. The project involves detailed tradeoff analyses of architectural alternatives, especially with respect to memory hierarchy and interconnection networks, in order to discover approaches that fully exploit the benefits of 3D integration. This analysis will be performed at both the architectural level and the physical design level, and tools will be developed to allow information and constraints to smoothly flow between these levels of abstraction, enabling new opportunities for collaboration between architects and chip designers.","title":"Architectures and Applications for Three-Dimensional Chip Multiprocessors","awardID":"0702294","effectiveDate":"2007-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[332138,332139],"PO":["559883"]},"122473":{"abstract":"Neurons represent information about relevant biological signals in patterns of electrical spiking activity. Statistical modeling and dynamical systems theory represent two distinct approaches to modeling the activity of neurons, which have largely been developed separately. However, the neural code is both stochastic and dynamic. This research and education program provides a link between modeling and data analysis by developing a robust framework for the statistical analysis of neural spiking data. This research is partially motivated by the increasing recognition that dynamics related to rhythmic and oscillatory brain signals play an important role in many cognitive states such as attention, memory, perception, and language, while abnormalities in these rhythms are associated with neurological diseases such as schizophrenia, Parkinson's, and Alzheimer's disease. <br\/><br\/>The fundamental objective of this research is to develop a framework for the analysis of neural spike train data that incorporates dynamical state models of neural and other biological signals. This objective will be achieved by a combination of theoretical development of dynamical models and mathematical algorithms, and the application of this theory to the analysis of recorded neural data at multiple scales, including individual neurons, small microcircuits, and larger networks across brain regions. The theoretical component of this research project will extend earlier results using point process methods to more accurately describe and more efficiently extract information from spike trains. New stochastic neural models that include dynamic state variables will be explored, and estimation algorithms based on point process likelihoods and posterior distributions will be derived. This framework will then be applied to problems of relating spiking activity to dynamic oscillatory signals in spiny stellate cells from the medial entorhinal cortex of the rat and in subthalamic nucleus in patients with Parkinson's disease. The theory will inform the applications by providing methods for neural estimation and model evaluation, while these applications will inform the theory by promoting the development of new physiologically relevant neural models.","title":"CAREER: Statistical Analysis of Neural Spiking Data","awardID":"0643995","effectiveDate":"2007-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["463933"],"PO":["564318"]},"126631":{"abstract":"The collaborating Principal Investigators from the University of Pennsylvania, University of Colorado, University of Washington, and Columbia University are performing preliminary investigations into the feasibility of creating a treebank with multiple representations including both dependency structure and phrase structure.<br\/><br\/>Issues of interest include:<br\/><br\/> * To what extent can the conversion between dependency and phrase structure be automated, and to what extent is hand correction necessary after automatic conversion?<br\/><br\/> * How can we leverage experience from the creation of other treebanks?<br\/><br\/> To address these issues, the collaborating team is convening a working meeting of international scholars who have actively worked on treebanks representing many different formalisms and languages. Building on previous results in the conversion of phrase structure treebanks to dependency structures, tree adjoining grammar structures and combinatory categorical structures, a set of experiments is performed demonstrating the feasibiity of generating phrase structure from dependency structure. This requires well defined phrase structure and dependency structure guidelines for the language in question, currently limited to English. Other languages with tested guidelines for one of the two formalisms include Chinese, Korean, and Arabic (phrase structure) or Czech, German, Dutch, and Russian (dependency structure). The team is extending their conversion experiments to one of these languages as well, creating the necessary additional guidelines in the process. They are sharing a qualitative evaluation of our results with the colleagues at the workshop, and discussing the suitability of further experiments and alternative languages, as input into a resubmission of the CRI proposal.","title":"CRI:CRD Collaborative Research: General Techniques for Creating Treebanks with Multiple Representations: A Large-Scale Russian Application","awardID":"0709167","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["511542"],"PO":["565215"]},"125201":{"abstract":"Advances in optical devices and interconnects have made this technology attractive for telecommunication and high performance systems. Specifically, large optical switches are commercially available but no practical technology is yet available for buffering or processing in the optical domain. As a result, electronic packet switching and wormhole-routing remain popular in spite of their higher costs, limited bandwidth, and increased message latencies.<br\/><br\/>In this project, the Investigators propose the use of circuit switching as an efficient alternative to packet and wormhole switching for achieving high bandwidth, low latency communication in high performance parallel systems. Specifically, by establishing direct pipes between communicating processes, routing and buffering at intermediate switches can be eliminated, end-to-end protocols can be simplified, and both software and hardware overheads associated with data movement can be minimized. However, the overhead of circuit establishment can be relatively large, and the benefits of circuit switching can only outweigh its drawbacks when communication exhibits locality, and when this locality is appropriately explored. Thus, a compiler-based approach is proposed to analyze communication locality in parallel application programs. This approach exposes the communication locality to an architecture, which explores it through a run-time system that manages circuit switched interconnections.<br\/><br\/>The new compiler technology for the detection and manipulation of communication patterns developed as part of this research enables parallelism in several domains outside of high performance supercomputers including chip multiprocessor systems and wireless systems. By correlating code structure with communication patterns, the proposed compiler technology also allows for the construction of tools that assist application developers in writing more efficient programs. Moreover, this project impacts several different areas of curriculum in computer science and engineering through the integration of research from this project into computer engineering curriculum and design projects. The project also promotes summer research activities related aimed at active recruitment and participation of women and under-represented minorities in higher education and research.","title":"Enabling Circuit Switching with Compiler and Run-time Analysis for High Performance Systems","awardID":"0702452","effectiveDate":"2007-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["533851","543497"],"PO":["559883"]},"127654":{"abstract":"This project is a travel grant to support travel by 25 US student researchers to the premier international conference on autonomous agents and multi-agent systems. The Sixth International Joint Conference on Autonomous Agents and Multi-agent Systems (AAMAS' 07) will be held in Honolulu, Hawaii between May 14 and May 18, 2007. In addition to the main technical program, the conference includes an energetic workshop program and several tutorials by leading agent researchers. There is also a co-located doctoral mentoring program. This is a significant event in the important field of multi-agent systems which will help shape the future of agent-based computing, and this funding ensures that the US is well represented by our graduate students.","title":"Autonomous Agents and Multiagent Systems - 07 (AAMAS-07) Student Travel Grant; Honululu, Hawaii; May 14-18, 2007","awardID":"0714176","effectiveDate":"2007-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["362927"],"PO":["565227"]},"125278":{"abstract":"A large body of existing, sequential applications must be migrated to multicore platforms with maximum transparency. To achieve this, techniques for automatic parallelization must be pushed to their limits, and current shared memory programming paradigms must be reconsidered with respect to their ease of use and ability to support a wide range of programming needs. The potential for subtle, hard-to-find bugs such as data race conditions needs to be minimized and strategies devised to ensure that remaining errors are caught at run time. <br\/><br\/>In this project, the investigator builds on top of existing compiler technology for automatic parallelization and OpenMP translation in order to facilitate application development for multicore systems. To do so, a novel translation strategy is developed for this hybrid sequential\/directive-based programming model that takes characteristics of multicore platforms into account as well as dealing with power conservation constraints. The approach minimizes the likelihood of erroneous code and relies on the compilation system to reduce synchronization, improve the load balance and otherwise adapt the program to the system. The investigator develops strategies to gather both coarse-grain and fine-grain performance information for selected program regions with low overheads. The project also creates techniques to exploit this information dynamically, and to adapt and optimize based on different levels of program representation. The ideas will be implemented and deployed via an infrastructure that combines a robust, open source compiler, its run time system and the corresponding dynamic compiler into a cohesive environment to support the translation and execution of sequential and directive-based programs.","title":"Scalable Performance and Power-Aware Hybrid Compilation System for Multicores","awardID":"0702775","effectiveDate":"2007-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["506602"],"PO":["565272"]}}