{"184371":{"abstract":"To encourage more US-based participation in geo-spatial research, this support will enable 20 promising graduate and undergraduate students in computer science the necessary financial support to attend one of the field's premier forums, the International Symposium on Spatial and Temporal Databases (SSTD), to be held this year in Minneapolis August 24-26. The biennial event showcases cutting-edge research spanning a vast array of topics and attracts researchers, developers, and end users around the world from academia, industry, and government. The engagement and subsequent education of the next generation of scientists and engineers working with spatial and temporal data will have a significant impact on the lives of ordinary people everywhere. In addition to improvements in vehicular and various forms of public transportation, security mechanisms featuring unprecedented sophistication will be made possible by enhanced intelligence gathering via spatial analysis of satellite imagery, and macroscopic ecological health will be more accurately modeled with more informative uses of spatio-temporal data. Promoting this conference participation by U.S. based graduate and undergraduate students is important for helping the United States to maintain a major foothold in the exciting products, services and ideas to come out of the field of spatial and temporal data.","title":"Travel Grant for International Symposium on Spatial and Temporal Databases (SSTD), 2011","awardID":"1133452","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518156","550903","551857"],"PO":["565136"]},"185053":{"abstract":"More than 100 of the world's brightest and most motivated high school students will gather in Pittsburgh in July 2011 for the 9th International Linguistics Olympiad. Unlike math and science Olympiads, which focus on material students have already mastered, linguistics Olympiads introduce new material through logic puzzles in languages unfamiliar to the students. In the course of solving a puzzle, the students can discover something about the grammar or sounds of a language, its conceptual system, its culture, or its historical relationship to other languages. In addition to fostering insight into human linguistic and cultural diversity, this competition fosters meta-linguistic reasoning that is essential for computer science, language technologies, and indeed any career involving analytical problem-solving skills and the ability to present a logical argument supported by data. Because it has been the tradition of linguistics Olympiads to assign half of the score for the written explanation of the answer, the contests also encourage the ability to clearly present a hypothesis and explain how it is supported by the data.<br\/><br\/>More information and past contest puzzles can be found at: http:\/\/www.ioling.org and http:\/\/www.naclo.cs.cmu.edu.","title":"The International Linguistics Olympiad: Preparing High School Students for the Study of Human Language and Computation","awardID":"1137828","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[496511],"PO":["564500"]},"177166":{"abstract":"Realistic image synthesis techniques from computer graphics enable the use of simulation in a wide variety of important fields including architecture, industrial design and communication, military, medical, and emergency training, cultural heritage preservation, film production, and gaming. Realistic modeling of material appearance is an essential component of the image synthesis process. Current approaches to material modeling include analytical modeling, numerical simulation, and image-based capture. Each approach has distinct advantages and limitations, and different ranges of applicability. The lack of unity makes material modeling difficult and has limited the useful application of computer graphics image synthesis. This transformative research will change the way materials are modeled in computer graphics systems. Rather than using disparate models as at present, this project will unify these approaches into a common physical and perceptual framework that will serve as the basis for a rich set of tools for material modeling that are physically accurate, phenomenologically expressive, computationally efficient, and easy to use. This work should enable the use of computer-aided material design methods in a wide range of economically and culturally important applications. Creating this framework will involve three subprojects.<br\/><br\/>Development of a material simulation testbed: In this subproject a suite of tools for material simulation will be developed that includes both Monte Carlo and deterministic algorithms. Different classes of materials (paints, metals, textiles) will be modeled, and different numerical methods will be tested and compared. The resulting simulation tools and a database of the simulated materials will be distributed.<br\/><br\/>Unification of analytical, simulation, and image-based capture material modeling methods: In this subproject the analytical models that represent general classes of materials will be unified with simulation and image-based capture data that represent specific material instances. In the first part of this subproject simulation and capture data will be fit with a range of analytical models, considering both individual materials and \"families\" of materials generated by progressively changing the parameters of the simulation models. In the second part of this project methods for inferring the microstructures of materials measured using image-based capture methods will be developed. The approach will be to identify the class of a material and then vary the parameters of an appropriate simulation model to best reproduce the captured data. The results of this subproject will be expressive and efficient analytical material models that are physically grounded because they are based on captured data and rigorous simulations.<br\/><br\/>Development of perceptually-based material design tools: An important criterion for material modeling is usability. Material designers need to be able to easily specify and visualize material appearance properties. This requires consideration of the human factors in material modeling. In this subproject a series of psychophysical experiments on material perception will be conducted and the results will be used to derive perceptually-based material models with meaningful parameters. How image properties affect the visual fidelity of rendered materials will also be investigated. These findings will then be used to develop effective and easy-to-use interfaces for computer-aided material design.<br\/><br\/>Broader Impacts: Better methods for material modeling and rendering will lead to improved capability and productivity in fields such as architecture, industrial design and communication, training, cultural heritage, and entertainment. The project will build a material appearance community that stretches across academic and commercial boundaries to include computer graphics, computer vision and human vision researchers along with a range of industrial collaborators, and which focuses on developing effective solutions to real-world problems. The research will engage and train groups of students at 3 universities for scientific\/technical careers that require working in interdisciplinary teams and partnering with coworkers in remote locations.","title":"G&V: Medium: Collaborative Research: A Unified Approach to Material Appearance Modeling","awardID":"1064427","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[474977],"PO":["565227"]},"191070":{"abstract":"Abstract ? NSF 0917265<br\/><br\/>The two key characteristics of wireless communications that greatly impact system design and performance are randomly-varying channel conditions and limited energy resources. In wireless systems, the power of the received signal randomly fluctuates over time and distance due to multipath fading, mobility, and changing environment. Moreover, mobile wireless systems can only be equipped with limited energy resources, and hence energy efficient operation is a crucial requirement in most applications. In many wireless communication systems, in addition to energy-efficient operation, satisfying certain quality-of-service (QoS) requirements is of paramount importance in providing acceptable performance and quality. For instance, in voice over IP (VoIP), interactive-video (e.g., videoconferencing), and streaming-video applications in wireless systems, latency is a key QoS metric. Therefore, the central design challenge in next-generation wireless systems, which has the vision of providing communications anytime, anywhere in a reliable and robust fashion, is to provide the best performance levels while making efficient use of energy resources and satisfying certain QoS constraints (e.g., latency, packet loss, buffer violation probability). <br\/><br\/>The overall goal of this research is to identify the fundamental limits on the energy efficiency of wireless systems operating under queueing constraints through a unified analysis of information- and queueing-theoretic aspects. The investigators will employ a novel approach to analyze the energy efficiency by combining information-theoretic tools, such as minimum bit energy and wideband slope, with queueing-theoretic tools, such as effective bandwidth and effective capacity. This project seeks to establish a strong analytical framework by rigorously establishing fundamental limits on the energy efficiency under buffer constraints, and also at the same time has the goal of conducting experiments with a testbed and making comparisons with the theoretical findings.","title":"CIF: Small: Energy Efficiency in Wireless Communications under Queueing Constraints","awardID":"1206288","effectiveDate":"2011-06-30","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":[512215],"PO":["564924"]},"175374":{"abstract":"Quasiconformal geometry has showed its power and flexibility in complex analysis, differential equations, function theory, and topology. Computational quasiconformal geometry focuses on algorithmic study of quasiconformal geometry theory, which links very pure areas of abstract mathematics to concrete engineering applications. This project addresses a number of fundamental engineering problems where quasiconformal geometry can provide a key insight, including building a variational framework of computing the optimal diffeomorphism between surfaces with general topologies, building a theoretically well sound framework to model shape space of surfaces, and building anisotropic models which are widely observed in various areas including wireless sensor networks, computer graphics, and solid mechanics. Expected results include the exploration of computational theorems, new models, and novel geometric algorithms with provable performance guarantee.<br\/><br\/>This interdisciplinary project provides the bridge between quasiconformal geometry and applications in broad engineering fields by identifying important geometric problems in computer graphics, computer vision, geometric modeling, and wireless sensor networks as well as supplying computational theorems and efficient algorithmic solutions based on quasiconformal geometry theory. It is expected that the exploration will reveal key insights of fundamental problems in those fields.","title":"CAREER: Theorem, Algorithm, and Applications of Computational Quasiconformal Geometry","awardID":"1054996","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["551059"],"PO":["565157"]},"186033":{"abstract":"","title":"Computing Education for the 21st Century (CE21) Program Evaluation Feasibility Study","awardID":"1143598","effectiveDate":"2011-06-24","expirationDate":"2014-05-16","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["564427"],"PO":["564428"]},"185352":{"abstract":"This project will create a digital audio archive that will enable<br\/>scientists in several fields to approach novel research issues in speech and language<br\/>studies, issues in group decision-making, and issues at the leading edge of<br\/>human communication scholarship. The Supreme Court of the United States<br\/>(SCOTUS) has been recording its public proceedings since 3 October 1955.<br\/>These recordings - now in the National Archives - span nearly five decades<br\/>and consist principally of oral arguments in which justices and attorneys<br\/>engage in various forms of persuasion and communication between bench and<br\/>bar and, obliquely, among the justices themselves. The arguments have been<br\/>transcribed professionally across the entire period, creating a matchless<br\/>collection of audio materials coupled with highly accurate transcripts. The<br\/>audio - along with other activities captured on audio such as the<br\/>announcement of opinions - offers a unique opportunity for researchers<br\/>across a wide spectrum of disciplines to engage in novel and transforming<br\/>research projects that were once thought beyond the reach of investigators.<br\/><br\/>The chief result of this work will be a complete and continuing archive of<br\/>more than six thousand hours of SCOTUS audio. It will provide synchronized<br\/>(i.e., time-coded) transcripts of the collection, identify and tag<br\/>individual speakers, build new mark-up tools for these new domains, and<br\/>share the corpus with researchers and faculty. The result of this<br\/>interaction among political scientists, legal scholars, linguists, and<br\/>computer scientists will yield: new knowledge in the modeling of<br\/>multi-party discussions with complex goals, novel strategies in small group decision<br\/>process analysis, and path-breaking approaches to extended collaborative<br\/>commentary addressing the dynamics of human communication.<br\/><br\/>The SCOTUS archive will be maintained as a shared public resource to<br\/>enhance study and understanding of the Supreme Court of the United States. It will<br\/>be available to anyone with World Wide Web access. Based on past<br\/>experience, principal audiences include: researchers across diverse domains, teachers<br\/>and students, lawyers and litigants, and the visually- and<br\/>hearing-impaired.<br\/><br\/>Today, more than a million unique users access selected SCOTUS materials<br\/>each month. With a complete and updated SCOTUS archive and improved ability<br\/>to query and search, the number of users should expand substantially.<br\/><br\/>By exploiting common interest and beneficial interactions among diverse<br\/>research communities, this project will create a vast collection of digital<br\/>objects. Working with partners experienced in data-sharing, the effort aims<br\/>at revolutionizing the ability to collaborate with physically distributed<br\/>teams of researchers and their students.","title":"ITR-SCOTUS: A Resource for Collaborative Research in Speech Technology, Linguistics, Decision Processes, and the Law","awardID":"1139735","effectiveDate":"2011-06-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[497354],"PO":["565136"]},"185132":{"abstract":"25th IEEE International Parallel & Distributed Processing Symposium (IPDPS takes place May 16-20, 2011 in Anchorage (Alaska) USA. <br\/>IPDPS is an international forum for engineers and scientists from around the world to present latest research findings in all aspects of parallel computation. In addition to technical sessions of submitted paper presentations, the meeting offers workshops, tutorials, and commercial presentations & exhibits.<br\/>IPDPS seeks to increase student participation in symposium and the field.<br\/>It is proposed to offer up to 20 NSF-sponsored student travel for a total budget of $20,000. Applications were solicited via email mailing lists, personal contacts, and the conference web site. The selection process will consider the applicant?s level of participation in IPDPS, followed by how closely the student?s research interests match areas covered by IPDPS.","title":"NSF\/TCPP Student Travel Awards for IPDPS-2011","awardID":"1138281","effectiveDate":"2011-06-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":["526127"],"PO":["565272"]},"175211":{"abstract":"This project develops nonlinear statistical models and classification procedures for time-varying shape and investigates their application to biomedical image analysis problems. In biology and medicine it is often critical to understand processes that change the shape of anatomy. For example, a neuroscientist studying the development of the infant brain would be interested in how neurodevelopment is different in healthy children versus those with Autism. An evolutionary biologist studying how a species has evolved to adapt to its environment would be interested in studying changes in the shape of bones found in the fossil record. The challenge in this modeling problem is that shape and shape variations are highly nonlinear and high-dimensional, and standard linear statistics cannot be applied. Therefore, the ability to model and understand changes in shape depends on the development of new regression models for data in nonlinear spaces. The research activities of this project include: (1) developing statistical models for dealing with time-varying shape using least-squares principles in shape manifolds, (2) investigating new classification methods for shape sequences, and (3) validating the methodology using synthetic data and testing its efficacy for neuroimaging applications in Alzheimer's disease and Autism. In addition to the significant impact to computer vision, biology, and medicine, this project is combining differential geometry, statistics, and computing within the undergraduate and graduate computer science curriculum.","title":"CAREER: Statistical Models and Classification of Time-Varying Shape","awardID":"1054057","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["533314"],"PO":["564316"]},"175332":{"abstract":"Computational topology is an exciting new area, emerging at the intersection of computer science and mathematics. The most simple topological setting is the plane (or two-dimensional Euclidean space). Developing fast algorithms for planar objects is vital for many applications, including road networks, integrated circuit design, and motion planning. Generalizing these planar algorithms so that they will run quickly in other topological settings allows one to extend to an even larger domain of applications, including shape modeling in graphics, medical imaging, finding low-dimensional spans for high-dimensional data in statistical analysis, shape description and detection, computing similarity measures between curves or surfaces, and flow and routing problems in graphs.<br\/><br\/>The PI will develop faster algorithms for fundamental problems in graphs on surfaces and in minor free graphs, which are both natural generalizations of planar graphs that provide extra topological structure. More specifically, the PI will work on problems such as finding shortest paths and cycles on surfaces, computing maximum flows in surfaces and minor free flows, and computing similarity measures between curves. In addition to designing faster algorithms, the PI will also implement the first code for several of these algorithms for practical settings, particularly in the area of computing similarity measures between curves on non-planar surfaces. Much of this work is at the intersection of math and computer science, and so will lead to interdisciplinary collaboration between the PI's research group and other researchers in both areas.<br\/><br\/>Collaboration and interdisciplinary work also provide the framework for advances in computer science education and community outreach. The PI's active interdisciplinary research group will provide an ideal forum to mentor undergraduate students, particularly those from underrepresented groups. Undergraduate research will in turn draw talented students to graduate school in computer science. In addition, the PI has redesigned several of the computer science courses to incorporate a large active learning component. The PI will continue this research on pedagogical methods for active learning and its effect on the recruitment and retention of students in computer science.","title":"CAREER: Generalizing Planar Algorithms","awardID":"1054779","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["550652"],"PO":["565157"]},"185078":{"abstract":"This project will provide funding to assist US-based graduate students to attend the 2011 USENIX Annual Technical Conference (ATC). In addition to attending the conference events, students receiving assistance will serve as scribes for the conference technical sessions to write summaries for a later issue of ;login: magazine, will be required to attend the Student Birds-of-a-Feather session to interact with senior members of the research community specifically interested in meeting students in a casual and informal atmosphere, and will be strongly encouraged to present posters and works-in-progress as part of the selection process. Participation in USENIX ATC?11 is a valuable and important part of the graduate school experience. It provides students with the opportunity to interact with more senior researchers in the field, and exposes students to leading work in their research area. The USENIX conference creates a bridge between academic and corporate researchers, and offers a unique, vendor neutral forum for students to gain experience and relationships with an important peer group. It is expected this experience will be very important to their ongoing education, and future career. This project will enable the participation of students who would otherwise be unable to attend the conference.","title":"Student Travel Support for the 2011 USENIX Annual Technical Conference","awardID":"1137962","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["508477"],"PO":["535244"]},"179644":{"abstract":"","title":"EAGER: Models and Techniques for Enterprise Network Security Metrics","awardID":"1107657","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[481493],"PO":["565327"]},"177158":{"abstract":"Realistic image synthesis techniques from computer graphics enable the use of simulation in a wide variety of important fields including architecture, industrial design and communication, military, medical, and emergency training, cultural heritage preservation, film production, and gaming. Realistic modeling of material appearance is an essential component of the image synthesis process. Current approaches to material modeling include analytical modeling, numerical simulation, and image-based capture. Each approach has distinct advantages and limitations, and different ranges of applicability. The lack of unity makes material modeling difficult and has limited the useful application of computer graphics image synthesis. This transformative research will change the way materials are modeled in computer graphics systems. Rather than using disparate models as at present, this project will unify these approaches into a common physical and perceptual framework that will serve as the basis for a rich set of tools for material modeling that are physically accurate, phenomenologically expressive, computationally efficient, and easy to use. This work should enable the use of computer-aided material design methods in a wide range of economically and culturally important applications. Creating this framework will involve three subprojects.<br\/><br\/>Development of a material simulation testbed: In this subproject a suite of tools for material simulation will be developed that includes both Monte Carlo and deterministic algorithms. Different classes of materials (paints, metals, textiles) will be modeled, and different numerical methods will be tested and compared. The resulting simulation tools and a database of the simulated materials will be distributed.<br\/><br\/>Unification of analytical, simulation, and image-based capture material modeling methods: In this subproject the analytical models that represent general classes of materials will be unified with simulation and image-based capture data that represent specific material instances. In the first part of this subproject simulation and capture data will be fit with a range of analytical models, considering both individual materials and \"families\" of materials generated by progressively changing the parameters of the simulation models. In the second part of this project methods for inferring the microstructures of materials measured using image-based capture methods will be developed. The approach will be to identify the class of a material and then vary the parameters of an appropriate simulation model to best reproduce the captured data. The results of this subproject will be expressive and efficient analytical material models that are physically grounded because they are based on captured data and rigorous simulations.<br\/><br\/>Development of perceptually-based material design tools: An important criterion for material modeling is usability. Material designers need to be able to easily specify and visualize material appearance properties. This requires consideration of the human factors in material modeling. In this subproject a series of psychophysical experiments on material perception will be conducted and the results will be used to derive perceptually-based material models with meaningful parameters. How image properties affect the visual fidelity of rendered materials will also be investigated. These findings will then be used to develop effective and easy-to-use interfaces for computer-aided material design.<br\/><br\/>Broader Impacts: Better methods for material modeling and rendering will lead to improved capability and productivity in fields such as architecture, industrial design and communication, training, cultural heritage, and entertainment. The project will build a material appearance community that stretches across academic and commercial boundaries to include computer graphics, computer vision and human vision researchers along with a range of industrial collaborators, and which focuses on developing effective solutions to real-world problems. The research will engage and train groups of students at 3 universities for scientific\/technical careers that require working in interdisciplinary teams and partnering with coworkers in remote locations.","title":"G&V: Medium: Collaborative Research: A Unified Approach to Material Appearance Modeling","awardID":"1064410","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[474957],"PO":["565227"]},"185222":{"abstract":"This project involves supporting students to attend the IEEE Communications Society Conference on Sensor, Mesh, and Ad Hoc Communications and Networks (SECON 2011) to be held in Salt Lake City, Utah in June 2011. SECON is a premier conference in the areas of sensor, ad hoc, and mesh networking, serving as a meeting point of researchers from academia and industry, as well as practitioners in diverse fields of wireless communications and networking. This project supports travel to the conference for US based Ph.D. students who might not otherwise be able to attend for financial reasons. Students will be exposed to the conference, a technical forum that is critical for their professional maturity and development. Students will also be involved in various activities and work as volunteers to support these activities, increasing their level of involvement and connection to the conference and the research community. The recipients will be chosen based on an open competition and preference will be given to students from underrepresented groups.","title":"IEEE Communications Society Conference on Sensor, Mesh, and Ad Hoc Communications and Networks (SECON) 2011: Student Travel Awards","awardID":"1138789","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["564847"],"PO":["551712"]},"175223":{"abstract":"Pictures convey a visual description of the world directly to their viewers. Computer vision strives to design algorithms to extract the underlying world state captured in the camera's eye, with an overarching goal of general computational image understanding. To date much vision research has approached image understanding by focusing on object detection, only one perspective on the image understanding problem. This project looks at an additional, complimentary way to collect information about the visual world -- by directly analyzing the enormous amount of visually descriptive text on the web to reveal what information is useful to attach to, and extract from pictures. This project presents a comprehensive research program geared toward modeling and exploiting the complimentary nature of words and pictures. One main goal is studying the connection between text and images to learn about depiction -- communication of meaning through pictures. This goal is addressed through 3 broad challenges: 1) Developing a richer vocabulary to describe the information provided by depiction. 2) Developing image representations that can visually capture this more nuanced vocabulary. 3) Constructing a comprehensive joint words and pictures framework. <br\/><br\/>This project has direct significance to many concrete tasks that access images on the internet including: image search, browsing, and organization, as well as commercial applications such as product search, and societally important applications such as web assistance for the blind. Additionally, outputs of this project, including progress toward a natural vocabulary and structure for visual description, have great potential for cross-cutting impact in both the computer vision and natural language communities.","title":"CAREER: Toward a General Framework for Words and Pictures","awardID":"1054133","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["511442"],"PO":["564316"]},"175355":{"abstract":"The Internet has led to the availability of novel sources of data on the preferences, behaviors, and beliefs of massive communities of users. <br\/>Both researchers and engineers are eager to aggregate and interpret this data. However, websites sometimes fail to incentivize high-quality contributions, leading to variable quality data. Furthermore, assumptions made by traditional theories of learning break down in these settings.<br\/><br\/>This project seeks to create foundational machine learning models and algorithms to address and explain the issues that arise when aggregating local beliefs across large communities, and to advance the state-of-the-art understanding of how to motivate high quality contributions. The research can be split into three directions:<br\/><br\/>1. Developing mathematical foundations and algorithms for learning from community-labeled data. This direction involves developing learning models for data from disparate (potentially self-interested or<br\/>malicious) sources and using insight from these models to design efficient learning algorithms.<br\/><br\/>2. Understanding and designing better incentives for crowdsourcing. This direction involves modeling crowdsourcing contributions to determine which features to include in systems to encourage the highest quality contributions.<br\/><br\/>3. Introducing novel economically-motivated mechanisms for opinion aggregation. This involves formalizing the properties a prediction market should satisfy and making use of ideas from machine learning and optimization to derive tractable market mechanisms satisfying these properties.<br\/><br\/>This research will have clear impact on industry, especially for web-based crowdsourcing. The PI will pursue her long-term goal of attracting and retaining women in computer science via her involvement in workshops and mentoring programs. Results will be disseminated at http:\/\/www.cs.ucla.edu\/~jenn\/projects\/CAREER.html.","title":"CAREER: Learning- and Incentives-Based Techniques for Aggregating Community-Generated Data","awardID":"1054911","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[470197],"PO":["563751"]},"186036":{"abstract":"Since power consumption has become a major constraint for the further throughput improvement of chip multiprocessors (CMPs), a key challenge is to optimize the performance of a CMP within a power budget limited by the CMP's cooling, packaging, and power supply capacities. This project aims to develop a coordinated power control framework for CMPs. The proposed framework has the following novel features. 1) It can dynamically and explicitly shift power among the CPU cores and other components in a CMP based on measured workload characteristics for optimized CMP performance within a power budget. 2) It adopts an online model estimator to dynamically measure the performance contributed by each component and then partitions the chip-level power budget among the components. 3) It can achieve fair or differentiated cache sharing under the impacts of dynamic cache resizing used in CMP power control. 4) It also coordinates components within a core for core-level power control and coordinates CMPs with main memory and disks for optimized system performance. 5) Our framework is based on a control-theoretic foundation for systematically and rigorously developing power control strategies. While basic control theory has already shown great promise in microprocessor power management, an important feature of our framework is that it relies on advanced optimal control theory to coordinate multiple control and optimization loops in different layers of a CMP in a holistic way for optimized performance and guaranteed stability. <br\/><br\/>In addition to integrating research with education and outreach programs, the outcome of this research is expected to provide effective mechanism and a rich set of tools fer performance and power optimization in CMPs.","title":"SHF: Small: Coordinated Performance Optimization within a Power Budget for Chip Multiprocessors","awardID":"1143605","effectiveDate":"2011-06-01","expirationDate":"2014-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["554423"],"PO":["366560"]},"177225":{"abstract":"This award focuses on problems in computational complexity theory, with the goal of clarifying the power and limitations of various important classes of algorithms (known as \"complexity classes\"). Complexity classes provide the best tools currently available for understanding the computational complexity of real-world computational problems. Part of the award supports a collaboration with researchers at the Czech Academy of Sciences.<br\/><br\/>Kolmogorov complexity measures the amount of \"information\" in a finite string, and also provides a mathematical definition of what it means for a string to be \"random\". Although the Kolmogorov complexity of an arbitrary string cannot be computed, there are strong connections between the (non-computable) notion of randomness and questions about the circuit size required to compute various functions. This award will support an investigation into recent indications that computational complexity classes can be characterized in terms of efficient access to the Kolmogorov complexity function, thus possibly opening a new portal for techniques from the theory of computability and algorithmic randomness to be applied in complexity theory. The award will also support an investigation into the limits of computation by arithmetic circuits. (In an arithmetic circuit, data can only be manipulated by arithmetic operations such as addition and multiplication; operations that directly access the individual bits of numeric data are not supported.)<br\/><br\/>The long-term goals of research in computational complexity, if finally achieved, will have profound impact on the society---for instance, by providing firm mathematical underpinnings to public-key cryptography, which currently rests upon many unproven conjectures. This research activity offers concrete plans for incremental progress toward this long-range goal. The award also supports graduate education. As such, it will assist with training new researchers and educators. The research results will be broadly disseminated, not only through journal publication but also through survey articles in various venues.","title":"AF: Medium: Computational Complexity Theory and Circuit Complexity","awardID":"1064785","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[475121],"PO":["565157"]},"177346":{"abstract":"This research involves collaboration among investigators at four institutions. Recent advances in motor behavior have uncovered structure in the supporting neural control architecture, including distinctions between feed-forward and feedback control functions and learning. While the neural code has not yet been cracked, much is now known about how its foundations for sensorimotor control differ from those of even the most modern computer-based algorithms. For example, neural function must accommodate transmission and processing delays, so feedback control is subservient to feed-forward and anticipatory control. The nervous system produces exquisite, constantly and widely available predictions concerning body and environment interactions. These predictive models (also called internal models) are constructed by learning the invariants in the mapping from motor commands to sensory feedback (and inverses thereof). The PIs have developed a unique approach based upon readings from a scalp array of EEG electrodes for the construction of algorithms (decoders) which predict motor behavior (control signals) as a weighted sum of the EEG data from all electrodes at multiple time lags. The team has demonstrated two-axis control over a screen cursor using only 10 minutes of EEG and motion training data, a feat far surpassing any brain-computer interface (BCI) available to date. In the current project, the team will build upon this prior work to design and validate noninvasive neural decoders that generate agile control in upper limb prosthetics. To this end, they will investigate neural correlates of brain adaptation to multiple sources of feedback using EEG and functional near infrared spectroscopy (fNIR). An important challenge will be to provide sensory feedback appropriate to contact tasks performed with a prosthesis. Existing BCIs and neuro-prosthetic devices rely at best on vibrotactile feedback and often only on visual feedback. The PIs will add haptic and proprioceptive feedback in concert with a novel adaptation of vibrotactile, skin stretch, and arm squeeze technologies in the prosthesis interface, to provide intuitive control over contact tasks and to strengthen the motor imagery whose neural correlates are processed by the EEG decoder. To establish baseline measures, the team will compare prosthetic performance under direct brain control to myoelectric prosthetic control and direct manual control. Experiments will be performed involving both able-bodied individuals and amputees, in which real-time decoding (EEG) and analysis (EEG\/fNIR) of sensorimotor control and cognitive load will be combined. <br\/><br\/>Broader Impacts: This research will revolutionize the control and interface of upper limb prosthetics. The work will lead to a better understanding of the role of sensory feedback in brain-computer interfaces and will lay the foundation for restoration of motor and sensory function for amputees and individuals with neurological disease. The project will create a unique interdisciplinary environment enabling education, training, co-advising and exchange of graduate students, course development, and involvement of undergraduates in research. The PIs will also participate in outreach activities on their various campuses, targeting underrepresented groups in science and engineering.","title":"HCC: Medium: Collaborative Research: Improved Control and Sensory Feedback for Neuroprosthetics","awardID":"1065497","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["532891"],"PO":["565227"]},"188016":{"abstract":"Science is becoming a data management problem. Advancements in sensing and computational modeling have dramatically increased data acquisition rates, establishing queries -- \"in ferro\" experiments -- as an essential method of scientific discovery alongside in situ, in vitro, and in silico experiments. Unfortunately, the infrastructure to design and conduct in ferro experiments over massive datasets has not kept pace with our collective ability to create these datasets. Computational modelers, who have long enjoyed the benefits of a research focus on creating larger and faster CPU farms, now face terabytes of simulation results in which deep insights into the health of the planet remain locked. The key is seamlessness: to interactively analyze these data, quantitatively and qualitatively, without regard to boundaries manifesting from time and space domains, physical location, hardware architecture, storage medium, or file organization.<br\/><br\/>This project is building a new infrastructure that uses the CluE platform to allow ad hoc, longitudinal query and visualization of massive ocean simulation results at interactive speeds. This infrastructure leverages and extends two existing systems: GridFields, a library for general and efficient manipulation of simulation results; and VisTrails, a comprehensive platform for scientific workflow, collaboration, visualization, and provenance. By cloud-enabling these systems, the proposed infrastructure provides: (1) seamless access to the 10 year history of simulation results at interactive speeds; (2) an architecture and execution strategy that exploit both remote cloud and local desktop resources; and (3) a provenance capture and manipulation platform that enables repeatability, code reuse, forensics, and collaboration.","title":"Where the Ocean Meets the Cloud: Ad Hoc Longitudinal Analysis of Massive Mesh Data","awardID":"1153728","effectiveDate":"2011-06-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7782","name":"CLUSTER EXPLORATORY (CLuE)"}}],"PIcoPI":["521991"],"PO":["543481"]},"177159":{"abstract":"Realistic image synthesis techniques from computer graphics enable the use of simulation in a wide variety of important fields including architecture, industrial design and communication, military, medical, and emergency training, cultural heritage preservation, film production, and gaming. Realistic modeling of material appearance is an essential component of the image synthesis process. Current approaches to material modeling include analytical modeling, numerical simulation, and image-based capture. Each approach has distinct advantages and limitations, and different ranges of applicability. The lack of unity makes material modeling difficult and has limited the useful application of computer graphics image synthesis. This transformative research will change the way materials are modeled in computer graphics systems. Rather than using disparate models as at present, this project will unify these approaches into a common physical and perceptual framework that will serve as the basis for a rich set of tools for material modeling that are physically accurate, phenomenologically expressive, computationally efficient, and easy to use. This work should enable the use of computer-aided material design methods in a wide range of economically and culturally important applications. Creating this framework will involve three subprojects.<br\/><br\/>Development of a material simulation testbed: In this subproject a suite of tools for material simulation will be developed that includes both Monte Carlo and deterministic algorithms. Different classes of materials (paints, metals, textiles) will be modeled, and different numerical methods will be tested and compared. The resulting simulation tools and a database of the simulated materials will be distributed.<br\/><br\/>Unification of analytical, simulation, and image-based capture material modeling methods: In this subproject the analytical models that represent general classes of materials will be unified with simulation and image-based capture data that represent specific material instances. In the first part of this subproject simulation and capture data will be fit with a range of analytical models, considering both individual materials and \"families\" of materials generated by progressively changing the parameters of the simulation models. In the second part of this project methods for inferring the microstructures of materials measured using image-based capture methods will be developed. The approach will be to identify the class of a material and then vary the parameters of an appropriate simulation model to best reproduce the captured data. The results of this subproject will be expressive and efficient analytical material models that are physically grounded because they are based on captured data and rigorous simulations.<br\/><br\/>Development of perceptually-based material design tools: An important criterion for material modeling is usability. Material designers need to be able to easily specify and visualize material appearance properties. This requires consideration of the human factors in material modeling. In this subproject a series of psychophysical experiments on material perception will be conducted and the results will be used to derive perceptually-based material models with meaningful parameters. How image properties affect the visual fidelity of rendered materials will also be investigated. These findings will then be used to develop effective and easy-to-use interfaces for computer-aided material design.<br\/><br\/>Broader Impacts: Better methods for material modeling and rendering will lead to improved capability and productivity in fields such as architecture, industrial design and communication, training, cultural heritage, and entertainment. The project will build a material appearance community that stretches across academic and commercial boundaries to include computer graphics, computer vision and human vision researchers along with a range of industrial collaborators, and which focuses on developing effective solutions to real-world problems. The research will engage and train groups of students at 3 universities for scientific\/technical careers that require working in interdisciplinary teams and partnering with coworkers in remote locations.","title":"G&V: Medium: Collaborative Research: A Unified Approach to Material Appearance Modeling","awardID":"1064412","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["541919"],"PO":["565227"]},"184661":{"abstract":"This grant provides travel and subsistence to students so that they can attend the Symposium on Programming Language Design and Implementation (PLDI), which this year is being held San Jose, California in June 2011 as part of the Federated Computing Research Conference (FCRC). PLDI is a top conference in the field of programming language and compiler technology. Attending enables students to hear the latest results in the field, meet with other researchers, and build community with the next generation of researchers.","title":"Student Travel Support for the 2011 ACM SIGPLAN PLDI Conference","awardID":"1135751","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["542054"],"PO":["564388"]},"177259":{"abstract":"Abstract - Machiraju, Rangarajan, and Thompson<br\/><br\/>As computer power continues to increase, the complexity of simulations also increases thereby producing datasets of unprecedented size. Without effective analysis tools, results from these large-scale simulations cannot be utilized to their fullest extent. This research addresses the problem of large-data visualization and exploration by employing interactive multi-scale machine learning, which exploits an efficient feature-based, multi-resolution representation of the data. The investigators are leveraging methods from the field of machine learning to perform two distinct tasks: identify regions of interest and enhance robustness of feature detection algorithms. The primary outcome of this effort is the realization of a framework for exploring large datasets. Further, this work is introducing a large body of work in machine learning to the field of visualization. Successful completion of this research will help overcome the brittleness of existing visualization methods and foster expedient discovery in many areas of science and engineering.<br\/><br\/>The multi-resolution techniques developed here will employ a two-fold strategy. First, semi-supervised learning based on training with the domain expert is used to develop strategies for selective spatial and temporal refinement of the data. A classifier is constructed to tag the output of the coarse resolution feature detection (i.e. regions) as either interesting or not interesting. Then at the finest scale, interesting local data chunks containing features of interest are identified for further analysis. Second, several local feature detection algorithms, or weak classifiers, are combined into a single, more robust compound classifier using adaptive boosting, or AdaBoost, and a data adaptive variant called CAVIAR that facilitates validated feature detection. Ideally, the compound classifier combines the best of all weak classifiers as they respond to the underlying physical signal. This research is demonstrating the effectiveness of these methods by applying existing local detection algorithms for visualizing vortices in turbulent flow fields.","title":"G&V: Medium: Collaborative Research: Large Data Visualization Using An Interactive Machine Learning Framework","awardID":"1065025","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[475211,"533228"],"PO":["565227"]},"181285":{"abstract":"In recent years, the microprocessor design industry has made an aggressive transition to chip-multiprocessor designs, where additional device resources provided by continued semiconductor fabrication process scaling are dedicated to providing ever-increasing numbers of processor cores per die. These cores are expected to maintain a view of shared memory that is easy for programmers and users to work with; that is, the memory contents must be updated only in ways that are coherent and consistent across the whole chip. Similarly, the multiple processing cores must coordinate their accesses to shared resources like input\/output subsystems as well as off-chip connectivity to other chips and main memory. Providing a scalable and low-overhead communication substrate, or network on chip, for such activities is one of the most pressing challenges faced by designers today. Existing and proposed designs are adapting numerous techniques and lessons learned from prior off-chip networks, but these solutions are far from ideal given the radically-different opportunities and constraints that exist in both electrical and nanophotonic on-chip networks.<br\/><br\/>This project investigates novel on-chip networks and hardware protocols for communicating and coordinating the activities of multiple on-chip processor cores. These networks and protocols provide highly-scalable performance while minimizing power and area overheads, hence enabling processor chips that deliver unprecedented levels of performance. The research work is focused on networks built with nanophotonic devices packaged in a 3D chip stack, with an emphasis on efficient arbitration protocols based on high-speed optical mechanisms as well as arbitration-free implementations that rely on coding of message contents to enable robust delivery even when the communication channel is under contention. The project also shows how to utilize the benefits of optical on-chip networks--ultra-low latency, massive bandwidth, and ultra-fast global coordination and consensus--to streamline the hardware protocols that provide a coherent and consistent view of memory.<br\/><br\/>Without dramatic innovations in the design and online management of multicore chip interconnects, the continued device scaling of future nanometer technologies may no longer provide substantial returns in utility or performance. As a result, the microprocessor industry, and by extension, the computer industry as a whole faces a serious challenges in maintaining the growth-based business model that has sustained it for four decades. This research has broad industry- and economy-wide impact since it helps to address or avert these challenges","title":"SHF: Small: Arbitration, Coherence, and Consistency for Nanophotonic Multicore Processors","awardID":"1116450","effectiveDate":"2011-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["549841"],"PO":["366560"]},"184245":{"abstract":"This award provides funding for a new Research Experiences for Teachers (RET) Site focused on Sensor Networks at the University of North Texas. Each year 12 K-12 teachers from school districts in North Texas will participate in research projects at the university. The teachers will also develop modules related to their research which they will implement in their classes in the following school year. The teachers will organize Family Run Tech Fests to share their work with the communities around their schools. Through participation in the RET Site the teachers will have an enhanced knowledge base in engineering and computer science and the skills to translate this into their classroom practices, thus impacting their students and motivating them towards science, technology, computing, and engineering disciplines.<br\/><br\/>Intellectual Merit: The intellectual merit of this project revolves around the expertise of the research team and outstanding research environment in which the teachers will work. The project is built around a prior pilot project and thus can benefit from lessons learned during the pilot. The project takes advantage of an excellent network of partner schools developed through the research and outreach of the project faculty. The research projects are compelling and are in areas of national interest. <br\/><br\/>Broader Impacts: The broader impacts of this project include substantial impact on the area schools and dissemination to a broad community. Teachers will incorporate new computing and engineering topics into their classes and develop hands-on ways to impart these topics to secondary students. The teachers will also engage in public outreach to convey the concepts and appreciation of computer science and engineering to the public. Through this project, a long-term relationship between the university and the schools will be forged and cemented. A permanent video and audio link between the university and schools will be established thus enabling the partners to work together to build a foundation of outstanding computing and engineering at their partner schools and in the region.","title":"RET Site: Research Experiences for Teachers in Sensor Networks","awardID":"1132585","effectiveDate":"2011-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}}],"PIcoPI":["494074",494074,"547799",494076],"PO":["564181"]},"185015":{"abstract":"OCI 1137671<br\/><br\/>This proposal will support funding of travel for US researchers, scientists and CIOs to attend the 2011 Chinese-American Network Symposium (CANS) to meet with Chinese counterparts to discuss design and use of high-performance research networks; explore areas for collaboration; and present results from prior collaborations. CANS meetings promote understanding between the US and China research networking communities, interoperability between research infrastructures from each country, and international collaborations across a broad range of disciplines. In China, CANS is organized by the Chinese Academy of Sciences? (CAS) Computer Network Information Center (CNIC) unit which operates the CSTNet research network, and by the Chinese Education and Research Network (CERNET), the Chinese Ministry of Education-supported organization that provides and operates the major national research and education network for over 700 universities in China. Internet2 - the national research and education networking organization in the US that interconnects all US research universities and many US national laboratories in addition to other research and educational institutions ? is the US organizer along with the Chinese Association for Science and Technology USA (CAST-USA). CANS 2011 will be held in Kunming, China, co-hosted by CERNET and Yunnan University. The symposium will promote interoperability, seamless networking, and collaboration and emphasize network research and ?clean slate? efforts (NSF GENI initiative, IPv6, videoconferencing and telepresence, federated identity and authentication, integration of smart phones and tablets into university infrastructures, CCN, and advanced applications.) A special track will also feature US and Chinese CIOs. These areas and the symposium are consistent with Internet2?s global strategy, including supporting Internet2 members deploying campuses and global programs in China; fostering distributed educational capabilities on an international scale; timely deployment and joint development of applications supporting IPv6 globally; and transformative applications that leverage networks. CANS also is likely to complement NSF?s larger efforts promoting global networking.","title":"Chinese American Network Symposium 2011 (CANS 2011): One Network - One World","awardID":"1137671","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["526814","526815"],"PO":["564246"]},"177238":{"abstract":"This research involves collaboration among investigators at four institutions. Recent advances in motor behavior have uncovered structure in the supporting neural control architecture, including distinctions between feed-forward and feedback control functions and learning. While the neural code has not yet been cracked, much is now known about how its foundations for sensorimotor control differ from those of even the most modern computer-based algorithms. For example, neural function must accommodate transmission and processing delays, so feedback control is subservient to feed-forward and anticipatory control. The nervous system produces exquisite, constantly and widely available predictions concerning body and environment interactions. These predictive models (also called internal models) are constructed by learning the invariants in the mapping from motor commands to sensory feedback (and inverses thereof). The PIs have developed a unique approach based upon readings from a scalp array of EEG electrodes for the construction of algorithms (decoders) which predict motor behavior (control signals) as a weighted sum of the EEG data from all electrodes at multiple time lags. The team has demonstrated two-axis control over a screen cursor using only 10 minutes of EEG and motion training data, a feat far surpassing any brain-computer interface (BCI) available to date. In the current project, the team will build upon this prior work to design and validate noninvasive neural decoders that generate agile control in upper limb prosthetics. To this end, they will investigate neural correlates of brain adaptation to multiple sources of feedback using EEG and functional near infrared spectroscopy (fNIR). An important challenge will be to provide sensory feedback appropriate to contact tasks performed with a prosthesis. Existing BCIs and neuro-prosthetic devices rely at best on vibrotactile feedback and often only on visual feedback. The PIs will add haptic and proprioceptive feedback in concert with a novel adaptation of vibrotactile, skin stretch, and arm squeeze technologies in the prosthesis interface, to provide intuitive control over contact tasks and to strengthen the motor imagery whose neural correlates are processed by the EEG decoder. To establish baseline measures, the team will compare prosthetic performance under direct brain control to myoelectric prosthetic control and direct manual control. Experiments will be performed involving both able-bodied individuals and amputees, in which real-time decoding (EEG) and analysis (EEG\/fNIR) of sensorimotor control and cognitive load will be combined. <br\/><br\/>Broader Impacts: This research will revolutionize the control and interface of upper limb prosthetics. The work will lead to a better understanding of the role of sensory feedback in brain-computer interfaces and will lay the foundation for restoration of motor and sensory function for amputees and individuals with neurological disease. The project will create a unique interdisciplinary environment enabling education, training, co-advising and exchange of graduate students, course development, and involvement of undergraduates in research. The PIs will also participate in outreach activities on their various campuses, targeting underrepresented groups in science and engineering.","title":"HCC: Medium: Collaborative Research: Improved Control and Sensory Feedback for Neuroprosthetics","awardID":"1064871","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[475156],"PO":["565227"]},"181154":{"abstract":"Polyhedral methods to solve polynomial systems exploit the sparsity structure and give rise to hybrid symbolic-numeric algorithms for the computation of Puiseux series expansions of the solutions. The leading powers of the series are tropisms and are defined by the exact Newton polytopes of the system, while the coefficients of the series are solutions of initial form systems which may have coefficients of limited accuracy. The new algorithms will be implemented in the free open source software system PHCpack, with interfaces to computer algebra systems such as Macaulay 2 and Sage (linking the PHCpack library as a Python module). As almost all modern computers have multiple cores enabling to compute in parallel, we design our algorithms for speedup and quality, using the multiple cores to compensate for the cost of multiprecision arithmetic.<br\/><br\/>Solving polynomial systems is a fundamental problem in mathematics with applications to various fields of science and engineering. Solvers that exploit the sparse structure provide better solutions faster. Algorithms and software produced by the proposed research will be disseminated through the users and developers community of Macaulay 2, a computer algebra system for research and teaching in algebraic geometry and commutative algebra. Implementations on parallel computers will enable the efficient solution of large computational problems.","title":"AF: Algorithms and software for a new polyhedral polynomial system solver","awardID":"1115777","effectiveDate":"2011-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[485440],"PO":["565251"]},"187963":{"abstract":"Advanced computing capabilities are now essential to solve complex problems in science and engineering. Computer models have become fundamental to basic research. They are increasingly useful in addressing, in realistic detail, the subtle parameters of the physical systems being modeled. Underlying this increasing relevance of computer models is the enormous, and relatively recent, increase in available low-cost compute power. These advances in computing power and hence in computer modeling and simulation have brought about the emergent field of scientific computing, in which scientists and engineers from multiple disciplines collaborate in understanding a variety of complex systems not approachable only a few years ago.<br\/><br\/>This infrastructure project establishes a high-resolution display wall to be used for scientific visualization at the Polytechnic University of New York and high-performance GPU-based computing cluster at the Scientific Computing and Imaging Institute (SCI Institute) at the University of Utah. This unique resource enables scientists to efficiently carry out increasingly complex scientific computations and visualizations in a collaborative environment. <br\/><br\/>The infrastructure enables research in efficient execution of simulations; streamlining the creation of complex data products; producing high-quality visualizations; and scientific workflows leading to simplifying the process of designing simulations and analyzing their results. This project has the potential to impact a variety of applications where computation, visualization, and management of scientific data are currently the bottlenecks. Through our interdisciplinary collaborations, this project will have immediate impact in helping improve the scientific discovery process. The involvement of graduate and undergraduate students in the project will provide mentoring opportunities. New courses will be offered that are tightly integrated with the goals of the project, including courses on parallel programming using GPUs and on scientific data visualization and management. The project team members are committed to recruiting minority students.<br\/><br\/>The results of this project will be disseminated as research papers and as freely available tools in the project website (http:\/\/www.cs.utah.edu\/~csilva\/projects\/NSF-IIS-0751152\/).","title":"CRI: IAD: A Service-Oriented Architecture for The Computation, Visualization, and Management of Scientific Data","awardID":"1153503","effectiveDate":"2011-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["521991"],"PO":["563751"]},"177305":{"abstract":"The civil litigation system of the United States serves as the ultimate arbiter for commercial and personal disputes. Under this system, plaintiffs and defendants are entitled to request relevant evidence from each other. Although digital records seem easier to find than their older paper counterparts, rapid growth in the volume, diversity, and possible locations of these records has actually made it harder to find the proverbial needles within the digital haystacks. The resulting rapid increase in the cost of discovery and exchange of relevant evidence, if left unchecked, raises concerns about access to justice. Hence, there is an urgent need for demonstrably accurate and cost-effective technologies to support \"e-discovery\" of the relevant records.<br\/><br\/>Professor Douglas W. Oard and colleagues of the University of Maryland are developing techniques to automatically decide within minutes the responsiveness of more documents than one person could examine in a lifetime. These techniques use \"semi-supervised learning\" algorithms for \"training\" the software to replicate the kinds of decisions that people make on representative examples. Using Finite Population Annotation, a new framework for integrating learning with evaluation, novel methods are being developed to achieve and measure the highest possible effectiveness for any specified level of human effort. These learning methods draw on rich approaches to representing the content of both born-digital structured documents and scanned paper. Measures for rigorously assessing the effectiveness of the resulting automated review techniques are being developed both to support decisions by legal professionals and by the courts about which methods to use, and to help developers further improve their algorithms.<br\/><br\/>The legal system demands technology whose effectiveness has been demonstrated on collections that are representative of what is actually expected in a real case. For that reason, this project is creating real world benchmarks in collaboration with the National Institute of Standards and Technology's Text Retrieval Conference (TREC). The project's results are expected to help to shape professional practice through workshops for legal and technical stakeholders, and through university courses to prepare the next generation of attorneys and information professionals to employ these new capabilities. \"E-discovery\" technologies resulting from this effort are likely to be broadly applicable in domains beyond the law practice, including preparation of systematic reviews of scientific literature, scholarly access to digital archives, and government responses to public information requests from citizens. Additional information is available at http:\/\/ediscovery.umiacs.umd.edu.","title":"III: Medium: Development and Evaluation of Search Technology for Discovery of Evidence in Civil Litigation","awardID":"1065250","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["564282","543582",475337],"PO":["565136"]},"177316":{"abstract":"Research on 3D image\/video perception in the light of general principles of stereo<br\/>processing in the human visual system is being used to derive 3D quality metrics for 3D<br\/>video applications in order to deliver the best 3D experience.<br\/><br\/>Human observers can detect differences in depth with high sensitivity, but limited<br\/>precision. Moreover, while the visual system can represent fine details of the 2D image<br\/>that are carried by high spatial frequency components (even when the image is rapidly<br\/>changing), it can not track variations in depth with comparably high resolution in space<br\/>or time. Thus the representation of stereoscopic depth is restricted both in bandwidth and<br\/>in bit depth. Because of those limitations, some deviations from accuracy in the<br\/>representation of depth at the retinal level are perceptually salient, and others less so.<br\/>Measurements of perceived image fidelity across a range of spatial and temporal profiles<br\/>for the depth signal are being used to guide the development of optimal video processing<br\/>techniques, and to allow evaluation of the advantages and limitations of alternative 3D<br\/>video coding algorithms such as multiview versus video+depth).<br\/><br\/>Vision experiments investigate both perceived fidelity and perceived image quality in 3D<br\/>video generated using a variety of encoding schemes. From those results quality metrics<br\/>are developed and integrated into video processing and communications applications. A<br\/>human-centric disparity estimation and view synthesis algorithm is being developed for<br\/>video processing and communications applications; this can also be used to improve the<br\/>performance of object detection, classification and tracking, and to generate multi views<br\/>for autostereoscopic display, which finds applications in 3D enabled diagnostic medical<br\/>imaging and surgical systems.","title":"CIF: Medium: Understanding Quality of 3D Video with Applications in 3D Video Processing and Communications","awardID":"1065305","effectiveDate":"2011-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[475370,"279723",475372],"PO":["564898"]},"178537":{"abstract":"This is funding to support a Doctoral Consortium (workshop) of approximately 25 promising graduate students from the United States and abroad, along with a panel of about 5 distinguished research faculty mentors. The event will take place in conjunction with the Academy of Management (AOM)'s 2011 Conference and will be held August 12-16 in San Antonio, Texas. This is the leading international forum for the presentation and discussion of research about management and organizations, and is attended by approximately 6,000 professionals from around the world. More information about the conference is available at http:\/\/meetings.aomonline.org\/2011\/.<br\/><br\/>The Organizational Communication and Information Systems (OCIS) Doctoral Consortium is a research-focused meeting that has taken place annually at the AOM conference since 2000, and has helped to launch the careers of many outstanding researchers in organizational communication and information systems. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their research during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other OCIS research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on August 12-13, with follow up activities planned during the technical program of the conference. The OCIS conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The OCIS doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars; many of today's leading researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual OCIS doctoral consortia traditionally bring together the best of the next generation of researchers in organizational communication and information systems, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is OCIS-related, regardless of the fields in which they are earning their degrees. While NSF funds will be used chiefly to support participation by students enrolled in graduate programs in the United States, some international participants may be supported as well in recognition of the fact that the OCIS field embraces educational and cultural traditions that vary in different parts of the world. The organizers will try explicitly to identify and include the broadest possible group of highly qualified participants, and in particular will consider gender in the participant selection process with a target of a 50\/50 split. As a consequence of these steps, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"WORKSHOP: Organizational Communications and Information Systems Doctoral Consortium","awardID":"1102558","effectiveDate":"2011-06-01","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["565342"],"PO":["564456"]},"178207":{"abstract":"Conflicts of interest pervade collective decision-making among peers. Such conflicts can be modeled as the tension between two distinct components of an agent's evaluation of the final outcome: her selfish interest and her disinterested opinion. When those two orderings are logically separated, sometimes a rule can be designed that aggregates individual opinions while preventing an agent's message having any impact on her selfish welfare. Such a rule is called impartial. This project focuses on two simple problems, the award of an indivisible private good (a prize) and peer ranking, when agents care selfishly only about winning the prize, or their own ranking. There exist fairly simple voting rules where your vote cannot make you win or lose the prize, yet it influences who wins if you do not. It is also possible to design a peer ranking system where an agent has no influence on his own ranking, but contributes to that of his peers. Some of the impartial decision rules to which the project is devoted resemble familiar voting rules such as qualified majorities, or the median vote on a line. One output of the research consists of practical mechanisms as universally applicable as any other voting rule. Another direction is to ask which general patterns of selfish interest versus selfless opinions allow for impartial rules, and which do not. The project contributes to the broad stream of economics research on mechanism design concentrating on the strategic distortions of information revelation.<br\/>Peer evaluation is a central institution in business partnerships, academic communities, and virtually any community sharing specialized knowledge. Evaluating specialized work requires knowledge that can only be found among those experts; it cannot be entrusted to an impartial but clueless outside observer. Academics pick some of their own for Nobel prizes, and movie professionals award the Oscars. Peer evaluations are vulnerable to conflicts of interest: a participant may be tempted to corrupt her disinterested opinion (a valuable piece of information to determine the correct decision) to serve her selfish interests, which by contrast are often useless to the group. Some examples of such corruption are easy to avoid: judges in sports competitions should not rank athletes of their own countries, spouses cannot testify for or against each other, etc. More subtle ones, such as the multiplication of fake (favorable or critical) reviews on the Internet can only be avoided by the clever design of the evaluation process. This project aims to construct a handful of decision mechanisms immune to conflicts of interest, applicable directly to the division of money between business partners, the award of a prize among peers, and the ranking of Universities by their own students and alumni. This foundational research has potential for much broader impact in the setting of the Internet, where peer evaluations are ubiquitous- from reputation scores for electronic traders (on EBay or Amazon), to the users of social networks (Epinions, Twitter), and the scoring and ranking systems of web pages by search engines, relying exclusively on the pattern of mutual links between pages.","title":"ICES: Small: Impartial decision making in distributed systems","awardID":"1101202","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8052","name":"Inter Com Sci Econ Soc S (ICE)"}}],"PIcoPI":[477807],"PO":["565251"]},"181420":{"abstract":"One of the major concerns that practitioners have about theoretical machine learning is the focus on distributions where the attributes are independent: in other words, knowing one attribute gives no information about any others. As an example, while it is plausible that height and eye color are independent, it is much less believable that height and weight are independent. Thus, the output given by any algorithm that is based on the assumption that the attributes of a person (such as height and weight) are independent cannot be trusted. The goal of this project is to extend what we know about the theory of such problems while removing some of the mathematically convenient assumptions such as independence. <br\/><br\/>The tools used focus on discrete Fourier analysis, but involve many other techniques from mathematics such as functional analysis and representation theory of finite groups. One recurring technique is the application of the \"noise sensitivity\" method, which quantifies the complexity of a function based on how similar the value of the function is on some input to the values of that input's neighbors. In many cases, the goal is to show that the Fourier spectrum of certain classes of functions is predictable; often, this predictability is a key component of algorithms for machine learning. <br\/><br\/>The broader goal of this project is to discover new connections between mathematics and computer science with a special focus on questions motivated by machine learning. Answers to the underlying questions would be useful to theoreticians and could lead to better applied machine learning algorithms. Also, the mathematical questions raised are interesting independently of the machine learning connection. The problems considered in this project will provide an invigorating research opportunity for undergraduate and Master's students.","title":"AF:Small:RUI:New directions in Fourier analysis, noise sensitivity, and learning theory","awardID":"1117079","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[486090],"PO":["565251"]},"184313":{"abstract":"Today's explosive data surge puts data storage at the center of the information universe, but data centers are becoming increasingly massive and expensive to operate. Existing systems rely heavily on multiple disk replication to guard against data loss due to device failure, but consuming multiple times more storage space drastically increases the cost for hardware, and especially the cost to operate (building space, power, cooling, and maintenance). The goal of this research project is to develop new erasure coding technology, in lieu of simple replication, to realize a space-efficient, energy-efficient, quantifiably-reliable, and massively-scalable storage systems.<br\/><br\/>The intellectual merit lies in the development of a feasible approach that relies on the strength of efficient erasure codes distributed across the storage disks and nodes that can be used to build next-generation green data centers, and to transform existing ones. While the benefits of erasure coding in saving storage space is well understood in theory, good and practical erasure codes are hard to design. The PI will build new and optimal erasure codes by exploiting graph theory, finite geometry and combinatorics. Some of these codes have the potential to simultaneously achieve the optimal space efficiency and the minimum complexity promised by the theory. To make erasure-coding efficient and scalable, the PI will also extend the design of single erasure coding to nested\/layered coding through hierarchical multiple protection. <br\/><br\/>In view of the critical importance of energy efficiency, developing green data center technologies will have profound impacts scientifically and to the larger society. The potential application line is broad, including databases, financial information systems, health and medical information systems, research depositories, and digital libraries.<br\/><br\/>The proposed research also integrates a meaningful education component, including industrial and international collaboration, curriculum enhancement, and promoting undergraduate and graduate research.","title":"EAGER: Advanced Erasure Coding Technology for Storage Networks","awardID":"1133027","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":["545094"],"PO":["565292"]},"185435":{"abstract":"This project involves a workshop called \"Workshop on Information and Communication Technologies for Sustainability\" (WICS)to be held on June 27, 2011 in Salt-Lake City, Utah along with the annual SECON conference. The workshop is expected to identify new areas where researchers working in communications technologies for sustainability and thereby open up new areas of research.","title":"NSF Workshop on Information and Communication Technologies for Sustainability (WICS)","awardID":"1140062","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["436918"],"PO":["564778"]},"175305":{"abstract":"Performance bugs cause unintended performance degradation and energy waste in mainstream software. These bugs can easily slow down production software for several times and are posing increasing threat to software quality with the meager increases in single threaded performance in multi-core era and an increasing emphasis on energy efficiency.<br\/><br\/>Previous works for performance bugs, including testing and profiling, mostly treat software as a black-box, and are usually too late or ineffective in preventing the damage of performance bugs. This NSF CAREER research project seeks to develop systems and tools that take a white-box approach to addressing the open problem of performance bugs. First, it conducts an empirical study to enrich the understanding of performance bugs in real-world. Second, it develops tools that can automatically detect performance bugs before, during, and after bug manifestation. Third, it designs a testing framework to expose performance bugs before software release. Finally, it also looks at the performance bug issue in multi-threaded programs.<br\/><br\/>The education focus of this project is to broaden the software curriculum to bring students more awareness and exercise of performance and correctness issues in software, especially multi-threaded software.<br\/><br\/>This research will improve the understanding of performance waste problem in software, provide substantial tool support to help lower software development and performance testing costs, and improve software users' everyday experience through faster software. It will also help improve the energy efficiency of production-run software and protect environment in the field.","title":"CAREER: Combating Performance Bugs in Software Systems","awardID":"1054616","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["517878"],"PO":["565264"]},"185106":{"abstract":"This proposal seeks funding to support the travel of advanced doctoral students so that they can participate in the 15th International Conference in Artificial Intelligence in Education and in the Young Researchers Track (YRT) that is part of that conference. The Young Researchers Track provides a forum for Ph.D. students to present and discuss their work with mentors from outside of their home institutions and to meet peers with similar interests. Mentoring happens in two ways -- as part of the Young Researchers Track, where they will be encouraged and offered feedback by three mentors, and through an individual mentoring program where each doctoral student will be matched with a mentor with expertise in the student's research area. Mentors will be senior AI and ED researchers.<br\/><br\/>Participants in the Young Researchers Track are members of the next generation of cyberlearning researchers. Participation in the proposed program will supplement their education at their home institutions and help prepare them to be leaders in transforming education through the use of learning technologies.","title":"Student Travel Support for the 15th International Conference in Artificial Intelligence in Education (AIED 2011)","awardID":"1138158","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}}],"PIcoPI":["536406"],"PO":["562669"]},"181268":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for about 10-14 graduate students, along with a panel of 4-5 distinguished research faculty mentors, which will take place in conjunction with the 2011 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC 2011), to be held September 19-21, 2011, in Pittsburgh, and sponsored by the IEEE Computer Society. The long-running VL\/HCC series occupies a unique niche among HCI and Programming Language conferences, in that it focuses specifically on how to help end users successfully develop and use software. Recent advances in computing have led to continually deeper integration between computers and human society. People now swim in a \"sea\" of socio-technical systems that synthesize large numbers of contributing users with vast amounts of source code. Examples include social media systems, open source repositories, online marketplaces and massively multiplayer online games. Yet as the socio-technical systems in this sea have grown in complexity, they have become increasingly difficult for end users to understand and direct toward productive ends. Thus, when users put data into a system they may be unable to anticipate and control how their data will be used by other people or by software in the system; when users take actions in the system they often cannot foresee and manage unintended effects on other users, software, or the system as a whole, particularly because the system's software often contains defects. These problems are further complicated by the fact that different users simultaneously might take actions toward differing goals, while autonomous software such as agents might meanwhile also take actions toward goals of their own. These and similar problems reflect a fundamental lack of sufficient methods, models and tools to help end users visualize, analyze, tailor, and manage large socio-technical systems. At a deeper level, insufficient theory is available for predicting the complicated, unstable, sometimes-emergent behavior that results when large numbers of diverse, unpredictable humans are coupled to unreliable software.<br\/><br\/>This year's VL\/HCC Doctoral Consortium, the ninth to be funded by NSF in this series, will focus on advancing knowledge and understanding of solutions to these problems. The workshop will bring together and build community among young researchers working on different aspects of these problems from the perspectives of diverse fields including computer science, the social sciences, and education. It will guide the work of these new researchers by providing an opportunity for experts in the research field (as well as their peers) to give them advice, in that student participants will make formal presentations of their work during the workshop and will receive feedback from a faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether the results are appropriately analyzed and presented. As in prior years the VL\/HCC 2011 Doctoral Consortium will be part of the regular conference program. A 2-page extended abstract of each participant's work will be published in the conference proceedings. More information about the VL\/HCC conference may be found at http:\/\/www.cs.cmu.edu\/~vlhcc2011. <br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other. The PI and the members of the organizing committee will make special efforts to attract a diverse and interdisciplinary group of student participants, with special attention paid to recruitment of women and minorities. The PI expects that most of the students supported by this award will come from U.S. universities but as in past years, due to the highly international make-up of the research community, a few non-U.S. students may be invited to participate as well.","title":"WORKSHOP: HCC: VL\/HCC 2011 Doctoral Consortium","awardID":"1116374","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["541827"],"PO":["565227"]},"193765":{"abstract":"This project will integrate new cognitive models of behavioral data based on queueing theory with new machine learning techniques for analyzing neurophysiological data, specifically electroencephalogram (EEG), in order to provide a deeper and more complete understanding of mental states as well as more accurate prediction of human performance. In cognitive modeling, a new brain network architecture for human performance and mental workload, called Queuing Network-Model Human Processor (QN-MHP), will be further improved. QN-MHP with a new human-like small-scale knowledge system will be used to model the increase of myelination in the brain in cognitive development and predict human performance, in terms of subjective risk perception and confidence. In machine learning, new spatio-temporal (pattern-based) classification techniques will be developed for multidimensional time series data and used to identify human mental states (e.g., fully awake, fatigue, distracted, anger) from EEG data. The integrated framework will result in a robust intelligent system that uses machine learning to identify mental states and the queueing model of that mental state to predict the human performance as well as provide a human operator with feedback. A mind-driven intelligent transportation system will be developed as a case study in this project, where a certain type of feedback will be designed to help drivers avoid accidents and to improve system safety. This system can also be applied to other human-machine systems that require full or partial attention of human operators (e.g., in aviation, military, or manufacturing settings).","title":"RI:Small:Collaborative Proposal: Computational Framework of Robust Intelligent System for Mental State Identification and Human Performance Prediction with Biofeedback","awardID":"1219638","effectiveDate":"2011-06-30","expirationDate":"2013-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["555420"],"PO":["564318"]},"184822":{"abstract":"This is funding to support the Student Design Competition (SDC), which will be part of the 2011 annual RESNA conference to be held June 5-8 in Toronto, Canada. Today, between 40 and 56 million people in the United States report some type of disability, and this number will likely grow in the coming years as the baby boom generation enters late life. RESNA (formerly the Rehabilitation Engineering Society of North America) is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. RESNA's membership consists of individuals and institutions covering a range of disciplines (including researchers, clinicians, suppliers, manufacturers, consumers and educators who work in non-profit and for-profit settings), all of whom are dedicated to promoting the exchange of ideas and information for the advancement of assistive technology. In addition to its annual conference, RESNA conducts a credentialing program for assistive technology practitioners, rehabilitation engineering technologists and suppliers, as well as sponsored projects. RESNA's Technical Standards Board is the U.S. Technical Advisory Group to ANSI, the official U.S. representative to the International Organization for Standardization (ISO), for the development of ISO standards pertaining to assistive technology and other products for persons with disabilities.<br\/><br\/>The RESNA Student Design Competition fosters innovation and creativity with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference. Since then, over 200 designs have been identified as winning entries, chosen from more than 600 submissions by students from over 115 different universities. SDC entries are required to represent the work of students ONLY, including the design documentation; both undergraduates and graduates are eligible to take part. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Some past student designs have been patented and are now available commercially. NSF has been a supporter since 2005. This year's funding will enable the SDC to be further expanded and enhanced, so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also distributed electronically to a large number of colleges and universities with engineering and design schools. A team of 5 judges will pre-select entries from up to 10 teams, from which two members each will be invited to attend the conference supported with travel and hotel funds as well as complimentary registration. During a half-day session in which the teams will make presentations before the judges and public audience at the conference, 5 teams will ultimately be selected as the final winners. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. A platform session will be held in which the 5 finalists will make presentations to the general conference attendees. All SDC teams invited to the conference will have an opportunity to present their projects in a poster session during the general conference time. More information is available online at http:\/\/www.resna.org\/conference.<br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. Unique in its primary focus on undergraduates, the event provides participants with experience and skills that help them succeed in their engineering and design careers. It further encourages and mentors students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields, and also provides an opportunity for the students to network with their peers and rehabilitation engineers, many of whom participated in previous SDC competitions. In an effort to increase the diversity of submissions to the SDC in future years, this year's participants will build web pages to illustrate their design and design process. Not only will young scientists benefit from this medium of dissemination but professors and those who teach will also be able to share this information with their students as examples of projects that others have done. The content of all submissions, not just the finalists, will be captured and accessed through the RESNA website. The information will be searchable through the National Public Internet Site on assistivetech.net and the ATWiki. Use of an existing national search engine will allow professors to use design information in their course work, while allowing service providers and people ","title":"2011 RESNA Student Design Competition","awardID":"1136652","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559082"],"PO":["565227"]},"184954":{"abstract":"The Association for Computer Machinery (ACM) International Conference on Bioinformatics and Computational Biology (ACM-BCB) is aimed at providing a common environment to bridge important interdisciplinary research areas in computer science, mathematics, statistics, biology, bioinformatics, and biomedicine and an interactive forum which brings together superb researchers, practitioners, and students from around the world to promote scientific understanding and findings in computational bioscience. The meeting provides an opportunity for researchers from very different disciplines to form new collaborations and research programs. The proposed ?Women in Bioinformatics? initiative at ACM-BCB 2011 promotes broad participation from underrepresented groups in this important event and help develop the 21st century workforce in the computer science, biological science, biomedical science and other interdisciplinary areas.","title":"III: Small: Women in Bioinformatics Initiative at ACM BCB 2011","awardID":"1137427","effectiveDate":"2011-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["234536","529169","533353","506707","518277"],"PO":["565136"]},"181698":{"abstract":"Crises are complex and dynamic events in which the members of the public need accurate, timely information about the event and what actions they should be taking. Alerts are used to indicate that something significant has happened or may happen. Warnings, which typically follow alerts, provide more detailed information. The Warning, Alert, and Response Network (WARN) Act of 2006 established a national system using wireless communications. Since then, social media have emerged as a new medium for alerts. The social aspect leverages the trust people place in their connections and ae often viewed as more credible than a mass alert or news report. Use of social media by other than social contacts raises privacy issues, since they can be readily monitored, even though the social media have certain privacy expectations. Although alert and warning issues have been extensively studied and social media have been the subject of research in computer science and the social sciences, relatively little is known about the use of social media for national alerts and associated privacy considerations. Developing a fuller understanding of the privacy issues and other aspects of social alert systems will be the focus of two workshops at the National Academy of Sciences. This will support an understanding of current and emerging research issues and key needs. Emerging stakeholders will also be identified and participate. Workshop summaries will be made publicly available and disseminated broadly to emergency managers, as well as to the relevant research communities.","title":"Public Response to Alerts and Warnings Using Social Media and Associated Privacy Considerations: Current Knowledge and Research Needs","awardID":"1118399","effectiveDate":"2011-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"K561","name":"U.S. Department of Homeland Se"}}],"PIcoPI":["560890"],"PO":["565136"]},"184922":{"abstract":"The increasing availability of large quantities of clinical data in digitized form in the course of routine patient care, presents unprecedented opportunities as well as challenges in improving the quality and reducing the cost of clinical care through the use of Electronic Medical Record (EMR) systems. Because it is impossible to anticipate and precisely identify\/define all of the relevant information that would be useful in every clinical setting, and the need for the definitions of key information elements to change in response to changes in medical knowledge (e.g., evidence-based treatment guidelines), despite the increasing emphasis on collecting information in structured fields of EMRs, a substantial fraction of key information continues to be available as unstructured (i.e., free) text. Hence, there is a growing interest in identifying novel learning approaches that can be used to adapt strategies for information extraction from free text in such settings. <br\/><br\/>Zeeshan Syed and collaborators plan to organize a multi-disciplinary Workshop on Learning from Clinical Free Text to bring together researchers from machine learning, computational linguistics, and medical informatics, who share an interest in problems and applications of learning from unstructured clinical text. The workshop to be held on July 2, 2011 at Bellevue, Washington, USA, in conjunction with the International Conference on Machine Learning (ICML), which is the premier international forum for researchers and practitioners from academia, industry, and government for sharing the latest advances in machine learning.<br\/><br\/>Scientific Merits: The workshop seeks to bridge the gap between the theory of machine learning, natural language processing, and the applications and needs of the healthcare community and to promote fruitful interdisciplinary collaborations. The workshop seeks to cover a range of topics of interest to academic as well as industrial participants through a program consisting of presentations by invited speakers from machine learning, computational linguistics. and medical informatics, and by authors of extended abstracts solicited from the broader research community. A panel discussion will help identify important problems, applications, and synergies across the research in and practice of machine learning, computational linguistics, and medical informatics. The workshop will connect established researchers with graduate students and early career researchers and academics. <br\/><br\/>Broader Impacts: These activities will collectively facilitate the the infusion of the latest results and tools from the machine learning and computational linguistics, and text mining communities into Health Informatics, catalyze the establishment of an interdisciplinary community of researchers focused on advancing machine learning to meet the needs of information extraction from free text medical records, and help integrate a diverse group of graduate students and early career researchers into the Health Informatics community.","title":"ICML 2011 Workshop on Learning from Clinical Free Text","awardID":"1137289","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[496138],"PO":["560586"]},"184901":{"abstract":"A research or resource commons requires agreement among providers or participants about its legal structure, the technical requirements for common resources, and a shared understanding about how to sustain the commons. Legal issues, usually involving intellectual property or contract law, often arise as researchers, or research funders, seek to build commons or commons-based tools, such as Creative Commons licenses. There are three major objectives for the workshop to be held at American University. First, the attendees will review lessons learned from those who have worked to build or to promote the use of commons structures to support scientific research from within the federal government and from the private sector, including the non-profit sector. Next, the members will identify the legal, technical, and cultural requirements for a successful commons, with a particular focus on scientific data. The key themes will be the respective roles of standardization and interoperability at the legal and technical levels necessary for resources to be shared in a commons, whether those resources are literature, data, physical inputs, or others. Third, they will discuss how the federal government, the university and non-profit sector, and industry can best work together to support existing successful resource commons in science and to create new commons or commons-based tools to improve the speed and efficiency of publicly funded scientific research. Attention will be given to how existing commons standards, such as legal and technical tools supplied by Creative Commons, are currently being used in the sciences and how these might be made more useful with respect to emergent forms of scientific communication. The report of the workshop and all case studies developed will be made publicly available and published on the Internet.","title":"Workshop on Research and Resource Commons in Scientific Research","awardID":"1137208","effectiveDate":"2011-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[496067],"PO":["565136"]},"192326":{"abstract":"When dealing with massive quantities of data, ranking and aggregate<br\/>queries are powerful techniques for focusing attention on the most<br\/>important answers. Many applications that produce such massive<br\/>quantities of data inherently introduce uncertainty in the same time,<br\/>for example, probabilistic match in data integration, imprecise<br\/>measurements from sensors, fuzzy duplicates in data cleaning,<br\/>inconsistency in scientific data. Hence, the importance of these<br\/>queries is even greater in probabilistic data, where a relation can<br\/>encode exponentially many possible worlds. Uncertainty opens the gate<br\/>to many possible definitions for ranking and aggregate queries. This<br\/>project systematically examines the underlying properties associated<br\/>with the rich semantics of ranking and aggregate queries for large<br\/>amounts of probabilistic data. More importantly, this project<br\/>investigates the issue of how to design novel and scalable algorithms<br\/>for processing these queries efficiently in various settings, such as<br\/>the offline, centralized environment, distributed systems and the<br\/>streaming model.<br\/><br\/>With the emergence of probabilistic data in many important application<br\/>domains, the demand for understanding and processing the ranking and<br\/>aggregate queries efficiently from the scientific community and beyond<br\/>(e.g., government and military agencies) is expected to intensify in<br\/>the coming years. The results of this project lay down a firm<br\/>foundation for this important problem. <br\/><br\/>For further information, such as publications, data sets and source code, <br\/>please see the project website at http:\/\/www.cs.fsu.edu\/~lifeifei\/rankaggprob","title":"III: Small: Efficient Ranking and Aggregate Query Processing for Probabilistic Data","awardID":"1212310","effectiveDate":"2011-06-30","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["548382"],"PO":["563727"]},"185309":{"abstract":"The ACM SIGCOMM Conference will be held from August 15 to August 19, 2011 in Toronto, Canada. ACM SIGCOMM is the flagship annual conference of the Special Interest Group on Data Communications, a special interest group of the Association for Computing Machinery. This award assists approximately 12 graduate students and 3 postdoctoral students from US institutions to attend this conference. Participation in conferences such as SIGCOMM is an extremely important part of the graduate school experience, provides students with an opportunity to interact with more senior researchers and exposes them to leading edge research in the field. The support requested in this proposal will enable people in the above categories to attend the main SIGCOMM 2011 conference, who would be otherwise unable to do so. The travel grant chairs are committed to encouraging the participation of women and under-represented minorities.<br\/><br\/>Intellectual Merit: This project will provide travel support for US-based graduate and postdoctoral students to attend the main SIGCOMM 2011 conference. SIGCOMM is the flagship conference in the networking community and a highly competitive venue (with acceptance rate around 10%). Its rich program exposes participants to new ideas and cutting-edge research and allows for interaction between researchers from all over the world.<br\/><br\/>Broader Impact: This project integrates research and education of students through exposure to a premier technical meeting in computer networks and communications. Students will have the opportunity to observe high-quality presentations and interact with senior researchers in the field. The proposed student participation is expected to have a positive impact on the students? research interests and quality. Second, the project will promote diversity by encouraging and enabling women and other under-represented minorities to participate. Furthermore, the truly international flavor of SIGCOMM as an annual conference is well-known and reflected in the composition of the Technical Program Committee as well as in the authors of the submitted and accepted papers. As such, it cultivates international research interactions and presents a tremendous opportunity to students to increase their breadth of ideas, research approaches, and technical perspectives.","title":"Student Travel Support for the ACM SIGCOMM 2011 Conference","awardID":"1139277","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[497218],"PO":["565090"]},"183639":{"abstract":"This award of $10,000, is used to assist fifteen United States-based graduate students to attend the 11th IEEE International Symposium on a world of Wireless, Mobile, and Multimedia Networking (WoWMoM 2011), which is held in Lucca, Italy on June 20-24, 2011.","title":"NeTS: Small: IEEE WoWMoM 2011 Student Travel Support","awardID":"1129173","effectiveDate":"2011-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[492475],"PO":["565255"]},"176907":{"abstract":"This award funds a new CISE Research Experience for Undergraduates site focused on information assurance and security at Purdue University. Each year, eight undergraduate students will be recruited to work with faculty from Purdue's Center for Education and Research in Information Assurance and Education (CERIAS). The site plans to target students from institutions without graduate programs who would not normally have access to undergraduate research as well as students from traditionally under-represented groups. Students will work on a variety of research projects that embody the nature of the socio-technical challenges in information assurance and security including assurable software and architectures, enclave and network security, authentication and privacy, risk management, policies, and trusted social and human interactions. Students will also participate in a number of professional development activities and a special ethics component. <br\/><br\/>The intellectual merit of this project lies with the strong faculty and infrastructure of the CERIAS Center. Students will work with top researchers on projects that are relevant and important. Information assurance is vital for the protection of the nation?s critical computing and communications infrastructure. Thus the students and faculty working together have the potential to impact the research body in this important area. <br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups and from institutions with limited research environments. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Multi-disciplinary Information Assurance and Security","awardID":"1062970","effectiveDate":"2011-06-15","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["560877","522969"],"PO":["564181"]},"190808":{"abstract":"ABSTRACT<br\/>With the advances in the hardware technology and ever-decreasing cost of imaging circuitry, cameras have become<br\/>ubiquitous in our lives. The large amounts of video data generated by multiple cameras necessitate automatic<br\/>analysis of activities from video. With the introduction of smart cameras, it has now become viable to install<br\/>many spatially-distributed cameras interconnected by wireless links. A smart camera is a stand-alone unit that<br\/>not only captures images, but also includes a processor, memory and communication interface. This project<br\/>takes a holistic view of the problems that need to be solved to build scalable, battery-powered wireless smart-<br\/>camera networks (Wi-SCaNs). It focuses on providing a unifying solution to perform tasks distributively, and<br\/>communicate in a P2P fashion over wireless links while making e±cient use of limited resources, such as energy<br\/>and bandwidth. This research explicitly considers the challenges of wireless channels, and addresses the issues<br\/>of scarce resources, P2P protocol design and channel usage priorities simultaneously. The expected outcomes of<br\/>this project include light-weight vision algorithms that are portable to embedded smart cameras, characterization<br\/>of the energy-bandwidth-delay tradeo®s in Wi-SCaNs, e±cient resource allocation strategies, and P2P wireless<br\/>communication protocols that leverage the knowledge of the wireless channel conditions. The outcomes will have<br\/>an important positive impact, because they will fundamentally advance the automatic activity analysis solutions<br\/>by providing installation of any number of cameras anywhere, and will ¯nd wide-ranging applications including<br\/>surveillance in military, commercial or public scenarios, elderly care and wildlife monitoring.<br\/>1","title":"CSR-DMSS,SM: Cooperative Activity Analysis in Wireless Smart-Camera Networks (Wi-SCaNs)","awardID":"1205458","effectiveDate":"2011-06-30","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["542021"],"PO":["535244"]},"177290":{"abstract":"Brain-computer interfaces (BCI) have made dramatic progress in recent years. Their main application to date has been for the physically disabled population, where they typically serve as the sole input means. Recent results on the real-time measurement and machine learning classification of functional near infrared spectroscopy (fNIRS) brain data lead to this project, in which the PI and his team will develop and evaluate brain measurement technology as input to adaptable user interfaces for the larger population. In this case, brain input is used as a way to obtain more information about the user and their context in an effortless and direct way from their brain activity, which is then used to adapt the user interface in real time. To accomplish this a multi-modal dual task interface between humans and robots will be introduced, which will serve as a particularly sensitive testbed for evaluating the efficacy of these new interfaces.<br\/><br\/>The project will create and study these new user interfaces in domains where the effect on task performance of introducing the brain input to the interface can be measured objectively. They are most useful in demanding, high-performance, multitasking situations. Carefully calibrated multitasking applications scenarios from the team's research in Human-Robot Interaction will be employed. <br\/><br\/>The project will also advance the range of fNIRS brain measurements that can be applied to user interfaces. It will study a recently identified fNIRS signal obtained from the phase relationships among different regions of the scalp at low frequencies (0.1 Hz), as well as a wider range of sensor placement locations than previously examined. As these are developed into usable measurements for real-time signals with machine learning and other analysis approaches, they will be incorporated into new user interfaces.<br\/><br\/>Broader Impacts: The target of the research is adaptive interfaces for non-disabled users, where brain measurement is an additional source of user input. However, as the work proceeds toward making this into a more robust technology project outcomes will have promise for physically-challenged users, and ultimately they promise to improve the lives of people with severe motor disabilities.","title":"HCC: Medium: Bringing Brain-Computer Interfaces into Mainstream HCI","awardID":"1065154","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["519872","549200",475295],"PO":["565227"]},"177280":{"abstract":"Abstract - Machiraju, Rangarajan, and Thompson<br\/><br\/>As computer power continues to increase, the complexity of simulations also increases thereby producing datasets of unprecedented size. Without effective analysis tools, results from these large-scale simulations cannot be utilized to their fullest extent. This research addresses the problem of large-data visualization and exploration by employing interactive multi-scale machine learning, which exploits an efficient feature-based, multi-resolution representation of the data. The investigators are leveraging methods from the field of machine learning to perform two distinct tasks: identify regions of interest and enhance robustness of feature detection algorithms. The primary outcome of this effort is the realization of a framework for exploring large datasets. Further, this work is introducing a large body of work in machine learning to the field of visualization. Successful completion of this research will help overcome the brittleness of existing visualization methods and foster expedient discovery in many areas of science and engineering.<br\/><br\/>The multi-resolution techniques developed here will employ a two-fold strategy. First, semi-supervised learning based on training with the domain expert is used to develop strategies for selective spatial and temporal refinement of the data. A classifier is constructed to tag the output of the coarse resolution feature detection (i.e. regions) as either interesting or not interesting. Then at the finest scale, interesting local data chunks containing features of interest are identified for further analysis. Second, several local feature detection algorithms, or weak classifiers, are combined into a single, more robust compound classifier using adaptive boosting, or AdaBoost, and a data adaptive variant called CAVIAR that facilitates validated feature detection. Ideally, the compound classifier combines the best of all weak classifiers as they respond to the underlying physical signal. This research is demonstrating the effectiveness of these methods by applying existing local detection algorithms for visualizing vortices in turbulent flow fields.","title":"G&V: Medium: Collaborative Research: Large Data Visualization Using An Interactive Machine Learning Framework","awardID":"1065107","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["560072",475264],"PO":["565227"]},"188480":{"abstract":"Maintaining a sustainable society via technological innovations has been a major challenge for computing system design. In this project, we focus on the energy efficiency of an important type of computer applications, the database management systems (DBMS), which often consume a large portion of the computing resources and energy in modern data centers. The goal of this project is to design and implement a DBMS that enables significant energy conservation with graceful degradation of query processing performance. The project achieves its goal using the following approaches: (1) Dynamically exploit the energy-performance tradeoffs in DBMS as well as low-power modes of hardware systems for improved energy efficiency with performance guarantees; (2) Formulate the energy-efficient DBMS design as a feedback control problem, and adopt appropriate formal control techniques to achieve the desired performance and energy efficiency with theoretical analysis and guarantees; (3) Apply advanced multi-stage optimization methods to solve complex energy-aware storage management problems; and (4) Coordinate various control and optimization loops in different layers of the DBMS for maximized energy savings and global system stability. The broader impacts of the project are at two levels. At the society level, the reduction of energy consumption and CO2 emission by implementing the proposed energy-aware DBMS can be substantial. The project can benefit a large number of industrial sectors, the operations of which depend heavily on database-supported software such as online retailing systems, financial management software, and social networking platforms, by significantly lowering their electricity cost. At the education level, the project trains Ph.D. students in an interdisciplinary environment and enhances several courses taught at the University of Florida and the University of Tennessee at Knoxville by providing a rich set of application examples, software tools, and project opportunities. Publications, technical reports, software and experimental data from this project can be found at www.cse.usf.edu\/~ytu\/EDBMS.","title":"III: Small: Collaborative Research: Making Databases Green - An Energy-Aware DBMS Approach","awardID":"1156435","effectiveDate":"2011-06-30","expirationDate":"2014-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["554423"],"PO":["563727"]},"177260":{"abstract":"This research involves collaboration among investigators at four institutions. Recent advances in motor behavior have uncovered structure in the supporting neural control architecture, including distinctions between feed-forward and feedback control functions and learning. While the neural code has not yet been cracked, much is now known about how its foundations for sensorimotor control differ from those of even the most modern computer-based algorithms. For example, neural function must accommodate transmission and processing delays, so feedback control is subservient to feed-forward and anticipatory control. The nervous system produces exquisite, constantly and widely available predictions concerning body and environment interactions. These predictive models (also called internal models) are constructed by learning the invariants in the mapping from motor commands to sensory feedback (and inverses thereof). The PIs have developed a unique approach based upon readings from a scalp array of EEG electrodes for the construction of algorithms (decoders) which predict motor behavior (control signals) as a weighted sum of the EEG data from all electrodes at multiple time lags. The team has demonstrated two-axis control over a screen cursor using only 10 minutes of EEG and motion training data, a feat far surpassing any brain-computer interface (BCI) available to date. In the current project, the team will build upon this prior work to design and validate noninvasive neural decoders that generate agile control in upper limb prosthetics. To this end, they will investigate neural correlates of brain adaptation to multiple sources of feedback using EEG and functional near infrared spectroscopy (fNIR). An important challenge will be to provide sensory feedback appropriate to contact tasks performed with a prosthesis. Existing BCIs and neuro-prosthetic devices rely at best on vibrotactile feedback and often only on visual feedback. The PIs will add haptic and proprioceptive feedback in concert with a novel adaptation of vibrotactile, skin stretch, and arm squeeze technologies in the prosthesis interface, to provide intuitive control over contact tasks and to strengthen the motor imagery whose neural correlates are processed by the EEG decoder. To establish baseline measures, the team will compare prosthetic performance under direct brain control to myoelectric prosthetic control and direct manual control. Experiments will be performed involving both able-bodied individuals and amputees, in which real-time decoding (EEG) and analysis (EEG\/fNIR) of sensorimotor control and cognitive load will be combined.<br\/><br\/>Broader Impacts: This research will revolutionize the control and interface of upper limb prosthetics. The work will lead to a better understanding of the role of sensory feedback in brain-computer interfaces and will lay the foundation for restoration of motor and sensory function for amputees and individuals with neurological disease. The project will create a unique interdisciplinary environment enabling education, training, co-advising and exchange of graduate students, course development, and involvement of undergraduates in research. The PIs will also participate in outreach activities on their various campuses, targeting underrepresented groups in science and engineering.","title":"HCC: Medium: Collaborative Research: Improved Control and Sensory Feedback for Neuroprosthetics","awardID":"1065027","effectiveDate":"2011-06-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550636"],"PO":["565227"]},"176193":{"abstract":"The goal of this project is to build a new software infrastructure for<br\/>continuing research on compiler optimizations for tensor computations.<br\/>Motivated by the successes of the model-driven search-based<br\/>optimization approach of the Tensor Contraction Engine (TCE) and the<br\/>polyhedral model-based transformations, an optimization infrastructure<br\/>is being developed that combines the key aspects of the TCE and the<br\/>polyhedral models and provides the flexibility to continue research on<br\/>optimizing and automatically parallelizing tensor computations for<br\/>parallel and\/or distributed computations for any machine architecture,<br\/>including multi-cores and GPUs.<br\/><br\/>This novel optimization framework has potential for high payoffs in<br\/>enabling future research and eventually in generating high-performance<br\/>code for an important class of quantum chemistry codes and other<br\/>tensor computations. After further research, it will become a<br\/>valuable tool for reducing the time to develop high-performance<br\/>applications in several areas of science and engineering.","title":"II-NEW: Research Software Infrastructure for Tensor Computations","awardID":"1059417","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[472178,"557461"],"PO":["565272"]},"177272":{"abstract":"Abstract - Machiraju, Rangarajan, and Thompson<br\/><br\/>As computer power continues to increase, the complexity of simulations also increases thereby producing datasets of unprecedented size. Without effective analysis tools, results from these large-scale simulations cannot be utilized to their fullest extent. This research addresses the problem of large-data visualization and exploration by employing interactive multi-scale machine learning, which exploits an efficient feature-based, multi-resolution representation of the data. The investigators are leveraging methods from the field of machine learning to perform two distinct tasks: identify regions of interest and enhance robustness of feature detection algorithms. The primary outcome of this effort is the realization of a framework for exploring large datasets. Further, this work is introducing a large body of work in machine learning to the field of visualization. Successful completion of this research will help overcome the brittleness of existing visualization methods and foster expedient discovery in many areas of science and engineering.<br\/><br\/>The multi-resolution techniques developed here will employ a two-fold strategy. First, semi-supervised learning based on training with the domain expert is used to develop strategies for selective spatial and temporal refinement of the data. A classifier is constructed to tag the output of the coarse resolution feature detection (i.e. regions) as either interesting or not interesting. Then at the finest scale, interesting local data chunks containing features of interest are identified for further analysis. Second, several local feature detection algorithms, or weak classifiers, are combined into a single, more robust compound classifier using adaptive boosting, or AdaBoost, and a data adaptive variant called CAVIAR that facilitates validated feature detection. Ideally, the compound classifier combines the best of all weak classifiers as they respond to the underlying physical signal. This research is demonstrating the effectiveness of these methods by applying existing local detection algorithms for visualizing vortices in turbulent flow fields.","title":"G&V: Medium: Collaborative Research: Large Data Visualization Using An Interactive Machine Learning Framework","awardID":"1065081","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["499432"],"PO":["565227"]},"176184":{"abstract":"Building large scale annotated resources is crucial for basic and applied research in Natural Language Processing (NLP). Our major long term goal of this project is to make very substantial extensions to an existing unique resource, the Penn Discourse Treebank (PDTB), developed under prior NSF support, augmenting it with a variety of new annotations as well as refining earlier annotations. Our proposed work involves conducting some new annotations and some pilot experiments to confirm the strategies for augmentation. A further goal is to bring together a cross section of potential users of this resource, first to acquaint them with the potential of this resource as well as to get their feedback for guiding further augmentations. Applications of PDTB for the task of summarization have already been made. Future applications are in the areas of information extraction, question-generation, and machine translation among others. On the theoretical side, our resource will prove useful in increased theoretical understanding of discourse structure of language.","title":"CI: ADDO-EN: Significant Enhancement of the Exisitng Penn Discourse Treebank","awardID":"1059353","effectiveDate":"2011-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[472144],"PO":["565215"]},"184270":{"abstract":"This award provides travel support to enable graduate student participation in a conference held at Carnegie Mellon University on March 8-9, 2011, on the subject of \"Emerging Behavior in the Changing Electric Energy Industry.\"<br\/><br\/>As new and unconventional technologies become connected to the electric power grid, and the system is driven by qualitatively new economic and environmental objectives, new phenomena will emerge. Some of these may lower cost and improve reliability, but some will challenge the stability and reliability of the electricity system. For example, if a large proportion of residential and commercial customers have solar panels that feed electricity into the grid when the sun is shining, but abruptly require power when a cloud passes over the sun, the dynamic stresses on the grid will increase, perhaps to unmanageable levels. A system based on minimizing costs with current rules for preserving stability and reliability could lead to unacceptable service. Before making these changes in technology and management practices, it would be prudent to understand the challenges that the current system faces, the reasons for its relatively good record of reliability, and how the system will be challenged by the changes.<br\/><br\/>The focus of the meeting is on unintended consequences of changes in the electricity system. Topics include causes, modeling, and dynamics of hard-to-predict emerging technical and economic phenomena. The meeting focuses on issues affecting the smart grid, dynamic pricing, and decentralized generation (including net metering for an area with a high penetration of solar self-generation). The objective is to identify fundamental approaches for transforming today's operating and planning industry practices, and to identify supporting policies that can manage short-and long-term uncertainty and ensure sustainable electricity services.","title":"Electricity Conference on Emerging Behavior in the Changing Electric Energy Industry","awardID":"1132763","effectiveDate":"2011-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563201"],"PO":["561889"]},"176174":{"abstract":"This project develops a mobile distributed vehicular testbed equipped with sensory and communication devices for experimentation with emerging networking and application development challenges in the domain of vehicular participatory sensing. The project is motivated by the emergence of a new type of computing and social applications enabled by the proliferation of sensors of everyday use, such as GPS devices and car speedometers. These applications rely on self-selected communities of volunteers to perform data collection and sharing for purposes of mutual interest. Of particular interest to this project are applications that help reduce transportation energy cost and carbon footprint. For example, by sharing data on speed, fuel efficiency, and location of vehicles, better real-time navigation services can be developed that guide drivers to routes that are maximally fuel-efficient for their cars, hence reducing transportation carbon footprint. The testbed facilitates the investigation of several research challenges towards enabling such applications including the investigation of data privacy, energy-efficiency, disruption-tolerant communication, social networking, and management of interactive complexity. No common testbed is currently available that allows researchers to experiment with a live vehicular data collection system of non-trivial size for the purposes of investigating such challenges. By building such a testbed, this project helps usher in a new era of sensing applications with more integration of humans, networks, and the physical world, which may have a significant impact on the economy, energy, and the environment by reducing transportation energy cost and carbon footprint.","title":"II-NEW: Vehicular Instrumentation for Green Sensor-Enabled Research","awardID":"1059294","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["553633","561785"],"PO":["564778"]},"175383":{"abstract":"While not perfect, the depth and breadth of what today's automated analysis tools can figure out about a program is truly remarkable. Yet, despite the prevalence and cost of software defects and despite the wealth of information such automated tools could provide, program analyzers are largely ignored by today's software engineers. This situation is not due to a lack of interest from software engineers or a lack of effort in deployment from analysis experts but rather a gap in the way a tool and its user reasons about the program, which results in, for example, a difficulty in providing analysis results understandable to the user. This research confronts closing this user-tool reasoning gap.<br\/><br\/>The focus of the work is an effective approach to user-driven refinement of the analysis process. Novel techniques for generating explanations of program analysis results will be created. New approaches for trading off the exhaustiveness of compile-time verification and the simplicity of run-time checking will be developed. Together with prior work on user-centric analysis specifications, this project lays the foundation for tomorrow's tools where users and tools cooperate to reason effectively about programs. Significant potential impacts include the following: a change in the way software engineers view program analysis--replacing a magic box with a transparent reasoning assistant, improved software quality as a result of this change in view, and tools that engage students in algorithmic thinking in a hands-on manner.","title":"CAREER: Cooperative Program Analysis: Bridging the Gap Between User and Tool Reasoning","awardID":"1055066","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["518195"],"PO":["565264"]},"175295":{"abstract":"Many natural, social and engineered systems exhibit or facilitate complex behavior. Such behavior often results from the deliberate actions of, and interactions between, a large number of individuals. The need to study behavior in complex systems of network-structured interactions in large populations promotes interest in computational game-theoretic models.<br\/><br\/>Graphical games build on classical models in game theory, as well as compact, structured representations in probabilistic graphical models. The result is a practical and computationally amenable model to handle networked large-population systems.<br\/><br\/>The creation of technology for scientists and policy makers to study and work with large real-world complex systems of (strategic) interactions requires further advances in graphical games and models. The project seeks to fill knowledge gaps by advancing computational aspects of game theory, graphical models and machine learning, and laying the foundation for a systematic two-way knowledge transfer between computational game theory and graphical models.<br\/><br\/>The research program strengthens the connection between graphical models and game theory by casting probabilistic inference problems as equilibrium computation, creating algorithms to learn games from behavioral data, and characterizing equilibrium structure and computation.<br\/><br\/>The educational program includes the infusion of research results into general education, at all levels, via development of new courses and integration into existing ones; and a concerted effort to bridge the Departments of Economics and Computer Science at Stony Brook. Collaborations through the Center for Game Theory in Economics and the International Summer Festival on Game Theory, held annually at Stony Brook, serve as conduits for outreach and dissemination.","title":"CAREER:The Symbiosis of Graphical Models and Games","awardID":"1054541","effectiveDate":"2011-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["486434"],"PO":["562760"]},"177286":{"abstract":"There has been a rapid increase in the number and types of digital networks over the last 2 decades beginning, of course with the Internet, its constituent networks, and the World Wide Web. We now have a wide range of on-line social networks (OSNs) such as Facebook, Twitter, mobile ad hoc networks (MANETs) and delay tolerant networks (DTNs). These networks pervade all aspects of our lives and provide a growing range of services in commerce, business, communications, and connectivity. Many of these networks are continually in a dynamic state of flux and\/or extremely large. For example, the topology of a MANET or a DTN is constantly changing, and that of an OSN such as Facebook is rapidly growing and evolving. The modeling, analysis, and measurement of such networks are challenging, due to their dynamism and sizes. As a consequence, traditional mathematical techniques are not suitable and fundamentally new techniques are needed.<br\/><br\/>This research will focus on three interrelated problems. The first is to develop useful and accurate models that capture the dynamics of today?s social and technological networks. The second is to develop and study a class of techniques for characterizing and searching such networks. These techniques are based on a very simple mechanism, namely to let an agent explore the network by randomly choosing where to go. This is known as a random walk in the mathematics literature and has been shown to exhibit desirable search and characterization properties in static networks that shows promise in dynamic networks. Last, many static networks exhibit what is known as a power law, namely that the distribution for the number of neighbors of a node roughly decays as k&#8722;a where k is the number of neighbors and a is a positive constant greater than one. The third problem is to understand what constitutes a power law in a dynamic network, how this power law comes to be, and what implications there might be regarding the health of the network.<br\/><br\/>Broader Impact. The work will positively impact society by providing a deeper understanding of and a set of tools for managing and monitoring digital networks such as MANETs and OSNs. The project includes a comprehensive dissemination plan including public release of tools for network characterization. The education plan includes cross-specialty seminars, undergraduate involvement in research through a REU site, and international outreach to South America.","title":"NetSE: Medium: Modeling and Analysis of Network Dynamics","awardID":"1065133","effectiveDate":"2011-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":[475281,"545655","526867"],"PO":["564993"]}}