{"108515":{"abstract":"Abstract<br\/><br\/>Effects ranging from very small to very large scales govern physical phenomena such as the evolution of a storm system or the structural deformation of an automobile during an accident. Accurately predicting these by resolving the finest scales in a computer simulation is prohibitively expensive. The investigators are studying how fine scale information impacts coarse scale behavior and vice versa. In effect, \"summarizing\" these relationships allow us to model coarse scale effects accurately and efficiently without the need to explicitly resolve the finest scales in a computation. A key to this study lies in the careful transfer of structures present in the mathematical models of these phenomena (which in essence have infinite resolution) to the computational realm with its finite resolution and finite computational resources. The methods being developed will allow rapid assessment of overall effects with the ability \"to drill down\" computationally where additional detail is required.<br\/><br\/>Physical systems are typically described by a set of continuous equations using tools from geometric mechanics and differential geometry to analyze and capture their properties. For purposes of computation one must derive discrete (in space and time) representations of the underlying equations. Theories which are discrete from the start (rather than discretized after the fact), with key geometric properties built in, can more readily yield robust numerical simulations which are true to the underlying continuous systems: they exactly preserve invariants of the continuous systems in the discrete computational realm. So far these methods have not accounted for effects across scales. Yet both physics and numerical computation require such multi-resolution strategies. This research project is developing a multi-resolution theory for discrete variational methods and discrete differential geometry with applications to thin-shell and fluid modeling. The principal scientific innovation lies in techniques to conserve symmetries across computational scales.","title":"Collaborative: MSPA-MCS: Computational and Mathematical Foundations for the Synthesis of Multiresolution Representations with Variational Integrators and Discrete Geometry","awardID":"0528101","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["448655","320958"],"PO":["565157"]},"108757":{"abstract":"----<br\/>This Partnership for International Research and Education (PIRE) links senior and junior researchers from Johns Hopkins University and Brown University with counterparts from Charles University in the Czech Republic and Saarland University in Germany. The international team, led by Frederick Jelinek at Johns Hopkins, will investigate formal representations of linguistic meaning for use in speech recognition\/reconstruction and machine translation (MT) systems. Their goal is to augment current speech recognition systems by applying a variety of formal models for deep syntactic\/semantic representation so that output of their refined MT system becomes coherent, grammatical text.<br\/><br\/>The projects complementary education component involves introducing participating U.S. graduate students to European-developed linguistic formalisms and training them to apply those formalisms to problems in natural language processing. Students will have language training in Czech or German and will spend at least one semester abroad where they will further their linguistic training in tectogrammatical representation at Charles University or head-driven phrase structure grammar at Saarland University. In the final stages of their Ph.D. program, each will return to the Czech Republic or Germany to work with European mentors on research that incorporates these state-of-the art language processing techniques. <br\/><br\/>Results from the collaborative research, annual workshops and cross-training should advance the field of computational linguistics by integrating formal meaning representations and statistical methods for natural language processing so that modern computer resources can be exploited to more rapidly translate verbal communications from other languages into English. If successful, this work could revolutionize language modeling for automatic speech recognition so that even spontaneous speech may be translated into fluent, reconstructed text that efficiently captures the intended meaning of the original. <br\/><br\/>This interdisciplinary PIRE in computational linguistics fulfills the program objective of advancing scientific knowledge by enabling experts in the United States and Europe to combine complementary talents and share research resources in areas of strong mutual interest and competence. Broader impacts include early career introduction of U.S. graduate students to an international professional network of leading linguists, computational theorists, and experts in human language technology.","title":"PIRE: Investigation of Meaning Representations in Language Understanding for Machine Translation Systems","awardID":"0530118","effectiveDate":"2005-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7742","name":"PIRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["527631","445172","445173","445173","516082","438772"],"PO":["561352"]},"107789":{"abstract":"Abstract<br\/><br\/>Voting systems require end-to-end trustworthiness, commencing with blank ballots and registration lists and concluding with the correct and auditable tallies of the marked ballots, reflecting the choices of the voters. This ballot round trip must resist well financed and organized adversaries that may include the very people who develop, maintain, or deploy the election machinery, and the process must be accessible to all citizens regardless of their disabilities or native language. The center's research investigates software architectures, tamper-resistant hardware, cryptographic protocols, and the role that various verification systems (e.g. paper, audio, cryptographic) can play in electronic voting systems. The center also examines system usability and studies how public policy and administrative procedures can, in combination with technology, better safeguard voting systems. <br\/><br\/>The voting system integrity problem is a paradigmatic hard Cyber Trust problem, requiring trustworthy system architectures, security, integrity, privacy, anonymity, high assurance, and human-machine interfaces. Voting systems must preserve a voter's privacy and anonymity, to reduce risks of voter coercion and bribery, yet they must be sufficiently auditable and transparent to allow for mistakes and errors to be identified and reconciled. This center's research develops a deeper understanding of how to organize, develop, and evaluate not only voting systems, but a wide range of other systems with end-to-end trustworthiness requirements.","title":"Collaborative Research: CT-CS: A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)","awardID":"0524155","effectiveDate":"2005-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["521488","560798"],"PO":["564388"]},"107019":{"abstract":"Recently Internet traffic has almost doubled every year. This continued exponential growth is placing increasing strains on the existing telecommunication infrastructure, which will need to be relieved in order to accommodate future capacity requirements. Today the main bottleneck is at the level of the access network, which resides between the individual subscribers and the central office (CO) operated by the network carrier. The present access services are based on an installed copper-line infrastructure, exhibiting fundamental bandwidth (Mb\/s data rate to each subscriber) and distance limitations. To satisfy the insatiable bandwidth demands for emerging digital services, optical access networks are being standardized and deployed, in which each end user can use a much larger bandwidth (hundreds of Mb\/s to Gb\/s). Recent developments in optical technologies have made the realization of the optical access network feasible and cost-effective for wide deployment.<br\/><br\/>Once the broadband optical access network prevails, the aggregate demand will overwhelm the bandwidth provisioning of the current network infrastructure based on Internet protocol (IP) routers. Metropolitan area networks (MAN) connect the Internet backbone and local access points, typically spanning tens of miles. Traditionally, SONET has been deployed to provide circuit links for the voice traffic. Due to the exponentially increasing data traffic generated by Internet applications, many research and standardization efforts are aiming to provide alternate high-capacity MAN architecture and technology. (e.g. RPR, Metro Ethernet, etc.) <br\/><br\/>To facilitate the evolution of the current network toward the next generation optical networks, the principal investigator (PI) will investigate the novel MARIN (Metro and Access Rings Integrated Network) architecture. MARIN is an integrated network that fuses the access networks and the MAN, and makes use of wavelength division multiplexing (WDM) ring technology and wavelength conversion for removing the current and anticipated limitations of both access network and MAN. It will have the following important characteristics:<br\/> (i) WDM ring technology integrating MAN and access network, providing high capacity;<br\/> (ii) Highly scalable as the number of users grows and the data rate increases;<br\/> (iii) Suitable for smooth transition from legacy networks to the future optical networks;<br\/> (iv) High-speed optical routing based on Optical Burst Switching (OBS); and <br\/> (v) Exploiting wavelength conversion to facilitate routing for high speed and low latency.<br\/> <br\/>The PI will investigate in detail the feasibility of the proposed MARIN architecture. The PI will perform investigations in the areas of access networks, MAN, and OBS with advanced wavelength conversion, which will become more integrated as time progresses. <br\/><br\/>Broader Impact: This work will have a broader impact beyond the narrow achievement of the technical goals. If some of the goals are reached, the MARIN architecture could influence the way future communication networks are designed. Hence, this work could have a sizeable economic impact. In addition, by improving the performance of communication systems, this work could facilitate the way people communicate via Internet and other means, which is currently revolutionizing the way people interact and work.","title":"NeTS-NBD: Metro and Access Rings Integrated Network (MARIN)","awardID":"0520291","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[282251,"483588"],"PO":["565090"]},"110176":{"abstract":"The project will apply the Dynamic Data Driven Applications Systems (DDDAS) methodology for assessment of fluid-thermal systems using combined experiment and simulation. Engineering applications involving fluid-thermal systems are characterized by complex three-dimensional flows with incomplete knowledge of boundary conditions in critical subsystems and limited access for experimental diagnostics. An example is the combustor in a turbofan engine wherein the thermal boundary conditions on the combustor can surface are not known a priori (i.e., the surface temperature distribution is not known) and access for optical diagnostics is severely limited. The DDDAS-based methodology synergizes experiment and simulation to achieve an assessment of the fluid-thermal system; in particular, to determine the surface temperature distribution to a reasonable level of accuracy. The specific application is a turbulent jet injected normally into a subsonic or supersonic equilibrium turbulent boundary layer. By analogy to a combustor or furnace, the experimental diagnostics are assumed to be limited to optical measurements (specifically, diode laser absorbance at various wavelengths) within a restricted region (to simulate limited access in the actual configuration, e.g., combustor). Simulations will be performed using the three-dimensional Reynolds-averaged Navier-Stokes equations with the k-e model of turbulence. Both non-reacting and reacting flows will be considered.<br\/><br\/>The proposed DDDAS-based methodology for assessment of fluid-thermal systems using experiment and simulation has potentially broader applications in engineering systems (e.g., chemical and biochemical engineering, civil engineering, etc).","title":"DDDAS-SEP: Application of DDDAS to Assessment of Thermal Systems Using Combined Experiment and Simulation","awardID":"0539152","effectiveDate":"2005-10-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["561752",291875,291876],"PO":["301532"]},"107800":{"abstract":"Abstract<br\/><br\/>Voting systems require end-to-end trustworthiness, commencing with blank ballots and registration lists and concluding with the correct and auditable tallies of the marked ballots, reflecting the choices of the voters. This ballot round trip must resist well financed and organized adversaries that may include the very people who develop, maintain, or deploy the election machinery, and the process must be accessible to all citizens regardless of their disabilities or native language. The center's research investigates software architectures, tamper-resistant hardware, cryptographic protocols, and the role that various verification systems (e.g. paper, audio, cryptographic) can play in electronic voting systems. The center also examines system usability and studies how public policy and administrative procedures can, in combination with technology, better safeguard voting systems. <br\/><br\/>The voting system integrity problem is a paradigmatic hard Cyber Trust problem, requiring trustworthy system architectures, security, integrity, privacy, anonymity, high assurance, and human-machine interfaces. Voting systems must preserve a voter's privacy and anonymity, to reduce risks of voter coercion and bribery, yet they must be sufficiently auditable and transparent to allow for mistakes and errors to be identified and reconciled. This center's research develops a deeper understanding of how to organize, develop, and evaluate not only voting systems, but a wide range of other systems with end-to-end trustworthiness requirements.","title":"Collaborative Research: CT-CS: A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)","awardID":"0524211","effectiveDate":"2005-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["548177","371256"],"PO":["564388"]},"107867":{"abstract":"Abstract<br\/><br\/>Voting systems require end-to-end trustworthiness, commencing with blank ballots and registration lists and concluding with the correct and auditable tallies of the marked ballots, reflecting the choices of the voters. This ballot round trip must resist well financed and organized adversaries that may include the very people who develop, maintain, or deploy the election machinery, and the process must be accessible to all citizens regardless of their disabilities or native language. The center's research investigates software architectures, tamper-resistant hardware, cryptographic protocols, and the role that various verification systems (e.g. paper, audio, cryptographic) can play in electronic voting systems. The center also examines system usability and studies how public policy and administrative procedures can, in combination with technology, better safeguard voting systems. <br\/><br\/>The voting system integrity problem is a paradigmatic hard Cyber Trust problem, requiring trustworthy system architectures, security, integrity, privacy, anonymity, high assurance, and human-machine interfaces. Voting systems must preserve a voter's privacy and anonymity, to reduce risks of voter coercion and bribery, yet they must be sufficiently auditable and transparent to allow for mistakes and errors to be identified and reconciled. This center's research develops a deeper understanding of how to organize, develop, and evaluate not only voting systems, but a wide range of other systems with end-to-end trustworthiness requirements.","title":"Collaborative Research: CT-CS: A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)","awardID":"0524745","effectiveDate":"2005-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["550026",284954],"PO":["564388"]},"107878":{"abstract":"NSF 0524815<br\/><br\/>Implementing Provably Correct High-Performance Ciphers with Sketching<br\/><br\/>Rastislav Bodik<br\/><br\/>This research exploits widespread inexpensive parallel hardware ---such as multimedia extensions, graphics co-processors, and upcoming multi-core processors --- for dramatic improvements in cipher performance. The goal is to (i) make security used where performance currently prohibits it (such as encrypting files on laptops and cell phones) and (ii) simplify the complex performance-security tradeoffs made in designing secure systems.<br\/><br\/>The technical novelty is to implement ciphers with sketching. Programming with sketches is a semi-automatic approach for high-performance applications. Sketching is a search-based approach that both simplifies programming and guarantees full correctness of the resulting implementation. With sketching, programmers write clean and portable reference code, and then obtain a high-quality implementation by simply sketching an outline of the desired implementation. The compiler then fills in the missing detail. The detail is filled in by searching for such \"completions'' of the sketch that are guaranteed to implement the reference code.","title":"CT-ISG: Implementing Provably Correct High-Performance Ciphers with Sketching","awardID":"0524815","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["556819"],"PO":["521752"]},"112993":{"abstract":"PROPOSAL: 0553518<br\/>INSTITUTION: Florida State University<br\/>PI: Michael Frank<br\/>TITLE: Travel Support for Junior Researchers Attending the Workshop on Frontiers of Extreme Computing<br\/><br\/>A workshop on \"The Frontiers of Extreme Computing: Transitioning Moore's Law to the Next Generation\" (www.zettaflops.org) took place October 23- 27 2005 in Santa Cruz, California,. This workshop is an interdisciplinary meeting which aims to call attention to a range of important but not widely-known potential solutions for moving beyond near-term barriers to substantial further improvements in computer performance. The workshop identified important supercomputing applications, matched these against several technologies and programming methods, and determined the suitability of each application at several scale levels. The resulting matrix is a component of a roadmap for further supercomputer development. This award provided travel support for junior researchers.<br\/><br\/>The results of the workshop will be disseminated widely over the Internet.","title":"Travel Support For Junior Researchers Attending The Workshop On Frontiers Of Extreme Computing; October 23-27, 2005; Santa Cruz, CA","awardID":"0553518","effectiveDate":"2005-10-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["490227"],"PO":["549626"]},"110155":{"abstract":"Scientists and engineers, as well as the general public, are becoming increasingly aware of the threat that solar disturbances pose to humans and technological systems. To improve space weather prediction, this project combines a physics-based model of the ionosphere and thermosphere with targeted measurements, a process known as targeted data assimilation. The proposed research includes extensions of data assimilation algorithms to address nonlinear dynamics, model error, and computational complexity. Dynamically steered experiments involving the Millstone Observatory and EISCAT incoherent scatter radars will demonstrate the ability of targeted data assimilation to improve the quality and value of measurements for space weather prediction. The proposed research is relevant to NOAA. The project's goal is to improve space weather prediction in the ionosphere and thermosphere. The ability to predict the effects of solar storms is needed to protect humans and technological systems. Humans in manned spaced flight, as well as in commercial aircraft, are affected by solar storms, and total radiation dosages are a growing concern. Technological systems are also affected. For example, magnetic field fluctuations induce currents in electric power lines, which can damage components of the power grid causing blackouts and substantial economic losses. The accuracy of GPS,widely used for military and commercial operations, is commonly degraded by these events. The proposed research will greatly benefit the incoherent scatter radar (ISR) community. Since ISRs require high power, they are extremely expensive to run, and thus every radar experiment must be chosen for maximal efficiency. This efficiency is difficult to achieve in practice, however, since radars work in different modes and scan different parts of the ionosphere. This project will improve ISR efficiency by allowing operators to observe what may be happening if the radar mode or look direction were changed. This methodology will fundamentally change the way radars are run, since operators will be able to make informed decisions on what science they can accomplish by changing modes. When an experiment is not yielding useful results, operators will be able examine model results that simulate alternative radar modes, and thus dynamically switch experiments. This ability will dramatically improve the efficiency of the radars.","title":"DDDAS-SMRP:Targeted Data Assimilation for Disturbance-Driven Systems: Space Weather Forcasting in the Ionosphere and Thermosphere Using a Dynamically Steered Incoherent Scatter Ra","awardID":"0539053","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"S115","name":"NOAA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T270","name":"NOAA-DDDAS-HEC"}}],"PIcoPI":["507685","529154"],"PO":["551712"]},"112047":{"abstract":"0549443\/0549456<br\/>Beach\/Ibarra<br\/><br\/>This Americas Program award will support a program development workshop organized by Dr. James H. Beach of the University of Kansas Center for Research and Dr. Julio Ibarra of Florida International University. The workshop, which will be jointly sponsored by various science agencies of Mexico, Panama, Costa Rica and Colombia, will be concerned with applications of new tools and working methodologies to biodiversity. These tools derive from advances in computing, related information technologies, and the growing infrastructure-the cyberinfrastructure-that is currently under development globally. The workshop will be held in Panama City, early in January 2006 and will explore opportunities and breakthrough activities with the aim of promoting future collaborations in biodiversity informatics and research. <br\/><br\/>Prior to the availability of ubiquitous data network connectivity, biodiversity research collaborations required face-to-face professional interactions in the form of field work, in-residence stays, or other kinds of visits, and relied mainly on paper documents and mail for remote coordination and communication. Today many research communities, including the systematics, phylogenetics and ecology communities, are on the cusp of transformative change as a consequence of network capacity that will enable a new class of research collaboration based on instant interaction with networked information servers and computational services, in a paradigm known as \"Grid Computing.\" High throughput international backbones linking desktops of scientists around the world will help launch a new class of research collaborations with scientists \"wired together\" in a virtual, global, biodiversity collaboration environment.<br\/><br\/>To set the stage and prepare for this transformation in research communications among North and Central American countries, the workshop will include 40-50 invited leading biology researchers, cyberinfrastructure technologists, and funding agency representatives from the United States, Mexico, Panama, Costa Rica, Colombia, and various other Central American countries. It will be focused on identifying activities that will enable North and Central American partnerships and collaborations. Outcomes will include recommendations for follow-on activities and suggestions for investments to promote international informatics collaboration. The broader impacts of the meeting will, ultimately, lead to new modes of collaboration, supporting biodiversity research and analysis for policy and planning, to better understand the ecological and societal impacts of global biodiversity. This workshop is being jointly supported by the Division of Environmental Biology, the Office of Cyberinfrastructure, and the Office of International Science and Engineering.","title":"Americas Program Workshop: Cyberinfrastructure for International Biodiversity Research Collaboration; Panama; January 2006","awardID":"0549456","effectiveDate":"2005-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["564024","564025"],"PO":["531406"]},"107406":{"abstract":"This project, developing a platform for research and training to serve as an instrument for evaluating robotic subsystem and supersystem performance, accelerates and enhances the evolution of autonomous vehicle subsystems and component parts by providing a baseline instrument to measure and assess the performance and capabilities of the various portions of a given autonomous vehicle design. This Autonomous Robotic Vehicle Instrument (ARVIN) is designed to allow simultaneous, parallel operation of multiple instruments, actuators, and software\/hardware subsystems. Due to the common environment in which the items are operating, the ARVIN yields a precise, robust metric of comparative performance and capability of the item in question. Inherently rapidly reconfigurable by design of its network-centric architecture, the ARVIN enables quick, easy substitutions and augmentations of sensors and actuators on the evaluation platform; it is not a set of identical robot structures that join and reform to move or climb.<br\/>The ARWIN tests, simulates, and validates subsystems and components in three tightly coupled hierarchical areas acknowledge as critical to advances in robotics vehicles:<br\/>-Guidance, Navigation, and Control (GNC),<br\/>-Sensor and Actuators Suites, and<br\/>-Software and Network Architectures.<br\/>The Autonomous Robotic Vehicle Instrument consists of an Argo Conquest 6x6 Off-road\/Amphibious vehicle, heavily modified, and a Hardware-in-the-Loop (HIL) simulator for the vehicle. The vehicle will be fitted with ultrasonic sonar and SICK LiDAR for collision avoidance, fiber optic gyros, IMU's, and NavCom STARFIRE differential GPS receivers for guidance, a Pentium class PC-104 stack with high speed communication networks for control, and a Videre MEGA-STC-VAR stereoscopic high speed color camera for vision capture.<br\/>In general, due to the incredibly high cost (in time and money) of constructing an autonomous vehicle of any kind, designs are rarely modified unless the mission cannot be completed by the original vehicle design. Very rarely are the initial trade-off studies revisited and explored to see what might have been done differently. Thus, the ARVIN should have profound impact on the kind of trade-off studies that most autonomous vehicle design programs have to-date been missing. <br\/><br\/>Broader Impact: ARVIN allows students and researchers to gain experience on an actual, physical, autonomous rover. This kind of practical training in systems integration, sensor fusion, software architecture for real-time systems, and actual control systems implementations has much to offer. The Naval Postgraduate School and the Intelligent Robotics Group (IRG) at NASA-Ames has indicated interest and enthusiasm in collaborating and experimenting with the modular chassis that will result of the ARVIN. Contributing to further understand trade-offs for mobile robotics, the platforms will also be used for outreach. The ARVIN infrastructure should become a cost-effective general robotics toll that may be easily replicated at other institutions.","title":"MRI: Development of an Autonomous Robotic Vehicle Instrument (ARVIN)","awardID":"0521675","effectiveDate":"2005-10-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["553514","535214","390671"],"PO":["557609"]},"110673":{"abstract":"Silver Buffalo Consulting is requesting support to begin a dialogue between members of the Native American Science Academy and Western scientists on ways to utilize advances in IT to represent Indigenous science concepts. The immediate goal is to have Native Americans knowledge holders and Western scientists meet and begin a dialogue. The long range goal (beyond the scope of this project) is to develop the IT needed to preserve native science and make it accessible to Native students. An additional result would be the articulation of a set of research problems that would engage Native American students in computing.","title":"Broadening Participation of Native Americans in Computer Science Using Indigenous Dialogue","awardID":"0541628","effectiveDate":"2005-10-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":["423641"],"PO":["561855"]},"110365":{"abstract":"The project is aimed at developing a variable light wave sensor array that we will integrate into an ocean observational system. This system will be superior to most near coastal ocean models, which are typically wind driven but not contamination transport driven, in that our new model will be both. These objectives will be accomplished through the dynamic injection of observed ocean data into multiscale mathematical models and computer simulations. The project will create research topics in multiscale mathematics, statistics, and software application integration with a flexible, Grid-based<br\/>database and problem solving environment. The project will follow an integrated approach that addresses technical issues at each step of the process: 1) the dynamic simulation instructs the sensors what to look for and reprograms it for those analytes, 2) the sensors report to the simulation the new observed data, and 3) the simulation then incorporates the new data, updates its predictions, and reprograms the sensors as necessary in a closed loop. We will reduce the amount of human intervention needed to monitor spills and other contamination events, making DDDAS viable for sensors going to locations that are difficult to communicate with the sensors in real-time (e.g., an unreliable satellite link or another planetary body in the future). The work will build on the successful results of research previously funded by the NSF, including the SURA Coastal Ocean Observation and Prediction and two ITR projects to develop algorithms, error controls, and<br\/>middleware to optimally manage provably scalable computing resources for Grid computing. The project has the ultimate objective to guide the development of hardware and software to enable performing both lab and ocean test, but these tasks will be relegated for follow-on efforts to the present project. Both academic and industrial partners will be involved in the present effort. The research in this project will be extendable to other application environments.","title":"DDDAS-TMRP: Collaborative Research: Adaptive Data-Driven Sensor Configuration, Modeling, and Deployment for Oil, Chemical, and Biological Contamination near Coastal Facilities","awardID":"0540178","effectiveDate":"2005-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":[292312,"495104"],"PO":["551712"]},"110398":{"abstract":"Coordinated Control of Multiple Mobile Observing <br\/>Platforms for Weather Forecast Improvement<br\/>Jonathan How, Nicholas Roy, and Jim Hansen<br\/>Massachusetts Institute of Technology<br\/><br\/>Accurate predictions of natural phenomena rely on accurate physical models, good computer simulations, and accurate estimates of the current state of the system. For example, predicting storms over California several days in advance requires good models of the weather development and precise and accurate knowledge of weather variables such as temperature and pressure in distributed regions of the Pacific. Acquiring this precise knowledge of the current system state typically requires a large number of sensor measurements, but the quality of the subsequent prediction is a strong function of both the total sensor resources available (number and kind of sensors), and also how the sensors are used (the spatio-temporal distribution of the sensors). Current sensor systems fly a few manned planes with long time horizons, selecting from a handful of possible flight paths. While useful, the resulting measurement strategies are essentially uncoordinated, preprogrammed and not easily modified. There are often inconsistencies between the assumptions in the data assimilation, ensemble construction (Monte Carlo sampling), and targeting methodologies, which lead to sub-optimal plans for data gathering. UAVs have been developed to reduce the costs of manned flights, and we envisage a scenario with multiple UAVs using distributed sensing techniques to significantly reduce the planner response times. Our research will lead to a new framework for coordinating this team of mobile sensing assets that provides more efficient measurement strategies and a more accurate means of capturing spatial correlations in weather system dynamics. We will also demonstrate the importance of using consistent strategies for the data assimilation, ensemble construction, and targeting. The key step in this work will be to exploit the structure inherent in weather system dynamics to develop a unique hybrid central\/distributed planning strategy that uses both multi-resolution optimization techniques to solve the global task assignment and reinforcement learning to solve the local task planning problems. The planning algorithms resulting from this work will be applicable to a wide range of systems that also exhibit strong coupling through both the information (measurements taken by one influence the world models of all) and the tasks (standard conflict avoidance).<br\/><br\/>This research will facilitate a strong linkage between the nonlinear weather prediction and planning\/control communities. By synergistically combining technologies from two diverse fields, our research effort within the DDDAS program will develop a new measurement strategy for weather prediction that closely links model predictions and adaptive observations. Our work will extend and apply new coordination techniques for teams of UAVs that have been recently developed for other (mainly DoD) applications. This represents a paradigm shift in active weather sensing models, in that this project will be the first to show how a network of mobile sensors can be used efficiently to optimize the data gathering that drives predictions of natural phenomena such as weather. Our results could lead to substantially better weather predictions, which in the future could save lives and money.","title":"DDDAS-SMRP: Coordinated Control of Multiple Mobile Observing Platforms for Weather Forecast Improvement","awardID":"0540331","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T270","name":"NOAA-DDDAS-HEC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":[292418,292419,"485514"],"PO":["532987"]},"107802":{"abstract":"A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)<br\/><br\/>PI: Aviel D. Rubin, Johns Hopkins University<br\/><br\/>Abstract<br\/><br\/>Voting systems require end-to-end trustworthiness, commencing with blank ballots and registration lists and concluding with the correct and auditable tallies of the marked ballots, reflecting the choices of the voters. This ballot round trip must resist well financed and organized adversaries that may include the very people who develop, maintain, or deploy the election machinery, and the process must be accessible to all citizens regardless of their disabilities or native language. The center's research investigates software architectures, tamper-resistant hardware, cryptographic protocols, and the role that various verification systems (e.g. paper, audio, cryptographic) can play in electronic voting systems. The center also examines system usability and studies how public policy and administrative procedures can, in combination with technology, better safeguard voting systems. <br\/><br\/>The voting system integrity problem is a paradigmatic hard Cyber Trust problem, requiring trustworthy system architectures, security, integrity, privacy, anonymity, high assurance, and human-machine interfaces. Voting systems must preserve a voter's privacy and anonymity, to reduce risks of voter coercion and bribery, yet they must be sufficiently auditable and transparent to allow for mistakes and errors to be identified and reconciled. This center's research develops a deeper understanding of how to organize, develop, and evaluate not only voting systems, but a wide range of other systems with end-to-end trustworthiness requirements.","title":"Collaborative Research: CT-CS: A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)","awardID":"0524252","effectiveDate":"2005-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["553563"],"PO":["564388"]},"105624":{"abstract":"This Pan-American Advanced Studies Institute (PASI) award, jointly supported by the NSF and Department of Energy (DOE), will take place at the Universidad Autonoma \"Benito Juarez\" de Oaxaca, Mexico, in July 2006 on the topic of computational science and engineering. The Institute, organized by Dr. Jose E. Castillo, San Diego State University, will consist of a combination of lectures, short courses, discussions and hands-on computer labs. It will involve approximately 40 participants from the United States and Latin America, including graduate students and junior and established investigators, and about 8 instructors (internationally recognized scientists, active in the field). <br\/><br\/>The content of the courses will include research in areas of computational fluid dynamics, numerical optimization, parallel computing, grid generation, scientific visualization and numerical linear algebra. Special presentations by renowned scientists from industry and academia on the above and other appropriate topics will be given. The program will introduce students to the realm of current methods of research utilized in the US and other advanced countries. These activities will promote collaborative efforts among researchers in the field of computer and engineering sciences of the western hemisphere. Materials presented at the Institute will be posted in a designated web site for further dissemination to the scientific community and to the public at large.","title":"Pan-American Advanced Studies Institute (PASI) on Computational Science and Engineering; Oaxaca, Mexico; July 2006","awardID":"0513400","effectiveDate":"2005-10-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"T102","name":"ENERGY-PASI"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}}],"PIcoPI":["537485"],"PO":["531406"]},"107824":{"abstract":"NSF 0524432<br\/><br\/>TITLE: CT-T: A System Structure for Secretless Security<br\/><br\/>PI: John C. Knight<br\/><br\/>This project develops a new approach to software service protection based on tailored program diversity. Systems using the approach have two valuable properties: (1) proofs can be constructed showing that the systems cannot be compromised by a class of attacks, no matter what vulnerabilities exist in the service; and (2) their protection does not depend on keeping any secrets. The basis of the approach is the observation that, without affecting the normal operation of a program, the set of acceptable states for the program can be reduced by imposing artificial execution constraints. Examples of such constraints include limiting the addresses or instructions that the program can use. An artificial constraint is imposed mechanically by a compiler, linker, or run-time system on a server to produce a variant. A system is constructed in which two or more different variants operate in parallel on the same input, thereby producing a system with an overall constraint that is the intersection of the constraints of the variants. With appropriate choices of the constraints for the variants, the overall constraint can be made unsatisfiable. For example, by partitioning the address space between the two variants, any attack that requires referencing an absolute address must fail. Attacks cannot succeed because to do so would require satisfying the unsatisfiable constraint.","title":"CT-T: A System Structure for Secretless Security","awardID":"0524432","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}}],"PIcoPI":["402466","385658","483825","339851",284815],"PO":["529429"]},"110355":{"abstract":"The project is aimed at developing a variable light wave sensor array that we will integrate into an ocean observational system. This system will be superior to most near coastal ocean models, which are typically wind driven but not contamination transport driven, in that our new model will be both. These objectives will be accomplished through the dynamic injection of observed ocean data into multiscale mathematical models and computer simulations. The project will create research topics in multiscale mathematics, statistics, and software application integration with a flexible, Grid-based<br\/>database and problem solving environment. The project will follow an integrated approach that addresses technical issues at each step of the process: 1) the dynamic simulation instructs the sensors what to look for and reprograms it for those analytes, 2) the sensors report to the simulation the new observed data, and 3) the simulation then incorporates the new data, updates its predictions, and reprograms the sensors as necessary in a closed loop. We will reduce the amount of human intervention needed to monitor spills and other contamination events, making DDDAS viable for sensors going to locations that are difficult to communicate with the sensors in real-time (e.g., an unreliable satellite link or another planetary body in the future). The work will build on the successful results of research previously funded by the NSF, including the SURA Coastal Ocean Observation and Prediction and two ITR projects to develop algorithms, error controls, and<br\/>middleware to optimally manage provably scalable computing resources for Grid computing. The project has the ultimate objective to guide the development of hardware and software to enable performing both lab and ocean test, but these tasks will be relegated for follow-on efforts to the present project. Both academic and industrial partners will be involved in the present effort. The research in this project will be extendable to other application environments.","title":"DDDAS-TMRP: Collaborative Research: Adaptive Data-Driven Sensor Configuration, Modeling, and Deployment for Oil, Chemical, and Biological Contamination near Coastal Facilities","awardID":"0540136","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":[292276,"450789","423015","423015","513669"],"PO":["551712"]},"104767":{"abstract":"One of the most pressing issues faced by today's IT researchers is how to provide a distributed server infrastructure to accommodate the exponentially increasing web accesses. This project considers web services consisting of geographically distributed servers, client caching, proxy caching, and distributed searching in a virtual network, embedded on top of a physical network. A set of software techniques is developed based on peer-to-peer (P2P) algorithms to achieve optimal overall performance and reliability with existing hardware\/software resources. The project is carried out jointly at University of California, Riverside and Suffolk University. Researchers from HP Laboratories are involved as senior personnel.<br\/><br\/>The web server, considered in this project, consists of geographically distributed heterogeneous nodes in a network based on different functionalities and applications of the web service. Clustering techniques are developed to create suitable P2P structures keeping in mind the topological properties of the Internet systems. Inside the cluster, scalable, efficient and high performance overlay network architectures are identified for web services. Efficient cooperative proxy cache placement and management mechanisms are developed in the virtual network following distributed shared memory (DSM) approaches. Proxy servers are combined with P2P clusters consisting of browser (client) caches, and a cooperative caching strategy is designed at the proxy level by embedding tree structures and directory schemes. Extensive software implementation, simulation, testing and evaluation are carried out using the PlanetLab distributed environment.","title":"Collaborative Research: Software Architectures for Distributed Web Services Based on Peer-to-Peer Technologies","awardID":"0509207","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["390528"],"PO":["561889"]},"110367":{"abstract":"The chemical reaction network of cellular metabolism is one of the most highly conserved features of organisms. It is also a key target of disease treatment, with several important drugs inhibiting the biosynthesis of DNS and RNA precursors (nucleotide metabolism). Recent advances in systems biology, analytical chemistry, and computer science provide the opportunity to begin construction quantitative, dynamic models of the integrated behavior of bionetworks like nucleotide metabolism. A major barrier to obtaining accurate dynamic models, however, lies in the difficulty of extracting the quantitative models from noisy experimental data, given nonlinear network behavior and the limited number of laboratory measurements. The proposed research aims to develop a closed-loop identification machine for molecular bionetworks (CLIMB) to enable reliable and cost-effective model identification through iterative rounds of computation and computation-guided experimentation. CLIMB involves two core computational components, (1) a control module which designs optimized chemical fluxes for application to the target network for the purpose of parameter identification, and (2) an inversion module which calculates feasible parameter values based on the experimental results. The features that distinguish CLIMB from traditional adaptive identification techniques include the utilization of a non linear, global inversion algorithm to extract the distribution of model parameters consistent with the experimental measurements, and the utilization of this parameter distribution in a nonlinear, closed-loop learning control algorithm to guide further experiments. The CLIMB technique will be fully developed and applied to achieve a quantitative understanding of the nucleotide metabolism of E. coli and S. cerevisiae. CLIMB-designed chemical influxes will be introduced to the nutrient-limited, steady-state cultures of living cells. The dynamic response of the metabolic network will be monitored by analyzing intracellular nucleotide content during and after application of the CLIMB-designed chemical flux. The intellectual merit of the proposed research lies in applying iterative rounds of computation and experimentation to handle network identification challenges too difficult for classical approaches. It further lies in designing computational modules suitable for the real-world challenges of highly nonlinear networks and limited, noisy measurements. Finally, the effort will culminate in streamlined integration of computation with culture, collection, and metabolomic measurement of growing cells.","title":"DDDAS-SMRP: Development of a closed-loop identification machine for bionetworks (CLIMB) and its application to nucleotide metabolism","awardID":"0540181","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T272","name":"NIH-DDAS-HEC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T546","name":"NIH-DDDAS-HEC"}}],"PIcoPI":["426237","471785"],"PO":["551712"]},"110037":{"abstract":"The project will develop and validate with field experiments a new truly dynamic approach in forecasting the ocean state and associated uncertainties based on low-dimensional stochastic modeling that exploits the multiscale dynamics of the multivariate ocean. The main idea is to employ a few time-evolving POD (proper orthogonal decomposition) modes to parametrize the slow manifold, and subsequently to advance the solution<br\/>with a large time step using a Galerkin-free\/equation-free procedure. This approach is fundamentally different from the standard Galerkin method used often to produce evolution equations for reduced order modeling. Specifically, the new method uses only bursts of full simulations based on the Regional Ocean Model System (ROMS) and available experimental data, providing in essence a \"closure-on-demand\", in order to perform an equation-free time evolution. In such multiscale approach, the full simulation through ROMS resolves the fine scales whereas the Galerkin-free\/POD method - the coarse component - propagates with large time steps the most energetic modes of velocity, temperature and salinity and corresponding uncertainty fields.<br\/>Preliminary simulations using realistic data for the Massachusetts Bay suggest that<br\/>only a few modes are sufficient in describing the most interesting ocean dynamics, and that time steps of a few hours, instead of seconds or minutes, can be used in the Galerkin- free procedure. These results demonstrate feasibility of the proposed approach and imply that such fast predictions requiring very small computational cost and communications can indeed be performed on board of autonomous underwater vehicles (AUVs). Hence, these AUVs are endowed with navigation intelligence and true autonomy. This approach will be verified with full ROMS simulations and will be validated with three field experiments in the Cape Cod Bay. The final experiment in the third year of the<br\/>program will demonstrate the DDDAS concept in ocean forecasting. The project will<br\/>leverage the AUV fleet and other measurement resources as well as unique expertise for such missions of the MIT Sea Grant. The overall contribution of this project is a new paradigm in predicting the ocean state in real-time. Fundamental specific contributions include construction of time-dependent covariance kernels required in obtaining time-evolving POD modes; numerical analysis of the projective time-integration involved in the Galerkin-free multiscale procedure; representation of stochasticity via adaptive generalized polynomial chaos for uncertainty predictions; and rigorous protocols for data gathering in the ocean in the spirit of DDDAS.","title":"DDDAS-Collaborative Proposal: Multiscale Data-Driven POD-Based Prediction of the Ocean","awardID":"0538373","effectiveDate":"2005-10-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T270","name":"NOAA-DDDAS-HEC"}}],"PIcoPI":[291415,"517149"],"PO":["301532"]},"106825":{"abstract":"What helps us to recognize people on the basis of their speech alone? Are there properties in the speech signal that will help us recognize people even if they are trying to conceal their identity? With support from the National Science Foundation, Dr. Carol Espy-Wilson will conduct research to answer these questions and to develop automatic algorithms that will reliably extract speaker-specific information from the speech signal. This research will bring together knowledge from speech production and speech perception. The broader impacts of this project include applications to diagnostic tools for various speech disorders, the development of speech training aids, the development of personalized human-computer interaction, speech recognition, and a deeper understanding of the articulatory-to-acoustic mapping. This project integrates research and education by furthering the development of speech-related courses at the University of Maryland at College Park, and providing opportunities for undergraduate and graduate students to participate in research.","title":"The Development of Low-Level Speaker-Specific Information for Speaker Recognition","awardID":"0519256","effectiveDate":"2005-10-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T445","name":"NSA-LOW LEVEL SPEAKER"}}],"PIcoPI":["508500"],"PO":["564500"]},"107815":{"abstract":"The easy access and wide usage of the Internet makes it a prime target and conduit for malicious activities. It constitutes a critical infrastructure in the economic and social fabric of, not only our nation, but the developed and, increasingly, the developing world. Recently, the Internet has become a powerful mechanism for propagating malicious software programs. These have been designed to annoy (e.g., deface web pages), spread misinformation (e.g., false news reports or stock quotes), deny service (e.g., corrupt hard disks), steal financial information (e.g., VISA card numbers), enable remote login (e.g., Trojan horses), etc. Moreover, they have been used to disrupt normal operations within the Internet itself. Furthermore, the potential for significant network disruptions is extremely high. It is well known that a single misconfigured BGP router on April 25th, 1997 effectively shut down most of the major Internet backbones for up to two hours, unleashing a sequence of cascading failures. If an accidentally misconfigured router can wreak such havoc, one can only imagine what a carefully orchestrated attack can produce in the way of disruptions.<br\/><br\/>Although malicious activities have appeared on many occasions, to date there appears to be no well-defined methodology for predicting their behavior and the damage that they can cause. This proposal describes research aimed at developing sound mathematically-based methodologies that can be used to better understand the characteristics of different network attacks, and to detect and estimate their parameters. More specifically, the proposed research will focus on the following areas.<br\/><br\/>o Mathematical models of network attacks. The researcher will develop a modelling methodology based on fluid models and networked Markov chains (NMCs). These models will be used to answer questions such as: how does network topology affect the spread of an Internet worm? What conditions must an attack meet to be considered virulent (severe)?<br\/><br\/>o Detection and parameter estimation. The researchers will develop detection and parameter estimation techniques for different types of monitors, based on the exponential growth trend in the early stage of the network attacks, with fluid models and point process models, respectively. They will also develop \"hypothesis testing\" based detection methods and study the performance and the impact in the defense strategies.<br\/><br\/>Furthermore, the analysis methodology produced by this research will have broad applicability in the design and analysis of failure and attack scenarios in large complex man made systems such as the power grid.<br\/><br\/>Intellectual Merit: This project will generate new techniques for studying and detecting different network attacks (e.g., worms, email viruses, BGP infrastructure attacks). Furthermore, the project will enhance our understanding of how failures can propagate throughout a large distributed system like the Internet, and, more generally, large man-made systems.<br\/><br\/>Broader Impact: The project integrates research and education of graduate and undergraduate students through the close interaction and mentoring of students by project faculty. We will also seek international involvement with Universities in Brazil in the form of joint courses\/seminars.","title":"CT-ISG: Modeling, Estimation, and Defense against Network Attacks","awardID":"0524323","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["545655","526867"],"PO":["529429"]},"112942":{"abstract":"This project is developing protocols that exploit the predictability of the node movements to improve the performance of MANETs in terms of reliability, delay, capacity, or other measures. These protocols will operate at the media access control (MAC) and network (routing and forwarding) layers. The protocols are aimed at increasing the network scalability and reliability by: (1) predicting when a route is about to break well in advance of any other prediction techniques (e.g., based on signal strength); (2) finding a new route (or just patching it) by using only local information (the new route does not have to be available at the time it is sought, but, rather, at the time it will be needed - just before the current one breaks); (3) selecting routes optimized for long-life, thus, further reducing the number of route interruptions. This effort will have impact on the fundamental assumptions of mobile ad hoc networking as well as on graduate student education.","title":"SGER-Predictable Mobile Ad-Hoc Networks","awardID":"0553247","effectiveDate":"2005-10-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["526944"],"PO":["7594"]},"112337":{"abstract":"This project is addressing the following questions:<br\/>(1) What dynamic spectrum sharing mechanisms provide the most benefit to both types of users? Preemptive spectrum use by public safety users may incur undue cost to commercial users which have their connections cut. At the other extreme, simple sharing that allocates channels whenever available regardless of caller type may incur too high a blocking to public safety. Many intermediate mechanisms can be formulated. These mechanisms can all be compared with the current mechanism that divides the total bandwidth into rigidly segregated public safety and commercial sub-bands. <br\/>(2) What is the cost of choosing these different mechanisms in terms of blocking for public safety users and economic cost to commercial users?<br\/><br\/>This project is developing methods that will allow a more precise characterization of the benefit of sharing mechanisms and techniques for more optimal sharing mechanisms. Methods that draw on reinforcement learning and network pricing are being applied to the problem of developing optimal sharing mechanisms. <br\/><br\/>This effort will help quantify the benefit of dynamic spectrum sharing and provide assurances to public safety and commercial users that the sharing concept will meet their separate needs.","title":"SGER: Connection Admission Control and Network Pricing in Public Safety Spectrum Sharing","awardID":"0550872","effectiveDate":"2005-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["529582"],"PO":["7594"]},"100535":{"abstract":"Genetic relationships among languages can provide considerable insight into the culture, migrations, and contacts of human populations. However, it has so far been difficult to find and compare hypotheses about genetic relationships, since they exist only in scholarly books and papers, and can only be accessed individually. The Multi-tree project will develop a digital library of scholarly hypotheses about language relationships, one which is fully documented and transparently traceable to the scholarly work upon which it is based. Hypotheses about groups of related languages will be displayed graphically as familiar diagrams of family trees, with each node opening to display additional information on the language or subgrouping represented. Moreover, competing hypotheses about the same language family will be displayed as two or more trees aligned side by side for easy comparison. The Multi-Tree database will also be integrated with the existing LINGUIST List databases, which house a wealth of information about language and linguistics collected over a 15-year period of building electronic infrastructure for the discipline. The Multi-Tree project thus has considerable potential to contribute to research and education both within the field of linguistics and in related scientific disciplines. The project will provide accessible data and an overview of language classification which can trigger new hypotheses. It will make relationships between lesser-known languages better known, stimulating research on minority languages. Finally, the online search facility will constitute a captivating instructional tool, for use in K-12 through graduate education.","title":"Collaborative Research: Multi-Tree: A Digital Library of Language Relationships","awardID":"0445714","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["529966"],"PO":["564500"]},"110369":{"abstract":"The project will develop a multiscale, data-driven, high performance computational framework for real-time reconstruction of hazardous events from sparse measurements, and consequent probabilistic prediction of the evolution of the hazard. The framework is distinguished by four phases that are performed continually with dynamically-obtained data over the lifetime of the hazardous event. (1) Measurement: Distributed sensors provide dynamic measurements over a specified time horizon that will be used to reconstruct the initial conditions of the event. (2) Inversion: Driven by the sparse measurements, an inverse problem is solved to estimate the initial conditions for the equations governing the evolution of the hazard. (3) Prediction: Statistical analysis of the inversion results permits estimation of the uncertainty in the initial conditions, which is propagated into a prediction of the evolution of the hazard and its uncertainty. (4) Steering: Sensors are steered to new locations based on an effectivity index that incorporates sensitivities of the inversion with respect to sensor location, estimated uncertainty in the prediction, and population density factors. Continual application of the measure-invert-predict-steer (MIPS) framework described above results in updated predictions of the evolving hazard with built-in uncertainty estimates, as well as revised sensor deployment strategies that refine the predictions to reduce their uncertainty. The methods developed consider two time scales of decision making at which the MIPS framework must execute. The seconds-to-minutes decision-making scale is required by first responders to begin immediate response efforts. For such time scales, high-fidelity models in the form of partial differential equations (PDEs) are too formidable. Instead, the proposed methods will construct reduced-order models of the PDEs to facilitate realtime execution of the MIPS framework. The minutes-to-hours decision-making scale permits more careful and measured response by emergency officials using high-fidelity, high-resolution PDE models. To enable rapid execution of the MIPS cycle for such models, the project will develop fast, scalable, parallel algorithms for inversion and prediction. To demonstrate, assess, harden, robustify, and the resulting framework, will be validated on a specific application testbed: prediction of the urban\/regional dispersion of intentionally- or accidentally-released atmospheric contaminants from sparse measurements.","title":"Collaborative Research: DDDAS-TMRP: MIPS: A Real-Time Measurement-Inversion-Prediction-Steering Framework for Hazardous Events","awardID":"0540186","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T363","name":"AIR FORCE-PRED OF URBAN\/REGION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":[292326],"PO":["535244"]},"114978":{"abstract":"Within the next five years, it will be possible to provide enough transistors on a single chip for on the order of a hundred ARM-equivalent processors. At that point, individual, programmable processors will be like registers were to early VLSI design - building blocks within a larger organizing framework. The investigators refer to this class of devices as Programmable Heterogeneous Multiprocessors (PHMs), emphasizing that not only will individual processors on the chip be programmable, but collections of processors on the chip as well as the chip as a whole must be considered programmable. Applications that might appear on such devices include that of current cell phones, current personal digital assistant (PDA) applications, global positioning system (GPS) sensing, Bluetooth, motion sensing, ad hoc networking, 3-D image processing,<br\/>compression\/decompression, security, multimedia and a broad set of human computer interaction<br\/>(HCI) software. Ubiquitous and pervasive computing will produce newer scenarios with even more complex functionality. But these possibilities are limited by the ability to design and technically realize these scenarios in the individual space and power-constrained computing devices. <br\/>The class of single-chip computing that will leave the desktop in meeting the needs of future computing poses distinctly different programming and design challenges from board and network-level heterogeneous multiprocessors because a single chip is a finite resource, the hardware design will be semi-custom, and coordination of system resources will be required. All of these speak to levels of optimization that will be required for consumer electronic devices because of their physical limitations.<br\/><br\/>The project will investigate new design strategies that leverage the next level of design that is enabled as system performance can be evaluated with reduced modeling detail. The approach will define novel views of the proposed functionality and multiprocessor architecture, enabling simulation and optimization of the whole system's performance. Novel, proposed strategies include the development of design scenarios, which are the answer to the currently separate views of testbenches that exercise computer systems and benchmarks that are used to evaluate programmable designs, and the enabling of novel system-level strategies to save power by using a larger number of simpler processors that execute at lower clock rates or with sophisticated multiprocessor-level scheduling strategies. While ambitious, the project's vision is<br\/>enabled because of prior work in developing a novel simulator that capture the performance interactions of concurrent software executing on concurrent hardware using a layered model.","title":"NGS: A Design Environment for Single Chip Heterogeneous Multiprocessors","awardID":"0606675","effectiveDate":"2005-10-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["464680"],"PO":["551712"]},"107828":{"abstract":"This proposal aims to study (and develop appropriate defenses against) emerging exploits that target the \"dynamics\" of a system's operation---dynamics that result from the adaptation strategies deployed in most computing systems and networks. While few instances of adversarial exploits along these lines have been identified recently---namely, the PIs work on Reduction of Quality (RoQ) attacks on admission controllers of end-hosts and on TCP adaptation in networks---little is known about the significance, prevalence, and other-than-adversarial motives of such exploits, not to mention effective defenses. <br\/><br\/>INTELLECTUAL MERITS: The work to be pursued as part of this proposal flows along three dimensions: (1) vulnerability assessment, (2) attack synthesis, and (3) hardening and countermeasures. Along the first dimension, and in order to assess the vulnerability of system components, the PIs intend to adopt a control-theoretic approach to model the transient operation of common adaptive system and network components -- from schedulers, load balancers, and admission controllers to network traffic engineering and routing protocols. These models will be used to analytically characterize the vulnerabilities of such components to various exploits, whether the motive of such exploits is adversarial in nature (e.g., reducing a system's fidelity or effective capacity) or simply unfriendly (e.g., causing the system to preferentially treat a particular class of requests or flows). Along the second dimension, the PIs will investigate how a determined adversary could infer the vulnerabilities of a given system component through simple observations (from the outside), and thereupon design an exploit of low intensity but of high impact on the component's availability or service quality. Along the third dimension, the PIs intend to develop mechanisms that harden a component's susceptibility to exploits by non-clairvoyant adversaries, and also enable the identification (e.g., trace-back) of perpetrators.<br\/><br\/>The PIs will focus their attention on two specific types of systems that are particularly vulnerable to exploits of adaptation dynamics, and with which they have had quite a bit of experience, namely (A) network management and engineering, and (B) scalable web services, virtual hosting environments, and firewalls. These systems are particularly vulnerable due to their open nature, necessitating the use of dynamic resource management policies, which are exploitable by adversaries.<br\/><br\/>Expected outcomes from this effort include:<br\/>- The development of metrics and techniques that are capable of quantifying the vulnerabilities of computing systems to exploits that target their dynamics. <br\/>- The development of design principles that elucidate the tradeoffs between various design goals. For example, by relating a system's adaptation speed to its susceptibility to exploits, a system designer would be able to discern the risks and rewards involved in choosing one adaptation strategy versus another. <br\/><br\/>- The development of novel adaptation strategies and protocols that would be tolerant to specific exploits. While the PIs' focus will be on adaptation techniques that are prevalent in Internet systems, the new approaches and principles they develop will be applicable to a much wider range of systems, including operating systems, embedded systems, sensor networks, ad-hoc and distributed systems, among others.<br\/><br\/>BROADER IMPACT: The proposed work will also result in important tangible contributions to education and training through the development of various artifacts, including:<br\/>- The creation of a repository that would act as a knowledge base of known vulnerabilities and defenses in various adaptive systems. The mere availability of such a repository would be quite instrumental in hardening newly developed systems by enabling practitioners access to what amounts to benchmarks for testing their designs.<br\/>- The development of artifacts (e.g., tutorials, laboratory modules, software tools, and Web-based demonstrations) that could be integrated into standard systems and networking curricula. <br\/><br\/>In addition, the pursuit of the proposed work will result in important intangible broader impacts, including:<br\/>- Heightening the research community's appreciation of the importance of system dynamics, which will undoubtedly lead to concrete advancement in basic research with the expected outcomes of scientific publications and student training.<br\/>- Leveraging the efforts of the PIs in extending their proven service record to the systems and networking research community, as well as their outreach to minority and under-represented groups.<br\/><br\/>Last but not least, the pursuit of the research outlined in this proposal will promote the design of information systems, which are worthy of (and to which we can entrust) our society.","title":"CT-ISG: Towards Trusted Adaptation Dynamics in Computing Systems and Networks","awardID":"0524477","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["562061","438360"],"PO":["529429"]},"112944":{"abstract":"This project is exploring a novel concept of macro-level mobility of MANET and WLAN users called \"Sociological Orbits\". This concept is based on the observation that mobile users' movements often obey a partially deterministic (and repetitive) \"orbital\" pattern involving a set of relatively small geographic regions called \"hubs\", which are of some social interest. This concept is being validated using existing mobility trace data, and if proven true, will lead to more scalable and efficient routing protocols for MANETs. This effort will have impact on the fundamental assumptions of mobile ad hoc networking as well as on graduate student education","title":"SGER-Explorying Sociological Orbits in Mobile Users' Mobility Pattern","awardID":"0553273","effectiveDate":"2005-10-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["511691"],"PO":["7594"]},"110403":{"abstract":"Exploration of transient sources represents one of the last frontiers in modern astrophysics. The development of a comprehensive understanding of a new event requires real-time observation with multiple instruments. Yet while telescope facilities continue to ramp up to unprecedented data rates, there has been no concerted effort to ensure real-time communications of astronomical events. A federated response must be enabled to push transient astrophysics ahead in the 21st century.<br\/><br\/>The activity undertaken in this project is a synergy of distributed computing with distributed sensors. Though set up by humans with pre-defined criteria, VOEventNet operates automatically and autonomously. The project will build an event factory to detect sky transients in near real time, and utilize novel machine-learning technology to distinguish scientifically relevant transients from false positives through synthesizing multiple observations. In this way, VOEventNet will enable an already active area of astrophysical research to flourish. The system that will be enable constitutes the unification of existing powerful resources to form a new, robust, competent production system that will generate a great deal of new science.","title":"Collaborative Research: DDDAS-TMRP: Real-Time Astronomy with a Rapid-Response Telescope Grid","awardID":"0540352","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1798","name":"SPECIAL PROJECTS (AST)"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["533372"],"PO":["551712"]},"110337":{"abstract":"The goal of this project is to develop a dynamic data-driven planning and control<br\/>system for laser treatment of cancer. The proposed research includes (1) development of a general mathematical framework and a family of mathematical and computational models of bio-heat transfer, tissue damage, and tumor viability, (2) dynamic calibration, verification and validation processes based on laboratory and clinical data and simulated response, and (3) design of effective thermo-therapeutic protocols using model predictions. At the core of the proposed systems is the adaptive-feedback control of mathematical and computational models based on a posteriori estimates of errors in key quantities of interest, and modern Magnetic Resonance Temperature Imaging (MRTI) and diode laser devices to monitor treatment of tumors in laboratory animals. This approach enables an automated systematic model selection process based on acceptance criteria determined a priori and is valid for models of events occurring at multiple spatial and temporal scales. The proposed project should be of interest to both NIH\/NLM and NSF. The methodologies to be implemented involve uncertainty quantification methods designed to provide an innovative, data-driven, patient-specific approach to effective cancer treatment. The general mathematical framework resulting from this research will be applicable to any thermo-therapeutic cancer treatment, but our treatment protocols will be established based on tumors seeded in prostates of canines. The primary objective of the proposed research is to develop treatment strategies by selecting optimal parameter sets (such as laser power, wave length, and fluence rate) based on high fidelity model predictions and data from cellular and in vivo biological measurement, and MRTI thermal distributions.","title":"Collaborative Research: DDDAS-TMRP: Dynamic Data-Driven System for Laser Treatment of Cancer","awardID":"0540033","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}}],"PIcoPI":["533205","517319","485474"],"PO":["523936"]},"110734":{"abstract":"PROPOSAL : 0541927 DATE : 07\/07\/2005 <br\/><br\/>ABSTRACT <br\/>0541927 <br\/>Daniel W. Hammerstrom <br\/>Portland State University <br\/><br\/>The purpose of this proposal is to request funding for NSF to sponsor a workshop. This workshop is being <br\/>organized by the Collaborative Working Group (CWG) 4 of the SNB (Silicon Nanotechnology and Beyond) <br\/>Initiative, an agreement between SRC and NSF to increase university research emphasis in this area. <br\/>The workshop will be held at Portland State University, Portland, Oregon, September 13 and 14. Although NSF will be the primary sponsor, we have also submitted a proposal to ONAMI (Oregon Nano and Microtechnology Institute) for additional funding. <br\/>The workshop will be by invitation only and will consist of approximately 40 people. The venue will be the <br\/>University Place, a hotel and conference center owned and operated by Portland State University. <br\/>Sometimes forgotten, in the quest to design new materials and switches and to get them to work in the laboratory, are the questions of how we will take advantage of nanoelectronic devices for tomorrow's computing. It is likely that nanotechnology will not just be a new kind of device at the bottom of the hierarchy, but that every level in the design stack will be significantly different, including system architectures, algorithms, computational models, computing structures, physical implementations, and devices. In the semiconductor manufacturing, research, and development community, which includes IT, defense technology and communication, it is widely acknowledged that it is important to pursue both extending CMOS technology to its limits and to develop beyond-CMOS technologies, if the semiconductor industry is to sustain its historical exponential improvement in performance\/cost over time.","title":"Architectures for Silicon Nanoelectronics and Beyond A Workshop to Chart Research Directions","awardID":"0541927","effectiveDate":"2005-10-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["456863"],"PO":["562984"]},"104816":{"abstract":"Developers of program analyses today face an uncomfortable choice: produce a precise analysis that can extract or verify quite sophisticated properties (but fails to scale to large programs) or produce an efficient analysis that scales well (but extracts or verifies only very basic properties). The unfortunate consequence is that the potential benefits of precise program analysis (detecting programming errors, verifying that the program preserves its data structure consistency properties, enhanced ability to extract meaningful design information, etc.) are currently denied to the large programs that need them the most.<br\/><br\/>The project will pursue a new approach that enables the focused application of multiple analyses to different instantiable modules in the same program, with each analysis applied to the modules for which it is most appropriate. Each module encapsulates one or more data structures and uses membership in abstract sets to specify how the actions of each module affect the participation of objects in its data structures. Each analysis verifies that the implementation of the analyzed module 1) preserves important internal data structure representation invariants and 2) conforms to a specification that uses formulas in a set algebra to characterize the effects of operations on the data structure. Each analysis will use an abstraction function to establish the connection between the concrete data structure implementation and abstract set membership. This abstraction function enables the analysis to translate the set membership properties of objects that cross module boundaries back into concrete data structure properties within the module. These properties are crucial to verifying that the data structures remain consistent and that each module correctly implements its abstract set interface.<br\/><br\/>Systems often have consistency properties that involve multiple modules. For example, a system may require the sets of objects that participate in two given modules to be disjoint. Because these properties involve objects shared across multiple modules, different analyses must somehow interoperate if they are to successfully verify the property. In the approaches pursued here , these kinds of invariants are expressed using a boolean algebra of abstract set inclusion properties and locally verified at the appropriate program points by each analysis. This approach therefore eliminates the need to apply complex (and potentially unscalable) analyses across large regions of the program.","title":"CSR----SMA Modular Pluggable Program Analyses","awardID":"0509415","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["497068"],"PO":["493916"]},"111912":{"abstract":"The Computing Research Association has received Special Projects support to convene a workshop in February of the coming year. The purpose of invitation only workshop is to bring together participants from industry to inform and include them in the new Broadening Participation in Computing effort of the NSF. The motivation for this educational initiative is considerable: significant decreases in the number of students pursuing CS degrees, lack of agreement on the core CS content in light of increasing impact of application areas, the steady growth of size and complexity of systems, and the challenges to national competitiveness brought on by off-shoring. This meeting represents an important step in engaging the stakeholders in addressing the issues on a nationwide scale. Such a transformation is critical to information technology (IT) workforce preparation and the continued preeminence of the U.S. in technology innovation. A major outcome of workshop is the identification of areas of needed change and strategies for effecting interventions and changes that should result in a more diverse, broad, and well trained IT workforce in the United States.<br\/><br\/>Intellectual Merit: The purpose of workshop is to initiate a national discussion with key leaders to industry to catalzye efforts to broaden participation in computing careers at all points in the career pipeline. Such a transformation is critical to information technology (IT) workforce preparation and the continued preeminence of the U.S. in technology innovation. The workshop will identify areas of needed change and strategies for effecting that change.<br\/><br\/>Broader Impact: This workshop (along with other similar targeted workshops) should start a series of intervention transformations that will have impact on student at institutions throughout the nation as they prepare for careers as IT professionals, making the students better prepared to join the computing workforce of the future.","title":"Workshop on Industrial Support for Broadening Participation in Computing","awardID":"0548906","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["209556"],"PO":["564181"]},"110406":{"abstract":"Exploration of transient sources represents one of the last frontiers in modern astrophysics. The development of a comprehensive understanding of a new event requires real-time observation with multiple instruments. Yet while telescope facilities continue to ramp up to unprecedented data rates, there has been no concerted effort to ensure real-time communications of astronomical events. A federated response must be enabled to push transient astrophysics ahead in the 21st century.<br\/><br\/>The activity undertaken in this project is a synergy of distributed computing with distributed sensors. Though set up by humans with pre-defined criteria, VOEventNet operates automatically and autonomously. The project will build an event factory to detect sky transients in near real time, and utilize novel machine-learning technology to distinguish scientifically relevant transients from false positives through synthesizing multiple observations. In this way, VOEventNet will enable an already active area of astrophysical research to flourish. The system that will be enable constitutes the unification of existing powerful resources to form a new, robust, competent production system that will generate a great deal of new science.","title":"Collaborative Research: DDDAS-TMRP: Real-Time Astronomy with a Rapid-Response Telescope Grid","awardID":"0540369","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1798","name":"SPECIAL PROJECTS (AST)"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["547607","447502","408897"],"PO":["535244"]},"110417":{"abstract":"During the last two decades, great strides have been achieved in many aspects of computational sciences and engineering. Higher-fidelity mathematical models, higher-order approximation methods, and faster solution algorithms have been developed for many applications. Computing speed barriers have also been shattered by hardware manufacturers. As a result, the potential of modeling and simulation for reducing design-cycle time and enhancing system performance is recognized today in almost every field of engineering. However, for many complex structural systems, even the most elaborate computational models remain bound to be imperfect for numerous reasons. The Dynamic Data Driven Application Systems (DDDAS) concept is a unique paradigm for exploiting maturing computational and sensor networking technologies to compensate for model deficiencies and unforeseen system evolution and stimulus conditions, mitigate the effect of design imperfections on long-term as well as short-term system safety, and enable informed decision for maintenance planning and crisis management.<br\/><br\/>This project will design, implement, build, and demonstrate by simulations as well as by laboratory experiments a DDDAS for health monitoring, failure prediction, and crisis management of complex structural systems operating in various time-scales. The project will enable advances in: (i) Applications: Development of inverse algorithms for generating hybrid analytical, computational, and data-updated models representing the behavior of degrading systems at various time-scales; (ii) Application Measurement Systems and Methods: Development of methods for preserving autonomous sensor network infrastructure in highly dynamic environments, preserving routing capabilities and time synchronization in the presence of system damage or degradation, sensor scoring and self-consistency checks, and dynamic models for reducing simulator-sensor node communication; (iii) Mathematical and Statistical Algorithms: Development of innovative algorithms for on-line identification of degrading systems, damage tracking, stable adaptive reduced-order modeling, and near real-time computing, and (iv) Systems Software Infrastructure: Development of a proof of concept software architecture that encapsulates all the advances in the above areas and furthermore addresses the issue of dynamically selecting and optimizing at run-time components of heterogeneous functionality over heterogeneous computing resources. Development of real-time, data driven, redundancy exploitation schemes for addressing the service quality degradation of wired and wireless sensor networks embedded in multidisciplinary systems, as a function of operating conditions.<br\/> <br\/>A unique feature of the proposed research is a set of test-beds and associated laboratory experiments conceived not only to demonstrate the envisioned DDDAS, but also to support a strong educational component of the project.","title":"DDDAS-TMRP: A Dynamic Data Driven System for Structural Health Monitoring and Critical Event Prediction","awardID":"0540419","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["541394","521232",292489,"484788",292491],"PO":["535244"]},"110407":{"abstract":"The project will develop a multiscale, data-driven, high performance computational framework for real-time reconstruction of hazardous events from sparse measurements, and consequent probabilistic prediction of the evolution of the hazard. The framework is distinguished by four phases that are performed continually with dynamically-obtained data over the lifetime of the hazardous event. (1) Measurement: Distributed sensors provide dynamic measurements over a specified time horizon that will be used to reconstruct the initial conditions of the event. (2) Inversion: Driven by the sparse measurements, an inverse problem is solved to estimate the initial conditions for the equations governing the evolution of the hazard. (3) Prediction: Statistical analysis of the inversion results permits estimation of the uncertainty in the initial conditions, which is propagated into a prediction of the evolution of the hazard and its uncertainty. (4) Steering: Sensors are steered to new locations based on an effectivity index that incorporates sensitivities of the inversion with respect to sensor location, estimated uncertainty in the prediction, and population density factors. Continual application of the measure-invert-predict-steer (MIPS) framework described above results in updated predictions of the evolving hazard with built-in uncertainty estimates, as well as revised sensor deployment strategies that refine the predictions to reduce their uncertainty. The methods developed consider two time scales of decision making at which the MIPS framework must execute. The seconds-to-minutes decision-making scale is required by first responders to begin immediate response efforts. For such time scales, high-fidelity models in the form of partial differential equations (PDEs) are too formidable. Instead, the proposed methods will construct reduced-order models of the PDEs to facilitate realtime execution of the MIPS framework. The minutes-to-hours decision-making scale permits more careful and measured response by emergency officials using high-fidelity, high-resolution PDE models. To enable rapid execution of the MIPS cycle for such models, the project will develop fast, scalable, parallel algorithms for inversion and prediction. To demonstrate, assess, harden, robustify, and the resulting framework, will be validated on a specific application testbed: prediction of the urban\/regional dispersion of intentionally- or accidentally-released atmospheric contaminants from sparse measurements.","title":"Collabortive Research: DDDAS-TMRP: MIPS: A Real-Time Measurement-Inversion-Prediction-Steering Framework for Hazardous Events","awardID":"0540372","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T363","name":"AIR FORCE-PRED OF URBAN\/REGION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["527004"],"PO":["535244"]},"104819":{"abstract":"One of the most pressing issues faced by today's IT researchers is how to provide a distributed server infrastructure to accommodate the exponentially increasing web accesses. This project considers web services consisting of geographically distributed servers, client caching, proxy caching, and distributed searching in a virtual network, embedded on top of a physical network. A set of software techniques is developed based on peer-to-peer (P2P) algorithms to achieve optimal overall performance and reliability with existing hardware\/software resources. The project is carried out jointly at University of California, Riverside and Suffolk University. Researchers from HP Laboratories are involved as senior personnel.<br\/><br\/>The web server, considered in this project, consists of geographically distributed heterogeneous nodes in a network based on different functionalities and applications of the web service. Clustering techniques are developed to create suitable P2P structures keeping in mind the topological properties of the Internet systems. Inside the cluster, scalable, efficient and high performance overlay network architectures are identified for web services. Efficient cooperative proxy cache placement and management mechanisms are developed in the virtual network following distributed shared memory (DSM) approaches. Proxy servers are combined with P2P clusters consisting of browser (client) caches, and a cooperative caching strategy is designed at the proxy level by embedding tree structures and directory schemes. Extensive software implementation, simulation, testing and evaluation are carried out using the PlanetLab distributed environment.","title":"Collaborative Research: Software Architectures for Distributed Web Services Based on Peer-to-Peer Techniques","awardID":"0509440","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["516924"],"PO":["561889"]},"112928":{"abstract":"Abstract:<br\/><br\/>Proposal no: 508533<br\/>Title: NER\/SNB Implementing Nano-scale, Hierarchical, Distributed Memories with <br\/>CMOL (Cmos \/ MOLecular) Circuits<br\/>PI: Dan Hammerstrom, Co-PI: Jack McCarthy<br\/>Inst: BME Department, OGI School of Science and Engineering Oregon Health & Science University<br\/><br\/>The project examines the creation of biologically inspired circuit models in a hybrid CMOS \/ Molecular circuit technology. This research is based on two key assumptions, (1) that sparse, hierarchical, distributed data memories (HDMs) will be an important component of Intelligent Signal Processing, and (2) that the mapping of these models to molecular scale circuitry will be more effective than the mapping of more traditional computation.<br\/><br\/>The HDMs form the primary objective of the overall research program. As computational models, they have very different characteristics from traditional models. They rely more on parallel computation than on raw speed. They are asynchronous and of low precision. And they are fault tolerant. For these reasons molecular scale electronics appear to be a promising computational substrate for these models. To develop HDM technology, we are focusing on a number of important problems:<br\/><br\/>1) Developing network models that demonstrate hierarchical data invariance and abstractions with distributed representations;<br\/>2) Adding temporal information to the representation;<br\/>3) Building software systems of multiple HDM components with complementary functional diversity into complex \"cognitive\" systems;<br\/>4) Scaling to large networks;<br\/>5) Studying hardware acceleration;<br\/>6) Integrating HDMs with existing intelligent computing technologies, in <br\/>particular digital signal processing and rule-based systems; and<br\/>7) Applying HDM technology to real world applications.<br\/><br\/>The research performed here focuses on potential hardware acceleration with hybrid micro\/nanotechnology. In particular, we will be looking at a hybrid CMOS \/ Molecular technology, CMOL, and the CrossNet implementation architecture, which are being developed at SUNY Stony Brook by Prof. Likharev and is group.<br\/><br\/>The basic idea of CMOL circuits is to combine the advantages of the currently dominant CMOS technology (including its flexibility and high fabrication yield) with those of single-electron molecular devices with nanometer-scale footprint. The devices would be self-assembled on a pre-fabricated nanowire array fabric, enabling very high function density at acceptable fabrication cost. The CMOL technology seems to be uniquely suited for the implementation of the distributed-crossbar (\"CrossNet\") family of neuromorphic networks which may allow a very effective implementation of HDMs.","title":"NER\/SNB: Implementing Nano-scale, Hierarchical, Distributed Memories with CMOL (Cmos \/ MOLecular) Circuits","awardID":"0553196","effectiveDate":"2005-10-01","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["456863"],"PO":["562984"]},"98183":{"abstract":"This proposal describes an approach to performing multi-resolution system behavior monitoring at runtime and generating models based on this monitoring in dedicated distributed and parallel systems. The research offered focuses on dedicated systems, particularly clusters performing a well-known set of tasks that occur with relatively predictable frequency. Anomaly detection can be accomplished through comparison of the observed runtime system behavior against a high-fidelity model of the system. The following three specific sub-areas will be emphasized:<br\/><br\/>Multi-resolution Behavior Monitoring<br\/>Data Fusion<br\/>Flexible Behavior Modeling<br\/><br\/>The intellectual merit of this work is to further understanding of anomaly detection within cooperating processors working over high speed networks in such a way that the resulting overhead is acceptable. The proposal also includes a continuing industrial collaboration, as well as the completion and initiation of PhD dissertations and involvement of historically underrepresented groups in a summer research program.","title":"An Adaptive Integrated Behavior Monitoring and Modeling Approach for High Performance\/High Speed Network Computing Environments","awardID":"0430354","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}}],"PIcoPI":["473694","528453","528455"],"PO":["389815"]},"107150":{"abstract":"This project, developing a diversified router platform to enable networking researchers to more easily construct experimental networks, explores new and disruptive architectural innovations. Networking diversification is an emerging concept that envisions multiple diverse networks co-existing on a reconfigurable substrate. Enabling the creation of systems that demonstrate new network architectural innovations in a form that permits systems to be deployed and used to carry live traffic (even in settings that demand high performance levels), this diversified router allows multiple diverse routers to share a common hardware platform, using a flexible architecture built around a pool of processing engines that can be allocated to different routers as needed. The platform leverages the Advanced Telecommunications Computing Architecture (ATCA), a rapidly developing industry standard for telecommunications equipment. To simplify overall architecture, whenever possible, the platform uses standard ATCA components and distributed switching. It is expected to support link speeds up to 10Gb\/s with typical configurations supporting 4 to 6 links and 8 to 10 processing engines of various types. Designed flexible enough for use in support of a wide range of activities, the platform is expected to serve as a compelling demonstration of the feasibility of diversified networking. Moreover, the platform appears well-suited for improvements to the current internet protocol suite that require modifications to the router data path.<br\/><br\/>Broader Impact: Through Washington's University's Open Network Lab, the systems will be made directly available for experimental use by others. The diversified networking concept has the potential to transform the Internet, enabling new network technologies to be introduced at any time, stimulating competition among competitive alternatives, and preventing the recurring problem of network ossification that now plagues the Internet. New courses will be created and students will benefit, particularly the graduate students working on the project.","title":"MRI:Development of a Diversified Router for Experimental Research in Networking","awardID":"0520778","effectiveDate":"2005-10-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["522381","316262","522382"],"PO":["557609"]},"108492":{"abstract":"This project will conduct a preliminary but solid study on developing a new mathematical model in the application of a novel magnetic resonance imaging technique to reconstruct human brain neural pathways. The new model will make use of the high angular resolution diffusion-weighted (HARD) imaging technique and the diffusion equation simulation based fiber tractography technique to trace white matter fiber tracts in the human brain.<br\/><br\/>The robust diffusion equation simulation based fiber tracking technique has been used with standard second-order diffusion tensor magnetic resonance imaging (DT-MRI) data and some major white matter fiber tracts have been reconstructed. Compared with the standard DT-MRI based techniques, the fusion of HARD<br\/>technique and diffusion equation simulation based tractography is a combination of more accurate data acquisition technique with more sensitive analysis technique and is likely to produce a much more advanced visualization technique that allows scientists to \"see through\" the human brain noninvasively and understand its in vivo functions and connectivities. This understanding can help scientists to design biologically motivated computing systems and combat many brain diseases. In addition, this project emphasizes training Ph.D. students as the next generation interdisciplinary scientists with solid background in mathematics, computer science, and neoruscience.","title":"MSPA-MCS: Mathematical and Computational Algorithms for Visualization of Human Brain Neural Pathways","awardID":"0527967","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["550224","94260","499556"],"PO":["532791"]},"119482":{"abstract":"Abstract for 0102830 Mahapatra<br\/>\"Integrated Research and Education in High-Performance Parallel Optimization Algorithms\"<br\/><br\/>This project will perform integrated research and education activities in the multidisciplinary area of parallel optimization. Given the enormous potential role of parallel computing in solving large-scale optimization problems with great societal implications, it is imperative that future scientists and engineers learn its fundamentals. The education component of this project will contribute towards bridging the current gap in knowledge of those professionals. The research activities center around efficient parallelization of an important optimization method called branch-and- bound (B&B), widely used for solving real-world combinatorial optimization problems (COPs). B&B's applications run the gamut of Science, Engineering, Mathematics, and Operations Research, with significant new uses being discovered every year. Research in B&B is performed by two groups of researchers: workers in parallel processing who use sophisticated parallelization techniques in conjunction with simple B&B algorithms, and hence are able to solve COPs of limited size; and workers in operations research who develop and use sophisticated application-specific B&B algorithms with little or no parallelism, to solve larger COPs. The overall objective of the proposed research is to improve solution time and quality for some important optimization problems by an order of magnitude, or to solve previously intractable problems, by applying scalable, high-performance parallelization techniques to application-specific B&B methods.<br\/><br\/>Technically, the specific goals of the proposed project are as follows. <br\/>(1) Adaptive Load Balancing: To develop load balancing schemes that adapt to application and target-system characteristics to maximize processor utilization. <br\/>(2) Efficient Limited-Memory Search: To develop efficient search schemes that enable large problems to be solved within the available memory of practical parallel\/distributed systems. <br\/>(3) Specialized B&B Methods: To develop specialized B&B methods for some important COPs like mixed-integer programming and the traveling salesman problem, and use these to demonstrate solution time and quality improvements for real-world instances of those problems. <br\/>(4) Parallel Optimization Course and Web Resource: To develop a model course on parallel optimization for upper-level undergraduate and beginning graduate students, as well as a comprehensive, searchable web resource on parallel optimization useful for education. <br\/>(5) Parallel B&B Software Environment: To incorporate the parallelization techniques developed in this project in a software system for use as an educational and research tool for fast, efficient solution of optimization problems using parallel B&B.","title":"Integrated Research and Education in High-Performance Parallel Optimization Algorithms","awardID":"0627835","effectiveDate":"2005-10-08","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["486517"],"PO":["565272"]},"107033":{"abstract":"While the Internet continues to thrive, the behavior of abnormal routing events are not well understood, nor are their symptoms and how they can be detected. Although numerous studies have created systems for detecting intrusions and anomalies by investigating traffic at the Internet data plane, no similar systems have been created for routing at the control plane. This leaves a wide range of critical basic and applied research questions unanswered, particularly for routing based on the Border Gateway Protocol (BGP) -- the de facto inter-domain routing protocol on the Internet.<br\/><br\/>This research -- Internet Routing Forensics (IRF) -- will provide a systematic means for understanding and detecting networking anomalies from the Internet control plane by investigating a huge amount of routing data. As its first step, IRF focuses on abnormal BGP events, such as Internet worms or large-scale electricity outages that may affect the normal operation of BGP. With detection speed, accuracy and usability as the major goals, this research will build a reliable but flexible framework that can systematically process large archives of BGP data, observe and learn the patterns and effects of abnormal BGP events as well as those of normal behavior, discover rules of abnormal BGP events, and apply these rules to detect the occurrence of these events -- even if they are yet unknown.<br\/><br\/>While IRF research lies primarily in the area of networking, it is inter-disciplinary. Besides leveraging modeling techniques, mathematical methods and statistical analysis, this research will in particular leverage data mining techniques to explore the huge data space from the global and local levels, devise a novel rule processor to optimize rules produced from the data mining process, and adopt supervised machine learning and other techniques to more accurately identify abnormal routing events within a given context.<br\/><br\/>Broader Impact: By providing a crucial but currently lacking service, the research is expected to advance the service that the Internet provides to the society. Network operators, for example, will be in close contact with the research team to share their experience with the system. Methods, tools and discoveries from this research will be disseminated. Furthermore, this research will promote an energetic education plan. By using the IRF framework to observe and analyze real events happening on the Internet, students will be actively involved in the understanding and discovery of the structure and complexity of the Internet. Minorities and women will especially benefit from and contribute to this research project through internships, workshops, presentations, and other opportunities.","title":"NeTS-NBD: Internet Routing Forensics -- A Framework for Understanding, Monitoring and Detecting Abnormal Border Gateway Protocol Events","awardID":"0520326","effectiveDate":"2005-10-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["543493","446168","486594"],"PO":["565090"]},"107881":{"abstract":"This project is developing a method to formally verify SPIDS that monitor other components of a system, including network protocols, routers, and applications. In each case, the creative steps are to (1) develop the specification that determines when an alert is to be delivered, (2) develop a security requirement against which the SPIDS is verified, and (3) carry out the verification. Beyond verifying each of these SPIDS in isolation, this proposal addresses their composition driven by the verification with respect to a global security requirement for an entire system. A running example of the system to be considered consists of a host running Linux, a wireless network running auto-configuration protocols and the OLSR routing protocol. Although not containing the functionality of a real network, this example includes most of the layers in the network protocol stack for a wireless environment.","title":"CT-ISG: Reasoning about Composable Intrusion Detection Systems","awardID":"0524826","effectiveDate":"2005-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}}],"PIcoPI":[284993,"521753","502032"],"PO":["543507"]},"107782":{"abstract":"Abstract<br\/><br\/>Voting systems require end-to-end trustworthiness, commencing with blank ballots and registration lists and concluding with the correct and auditable tallies of the marked ballots, reflecting the choices of the voters. This ballot round trip must resist well financed and organized adversaries that may include the very people who develop, maintain, or deploy the election machinery, and the process must be accessible to all citizens regardless of their disabilities or native language. The center's research investigates software architectures, tamper-resistant hardware, cryptographic protocols, and the role that various verification systems (e.g. paper, audio, cryptographic) can play in electronic voting systems. The center also examines system usability and studies how public policy and administrative procedures can, in combination with technology, better safeguard voting systems. <br\/><br\/>The voting system integrity problem is a paradigmatic hard Cyber Trust problem, requiring trustworthy system architectures, security, integrity, privacy, anonymity, high assurance, and human-machine interfaces. Voting systems must preserve a voter's privacy and anonymity, to reduce risks of voter coercion and bribery, yet they must be sufficiently auditable and transparent to allow for mistakes and errors to be identified and reconciled. This center's research develops a deeper understanding of how to organize, develop, and evaluate not only voting systems, but a wide range of other systems with end-to-end trustworthiness requirements.","title":"Collaborative Research: CT-CS: A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)","awardID":"0524111","effectiveDate":"2005-10-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["284701",284701,"284703",284703,"521455"],"PO":["564388"]},"108552":{"abstract":"Abstract<br\/><br\/>Effects ranging from very small to very large scales govern physical phenomena such as the evolution of a storm system or the structural deformation of an automobile during an accident. Accurately predicting these by resolving the finest scales in a computer simulation is prohibitively expensive. The investigators are studying how fine scale information impacts coarse scale behavior and vice versa. In effect, \"summarizing\" these relationships allow us to model coarse scale effects accurately and efficiently without the need to explicitly resolve the finest scales in a computation. A key to this study lies in the careful transfer of structures present in the mathematical models of these phenomena (which in essence have infinite resolution) to the computational realm with its finite resolution and finite computational resources. The methods being developed will allow rapid assessment of overall effects with the ability \"to drill down\" computationally where additional detail is required.<br\/><br\/>Physical systems are typically described by a set of continuous equations using tools from geometric mechanics and differential geometry to analyze and capture their properties. For purposes of computation one must derive discrete (in space and time) representations of the underlying equations. Theories which are discrete from the start (rather than discretized after the fact), with key geometric properties built in, can more readily yield robust numerical simulations which are true to the underlying continuous systems: they exactly preserve invariants of the continuous systems in the discrete computational realm. So far these methods have not accounted for effects across scales. Yet both physics and numerical computation require such multi-resolution strategies. This research project is developing a multi-resolution theory for discrete variational methods and discrete differential geometry with applications to thin-shell and fluid modeling. The principal scientific innovation lies in techniques to conserve symmetries across computational scales.","title":"Collaborative: MSPA-MCS: Computational and Mathematical Foundations for the Synthesis of Multiresolution Representations with Variational Integrators and Discrete Geometry","awardID":"0528402","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["554341"],"PO":["565157"]},"109422":{"abstract":"For the millions of visually impaired people in the United States, over a million of whom have no usable vision, spatial orientation and navigation are a major problem leading to loss of mobility and reduced participation in community activities, not to mention serious safety concerns for those who do attempt to be fully mobile. There is thus a critical need for an aid that would provide the orientation and navigation information and spatial cues the rest of us take for granted. The goal of this project is to achieve this objective by bringing to bear technologies and development expertise in the fields of geographic information system (GIS) database development and maintenance, real-time tracking, and psycho-acoustics and audio presentation. The PI and his team will develop a seamless, spatialized audio presentation system with which a person can obtain the additional orientation cues and navigation information needed to move about successfully and safely in familiar and unfamiliar outdoor and indoor environments. To these ends, a GIS database for visually impaired pedestrians will be developed to define accessible walking paths and provide a means of route planning. This database will complement conventional, surveyed map data with paths frequented by users of the system, including annotations of information relevant to these paths such as easily recognized landmarks along the path and hazardous obstacles to avoid. Achieving an effective presentation will require real-time tracking of the person's \"head pose\" (location and orientation of the head in space). This will be accomplished by integrating data from GPS and inertial sensing with high frequency head pose data. Novel probabilistic localization algorithms will be developed to improve the positional accuracy of outdoor GPS using map-based priors and historical modeling of user intent. Visual 3D reconstruction will be used to create indoor and outdoor databases to support this purpose and obviate the need for an indoor sensing infrastructure. A novel vision-based localization sensor will be developed to provide head pose based on this 3D database. In developing an audio presentation system the use of non-speech sounds will be investigated as an alternative to speech for situations where immediate environmental spatial awareness and orientation is more of a concern than particular semantic information about that environment. Clearly, when the task at hand is to move through the environment effectively and safely to a particular destination, being told the name of every doorway and object being passed is more of a distraction than an aid. However, an awareness of the presence and relative location of doorways and objects along the way is useful as a means of monitoring progress and maintaining spatial orientation. The PI's solution is to develop generic characteristic sounds, analogous to international signage, which are easily recognized and associated with particular classes of objects (e.g., the sound of a closing door for an entrance). To avoid covering the ears, bone conduction headsets will be employed, and a bone-related transfer function developed to present effective stereo imaging of sounds. Experiments will be conducted to determine what sounds are most intuitive and easily localized, what variety and number of different sounds can be easily learned, and how to produce such sounds so they do not distract attention from important natural sound cues. System integration for seamless operation will be accomplished by developing an overarching operating system that treats each of the first two systems as modules from which data must be fused for presentation by the third system. This operating system will also respond to control commands made through user input, whereby selections may be made regarding the type, amount, detail and radius of information being presented.<br\/><br\/>Broader Impacts: Fundamental questions relating to perception and the cognitive interpretation of auditory presentations will be answered in the course of this research; these results will be applicable to a much broader field of audio display technologies. In addition, methods for effectively and efficiently presenting a wide range of spatial information quickly and in real time will be developed; this knowledge will be applicable to any field where large amounts of such information must be assimilated quickly though non-visual channels. Overall, this research will lead to more effective auditory presentation and information delivery systems that can be used not only by people who are visually impaired, but wherever and whenever timely situational awareness is needed, from better systems for air traffic controllers to faster assimilation of awareness in complex situations. Such systems could prove invaluable to military personnel, firefighters, jet pilots, first responders, etc., and in general to anyone who needs to acquire more information about his or her surroundings in","title":"A System for Wearable Audio Navigation Integrating Advanced Localization and Auditory Display","awardID":"0534332","effectiveDate":"2005-10-15","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["529975","485377"],"PO":["565227"]},"107345":{"abstract":"This project, creating a Data Capacitor and a Metadata\/Web Services server, addresses two clear and widespread challenges: the need <br\/>-To store and manipulate large amounts of data for short periods of time (hours to several days) and<br\/>-For Reliable and unambiguous publication, discovery, and utilization of data via the Web.<br\/><br\/>The Data Capacitor, a 250 Terabyte short term data store with very fast I\/O and the Metadata\/Web Services server, a robust server, enable the institution and collaborators to adopt and depend upon the Web services for exchange of research data. Research and development efforts at IU will create the tools required for the Data Capacitor to be used to its fullest. Progress and research possibilities in many disciplines have been fundamentally changed by the abundance of data now so rapidly produced by advanced digital instruments. Scientists face the present challenge of drawing out from these data the information and meaning contained within. IU has established a significant cyberinfrastructure composed of high performance computing systems, archival storage systems, and advanced visualization systems spanning two main campuses in Indianapolis and Bloomington, and connected to national and international networks. This institution enhances its infrastructure in ways that will result in qualitative changes in the research capabilities and discovery opportunities of a broad array of scientist that work with large data sets. The Data Capacitor is expected to become a development platform and testbed for new cyberinfrastructure, as well as a proof of concept for large capacity, short-term storage devices. On the other hand, the Metadata\/Web Services server enables the institution to establish a leadership position in standards-based data dissemination in many fields.<br\/><br\/>Broader Impact: The Data Capacitor enhances current practice in relevant scientific communities, enables technology transfer and commercialization, develops a 21st century workforce, and ensures public understanding of the value of science. Deliberate use of objective metrics in all areas of broader impact ensures that new discoveries, technology development, educational activities, and public information efforts translate into benefit for the scientific community and society as a whole. Women and underrepresented groups will be drawn into computing-intensive sciences and applications of computing.","title":"MRI: Acquisition of a High-Speed, High Capacity Storage System to Support Scientific Computing: The Data Capacitor","awardID":"0521433","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["511575","537239",283428,"565242",283430,"558869"],"PO":["557609"]},"109567":{"abstract":"This project uses the realm of believable improvisational performance agents to investigate the larger issues of scalability and robustness, which have long been problematic in AI systems. In general, AI systems have either been prone to a brittleness that results in a dramatic drop off in competence at the edges of their knowledge bases or a hyper explosion of inference in those cases where the knowledge bases are massive. These phenomena reflect a tension between the breadth of knowledge needed by a system to cover more than a single domain and the control needed to ensure that the resulting knowledge base can be used efficiently and effectively. In this project, issues of control and breadth are decoupled and handled by two very different sorts of systems. Control is handled by a variant of case-based (or example-based) planning, which will provide task-level guidance to information acquisition, evaluation, and application. Breadth is provided by the use of lexical technologies from the information retrieval community, which will be used to mine online resources. The case-based planning component will be used to create the queries and requirements that will then be used to control the information access performed by the retrieval mechanisms. The goal is to build a robust and scalable system that is able to provide breadth of coverage without sacrificing the power of control provided by the reasoning system. The choice of believable performance agents as an application domain provides highly visible constraints and evaluation metrics. On one hand, the agents must make use of the control of AI in order to produce the appropriate experience while, on the other, also be on point with regard to issues of information relevance, topicality, and point of view. This work is, in part, aimed at a new role for the machine in the world: a role in which the machine is used to expose the world of communication and cultural connections that are linked together by and within the grasp of online systems. The broader impacts of this work would range from creation of particular performance agents to more robust and scalable visions for AI. The project seeks to attract a wider set of students (including the underrepresented group of women in engineering) from communications studies and theater, who want to do work on the machine as a device for communication, communication made possible and supported by the mediation of intelligent systems.","title":"A scalable model of believable performance agents: Using case-based planning in the control of information access and application.","awardID":"0535231","effectiveDate":"2005-10-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["410053"],"PO":["387198"]},"109931":{"abstract":"Research at the frontiers of science now requires global collaborations, terabyte data infrastructures, and software tools for automating research and enabling collaboration. With funding from the National Science Foundation, Dr. Bertenthal and his colleagues will develop a Social Informatics Data (SID) Grid. The SID Grid will enable researchers to collect real-time multimodal behavior at multiple time scales. The development of a distributed data warehouse supported by a grid infrastructure will embolden researchers to address research questions that far exceed the capacities of any individual lab, such as how we construct our cognitive, social and cultural worlds through multimodal channels of communication, including speech, gesture, prosody, posture, facial expression, etc. or how the unfolding in real-time of social behaviors is a function of their neurobiological underpinnings, developmental status, context and cultural norms. The creation of the SID Grid will provide the needed infrastructure for supporting collaborative research in the social and behavioral sciences. This infrastructure will encourage data sharing and accelerate the development of standards for collecting and coding physiological and behavioral data. Outreach and dissemination will consist of creating a website with tutorials for using the SID Grid, organizing workshops on use of the infrastructure, and soliciting researchers to conduct multimodal research in the SuperLab. The availability of these databases and software tools promises to help usher in the next generation of behavioral sciences and scientists.","title":"Cyberinfrastructure for Collaborative Research in the Social and Behavioral Sciences","awardID":"0537849","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7368","name":"SCI TESTBEDS"}}],"PIcoPI":[291145,291146,291147,"533353","380937","380937"],"PO":["480590"]},"109469":{"abstract":"The number and size of simultaneously accessible information sources available to users continuously grows with advances in information technology, dramatically increasing the information processing burden on decision makers at all levels. Dynamically focusing user attention to a manageable subset of information that is \"most valuable\" at a given situation and time, and properly displaying this information, could have a crucial impact on the quality of the decisions s\/he makes. To address this challenging problem, we need to make systems aware of and responsive to the general and current needs and preferences of the user. In this project, the PI will develop new preference elicitation and reasoning technology for use in large-scale information integration and decision support systems that provide user-oriented selection, transformation, and integration of information arriving from multiple, heterogeneous, dynamically changing information sources. The goal is to support each user's personalized information needs while avoiding information overload yet remaining responsive to the user's changing interests and context, and to the available data sources in near real time. To this end, the PI will exploit and enhance recent developments in graphical qualitative models for preference representation, algorithms for constrained optimization, knowledge compilation strategies, and decision-theoretic frameworks for information processing and integration. He will build on his team's extensive prior work in the areas of decision-theoretic artificial intelligence, modeling and reasoning about people's decision strategies, and human-computer interaction. Effectiveness of the new technology will be demonstrated in an interactive application for field biologists.<br\/><br\/>Broader Impacts: The novel preference-based presentation techniques to be developed in this research will in the short run significantly aid field biologists-who gather large quantities of heterogeneous information while in the field but have limited methods for working with this information-by providing them with richer capture and comprehension of information without overload. In the longer run, these same user interface techniques will be of value across other scientific disciplines as well. Furthermore, they will be of value in diverse applications such as helping managers monitor information about their organization in real time, or helping rescue teams make time-critical decisions by providing team members with information that is sensitive to their current context, their role, and the team's state. More generally, this work will help people effectively utilize the abundant information available to them without drowning in it.","title":"Decision-Theoretic Methods for Personalized Adaptive Information Selection and Display","awardID":"0534662","effectiveDate":"2005-10-15","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["390884","561961"],"PO":["565227"]},"110360":{"abstract":"The project is aimed at developing a variable light wave sensor array that we will integrate into an ocean observational system. This system will be superior to most near coastal ocean models, which are typically wind driven but not contamination transport driven, in that our new model will be both. These objectives will be accomplished through the dynamic injection of observed ocean data into multiscale mathematical models and computer simulations. The project will create research topics in multiscale mathematics, statistics, and software application integration with a flexible, Grid-based<br\/>database and problem solving environment. The project will follow an integrated approach that addresses technical issues at each step of the process: 1) the dynamic simulation instructs the sensors what to look for and reprograms it for those analytes, 2) the sensors report to the simulation the new observed data, and 3) the simulation then incorporates the new data, updates its predictions, and reprograms the sensors as necessary in a closed loop. We will reduce the amount of human intervention needed to monitor spills and other contamination events, making DDDAS viable for sensors going to locations that are difficult to communicate with the sensors in real-time (e.g., an unreliable satellite link or another planetary body in the future). The work will build on the successful results of research previously funded by the NSF, including the SURA Coastal Ocean Observation and Prediction and two ITR projects to develop algorithms, error controls, and<br\/>middleware to optimally manage provably scalable computing resources for Grid computing. The project has the ultimate objective to guide the development of hardware and software to enable performing both lab and ocean test, but these tasks will be relegated for follow-on efforts to the present project. Both academic and industrial partners will be involved in the present effort. The research in this project will be extendable to other application environments.","title":"DDDAS-TMRP: Collaborative Research: Adaptive Data-Driven Sensor Configuration, Modeling, and Deployment for Oil, Chemical, and Biological Contamination near Coastal Facilities","awardID":"0540153","effectiveDate":"2005-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["496204","342952"],"PO":["551712"]},"110041":{"abstract":"The project will develop and validate with field experiments a new truly dynamic approach in forecasting the ocean state and associated uncertainties based on low-dimensional stochastic modeling that exploits the multiscale dynamics of the multivariate ocean. The main idea is to employ a few time-evolving POD (proper orthogonal decomposition) modes to parametrize the slow manifold, and subsequently to advance the solution<br\/>with a large time step using a Galerkin-free\/equation-free procedure. This approach is fundamentally different from the standard Galerkin method used often to produce evolution equations for reduced order modeling. Specifically, the new method uses only bursts of full simulations based on the Regional Ocean Model System (ROMS) and available experimental data, providing in essence a \"closure-on-demand\", in order to perform an equation-free time evolution. In such multiscale approach, the full simulation through ROMS resolves the fine scales whereas the Galerkin-free\/POD method - the coarse component - propagates with large time steps the most energetic modes of velocity, temperature and salinity and corresponding uncertainty fields.<br\/>Preliminary simulations using realistic data for the Massachusetts Bay suggest that<br\/>only a few modes are sufficient in describing the most interesting ocean dynamics, and that time steps of a few hours, instead of seconds or minutes, can be used in the Galerkin- free procedure. These results demonstrate feasibility of the proposed approach and imply that such fast predictions requiring very small computational cost and communications can indeed be performed on board of autonomous underwater vehicles (AUVs). Hence, these AUVs are endowed with navigation intelligence and true autonomy. This approach will be verified with full ROMS simulations and will be validated with three field experiments in the Cape Cod Bay. The final experiment in the third year of the<br\/>program will demonstrate the DDDAS concept in ocean forecasting. The project will<br\/>leverage the AUV fleet and other measurement resources as well as unique expertise for such missions of the MIT Sea Grant. The overall contribution of this project is a new paradigm in predicting the ocean state in real-time. Fundamental specific contributions include construction of time-dependent covariance kernels required in obtaining time-evolving POD modes; numerical analysis of the projective time-integration involved in the Galerkin-free multiscale procedure; representation of stochasticity via adaptive generalized polynomial chaos for uncertainty predictions; and rigorous protocols for data gathering in the ocean in the spirit of DDDAS.","title":"DDDAS-Collaborative Proposal: Multiscale Data-Driven POD-Based Prediction of the Ocean","awardID":"0538387","effectiveDate":"2005-10-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["517039"],"PO":["301532"]},"107766":{"abstract":"Decentralized systems are characterized by the absence of a single central coordinating authority responsible for making system-wide decisions and controlling the behavior of participant entities in the system. Each participant makes local autonomous decisions towards its individual goals which may potentially conflict with those of other participants. Open decentralized systems do not regulate the entry of participants into the system, potentially exposing the system to participants with malicious goals. In the absence of a controlling authority, each decentralized participant must take upon itself the responsibility of safeguarding itself against such attacks. Trust relationships based on reputation of participants can serve as important constituents in countermeasures against such attacks. A participant accumulates trust related information, analyzes the information, and builds trust relationships with other participants. These established trust relationships can be used to determine who can be trusted during future ensuing interactions.<br\/><br\/>Substantial effort has been devoted to developing decentralized reputation management systems. However, the existing literature has two major shortcomings. First, it has not directly addressed how such reputation management systems can be designed and developed in the context of an application. The underlying issue is that from a software engineering perspective, we lack a fundamental understanding of how all these components should be put together in a networked decentralized environment to provide a stable and secure system capable of withstanding security attacks. Second, there has been insufficient work directed at evaluating whether existing models effectively address critical threats. In addition, there has also been no comprehensive study of how a reputation model can be designed to counter various kinds of security attacks. The fundamental problem is that from a security perspective, there is a lack of both theoretical and empirical insights on how a reputation model can help detect, protect, and resist against attacks launched by a malicious participant or a group of colluding malicious participants.<br\/><br\/>Building on prior work, and drawing insights from a host of domains such as security, trust management, and software architecture, the project will create a comprehensive software architecture-based approach to engineering secure decentralized applications. The investigation of new modeling constructs, reasoning techniques, design principles and supporting tools will be conducted in three phases: theoretical analysis, development and assessment of guidelines, techniques, and tools through prototyping, and finally scalability and robustness assessment through simulation. Broader impacts will include influencing how large decentralized systems are built as well as educational curriculum.","title":"CT-ISG: A Software Architecture Approach for Decentralized Reputation Management","awardID":"0524033","effectiveDate":"2005-10-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["533779","464219"],"PO":["564388"]},"108767":{"abstract":"Intellectual Merit<br\/>The proposed research addresses the design issues for nanotechnologies, with a special focus on the architectural level and the integration level. The research tasks include investigation and development of efficient design methodologies, algorithms, and microarchitectures for the emerging nanotechnologies, including both nano-CMOS and technology candidates beyond CMOS. We plan to use nano-FPGA (nano-Field Programmable Gate Assembly) as an architecture\/platform driver to explore various issues in nanotechnology designs. The regularity and reconfigurability makes nano-FPGA an ideal candidate to support the reliability and complexity requirements of designs in nanotechnologies. Based on this driver, we will explore novel techniques to achieve highly reliable and error-resilient designs to overcome likely defects and non-deterministic behavior of new nanodevices. The outcome of this research project will be innovative design methodologies, tools, and algorithms that enable efficient and economic design solutions for nanotechnologies as soon as they become available and practical. <br\/><br\/>Broader Impact<br\/>The National Nanotechnology Initiative (NNI) has identified nanoelectronics, one of the next generation of information technology devices, as one of nine \"Grand Challenge\" areas because of the potentially significant economic and societal impact of innovations in this area. While most innovations in nanotechnology at this stage are primarily at the level of individual devices, it is at the systems level where the true potential of nanotechnology can be realized. The rather unique focus of this project on design methodologies and systems-level issues, such as design of architectures, robustness, and error-resilience, will help accelerate the development of viable nanoelectronic systems. On the other hand, at this early stage, nanotechnology research requires extensive investment and is truly pre-competitive in nature, which makes it an ideal candidate for international collaboration so that we can leverage the global investment and coordinate research efforts in this area. Therefore, we will explore international collaboration opportunities with researchers and educators from leading universities in Taiwan, and China in this target area. In addition to research collaboration, we will initiate an educational program that will enable U.S. students and young researchers to visit the participating countries for workshops, joint research, student exchanges, etc. It will help them appreciate the culture, technology, and economic development of these regions, thus developing the scientific talents and social interaction skills required of future leaders with international vision and experience.","title":"International Center on Design for Nanotechnologies","awardID":"0530261","effectiveDate":"2005-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1675","name":"NANOSCALE: SCIENCE & ENGIN CTR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["545047","446827","558485",287642],"PO":["565223"]},"110362":{"abstract":"The project is aimed at developing a variable light wave sensor array that we will integrate into an ocean observational system. This system will be superior to most near coastal ocean models, which are typically wind driven but not contamination transport driven, in that our new model will be both. These objectives will be accomplished through the dynamic injection of observed ocean data into multiscale mathematical models and computer simulations. The project will create research topics in multiscale mathematics, statistics, and software application integration with a flexible, Grid-based<br\/>database and problem solving environment. The project will follow an integrated approach that addresses technical issues at each step of the process: 1) the dynamic simulation instructs the sensors what to look for and reprograms it for those analytes, 2) the sensors report to the simulation the new observed data, and 3) the simulation then incorporates the new data, updates its predictions, and reprograms the sensors as necessary in a closed loop. We will reduce the amount of human intervention needed to monitor spills and other contamination events, making DDDAS viable for sensors going to locations that are difficult to communicate with the sensors in real-time (e.g., an unreliable satellite link or another planetary body in the future). The work will build on the successful results of research previously funded by the NSF, including the SURA Coastal Ocean Observation and Prediction and two ITR projects to develop algorithms, error controls, and<br\/>middleware to optimally manage provably scalable computing resources for Grid computing. The project has the ultimate objective to guide the development of hardware and software to enable performing both lab and ocean test, but these tasks will be relegated for follow-on efforts to the present project. Both academic and industrial partners will be involved in the present effort. The research in this project will be extendable to other application environments.","title":"DDDAS-TMRP: Collaborative Research: Adaptive Data-Driven Sensor Configuration, Modeling, and Deployment for Oil, Chemical, and Biological Contamination near Coastal Facilities","awardID":"0540155","effectiveDate":"2005-10-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["314146"],"PO":["551712"]},"107821":{"abstract":"Abstract<br\/><br\/>Voting systems require end-to-end trustworthiness, commencing with blank ballots and registration lists and concluding with the correct and auditable tallies of the marked ballots, reflecting the choices of the voters. This ballot round trip must resist well financed and organized adversaries that may include the very people who develop, maintain, or deploy the election machinery, and the process must be accessible to all citizens regardless of their disabilities or native language. The center's research investigates software architectures, tamper-resistant hardware, cryptographic protocols, and the role that various verification systems (e.g. paper, audio, cryptographic) can play in electronic voting systems. The center also examines system usability and studies how public policy and administrative procedures can, in combination with technology, better safeguard voting systems. <br\/><br\/>The voting system integrity problem is a paradigmatic hard Cyber Trust problem, requiring trustworthy system architectures, security, integrity, privacy, anonymity, high assurance, and human-machine interfaces. Voting systems must preserve a voter's privacy and anonymity, to reduce risks of voter coercion and bribery, yet they must be sufficiently auditable and transparent to allow for mistakes and errors to be identified and reconciled. This center's research develops a deeper understanding of how to organize, develop, and evaluate not only voting systems, but a wide range of other systems with end-to-end trustworthiness requirements.","title":"Collaborative Research: CT-CS: A Center for Correct, Usable, Reliable, Auditable, and Transparent Elections (ACCURATE)","awardID":"0524391","effectiveDate":"2005-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7456","name":"ITR-CYBERTRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["470450"],"PO":["564388"]}}