{"200200":{"abstract":"There are many types of disabilities caused by arthritis, where systematic physical activity and physical therapy are essential to preventing further deterioration. The challenge here is that periods of severe pain are an obstacle to such activities. The relationship between pain and physical activity is very tricky; it typically involves all joints (e.g., hands, wrists, feet, knees) and is a major cause of reduced quality of life and disability. This is the case with Rheumatoid Arthritis (RA), a chronic systemic inflammatory disease, where preserving functional range of motion and enhancing cardiovascular health are primary goals of physical therapy. Persons with RA who exercise regularly show not only improvements in muscle strength and overall physical and health function, but also reduced mortality. But it has been shown that long-term engagement in exercise among patients with RA is poor and does not exceed 50% when patients are not supervised. This results in a huge cost to national health care and to national productivity. <br\/><br\/>The PI argues that computer technology (tools and interfaces) can help the RA patient remain motivated and maintain movement. In this exploratory project her team will develop some of the components for motion capture and data integration that will eventually be integrated into a system called RPLAY which will enable patients with RA to perform physical therapy at home while the system accurately monitors their joint motions, motor performance and other physiological indicators. Specific objectives include: development of preliminary tools for human-centric adaptive remote monitoring, including facial, hand, arm, and body motions, and range of motion; development of prototype interactive games to encourage patient rehabilitation, and of a prototype user interface through which the patient and therapist can communicate via avatars to promote physical activity; and development of tools for validating the physical therapy monitoring and assessment results and their integration into a visualization and report system. <br\/><br\/>Broader Impacts: This project addresses issues of human joint pain and physical inactivity, which adversely affect the everyday lives of millions of people. It will lay the foundations for integrating disparate human data of persons in similar conditions, which will advance and extend the relationship between engineering innovation and computational analysis. The project will provide a training experience for computer science PhD students in modeling human motion in innovative ways. The project will also lead to an interdisciplinary course for physical therapy and computer science students on improving health delivery and rehabilitation practices.","title":"EAGER: An Exploratory Pilot Project to Build Human-Centric Physical Activity Monitoring Tools for Enhancing Rehabilitation Therapy Engagement and Assessment","awardID":"1258500","effectiveDate":"2012-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560636","558118","229551"],"PO":["565227"]},"198100":{"abstract":"DataBridge<br\/><br\/>There are currently thousands of scientists creating millions of data sets describing an increasingly diverse matrix of social and physical phenomena. This rapid increase in both amount and diversity of data implies a corresponding increase in the potential of data to empower important new collaborative research initiatives. However, the sheer volume and diversity of data presents a new set of challenges in locating all of the data relevant to a particular line of research. Taking full advantage of the unique data managed by the \"long-tail of science\" requires new tools specifically created to assist scientists in their search for relevant data sets. DataBridge is an e-science collaboration environment tool designed specifically for the exploration of a rich set of sociometric tools and the corresponding space of relevance algorithms, and their adaptation to define semantic bridges that link large numbers of diverse datasets into a sociometric network. Data from several large NSF funded projects will be analyzed to develop relevance-based data discovery methods. Sociometric network analysis (SNA) algorithms will be used to explore the space of relevancy (different ways data can be related to each other) by metadata and ontology, by pattern analysis and feature extraction, and via human connections. By linking data, human interactions, and usage methods and practices, rich models of social networks inter-connecting massive long tail science data can be created that enhance scientific collaboration and discovery. DataBridge supports advances in Science and Engineering by directly enabling and improving discovery of relevant scientific data across large, distributed and diverse collections. The system will also provide an easy means of publishing data to the DataBridge and incentivize data producers to do so by enabling collaboration and citation. The design will be domain-agnostic and highly extensible and adaptive, supporting inclusion of new relevance algorithms and indexing techniques. DataBridge will be distributed under an open source license enabling wider use and crowd-sourced improvements of the technology. The concepts developed in the project - semantically linking data through sociometric network analysis - will have an impact on non-scientific data collections and will effectively improve access and discovery of information over the web.","title":"BIGDATA: Mid-Scale: ESCE: DCM: Collaborative Research: DataBridge - A Sociometric System for Long-Tail Science Data Collections","awardID":"1247663","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[531638],"PO":["565292"]},"196385":{"abstract":"The goal of this research is to develop fundamental theory, efficient algorithms, and realistic<br\/>experiments for the analysis and design of safety-critical cyber-physical transportation systems<br\/>with human operators. The research focuses on preventing crashes between automobiles at road<br\/>intersections, since these account for about 40% of overall vehicle crashes. Specifically, the main<br\/>objective of this work is to design provably safe driver-assist systems that understand driver?s<br\/>intentions and provide warnings\/overrides to prevent collisions. In order to pursue this goal,<br\/>hybrid automata models for the driver-vehicles-intersection system, incorporating driver<br\/>behavior and performance as an integral part, are derived from human-factors experiments. A<br\/>partial order of these hybrid automata models is constructed, according to confidence levels on<br\/>the model parameters. The driver-assist design problem is then formulated as a set of partially<br\/>ordered hybrid differential games with imperfect information, in which games are ordered<br\/>according to parameter confidence levels. The resulting designs are validated experimentally in<br\/>a driving simulator and in large-scale computer simulations.<br\/><br\/>This research leverages the potential of embedded control and communication technologies to<br\/>prevent crashes at traffic intersections, by enabling networks of smart vehicles to cooperate with<br\/>each other, with the surrounding infrastructure, and with their drivers to make transportation<br\/>safer, more enjoyable, and more efficient. The work is based on a collaboration among<br\/>researchers in formal methods, autonomous control, and human factors who are studying realistic and<br\/>provably correct warning\/override algorithms that can be readily transitioned to production<br\/>vehicles.","title":"CPS: Synergy: Collaborative Research: Formal Design of Semi-Autonomous Cyberphysical Transportation Systems","awardID":"1238600","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[526569],"PO":["565274"]},"209717":{"abstract":"NSF-0644366<br\/>Chen, Xue-Wen<br\/><br\/>The objectives of this research program are (1) to develop and apply novel computational<br\/>approaches for uncovering genome-wide networks of interactions between genes and proteins, and (2) to conduct related educational activities in a newly established bioinformatics program in the Department of Electrical Engineering and Computer Science at the University of Kansas. Specifically, built upon reconstructing biological networks of moderate size, the new research will computationally uncover genome-wide biological networks and map interactions of genes and proteins across a variety of organisms. The research directions include: Simultaneously integrating multiple biological knowledge into dynamic Bayesian networks for learning networks of gene interactions; learning networks of protein interactions from heterogeneous data; learning integrated networks of gene and protein interactions; learning genome-wide networks of gene and protein interactions; and cross-species network learning. It will advance the state of the art by developing machine learning methods for effectively integrating multiple prior knowledge from different sources of data, including learning for highly heterogeneous data and large-scale network. The research will also produce new methods and user-friendly software that can be applied by molecular biologists to gain insight into diverse biological problems, such as how biological processes are regulated on a genome scale and how individual bio-molecules interact with one another in the cell.<br\/><br\/>Learning with prior knowledge and highly heterogeneous data sources are fundamental to computational biology, information theory, machine learning, data mining, and other areas. Thus, the proposed research will benefit a variety of application domains including research in biology and medicine. The biological discovery derived from this project will also contribute to a variety of fields that include agriculture development, rational drug design, and health care. The research program will foster and facilitate collaborations between biologists and the PI. The educational components are closely tied to the research activities, which include (1) developing and improving bioinformatics courses that are closely related to the research outlined here and integrating them into the core bioinformatics curriculum, and (2) providing special training opportunities in the interdisciplinary area of bioinformatics for a wide-range of students, from high school through graduate school, including groups typically underrepresented in the field of science and technology.","title":"CAREER: Machine Learning Approaches for Genome-wide Biological Network Inference","awardID":"1347706","effectiveDate":"2012-11-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[562163],"PO":["565136"]},"196497":{"abstract":"Large-scale critical infrastructure systems, including energy and transportation networks, comprise millions of individual elements (human, software and hardware) whose actions may be inconsequential in isolation but profoundly important in aggregate. The focus of this project is on the coordination of these elements via ubiquitous sensing, communications, computation, and control, with an emphasis on the electric grid. The project integrates ideas from economics and behavioral science into frameworks grounded in control theory and power systems. Our central construct is that of a ?resource cluster,? a collection of distributed resources (ex: solar PV, storage, deferrable loads) that can be coordinated to efficiently and reliably offer services (ex: power delivery) in the face of uncertainty (ex: PV output, consumer behavior). Three topic areas form the core of the project: (a) the theoretical foundations for the ?cluster manager? concept and complementary tools to characterize the capabilities of a resource cluster; (b) centralized resource coordination strategies that span multiple time scales via innovations in stochastic optimal control theory; and (c) decentralized coordination strategies based on cluster manager incentives and built upon foundations of non-cooperative dynamic game theory.<br\/><br\/>These innovations will improve the operation of infrastructure systems via a cyber-physical-social approach to the problem of resource allocation in complex infrastructures. By transforming the role of humans from passive resource recipients to active participants in the electric power system, the project will facilitate energy security for the nation, and climate change mitigation. The project will also engage K-12 students through lab-visits and lectures; address the undergraduate demand for power systems training through curricular innovations at the intersection of cyber-systems engineering and physical power systems; and equip graduate students with the multi-disciplinary training in power systems, communications, control, optimization and economics to become leaders in innovation.","title":"CPS: Synergy: Collaborative Research: Coordinated Resource Management of Cyber-Physical-Social Power Systems","awardID":"1239178","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[526911],"PO":["565239"]},"200732":{"abstract":"This is funding to support participation by approximately 8 graduate students (about half of them from U.S. institutions) along with senior members of the community (faculty and industry researchers) in a Doctoral Consortium (workshop) to be held in conjunction with and immediately preceding the 2012 International Symposium on Mixed and Augmented Reality (ISMAR 2012), which will take place November 6-8, in Atlanta, and which is organized by the IEEE Computer Society with academic sponsorship from the Association for Computing Machinery (ACM). For over a decade, ISMAR (and its forerunner events, IWAR\/ISAR and ISMR) has been the premier international conference on research into the science, technology, applications and uses of Mixed Reality (MR) and Augmented Reality (AR). The proliferation of powerful mobile hardware has opened up new avenues of research into MR and AR while enabling corporate and consumer applications on a wide scale. Across this spectrum fascinating new types of user interfaces, technologies, and concepts are beginning to emerge. The field is highly interdisciplinary in nature, bringing together technologists, educators, humanists, artists and social scientists, among others. ISMAR is one of the largest meetings devoted to the advancement of mixed reality, augmented reality, virtual reality, and human-computer interaction with the physical world, and encourages six different submission types: Papers and Posters, Workshops, Panels, Tutorials, Demonstrations and Contests. Because of the diverse fields relevant to mixed and augmented reality, ISMAR content is organized in two tracks: The Science & Technology (S&T) program and The Arts, Media and Humanities (AMH) program. The top papers are often extended, reviewed, and submitted for publication in the prestigious IEEE Transactions on Visualization and Computer Graphics. More information about the conference may be found at http:\/\/ismar.vgtc.org\/. <br\/><br\/>This will be the first Doctoral Consortium held in conjunction with an ISMAR symposium. The goal is to provide the students with an opportunity at a critical time in their careers to present their work to a group of mentors and peers from a diverse set of academic and industrial institutions, to receive feedback on their doctoral research plan and progress, and to build a cohort of young researchers within the ISMAR community. To these ends participants will be asked to prepare both a technical presentation and a poster describing their work. A pre-event social dinner on Sunday evening will allow the attendees (students, mentors and organizers) to get to know each other. On Monday morning the attendees will meet for an informal breakfast at 8:00 AM, after which each student participant will have 50 minutes devoted to his\/her research, beginning with a presentation for approximately 30 minutes followed by about 20 minutes reserved for an extensive discussion with the other graduate student participants and the senior researchers. The discussion will be facilitated by the Doctoral Consortium co-chairs and mentors, with the goal of addressing the strengths and weaknesses of the research, challenges and issues, implications of the results, potential suggestions for additional approaches or follow-on work, and career guidance related to the student's work and area. The posters will be on display during the main ISMAR conference poster sessions (in which the students will be expected to participate), and will be marked as being part of the Doctoral Consortium. All results from the Consortium, including the procedures followed, will be archived in an ISMAR 2012 DC binder as a reference for the next year's conference.<br\/><br\/>Broader Impacts: The organizers will take steps to achieve a diversity of research topics, disciplinary backgrounds, methodological approaches, and home institutions among the students to ensure that they meet people outside their own specific area. Factors such as gender and ethnicity will also be taken into account, with an emphasis on including underrepresented groups. To further increase diversity up to half the student participants may be invited from abroad but NSF funds will be used to support the 4 expected students from U.S. institutions of higher learning plus one international student; the organizers will work with colleagues in Europe and Asia to secure other funding for the remaining international students.","title":"ISMAR 2012 Doctoral Consortium","awardID":"1261694","effectiveDate":"2012-11-15","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[538206],"PO":["565227"]},"202228":{"abstract":"The technological advances of the past decade have given rise to an increasing number of creative practices and research areas that seek to overcome the long-standing separation between the physical and digital worlds. One key area of innovation has been tangible computing, which pushes the user interface beyond the screen into the physical world by means of mobile devices, graspable interfaces and interactive surfaces. Closely related is embedded interaction in which the everyday objects and environments we interact with are computationally augmented in new ways. As physical artifacts acquire new computational behaviors, they become reprogrammable, customizable, repurposeable, and interoperable in rich ecologies and diverse contexts. They also become more complex, and require intense design effort in order to be functional, usable, and enjoyable. Designing such systems requires interdisciplinary thinking, and making them encompasses not only technical knowledge of software, electronics, and mechanics, but also the use implications of a system's physical form and behavior as well as its impacts on society. <br\/><br\/>This is funding to support a Graduate Student Consortium (workshop) of about 12 promising doctoral students (7 from the United States, who alone will be supported by this grant), along with 4 distinguished research faculty. The event will take place in conjunction with the ACM SIGCHI 2013 International Conference on Tangible, Embedded, and Embodied Interaction (TEI 2013), which will be held February 10-13, 2013 in Barcelona, Spain. Launched in 2007 and now in its seventh year, the annual TEI conference series is about creating compelling experiences that bridge bits and atoms through research in human-computer interaction, design, interactive arts, tools and technologies. TEI brings together researchers, designers, engineers, and artists who provide an innovative and cross-disciplinary perspective on physical\/digital interaction design and technological innovation. The intimate size of this single-track conference (about 200 participants in recent years) provides a unique forum for exchanging ideas through talks, interactive exhibits, demos, posters, art installations and performances. More information about the conference may be found at http:\/\/www.tei-conf.org\/13\/. <br\/><br\/>The TEI 2013 Graduate Student Consortium will immediately precede the main conference, and will take place on Saturday evening, February 9, and all day Sunday, February 10, with follow-up activities during the conference's main technical program. On Sunday, students will present their research to their peers and the faculty mentors, who will constructively critique the students' work from diverse viewpoints. The students will also get to show their work in posters at the conference, and their short papers will be included in the conference Proceedings. A dinner event on Saturday evening before the Graduate Student Consortium will serve to set the stage for the following day's learning activity and allow participants to become acquainted with one another.<br\/><br\/>Broader Impacts: This workshop will sharpen the research skills of a new generation of scientists, engineers, and designers who will shape human-centered computing as it takes place in physical things and places. Already we are observing the impact of this field in our daily lives, as computing becomes embedded in our phones, our bus stops, and soon even our clothing. Now is a critical moment in the field, as a wave of early exploratory prototypes begins to give way to disciplined investigations, the development of toolkits, and more rigorous evaluation methods. Mentoring a next generation of TEI researchers is crucial if the field is to retain its initial vigor and openness as it gains foothold in the academic establishment of human-computing research. The TEI Graduate Consortium organizing committee will make special efforts to recruit a diverse set of student participants, particularly seeking members of groups that are under-represented in computer and information science and engineering, including women and members of U.S. minority populations. The committee is particularly concerned with increasing participation of underrepresented groups and will also ensure that the meeting is accessible to participants with disabilities.","title":"WORKSHOP: The TEI 2013 Graduate Student Consortium","awardID":"1302373","effectiveDate":"2012-11-15","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["552897"],"PO":["565227"]},"197785":{"abstract":"Clemson Next-Net models a next-generation evolutionary campus network and services for productive and innovative research and education. The project builds upon existing work to expand Clemson's networking capabilities, enable Software Defined Networking (SDN) in at least 20 buildings on campus, and integrate high-speed campus research and education locations into the campus and national OpenFlow based infrastructure. The completed network extension will support significant new scientific research and education opportunities for multiple departments, colleges, and research groups across Clemson that require access to remote instruments and\/or transfer large datasets. The project also facilitates future advances in Clemson?s networking infrastructure and its ability to connect to the national infrastructure.<br\/><br\/>The project provides a template for other universities who are planning similar campus network transformations and are working directly with Clemson on cross-campus projects in and beyond this project. Outreach, education, and training activities are also engaging faculty, students, and IT staff on campus and across campuses to leverage the created SDN network environment for their research, education, and operational needs. Such a quantum change in their perception of the networking and computing mechanism will provide users the basis and incentive to create new use cases with the technology.","title":"CC-NIE Integration: Clemson-NextNet","awardID":"1245936","effectiveDate":"2012-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8080","name":"Campus Cyberinfrastrc (CC-NIE)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["532703","561722"],"PO":["564246"]},"196498":{"abstract":"The goal of this research is to develop fundamental theory, efficient algorithms, and realistic<br\/>experiments for the analysis and design of safety-critical cyber-physical transportation systems<br\/>with human operators. The research focuses on preventing crashes between automobiles at road<br\/>intersections, since these account for about 40% of overall vehicle crashes. Specifically, the main<br\/>objective of this work is to design provably safe driver-assist systems that understand driver?s<br\/>intentions and provide warnings\/overrides to prevent collisions. In order to pursue this goal,<br\/>hybrid automata models for the driver-vehicles-intersection system, incorporating driver<br\/>behavior and performance as an integral part, are derived from human-factors experiments. A<br\/>partial order of these hybrid automata models is constructed, according to confidence levels on<br\/>the model parameters. The driver-assist design problem is then formulated as a set of partially<br\/>ordered hybrid differential games with imperfect information, in which games are ordered<br\/>according to parameter confidence levels. The resulting designs are validated experimentally in<br\/>a driving simulator and in large-scale computer simulations.<br\/><br\/>This research leverages the potential of embedded control and communication technologies to<br\/>prevent crashes at traffic intersections, by enabling networks of smart vehicles to cooperate with<br\/>each other, with the surrounding infrastructure, and with their drivers to make transportation<br\/>safer, more enjoyable, and more efficient. The work is based on a collaboration among<br\/>researchers in formal methods, autonomous control, and human factors who are studying realistic and<br\/>provably correct warning\/override algorithms that can be readily transitioned to production<br\/>vehicles.<br\/><br\/>http:\/\/ares.lids.mit.edu\/intersections","title":"CPS: Synergy: Collaborative Research: Formal Design of Semi-Autonomous Cyberphysical Transportation Systems","awardID":"1239182","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[526913,526914],"PO":["565274"]},"202900":{"abstract":"This is funding to support next year's CSCW doctoral research consortium (workshop) of approximately 10 promising doctoral students from the United States and abroad, along with about 5 distinguished research faculty. The event will take place in conjunction with the 16th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW 2013), to be held in San Antonio, Texas, on February 23-27, 2013, and which is sponsored by ACM's Special Interest Group on Human Computer Interaction (SIGCHI). The CSCW conferences, now an annual event, are the premier venue for presenting research in the design and use of technologies that affect groups, organizations, communities, and networks. CSCW 2012 was attended by approximately 650 professionals from around the world. The development and application of new technologies continues to enable new ways of working together and coordinating activities. Although work is an important area of focus for CSCW, technology is increasingly supporting a wide range of recreational and social activities. CSCW has also embraced an increasing range of devices, as we collaborate from different contexts and situations. The conference brings together top researchers and practitioners from academia and industry who are interested in both the technical and social challenges encountered when supporting collaboration. Research reports published in the CSCW Conference Proceedings are heavily refereed and widely cited. More information about the conference may be found at http:\/\/cscw.acm.org\/.<br\/><br\/>The Doctoral Colloquium at CSCW 2013 will take place on Saturday evening, February 23 and all day Sunday, February 24, with follow-up activities (including poster sessions) during the conference's main technical program. Goals of the doctoral consortium include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field mentor them and provide constructive advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants, who are chosen by a review committee based on materials submitted by applicants in response to the CSCW Call for Participation, will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other CSCW research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Extended abstracts of the students' presentations will be published in the CSCW supplemental proceedings, which will be available to conference attendees. The organizing committee will take proactive steps to ensure and increase participation from institutions and ethnic groups that have been traditionally underrepresented at CSCW.<br\/><br\/>Broader Impacts: The CSCW doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today?s leading CSCW researchers participated as students in earlier consortia. These workshops traditionally bring together the best of the next generation of CSCW researchers, allowing them both to sharpen the research skills and to create a social network among themselves and with senior researchers at a critical stage in their professional development. Maintaining and fostering research dialog among the diverse disciplines that are present in the CSCW community results in synergistic and transformative research collaborations. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: Computer Supported Cooperative Work 2013 Doctoral Research Colloquium","awardID":"1305728","effectiveDate":"2012-11-15","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[543781],"PO":["565227"]},"206948":{"abstract":"Abstract<br\/><br\/>0916845 <br\/>Nealen, Andrew <br\/>HCC: Small: Dynamic Skeletal Part Hierarchies for Sketching 3D Shapes and Their Animations<br\/>Rutgers University New Brunswick<br\/><br\/>Software for creating, modifying and animating digital 3D shapes is a key component in many computer applications: computer aided design, engineering, computer animation and digital games to name a few. This proposal addresses research into dynamic hierarchical part hierarchies, which combine the interrelated topics of modeling and animating digital shapes into a coherent whole, as well as simple and effective sketch-based computer tools, with the ultimate goal of making these tasks more accessible to amateurs and professionals alike. Advances in consumer computer graphics, as well as the current inþux of user generated digital content, both in virtual 3D worlds as well as on the Internet, illustrate the demand for easy-to-use 3D content creation software. Recent research in shape modeling and animation, as well as sketch-based interfaces, has led to the development of experimental techniques, which clearly demonstrate their viability. Yet, most of these are highly specialized and domain specific, and they do not deal with these problems as a whole. The proposed research will build upon this previous work, but put an emphasis on developing new sketch-based interfaces, algorithms and shape representations that allow combining previously disjoint, yet intrinsically connected tasks of shape modeling and animation.","title":"CGV: Small: Dynamic Skeletal Part Hierarchies for Sketching 3D Shapes and Their Animations","awardID":"1331001","effectiveDate":"2012-11-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[554082],"PO":["565227"]},"200735":{"abstract":"This project supports student travel to IEEE International Symposium on Workload Characterization (IISWC) to be held in San Diego, CA on Nov 4-6, 2012. IISWC is dedicated to the understanding and characterization of workloads that run on all types of computing systems. New applications and programming paradigms continue to emerge as the diversity and performance of computers increase. On the one hand, computing workloads evolve and change with advances in microarchitecture, compilers, programming languages, and networking\/communication technologies. This symposium, sponsored by IEEE Computer Society and the Technical Committee on Computer Architecture, will focus on characterizing and understanding modern computer applications commercial and scientific computing.","title":"IISWC 2012 Student Travel Grants","awardID":"1261723","effectiveDate":"2012-11-15","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["556800"],"PO":["565255"]},"196832":{"abstract":"The University of California, Santa Barbara proposes to discover low anchor points and develop learning progressions for computational thinking and related computer science concepts. These learning progressions are a necessary step towards the integration of computational thinking and computer science concepts into K-12. The project staff will develop two curricula - one for grades 2-6 and one for grades 4-6. The curricula and learning progressions will iteratively inform one another. Further, the curricula will be a proof of concept that students can develop computational thinking skills in a way that reinforces other academic subjects and their own culture, and provide a practical way for teachers to begin teaching computer science at different entry points within grades 2-6.<br\/><br\/>Computing has infiltrated almost all corners of life and is an increasingly important part of driving innovation, and the next generation of inventors need to understand how to develop and use software. The ability to analyze and express problems in a way compatible with software solutions, or computational thinking, will become critical in modern society. This work has the potential to revolutionize how computer science is taught in elementary schools by showing how these computational thinking skills can be developed in three or six years while supporting education in the existing curriculum. In addition, the resulting curricular materials will be developed with diverse students as the targets. First, the project staff will explore the prior knowledge that students with different backgrounds have, leading to everyday examples that are more accessible and meaningful to diverse students. Second, the content delivery will use the latest research in teaching diverse students computer science concepts.","title":"CER: DEPICT: Developing Elementary (Learning) Progressions to Integrate Computational Thinking","awardID":"1240985","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7645","name":"DISCOVERY RESEARCH K-12"}}],"PIcoPI":[528013,528014],"PO":["560704"]},"196514":{"abstract":"Large-scale critical infrastructure systems, including energy and transportation networks, comprise millions of individual elements (human, software and hardware) whose actions may be inconsequential in isolation but profoundly important in aggregate. The focus of this project is on the coordination of these elements via ubiquitous sensing, communications, computation, and control, with an emphasis on the electric grid. The project integrates ideas from economics and behavioral science into frameworks grounded in control theory and power systems. Our central construct is that of a ?resource cluster,? a collection of distributed resources (ex: solar PV, storage, deferrable loads) that can be coordinated to efficiently and reliably offer services (ex: power delivery) in the face of uncertainty (ex: PV output, consumer behavior). Three topic areas form the core of the project: (a) the theoretical foundations for the ?cluster manager? concept and complementary tools to characterize the capabilities of a resource cluster; (b) centralized resource coordination strategies that span multiple time scales via innovations in stochastic optimal control theory; and (c) decentralized coordination strategies based on cluster manager incentives and built upon foundations of non-cooperative dynamic game theory.<br\/><br\/>These innovations will improve the operation of infrastructure systems via a cyber-physical-social approach to the problem of resource allocation in complex infrastructures. By transforming the role of humans from passive resource recipients to active participants in the electric power system, the project will facilitate energy security for the nation, and climate change mitigation. The project will also engage K-12 students through lab-visits and lectures; address the undergraduate demand for power systems training through curricular innovations at the intersection of cyber-systems engineering and physical power systems; and equip graduate students with the multi-disciplinary training in power systems, communications, control, optimization and economics to become leaders in innovation.","title":"CPS: Synergy: Collaborative Research: Coordinated Resource Management of Cyber-Physical-Social Power Systems","awardID":"1239274","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7477","name":"CI-TEAM"}}],"PIcoPI":["492015","526958",526958],"PO":["565239"]},"196536":{"abstract":"Large-scale critical infrastructure systems, including energy and transportation networks, comprise millions of individual elements (human, software and hardware) whose actions may be inconsequential in isolation but profoundly important in aggregate. The focus of this project is on the coordination of these elements via ubiquitous sensing, communications, computation, and control, with an emphasis on the electric grid. The project integrates ideas from economics and behavioral science into frameworks grounded in control theory and power systems. Our central construct is that of a ?resource cluster,? a collection of distributed resources (ex: solar PV, storage, deferrable loads) that can be coordinated to efficiently and reliably offer services (ex: power delivery) in the face of uncertainty (ex: PV output, consumer behavior). Three topic areas form the core of the project: (a) the theoretical foundations for the ?cluster manager? concept and complementary tools to characterize the capabilities of a resource cluster; (b) centralized resource coordination strategies that span multiple time scales via innovations in stochastic optimal control theory; and (c) decentralized coordination strategies based on cluster manager incentives and built upon foundations of non-cooperative dynamic game theory.<br\/><br\/>These innovations will improve the operation of infrastructure systems via a cyber-physical-social approach to the problem of resource allocation in complex infrastructures. By transforming the role of humans from passive resource recipients to active participants in the electric power system, the project will facilitate energy security for the nation, and climate change mitigation. The project will also engage K-12 students through lab-visits and lectures; address the undergraduate demand for power systems training through curricular innovations at the intersection of cyber-systems engineering and physical power systems; and equip graduate students with the multi-disciplinary training in power systems, communications, control, optimization and economics to become leaders in innovation.","title":"CPS: Synergy: Collaborative Research: Coordinated Resource Management of Cyber-Physical-Social Power Systems","awardID":"1239467","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["554417",527040,527041],"PO":["565239"]},"196835":{"abstract":"The Santa Fe Institute (SFI), in partnership with the University of New Mexico, the Supercomputing Challenge, and other educational organizations, industry partners, and local schools, proposes a project called New Mexico Computer Science for All (NM-CSforAll). NM-CSforAll?s primary targets middle and high school STEM teachers, preparing them to be future CS teachers. It offers a novel, interdisciplinary approach that uses modeling and simulation as the basis for teaching CS Principles, the proposed, new Advanced Placement (AP) CS course. Teachers first take the modeling and simulation version of CS Principles and then implement it as a dual credit course for their students. During a Spring semester-long course, the teachers investigate real-world problems, view them through the lens of complex systems--SFI's primary research area--and then model and analyze them using agent-based modeling techniques. The project uses a \"flipped\" classroom methodology, meaning the lecture portion of the course will be offered as online videos, while the exercise and project work will take place in the lab, face-to-face. A Summer workshop focuses on reviewing the CS content of the course, learning pedagogy, and recruitment techniques in preparation for the Fall semester implementation in the schools. The Fall implementation of the dual credit CS Principles class for high school students uses the videos developed for the teacher professional development course as lecture material and weekly \"lab\" session meetings led by participating teachers acting as learning coaches. (NM now requires a dual-credit, AP, or honors course for high school graduation and this course will fulfill the requirement.) NM CSforAll's secondary strategy fosters teachers' CS content learning, CS teaching pedagogy, and computer programming practice through engagement in a professional online community. NM-CSforAll's online network will include video sharing, uploading of documentation of work sessions, and social networking capabilities providing opportunities for teachers to learn from each other?s implementations of CS activities and communicate with each other, STEM educators, CS professionals and educational researchers. Teacher participants, as the co-creators of content for the site, will have shared authority, a critical factor in creating environments conducive to building knowledge about teaching and learning CS. The project evaluation will determine whether teacher professional development in CS that integrates computational modeling and analysis of complex systems, builds capacity in future CS teachers, and whether co-creation and use of an online professional development network can improve teachers' pedagogical skills and sustain their interest in CS.","title":"CS 10K: New Mexico Computer Science for All (NM CSforAll)","awardID":"1240992","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7361","name":"EDUCATION AND WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["535543"],"PO":["561855"]},"197804":{"abstract":"This project, CC-NIE Network Infrastructure: High Performance Research Networking (HiPerNet), establishes a Science DMZ at the University of Chicago that is distinct from the general-purpose campus network and that is purpose-built for data-intensive science. This Science DMZ includes support for virtual circuits, software defined networking, and 100 gigabit Ethernet. It includes a targeted renovation of the existing campus networking infrastructure, focusing on intra-campus networking from labs and buildings which have high data I\/O and networking needs, as well as improving the throughput from these facilities to high-speed national and international research networks.<br\/><br\/>Intellectual Merit: This upgrade supports a range of projects in Astronomy, Astrophysics, Computer Science, Social Sciences, Genomics, and Particle Physics. Data-intensive science in these fields requires an upgrade to support high-performance bulk data movement, data-intensive experimental needs, and access to high performance national and international networks in order to foster collaboration and discovery on high-priority projects. The Science DMZ also benefits computer science projects at that are developing innovative data-intensive computing infrastructure, including Globus Online, Open Science Data Cloud, and the UDP-based Data Transfer (UDT) protocol, providing a testbed for new methods. <br\/><br\/>Broader Impact: This upgrade enables researchers to share data with a larger community of users by facilitating collaboration across universities and labs. In addition, UChicago will take lessons learned from this experience and package them in a form suitable for consumption by other campuses pursuing similar goals. Enhancing campus networking abilities also benefits the surrounding community including schools, community hospitals, and the Adler Planetarium.","title":"CC-NIE Network Infrastructure: High Performance Research Networking (HiPerNet)","awardID":"1246019","effectiveDate":"2012-11-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8080","name":"Campus Cyberinfrastrc (CC-NIE)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[530812,"554547","533353"],"PO":["564246"]},"202162":{"abstract":"This workshop will examine three areas in networking in which combining the research strengths of both Japan and the US could benefit both countries. These areas are: network design and modeling, mobility services on a large scale, and optical networking. The workshop will bring together key researchers from the US and Japan these three areas of computer networking. Japan brings unique research strengths to each of the major areas and US research can be expected to benefit from the exposure to the Japanese technology. Moreover, the areas under discussion are expected to have significant long-term impact on US network research infrastructures. To facilitate dissemination of workshop results the PI will maintain a public website containing workshop presentations and reports.","title":"US-Japan Networking Research Collaboration Workshop, November 12-14, 2013 in Kyobashi Chuo-Ku, Tokyo, Japan","awardID":"1302040","effectiveDate":"2012-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[541801],"PO":["564993"]},"198094":{"abstract":"DataBridge<br\/><br\/>There are currently thousands of scientists creating millions of data sets describing an increasingly diverse matrix of social and physical phenomena. This rapid increase in both amount and diversity of data implies a corresponding increase in the potential of data to empower important new collaborative research initiatives. However, the sheer volume and diversity of data presents a new set of challenges in locating all of the data relevant to a particular line of research. Taking full advantage of the unique data managed by the \"long-tail of science\" requires new tools specifically created to assist scientists in their search for relevant data sets. DataBridge is an e-science collaboration environment tool designed specifically for the exploration of a rich set of sociometric tools and the corresponding space of relevance algorithms, and their adaptation to define semantic bridges that link large numbers of diverse datasets into a sociometric network. Data from several large NSF funded projects will be analyzed to develop relevance-based data discovery methods. Sociometric network analysis (SNA) algorithms will be used to explore the space of relevancy (different ways data can be related to each other) by metadata and ontology, by pattern analysis and feature extraction, and via human connections. By linking data, human interactions, and usage methods and practices, rich models of social networks inter-connecting massive long tail science data can be created that enhance scientific collaboration and discovery. DataBridge supports advances in Science and Engineering by directly enabling and improving discovery of relevant scientific data across large, distributed and diverse collections. The system will also provide an easy means of publishing data to the DataBridge and incentivize data producers to do so by enabling collaboration and citation. The design will be domain-agnostic and highly extensible and adaptive, supporting inclusion of new relevance algorithms and indexing techniques. DataBridge will be distributed under an open source license enabling wider use and crowd-sourced improvements of the technology. The concepts developed in the project - semantically linking data through sociometric network analysis - will have an impact on non-scientific data collections and will effectively improve access and discovery of information over the web.","title":"BIGDATA: Mid-Scale: ESCE: DCM: Collaborative Research: DataBridge - A Sociometric System for Long-Tail Science Data Collections","awardID":"1247602","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[531617],"PO":["565292"]},"202132":{"abstract":"On Election Day, poll workers must operate a complex system composed of people, processes, and technology. Even minor mistakes in the operation of the system can lead to security failures, which could in turn lead to the wrong candidates being selected. However, pollworkers are generally not technically astute, receive minimal training, are not attuned to systems and security issues, and are prone to making security mistakes that endanger elections, especially towards the end of the day due to worker fatigue.<br\/><br\/>This project studies how poll workers manage voting technology at the opening and closing of polls on Election Day in an effort to understand the impact poll workers have on voting system security. In particular, it will examine what kinds of common security problems do poll workers encounter in opening\/closing the polls; why do these problems seem to occur and their likely causes; and if there are particular points in poll\/opening\/closing where poll workers are more likely to encounter security issues or make mistakes.<br\/><br\/>The project reveals opportunities for deeper investigation of security gaps in poll workers? setting up and shutting down the polls that may be remedied by better design of procedures, job aids, training and content available in the polling place.","title":"EAGER: Poll Workers and Election Security","awardID":"1301887","effectiveDate":"2012-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[541713,541714],"PO":["565327"]},"202672":{"abstract":"NSF's Secure and Trustworthy Cyberspace (SaTC) program now spans multiple directorates. Of particular relevance to this proposal, the Social, Behavioral and Economics (SBE) Directorate is now an important part of SaTC. Increasingly, it is recognized that computer security involves humans and applications, the forte of SBE's research, in additional to the traditional technical problems the Computer Science community, the mainstay of the CISE Directorate, have worked on. Applications of interest are those related to \"critical infrastructures\", such as electricity delivery, financial systems, and healthcare, all of which offer unique security and privacy concerns in addition to requiring traditional security solutions. <br\/><br\/>Despite its importance to an eclectic view of computer security, too few proposals integrating social science research and security have been submitted to SaTC. The purpose of the \"Cyber Café\" is to help promote more interest in proposals that are at the intersection of social science and more traditional computer security research. It is expected that the Cyber Café will foster collaborations between the social science and traditional security communities by informing each of the communities to research interests of the other community and in general helping the two communities build teams that will submit proposals to future SaTC solicitations. <br\/><br\/>The proposed Cyber Café will be entirely virtual. Participants will have access to this meeting by phone and the Web but in a manner that promotes collaboration, interaction, and team building.","title":"SaTC Cyber Cafe","awardID":"1304678","effectiveDate":"2012-11-15","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[543138],"PO":["565327"]},"205886":{"abstract":"Key management in wireless networks is a very challenging problem because of the unreliable transmission medium, the lack of network infrastructure, and stringent energy and complexity limitations at terminals. Recently, there has been increased interest in exploiting physical layer dynamics to generate keys. However, existing schemes exploit only the channel dynamics in the point-to-point channel or basic small wireless systems, but not other rich dynamics inherent to multiuser wireless networks. Furthermore, current studies focus mainly on the pairwise key agreement problem, and did not address issues arising from user interactions in networks. This project develops practical key generation schemes for large scale networks, which 1) fully exploit rich opportunities inherent to network dynamics, and 2) properly address issues arising from interaction among multiple users in networks. Topics including unicast and\/or multicast key generation, oblivious relay-assisted key generation, and secret sharing among multiple users are investigated. The goal of this project is to design transmission protocols and algorithms that have engineering impact and practical feasibility. Furthermore, these protocols and algorithms are implemented and tested on a testbed. This project also has strong education components. In addition to providing thesis topics for graduate students, this project provides hands-on lab opportunities for undergraduate education on communication security.","title":"TC: Small: Collaborative Research: Exploiting Network Dynamics for Secret Key Generation","awardID":"1321223","effectiveDate":"2012-11-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[551202],"PO":["565327"]},"198098":{"abstract":"DataBridge<br\/><br\/>There are currently thousands of scientists creating millions of data sets describing an increasingly diverse matrix of social and physical phenomena. This rapid increase in both amount and diversity of data implies a corresponding increase in the potential of data to empower important new collaborative research initiatives. However, the sheer volume and diversity of data presents a new set of challenges in locating all of the data relevant to a particular line of research. Taking full advantage of the unique data managed by the \"long-tail of science\" requires new tools specifically created to assist scientists in their search for relevant data sets. DataBridge is an e-science collaboration environment tool designed specifically for the exploration of a rich set of sociometric tools and the corresponding space of relevance algorithms, and their adaptation to define semantic bridges that link large numbers of diverse datasets into a sociometric network. Data from several large NSF funded projects will be analyzed to develop relevance-based data discovery methods. Sociometric network analysis (SNA) algorithms will be used to explore the space of relevancy (different ways data can be related to each other) by metadata and ontology, by pattern analysis and feature extraction, and via human connections. By linking data, human interactions, and usage methods and practices, rich models of social networks inter-connecting massive long tail science data can be created that enhance scientific collaboration and discovery. DataBridge supports advances in Science and Engineering by directly enabling and improving discovery of relevant scientific data across large, distributed and diverse collections. The system will also provide an easy means of publishing data to the DataBridge and incentivize data producers to do so by enabling collaboration and citation. The design will be domain-agnostic and highly extensible and adaptive, supporting inclusion of new relevance algorithms and indexing techniques. DataBridge will be distributed under an open source license enabling wider use and crowd-sourced improvements of the technology. The concepts developed in the project - semantically linking data through sociometric network analysis - will have an impact on non-scientific data collections and will effectively improve access and discovery of information over the web.","title":"BIGDATA: Mid-Scale: ESCE: DCM: Collaborative Research: DataBridge - A Sociometric System for Long-Tail Science Data Collections","awardID":"1247652","effectiveDate":"2012-11-01","expirationDate":"2015-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":["554652",531629,"557802",531631,531632],"PO":["565292"]},"200672":{"abstract":"The objective of this workshop is to bring together researchers to discuss actual data management implementation architectures and their application to discipline-specific workflows. This workshop thus builds on the results of the NSF funded data lifecycle management workshop held at Princeton University in 2011, shifting focus to implementations solutions. We will invite submission of position and experience papers that describe implementations of discipline-based data management infrastructure and services, and the ways in which those solutions leverage resources within and outside their institutions. The workshop will also engage participants in a discussion of how a coordinated effort among research computing centers may accelerate the implementation of effective research data management workflows, and contribute to national efforts and initiatives.<br\/><br\/>Intellectual Merit: Collecting, moving, analyzing, sharing and preserving the appropriate data<br\/>are fundamental to research. While many meetings and workshops have discussed best<br\/>practices, too few meetings have focused on how data management plans are implemented for<br\/>different disciplines. The resulting lack of broadly applicable research data management<br\/>methods and implementations has led to a culture of one-off, institution-specific, and potentially<br\/>unsustainable solutions; as well as the use of data structures and formats, organizational<br\/>structures, and\/or metadata tagging approaches that are not maintainable or transferrable.<br\/>Recommendations developed at this workshop will enable more effective coordination of data<br\/>within and among institutions. This workshop will have a direct impact on the research<br\/>capabilities by sharing implementations and interoperable plans for research data management.<br\/><br\/>Intellectual Merit: Collecting, moving, analyzing, sharing and preserving the appropriate data<br\/>are fundamental to research. While many meetings and workshops have discussed best<br\/>practices, too few meetings have focused on how data management plans are implemented for<br\/>different disciplines. The resulting lack of broadly applicable research data management<br\/>methods and implementations has led to a culture of one-off, institution-specific, and potentially<br\/>unsustainable solutions; as well as the use of data structures and formats, organizational<br\/>structures, and\/or metadata tagging approaches that are not maintainable or transferrable.<br\/>Recommendations developed at this workshop will enable more effective coordination of data<br\/>within and among institutions. This workshop will have a direct impact on the research<br\/>capabilities by sharing implementations and interoperable plans for research data management.","title":"NSF Workshop on Research Data Management Implementations","awardID":"1261384","effectiveDate":"2012-11-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":[538054],"PO":["565292"]}}