{"58493":{"abstract":"","title":"From Medium Access to Physical Layer: An Integrated DSP Framework for Wireless Packet Networks","awardID":"0096164","effectiveDate":"2000-01-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["553162"],"PO":["564898"]},"58472":{"abstract":"","title":"U.S.-China Cooperative Research: A Theory and Methodology for Testing Concurrent Software Systems","awardID":"0096143","effectiveDate":"2000-01-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["383005"],"PO":["179469"]},"58494":{"abstract":"","title":"Career: Bilinear Shape-Constrained Regression in Blind Source Separation\/Equalization, and Signal Processing for Chromatographic Analysis","awardID":"0096165","effectiveDate":"2000-01-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["553162"],"PO":["564898"]},"39465":{"abstract":"Micro-electro-mechanical Systems (MEMS) technology has demonstrated the capability of batch fabricating micron-sized sensor and actuator systems. The availability of stable MEMS fabrication processes has fueled an increase in MEMS design complexity, and highlighted the need for CAD tools to aid in design verification. This project is developing algorithms for automated extraction of MEMS elements and components needed for design verification. These algorithms rely on (1) geometric information to analyze shapes, size, and connectivity of various mechanical elements; (2) strength of material based estimations to assess relative stiffness of various components (3) connectivity with electronic interface to identify functionality of various mechanical components. This research investigates the following. Determining mechanical component representations that are suitable for interfacing with existing representations of electronic components. Evaluating the efficiency of simulation models derived from a spatial representation. Exploring approaches to trade-off simulation efficiency versus simulation accuracy in extraction algorithms. Finding soundness guarantees in the extraction algorithms for a wide variety of MEMS devices.","title":"Automated Extraction for Structured Design of MEMS Devices","awardID":"9901171","effectiveDate":"2000-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["426467"],"PO":["562984"]},"43195":{"abstract":"The IEEE INFOCOM Conference on Computer Communications will be held in Tel Aviv, Israel on March 26-30, 2000. This Preeminent technical conference is the primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners of graduate students, post-doctoral researchers, and faculty members.<br\/><br\/>Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge researchers in the field. This grant funds approximately twenty graduate students, post-docs, and junior faculty in the United States to attend this conference.","title":"Travel Support for IEEE INFOCOM 2000 Conference; Tel Aviv, Israel; March 26-30, 2000","awardID":"9912083","effectiveDate":"2000-01-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[109362],"PO":["125800"]},"46473":{"abstract":"This program, a project of the College of Engineering with collaborative support from the Department of Education at Tufts University and the Nashoba Regional School District, is infusing the K-10 curriculum with engineering approaches and activities that are aligned with the new Massachusetts Science and Technology\/Engineering Standards by placing engineering and computer science students (fellows) in the classrooms. Using their backgrounds, and equipped with a set of hands-on engineering-based project ideas and pedagogy know-how, the fellows are working with teacher liaisons to introduce engineering principles into the K-10 grades. The material being introduced conforms with the recently developed Massachusetts Standards for Science and Technology\/Engineering and National Standards of Technology and Science. This material is being collected and created by an experienced team of Tufts faculty, K-12 professionals and graduate students. This is the first systemic and formal attempt to introduce engineering throughout the K-10 student experiences, with special emphasis on middle school. As a by-product, it is expected that this program will lead to new and productive collaborations between engineers and mathematical scientists, educators, and education researchers, and create a model program for engineering education in K-12 environments.","title":"GK-12 Engineering Fellows: A K-12 Resource for Integrating Engineering, Math and Science","awardID":"9979593","effectiveDate":"2000-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7348","name":"TEACHER PREPARATION PROGRAM"}}],"PIcoPI":["269497","426503","316342","332610","549076","460241"],"PO":["558835"]},"46242":{"abstract":"9978382<br\/>Moss<br\/>This award supports Simon Moss, Paul Chow, Joseph Kulik, and a graduate student from the University of Houston in a collaboration with Hannu Pekka Suortti at the X-Ray Laboratory at the University of Helsinki, Finland. The project will focus on establishing the existence of a Fermi surface and measuring its dimensions using Compton scattering from selected quasicrystals and related intermetallic structures. A long-range goal is to understand the transport and electronic properties of complex conductors which can eventually include metallic glasses, conducting oxides, and magnetic materials. The collaboration draws on the individual expertise of researchers in the fields of quasicrystals (U. of Houston, Ames Laboratory, and City College of New York) and Compton scattering (U. of Helsinki). The overall scientific benefit of the collaboration to the research community will be to provide important information on alloy physics which would be difficult for any individual group to collect and analyze due to the complicated nature of quasicrystals and the sophisticated techniques required for high-energy Compton scattering.","title":"U.S.-Finland Cooperative Research: Fermi Surface Determination of Quasicrystal via Compton Scattering","awardID":"9978382","effectiveDate":"2000-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["246561",117956,117957],"PO":["561352"]},"49674":{"abstract":"This award supports a workshop that focuses on the social and organizational aspects of geographically and functionally distributed work. There is a perception among leading researchers that technological and economic change during the past five years has lead to substantial change in the way that Americans work and that we have little overall understanding of the long-term implications of these changes. Workers are increasingly mobile, use a variety of technologies to connect with their colleagues and have to contend with a variety of complex work arrangements that might include: long-distance commuting; working on teams where members are distributed geographically; extensive travel; and multi-organizational work (e.g., due to joint ventures, mergers, consulting, outsourcing, etc.) With more advanced computing and telecommunications technologies, such as Internet 2, on the horizon, even more significant changes are envisioned. Much new research is being conducted by a variety of researchers from psychology, sociology, anthropology, information science, computer science, industrial engineering and history. <br\/><br\/>Due to the diverse backgrounds, venues for publication and academic peer groups, there have been few opportunities for these researchers to meet and share their research studies and perspectives. This workshop will bring the key researchers from these various disciplines together and will result in a web site and book where the research will be collected. Overall, the workshop will contribute to the establishment of a research agenda for this important line of work.","title":"Workshop on the Social Aspects of Distributed Work","awardID":"0000566","effectiveDate":"2000-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["519226"],"PO":["495796"]},"49587":{"abstract":"In recent years, there has been an explosive growth of new process technologies, new device concepts, and new markets for integrated sensors and actuators, also referred to as micro-electro-mechanical systems (MEMS). This growth has led to new challenges for computer-aided-design (CAD) of MEMS, with the ultimate goals being accurate, easy-to-use behavioral models that capture all the essential behavior, and permit predictable design modifications and optimization. This research investigates the lack of design guidelines for reliability with regard to dynamic (shock) loading. Such loading can occur either by choice (for example, MEMS launched on satellites), or by accidental drops onto hard surfaces. There is evidence that the small moveable parts of MEMS devices, such as suspended proof masses in accelerometers, experience fracture from dynamic loading levels which the devices are expected to withstand based on quasi-static loading models. It is hypothesized that the inertia of a packaged MEMS, when subject to even modest acceleration, provides a reservoir of kinetic energy which can then be transferred to the mechanical elements as acoustic waves, and cause fracture due to stress wave loading. This project examines the validity of this hypothesis by using numerical analyses to establish expected behavior. For confirmation, experimental studies of subjecting Si microstructures to stress-wave loading are being made. Modeling procedures to anticipate such failures, and by proper design, prevent them are being developed.","title":"SGER: Guidelines for Computer-Aided-Design of Dynamically Reliable MEMS","awardID":"0000342","effectiveDate":"2000-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["252476"],"PO":["321058"]},"58498":{"abstract":"","title":"Using Intranets in Technical and Institutional Environments","awardID":"0096169","effectiveDate":"2000-01-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["297550"],"PO":["565227"]},"41470":{"abstract":"This is a collaborative project between the Information Retrieval Center and the Resource-Bounded Reasoning Lab at UMass. The project is aimed at developing a new approach to meta-level control of search and applying it to improve the flexibility, adaptability, quality of service, and robustness of information retrieval search engines. Currently, such systems are built by integrating a fixed set of modules and techniques that perform such tasks as query formation, query optimization, query evaluation, precision improvement, and recall improvement. The new approach consists of context-dependent mechanisms for optimal selection of information retrieval techniques based on a probabilistic description of their performance. The approach addresses effectively the high level of uncertainty regarding the duration of complex retrieval techniques and the quality of the result they produce. The current static approach to integration of information retrieval modules continues to produce performance gains of about 10% each year, but the systems are extremely specialized for each task, and it is not clear how well results will generalize to new types of retrieval. This project provides significant advantages because it allows a system to configure itself dynamically to the specific task at hand, to the person using the system, and to limited computational resources. This study will result in systems that are far more flexible in handling a large set of retrieval tasks with possible applications to a range of other problems such as dynamic selection of tasks for autonomous robots to optimize the quality of service. <br\/>http:\/\/anytime.cs.umass.edu\/shlomo\/research\/DCIR.html","title":"Dynamic Composition of Information Retrieval Techniques","awardID":"9907331","effectiveDate":"2000-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["553228","485994"],"PO":["563751"]},"58598":{"abstract":"","title":"NSF Young Investigator: Computational Problems in Evolutionary Tree Construction","awardID":"0096275","effectiveDate":"2000-01-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["473862"],"PO":[150516]},"52020":{"abstract":"This is an award proposed by Dr. Peter Chen, Louisiana State University. Dr. Chen requests funds for 5 to 7 U. S. Scientists to travel to Paris to participate in a workshop on the Internet, Conceptual Modeling, and Operating Systems on Nov. 17-18, 1999. The focus of the workshop is on the development of a conceptual framework for web-based Operating System software development. For example, one of the issues of interest to the workshop participants is the design methodology useful to those working in the operating systems, software engineering, and data engineering areas. The workshop has other invited participants from Europe, Asia, Brazil and other countries.","title":"Travel Support: Workshop on Internet\/Conceptual Modeling\/Operating System","awardID":"0071406","effectiveDate":"2000-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["556912"],"PO":["209879"]},"47325":{"abstract":"This award provides funding for two years of work focused on the measurement and analysis of network performance from the perspective of endpoint applications. To date, much of the high performance network measurement activity has focused on the core network and its potential. This work will help to develop understanding about the additional problems faced in marrying campus infrastructures and LAN infrastructures to a high speed backbone. Building on prior work with tools such as OCXmon, Coral, SNMP, and others, the research will utilize experiments customized to high speed applications and will incorporate the data collection, postprocessing, and eventual opportunity for network feedback to applications for purposes of adaptivity or monitoring. One additional emphasis will be to work with those engaged in developing new generations of network-based applications in order to factor in their requirements and to verify the measurement results.","title":"High Speed Network Measurements: Techniques and Tools","awardID":"9983138","effectiveDate":"2000-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["558959","172773","260968"],"PO":["182196"]},"58479":{"abstract":"","title":"CAREER: An Integrated Technology\/Circuit CAD Environment for High Performance Communication Systems","awardID":"0096150","effectiveDate":"2000-01-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["410638"],"PO":["201974"]},"47149":{"abstract":"Large-scale computational simulations of physical phenomena produce data of unprecedented size (terabytes and petabytes). Unfortunately, development of appropriate data management and visualization techniques has not kept pace with the size and complexity of such datasets. For many simulations, the storage of the data itself, not to mention seeing and understanding it, is a serious problem. This project responds to this by developing a prototype, integrated system (EVITA) to facilitate exploration of terascale datasets. This system will be concerned with the storage and representation of very large datasets, their analysis and manipulation and rendering and presentation of the resulting images. This will allow unprecedented access to our CFD data sets, which we expect to lead to new fundamental understanding.<br\/><br\/>The project focuses on time-varying datasets from computational fluid dynamic\/hydrodynamic and oceanographic applications on structured, rectilinear or curvilinear grids; however, the EVITA system is applicable as a general visualization environment for other terascale datasets with similar underlying structure. Additionally, the system is amenable to distributed- or even remote-visualization uses. The cornerstone of the EVITA system is a representational scheme that allows ranked access to macroscopic features in the dataset. The data and grid are transformed using wavelet techniques while a feature-detection algorithm is used to identify and rank contextually significant features directly. This ranking is used to generate a four-dimensional significance map that incorporates application-specific knowledge, which in turn allows an encoding with efficient compression and a progressive representation of significant features in the data. From this, the EVITA system creates as a preview an efficient, \"lossy\" image of the desired data and lets the user select regions of interest (ROls) for further enrichment. These ' Rols are given higher priority in the encoded bitstream, and subsequently displayed faster. Preliminary results demonstrate the efficacy of this approach. The project takes a novel approach to terascale visualization by capitalizing on the expertise of a multidisciplinary team to integrate research from several disciplines into the EVITA system. This both brings many perspectives to bear on the problem, and ensures that our results are practically useful.","title":"EVITA - A Prototype System for Efficient Visualization and Interrogation of Terascale Datasets","awardID":"9982344","effectiveDate":"2000-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}}],"PIcoPI":["560072","211338","267279","530355","475211"],"PO":["551992"]},"47612":{"abstract":"In step with each technological breakthrough, increasingly more of what we<br\/>learn about the world is measured indirectly. Extending and complementing<br\/>our sensory faculties, we rely on technology to probe across long distances<br\/>and through natural barriers. Astronomy, nondestructive testing, medical<br\/>imaging, and geophysical prospecting are all important examples of our<br\/>ability to make indirect measurements of a physical effect and from these<br\/>learn about the causes of such effects. At the heart of this ability are<br\/>inverse methods: practical computational techniques for processing the<br\/>measured data and distilling the information of interest from the data.<br\/>These techniques bring together tools from multidimensional signal<br\/>processing, statistics, and applied mathematics. <br\/><br\/>The purpose of this CAREER grant proposal is the development of a long term<br\/>research and educational program in multidimensional signal processing that<br\/>will integrate engineering, statistical, and numerical techniques for the<br\/>solution of inverse problems in imaging. The educational component of the<br\/>proposed program will design, from the ground level, a comprehensive<br\/>graduate and undergraduate curriculum in statistical signal and image<br\/>processing at the newly established department of Electrical Engineering at<br\/>the University of California, Santa Cruz. In addition, an introductory<br\/>undergraduate seminar course, and an in-depth graduate course on the<br\/>subject of in- verse problems in imaging will be developed. The research<br\/>component of the proposed program will address problems in image<br\/>reconstruction from indirectly measured information that may be in-<br\/>complete and noisy. These data can convey information that, depending upon<br\/>the application, may be geometric in nature (2-D silhouettes of a 3-D<br\/>object), tomographic (projections of a function), local (blurred and<br\/>downsampled images of a detailed scene), or global (moments of an object.)<br\/>Our program of research will entail the development of statistical and<br\/>numerical methods for solving problems in each of the said categories.","title":"CAREER: A Program of Research and Education for Inverse Problems in Imaging","awardID":"9984246","effectiveDate":"2000-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["450496"],"PO":["564898"]},"48317":{"abstract":"Power management as one of the major challenges in integrated circuit (IC) design that will be faced beyond 2006. This project is aimed at power management using micro-scale heat-removal devices that can be integrated with functional logic in dense, high-performance ICs. An evaluation of heat-removal microstructures such as an array of micro heat pipes is being carried out. An on-chip heat-removal architecture using micro heat pipes is being investigated, and computer-aided design tools for automatic insertion of heat spreaders are being developed. It is expected that this research will lead to a synthesis environment in which design primitives for heat removal will be integrated with functional primitives such as gates, latches, and standard cells.","title":"SGER: Investigations into Micro-Scale Heat Transfer and CAD Tools for Thermal Management in Deep-Submicron Integrated Circuits","awardID":"9986953","effectiveDate":"2000-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[123526,"561945","323778","506171"],"PO":["321058"]},"41520":{"abstract":"The most apparent architectural trends in high-performance computing in the recent years is the emergence of cluster or network of workstations (NOW) architectures, where a set of off-the-shelf high-performance desktop machines connected by a high-speed system-area interconnect can efficiently execute parallel programs and sometimes out-perform custom-built multiprocessors or multicomputers that axe orders of magnitude more expensive. The key driving force behind cluster computing is the unstoppable advances in microprocessor performance, which in turn is enabled by the economies of scale in the PC industry. We are witnessing a similar technological revolution in 3D graphics hardware arena. The performance of low-cost 3D graphics cards is improving at an astonishing rate of 80% per year within the last five years, and if continuing at this rate, is expected to out-pace high-end graphics engines such as those from Sili-con Graphics in 2003. Despite these incredible performance progresses, most of these graphics cards remain relatively inexpensive. The central research questions that this project aims to answer are whether it is feasible to build parallel 3D graphics engines that are based on the clustering architecture and 3D graphics cards and whose overall performance can scale with the number of CPUs\/graphics processors, and if so, what the enabling algorithmic and architectural techniques axe. The project will address these questions by designing, implementing, and evaluating efficient software for a cluster-based parallel 3D graphics system called Sunder, which is built on top of Linux and Mesa.","title":"Implementation Techniques Building Scalable Cluster-Based 3D Graphics Engines","awardID":"9907485","effectiveDate":"2000-01-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}}],"PIcoPI":["202714"],"PO":["551992"]},"46877":{"abstract":"BIOCOMPLEXITY: Collaborative Research: Factors affecting, and impact of,<br\/>diazotrophic microorganisms in the western Equatorial Atlantic Ocean<br\/><br\/> This biocomplexity research focuses on plankton dynamics in the western Equatorial Atlantic Ocean (WEQAT). This is a complex and understudied ecosystem that has significant impacts on marine resources<br\/>in the region as well as in downstream areas such as the Caribbean Sea. The study centers on<br\/>diazotrophic (nitrogen fixing) microorganisms as keystone species. Geological, physical, biological,<br\/>chemical and even social factors all have a major influence on population biology and activity of<br\/>diazotrophs in the WEQAT. Diazotrophs in turn have a major impact on other phytoplankton and<br\/>trophic levels through input of fixed nitrogen (N). The Amazon River affects the region<br\/>physically by changing salinity and thereby water column stratification, and geochemically by<br\/>introducing iron and silicate which can then biologically stimulate the growth of diatoms that<br\/>contain the N2 fixing endosymbiont Richelia intracellularis. Furthermore, the area receives<br\/>significant seasonal atmospheric inputs of iron in dust from the Sahel region of Africa, which can<br\/>promote the growth of the important N2 fixing cyanobacterium Trichodesmium. This<br\/>atmospheric iron source is directly deposited on the surface waters where biological activity is<br\/>greatest. For Trichodesmium, the physical environment (e.g. high wind speed) can also inhibit<br\/>activity and the formation of blooms. Diazotrophs may be affected by land use practices in the<br\/>Amazon Basin and the African Sahel, and N2 fixed by marine plankton can affect humans by<br\/>stimulating primary productivity and fishery yields.<br\/> Using both remote sensing and shipboard measurements, scientists will examine the complex processes which structure these planktonic diazotroph populations, influence their importance in CO2 and<br\/>N2 fixation, which, in turn, affect other planktonic processes. The seasonal and spatial<br\/>relationships of Trichodesmium and Hemiaulus \/ Richelia associations will be examined with<br\/>direct reference to the major routes of inputs of Fe and Si, and with regard to the physical<br\/>environment. The group of collaborating scientists will examine the trophic structures associated with each diazotrophic community, including the vertical distribution of processes and associated autotrophic and<br\/>heterotrophic plankton populations. These data will be used to develop and verify<br\/>biogeochemical and trophodynamic models that incorporate the complex physical, chemical and<br\/>biological interactions that characterize the WEQAT region. The models will, in turn, be used to<br\/>examine the hypothesis that physical forcing, through its effect on the diazotrophic populations<br\/>and the structure of the food web, influences N2 fixation and, in part, determines the high<br\/>productivity of the WEQAT.<br\/> The work uses a combination of both observations and models to address three<br\/>fundamental issues in biocomplexity: 1) the relationship between ecosystem structure and<br\/>function in a system that is both nonlinear and high-dimensional; 2) the response of a nonlinear<br\/>ecosystem to environmental forcing; and 3) the relevant level of detail, including the resolution<br\/>of physical space, that must be incorporated in nonlinear systems to capture the dynamics of a<br\/>global ecosystem property (here, high productivity). The research will significantly advance our understanding of the interaction between physical and biogeochemical processes in an important area the world's oceans, and identify how these interactions regulate variability in marine ecosystem productivity.","title":"BIOCOMPLEXITY: Collaborative Research: Factors Affecting, and Impact of, Diazotrophic Microorganisms in the Western Equatorial Atlantic Ocean","awardID":"9981218","effectiveDate":"2000-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5418","name":"OCE SPECIAL PROGRAMS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["421964","120016","421965"],"PO":["354885"]},"46900":{"abstract":"BIOCOMPLEXITY: Collaborative Research: Factors affecting, and impact of,<br\/>diazotrophic microorganisms in the western Equatorial Atlantic Ocean<br\/><br\/> This biocomplexity research focuses on plankton dynamics in the western Equatorial Atlantic Ocean (WEQAT). This is a complex and understudied ecosystem that has significant impacts on marine resources<br\/>in the region as well as in downstream areas such as the Caribbean Sea. The study centers on<br\/>diazotrophic (nitrogen fixing) microorganisms as keystone species. Geological, physical, biological,<br\/>chemical and even social factors all have a major influence on population biology and activity of<br\/>diazotrophs in the WEQAT. Diazotrophs in turn have a major impact on other phytoplankton and<br\/>trophic levels through input of fixed nitrogen (N). The Amazon River affects the region<br\/>physically by changing salinity and thereby water column stratification, and geochemically by<br\/>introducing iron and silicate which can then biologically stimulate the growth of diatoms that<br\/>contain the N2 fixing endosymbiont Richelia intracellularis. Furthermore, the area receives<br\/>significant seasonal atmospheric inputs of iron in dust from the Sahel region of Africa, which can<br\/>promote the growth of the important N2 fixing cyanobacterium Trichodesmium. This<br\/>atmospheric iron source is directly deposited on the surface waters where biological activity is<br\/>greatest. For Trichodesmium, the physical environment (e.g. high wind speed) can also inhibit<br\/>activity and the formation of blooms. Diazotrophs may be affected by land use practices in the<br\/>Amazon Basin and the African Sahel, and N2 fixed by marine plankton can affect humans by<br\/>stimulating primary productivity and fishery yields.<br\/> Using both remote sensing and shipboard measurements, scientists will examine the complex processes which structure these planktonic diazotroph populations, influence their importance in CO2 and<br\/>N2 fixation, which, in turn, affect other planktonic processes. The seasonal and spatial<br\/>relationships of Trichodesmium and Hemiaulus \/ Richelia associations will be examined with<br\/>direct reference to the major routes of inputs of Fe and Si, and with regard to the physical<br\/>environment. The group of collaborating scientists will examine the trophic structures associated with each diazotrophic community, including the vertical distribution of processes and associated autotrophic and<br\/>heterotrophic plankton populations. These data will be used to develop and verify<br\/>biogeochemical and trophodynamic models that incorporate the complex physical, chemical and<br\/>biological interactions that characterize the WEQAT region. The models will, in turn, be used to<br\/>examine the hypothesis that physical forcing, through its effect on the diazotrophic populations<br\/>and the structure of the food web, influences N2 fixation and, in part, determines the high<br\/>productivity of the WEQAT.<br\/> The work uses a combination of both observations and models to address three<br\/>fundamental issues in biocomplexity: 1) the relationship between ecosystem structure and<br\/>function in a system that is both nonlinear and high-dimensional; 2) the response of a nonlinear<br\/>ecosystem to environmental forcing; and 3) the relevant level of detail, including the resolution<br\/>of physical space, that must be incorporated in nonlinear systems to capture the dynamics of a<br\/>global ecosystem property (here, high productivity). The research will significantly advance our understanding of the interaction between physical and biogeochemical processes in an important area the world's oceans, and identify how these interactions regulate variability in marine ecosystem productivity.","title":"BIOCOMPLEXITY: Collaborative Research: Factors Affecting, and Impact of, Diazotrophic Microorganisms in the Western Equatorial Atlantic Ocean","awardID":"9981371","effectiveDate":"2000-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1366","name":"BIOCOMPLEXITY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5418","name":"OCE SPECIAL PROGRAMS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"7304","name":"ERE General"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["555869","559377"],"PO":["354885"]},"46911":{"abstract":"BIOCOMPLEXITY: OCEANIC N2 FIXATION AND GLOBAL CLIMATE<br\/><br\/> Oceanic nitrogen (N2) fixation has recently been identified as a significant part of the<br\/>oceanic nitrogen (N) cycle and may directly influence the sequestration of atmospheric CO2 in<br\/>the oceans by providing a new source of N to the upper water column. The prokaryotic<br\/>microorganisms that convert N2 gas to reactive N are an unique subcomponent of planktonic<br\/>ecosystems and exhibit a variety of complex dynamics including the formation of microbial<br\/>consortia and symbioses and, at times, massive blooms. Accumulating evidence indicates that<br\/>iron (Fe) availability may be a key controlling factor for these planktonic marine diazotrophs.<br\/>The primary pathway of Fe delivery to the upper oceans is through dust deposition.<br\/>N2 fixers may therefore be directly involved in global feedbacks with the climate system<br\/>and these feedbacks may also exhibit complex dynamics on many different time-scales. <br\/> The hypothesized feedback mechanisms will have the following component parts: The rate of N2<br\/>fixation in the world's oceans can have an impact on the concentration of the greenhouse gas,<br\/>carbon dioxide (CO2), in the atmosphere on time-scales of decades (variability in surface<br\/>biogeochemistry) to millennia (changes in the total NO3 - stock from the balance of N2 fixation<br\/>and denitrification). CO2 concentrations in the atmosphere influence the climate. The climate<br\/>system, in turn, can influence the rate of N2 fixation in the oceans by controlling the supply of Fe<br\/>on dust and by influencing the stratification of the upper ocean. Humans also have a direct role<br\/>in the current manifestation of this feedback cycle by their influence on dust production, through<br\/>agriculture at the margins of deserts, and by our own production of CO2 into the atmosphere.<br\/>The circular nature of these influences can lead to a feedback system, particularly on longer time-scales.<br\/> This collaborative and interdisciplinary group of investigators, led by Dr. Anthony Michaels, will study each of the components of this system and then to model the hypothesized feedback processes. Because of the interaction of the various parts of this system, keyed around the unique behavior and biogeochemistry of the prokaryotic microorganisms that can fix N2, this feedback loop should exhibit complex behaviors on a variety of time-scales. In this research, we will conduct a targeted series of experiments and field observations to understand and parameterize each of the pieces of this global process including the direct control of marine N2 fixation by dust deposition. This understanding will then feed a modeling process that examines the complex dynamics of this system on time-scales of years to millennia. The modeling process will be evaluated by comparison with data on the time-dependent behavior of<br\/>ocean biogeochemistry","title":"Collaborative Research: Oceanic N2 Fixation and Global Climate","awardID":"9981398","effectiveDate":"2000-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1366","name":"BIOCOMPLEXITY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}}],"PIcoPI":["523953","477247"],"PO":["354885"]},"58505":{"abstract":"","title":"Noise Management for Systems-on-a-Chip","awardID":"0096176","effectiveDate":"2000-01-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}}],"PIcoPI":["531255","410638"],"PO":["562984"]},"43986":{"abstract":"This Small Business Innovation Research Phase I project from Dynamic Domain will enable computer users to create wrappers so that web sites can be queried as if they were databases. The key innovation of this proposal is a method for semi-automatically generating wrappers from examples. The approach combines supervised and unsupervised learning methods to minimize the amount of information required from users to generate wrappers. As a result, unsophisticated users can rapidly create their own wrappers. The research has the potential to make it vastly easier to access and integrate data to create large scale, virtual databases because it makes it possible for information users to create virtual databases, rather than relying on information providers to carry out this task.<br\/><br\/>Dynamic Domain proffers technology with the potential to transform the economics of information integration by giving ordinary users the power to integrate and query information sources. While existing, commercially viable applications of this technology include tools for developing shopping agents and specialized search engines, new possibilities abound for Internet automations. For example, consider a manufacturer who wants to integrate his production schedules with his business partners in a very fluid market where his partners frequently change. Rather than requiring his partners to employ the same enterprise resource planning software that he uses or asking them to develop specialized interfaces, he can easily import data they make available via the web in whatever format they choose.","title":"SBIR Phase I: Semi-Automatically Constructing Wrappers to Access Internet-Based Information Sources","awardID":"9960536","effectiveDate":"2000-01-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"5371","name":"SMALL BUSINESS PHASE I"}}],"PIcoPI":["553754"],"PO":["565053"]},"47957":{"abstract":"9985802<br\/><br\/>A typical geometric model for Computer-Aided Design (CAD) is represented as a finite collection of compact 2-manifolds, joinedalong boundaries formed by their intersection sets. Hence, these representations critically depend upon intersection algorithms. To minimize data volume and improve algorithmic performance, the intersection sets are only approximated. The consequences of these approximation errors may be far from trivial and can lead to `gaps' or `cracks' between surfaces that are understood to be adjoining. Unfortunately, the prevalent practice is that intersection algorithms do not give any error bounds on these approximations. This research focuses upon the central issue of the interdependencies between topology of a model and the approximations within numerical algorithms. Any formal notion of topology for computational representations of geometric sets must specifically acknowledge the role of approximation and finite arithmetic. This project will develop formal definitions and computational representations for needed approximation bounds. Computational experiments will be performed to test the communication of the critical approximation information across programmatic interfaces. The expected result is a formal framework for reasoning about the propagation of topological tolerances within large software systems.<br\/><br\/>Three recent workshops (OPAAL '97 in New Orleans, CAD\/CFD '99 at Davis, and MSRI '99 at Berkeley) have directed attention to the need for rigorous mathematical foundations for computer-aided design. Particularly troublesome are regions where surfaces should meet, as computational models are limited to only approximating such surface joinings. A computational model of a coffee cup will necessarily have small cracks along its base and near its handle. If fluid were to be placed in this cup in a computer simulation, the fluid would leak out of the cup. Of course, similar cracks will exist in a computational model of an airplane; for example, where the wing joins the fuselage. The performance characteristics of this joint during flight are crucial to aircraft safety. Fluid dynamic simulations are performed on airplane models to verify critical engineering performance characteristics. Even small errors in the geometric model can cause large errors in these engineering simulations. These simulations hold the promise of significant cost savings by permitting creation of a reliable airplane directly from the electronic model. However, to attain that goal, the interface between modeling and simulation must accept the inevitability of modeling `cracks' and still produce valid engineering analyses. This project will create new mathematical formulations and computational representations as a necessary step for reliable engineering simulations. Recent economic studies done for NIST indicate that these engineering problems cost about 1 billion dollars annually, for the automotive industry alone. Hence, there is opportunity for significant practical economic impact from this new theory, as it will improve results from complex engineering simulations which must be executed within high-performance computing environments. Utilization of these high performance computing resources will be improved and the more reliable engineering estimates will also lead to direct savings in material and manufacturing costs for major industries.","title":"Integrating Topology and Numerics at CAD Interfaces","awardID":"9985802","effectiveDate":"2000-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1265","name":"GEOMETRIC ANALYSIS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}}],"PIcoPI":["482465"],"PO":["209733"]},"58518":{"abstract":"","title":"Soft-Decision Decoding of Codes","awardID":"0096191","effectiveDate":"2000-01-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["450215","328464"],"PO":["188393"]},"46429":{"abstract":"9979435<br\/>Stasheff<br\/>This Americas Program award will support travel and related expenses for US scientists and students to participate in an international workshop on quantum symmetries in theoretical physics and mathematics to be held in San Carlos de Bariloche, Argentina, on January 10-22, 2000. Organizers are Dr. James D. Stasheff, University of North Carolina at Chapel Hill, Dr. Roberto Trinchero, Centro Atomico Bariloche, Argentina, and Dr. Robert Coquereaux of Centre de Physique Theorique, Marseille, France. The workshop is designed to introduce participants to aspects of the theory of quantum groups (Hopf algebras) and their applications in theoretical physics and mathematics. This workshop is jointly supported by the Division of International Programs in the Directorate for Social, Behavioral and Economic Sciences together with the Division of Physics, the Division of Mathematical Sciences, and the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences.<br\/><br\/>Symmetries in theoretical physics have long been important and have provided one of the major techniques for investigating the quantum realm. Besides stimulating interactions between scientists, and strengthening international scientific collaboration, this workshop will enable US and Latin American scientists and students to become aware of the newer developments in this area of research and will help maintain cross-fertilization between the fields of mathematics and physics. In addition to the US and Latin American participants, the workshop will also bring together leading scientists in the field from Europe.<br\/>***","title":"U.S.-Argentina Workshop on Quantum Symmetries; San Carlos de Bariloche, Argentina, January 10-22, 2000","awardID":"9979435","effectiveDate":"2000-01-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1287","name":"MATHEMATICAL PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1281","name":"ANALYSIS PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["182478"],"PO":["493911"]},"45825":{"abstract":"9976550<br\/>Martin<br\/>This Focused Research Group award supports research and education in computational materials theory and associated algorithm development. It assists in establishing a Materials Computation Center at the University of Illinois at Urbana-Champaign for interdisciplinary materials research. The award is jointly funded by the Divisions of Materials Research, Chemistry, Physics, Mathematical Sciences and the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences, and by the Division of Advanced Computational Infrastructure and Research in the Directorate for Computer and Information Science and Engineering. The Center will provide a stimulating environment for state-of-the-art computational materials research and for development of new algorithms and computational approaches. The intellectual thrust of the research will be organized around broad research themes that will be coupled to experiment. The PIs will develop and maintain well-structured modular codes, educate students in the most modern computational materials science techniques, and apply computational methods to important materials problems. Algorithmic developments will span the range from programs for teaching to forefront programs for research. Included are programs for molecular dynamics and Monte Carlo simulations, density functional theory calculations, and linear-scaling algorithms for large complex systems. The PIs aim to work toward defining common analysis tools, input\/output data structures, and well-defined interfaces between programs written by different people. This helps enable compatibility and coupling in multi-scale applications, as well as heterogeneous computing via portable browser-type interfaces. The PIs intend to benchmark results on test problems and compare results with experiments. The Center will have a core group of faculty from different disciplines committed to a program of collaborative research with shared postdoctoral associates and students. The Center will provide educational training and thesis research themes that address national needs for computational scientists with experience in applications to real problems and materials research. In conjunction with the Computational Science and Engineering program at UIUC, students will acquire comprehensive computer science experience as well as basic science and engineering training, and they will gain valuable experience working in teams across disciplines. <br\/><br\/>This award supports research and education in computational materials theory and associated algorithm development. It assists in establishing a Materials Computation Center at the University of Illinois at Urbana-Champaign for interdisciplinary materials research. The award is jointly funded by the Divisions of Materials Research, Chemistry, Physics, Mathematical Sciences and the Office of Multidisciplinary Activities in the Directorate for Mathematical and Physical Sciences, and by the Division of Advanced Computational Infrastructure and Research in the Directorate for Computer and Information Science and Engineering. The Center will provide a stimulating environment for state-of-the-art computational materials research and for development of new algorithms and computational approaches. The intellectual thrust of the research will be organized around broad research themes that will be coupled to experiment. The PIs will develop and maintain well-structured modular codes, educate students in the most modern computational materials science techniques, and apply computational methods to important materials problems. Algorithmic developments will span the range from programs for teaching to forefront programs for research. Included are programs for molecular dynamics and Monte Carlo simulations, density functional theory calculations, and linear-scaling algorithms for large complex systems. The PIs aim to work toward defining common analysis tools, input\/output data structures, and well-defined interfaces between programs written by different people. This helps enable compatibility and coupling in multi-scale applications, as well as heterogeneous computing via portable browser-type interfaces. The PIs intend to benchmark results on test problems and compare results with experiments. The Center will have a core group of faculty from different disciplines committed to a program of collaborative research with shared postdoctoral associates and students. The Center will provide educational training and thesis research themes that address national needs for computational scientists with experience in applications to real problems and materials research. In conjunction with the Computational Science and Engineering program at UIUC, students will acquire comprehensive computer science experience as well as basic science and engineering training, and they will gain valuable experience working in teams across disciplines.","title":"FRG: Materials Computation Center","awardID":"9976550","effectiveDate":"2000-01-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1284","name":"ATOMIC THEORY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1285","name":"NUCLEAR THEORY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1954","name":"QUANTUM CALCULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["559843","365820"],"PO":["145396"]},"46947":{"abstract":"Oceanic nitrogen (N2) fixation has recently been identified as a significant part of the<br\/>oceanic nitrogen (N) cycle and may directly influence the sequestration of atmospheric CO2 in<br\/>the oceans by providing a new source of N to the upper water column. The prokaryotic<br\/>microorganisms that convert N2 gas to reactive N are an unique subcomponent of planktonic<br\/>ecosystems and exhibit a variety of complex dynamics including the formation of microbial<br\/>consortia and symbioses and, at times, massive blooms. Accumulating evidence indicates that<br\/>iron (Fe) availability may be a key controlling factor for these planktonic marine diazotrophs.<br\/>The primary pathway of Fe delivery to the upper oceans is through dust deposition.<br\/>N2 fixers may therefore be directly involved in global feedbacks with the climate system<br\/>and these feedbacks may also exhibit complex dynamics on many different time-scales. <br\/><br\/>The hypothesized feedback mechanisms will have the following component parts: The rate of N2<br\/>fixation in the world's oceans can have an impact on the concentration of the greenhouse gas,<br\/>carbon dioxide (CO2), in the atmosphere on time-scales of decades (variability in surface<br\/>biogeochemistry) to millennia (changes in the total NO3 - stock from the balance of N2 fixation<br\/>and denitrification). CO2 concentrations in the atmosphere influence the climate. The climate<br\/>system, in turn, can influence the rate of N2 fixation in the oceans by controlling the supply of Fe<br\/>on dust and by influencing the stratification of the upper ocean. Humans also have a direct role<br\/>in the current manifestation of this feedback cycle by their influence on dust production, through<br\/>agriculture at the margins of deserts, and by our own production of CO2 into the atmosphere.<br\/>The circular nature of these influences can lead to a feedback system, particularly on longer time-scales.<br\/><br\/>This collaborative and interdisciplinary group of investigators, led by Dr. Anthony Michaels, will study each of the components of this system and then to model the hypothesized feedback processes. Because of the interaction of the various parts of this system, keyed around the unique behavior and biogeochemistry of the prokaryotic microorganisms that can fix N2, this feedback loop should exhibit complex behaviors on a variety of time-scales. In this research, we will conduct a targeted series of experiments and field observations to understand and parameterize each of the pieces of this global process including the direct control of marine N2 fixation by dust deposition. This understanding will then feed a modeling process that examines the complex dynamics of this system on time-scales of years to millennia. The modeling process will be evaluated by comparison with data on the time-dependent behavior of ocean biogeochemistry","title":"Biocomplexity: Collaborative Research: Oceanic N2 Fixation and Global Climate","awardID":"9981545","effectiveDate":"2000-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1366","name":"BIOCOMPLEXITY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"7304","name":"ERE General"}}],"PIcoPI":["559377","360958",120179,"471476"],"PO":["354885"]},"42405":{"abstract":"This award provides partial support, over an eighteen-month period, for a study project to examine ways in which new technological approaches may help reduce policy-related conflicts associated with the Internet Domain Name System. Focus areas will include identifying different technical options for providing services associated with the domain name management system, and identifying policies and procedures to complement each of the technical alternatives. A report will be generated summarizing the findings and recommendations and will be made broadly available to the community.","title":"Internet Addressing and the Domain Name Systems: Technical Alternatives and Policy Implications","awardID":"9909852","effectiveDate":"2000-01-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"X628","name":"COMMERCE-TRADEMARK RIGHTS"}}],"PIcoPI":["298189","234699","235705"],"PO":["565090"]},"47829":{"abstract":"Efficient transmission of visual data over wireless networks is at the heart of many evolving communications applications, ranging from wireless offices to emergency management, telemedicine, and integration of services in smart handheld devices. These applications require unprecedented levels of end-to-end performance on hostile channels, e.g. wireless LAN and ad-hoc wireless networks, and put severe demands on the performance of compression and error control coding.<br\/><br\/>This research is developing advanced coding and signal processing algorithmsfor the transmission of images and video over wireless networks. Theinvestigator is studying two dominant approaches to joint source-channelcoding, namely, with algebraic codes and with multiple-description codes,in order to capture the efficiency of the former and the robustness of thelatter with an integrated approach. Concurrent work in receiver-sidesignal processing is producing algorithms that will enhance the performance underexisting systems and standards.","title":"CAREER: Processing of Images and Video for Emerging Communication Media","awardID":"9985171","effectiveDate":"2000-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["518585"],"PO":["564898"]}}