{"174359":{"abstract":"The essence of engineering design is rapid, effective, and creative change towards optimal solutions, which can be accomplished through the iterative modification of numerous design parameters spanning across multi-dimensions. To ameliorate the entire computer-aided engineering processes and enhance engineers' creativity through IT-supported tools, the long-term ambitious goal of this small-scale, CreativeIT project is to develop a creativity-enhancing virtual prototype environment that can greatly facilitate human-computer interaction through physics-based modeling of real-world objects and force-enabled haptic sculpting. The PI's strategy aims to develop a haptics-enabled platform for solid modeling, design, analysis, and relevant applications, which includes a suite of new, volumetric models for representing multi-dimensional datasets as well as haptics-based physical interactions for manipulating and managing such representations.<br\/><br\/>Intellectual Merits: The PI plans to take a unique and integrated approach that aims to incorporate within a single IT system disparate research thrusts that span volumetric, physical, and material modeling for novel data representation; geometric and physics-based algorithms for interaction and analysis; and software tools for various applications. Through a suite of theory-driven research activities, the Broader Impact of this initiative in the long run will be both fundamental and profound to the enhancement of IT tools in a wider spectrum of real applications as well as the broadening of computer accessibility by human beings via haptic interaction. This initiative promises to deliver a new approach for representing, manipulating, and interacting with volumetric datasets in common use in such downstream applications as digital engineering, virtual sculpting for synthesis\/analysis, surgical training, and many more.","title":"EAGER: Exploring Volumetric Modeling and Design Theory for Virtual Environments","awardID":"1049448","effectiveDate":"2010-11-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7953","name":"SOCIAL-COMPUTATIONAL SYSTEMS"}}],"PIcoPI":["416071"],"PO":["565227"]},"169105":{"abstract":"In the new era of distributed online spaces it is no longer sufficient to look at human behavior just on local servers and storage sites. From exploring on-line videos to searching vast information spaces with keyword search interfaces, the information scope and societal impact have changed. HCI researchers therefore need new strategies to study, respond, and adapt to changing circumstances as the context for research changes. Quantitative methods such as social network analysis (SNA) and surveys are appropriate techniques for addressing some research questions in some types of online social spaces, but they have limitations. For some studies, qualitative methods, specifically applied ethnography, may offer the only way to deeply understand users' behavior, intentions and feelings within the social-digital ecology of the Web. <br\/><br\/>The goal of this research is to examine the issues that researchers encounter when attempting to understand diverse types of behavior in large online spaces using ethnographic approaches. To accomplish we will conduct a two-stage study. Stage 1 will produce a meta-analysis of current research literature on YouTube, Facebook, Twitter, Wikipedia and other large-scale social systems, and on keyword search interfaces, to identify the methods that were used by researchers, under what assumptions, and which outcomes these studies reported. Stage 2 will produce a grounded theory analysis of case studies of how a sample of HCI researchers do qualitative research, particularly ethnography, in these vast and changing information spaces.","title":"EAGER: Extreme Ethnography: When Content and Tools Change Continually on Vast Scales, How Must Our Research Methods Change","awardID":"1019993","effectiveDate":"2010-11-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["527291",452577,"518152"],"PO":["564456"]},"172816":{"abstract":"This is funding to support participation by about 10 graduate students in a Doctoral Consortium (workshop) to be held in conjunction with the 12th International Conference on Multimodal Interfaces and 7th Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI 2010), which will be held November 8-12, in Beijing, China, and which is organized by the Association for Computing Machinery (ACM) with co-sponsorship from the Institute of Electrical and Electronics Engineers (IEEE). The conference will bring together researchers from North America, Europe, and Asia to present and discuss the latest multidisciplinary work on multimodal interfaces, systems, and applications. Now in its second year, the combined ICMI-MLMI is the foremost international event representing the growing interest in next-generation perceptive, adaptive and multimodal user interfaces. Such interfaces represent an emerging interdisciplinary research direction, involving spoken and natural language understanding, image processing, computer vision, pattern recognition, experimental psychology, etc. They aim to promote efficient and natural interaction and communication between computers and human users, and represent a radical departure from previous computing that should ultimately enable users to interact with computers using everyday skills. The main goals of ICMI-MLMI 20010 are to further scientific research within the broad field of multimodal interaction and systems, to focus on major trends and challenges, and to help identify a roadmap for future research and commercial success. Topics of interest this year include: multimodal and multimedia processing; multimodal input and output interfaces; multimodal applications; human interaction analysis and modeling; and multimodal data, evaluation, and standards. The three days of invited talks, panels, and single-track oral and poster presentations will facilitate interaction and discussion among researchers; the conference promises to be an international venue for brainstorming and coming up with creative directions for future research in multimodal interfaces. Participants in the Doctoral Consortium will get to showcase their ongoing thesis work, either orally or in a special \"doctoral spotlight\" poster session during which they will receive feedback from an invited committee composed of senior personnel, and including the Advisory Committee chair and the General and Program chairs. As a further incentive for high-quality student participation, ICMI-MLMI will be awarding outstanding paper awards, with a special category just for student papers. More information about ICMI-MLMI is available online at http:\/\/www.acm.org\/icmi\/2010.<br\/><br\/>Broader Impacts: The Doctoral Consortium will give student participants exposure to their new research community, both by presenting their own work and by observing and interacting with established professionals in the field. It will encourage students at this critical time in their careers to begin building a social support network of peers and mentors. With the goal of increasing the breadth of participation at ICMIMLMI, selection of grantees will be done by the PI with oversight from the Advisory Committee Chair and the Conference General Chair; the organizers will make special efforts to encourage participation by a significant number of student researchers from less-well funded institutions, as well as by minority students, female students, and students from geographically under-represented states. Students funded under this award will all be enrolled at U.S. institutions of higher education.","title":"Support for Student Participation in the Conference International Conference on Multimodal-Machine Learning for Multimodal Interaction (ICMI-MLMI) 2010","awardID":"1041411","effectiveDate":"2010-11-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["486574"],"PO":["565227"]},"173964":{"abstract":"The long-term goal of this research aims to systematically trailblaze a novel geometric manifold theory founded upon continuous polynomial representations, and to apply this mathematically-rigorous theory to both shape geometry and higher-dimensional, multi-attribute data modeling, analysis and visualization, with a special emphasis on visual computing applications. The research team is exploring new geometric manifold theory at the interface of differential geometry, numerical approximation theory, computational topology, and linear algebra. The study of new and important geometric manifold theory enables the accurate and effective modeling of higher-dimensional, multi-attribute volumetric datasets which are of complicated geometry, arbitrary topology, and with rich geometric features. This theory-centered research provides a sound theoretical foundation for rapid data modeling and data analysis. It has a potential to streamline the entire virtual prototyping processes for digital engineering in the future with longer-term research efforts by expediting data transformation from discrete samples to continuous manifold and spline-centric visual data representations.","title":"EAGER: Bridging Geometric Manifold Theory and Higher-Dimensional Data Modeling for Visual Computing","awardID":"1047715","effectiveDate":"2010-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["416071"],"PO":["564316"]},"168411":{"abstract":"This collaborative research brings together computer scientists from University of Southern Mississippi (USM) and Brown University and neuroscientists from the University of Mississippi Medical Center (UMMC) to study the design of a scientific visualization language (SVL). Despite the numerous visualization approaches already devised, visualization remains more of an art than a science. Grounded in theories and methods from human-centered computing, machine learning, and cognitive psychology, this work is to develop and evaluate a scientific visualization language (SVL) to provide a principled way to help scientists understand how and why visualizations work. Tools and theories developed in this project can lead to efficient knowledge discovery to help neuroscientists study brains using diffusion tensor magnetic resonance imaging (DTI).<br\/><br\/>This work has the following specific objectives and outcomes: (1) close collaboration with scientists to discover, refine, and verify a symbol space, (2) a semantic space that describes the relationship among symbols, (3) a testbed that implements SVL for neuroscientists to compose visualizations, (4) development of new and enhanced courses at University of Southern Mississippi and Brown University, and (5) wide dissemination of the research outcomes through open-source software, experimental data, open labs, publications, and presentations.<br\/><br\/>This project is expected to have broad impact. It may lead to significantly better approaches to human knowledge discovery and decision making in many disciplines where visualizations have found successful application, including neuroscience, biomedicine, bioinformatics, biology, chemistry, geosciences, business, economics, and education. Undergraduate and graduate students are expected to participate in the research through our courses, and student exchanges are planned between USM and Brown. K-12 students can visit the USM lab while the project is in progress. Software and results will be disseminated via the project Web site (https:\/\/sites.google.com\/site\/simplevisualizationlanguage).","title":"GV: Small: Collaborative Research: Supporting Knowledge Discovery through a Scientific Visualization Language","awardID":"1016623","effectiveDate":"2010-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["550484"],"PO":["563751"]},"168677":{"abstract":"This collaborative research brings together computer scientists from University of Southern Mississippi (USM) and Brown University and neuroscientists from the University of Mississippi Medical Center (UMMC) to study the design of a scientific visualization language (SVL). Despite the numerous visualization approaches already devised, visualization remains more of an art than a science. Grounded in theories and methods from human-centered computing, machine learning, and cognitive psychology, this work is to develop and evaluate a scientific visualization language (SVL) to provide a principled way to help scientists understand how and why visualizations work. Tools and theories developed in this project can lead to efficient knowledge discovery to help neuroscientists study brains using diffusion tensor magnetic resonance imaging (DTI).<br\/><br\/>This work has the following specific objectives and outcomes: (1) close collaboration with scientists to discover, refine, and verify a symbol space, (2) a semantic space that describes the relationship among symbols, (3) a testbed that implements SVL for neuroscientists to compose visualizations, (4) development of new and enhanced courses at University of Southern Mississippi and Brown University, and (5) wide dissemination of the research outcomes through open-source software, experimental data, open labs, publications, and presentations.<br\/><br\/>This project is expected to have broad impact. It may lead to significantly better approaches to human knowledge discovery and decision making in many disciplines where visualizations have found successful application, including neuroscience, biomedicine, bioinformatics, biology, chemistry, geosciences, business, economics, and education. Undergraduate and graduate students are expected to participate in the research through our courses, and student exchanges are planned between USM and Brown. K-12 students can visit the USM lab while the project is in progress. Software and results will be disseminated via the project Web site (https:\/\/sites.google.com\/site\/simplevisualizationlanguage).","title":"GV: Small: Collaborative Research: Supporting Knowledge Discovery Through a Scientific Visualization Language","awardID":"1017921","effectiveDate":"2010-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[451484,451485],"PO":["563751"]},"173112":{"abstract":"Since software is easier to configure, modify and re-use than hardware, an increasingly large portion of a medical device?s functionality is now being implemented in code. This presents considerable engineering challenges for both device regulators and manufacturers in terms of ensuring the safety and effectiveness of the deployed software. This NSF-FDA Scholar in Residence project focuses on the use of generic software architecture specifications for medical devices as a path to reducing the complexity of engineering medical device software. For manufacturers, generic device specifications can serve as a base artifact from which concrete implementations may be constructed. For regulators, they represent an artifact that can be modeled and used in evaluating implementations for adherence to a base set of safety requirements. The primary goals of this project are to explore a generic infusion pump architecture that can be extended to different infusion pump classes while preserving the requisite safety properties in a trustable, verifiable manner. The project explores challenges for developing usable generic device software architecture specifications and for applying them: producing concrete device instances, constructing extended subclasses from the generic architecture while verifying that properties are preserved, and supporting regulators and manufacturers as they evaluate device software conformance to safety architectures. The research employs model-checking, assertion-based verification, static analysis and reverse engineering to support assurance of safety-critical devices such as the Patient-Controlled Analgesia (PCA) infusion pump. The aim of the research is to provide an informative pilot study towards adoption of such techniques in device manufacturing workflows and regulatory regimes. One of the driving goals of this project is to create techniques and approaches that will benefit patients (by increasing device safety), device manufacturers (by helping them cut development costs) and regulators (by enabling them to automate and formalize their regulatory activities).","title":"Assurance Cases for a Physiologically Closed-Loop PCA Systems","awardID":"1042829","effectiveDate":"2010-11-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553656","553657"],"PO":["565255"]},"173623":{"abstract":"This travel award supports student participation in the 6th International Conference on emerging Networking EXperiments and Technologies (CoNEXT) will be held in Philadelphia, PA, USA, between November 30 and December 3, 2010.<br\/><br\/>CoNEXT 2010 and the associated workshops, includes a student workshop, a workshop on ?Re-architecting the Internet?, and a workshop on ?Programmable Routers for Extensible Services of Tomorrow?. This rich program will expose students to new ideas, and allow them to interact with other researchers. In particular, the student workshop is geared to provide students an opportunity to present their work in progress, receive feedback on their work, and obtain valuable experience in writing and presenting technical papers.<br\/><br\/>Approximately 10 US-based graduate students are provided the opportunity to attend CoNext. The travel awards will target graduate students, in particular female and under-represented minority students, since they often have limited travel funds to attend workshops; attendance at such events is an important part of their educational experience.","title":"A Proposal to Support Student Travel for the ACM CoNEXT 2010","awardID":"1045384","effectiveDate":"2010-11-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["555021"],"PO":["564993"]}}