{"24081":{"abstract":"9720359 Kurt Van Lehn University of Pittsburgh CIRCLE: Center for Interdisciplinary Research on Constructive Learning Environments The Center has three main goals. First, the Center seeks to understand an extremely effective pedagogy, human tutoring. This will be achieved by using protocol analysis, eye tracking and controlled experiments to study human tutors and contrast them to existing computer tutors. The overarching hypothesis is that students learn best when they construct knowledge for themselves. The second goal of the Center is to build and test new generation of computer tutoring systems that encourage students to construct the target knowledge instead of telling it to them. The student's self-construction may need to be delicately guided via prompting, Socratic questioning or other means, This goal will be achieved by adding advanced planning and natural language components to existing intelligent tutoring systems and testing the new tutors in collaborating schools. The Center's third goal is to help integrate this new technology into existing educational practices. This goal will be achieved by working with practitioners and schools throughout the development process, by upgrading tutors that are already in use by thousands of students, and by forming partnerships with other projects, centers and industries. Achieving the three Center goals will impact multiple disciplines. Understanding why human tutors are so effective should have a significant impact on the psychology of learning. Computer science will be advanced by developing systems that can reactively plan natural language hints and questions that get a student to learn. Education will be improved as the Center's constructivist technology and instructional methods prove to be effective in actual use and become widely available.","title":"Learning and Intelligent Systems: CIRCLE: Center for Interdisciplinary Research on Constructive Learning Environments","awardID":"9720359","effectiveDate":"1997-10-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7263","name":"NETWORKING INFRASTRUCT-EDUCAT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["531008","423487","488662","406755","498182"],"PO":["564318"]},"24082":{"abstract":"9720363 Stillings This project is being funded through the Learning and Intelligent Systems (LIS) Initiative. to study tutorial interaction and learning outcomes in a feasible model of college-level inquiry-oriented instruction, as it is implemented in the Hampshire College science curriculum. This research will occur during the first two years. It will be conducted by Neil Stillings, Lawrence Winship, and a post-doctoral fellow in cognition and education, with the assistance of undergraduate research assistants and an outside educational research consultant. We will extend current intelligent multimedia tutoring technology to support college-level inquiry-oriented instruction. This research will involve the development of new software architectures to support inquiry in simulation environments and in integrated, computer-controlled laboratory environments. It will be conducted by Lee Spector, Beverly Woolf, Steven Weisler, and a post-doctoral fellow in computer science, with some additional involvement from Neil Stillings and Lawrence Winship. We will demonstrate our extensions of educational software technology by developing three college-level inquiry-oriented software packages in the biological and cognitive sciences. Our plan is to produce one application in the language sciences, one in the environmental sciences, and one in human biology. These applications will be classroom-ready and suitable for use outside the research context. The primary developers will be Lee Spector, Steven Weisler, a post-doctoral fellow in computer science, a professional programmer, and graduate assistants in computer science. They will work with faculty members in the appropriate disciplines. The original plan was to develop six applications rather than three. The budget has been reduced accordingly. At least two of the software applications will be tested at Hampshire, and at least one of them will be revised to reflect the testing results. The classroom testing involves an important feature of the proposed software architectures, which will have built-in educational and psychological measurement capabilities. The primary researchers for the software testing phase of the project are Neil Stillings, Beverly Woolf, the post- doctoral fellow in cognition and education, and an outside educational consultant. The original proposal also involved the introduction and testing of software at the University of Massachusetts. That aspect of the proposal has been dropped and the budget reduced accordingly.","title":"Learning and Intelligent Systems:Inquiry-Based Science Education: Cognitive Measures and Systems Support","awardID":"9720363","effectiveDate":"1997-10-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["314892","552841","234068","554244","440694",60585],"PO":["564318"]},"24085":{"abstract":"9720377 Reiser In this 36 month project, the PIs develop an Instructional model of reflective inquiry, including a description of the cognitive strategies that comprise reflective activity in scientific inquire and principles for their instruction. The project also develops software and curriculum that will enable the investigation and evaluation of this instructional model in real-world classrooms. The instructional model accounts for the following elements: cognitive strategies for reflection, strategic timing and initiation of strategy use, and beliefs that support reflection. It provides a framework for designing supports for reflection through social structures, tools, and artifacts. The model is used to guide the design of an inquiry-support environment called the Progress Portfolio, which will work in conjunction with third-party investigation software. The Progress Portfolio provides support for reflection by giving students mechanisms for turning their work products and processes into explicit objects for reflection. Ongoing empirical studies with the software and curriculum will lead to improvements in the design of the software and curriculum and refinement of the instructional model.","title":"Promoting Reflective Inquiry in Knowledge-Rich Investigation Environments","awardID":"9720377","effectiveDate":"1997-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["315258","489637","467756"],"PO":["560894"]},"23470":{"abstract":"In large-vocabulary spontaneous speech, the variability of the pronunciations of words is much higher than in read speech situations. At the 1996 Summer Workshop on Large Vocabulary Conversational Speech Recognition (WS96), a model for this variability to be used in Automatic Speech Recognition (ASR) systems was developed based on machine- derived descriptions of speech data. The continuation of this work in this grant focuses on studying the correlation of variation in pronunciations in continuous speech and higher-level information not usually brought to bear in an ASR pronunciation model. One important element in this model is the rate of speech, which has been shown to be a good predictor of word error rate on both read and spontaneous speech corpora. Investigations into the effects of resyllabification (movement of syllable boundaries when words are spoken in sequence) and word frequency on word pronunciations are also undertaken. The goal of this project is to improve the predictability of variation for speech recognition models, in particular for the reduction of recognition error for spontaneous and conversational speech. The techniques will be evaluated on the Switchboard corpus.","title":"SGER: Incorporating Higher-Level Information into Dynamic Pronounciation Modeling for ASR","awardID":"9713346","effectiveDate":"1997-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["550775"],"PO":["183208"]},"23393":{"abstract":"The University of Illinois at Chicago and the University of Maryland at Baltimore County collaborate on this project motivated by the tremendous growth of the Internet and the World-Wide-Web (WWW). Adaptive replication is an approach for improving performance, response time, and access cost in distributed database systems in general, and Internet\/WWW in particular. Adaptive replication is a generalization of the principle of caching. In adaptive replication the number of copies of an object, the location of these copies, and which updates are propagated to each copy, change dynamically depending on a given cost function. The project establishes the fundamental principles of adaptive replication in distributed database systems, and it develops, implements and analyzes a system for adaptive replication of objects. The system consists of a set of algorithms to be used for various cost functions. For the analysis the investigators are building a simulation testbed in which the user defines the network, selects a replication algorithm, selects a cost model, and an access pattern at each computer. The system enables comparison among the various adaptive and static replication algorithms. The project will improve the understanding, cost, and performance of distributed systems and distributed databases, and it can lead to a more efficient Internet and World-Wide-Web.","title":"Adaptive Data Replication in Distributed Systems","awardID":"9712967","effectiveDate":"1997-10-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["557651"],"PO":["563751"]},"25164":{"abstract":"A conference on Numerical Analysis and Domain Decomposition will be held on January 23-24, 1998, at the Courant Institute of Mathematical Sciences. This conference will focus on current advances in numerical analysis and scientific computing with particular emphasis on domain decomposition, and important applications of these techniques to areas such as computational solid mechanics and fluid dynamics. The conference promises to bring together a very strong international field of senior scientists with a large number of promising young investigators from the U.S. The conference provides a great opportunity to promote areas of critical interest, primarily scientific computing, scalable parallel algorithm development (including domain decomposition) and fundamental research in numerical analysis. The continued national investment currently being made in high performance computer hardware requires a similar investment in and dissemination of the underlying mathematical tools required to utilize this equipment. Consequently, the conference will yield strong practical benefits as wells as theoretical ones.","title":"Conference on Numerical Analysis and Domain Decomposition at the Courant Institute of Mathematical Sciences; New York, NY; January 23-24, l998","awardID":"9725103","effectiveDate":"1997-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["549376"],"PO":["187585"]},"24075":{"abstract":"9720348 McClelland Given that learning takes place at the connections between neurons, the pattern of connectivity between brain areas representing different types of information has a strong influence on how hard or easy it is to learn to relate various types of information. The research combines experimental investigation of skill training procedures, computational modeling, functional brain imaging, and automated tutoring in to improve understanding of the brain mechanisms that implement the principles. The work also aims to apply, evaluate, and refine training procedures to produce concrete improvements in the reading proficiency of both normal and reading-impaired children. The results will have important implications not only for the theory and practice of reading education, but also for the effective training of cognitive skills more generally.","title":"Intervention Strategies that Promote Learning: Their Basis and Use in Enhancing Literacy","awardID":"9720348","effectiveDate":"1997-10-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["523968","490198","415995","551746","167771",60544],"PO":["533965"]},"24086":{"abstract":"9720383 Gomez This project is being funded through the Learning and Intelligent Systems (LIS) Initiative. The Center for Learning Technologies in Urban Schools will help urban school communities integrate advanced technologies for teaching and learning with their education reform plans. The goal of the Center is to help these technologies become pervasive in science curricula and routine components of the learning experience. The Center is a partnership among the Chicago and Detroit Public Schools, and education and technology researchers at Northwestern University and the University of Michigan. The Center's premise is that urban schools represent a challenging and important setting for shaping and assessing new organizational and teaching practices supported by technology, and the technologies that optimize such support. Schools in Chicago and Detroit are currently developing and implementing new curriculum frameworks, new standards and practices for professional development, and new community-based structures that support teaching and learning in classrooms. The Center will capitalize on these efforts and on research at Northwestern University and the University of Michigan to develop models of science learning based on science practice, modeling and simulation, scientific visualization, and tools for computer-supported collaboration that can enrich urban schools. The Center will encourage schools to create challenging implementations for learning technologies, and support the schools in such endeavors.. Teams of teachers and researchers will work to understand how to make new technologies work in urban and non-urban communities across the nation. The result of the Center's efforts will be new technologies, and improved school organizations that are better structured to facilitate the adoption of new technology and rigorous, new science curricula.","title":"Learning and Intelligent Systems: Center for Learning Technologies in Urban Schools","awardID":"9720383","effectiveDate":"1997-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7358","name":"URBAN SYSTEMIC INITIATIVE PROG"}}],"PIcoPI":["201465","315258",60602,"172386","172389"],"PO":["564318"]},"25121":{"abstract":"This research program will address the high-performance parallel simulation of multiphysics problems that couple dynamic models in fluid mechanics, heat transfer, structures and control. This program requires the close collaboration of researchers in engineering, computer science and computational mathematics. The activities in Engineering are driven by the simulation, on high performance parallel computers, of problems involving the dynamic interaction of physical models from disciplines of importance in aerospace, civil and mechanical engineering. Four specific applications of this class of problems will be considered: the mitigation of turbulent vorticity in high-temperature engines; the study of high turbulent flow in pipe bends, the use of active and semi-active control to safeguard composite structures in civil and aerospace engineering; and the implementation of topology\/shape structural design and optimization for aeroelastic design. These application are unified by their multidisciplinary nature which involves at least two mechanical fields, use of a common basis in modeling, visualization, problem decomposition, parallel simulation methodology, and software\/hardware infrastructure. The research in Computer Science will focus on the development of a problem Solving Environment (PSE) for the applications problems which is suitable for the parallel implementation of large-scale multiphysics simulations. The primary goal of the PSE is to provide transparent, portable and scalable access to all of the resources needed for execution of large parallel applications on heterogeneous and\/or distributed systems, including interprocessor communication, access to disk, visualization, debugging and performance monitoring. The following application s of the PSE will be investigated: network-based distributed object systems, distributed shared memory systems, parallel persistent I\/O, and computational steering and debugging. In addition we propose to integrate quality of service protocols in high-speed networks with our distributed object system to provide a true real-time distributed environment, and to investigate numerical algorithms for optimal memory access using the PSE to facilitate distributed performance analysis. The application problems are interconnected in modeling, computational and software integration aspects, facilitating the common use of tools such as domain decomposers and response visualization. This project will provide unique opportunities for the training of students and postdocs in an interdisciplinary setting. Regular weekly meetings of the full research group will introduce all researchers to the breadth of issues involved and will allow students to locate suitable thesis topics. Students will be encouraged to have advisors from two disciplinary areas represented by the research team, and each student will be paired with a postdoctoral student as a mentor.","title":"High Performance Simulation of Multiphysics Problems in Turbulence, Control, and Structural Design","awardID":"9725004","effectiveDate":"1997-10-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1474","name":"NAT & MAN-MADE HAZARD MITIGATI"}}],"PIcoPI":[63347,"292489","193726","213692","193727"],"PO":["296424"]},"24076":{"abstract":"This project is being funded through the Learning and Intelligent Systems (LIS) initiative. It is concerned with learning that is incremental in nature, resulting in skills that improve over time. Such learning is responsible for the development of perceptual discriminations, stimulus associations, and motor skills, and is seen in both humans and animals. The goal of the research is a systems-level neural theory of incremental learning. The project combines computer simulations with neurophysiological recording from the brains of behaving rats and monkeys, functional magnetic resonance imaging in humans, and robotic implementation. It is known that many parts of the mammalian brain contribute to incremental learning. Although the cortex may play a central role, other brain areas known to make vital contributions include the basal ganglia, hippocampus, amygdala, and cerebellum. It is important to understand the roles of these various areas and their interactions with each other during learning. Experimental work to be performed includes recording from various areas of the brains of rats and monkeys during learning and imaging the brains of humans performing analogous tasks. Models of neural function will be developed based on the monkey experiments and will be implemented on a mobile robot. These implemented models will allow the training of the robot, and a comparison of the learning that takes place with that observed in humans and animals. The development of theories of incremental learning will provide a better understanding of how the process occurs and may result in improved approaches to the development of skills in both humans and machines.","title":"The Biological Basis of Incremental Learning","awardID":"9720350","effectiveDate":"1997-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["523968","490198","550942",60549,"502937"],"PO":["179262"]},"24087":{"abstract":"9720384 SRI International Roy D. Pea Learning and Intelligent Systems: Center for Innovative Learning Technologies The Center for Innovative Technologies (CILT) stimulates the development and implementation of important, technology-enabled solutions to critical problems in K-14 science, mathematics, engineering, and technology learning. Four institutions-SRI International; the University of California at Berkeley; Vanderbilt University; and the Concord Consortium-provide Center leadership and infrastructure. \"Theme teams\" conduct the Center's research, development, and implementation activities. Participants drawn both from the founding organizations and from elsewhere will represent the best possible mix of expertise. Theme teams will include computer scientists and engineers; experts in science, mathematics and engineering instruction, policy, and research; and industry leaders. Participants will work together in national workshops and on-line discussions to review their research results, identify critical challenges and potential breakthroughs in their theme area, and select prototype collaborative projects for CILT sponsorship. These prototype projects serve as\"seed\" efforts that,can transform the use of learning technologies in education. The Center's initial themes are Virtual Learning Communities; Visualization and Modeling; Low-Cost, Ubiquitous Computing; and Assessment. CILT provides the infrastructure for synthesizing learning technology R&D and implementation lessons across projects, stimulating multidisciplinary collaboration and rapid innovation, and fostering communication among technology supports for mathematics and science learning. CILT will train postdoctoral scholars from multiple disciplines to lead the field of learning technologies in the future.","title":"Learning and Intelligent Systems: Center for Innovative Learning Technologies","awardID":"9720384","effectiveDate":"1997-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7263","name":"NETWORKING INFRASTRUCT-EDUCAT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}}],"PIcoPI":["560145","533534","549245","487434","501315"],"PO":["564318"]},"24077":{"abstract":"9720351 Thomas Defanti University of Illinois Deep Learning And Visualization Techniques This award is to study the use of visualization techniques in encouraging deep learning of concept. The notion was initially developed on a virtual reality CAVE environment to illustrate the concept of gravity. The PIs are studying other educational applications where a compelling case for virtual reality can be made.","title":"Deep Learning and Visualization Technologies","awardID":"9720351","effectiveDate":"1997-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["557607","552897","105383","495168"],"PO":["297837"]},"24056":{"abstract":"Multi-dimensional transient partial differential systems are computationally demanding and may, for example, involve accident simulation, weather forecasting, chemical and material fabrication, turbulence, and combustion. Balancing computational loading on a parallel computer must be dynamic, since adaptivity by either h- or p-refinement will upset an initial balance. Efforts to date have concentrated on h-refinement rather than the potentially more efficient p-refinement. This research seeks to develop the technologies necessary to support effective and reliable adaptive computation for transient partial differential systems on heterogeneous parallel computing environments. These technologies will be incorporated into an extensible software framework and evaluated using applications involving fluid flow, material processing, chemical reaction, and crystal growth.","title":"Software for Transient Parallel Adaptive Finite Element Computation","awardID":"9720227","effectiveDate":"1997-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["390451","525821","450692"],"PO":["179296"]},"28864":{"abstract":"9753055 Landau, Susan University of Massachusetts POWRE: Certification of Security Protocols This research involves security properties of protocols and other systems that are built with cryptographic techniques. Investigators look at two principal issues; the first is ``protocol busting,'' which studies how complex protocols built from other pieces (such as secure cryptographic systems) can become insecure through misuse of the cryptographic pieces or through unwarranted assumptions about them. The second issue being tackled is developing methods to certify security properties. Research in protocol-busting involves the examination of proposed password-based session-key agreement protocols, and studies characterizations under which an authentication scheme can safely incorporate a small shared piece of secret information (e.g. a password). The investigators develop protocols for multi-user authentication when the group is large and in flux; techniques include graph-theoretic and algebraic methods. The investigator is studying certification schemes of cryptosystems for authentication in a distributed network. Developing a certification scheme means developing a logical framework for the various types of attacks that have arisen on cryptosystems, and then developing a suite of appropriate tests. The distributed algorithms work concerns developing protocols to delegate authority in a multi-user environment.","title":"POWRE: Certification of Security Protocols","awardID":"9753055","effectiveDate":"1997-10-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":[73169],"PO":["297837"]},"23562":{"abstract":"The goal of this research is to develop systematic algorithms and techniques for rapidly searching an optimal or near optimal solution of a resource allocation problem. The research method, the Nested Partitions (NP) method, will be extended and tested to solve resource allocation problems encountered by industry partners. Many resource allocation problems such as facility planning, job scheduling, pollution control, and portfolio management can be modeled as discrete stochastic optimization problems. Owing to the complexity inherent in these systems, the design of allocation and scheduling policies can be a formidable task. One key issue is the combinatorial explosion of alternatives normally leading to NP-complete optimization problems. Beyond \"toy problems\", computational complexity is an obstacle faced by even the most elegant and effective approaches developed for solving realistic problems. In the case of dynamic systems, the situation is exacerbated by the added elements of uncertainty, which further complicate such problems. It is expected that this development will exert both a practical and theoretical impact in the area of complex system design, control, evaluation and optimization. This research will allow the designer or manager to examine a large solution space to produce systems with predictable behavior which would prove to be cost effective and improve the quality of the systems. The research development will also provide a framework for solving many other stochastic optimization problems.","title":"Optimal Resource Allocation under Uncertainty","awardID":"9713647","effectiveDate":"1997-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["560408"],"PO":["185422"]},"38798":{"abstract":"","title":"Efficient Algorithms with Practical Applications","awardID":"9896119","effectiveDate":"1997-10-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517969"],"PO":["150516"]},"24058":{"abstract":"The quality of vision is significantly influenced by the shape of the cornea, and even subtle shape variations, at the micron level, can have significant effects on visual performance. The proposed research will develop effective scientific visualization techniques for the cornea. In such areas as eye disease diagnosis, eye surgery, and the design and fabrication of corrective contact lenses, the need for more precise measurements is apparent. Improved scientific visualization techniques will convey to a clinician the shape of a cornea to aid in the fitting of lens, the acuity of the visual field and after surgery, and will show how modifying the parameters of a contact lens affects its shape.","title":"Visualization and Simulation in Scientific Computing for the Cornea","awardID":"9720252","effectiveDate":"1997-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["518667"],"PO":["551992"]},"20054":{"abstract":"While linear approximations and models possess simplicity and tractability in analysis, most real life problems entail nonlinear effects. Nonlinear system of current interest in signal processing and communications are encountered with satellite links, high-speed telephone channels, power amplifiers, magnetic and optical recording systems. This research is exploring novel techniques for identification, performance analysis, and mitigation of nonlinear systems. The goal is to use state-of-the-art statistical signal processing tools to analyze long-standing issues in nonlinear modeling and applications to tele- communications problems. The present approach is taking a fresh look at the traditional Volterra model and exploiting carefully designed cyclostationary inputs that result in closed-form kernel expressions with input-output data. Such solutions will apply to finite memory Volterra models of any order, reduce computational complexity and noise effects even with relatively short data records, and allow for analytical performance evaluation using variance expressions. The investigator plans to simulate and test the resulting algorithms using real data received from satellite links where amplifiers are driven to the nonlinear saturation region. She is also studying blind nonlinear Volterra system identification that relies on single or multi-sensor data only. The potential of blind nonlinear channel estimation and equalization is of paramount importance when no training inputs are available, or when new communicators join a multiport broadcast and transmission cannot be interrupted for training.","title":"CAREER: A Research, Education, and Technology Transfer Proposal in Statistical Signal Processing with Emphasis on Nonlinear System Identification","awardID":"9703312","effectiveDate":"1997-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["201076"],"PO":["564898"]},"24114":{"abstract":"9720545 Ellis, Carla Schlatter Duke University POWRE: Visiting Professorship: Systems Research in Adaptation This project supports the research and educational activities of the PI as a Visiting Professor at the University of Washington for the 1997-98 academic year. The research investigates the role of adaptation in computer systems, particularly as it applies to resource management in clusters of workstations and environments for mobile computing. Adaptation is an emerging theme in systems research. At all levels of system design, there are potential performance benefits to be realized by responding to dynamic variations in runtime behavior and resource availability by applying distinctly different policies or techniques. The defined research plan experimentally addresses questions concerning what the best adaptation strategies are and what infrastructure mechanisms are useful for their implementation. The methods to be employed include design, implementation, and measurement of software prototypes to evaluate various adaptation approaches. This award is expected to have impact on the discovery of new adaptation techniques to improve mobile and cluster computing performance, encouragement of women students to enter and to complete advanced degree programs in Computer Science, and advancement the PI as a senior woman in research and education.","title":"POWRE: Visiting Professorship: Systems Research in Adaptation","awardID":"9720545","effectiveDate":"1997-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["353750"],"PO":["557609"]},"38876":{"abstract":"","title":"MDC: A High-Performance Problem-Solving Environment for Optimization and Control of Chemical and Biological Processes","awardID":"9896198","effectiveDate":"1997-10-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["278441",98693,"524314"],"PO":["179846"]},"25148":{"abstract":"This is in support of the Sixth International Machine Translation Summit to be held October 29-31 and November 1, 1997 in San Diego, California. This year, the summit celebrates the 50th anniversary of machine translation as an area of research and development. Given the special nature of this celebratory conference, NSF is assisting in the conference support in order to express in public the support of the Foundation for machine translation as a field of study and in order to support the travel costs of 5 conference attendees who will constitute a panel of Pioneering Researchers in Machine Translation. The chosen panelists will provide a retrospective on the history and developments of machine translation in the late 1940's until today.","title":"Workshop: MT Summit Conference Support","awardID":"9725058","effectiveDate":"1997-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["543277"],"PO":["183208"]},"23960":{"abstract":"9714848 Giles This twelve month project helps to support 150 teachers participating in the SuperComputing '97 conference including special sessions and workshops specifically intended for educators. The conference theme is \"the exploration of the many possible roles of high performance networking and computing in lifelong education in the 21st century.\" This year's program broadens the participants beyond teachers to include students, administrators and community (technology) leaders, with a particular emphasis on minority participation; offers fora on computational science; funds teachers; and supports a teacher booth. The emphasis on computation science is grounded in the classroom context, and the PIs seek to generate dialog on how these tools and techniques can contribute to the implementation of the national science and mathematics standards. In total 150 teachers, 20 students, 20 school administrators, and 10 community technology leaders are participating, approximately 50 of whom are from the conference area, San Jose. Cost sharing is 8%. NSF's funding covers one-half the participants. Substantial corporate contributions are expected to cover the rest, approximately 100, of the participants.","title":"Education and Teacher Enhancement at the \"SuperComputing '97\" Conference","awardID":"9714848","effectiveDate":"1997-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7300","name":"TEACHER ENHANCEMENT PROGRAM"}}],"PIcoPI":["425870","353752","107078"],"PO":["424015"]},"38868":{"abstract":"","title":"Automated Support for Testing and Debugging of Real-Time Programs Using Oracles","awardID":"9896190","effectiveDate":"1997-10-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["531512"],"PO":["150697"]},"26438":{"abstract":"This project will initiative a process for integrating emerging perspectives relevant to several NSF-based initiatives that revolve around the development and broad application of network-based information systems. The NAS\/CSTB will organize a roundtable to bring togehter executives from NSF and other federal agencies, private foundations, and other sources of private sector research support to facilitate interactions and possible collaboration. Its near-term goal is to foster information exchange and promote broader and more effective development of support for relevant research programs across key public and private sector organizations. In part this activity is convened to maximize the potential and new National Science Foundation Knowledge And Distributed Intelligence initiatives including knowledge networking, learning and intelligent systems, as well as the multi-agency Next Generation Internet, digital libraries, and universal access initiatives. Many relevant research programs rooted in information technology also embrace a variety of scientific and engineering disciplines, which complement computer science and engineering with insight into how people do or might use information technology.","title":"Promoting Distributed Knowledge Systems","awardID":"9729114","effectiveDate":"1997-10-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1294","name":"OPPORTUNITY SEED FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["234699"],"PO":["495796"]},"21752":{"abstract":"9708221 Insana Quantitative ultrasound (QUS) techniques are to be developed to detect early changes in renal microstructure that ultimately lead to end-stage renal disease (ESRD). QUS involves analysis of echo spectra in frequency channels corresponding to scattering from various anatomical scales to measure the size, number density, and collagen content of essential tissue microstructures. These are among the first techniques for analyzing histological properties of tissues in vivo and noninvasively. The incidence of ESRD in the United States is increasing geometrically. Average medicare costs were $46,117 per ESRD patient for a total of $9.5 billion in 1992. A definitive diagnosis of progressive injury leading to ESRD is now based on clinical findings and biopsy; that often occur late in the disease process. Currently no test exists to establish the presence of early kidney injury or to identify populations at risk for whom prevention of progressive injury should be attempted. This investigation will examine the potential of QUS as a safe, inexpensive, and noninvasive method for early detection of renal injury caused by several common conditions including diabetes, hypertension, and cystic kidney disease. This three-year, multidisciplinary research project aims to develop new biomedical instrumentation, experimental techniques, and models of disease processes. If QUS can successfully identify patients at risk for ESRD, the potential to prevent disease would be improved, the net cost of treating the disease would be reduced significantly, and the quality of life for those patients affected would be improved. This research program is part of a new graduate-level Biomedical Engineering Program at the University of Kansas. ***","title":"CRHCT: New Ultrasonic Techniques for Managing Kidney Disease","awardID":"9708221","effectiveDate":"1997-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["89044","389530",54762,"4158","511291"],"PO":["317420"]},"38715":{"abstract":"","title":"RIA: Convex-Programming Design of Signals and Systems","awardID":"9896034","effectiveDate":"1997-10-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[98334],"PO":["564898"]},"13459":{"abstract":"Algorithms for progressive image compression seek to represent an image in such a way that a small fraction of the data file can allow a displayed image to be recognizable, and a larger portion of the data allows improved image quality. The main applications of progressive image compression are for browsing of remote databases, Internet image hopping, and fast remote decision-making tasks where many images must be scanned. The goal is to compress images to rates so low as to yield \"just-recognizable\" quality. The user can then exploit just- recognizable images while progressively scanning an image database by \"quitting\" each image as soon as it is determined not to be the one sought. This research involves theoretical understanding of ultra-low rate progressive image coding both with and without channel noise, as well as the development and evaluation of practical algorithms for applications such as low-bandwidth video compression and packet network image transmission. One portion of this research focuses on algorithm development, including optimization of wavelet zerotree coding for ultra-low rates, and coding using regions or line caricatures. The investigators are studying the effect of channel noise on progressive coding systems, and are developing both grayscale and color bit progressive image coding algorithms that do not exhibit catastrophic breakdown in the presence of channel noise. One promising approach uses rate compatible punctured convolution codes applied to images compressed with a wavelet zerotree method. Experimental studies of response times for human observers of progressive image coders will allow the researchers to quantitatively compare one progressive image coder against another, and yield insight into human perceptual responses to just-recognizable imagery.","title":"Ultra-Low Rate Progressive Coding of Images","awardID":"9617366","effectiveDate":"1997-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["517054","507609"],"PO":["564898"]},"22952":{"abstract":"HRD-9711504 Beckman In recent years, through a variety of programs, the Houston Community College System (HCCS) has established a number of efforts designed to recruit and retain women, minorities, and students with disabilities. Despite the successes of such programs, the number of minority students completing their studies and transferring to senior colleges and universities falls far short of the nation s growing need for minorities trained in computer technologies. The faculty of the Houston Community College System Computer Science Department has planned a broad, ambitious program to attract more students from underrepresented groups to careers in computer science. Using successful models, the plan focuses on building an infrastructure of faculty and student support systems which will assure promising potential scholars an outstanding educational program and secure their entry into senior colleges and universities. Our proposed program will touch every sector of the college system and reach into the community we serve. The primary goal of the program is to increase the number of students from all underrepresented groups in the field of computer science, assist them to successfully complete their studies at the Houston Community College system, and facilitate their entry into a senior college or university. Underlying this goal is the intent to foster a fundamental change of philosophy throughout the Houston Community College System and the entire community. The comprehensive plan we have developed provides for the building of an infrastructure that will prepare faculty and students for the speed of technological change. The plan will require an infusion of upgraded hardware and software to help faculty prepare for these changes by revising and updating the curriculum yearly to meet the program s needs, to train faculty in current technical advances, and to meet the instructional needs of students brought into the program. The full program provides for re cruiting and retaining promising students from underrepresented groups who are interested in pursuing careers in computer science. The plan includes pre-college training, two-year training and education at the college level, and retention support programs such as tutoring, mentoring, counseling, and appropriate financial support.","title":"AMP\/ Bridges to Computer and Information Science Careers","awardID":"9711504","effectiveDate":"1997-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1545","name":"RES IN DISABILITIES ED"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7412","name":"ADVANCED TECH EDUCATION PROG"}}],"PIcoPI":[57636,57637,57638,57639,57640],"PO":["543386"]},"38803":{"abstract":"","title":"The Structure, Design and Application of M-band Symmetric Wavelets and Filter Banks","awardID":"9896124","effectiveDate":"1997-10-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["279723"],"PO":["564898"]},"13955":{"abstract":"This action executes a cooperative agreement between NSF and the National Computational Science Alliance (the Alliance) at the University of Illinois at Urbana-Champaign (UIUC), under the direction of Dr. Larry Smarr via NSF award ASC 9619019. The cooperative agreement will be operational for a period of five years and is the result of a proposal submitted to NSF solicitation, \"Partnerships for Advanced Computational Infrastructure\" (PACI), NSF 96-31. The PACI program builds on and replaces the NSF Supercomputer Centers Program established in 1985 The program focuses on newly emerging opportunities in high performance computing and communications, providing flexibility, both to adapt to rapidly evolving circumstances and to meet the need for high-end computation, in order to enable continued U.S. world leadership in computational science and engineering. NSF, through this program, will provide access for researchers to high performance computing systems, with associated highly trained staff and researchers necessary to develop and optimize their use. The emergence of scalable parallel systems, high performance networking and high bandwidth and large capacity mass storage systems creates the opportunity for a national infrastructure consisting of a number of geographically distributed sites strongly coupled to high end computational resources and to each other via high speed communications networks. The National Center for Supercomputing Applications has joined with its partners to create an Alliance whose principal mission is the integration of the many computational, visualization and information resources into a national-scale \"Grid\". The Grid links the Alliance together and provides access to its wide variety of resources to the national scientific research community. Using high performance networking the Grid will link the highest performing systems to mid-range versions of these architectures, and then to the end-users' workstations, thereby creating a national Power-Grid. The Allia nce Grid will interconnect dozens of visualization and virtual reality displays, massive data stores, and remote instruments, while Alliance developed software \"glue\" unifies them for collaborative problem solving. The Alliance will also create integrating structures for information and resources distributed on the Grid, making its content useful for education, training and outreach. Special emphasis will be placed on outreach to underrepresented minorities, women and other pertinent areas. The partnership members have been chosen because of their individual commitments to work together as a team, enabling advances to be achieved by a new level of national-scale multidisciplinary collaborative research. The Alliance will concentrate on providing advanced hardware, enabling technology, leading edge work in application technology, education, training and outreach. Included in this award is the first incremental payment to UIUC and its partners for FY98 which covers general operating expenses including equipment.","title":"National Computational Science Alliance","awardID":"9619019","effectiveDate":"1997-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V211","name":"HOMELAND SECURITY COAST GUARD"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V294","name":"NASA-INF PWER GRID PARTNERSHIP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V742","name":"ARCHIVES-PRES INFRASTRUCTURE R"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W129","name":"COAST GUARD-MSCM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W168","name":"NASA-NCSA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W293","name":"NASA-POER GRID PARTNERSHIP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W395","name":"NASA-AMENDMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W490","name":"NATL ARCHIVES & RECORDS-NATL C"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W531","name":"COAST GUARD-NCSA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X141","name":"NASA-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X216","name":"NIH-DEV OF DIST DATA DISCOV CO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X565","name":"NIH-DEV OF DIST DATA DISCOV CO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X578","name":"NASA-NATL PARTNERSHIP FOR ADV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X750","name":"COAST GUARD-(MSCM)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X919","name":"NASA-NATL COMP SCI ALLIANCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X920","name":"NASA-NATL COMP SCI ALLIANCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y658","name":"NASA-PARTNERSHIP BETWEEN NASA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y677","name":"NATIONAL IMAGERY & MAPPING AGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y870","name":"GSA-GSA AND DIGITAL GOV INITIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y889","name":"NRC-NSF FED WEB CONSORTIUM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"1666","name":"RESEARCH ON LEARNING & EDUCATI"}}],"PIcoPI":["554382","562707","436368","467389"],"PO":["438085"]},"26617":{"abstract":"The University of Illinois at Chicago and the University of Maryland at Baltimore County collaborate on this project motivated by the tremendous growth of the Internet and the World-Wide-Web (WWW). Adaptive replication is an approach for improving performance, response time, and access cost in distributed database systems in general, and Internet\/WWW in particular. Adaptive replication is a generalization of the principle of caching. In adaptive replication the number of copies of an object, the location of these copies, and which updates are propagated to each copy, change dynamically depending on a given cost function. The project establishes the fundamental principles of adaptive replication in distributed database systems, and it develops, implements and analyzes a system for adaptive replication of objects. The system consists of a set of algorithms to be used for various cost functions. For the analysis the investigators are building a simulation testbed in which the user defines the network, selects a replication algorithm, selects a cost model, and an access pattern at each computer. The system enables comparison among the various adaptive and static replication algorithms. The project will improve the understanding, cost, and performance of distributed systems and distributed databases, and it can lead to a more efficient Internet and World-Wide-Web.","title":"Adaptive Data Republication in Distributed Systems","awardID":"9729495","effectiveDate":"1997-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["193182"],"PO":["563751"]},"38849":{"abstract":"","title":"Architecture and Synthesis Techniques for Embedded Systems","awardID":"9896171","effectiveDate":"1997-10-01","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["457653"],"PO":["321058"]},"23735":{"abstract":"Technological advances in the last few years have brought automatic speech recognition where it can now be deployed in limited, real-world applications. However, serious obstacles still remain in satisfactory recognition of spontaneous speech. Casual dialog exhibits a large amount of variability in the pronunciation of words. Humans have little difficulty in transcribing such speech, but automatic transcription suffers badly because of the inability of recognizers to properly consider nonstandard pronunciations. This must be addressed to make systems robust to a conversational speaking style. The investigators propose to examine alternate pronunciations of words in Switchboard, a large corpus of conversational speech, and develop statistical models for predicting the variations based on cues in the acoustic, phonemic and linguistic context of a word. Alternate pronunciations are viewed as perturbations of the canonical ones and, to predict likely variations, the researchers propose to use phonemic environment, lexical stress, syllabic structure, part-of-speech, phrase boundary locations, the realization or deletion of neighboring phones, etc. They shall apply complementary nonparametric and parametric techniques for building predictive models with the goal of improving accuracy in a speech recognition system. This effort addresses a significant obstacle in automatic recognition of spontaneous speech and, in the process, gains fundamental understanding of the causes, mechanisms and extent of pronunciation variability.","title":"SGER: Pronunciation Modeling for Conversational Speech Recognition","awardID":"9714169","effectiveDate":"1997-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["445173"],"PO":["183208"]},"13956":{"abstract":"This action executes a cooperative agreement between NSF and the National Partnership for Advanced Computational Infrastructure (NPACI) at the University of California - San Diego (UCSD), under the direction of Dr. Sid Karin via NSF award ASC 9619020. The cooperative agreement will be operational for a period of five years and is the result of a proposal submitted to NSF solicitation, \"Partnerships for Advanced Computational Infrastructure\" (PACI), NSF 96-31. The PACI program builds on and replaces the NSF Supercomputer Centers Program established in 1985 The program focuses on newly emerging opportunities in high performance computing and communications, providing flexibility, both to adapt to rapidly evolving circumstances and to meet the need for high-end computation, in order to enable continued U.S. world leadership in computational science and engineering. NSF, through this program, will provide access for researchers to high performance computing systems, with associated highly trained staff and researchers necessary to develop and optimize their use. The emergence of scalable parallel systems, high performance networking and high bandwidth and large capacity mass storage systems creates the opportunity for a national infrastructure consisting of a number of geographically distributed sites strongly coupled to high end computational resources and to each other via high speed communications networks. NPACI will lead the deployment and evolution of a national-scale metacomputing environment that will benefit the national user community in all fields of computational science and engineering. This infrastructure will integrate compute and data servers, and employ the talents of computer and computational scientists to guide its evolution. It will leverage the activities of many projects. The metacomputing environment will be extended to enable not only numerically intensive but also data-intensive computing. To that end, infrastructure will be developed and deployed to enable analysis of extremely large data collections from application output, remote-sensing and instrumentation-derived data, and data in widely scattered, discipline-specific databases. Three technology areas which are central to creating a metacomputing environment will initially be the basis for NPACI: Adaptable, Scalable Tools\/Environments; Data-intensive Computing; and Interaction Environments. Several scientific applications have also been chosen that will motivate, guide, and validate development and integration of the NPACI infrastructure. Molecular Science, Neuroscience, Earth Systems Science, and Engineering will initially be focused on as areas ripe for scientific discovery and technology development. NPACI will integrate computational science and engineering education activities into the infrastructure, building on successful education and outreach efforts within the partnership. Particular emphasis will be placed on outreach to underrepresented minorities, women, and new communities. The Partnership will concentrate on providing advanced hardware, enabling technology, leading edge work in application technology, education, training and outreach. Included in this award is the first incremental payment to UCSD and its partners for FY98 which covers general operating expenses including equipment.","title":"National Partnership for Advanced Computational Infrastructure","awardID":"9619020","effectiveDate":"1997-10-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1990","name":"CHEMISTRY EDUCATION"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5984","name":"TRANS-REGIONAL AFFAIRS (TRA)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V126","name":"DEF INF SYS AGY-INTERACT VIS &"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V127","name":"DEFENSE-HPC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V293","name":"NASA-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V444","name":"NATL ARCHIVES-SDSC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V535","name":"AIR FORCE-HPC MODERNIZATION PR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V536","name":"AIR FORCE-HPC MODERNIZATION PR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V715","name":"ENERGY-ADV SIM & COMP ALL CTR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V716","name":"ENERGY-ASCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V742","name":"ARCHIVES-PRES INFRASTRUCTURE R"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V811","name":"NATL ARCHIVES-NATL PARTNERSHIP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W148","name":"NASA-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W287","name":"ENERGY-BLUE HORIZON SUPERCOMPU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W292","name":"LIBRARY OF CONGRESS-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W294","name":"NASA-POWER GRID PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W393","name":"NSA-HIGH PERF COMP SYS PERF MO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W394","name":"NSA-WIMPS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W494","name":"DEFENSE-HPC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"W558","name":"NATL ARCHIVES-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X141","name":"NASA-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X497","name":"NATL ARCHIVES & RECORDS ADMIN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X578","name":"NASA-NATL PARTNERSHIP FOR ADV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X582","name":"ENERGY-ACCESS TO NSF\/UCSD BLUE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X812","name":"ENERGY-ACCESS TO NSF\/UCSD BLUE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X915","name":"NASA-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X916","name":"NASA-NPACI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X959","name":"NATL ARCHIVES & RECORDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y595","name":"ENERGY-WORKSHOP ON DATA & VISU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y659","name":"NASA-INFRASTRUCTURE SUPPORT FO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y666","name":"BUREAU OF CENSUS-WWW"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y677","name":"NATIONAL IMAGERY & MAPPING AGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y685","name":"CIA-MOSAIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1353","name":"Hist & Philosophy of SET"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"1666","name":"RESEARCH ON LEARNING & EDUCATI"}}],"PIcoPI":["562621","288449"],"PO":["229551"]},"20998":{"abstract":"The purpose of this grant is to support research on a new concept related to error correcting codes and stream ciphers. Pseudorandom binary sequences are used for error correction in the presence of noise by introducing redundancy to messages and for security by introducing pseudorandom noise to messages. This research concerns pseudorandom sequences and the fundamental properties that make them useful for coding and cryptography. The covering radius of a code is the smallest radius such that every vector of the given length is contained in at least one sphere of that radius centered at a codeword. It is a fundamental measure of codes, closely related to many other measures. Covering radii have been extensively studied for some 25 years. The multicovering radii generalize covering radii by asking that several vectors be covered simultaneously by codewords. This new concept arose from an investigation of the existence of stream ciphers that resist all possible cryptanalytic attacks of a very general type. The principal investigator will study basic properties of multicovering radii of codes such as the multicovering radii of specific codes and bounds on codes with various properties. The result of this research program will be a better fundamental understanding of pseudorandom sequences with respect to properties that make them suitable for use in cryptographic stream ciphers. It will also lead to improvements in our fundamental understanding of error correcting codes and perhaps to improved design and analysis of such codes.","title":"The Multicovering Radii of Codes","awardID":"9706078","effectiveDate":"1997-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["408476"],"PO":["188393"]},"23715":{"abstract":"9714111 Blumenthal, Marjory National Academy of Sciences Special Project: Core Support for the Activities of the Computer Science and Telecommunications Board This award provides for 3 year support for the meeting activities of the Computer Science and Telecommunications Board of the National Academy of Science. The Board provides studies on the health of the U.S. computer science and telecommunications and their applications. It draws on the expertise of national leaders in the field and receives input from representatives of government agencies with computing and communications research missions, Congress, industry, and major federal users of information technology. In the last 10 years the Board has completed more than 45 reports.","title":"Special Project: Core Support for the Activities of the Computer Science and Telecommunications Board","awardID":"9714111","effectiveDate":"1997-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["234699"],"PO":["533875"]},"20978":{"abstract":"We will investigate a general class of concatenated codes and coded-modulation, by building upon our recent invention. Our concatenated scheme is more general than the conventional concatenated codes in that a \"coder\" can be a channel with memory (e.g., a partial-response channel, a channel with intersymbol interference and\/or multipath delays, a channel with burst noise), or a modulator with some constraint or memory (e.g., continuous phase modulation (CPM), trellis-coded modulation (TCM)). We can also concatenate more than two coders. In our proposed system an \"ambiguity zone detector (AZD)\" plays a critical role. The AZD introduces generalized \"erasure\" symbols, and is found to be a most efficient way of exploiting soft-decision outputs. We also make use of a \"permutation\" and \"iterative decoding\", as has been done in Turbo codes. But unlike the Turbo codes and such other known schemes as product codes, the permutation size required for our system needs not be so large. The main advantage that differentiates our approach from prior arts is its extremely simple decoding algorithm. Hence, the decoder is easily implementable and the decoding delay is kept minimal. The performance of our system, measured in terms of residual errors\/erasures, is extremely good. For example, our initial result obtained for a system which adopts a Hamming code and a partial-response channel G(D)=1+D demonstrates that our decoding algorithm converges within several iterations, and produces nearly error-free outputs even when more than 50% of the AZD outputs are labeled \"erasures\". In this proposed study we intend to perform the following research tasks: 1. Simulation of specific application examples (e.g., partial-response channels, wireless channels with CPM) 2. Determination of good permutations and effective decoders (e.g., optimal selections of the ambiguity zones) 3. Performance analysis of the proposed codes, and coded modulation schemes (e.g., bounds and approximation for t he decoding error probability) 4. Construction of powerful codes, using a more general concatenation topology (e.g. a parallel-serial concatenation), and the corresponding decoding procedures. We also expect that insights to be gained in the present study should lead to a better understanding of the Turbo codes, and vice versa.","title":"A Study of Concatenated Codes and Coded Modulation Systems","awardID":"9706045","effectiveDate":"1997-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[52873],"PO":["150411"]},"23905":{"abstract":"A critical challenge for development of the Internet is how to support efficient and effective multicast communication in response to the intense pace of growth of the Internet and the concomitant demand for communication services from its users. Current multicast protocols, while well-suited to local or smaller scale communication, have suffered from serious shortcomings with respect to scalability, stability, and inter-domain coordination. Our approach to the multicast routing problem involves the introduction of new graph theoretic structures as underlying abstract communication topologies for multicast and the integration of these new structures with current technologies. There are two key elements to our new multicast architecture: a) 3-layer hierarchical multicast protocol and b) a virtual topologies model. Together these two elements provide a flexible architecture for multicast that has the potential to overcome the shortcomings described above. In this proposal, we focus on the virtual topologies element of the architecture. Certain graph structures have great potential to serve as underlying topologies for multicast communication, due to properties of connectivity, symmetry, limited vertex degree, and small diameter. Under the proposed model, an abstract communication topology, such as the k-tree or the k-ary n-cube, is used as basis for the execution and routing of the multicast protocols. The mapping of the virtual topology to physical routes in the Internet occurs dynamically, as is done under current, shared-tree approaches to multicasting. More robust topologies can be expected to provide greater flexibility and fault tolerance than simple tree structures. Scalability comes from the fact that these virtual topologies are limited to intradomain application. Our proposed 3-level, hierarchical multicast protocol follows the Internet domain structure, interconnecting domain-specific virtual topologies into an overall multicast structure. We plan to develop new pr otocols for multicast under the architectural model described above and to test their feasibility and performance through simulation. Our interdisciplinary team of researchers in graph theory, parallel computing, and networking brings a new synergy to the multicast problem. Our theoretic work will be guided by an understanding of the pragmatic issues involved in today's Internet protocols. We hope to define and develop fundamental new multicast structures and algorithms that can ultimately serve as the foundations for a realistic, effective multicast architecture for the Internet.","title":"A Scalable and Robust Multicast Architecture for the Internet","awardID":"9714680","effectiveDate":"1997-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["117139","343535","343534",60066,"543493"],"PO":["150490"]}}