{"49272":{"abstract":"","title":"Estimation and Equalization of Time-Varying Channels","awardID":"9996252","effectiveDate":"1999-02-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["564051",126034],"PO":["564898"]},"35580":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include scientific and medical imaging, digital mammography, interdisciplinary computational simulation research, High Definition Television, animated visualization of electric and magnetic activity of the human brain; a micromechanical model for understanding the mechanisms of defect generation and propagation in crystals; and establishment of an Autonomous Oceanographic Sampling Network. Collaborations include the Air Force Research Laboratory, NASA Lewis Research Center, Lawrence Livermore National Laboratory, University of Houston, Ohio State University, University of Illinois at Urbana, Stanford, the Brain and Behavior Laboratory at Simon Fraser University, and others.","title":"Florida Atlantic University","awardID":"9818184","effectiveDate":"1999-02-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[89469],"PO":["198445"]},"38330":{"abstract":"This project will develop innovative techniques and software for so-called<br\/>\"fast methods\" for n-body solvers and their applications. An n-body solver<br\/>computes the behavior of a set of interacting particles; examples run from<br\/>the solar system (9 planets interacting through gravity) to computer chips<br\/>(billions of atoms that attract or repel electrons). \"Fast\" methods for<br\/>these solvers use data structures such as trees to minimize the number of<br\/>computations. Typically, the data structure summarizes the interactions of<br\/>a group of particles, eliminating the need to compute all of the pairwise<br\/>interactions. Managing the data structure makes these methods difficult to<br\/>program, particularly on modern parallel machines.<br\/><br\/>This project addresses algorithmic issues, serial and parallel performance,<br\/>portability, and I\/O requirements for fast methods for particle dynamics in<br\/>selected applications. Specifically, the project makes research<br\/>contributions in the following areas:<br\/><br\/>* Error Control and Boundary Conditions: This project will extend recent<br\/>work in variable degree multipoles to improve error bounds in non-uniform<br\/>particle distributions while minimizing the added computation.<br\/><br\/>* Robust Parallel Algorithms and Libraries: This project will build<br\/>calibrated portable libraries of fast solvers capable of adapting to<br\/>dynamic computational platforms like clusters of multiprocessors.<br\/><br\/>* Data Analysis and I\/O Control: This project will investigate compression<br\/>schemes capable of effectively handling the huge amounts of data generated<br\/>by particle dynamics simulations.<br\/><br\/>The education plan includes a variety of initiatives at various levels. The<br\/>Computer Applications in K-12 Education in Science (CAKE) program will<br\/>introduce pre-college students to the use of high performance computing and<br\/>networking, using GUIs based on the research libraries as teaching tools.<br\/>A series of courses, seminars, and workshops on parallel computing and its<br\/>applications will extend the education to the undergraduate and graduate<br\/>levels at Purdue University.","title":"CAREER: Fast Methods for Particle Dynamics and Their Applications","awardID":"9875899","effectiveDate":"1999-02-15","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["540776"],"PO":["551992"]},"35581":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides for partial support for an OC-3c connection to the very high performance Backbone Network Service (vBNS) for the University of Georgia Research Foundation for two years. Applications involve distributed databases, remote astronomy, teleconferencing, distance learning, remote visualization, instrumentation, and image processing; telecollaboration in areas such as plant genomics research, molecular biology and whole plant physiology. Collaborating institutions include the U.S. Geological Survey, National Mapping Division, Argonne National Laboratory, Yale University, NASA, University of Houston, University of Illinois NCSA, Texas A&M and George Mason University.","title":"University of Georgia\/PeachNet High Performance Network","awardID":"9818185","effectiveDate":"1999-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[89471,"456561",89473],"PO":["198445"]},"36373":{"abstract":"9820348<br\/>Qu, Zhihua<br\/>University of Central Florida<br\/><br\/>CISE REU: Research Experience for Undergraduates in Process Automation and Device\/Circuit Designs for Semiconductor Manufacturing<br\/><br\/>This Research Experiences for Undergraduates (REU) Site project supports ten students per year in programs carried out during the summers for two years. The students work on projects involving process automation and device\/circuit designs including work in robotics, image processing, and micro-electronic circuits. The institution has strong cooperative plans with Bethune-Cookman College and also with Lucent and Harris corporations. Students for the REU program are recruited nationwide, but the program focuses on students from the University of Central Florida, Bethune-Cookman College and nearby community colleges. The REU students spend a part of their time at an industrial company, or at Oak Ridge National Laboratory, or in some cases at another nearby college. The students are advised and reviewed by a team consisting of PIs, internal specialists, and outside experts.","title":"Research Experience for Undergraduates in Process Automation and Device\/Circuit Designs for Semiconductor Manufacturing","awardID":"9820348","effectiveDate":"1999-02-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[91610,"545318","558080"],"PO":["329035"]},"37991":{"abstract":"This research involves the development of an experimental prototype of a quantum cryptographically protected communication system using two-photon entangled states of light, and a detailed theoretical study of the physical principles underlining the ultimate security of this technique. The exponentially growing flow of private and confidential data transmitted over telecommunication channels has brought with it the need for its protection to insure the security of sensitive information. Conventional encryption based on the mathematical complexity of factoring large numbers is still vulnerable to the intrusion of an unfriendly party in command of large computational power. Quantum cryptography was designed to address this issue by bringing to bear the power of the fundamental laws of quantum mechanics. <br\/><br\/>There are two major approaches in quantum crytography which, historically, appeared nearly simultaneously. One makes use of near single-photon states derived from coherent-state light. The other relies on the nonlocal character of two-photon entangled states generated in the nonlinear optical process of spontaneous parametric down conversion. A new scheme for quantum cryptography has been designed which overcome the limitations that have heretofore plagued the latter systems for use in cryptography, particularly the requirement for synchronous manipulation of two Mach-Zehnder interferometers that are well separated in space. This new approach is based on the use of a special polarization quantum intensity interferometer and utilized doubly entangled states generated by type-II spontaneous parametric down conversion.","title":"CAREER: Quantum Cryptography With Entangled Photons","awardID":"9873902","effectiveDate":"1999-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["545476"],"PO":["223414"]},"38442":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a OC-3 connection to the vBNS. Applications include data analysis, data storage, device control and monitoring, digital libraries, teleconferencing; distance learning and remote experimentation. Collaborating institutions include the Department of Energy's Thomas Jefferson National Accelerator Facility (Jefferson Lab), Continuous Electron Beam Accelerator Facility (CEBAF), Baptist Health Systems of South Florida, NASA, and the Air Force Research Lab.","title":"High Performance Connection for Florida International University","awardID":"9876409","effectiveDate":"1999-02-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[97596,97597,"558108","364451","560718"],"PO":["182196"]},"39454":{"abstract":"Ultra low power digital logic design can be achieved by operating transistors in the sub-threshold region. The device mimics and ideal constant current source for almost the whole VDS range. For serially connected transistors, the VDS drop on each transistor is negligible, which allows the implementation of large complex gates. The design in the sub-threshold region can be subdivided into device and circuit issues. At the device level, scaling issues are being investigated. At the circuit level, robustness, performance-power trade-offs and the applicability of circuit design based on various logic families (e.g. CMOS, Pseudo-NMOS, Source Coupled Logic, and Differential Current Switch Logic) are being studied. Several logic families are being designed to work specifically in the sub-threshold region. Comparisons with other low power design techniques, e.g. adiabatic Quasii-Static CMOS logic, are being made. Methods for noise analysis, including flicker and thermal noised, are being explored.","title":"Sub-Threshold Digital Logic","awardID":"9901152","effectiveDate":"1999-02-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["551012"],"PO":["321058"]},"39455":{"abstract":"This research investigates new, efficient, and highly optimized solutions to large-scale IC placement under tight timing constraints. The focus of this project is to investigate the feasibility of applying recently<br\/>developed numerical algorithms, such as the fast multipole method for large-scale particle simulation and the interior-point method for non-linear programming to solving the large-scale constrained circuit<br\/>placement problem. Key elements of studies in this project include (i) direct handling of timing and non-overlapping constraints in a mathematical programming formulation; (ii) an hierarchical model of the problem allowing smooth approximations to non-smooth and discrete constraints; (iii) fast multipole expansions to accelerate evaluation of the constraints and their derivatives; (iv) fast numerical solution to KKT-based systems of linear equations used to calculate search directions in the optimization.","title":"Nonlinear-Programming Based Algorithms for Constrained Circuit Placement","awardID":"9901153","effectiveDate":"1999-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["306467","558485",100097],"PO":["201974"]},"38444":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications involve biomedical optical tomography, multicast networks, parallelizing algorithms to biomedical optical tomography, multicast networks, parallelizing algorithms to estimate network performance, remote observations in Radio Astronomy; simulation of particle systems, protein sequence and structural diversity, and diagnostic telepathology. Collaborating institutions include San Diego Supercomputer Center, University of Massachusetts, Purdue University, Johns Hopkins University, Dartmouth College, University of Maine, University of Pittsburgh, University of New Hampshire, National Laboratories at Argonne and Livermore.","title":"The University of Vermont vBNS Connection","awardID":"9876415","effectiveDate":"1999-02-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[97606,97607,97608],"PO":["182196"]},"38445":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications involve telecollaboration, enhanced utilization of remote resources, and real-time interactions with remote experimental and computational resources. Scientific Collaborating institutions include University of California, Santa Cruz, Johns Hopkins University, University of Arizona, NOAO, Oberlin College, NASA-Lewis Research Center, UC Berkeley, Stanford University, and Fermilab.","title":"Linking CWRUnet to the vBNS","awardID":"9876418","effectiveDate":"1999-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[97610,"116853","179335","482273",97614],"PO":["198445"]},"38335":{"abstract":"9875945, Lillis, John<br\/>This project studies techniques for solving combinatorial optimization problems with an emphasis on problems from CAD\/VLSI. The approach is through developing a local search paradigm. In a local search algorithm a solution (for instance a standard cell placement) is iteratively improved by a sequence of moves or perturbations; the set of allowable moves defines the neighborhood structure of the algorithm (for example, pair-wise swapping in cell placement). This research studies classes of neighborhood operators with more expansive solution space coverage than traditional techniques. One such class is based on constraint relaxation. Operators with exponentially large neighborhoods are of particular interest. An orthogonal topic is the use of \"meta-heuristics\" in which a local-search engine can be viewed as a subroutine. Here we explore and evaluate experimentally more sophisticated techniques which attempt to focus on promising portions of the solution space. The research includes the archiving and analysis of known solutions to various optimization problems. Such known solutions are being studied via statistical and visualization techniques toward the end of finding superior optimization algorithms by better understanding of the nature of local optima of a particular problem. An in-depth study of the cell placement problem is being used as a testbed for these techniques.","title":"CAREER: Search Mechanisms for Combinatorial Optimization in CAD for VLSI","awardID":"9875945","effectiveDate":"1999-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[97363],"PO":["562984"]},"35552":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications involve remote sensing, water assessment, temperature mapping of Lake Superior, snow depth mapping, processing hyperspectral spacecraft data, simulation of internal condensing flows; computational analysis of DNA and protein sequences, remote modeling of large molecular systems, measurement of volcanic, seismic and petroleum data, obtaining \/developing crash location, roadsoft and continuous sky data. Collaborating institutions include University of Michigan, University of South Florida, Unversity of Alaska, National Oceanic and Atmospheric Administration (NOAA), Air Force Research lab, Lawrence Livermore Laboratory, Michigan Department of Transportation, and the Office of Highway Safety Planning.","title":"High Performance Connections to the Internet","awardID":"9818107","effectiveDate":"1999-02-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[89387,89388],"PO":["198445"]},"49314":{"abstract":"","title":"WORKSHOP: NSF Workshop on Large Scientific and Engineering Data Visualization to be held May 21-23, 1999 in Salt Lake City, Utah","awardID":"9996294","effectiveDate":"1999-02-16","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["496204","552243"],"PO":["179296"]},"38336":{"abstract":"Text-to-speech synthesis (TTS) technology has numerous uses in voice-based information retrieval, desktop computer interfaces, language training, and a host of other applications. However, TTS systems are not yet used in many appropriate applications because their output quality is not acceptable to the average user. Funding for investigation of speech synthesis techniques in the United States has dwindled over the past several years. This has led to a slowing of progress in synthesis, and a a limiting of the scope of all speech technology education. This work will impact the broader scope of interactive systems research by (i) developing new speech synthesis techniques that allow more natural-sounding speech synthesis, and (ii) supporting the training of new investigators with a unique mix of expertise in signal processing, statistical modeling, and linguistic sciences. Course curricula, exercises, and freely distributed software tools will be developed to aid in this educational innovation. Research on data-driven signal processing techniques will strive to improve the quality of current TTS algorithms. The results of this research will be evaluated at multiple levels, and will impact interactive systems research and education at multiple sites throughout the world, aided by their distribution in the CSLU Toolkit.","title":"CAREER: Data-Driven Speech Synthesis Research and Education","awardID":"9875950","effectiveDate":"1999-02-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["140250"],"PO":["565227"]},"40393":{"abstract":"IIS-9904078<br\/>Ryszard Michalski, George Mason University<br\/>$49,751 - 12 mos<br\/> <br\/><br\/>SGER: Learnable Evolution - Speeding up Evolutionary Computation by<br\/>Inductive Learning<br\/><br\/><br\/>In this exploratory research the PI will continue work on a new approach to evolutionary computation that he calls Learnable Evolution Model (LEM). In contrast to the Darwinian evolution model that underlies current methods of evolutionary computation, LEM involves an inductive learning process that seeks \"reasons\" why certain individuals in a population are superior to others in performing a designated class of tasks. These reasons, expressed as inductive hypotheses, are used to create a new generation of individuals at each step of an evolutionary learning process. <br\/>In an already completed pilot study, LEM has been compared to two standard genetic algorithms in solving different kinds of optimization problems. These problems have been widely used by the evolutionary computation community for testing genetic algorithms. In these experiments, LEM outperformed the genetic algorithms by a wide margin, frequently achieving a speed-up of two or three orders of magnitude. In some cases, LEM found the optimal solution, while genetic algorithms used in the study were still far away from it. <br\/>Under this award, the PI will conduct theoretical and experimental studies of the LEM approach, testing it on different types of problems, in particular, on very high dimensionality and noisy optimization problems, and system design problems. He will study its limitations, and determine ways of enhancing it by ideas and methods related to his prior work on constructive induction (developed under NSF support). The proposed research may potentially lead to major advances in the fields evolutionary computation and machine learning, which can be applied to a variety of areas including ultra-complex optimization problems, design of engineering systems, knowledge discovery in very large databases, and self-improving intelligent agents.","title":"SGER: Learnable Evolution: Speeding up Evolutionary Computation by Inductive Learning","awardID":"9904078","effectiveDate":"1999-02-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["355581"],"PO":["565227"]},"41042":{"abstract":"CCR-9906118<br\/>Selman<br\/><br\/>This award supports a workshop to develop and offer a perspective on research in theoretical computer science. This effort is in part a response to the President's Information Technology Advisory Committee (PITAC) Interim Report to the President. A panel of 15 leading theoreticians in several research areas will convene in Chicago on March 11 and 12. The result of the meeting will be a formal report.","title":"Workshop on Reserach in Theoretical Computer Science","awardID":"9906118","effectiveDate":"1999-02-15","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["214271"],"PO":["150516"]},"35663":{"abstract":"9818371<br\/>Vaidya, Nitin H.<br\/>Zhao, Wei<br\/>Texas Engineering Experiment Station<br\/><br\/>Wireless Networking and Collaborative Knowledge Building Research<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Adaptive Connection Management for Real-Time Applications over Wireless,<br\/>- Service Replication for Mobile Environments,<br\/>- Collaborative Knowledge Building through Incremental Formalization, and<br\/>- Data Transport and Routing in Mobile and Wireless Environments.<br\/><br\/>This award contributes to the purchase a protocol analyzer, a computerized whiteboard with projector, and laptops with wireless and global positioning system cards at the Department of Computer Science of Texas A&M University. This equipment facilitates research on several research projects in Computer and Information Science and Engineering, including, in particular, the aforementioned projects. The first project will provide adaptive QoS since the network conditions are likely to be time-varying. The second project will extend prior work on IP address and port-number-based-service replication in fixed networks to deal with mobility and higher application level service replication. The third project is a sense-making process<br\/>where information is discussed and manipulated until agreement is reached. It includes capturing emergent understandings and enabling incremental formalization, recognizing implicit structure within informally presented information, suggesting and automating formalization, aiding the development of shared languages, and improving understanding of knowledge building processes. The last project seeks to address packet losses due to wireless errors, hand-off, and route change in an end-to-end manner, rather than involving switches or routers, etc. These research projects are designed to advance the state of the art in areas related to wireless networking and collaborative knowledge building. The above equipment facilitates experimental evaluation and demonstration of ideas developed in the research projects.","title":"CISE Research Instrumentation: Wireless Networking and Collaborative Knowledge Building Research","awardID":"9818371","effectiveDate":"1999-02-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["553537","453727","467562","361104"],"PO":["301532"]},"35588":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications involve n-dimensional physics based visualizations, creation of a \"vision environment\" that includes medical imaging in support of image guided surgery, 3D virtual reality digital imaging and VRML development, molecular modeling for pharmaceuticals development, and distributed shared memory multi-computing in a wide-area networking environment. Other efforts include intelligent peptide library searching, materials research utilizing remote operation of instrumentation, and the study of general circulation of planetary atmospheric research. Collaborating institutions include: Cornell Theory Center, Harvard Medical School, Brigham Women's Hospital, NCSA at Urbana-Champaign, Oak-Ridge National Laboratory, University of Kentucky, J. B. Speed Art Museum, and the Lutz Microfabrication Laboratory.","title":"Creating a Kentucky vBNS GigaPOP","awardID":"9818204","effectiveDate":"1999-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["306771",89492,89493,89494,89495],"PO":["182196"]},"41396":{"abstract":"This award is to provide proposal processing and data entry support for the International Digital Libraries Collaborative Research Initiative","title":"Proposal Processing and Data Entry Support for the International Digital Libraries Collaborative Research Initiative","awardID":"9907093","effectiveDate":"1999-02-23","expirationDate":"1999-10-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["234671","126623"],"PO":["433760"]},"44465":{"abstract":"9971001<br\/>Novotny<br\/>This grant supports a workshop on \"Monte Carlo and Structure Optimization Methods for Biology, Chemistry and Physics\" to be held at Florida state University on March 28-30, 1998. The anticipated attendance will be about 100. One objective of the workshop is to exchange information about computational techniques which cut across various disciplines. The workshop is funded by the Directorate for Mathematical and Physical Sciences Office of Multidisciplinary Activities and the Divisions of Materials Research, Chemistry, Mathematical Sciences and Molecular and Cellular Biosciences.<br\/> <br\/>This grant supports a workshop on \"Monte Carlo and Structure Optimization Methods for Biology, Chemistry and Physics\" to be held at Florida state University on March 28-30, 1998. The anticipated attendance will be about 100. One objective of the workshop is to exchange information about computational techniques which cut across various disciplines. The workshop is funded by the Directorate for Mathematical and Physical Sciences Office of Multidisciplinary Activities and the Divisions of Materials Research, Chemistry, Mathematical Sciences and Molecular and Cellular Biosciences.","title":"Monte Carlo and Structure Optimization Methods for Biology, Chemistry, and Physics Workshop; Tallahassee, FL; March 28-30, 1999","awardID":"9971001","effectiveDate":"1999-02-15","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1144","name":"Biomolecular Dynam,Struc,Func"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1956","name":"STATISTICAL AND SIMULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":[113050,"480078","558250","197517"],"PO":["145396"]},"33158":{"abstract":"9811590<br\/>Kwasik<br\/>This award is a one-year renewal of an award to Professor Slawomir Kwasik and a graduate student of Tulane University to support collaboration in mathematics research with Professor Bjorn Jahren and others of the Department of Mathematics of the University of Oslo, Norway. The research studies the relationship between algebraic K-theory and pseudo-isotopy of manifolds, and applies new methods employing Waldhausen's A-theory to study various geometric questions concerning the topology of manifolds. The research is strengthened by the experience of Dr. Kwasik in the more geometric aspects of pseudo-isotopy theory but relies primarily on the expertise and new approach developed by Professor Jahren. There is still a great deal of interest in research in the above areas. Significant progress has already been made in the algebraic aspects of these theories, but work is still new on the geometrical side. Indeed the strongest centers pursuing this research are in Northern Europe, and the proposed collaboration with a Norwegian group will provide access to the latest research developments for Dr. Kwasik as he continues to strengthen the research with his Norwegian counterpart. Dr. Kwasik and his collaborator have made strong progress on the original research goals, and will be able to complete those goals with the additional year's funding.","title":"U.S.-Norway Cooperative Research: Algebraic K-theory and Pseudo-isotopies","awardID":"9811590","effectiveDate":"1999-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1267","name":"TOPOLOGY"}}],"PIcoPI":["424223"],"PO":["290800"]},"38438":{"abstract":"This award is made under the high performance connections portion of ANIR's<br\/>\"Connections to the Internet\" announcement, NSF 98-102. Researchers at the<br\/>University of Arkansas at Little Rock (UALR) and the University of Arkansas<br\/>for Medical Sciences (UAMS), in collaboration with the University of<br\/>Arkansas at Fayetteville (UAF), have formed a consortium, ARKnet2. <br\/>ARKnet2 is to make available high bandwidth communication resources and<br\/>will develop an interstate high bandwidth connections network for<br\/>university researchers, which will have connections to a national high<br\/>bandwidth network.<br\/><br\/>The Arkansas Consortium plans to build a ATM-based ARKnet2 backbone from<br\/>Little Rock to Fayetteville. Arkansas is a member of the Great Plains<br\/>Network (GPN), which will share resources among six states that are all<br\/>qualified for EPSCoR funding. The GPN will connect ARKnet2 to its gigaPOP<br\/>in Kansas City and will provide access to the vBNS and federal agency<br\/>networks.<br\/><br\/>Research supported by the resulting network access includes: seismic<br\/>analysis, nanodimensional molecular device modeling, combustion analysis<br\/>and computational fluid dynamics, microscopy and biotechnology advances,<br\/>fetal magnetoencephalography, and studies of physiological effects of<br\/>microgravity. Collaborations will involve facilities and universities<br\/>including: NASA Johnson Space Center, University of Florida, University of<br\/>Tennessee, Old Dominion University, Yale, Louisiana State University,<br\/>Temple University, and Argonne National Laboratory.","title":"Connections to the Internet","awardID":"9876400","effectiveDate":"1999-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[97581,97582,97583,97584,97585],"PO":["182196"]},"49229":{"abstract":"","title":"Design of User Codes and Low-Complexity CDMA Receivers for MUI Elimination in Unknown Multipath","awardID":"9996208","effectiveDate":"1999-02-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["564051"],"PO":["150411"]},"35633":{"abstract":"9818305<br\/>Abowd, Gregory D.<br\/>Atkeson, Christopher<br\/>Georgia Institute of Technology<br\/><br\/>Augmenting the Capture and Understanding of Everyday Experiences<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Ubiquitous Computing: The Capture, Integration, and Access Problem,<br\/>- Automated Understanding of Captures Experience,<br\/>- Automated Capture of Software Architectural Rationale, and<br\/>- Command Post of the Future.<br\/><br\/>To support the aforementioned projects, this award contributes to outfit a classroom and a meeting room, providing embedded capture work surfaces, at the College of Computing in Georgia Institute of Technology. The classroom will have seats, containing power and network distribution, equipped with a pen-based annotation surface; the meeting room will contain large electronic whiteboard surfaces, both upright and horizontal, providing group-level interaction. The annotation system consist of a high-resolution video tablet from Mutoh, driven by a PC\/104+ embedded computer attached to the student\/meeting table. This project provides infrastructure for interactive pen-based computing equipment which is dedicated to support research in computer and information science and engineering in the area of capture and retrieval of everyday experiences. The research projects respectively include: augmenting the capture of university lectures to<br\/>include student note-taking and collaboration, in which lecture experiences are preserved and made available for later review; automated understanding of capture experiences, in which computational perception and machine learning techniques are applied to interpret the semantics behind captured activities in different domains; automated capture of software architectural rationale, in which an interactive whiteboard provides a more natural surface for creating and capturing software design discussion about the high-level organization of complex software systems; and strategic meeting room tools, in which integrated large format interactive surfaces allow for the capture and dissemination of informal and strategic information.","title":"CISE Research Instrumentation: Augmenting the Capture and Understanding of Everyday Experiences","awardID":"9818305","effectiveDate":"1999-02-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["439404","438708","564690","235460","563803","397849","508256","506686","517810","538206"],"PO":["301532"]},"35523":{"abstract":"The IEEE INFOCOM Conference Computer Communications will be held in New York, New York, during March 21-25,1999. This preeminent technical conference is the primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of paramount importance for the development of graduate students, post-doctoral researchers, and faculty members. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field. This proposal requests funding to aid approximate twelve gradute students, post-docs, and junior faculty in the United States in attending this premiere conference.","title":"Travel Support for IEEE INFOCOM'99 Conference","awardID":"9818030","effectiveDate":"1999-02-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["531675"],"PO":["150490"]},"35689":{"abstract":"9818414<br\/>Dietterich, Thomas G.<br\/>Rudd, Walter G.<br\/>Oregon State University<br\/><br\/>Instrumentation for Research in Machine Learning, Molecular Dynamics, Probabilistic Reasoning, and Software Maintenance<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Experimental Machine Learning Research,<br\/>- Accelerating Simulations in the Time Dimension,<br\/>- Probabilistic Methods in Dynamic Environments, and <br\/>- Experimentation with Program-Analysis-Based Systems Maintenance and Testing Techniques.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of dual-processor Pentium II computers and associated networking hardware by the Department of Computer Science at Oregon State University. The equipment will support experimental research on four projects. In the first project, machine learning tools will be developed for complex problems such as image analysis and language processing. These tools will help solve related problems faster and with higher accuracy. The second project concentrates in developing faster algorithms for complex particle simulations. These algorithms will make it possible to understand and predict the behavior of chemical compounds in manufacturing (e.g., adhesives, aircraft parts) and environmental cleanup (e.g. contaminant flow in soils). The third project studies improved techniques for reasoning under uncertainty. These techniques allow building faster and more accurate systems for real-time diagnosis and repair of complex systems such as automobiles, spacecraft, and factories. The last project concentrates in developing and applying new methods and tools for program analysis to improve the testing and maintenance of complex software systems. These tools are expected to reduce the cost and improve the reliability of new and existing software systems.","title":"CISE Research Instrumentation: Instrumentation for Experimental Research in Machine Learning, Molecular Dynamics, Probabilistic Reasoning, and Software Maintenance","awardID":"9818414","effectiveDate":"1999-02-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[89798,"554550","237846","548132"],"PO":["301532"]},"37779":{"abstract":"This project is developing a mathematical framework based on Renormalization Group (RG) theory that is capable of predicting the geometrical structure of very densely wired and optimized networks without recourse to empirical fitting parameters. The power of the RG technique is that it is not a descriptive theory but rather a general method for constructing theories. It is therefore capable of analyzing a wide range of interconnect analysis problems ranging from wire placement to cross-talk. It succeeds by successively renormalizing wire arrangements, reducing a strongly coupled, multiple-length scale problem to a large number of much simpler single-length scale problems. The research activities being carried out under this grant include: (a) the identification of so-called critical points in the design parameters of processing chips which indicate a transition from easily scaleable designs to unscaleable designs, (b) the development of algorithms to move these critical points to positions which make previously unscaleable designs scaleable, (c) to relate the theory of optimized interconnect geometries to the more general and universal physics of critical point systems which include magnets, boiling water, and percolation.","title":"Statistical Analysis of Interconnect-Limited Systems II","awardID":"9872159","effectiveDate":"1999-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[95901,"484866"],"PO":["562984"]},"40244":{"abstract":"This workshop is intended to bring together a group of research scientists, educators, and students to present and discuss research topics on the fundamental theoretical aspects of detection, estimation, and classification and emerging application areas in which further theoretical results are needed. The most prominent area in which these further theoretical results are needed is in imaging.","title":"1999 IEEE Information Theory Workshop on Detection, Estimation, Classification, and Imaging, February 24-26, l999, in Santa Fe, New Mexico","awardID":"9903565","effectiveDate":"1999-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[101955],"PO":["150411"]},"35635":{"abstract":"9818309<br\/>Bieber, Michael P.<br\/>Fjermestad, Jerry<br\/>New Jersey Institute of Technology<br\/><br\/>Collaborative Hypermedia<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Automatically Supplementing Computer Applications with Hypermedia,<br\/>- Studies of Distributed Multimedia Support for Group Collaboration,<br\/>- Virtual Classroom Leading to a Virtual University, and<br\/>- Collaborative Knowledge Networking.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of multimedia development and group support environments and experimentation workstations, an NT server, notebook portable computers for demonstrations projectors, authoring devices and software, for building the instrumentation infrastructure for conducting the necessary experimental research cited above at New Jersey Institute of Technology, Schools of Computer Science and Liberal Arts and School of Management. The first project will develop a hypermedia engine to automatically generate hypermedia links and navigation. This approach contributes especially by serving systems which dynamically generate their display contents, the most<br\/>common case in business and engineering analysis applications. The second project will develop theory, tools and techniques for distributed decision support utilizing the World Wide Web. This project is an integrated program of theory building, software tool development and assessment, and empirical studies (both controlled experiments and field studies). The third project extends the existing Virtual Classroom program to produce a \"Virtual University.\" Research components include semi-structured interviews with faculty and selected students, and field experiments to isolate the influence of specific factors on outcomes. The last project will develop a set of powerful tools designed to support learning communities. The tools will be pilot tested with classes of graduate students, refined, and assessed further through field trials with professional societies and other scholarly communities. The equipment will create a development lab and two<br\/>experimentation labs for these projects.","title":"CISE Research Instrumentation: Collaborative Hypermedia","awardID":"9818309","effectiveDate":"1999-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["352199","90408","260669",89626,89627],"PO":["301532"]},"35627":{"abstract":"9818287<br\/>Hodgins, Jessica K.<br\/>Atkeson, Christopher G.<br\/>Georgia Institute of Technology<br\/><br\/>CISE Research Instrumentation: Data-Driven Modeling for Real-time Interaction and Animation<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Perception of Action<br\/>- Learning from Demonstration<br\/>- Animating with Experimentally Determined Parameters, and<br\/>- Modeling Facial Expressions<br\/><br\/>To support the aforementioned projects, for the capture, modeling, recognition, and generation of human motion, this award contributes to the purchase of motion capture equipment, graphics workstations, and digital cameras at College of Computing in Georgia Institute of Technology. The equipment will be used for several projects aimed at making it easy to create, control, and interact with artificial humans in interactive<br\/>environments for training and entertainment. The cameras and motion capture equipment will capture full body and facial motion of the users. The processing power of the graphics workstations and other available<br\/>multi-processors will be used to create data-driven models for recognition and generation of human actions ranging from full body motions such as a tennis swing to subtle facial expressions. The power of this technology will be demonstrated by constructing interactive environments in which the cameras and motion capture equipment will be used for on-line recognition of user actions and the graphics workstation will be used to animate human figures in real-time, based on the models derived off-line. The prototype applications will be environments where interactivity and realism are key, such as training environments for physical tasks and animation of highly interactive and responsive characters.","title":"CISE Research Instrumentation: Data-Driven Modeling for Real-Time Interaction and Animation","awardID":"9818287","effectiveDate":"1999-02-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["438708","438709","508256"],"PO":["301532"]},"41217":{"abstract":"IIS-9906603<br\/>Steinheiser, Rick<br\/>Central Intelligence Agency<br\/>$33,451 4 mos<br\/><br\/>This award is for an interagency reimbursable detail for Rick Steinheiser to participate in Division-wide discussions and planning activities on the subject of database management and other programmatic issues.","title":"Interagency Reimbursable Detail: Program Director for the Information and Database Management Program","awardID":"9906603","effectiveDate":"1999-02-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"0119","name":"REIMBURSABLE DETAIL"}}],"PIcoPI":[104342],"PO":["183208"]}}