{"6710":{"abstract":"CDA-9529470 Hanson, Eric N. Johnson, Ted Su, Stanley University of Florida Gainesville, FL CISE Instrumentation: Research in Parallel and Shared-nothing Database and Storage Systems The University of Florida Computer and Information Science and Engineering (CISE) department is undertaking the following three research efforts: (1) a project investigating the use of shared-nothing multiprocessors for fast rule processing in active database systems using a partitioned, parallelized discrimination network, (2) a project to develop and evaluate parallel techniques and algorithms for object-oriented knowledge-base management systems to support data partitioning and distribution, query processing, query optimization and knowledge rule processing using a network-of-workstations (NOW) environment, and (3) a project to develop high performance storage servers to allow storage and processing of data generated by high energy physics experiments. All of these projects are experimental in nature, and involve implementing parallel software prototypes. This experimentation is essential to help validate design proposals and get feedback on the designs to help refine and improve them. The research instrumentation, consisting of four new high-speed workstations and a very-high-speed communication network, allows the construction of a parallel processor to conduct the work described.","title":"CISE Research Instrumentation: Research in Parallel and Shared-nothing Database and Storage Systems","awardID":"9529470","effectiveDate":"1996-02-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["44883","289580","92125"],"PO":["557609"]},"6732":{"abstract":"CDA - 9529549 Fischer, Gerhard Arias, Ernesto Eden, Hal University of Colorado at Boulder Shared Interaction in Support of Design, Learning, and Planning Two InterSim (Interactive Simulation) stations are being developed, each composed of a large interactive surface and multiple 3-D interactors. These systems allow us to move beyond the interaction model of single user\/single computer--with an emphasis upon shared interaction to mediate social aspects of learning, design, and planning. These paradigms integrate the use of physical objects--to support and encourage face-to-face interaction among the participants--with virtual objects--to provide computational support for the model underlying the simulation. When linked across a network, these systems can allow the interaction with simulations and among individuals at a distance. A two-phase prototyping process is being used: First, an initial version utilizing front-surface projection is being developed, allowing us to deal with some of the software and device-controller issues and demonstrating the applicability of the approach. Subsequent development will utilize newer technology to create a back-imaged system to resolve shadowing problems. To test and guide its development, applications of the technology are underway in the form parallel efforts in the areas of Conflict Resolution, Decision Making and Planning; Learning by Design: Cross-Cultural Science Classroom Interchange; and Human-Centered, Intelligent Agents Supporting Communication and Collaboration.","title":"CISE Research Instrumentation: Shared Interaction in Support of Design, Learning and Planning","awardID":"9529549","effectiveDate":"1996-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[16526,"483372","483373"],"PO":["301532"]},"6711":{"abstract":"CDA 95-29304 Kaiser, Gail E. Duchamp, Daniel J. Columbia University Semantics-based Prefetching for Mobile Computing This proposal investigates collaborative workflow environments, and previously constructed an infrastructure that assumes conventional high-speed networking. Professor Kaiser is developing new algorithms and techniques to support mobile hosts. The research addresses prefetching based on semantic information on what the user is likely to do next drawn from the workflow definition tailoring the specific environment instance, to permit low-bandwidth and temporarily detached operation by participants in collaborative enterprises. Professor Duchamp is developing operating system support for intelligently prefetching files from a file system or objects from an objectbase. The goal is to improve performance and automate cache loading prior to disconnecting from the network, via two types of prefetching: The first is performed by the file system, transparent to applications; the file system ``learns'' file access patterns and uses these patterns to prefetch if\/when the patterns recur. The second type of prefetching is application-directed; applications with knowledge of their future data accesses can use a special interface to instruct the operating system what to prefetch. Professor Kaiser's workflow system is the major example application for this type of prefetching. Both the collaborative work and operating systems directions require mobile notebook computers for development, testing, and measurement of the prototype support.","title":"CISE Research Instrumentation: High Performance Computing Environment for Symbolic Synthesis and Verification","awardID":"9529471","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["113182","468664","518587"],"PO":["557609"]},"5314":{"abstract":"The integration of electronic and photonic devices on the same chip offers performance advantages in terms of speed, bandwidth, immunity to interference, power dissipation and interconnection density. This research explores algorithms and tools for simulation of optoelectronic Integrated Circuit (OEIC) designs. The goal is to simulate equally accurately both optical and electronic devices in the same circuit. Both lumped and distributed-constant elements are included in the model. Existing models for optoelectronic devices such as light emitters, detectors, and electro-optic modulators are being refined and incorporated in the simulator. New models are being developed for optical interconnect and for those optoelectronic devices for which no models suitable for time-for domain simulation currently exist. A simulation environment, capable of handling circuits with optical and electronic devices is being constructed.","title":"Computer-Aided Simulation of Optoelectronic Integrated Circuits","awardID":"9523436","effectiveDate":"1996-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["470917"],"PO":["321058"]},"5436":{"abstract":"A comprehensive information-theoretic study of the capacity of communication channels where information is transmitted via timing is undertaken. Communication channels that lend themselves to this study include: queueing systems, random transit channels, protocol information, covert channels, time-jitter storage channels, intracomputer communications subject to timing uncertainties. The study of the capacity of the above models may be relevant in stochastic discrete-event systems outside the realm of communications. Among the random phenomena that blur timing information, queueing is one of the most important practically and theoretically. Queues are the basic modeling blocks of data communication networks, so finding their Shannon capacity is a problem for which there is ample motivation. Very recent results by Anantharam and Verdu for the single-server queue have shown considerable promise, and the Shannon theoretic study of queueing systems plays a central role in this project. In these problems, information is encoded in the times of arrival of packets to the queueing system (in addition to the contents of those packets), and the receiver observes the times of departure of the packets from the queueing system. The common theme of the foregoing channel models is communication via discrete-events in continuous time. In most of these cases, finding the capacity of those channels is far from elementary because information theoretic challenges such as infinite memory, non-additive noise, feedback, non-standard input constraints, nonlinear input-output dependencies are often present. Source coding problems such as the rate distortion function of the Poisson process and communication via observed Markov processes are also under the purview of this project. In those problems, exponentially distributed times play a central role, for which the rich information theoretic structure of Gaussian problems finds a novel counterpart. The tools required in this study are drawn fr om probability, random processes and optimization; specifically from information theory, queueing theory, Markov processes, and data communication networks.","title":"Information Theory of Timing Channels","awardID":"9523805","effectiveDate":"1996-02-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["550344"],"PO":["150411"]},"5469":{"abstract":"9523969 Stuber The proposed research will develop new algorithms for fast link quality evaluation and new algorithms for distributed link control in microcellular mobile telephone systems. Link quality evaluation and control are essential elements of any cellular system. However, future microcellular systems will be characterized by large numbers mobile customers, and many (sometimes rapid) cell boundary crossings. Limitations on the speed of link monitoring and control essentially determine the overall link quality, the cell sizes, and the ability of the cellular system to react to traffic variations. These factors in turn determine the spectral efficiency and grade of service. As a result, fast link quality evaluation and distributed link control will be essential for the successful deployment of microcellular telephone systems. The approaches to be employed in the study involve a mixture of theoretical work in propagation modeling, signal processing, teletraffic modeling, stochastic processes, and control theory, as well as computation and simulation on workstations. A software simulation capability in presently available at Georgia Tech that uses either recorded strips of actual channel measurements or various theoretical and empirical models. ***","title":"Cellular Architectures and Resource Management","awardID":"9523969","effectiveDate":"1996-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["343207",13375],"PO":["150490"]},"6206":{"abstract":"IRI-9527926 Wolfe, Michael Oregon Graduate Institute $22,000 - 12 mos. Support for International Travel to Workshop on Loop Parallelization The International Workshop on Loop Parallelization, being held in April 1966 in Wadern, Germany, has as its purpose bringing together two research communities which are both working on Loop Parallelization, but applying differing models and criteria. One of these communities has concentrated on parallelizing compilers for sequential loops, pragmatically developing heuristic methods that may work at high speed for a variety of loops, but are not provably optimal, while the other community works on regular array design, identifying optimal parallelizations for highly regular loop nests. The purpose of the Workshop is to get the groups working together on a variety of common problems. Researchers from the USA, Europe, and Japan are going to be present. This grant will guarantee a strong representation of American scientists from the two relevant communities working on this important aspect of parallel computation.","title":"Travel Support for US Participants at an International Workshop - April 15-19, 1996","awardID":"9527926","effectiveDate":"1996-02-01","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["29295"],"PO":["54008"]},"6724":{"abstract":"CDA-9529530 Cohen, Elaine Drake, Samuel H. Henderson, Thomas C. Riesenfeld, Richard F. University of Utah Layered Manufacturing Machine in Support of Rapid Prototyping and Unmanned Manufacturing A rapid prototyping machine, Helisys, supports research in computer and information science and engineering, particularly in following projects: (1) Science and Technology Center for Computer Graphics and Scientific Visualization, (2) Concurrent Integrated Design and Manufacturing, (3) Rapid Virtual Prototyping of Mechanical Assemblies, and (4) Sensing Strategies for Advanced Manufacturing. The machine is a Laminated Object Manufacturing (LOM) System which is used to generate visualization models, to help in verification of reconstructed models, and to support a variety of casting operations and other secondary manufacturing operations including vacuum forming and silicon rubber molding. The LOM process in the Advanced Manufacturing Laboratory is used primarily for research in manufacturing and to produce prototype parts for other research programs. The process is also used to offer a variety of experimental manufacturing services over the network. The educational use of rapid prototyping provides strong visualization feedback in solid modeling and shape understanding for undergraduate and graduate level courses as well as for high school students selected from the state of Utah under a National Science Foundation Young Scholars Program.","title":"CISE Research Instrumentation: Layered Manufacturing Machine in Support of Rapid Prototyping and Unmanned Manufacturing","awardID":"9529530","effectiveDate":"1996-02-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[16500,"293059","486565","429182"],"PO":["557609"]},"4965":{"abstract":"The project focuses on the following crucial areas of large-scale computing and communication, all of which revolve around issues of Input\/Output (I\/O) communication and locality: (a) External memory and I\/O performance: The relative bottleneck in many large scale applications is the I\/O communication between main memory, and external memory and\/or other levels of memory. The goal is to develop an understanding of the limits of I\/O systems and to construct external-memory algorithms that are simultaneously optimal in terms of internal computation and I\/O. (b) TPIE: a Transparent Parallel I\/O programming Environment: A system called TPIE is proposed, consisting of an easy-to-use object-oriented interface linked to powerful disk and memory management primitives, to facilitate implementation and evaluation of external- memory algorithms. (c) Prediction and applications to caching: By contrast, the problem of cache replacement involves designing an utility (which can be part of an operating system) to manage the cache memory so that the data requested during the application algorithm are most often local in the cache, thus avoiding costly page fetches. ***","title":"Efficent I\/O Communication for High-Performance Computing","awardID":"9522047","effectiveDate":"1996-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["313394"],"PO":["150516"]},"6803":{"abstract":"CDA 9529766 Khoshgoftaar, Taghi M. Ganesan, Krishnamurthy Florida Atlantic University Empirical Software Engineering Laboratory for Research in Software Engineering The proposed Empirical Software Engineering Laboratory supports following research projects in software engineering. (1) Modeling of Software Quality Using Artificial Neural Networks for improving the accuracy of software quality models by conducting case studies exploring neural network architectures and training algorithms. (2) Measurement and Validation of Software Testability for characterizing relationships between testability and static software metrics, and for determining whether or not testability measurement can enhance software reliability prediction. Case studies to address these issues empirically are used. (3) Fuzzy Case-Based Reasoning for identifying fuzzy case-based methods for software quality prediction by developing prototype systems using industrial case study data. These research projects are making significant contributions by characterizing ways that people actually develop software by using data on large systems from industrial partners which have professional development organizations. The equipment includes five high performance engineering workstations that are significantly faster than others that are available. Purchased software includes measurement and modeling tools that are specifically applicable to the projects. Thus, the hardware and software of the Empirical Software Engineering Laboratory are critical to the above research projects.","title":"CISE Research Instrumentation: Empirical Software Engineering Laboratory for Research in Software Engineering","awardID":"9529766","effectiveDate":"1996-02-15","expirationDate":"1998-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[16696,"112972"],"PO":["297837"]},"6715":{"abstract":"CDA-9529499 Bajaj, Chandrajit L. Sacks, Elisha Hillberry, Ben M. Purdue University Repetitive Contact Modeling, Analysis and Visualization The 3D motion and position measurement system coupled to a high performance graphics workstation is used to model, analyze and visualize the effects of repetitive contact on human joints. It is part of a high performance computational environment for research on human joints and problems caused by repetitive strain. The motion and position measuring system measures and tracks the movement of light emitting diodes mounted on a body with an RMS accuracy of 0.1 mm and a resolution of 0.01 mm. This system enables the measurement of the kinematics of knees and for determining the kinematics in the hand during typing and piano playing activities. The system also has a probe with light emitting diodes that enable the establishment of landmarks and coordinate reference points on bones as well as mapping surface geometries of the joint surfaces. The high performance graphics permit real-time, interactive visualization and querying of geometric models and stress\/strain analyses. The potential payoffs of the research are in clinical diagnostics, surgical techniques and preparation, prosthesis design.","title":"CISE Research Instrumentation: Repetitive Contract Modeling, Analysis & Visualization","awardID":"9529499","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[16471,"517319","402028"],"PO":["557609"]},"2876":{"abstract":"The goal of this research is to develop a set of tools and techniques for performance analysis and tuning of parallel programs that bridges this gap between measurement and modeling, and theory and practice. The approach to performance measurement and modeling is called \"lost cycles analysis\", and is based on the observation that the distinction between productive computation and parallel overhead is useful both for performance diagnosis and for performance prediction. This approach decomposes all parallel overhead into mutually-exclusive, yet comprehensive categories (such as load imbalance and communication overhead), each of which can be measured and modeled separately. These categories express overheads in common units, called \"lost cycles\", and together represent the portion of the total execution time not devoted to useful computation. This research effort's goal is to build a lost cycles toolkit, integrating empirical model-building techniques from statistics with the measurement and modeling techniques of lost cycles analysis to generate accurate models of application performance. The toolkit will use a priori knowledge of the sources and characteristics of overhead in parallel systems to guide and constrain the modeling process. It will incorporate techniques for optimum experimental design into an experiment generation tool that will generate a \"script\" of representative program executions. During these executions it will use a measurement tool to record the lost cycles for each overhead category as a function of the variables of interest (including, but not limited to, the number of processors and the problem size). It will use the measurement results obtained from the executions to select from a database of standard models for overhead categories. In addition, it will use a tool for fitting models of overhead categories to experimental data to establish the constants associated with a particular hardware and software system. By automating perfo rmance modeling as much as possible, this effort intends to make lost cycles analysis practical for everyday use by parallel programmers. ***","title":"Measurement and Prediction of Parallel Program Performance","awardID":"9510173","effectiveDate":"1996-02-01","expirationDate":"1999-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[6746],"PO":["250083"]},"19031":{"abstract":"","title":"RIA: Cyclides as Blending Surfaces in Geometric Modeling","awardID":"9696084","effectiveDate":"1996-02-15","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550367"],"PO":["187585"]},"6717":{"abstract":"CDA-9529509 Taylor, Russell H. Wolff, Lawrence B. The Johns Hopkins University Baltimore, Maryland Instrumentation for Computer Science and Engineering Research in Image Segmentation, Registration, Modeling, and Interactive Model-based Task Optimization A computation server and visualization workstation are provided for a new laboratory in Computer Science Department at The Johns Hopkins University for interdisciplinary research in robotics, image-processing, computer vision, modeling, and computer-integrated surgery. Specific research projects include: (a) segmentation, modeling, and characterization of complex tubular structures such as blood vessels and bronchial trees from 3D tomographic images; (b) accurate vision-based camera-to-model registration and navigation within modeled 3D structures; and (c) development of methods for combining numerical optimization, geometric modeling, path planning and uncertainty analysis, and interactive visualizations to help a human expert plan a complex 3D task for robotically-assisted execution. This research combines numerically intensive computation on 2D and 3D images and models with interactive visualization of models and intermediate computational results, using examples from biomedical modeling, using problems in biomedical imaging, endoscopy, and radiation therapy planning to provide motivation and focus. The provided equipment significantly promotes this research by permitting realistic experimental evaluation on full-scale image data sets and models of novel algorithms and methods in computer vision, modeling, computational steering, and human-machine partnerships.","title":"Instrumentation For Computer Science & Engineering Research in Image Segmentation, Registration, Modelling and Interactive Model-Based Task Optimization","awardID":"9529509","effectiveDate":"1996-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["207142","553223"],"PO":["301532"]},"19054":{"abstract":"","title":"Deformable Templates for Face Description, Recognition, Interpretation, and Learning","awardID":"9696107","effectiveDate":"1996-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["549461"],"PO":["183208"]},"6729":{"abstract":"CDA-9529541 Psarris, Kleanthis Das, Samir, R. Boppana, Rajendra, V. The University of Texas at San Antonio Research in Parallel Computer Systems Design using Workstation Clusters with High-Speed Networks This award is for the acquisition of a cluster of four multiprocessor workstations to support several research projects, including the research on the design of architectures and compilers for distributed shared memory multiprocessors and on large-scale applications such as the design and implementation of parallel discrete event simulators. The proposed instrumentation provides a multi-granular parallel and distributed computing platform, where both tightly-coupled and loosely-coupled systems coexist. It interconnects four Sun workstations with an SCI (scalable coherent interface) based high-speed network. The SCI interconnect will provide low-latency message passing and shared memory support. The SUN workstations with Solaris OS support threads and high precision clocks. The low-latency inter-workstation communication and threads will be used to implement parallel architecture simulators and parallel discrete event simulators. Precise clocks will be used to extract message communication and shared memory traces from applications. These traces in turn will be used to evaluate the new architectural mechanisms through simulations. The shared memory support provided by the interconnect will be used to run the parallel code generated by a parallelizing compiler. Several benchmark applications will be compiled and run on the equipment to evaluate the effectiveness of various dependence analysis techniques.","title":"CISE Research Instrumentation: Research in Parallel Computer System Design using Workstation Clusters with High-Speed Networks","awardID":"9529541","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["297663","525789","563568"],"PO":["557609"]},"2835":{"abstract":"This project continues and expands the research in the design, development, and implementation of techniques for enhancing the power and performance of equational systems. The three key areas for this research effort are rewrite operations, equational programming, and equational deduction, though the results will likely also be applicable to other areas such as (constraint) logic programming. Research on rewrite operations will focus on variants of pattern matching algorithms that are specifically tailored to lazy evaluation strategies for functional programming and to build the semantics of certain functions into the matching algorithms for equational deduction. The investigations in equational deduction will center on the PI's recently proposed basic completion method, in which no inferences are applied at those subexpressions in formulas that are built up from substitutions generated in previous inference steps. The equational programming component of the proposal will focus on the further development of Equals --- a fast parallel implementation of a lazy language and the Integral system which uses symbolic constraint solving techniques to glue together program analyses across different paradigms. ***","title":"Enhancing the Power and Performance of Equational Systems","awardID":"9510072","effectiveDate":"1996-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["100902","518366","550275"],"PO":["187585"]},"6719":{"abstract":"CDA-9529518 Kearney, Joseph K. Cremer, James F. Kuhl, Jon Portra, Florian University of Iowa Instrumentation for Virtual Environments Integrating Dynamics and Real-Time Interactivity The equipment for high-speed computation and real-time image generation is used for a coordinated set of research projects attacking the computational requirements of interactive, real-time simulation with rich physical and behavioral interactions. The research focuses on four related areas: (1) Merging geometric analysis, dynamic analysis, and control programming for interactive, real-time multibody simulation; (2) Numerical methods for fast, accurate solution and integration of motion equations; (3) Scenario authoring and behavior modeling for semiautonomous agents; and (4) Distributed, real-time systems. building on existing facilities, the instrumentation provides a combination of compute power, graphics power, interaction hardware, and workstations to support real-time simulation and virtual environments research.","title":"CISE Research Instrumentation: Instrumentation for Virtual Environments Integrating Dynamics and Real-Time Interactivity","awardID":"9529518","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["543444","543446","313706","439675","547027"],"PO":["557609"]},"6709":{"abstract":"CDA-9529463 Peshkin, Michael A. Mirkovic, Srdjan Northwestern University Robot for Human Workspace The requested equipment of computer hardware and software for real-time control of robotics systems is used in furtherance of research in computer and information science and engineering in the departments of Mechanical Engineering and Electrical and Computer Engineering. The real time control and computation system is associated with the robot requested under this proposal and other robots in several closely related projects. Specific research tasks are as follows. (1) Research and development of robot-assisted surgical systems. Most immediately, a system for directing linear insertions, such as biopsies and orthopedic pins, under fluoroscopic imaging. These systems require fast dedicated computers for control, and a 6-axis force sensor to facilitate interaction with a surgeon. (2) Research and development of assertive devices to be used in the final assembly of automobiles and light trucks, with General Motors. This project requires a considerable amount of high-speed real-time digital signal processing hardware, and associated software.","title":"CISE Research Instrumentation: Robot for Human Workspace","awardID":"9529463","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[16452,"541975"],"PO":["557609"]},"15887":{"abstract":"The second international workshop on computational differentiation will be held on February 12-15, l996 in Santa Fe, New Mexico. It is being conducted by SIAM with the cooperation of the special interest group on numerical computing (SIGNUM) of the Association of Computing Machinery (ACM). The workshop is intended to bring together researchers and students working on constructive and accurate methods for differentiation and their applications. The workshop attendees will discuss recent advances in theory, implementation, and application of computational differentiation. The resulting close interaction between developers of tools and their users in applied mathematics, computation, science, and engineering will accelerate progress. The researchers and developers will be able to focus their efforts on the major issues and users will have a view of what is currently being developed. ***","title":"SIAM Workshop on Computational Differentiation Feb. 12-15, l996, Santa Fe, New Mexico","awardID":"9627456","effectiveDate":"1996-02-01","expirationDate":"1996-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["563333"],"PO":["187585"]},"6051":{"abstract":"This research is on algorithmic approaches to VLSI, and four problems are being investigated. These are: 1. Literal minimization in logic synthesis using an approach based on term intersection graphs. 2. Gate level placement problems using minimum floating Steiner trees. 3. Budget assignment in timing driven placement in which a novel optimization tool is being explored. 4. Clock tree design using a gated design which minimizes activity, hence power consumption. A coherent design system, incorporating above stages, is being developed.","title":"Algorithm Design for VLSI Layout","awardID":"9527389","effectiveDate":"1996-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["547185"],"PO":["321058"]},"15835":{"abstract":"CDA-9627275 Wegner, Peter Brown University Special Project: Research directions in computing This grant provides partial support for an invitation-only workshop on \"Research Directions in Computing\", developed by the ACM as a part of its 50th- anniversary year celebration. Goals of the workshop are to contribute to a better understanding of computing research and its role in support of larger economic and social issues. The workshop will examine the current status and future directions of computing research, will involve approximately 100 participants, and will produce a set of working group reports. Its findings will be made public through the working group reports, publications in major ACM journals, and at least one panel at ACM '97. ***","title":"Special Project: Research Directions in Computing","awardID":"9627275","effectiveDate":"1996-02-01","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":[39930],"PO":["564412"]},"6691":{"abstract":"CDA-9529403 Chen, Marina Bestrides, Azer Heddaya, Abdelsalam Boston University Real-Time, Multimedia and High Performance Computing in Distributed Systems The requested instrumentation is to enhance and support a rapidly growing research group in areas of high performance computing and communication, digital multimedia, and real-time systems. The instrumentation consists of a 12 x 12 ATM switch connecting nodes that serve as compute engines, files servers, and video clients which provides high bandwidth access to the university's supercomputing facility. Five research projects will directly benefit from the requested instrumentation: 1. Parallel compilers, 2. Performance prediction of high-bandwidth networking environments connecting a heterogeneous set of computers and supercomputers, 3. Efficient multi-threaded shared memory parallel computing on distributed systems, 4. Information dispersal and retrieval protocols to provide for real-time, fault-tolerant comunication, and 5. 3D extension on deformable shape modeling for content-based retrieval for video and image databases. The advancement of these projects depends on emerging technology of high-bandwidth networking environments connecting a heterogeneous set of computers and supercomputers, and the availability of a network that delivers a guaranteed bandwidth and real-time graphics and video I\/O capabilities.","title":"CISE Research Instrumentation: Real-time, Multimedia and High Performance Computing in Distributed Systems","awardID":"9529403","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["37720",16398,"562061"],"PO":["557609"]},"6671":{"abstract":"CDA-9529346 Peter K. Allen Gerard Ateshian Van C. Mow John Kender Columbia University Acquisition of a Rapid Prototyping System Rapid-Prototyping (RP) machines have created an opportunity for development of a \"3-D FAX\" which can transmit a physical object's model to another site where it may be reconstructed. The initial goal is to automate the model scanning process, reducing the time, cost and operator intervention needs of current systems. The project also addresses system issues in model-acquisition, sensor-planning, and data- compression that affect 3-D FAX; without the proposed RP machine this cannot proceed. A second project is to use the RP machine in prosthesis design. A large variety of cadaver joints can be imaged with stereophotogrammetry, CT, and MRI to produce model prototypes. These models can then be built with RP equipment and tested experimentally to verify that they adapt to different individuals and produce normal joint mechanics. The goal is to take the imaging tools required to perform the tasks outlined above and integrate them with RP equipment to form an efficient and clinically proven process. The third project is to create objects with varied surface depth to test a shape recovery method using multiple light sources. The equipment allows production to specification of different objects with unusual surface configurations to properly test and evaluate the reconstruction method.","title":"CISE Research Instrumentation: Acquisition of a Rapid Prototyping System","awardID":"9529346","effectiveDate":"1996-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["518026"],"PO":["301532"]},"6693":{"abstract":"CDA 9529418 Ibarra, Oscar H. Rinard, Martin C. Schauser, Klaus E. Yang, Tao University of California, Santa Barbara A Next-Generation High-Performance Network of Commodity PCs The proposed instrumentation consists of a collection of commodity personal computers (PCs) connected by a commodity ATM network. This computing platform supports four experimental research projects in the area of high performance parallel and distributed systems. The first project investigates efficient communication primitives for cost-effective commodity computing and networking platforms. The objective is to enable important parallel computations to execute efficiently in this computing environment. The second project investigates a new parallelizing compiler technique called commutativity analysis. The objective is to extend the range of parallelizing compilers to include computations that manipulate complex pointer-based data structures. The third project investigates scheduling and run-time supporting techniques for irregular scientific computations. The objective is to understand how to map these computations efficiently onto a modern parallel computing environment consisting of commodity hardware components. The final project investigates issues in developing a scalable WWW server for digital library applications. The objective is to strengthen the server's processing capabilities to match huge expected increases in simultaneous access requests from the Internet. The main research activity in all of these projects is developing, testing and measuring software. The instrumentation provides the hardware platform required to perform these activities.","title":"CISE Research Instrumentation: A Next-Generation High Performance Network of Commodity PCs","awardID":"9529418","effectiveDate":"1996-02-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["499391","486626","194103","497068"],"PO":["557609"]},"6310":{"abstract":"This is a companion project with CCR-95-28973 (entitled ``Optimization and Learning over Convex Sets'') and is an award under the Software Capitalization Program. The project's goal is to upgrade and update software that had been produced. These upgrades and updates are based on algorithms developed under support of CCR-92-08597. The software is for executing random walks that produce a sample from certain multi-variate probability distributions. An update of the software involves simply changing the ``number of steps'' parameter in the random walk. Applications of this discrete probabilistic software (i) to contingency tables and (ii) to the membership oracles for optimization over convex sets, are investigated. With good planned dissemination (for example, on the world wide-web)and well thought-out testing, other applications of this software are anticipated. ***","title":"Fast Randomized Algorithms for Optimization and Other Applications of Geometric Random Walks","awardID":"9528215","effectiveDate":"1996-02-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["320878"],"PO":["150516"]},"8544":{"abstract":"The overall goal of this research is to establish a science base for automated assembly by analyzing its basic components. The research involves development of algorithms and interactive systems that analyze the low-level geometry of assembly lines and their components, such as part feeders, sorters, and fixtures. An underlying theme is the use of simple sensors and actuators such as light beams and parallel-jaw grippers. Although the hardware bears a close resemblance to existing hard automation systems, this research introduces computational methods to rapidly configure and reliably control this hardware. At a higher level, modular components such as flexible feeders and conveyor belts are interactively configured to facilitate the design and evaluation of assembly lines prior to installation. The research addresses basic theoretical questions such as the complexity and completeness of algorithms and involves several companies in efforts to transfere basic results into industrial practice.","title":"Presidential Faculty Fellowships","awardID":"9553197","effectiveDate":"1996-02-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["520937"],"PO":["179262"]},"6697":{"abstract":"CDA 9529442 Vaidya, Nitin Welch, Jennifer Zhao, Wei Amato, Nancy Texas A & M University Texas Engineering Experiment Station College Station, TX 77843-3000 Distributed Computing and Real-Time Networking Research This proposal requests funding for a homogeneous workstation cluster and ATM-FDDI networking hardware to aid research in distributed computing and real-time networking. The equipment is useful for several projects, including: (1) Real-time communication in heterogeneous networks: This project develops techniques for guaranteeing deadlines in heterogeneous networks popular in mission-critical systems. Requested equipment enables experimentation with a network consisting of ATM and FDDI. (2) Algorithms for distributed systems management: Algorithms are developed for managing performance and faults in distributed systems, using formal analysis and experimentation. Realistic assessment requires a dedicated cluster of homogeneous workstations to allow undisrupted testing and trend prediction. (3) Failure recovery schemes for parallel applications: Design of efficient recovery schemes is necessary to minimize execution time in presence of failures. The requested workstations provide a homogeneous computing environment necessary for quantitative comparison of different recovery schemes. (4) Distributed shared memory (DSM) system design: Requested equipment provides a workstation cluster and high-speed networking for development of an adaptive fault-tolerant DSM capable of achieving high performance","title":"CISE Research Instrumentation: Distributed Computing and Real-Time Networking Research","awardID":"9529442","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["553537","453727","561154","438784"],"PO":["557609"]},"7038":{"abstract":"9530668 Claffy NSF would like to foster a robust multiple provider network environment where IP providers can secure sufficient and useful understanding of workloads imposed by their customers. NSF will use this workshop to bring together those who use high speed network equipment with those who design it. The recent deployment of the vBNS (very high speed Backbone Network Service), an NSF cooperatite agreement with MCI for an OC-3 wide area network connecting the NSF supercomputer centers, will also provide an ideal platform to investigate statistics collection and analysis technologies.","title":"NSF Workshop on Internet Statistics","awardID":"9530668","effectiveDate":"1996-02-01","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["521741",17256],"PO":["121202"]},"5862":{"abstract":"This project is exploring new communication mechanisms that go beyond the deadline guarantees of previous work in real-time and non-real-time message streams, using models of real-time communication that can represent tolerance to deadline misses. For real-time message streams, these models suggest new techniques for providing service guarantees on the frequency or clustering of missed deadlines. for non-real-time message streams, the models will be used to develop support mechanisms that minimize average delivery delay subject to the constraints of the real-time streams. Simulation and analytic methods are being used to evaluate competing techniques.","title":"Guaranteed Performance Communication in Distributed Real-Time Systems","awardID":"9526761","effectiveDate":"1996-02-01","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["553458"],"PO":[14366]},"6720":{"abstract":"CDA-9529520 Barreto, Armando B. Yen, Kang Florida International University CISE Research Instrumentation: Multiprocessor Workstation for Advanced Digital Signal Processing Research Emerging Digital Signal Processing techniques are being applied to the solution of challenging problems of signal detection and system modeling: Dynamic neural networks are used as spatio-temporal classifiers for the detection of electroencephalographic (EEG) patterns that can be elicited voluntarily, as part of the process of motion preparation. Reliable detection of these patterns will provide the basis for the development of a new form of computer interface that will be accessible even to individuals deprived of motor execution functions. Similarly, chaotic dynamics analysis is being applied for the detailed study of the three-dimensional propagation of ocean acoustic waves. Indices such as the Lyapunov exponent are numerically estimated using real sound propagation data collected in the North Atlantic to characterize the chaotic properties of the phenomenon. While these emerging DSP techniques hold great promise to increase our capability to obtain useful information from signals and develop accurate models of physical phenomena, they are complex and computationally intensive. The availability of multiprocessor workstations is necessary to shorten the algorithm development and analysis cycles (i.e., large-scale dynamic neural network training, numerical Lyapunov exponent estimation, etc.) to practical levels. Additionally, these systems will familiarize our faculty and students with parallel algorithm development techniques","title":"CISE Research Instrumentation: Multiprocessor Workstation for Advanced Digital Signal Processing Research","awardID":"9529520","effectiveDate":"1996-02-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[16489,"435839"],"PO":["557609"]},"3035":{"abstract":"This research concerns a fundamental problem of machine learning, which is how to learn when the originally given representation space is of low quality. Most machine learning methods search for desirable knowledge in the same representation space in which training examples are presented (that is, use the same attributes or terms as those employed in the training data). If the original representation space is inadequate, that is, the given attributes or descriptive terms are insufficiently relevant to the present learning task, such methods do not perform well. This project investigates several novel ideas and methods for learning in such situations. In particular, we are investigating a constructive induction approach to the problem, in which a learning system performs a double intertwined search - one for an improved knowledge representation and one for the \"best\" hypothesis in that space. In the multistrategy constructive induction methodology, a combination of strategies is employed for transforming the initial representation space into the new task-oriented space. the space transformation operators are divided into \"constructors\" that expand the space by inventing new attributes and \"destructors\" that reduce the space by removing or abstracting the current attributes, guided by \"meta rules\" that are initially provided, but incrementally improved by a secondary learning process.","title":"Multistrategy Constructive Induction: A Theory and Methodology for Task-Oriented Improvement of Knowledge Representation Spaces for Learning","awardID":"9510644","effectiveDate":"1996-02-01","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["355581"],"PO":["565227"]},"6555":{"abstract":"The objective of this project is to create a database of children's read speech with the digital quality needed for speech research. Such data is unavailable today, but essential to achieving effective speech communication between children and machines. The methods to be employed include selecting appropriate texts to be read, recording good and poor readers, labelling the speech, verifying the quality of the labels, and organizing the data into an easily accessible form. A database of children's speech is a key enabling condition for applications in education, entertainment, and other socially and economically important fields. Expected direct impact of the work includes making the database available to the Linguistic Data Consortium for distribution to speech researchers. Applications include an automated reading coach that listens to children read aloud, and helps when needed. A prototype of such a coach was developed with previous NSF support, but its usability and robustness were limited because its speech recognizer was trained on adult speech. A children's speech database is necessary to achieve the required accuracy in listening.","title":"A Database of Children's Speech","awardID":"9528984","effectiveDate":"1996-02-01","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551746"],"PO":["183208"]},"6698":{"abstract":"CDA 9529444 Nau, Dana Hendler, James University of Maryland at College Park CISE Research Instrumentation for AI Planning Research The Department of Computer Science and the Institute for Systems Research at the University of Maryland will purchase computing machining equipment, including a small multipurpose machine tool, a pentium-based personal computer for solid modeling and input to the tool, and a large disk drive for keeping large case-based planning libraries, all of which will be dedicated to support artificial intelligence research in the area of computer and information science and engineering. The equipment will be used for several research projects, including in particular: *AI-based planning for manufacturing, *High Performance Support for Large Knowledge Bases, *Combination of generative and case-based reuse techniques in AI planning, and *Low-cost robotics. In addition, a CAD tool will be donated by Bentley Systems Inc. to facilitate experimentation with the AI planning techniques in the manufacturing domain.","title":"CISE Research Instrumentation for AI Planning Research","awardID":"9529444","effectiveDate":"1996-02-15","expirationDate":"1998-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["508604","499228"],"PO":["564412"]},"7226":{"abstract":"The Santa Fe Institute will continue its REU program. The site will select a limited number of highly motivated and talented undergraduates who can benefit from exposure to the rich interdisciplinary mix of ideas at the Institute. Women and minorities will especially be invited to apply. Senior faculty mentors will be selected for their interest in the program and each undergraduate will be matched with one or more mentors who have research problems of real interest to the student and to which the student can make a significant contribution. Other resident scientists will be encouraged to take a regular interest in the intellectual development of the interns. The students will be encouraged to participate fully in the intellectual life of the Institute by attending colloquia and seminars and through informal discussion of their work with other resident researchers. Where appropriate, publication of scientific papers, attendance at workshops, and release of student-developed software will be encouraged by SFI. During each student's residency he will make a SFI colloquium presentation, compile a written summary of his work, and frequently consult with the program director. Students are encouraged to remain in contact with the Institute and their mentors as their careers develop, and, if appropriate, to return for subsequent scholarly visits.","title":"Proposal to Support and Undergraduate Research Site at the Santa Fe Institute","awardID":"9531317","effectiveDate":"1996-02-15","expirationDate":"2000-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}}],"PIcoPI":["124550","24883"],"PO":["125898"]},"5169":{"abstract":"Convolutional codes have long been recognized as the preferred method of providing error control over a variety of communication channels. Examples of their practical application can be found in deep space communication, digital satellite transmission, military communications, mobile cellular telephony, and high speed data modems. Despite the many examples of their practical importance, relatively little research has been conducted into the fundamental properties of convolutional codes, compared to other methods of error control. This project is a program of basic research into several new approaches to finding efficient methods of encoding and decoding convolutional codes. Spurred by recent advances in trellis coded modulation, iterative decoding techniques, and the decoding of very complex codes, five areas of research are undertaken: cascaded convolutional codes, multilevel convolutional codes, product convolutional codes, non-standard rate convolutional codes, and unbalanced memory convolutional codes. The goal is to uncover new code structures which can offer better trade-offs between error performance, decoder complexity, and system delay than the standard structure. Particular emphasis is given to studying the fundamental role that delay plays in determining the relationship between performance and complexity. The results of this research may provide viable alternatives to existing coding schemes in applications such as low earth orbiting satellite networks, digital mobile cellular communications, and wireless indoor packet transmissiol systems.","title":"New Directions In Convolutional Codes","awardID":"9522939","effectiveDate":"1996-02-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508186"],"PO":["150411"]}}