{"198110":{"abstract":"Big-data practice suggests that there is a tradeoff between the speed of data ingestion, the ability to answer queries quickly (e.g., via indexing), and the freshness of data. This perceived tradeoff lies, for example, at the heart of the historic division between OLTP (online transaction processing) and OLAP (online analytical processing). In an OLTP database, data gets ingested quickly and the data available for querying is fresh, but analytical queries run prohibitively slowly. In an OLAP data warehouse, data is buffered for off-line indexing so that analytical queries run quickly, but by the time the data gets indexed, it is stale. <br\/><br\/>This tradeoff has manifestations in the design of all types of storage systems. For example, some file-systems are optimized for reads and others for writes, but workloads generally involve a mixture of reads and writes. <br\/><br\/>In this project the PIs show that this is not a fundamental tradeoff, but rather a tradeoff imposed by the choice of data structure. The PIs use write-optimized structures, an alternative to traditional indexing methodologies, to build storage systems in which this tradeoff is significantly mitigated or alleviated altogether. The performance promise of such indexing schemes follows from the PIs previous work establishing that write-optimized data structures can speed up both inserts and queries. <br\/><br\/>This project addresses the remaining obstacles in the deployment of write-optimized indexes within big-data file-systems and databases. Big data imposes a new set of constraints on any storage system, and the PIs will show how write-optimized indexing can yield order-of-magnitude performance improvements at scale. In particular, this project will show that such techniques are not only applicable today but that they will scale with hardware trends, including the widespread adoption of solid-state disks (SSDs).","title":"BIGDATA: Mid-Scale: DCM: Collaborative Research: Eliminating the Data Ingestion Bottleneck in Big Data Applications","awardID":"1247726","effectiveDate":"2013-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":["533341","510424"],"PO":["565251"]},"209605":{"abstract":"The University of California, Berkeley and the University of North Carolina, Charlotte propose a collaborative effort?called FRABJOUS?to develop and deploy a proposed, new Advanced Placement (AP) computing course that can successfully achieve outreach ? attracting women and underrepresented minorities ? while having a technically rigorous programming component. The work extends the PIs? previous work on the Berkeley ?Beauty and Joy of Computing? course and the College Board?s CS Principles course to the high school level, addressing the development and study of new instructional materials as well as the impact of teacher professional development on student learning outcomes. The course uses a visually rich programming environment, called Snap, that is based on Scratch. Scratch has had well-documented success in teaching computer programming to 8-14 year olds because of the power of its visual metaphor. Snap extends the metaphor to teach more advanced methods, including recursion, higher order procedures, and object-oriented programming, to 14-19 year olds. Specifically the FRABJOUS project will<br\/>? Develop a core group of mentor teachers in the Berkeley and Charlotte areas,<br\/>? Conduct and evaluate intensive summer professional development workshops for in-service high school teachers,<br\/>? Develop regional partnerships between universities and high schools, creating CSTA chapters and connecting them through the STARS Alliance,<br\/>? Study university and high school student learning outcomes,<br\/>disaggregating data by race, gender, age, course, and curricular models to<br\/>understand the curriculum's effectiveness, ease of use, and impact, particularly<br\/>the introduction of advanced concepts (higher order functions, recursion,<br\/>distributed computing, concurrency, simulation) at this early level, <br\/>? Compare outcomes for students and teaches trained directly by the PIs with those trained by the mentor teachers, and<br\/>? Expand the capability of Snap.<br\/>The project thus includes tool and materials development, assessments of student learning outcomes, and study of the impact of teacher professional development via workshops and school year support activities, including peer-to-peer and online support.","title":"Type I: Collaborative Research: FRABJOUS CS - Framing a Rigorous Approach to Beauty and Joy for Outreach to Underrepresented Students in Computing at Scale","awardID":"1346922","effectiveDate":"2013-02-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[561854],"PO":[561855]},"199166":{"abstract":"Modern society increasingly depends on the work of interdisciplinary teams using information and communication technology (ICT) to control complex systems with high reliability (for example, in airplane cockpits, traffic control rooms, and nuclear power plants). Engineered systems such as these are deterministic, with well-defined states and parameters of normal operation which allow control teams to achieve their goals through direct interaction with ICT. But when the focus is a natural (i.e., social or living) system rather than a machine, the control task imposes quite different cognitive demands which make the design, development, and integration of ICT more challenging. High-risk, fast-response medicine is an example of a work environment that deals with a natural system (the patient), where the need for effective ICT support is as high as for engineered systems. The goal of this research is to develop innovative approaches for real-time information presentation to support situation awareness and collaborative work by fast-response, interdisciplinary medical teams. In particular, the PI will examine how context-specific information should be presented to support such teamwork while accounting for team members' perceptual and cognitive limitations. To this end, she will focus on the team-dependent and information-intensive processes of evaluating critically ill patients in the high-risk medical domains of pediatric trauma and emergency resuscitation. The research will involve field studies, video review of medical events, design and development of display prototypes, and evaluation. Project outcomes will include conceptual and empirical understanding of awareness in fast-response medical teamwork, approaches for augmenting distributed cognition through interactive displays, lessons from the development of display prototypes for improving awareness of rapidly unfolding events and their progression, and lessons from evaluating such prototypes in real-world settings.<br\/><br\/>Broader Impacts: The research will contribute to and inform diverse scientific fields, including information presentation in dynamic environments that rely on interactive information presentation, human-computer interaction where work conditions limit direct interaction with information systems, and the automatic capture and integration of data arriving from multiple sources. Because this research crosses many disciplinary boundaries, it will serve as a platform for an integrated and interdisciplinary education and outreach program.","title":"CAREER: Supporting Fast-Response Medical Teams Through Interactive Information Displays","awardID":"1253285","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[534247],"PO":["565227"]},"199287":{"abstract":"Non-linearities abound in any complex biomechanical simulation. As a human hand folds into a fist, non-linear contact and material forces give rise to characteristic bulges and folds. As red blood cells crowd down a capillary, advection and contact non-linearities cause them to bump and twirl. These essential dynamics are also the main computational challenges in a simulation.<br\/><br\/>This project investigates the efficient simulation of these and other biomechanical non-linearities. It specifically investigates projected physics methods, also known as model reduction methods, which have been known to accelerate simulations by multiple orders of magnitude, but also have trouble incorporating arbitrary non-linearities. The research team explores a variety of promising approaches, including multidimensional cubature, exponential integrators, and vector partitioning. Source code is routinely released into the public domain.<br\/><br\/>The project is driven by two main applications. The first is high-quality, virtual humans, which can be used in surgical simulation and training, as well as visual media. The second is simulating flexible micro-particles in blood flow, which assists in designing effective shapes that deliver radiation payloads to cancer sites. The visual results of this research are highly accessible to non-specialists, so they are packaged into a publicly available app that is used to engage undergraduate researchers, and used during high school outreach to encourage involvement in science and engineering.","title":"CAREER: Enabling Efficient Non-Linearities in Biomechanical Simulations","awardID":"1253948","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[534490],"PO":["564316"]},"199298":{"abstract":"This project aims to develop an information-theoretic approach to communication-constrained statistical learning problems involving multiple learning agents located at the nodes of a large network. This approach will build on the recently introduced coordination paradigm within network information theory, which looks at multiterminal problems in terms of optimal use of communication resources in order to establish some desired statistical correlations between the nodes of a network. The main theoretical goal is to explicitly identify the effect of bandwidth limitations, losses, delays, and lack of central coordination on the performance of statistical learning algorithms over networks. The project will systematically explore the fundamental limits of learning in multiterminal settings and design efficiently implementable and robust coding\/decoding schemes. The theory developed under this project will be a novel synthesis of probabilistic techniques from machine learning (such as empirical process theory) and of multiterminal information theory (such as distributed lossy source coding).<br\/><br\/>As a broader impact, this project will provide key enabling technologies for large-scale, distributed applications of machine learning in such domains as smart grids, health-care informatics, transportation networks, and cybersecurity. Statistical machine learning is emerging as a dominant paradigm for making accurate predictions on the basis of empirical observations in the presence of significant model uncertainty. Most of the research activity in this field, however, has taken place in isolation from the realities of complex networks and all the attendant limitations on information transmission and processing: it is frequently assumed that the data needed for learning are available instantly, with arbitrary precision, and at a single location. However, given the fact that most data fed to machine learning algorithms are increasingly generated, exchanged, stored and processed over large-scale networks, there is a pressing need to dispense with this assumption and thus take network effects into consideration. The theory and the algorithms developed as part of this project will ensure that the relevant data are delivered over the network to the right decision-makers, while securing accurate decisions made on the basis of the received information. The research component of the project is tightly integrated with an education and outreach plan, including development and teaching of new courses on machine learning aimed specifically at engineering students.","title":"CAREER: An Information-Theoretic Approach to Communication-Constrained Statistical Learning","awardID":"1254041","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["541985"],"PO":["564924"]},"206999":{"abstract":"Brain-computer interfaces (BCIs) translate signals recorded from the brain into useful outputs such as control of the movement of a computer cursor, selection of letters or icons on a computer screen, or even operation of a neuroprosthesis. Thus, BCI technology is a potentially powerful communication and control option for people with severe motor disabilities or disorders such as amyotrophic lateral sclerosis (ALS), brainstem stroke, cerebral palsy, and spinal cord injury, who may have little or even no muscle control and therefore no means of communication with the external world. The success of this exciting work depends on close and productive multidisciplinary interactions among researchers working in neuroscience, psychology, engineering, mathematics, computer science, and clinical rehabilitation. Because no standard venue existed to bring these groups together to share results, to exchange ideas, and to develop the requisite close and productive collaborations, the NIH sponsored and the Wadsworth Center in Albany NY organized the First International BCI Meeting in 1999, which was followed by additional meetings in 2002, 2005 and 2010.<br\/><br\/>This is funding to support the Fifth International BCI Meeting, which will be held June 3-7, 2013, in Asilomar, California. Because of the growth in the field of BCI research 300 or more participants are expected to attend, including investigators from at least 100 BCI research groups. All attendees commit to the entire meeting, from the opening reception and dinner on the evening of Monday, June 3, through the final summary discussion at breakfast the morning of Friday, June 7. The schedule for the days in between includes, on Tuesday morning, brief summaries scientific and technical advances by representatives of selected BCI labs. Tuesday afternoon includes innovative applications and protocols for BCIs, as well as a panel on BCI performance metrics. Wednesday starts with a special breakfast for women in the BCI field, and continues with a session on Clinical Translation and Dissemination. After a poster and demo session, there will be a Town Hall meeting focused on forming a BCI Society. On Thursday up to 15 workshops proposed by researchers in the BCI field will run concurrently, each workshop to combine invited talks, targeted discussion, and sharply focused debates. Thursday's sessions will conclude with a discussion of the State of the Art and future workshops for BCI technologies. On Friday morning there will be a plenary session of all meeting attendees, in which leaders of each workshop will present a 15-minute summary presentation. The primary source of funding for the meeting will once again be the National Institutes of Health. NSF funds will enable the conference organizers to support about 30 additional students (including undergraduate and graduate students, and postdoctoral fellows), to attend and participate in a special pre-conference seminar as well as the conference itself. More information about the conference may be found online at http:\/\/bcimeeting.org\/2013\/.<br\/><br\/>Broader Impacts: Students will be encouraged to participate in all aspects of the conference. The laboratory research reports of the first day will expose them to the breadth and variety of BCI research going on around the world. The informal workshops will familiarize them with the issues now being addressed on the cutting edge of the research and with the different viewpoints on those issues. Students will assist in workshop planning; participate in the workshop discussions; and may assist in the preparation of summary reports. In preparation for the main meeting, a special colloquium will be held for students on the afternoon of June 3 with the purpose of presenting a big picture, as well as filling in gaps in their understanding before they move into specialized sessions on various aspects of the field. On Monday and Wednesday afternoons, students will attend special \"talk back\" sessions where established researchers will be available to answer questions and to lead discussions. Students and post-doctoral fellows will present posters on their research, which will be judged by a panel of senior BCI researchers on the basis of innovation and scientific or technical merit. With all participants housed on site and all meals for all attendees taken together on site, there will be ample opportunity for informal discussions. This creates a unique opportunity for students and trainees to mingle with and learn from established researchers. Student participation is a critical feature of the BCI meetings, allowing students to meet potential mentors and collaborators. Many students who attended the first four BCI meetings have gone on to pursue BCI as their chosen field of research. The PI will make a special effort to encourage participation by members of traditionally underrepresented groups.","title":"Student Support for the Fifth International Brain-Computer Interface Meeting","awardID":"1331208","effectiveDate":"2013-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[554219],"PO":["565227"]},"199266":{"abstract":"This research project addresses the fundamental question of how we can use the existing ecosystem of networked devices in our surroundings to make sense of and exploit massive, heterogeneous, and multi-scale data anywhere and at any time. Assembling these devices into unified sensemaking environments would enable deep analysis in the field. Examples include managing heterogeneous data in scientific lab notebooks, scaffolding undergraduate classroom learning with examples, manuals, and videos, and supporting police investigation by linking facts, findings, and evidence. On a higher level, this concept would stimulate our digital economy by supporting fields such as design and creativity, command and control, and scientific discovery. However, despite this ready access to a myriad of handheld devices as well as those integrated in our physical environments, each individual device is currently designed to be the focus of attention, cannot easily be combined with other devices to improve productivity, and has limited computational and storage resources. This project introduces a comprehensive new approach called ubiquitous analytics (ubilytics) for harnessing these ever-present digital devices into unified environments for anywhere analysis and sensemaking of data.<br\/><br\/>Ubilytics draws on human-computer interaction, visual analytics, and ubiquitous computing as well as a synthesis of distributed, extended, and embodied cognition, based on three principles. First, universal interaction requires designing an interaction model that combines several devices into a holistic distributed interface, transparently bridges multiple devices, surfaces, and even physical objects, and unifies interaction with various data types. Second, flexible visual structures must be created in order to generate representations that adapt to varying device dimensions, resolution, viewing angle, and distance, support space and layout management in ego-centric and world-centric configurations, and can utilize both novel and appropriated displays for output. Third, efficient distributed architecture must be achieved through methods for discovering, merging, and synchronizing heterogeneous devices with support for a generic component model to facilitate reuse, offloading costly computation into the cloud, and meshing ubilytics environments for collaboration. <br\/><br\/>Sensemaking is often attributed to professional analysts finding meaning from observed data, but this research will take a comprehensive view of sensemaking for both casual and expert users, in both dedicated and mobile settings, and with both large-scale and small-scale datasets. This work will therefore benefit society by focusing on three example domains: (1) scientific discovery, (2) classroom learning, and (3) police investigation. It will also advance discovery and understanding by integrating the research in an undergraduate programming course used as a testbed for learning in ubilytics environments. Another goal is to broaden participation of underrepresented groups by engaging in a women in engineering program as well as by mentoring minority undergraduate students during summer research internships. Results, software, and documentation will be disseminated under Open Source and Creative Commons licenses.","title":"CAREER: Ubilytics: Harnessing Existing Device Ecosystems for Anywhere Sensemaking","awardID":"1253863","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559568"],"PO":["564456"]},"199277":{"abstract":"Little prior work in unmanned underwater vehicles (UUVs) has addressed the tight coupling that is inherent between the fluid dynamics of the body of water and the vehicle itself. In fact, the fluid dynamics of large, open bodies of water can be quite complex and this proposal addresses large coherent structures that naturally occur in the flow structure of these large bodies of water. The goals of this project are to extend the PI's ONR YIP award into the realm of 3-D, expanding the mathematical and control framework for distributed autonomous sensing and tracking of geophysical fluid dynamics and to understand the long-term impact of geophysical fluid dynamics to improve the autonomy of underwater vehicles. The key idea exploits the capability of the team to cover large regions to increase the spatio-temporal sampling resolution of the flow field. The data will then be processed in a distributed fashion to obtain a global description of the flow dynamics that can be maintained and updated in real-time. The specific objectives that expand prior proposals include not only the 3-D modeling, but the development of an energy efficient stochastic pulse controller for tracking the ridges of the coherent structures and expanding the estimation of the structures through stochastic approaches that allow the fusing of larger teams of sensing entities. The intellectual merit of the proposed work stems from the synthesis of nonlinear dynamical systems theory, transport theory, and robotics to develop a modeling, control, and analysis framework for collaborative unmanned systems operating in dynamic and uncertain environments. The information gleaned from the coherent structures will be used to refine motion control and resource allocation strategies to determine minimum-effort stochastic control policies for long-term operation in GFD environments. To the PI's knowledge, this is the first attempt to use robots to track and map unstable coherent structures in the ocean, and to exploit knowledge of them to improve the autonomy of AUVs\/ASVs.<br\/><br\/>Broader Impact: Success of these endeavors will improve the forecast of weather-climate systems, underwater transport dynamics, and the modeling and prediction of various other physical phenomena in geophysical flow environments. Since the proposed methods are very general and developed for continued operation in dynamic and uncertain environments, success of the proposed activities will likely increase the maneuverability and energy-efficiency of existing AUVs\/ASVs; enable teams of AUVs\/ASVs to continuously adapt to changing environmental conditions as they execute their assigned tasks; and provide greater situational awareness for various scientific, commercial, and military applications in the ocean. In addition, the proposed educational activities include a comprehensive plan to integrate the study of GFD into robotics through online educational modules for general K-12 audiences; an interdisciplinary undergraduate and graduate curriculum; and contributions to the robotics community in the form of open source software and hardware development tools.","title":"CAREER: A New Paradigm in Control and Coordination of Robot Teams in Geophysical Flows","awardID":"1253917","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["551322"],"PO":["564069"]},"199167":{"abstract":"Achieving a high fraction of peak performance on complex architectures has been a perennial challenge for application developers. The emergence of multicore processors and accelerators has greatly exacerbated this problem. With an increasing number of cores per socket, deep hierarchies of shared and distributed caches, and exascale computing on the horizon, multicore platforms pose unprecedented challenges for software development and application tuning. This research confronts the challenge of multicore and manycore software development by improving automatic performance tuning through improved feedback diagnostics. Autotuning efficiency is achieved through enhanced knowledge of the problem domain, program features and architectural characteristics. To this end, we are developing a set of tools that allow specification, collection and synthesis of tuning related information. This rich set of information is then exploited through novel machine learning models to deliver scalable, portable and sustainable performance on diverse architectures. <br\/><br\/>In line with this research, we have established, SISTEM, a structured interdisciplinary program for undergraduates that brings together faculty and students from different STEM disciplines to explore cross-cutting research problems in which computational thinking, modeling and simulation play a central role. <br\/><br\/>The techniques developed as past of this research will have a direct economic impact through saved energy and computation cycles on high-end systems. The improved efficiency of applications will allow researchers to execute large-scale simulations that will enable modeling of complex phenomenon in a broad range of disciplines including medicine, high-energy physics, climate modeling and nanotechnology.","title":"CAREER: Autotuning for multicore and manycore architectures: an enhanced feedback-driven approach","awardID":"1253292","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["543549"],"PO":["565255"]},"199288":{"abstract":"Many important decision problems in computational science involve multi-­agent systems (MAS) in which multiple decision makers must choose strategies for action from a set of alternatives. (One example is selecting a security policy --- for example by police --- to protect critical infrastructure against attackers.) This CAREER award project develops methods for analyzing MAS to select strategies for an agent to follow that will lead to desirable outcomes. <br\/><br\/>The central tenant driving the project is that a good strategy should be robust in the sense that it will continue to perform well even when there is uncertainty about the outcomes or how other agents will choose their strategies. An important component of the project is a multi-purpose web platform supporting both research experiments and education on game-playing agents. The PI will design course modules that use this platform to involve undergraduates in designing game-playing agents, offering an exciting way to practice basic programming and develop critical thinking and data analysis skills. The agents designed by students also play an important role in the research; they will provide a diverse library of strategies to evaluate the robustness of reasoning methods for play against opponents with unanticipated behaviors. This platform, and the data sets generated with it will serve the broader research and education communities in computer science and MAS.<br\/><br\/>Research on robust methods for strategic reasoning has the potential to significantly improve decision making in many important real-world problems, including decision support tools for homeland security operations. The availability of robust methods will also enable new applications of computational game theory in domains where confidence in the strategies, despite uncertainty, is critical. This award also supports broadening participation by developing research capacity at UTEP, a minority-­serving institution. <br\/><br\/>The project's primary technical contributions are in computational game theory. Typical game-theoretic solutions are not robust to the kinds of uncertainty that arise in real applications; these include payoff uncertainty, abstraction error, and opponent modeling error. Robustness requires techniques that encompass unanticipated situations, as well as those where it is possible to precisely characterize the uncertainty. The project extends the framework of meta-games to provide a methodology for evaluating robustness in the context of different kinds of uncertainty, including the three listed above. The PI uses meta-games to evaluate new concepts for robust strategic reasoning, including methods based on Bayesian games, interval-based approaches, and approaches drawn from behavioral game theory. The web-based platform developed in the project facilitates extensive experiments with game-playing agents. This will be used to collect a diverse pool of unanticipated agent strategies (including ones designed by undergraduate students), enabling a more comprehensive investigation of robustness to unanticipated opponent behaviors.","title":"CAREER: Robust Strategic Reasoning for Multi-Agent Systems","awardID":"1253950","effectiveDate":"2013-02-15","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[534492],"PO":["562760"]},"202764":{"abstract":"The annual IEEE International Symposium on Safety Security and Rescue Robotics (SSRR),<br\/>sponsored by the IEEE Robotics and Automation Society, International Rescue System Institute,<br\/>and the Center for Robot-Assisted Search and Rescue, has a tradition of attracting cutting-edge<br\/>papers in the theory and practice of robots for rapid and secure inspection of critical<br\/>infrastructure, disaster response and recovery, disaster mitigation and recovery, detection of<br\/>chemical, biological and radiological risks, and operations in these dangerous sites.<br\/><br\/>In the past it has served as a forum gathering international researchers together for the<br\/>exchange of ideas on technical problems and their solutions in these domains. The 10th<br\/>anniversary SSRR 2012 will be hosted this year at Texas A&M, College Station, Texas, while the<br\/>11th will be hosted in Linkoping, Sweden. This proposal requests travel funds from NSF to assist<br\/>students to participate in SSRR 2012 & 2013 to participate in field trials with actual responders.<br\/>This represents both the intellectgual merit and the broader impacts.","title":"IEEE International Symposium on Safety, Security, and Rescue Robotics (SSRR 2012-2013) Student Travel Awards","awardID":"1305093","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[543408],"PO":["564069"]},"206659":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 14 promising graduate students from U.S. institutions of higher learning, along with 6 distinguished research faculty (4 of whom are women), to be held in conjunction with the Sixth International Conference on Pervasive Technologies Related to Assistive Environments (PETRA 2013), which will take place May 29-31 on the island of Rhodes, Greece. The PETRA Conference mission is to promote interdisciplinary research that can improve the quality of life and empower people with greater capabilities using pervasive ambient intelligent environments. This is the only annual conference that brings together theoreticians and practitioners from a wide variety of disciplines to focus on the application of pervasive technologies to assistive environments. Innovations to be presented during this year's conference include intelligent human sensing, robotic devices to enable persons with disabilities, algorithms for data fusion, new computer aided rehabilitation methods, therapy game development that personalizes a game to an individual's needs, gesture recognition tools, medication management, remote secure communications and data sharing, remote health monitoring, and many other enabling technologies. More information about the conference may be found online at http:\/\/www.petrae.org.<br\/><br\/>The goals of the Doctoral Consortium are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance in a supportive and interactive environment from a group of senior researchers. Student participants in the Doctoral Consortium will be drawn from diverse communities including computer science, engineering, psychology, social science, neuroscience, human-computer interaction, cognitive science and communication. They will make formal 20-minute presentations of their work and will receive feedback from a faculty panel; the feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The workshop faculty members will bring a wide spectrum of expertise, and provide student mentoring and coordination. Doctoral Consortium attendees will be asked to create and maintain a \"digital workbook\" where along with their work they include feedback on papers they attended and observations that they gathered (e.g., through meetings and discussions with conference speakers and other participants) that will apply to and impact their work. Short papers on the participants' work will be published in the Conference Proceedings (which are included in the ACM Digital Library), and a summary report on the event will be posted on the conference website. <br\/><br\/>Broader Impacts: The PETRA 2013 Doctoral Consortium will bring together some of the best students, researchers and practitioners in relevant fields, and will thereby afford the younger participants a unique opportunity to gain wider exposure for their innovative ideas while also receiving reinforcement for the importance and value of conducting research with societal impact. The workshop will allow the junior participants to create a social network both among themselves and with senior colleagues. The organizing committee will make a concerted effort to attract participants who are women, members of under-represented minorities, and persons with disabilities. To further assure participant diversity, the organizers will endeavor not to accept more than 2 students from any one institution, and in addition the PI plans to ask her dean for separate funds to support 2-3 exceptional undergraduates to participate in the conference.","title":"Doctoral Consortium and Student-Author Travel for the PETRA'13 Conference","awardID":"1329119","effectiveDate":"2013-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560636","558118","557541","229551","564932"],"PO":["565227"]},"199322":{"abstract":"The dramatic growth of wireless sensor networks (WSNs) in the last few years has seen the emergence of a variety of applications and pilot deployments that span scientific, engineering, medical and other<br\/>disciplines. This project addresses an important research problem in sensor networks: energy management. By using hierarchical WSNs with different resources at different proxy and sensor tiers, as well as novel machine learning methods, we plan to develop DURACEM, a data-driven uncertainty-guided architecture that addresses energy efficiency across many sensor network services in a unified manner. Our architecture is built around (a) prediction models of phenomena, energy usage, and communication and the uncertainty in these models, (b) a slew of services that can exploit the uncertainty measures to save energy and<br\/>(c) an overall energy optimization framework that combines the different models and services at both the proxy and sensor tiers.<br\/><br\/>DURACEM has the potential for broad social impact. Our proposed research will provide fundamental services and tools to build next generation hierarchical sensor networks. DURACEM will provide a suite of efficient<br\/>prediction models, as well as a variety of energy-optimized services built over these models. Our source code for our tools, libraries and prototypes will be made available to other researchers via an open-source software license. The project also focuses on building an inter-disciplinary teaching lab that can spur adoption of sensor networks by educating students across engineering and sciences. The project includes the development of a comprehensive curriculum that provides graduate and undergraduate students with core systems and analytical skills in sensor networks. The DURACEM project will enhance the research experiences of minority groups at University of California, Merced (UCM), which is one of only few research universities in the nation with a Hispanic student population greater than 40% and it is considered a Hispanic Serving Institution. The project includes an outreach undergraduate component specifically targeted to the minority<br\/>students.","title":"CAREER: A Data-Driven Uncertainty-Guided Architecture for Energy Management in Sensor Systems","awardID":"1254192","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[534560],"PO":["565303"]},"199278":{"abstract":"Wireless networks are the fabric of the mobile Internet. High-speed, ubiquitous wireless access is increasingly an enabling technology for important applications ranging from communication to commerce, medicine, and education. It is thus critical to create a pathway for sustainable wireless network growth in terms of the number of users and their data rates. A major challenge facing this effort is interference: since the wireless channel is a shared medium, simultaneous transmissions interfere with one another. This phenomenon is conventionally viewed as harmful by theorists and practitioners alike, and modern wireless protocols are designed to avoid interference. Within this paradigm, the wireless channel is a fixed resource with a finite capacity, meaning that as more users join a network, the maximum data rate per user plummets. However, interfering signals are not just additional noise; rather, they represent data from other users and possess considerable structure which can be exploited.<br\/><br\/>This research pursues a novel approach to multi-user communication based on harnessing the algebraic structure of interference. The key insight is that it is possible for a receiver to first decode linear combinations of all transmitted codewords and only afterwards solve for its desired codeword in the digital domain. In many important network scenarios, this powerful technique yields significantly higher data rates compared to conventional approaches. This project leverages this technique to uncover the fundamental capacity limits of canonical wireless networks subject to interference as well as establish architectural principles for coding strategies that can efficiently approach these limits. It draws upon modern tools from combinatorial optimization to solve the resource allocation problems that emerge when this technique is applied to complex wireless networks, such as distributed multiple antenna systems. More broadly, this research lays the foundation for an algebraic network information theory to tackle challenging problems in decentralized information processing, compression, and decoding. This project incorporates several outreach efforts including interactive presentations on cellular communication for high school students, tutorials, and workshop organization.","title":"CAREER: Harnessing Interference Structure in Networks","awardID":"1253918","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["550997"],"PO":["564924"]},"201445":{"abstract":"This project focuses on the fundamental tradeoff between spectrum efficiency and energy efficiency in cognitive radio systems by exploring the correlations across both spectrum and energy domains, in the notions of both frequency holes and energy holes. The considered application scenario is a spectrum sharing system with both legacy and cognitive radios, where the nodes are powered by either smart grids or environment energy harvesters or a mix of two. The three main research objectives are: develop joint 2-D sensing scheme to explore the correlation between frequency holes and energy holes; derive efficiency maximizing resource allocation schemes considering constraints in both energy and spectrum domains; and study performance enhancement mechanisms in the framework of collaborative clouds via node conferencing. Novel interdisciplinary approaches are applied to combine the methods of 2-D statistical signal processing, non-convex optimization, and analytical energy harvesting system modeling to study the unique problem considered for the newly defined cognitive radio systems with 2-D cognition. The project provides both theories and algorithms for energy-efficient operation of future cognitive radio systems with accesses to both spectrum and energy dynamics. The research findings will be incorporated into graduate courses; the results will be disseminated to the community via journal papers and conference presentations.","title":"EAGER: Cognitive Radio with 2-D Cognition: Dynamic Spectrum vs. Power Accesses","awardID":"1265227","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560117"],"PO":["557315"]},"206616":{"abstract":"The 2013 Richard Tapia Celebration of Diversity in Computing Conference is the seventh in a series of conferences devoted to engaging a diverse community of researchers, educators, scholars, and students in discussions about opportunities and challenges in disciplines involving computer science. The conference, held in Washington, DC, Feb 7-10, 2013, has keynote speeches from leaders in computer science from across academia, government and industry, including ACM President and Google Vice President, Vint Cerf. This year the conference features a Cyber Security Education Track to raise awareness cyber security and increase participation in the development of the cyber workforce. This award supports eight (8) student scholarships, providing opportunities to these students, who might not otherwise be able to attend and participate in the conference.","title":"Cyber Security Education at the Richard Tapia Celebration of Diversity in Computing 2013","awardID":"1327346","effectiveDate":"2013-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[553190],"PO":["565239"]},"198113":{"abstract":"Big-data practice suggests that there is a tradeoff between the speed of data ingestion, the ability to answer queries quickly (e.g., via indexing), and the freshness of data. This perceived tradeoff lies, for example, at the heart of the historic division between OLTP (online transaction processing) and OLAP (online analytical processing). In an OLTP database, data gets ingested quickly and the data available for querying is fresh, but analytical queries run prohibitively slowly. In an OLAP data warehouse, data is buffered for off-line indexing so that analytical queries run quickly, but by the time the data gets indexed, it is stale. <br\/><br\/>This tradeoff has manifestations in the design of all types of storage systems. For example, some file-systems are optimized for reads and others for writes, but workloads generally involve a mixture of reads and writes. <br\/><br\/>In this project the PIs show that this is not a fundamental tradeoff, but rather a tradeoff imposed by the choice of data structure. The PIs use write-optimized structures, an alternative to traditional indexing methodologies, to build storage systems in which this tradeoff is significantly mitigated or alleviated altogether. The performance promise of such indexing schemes follows from the PIs previous work establishing that write-optimized data structures can speed up both inserts and queries.<br\/><br\/>This project addresses the remaining obstacles in the deployment of write-optimized indexes within big-data file-systems and databases. Big data imposes a new set of constraints on any storage system, and the PIs will show how write-optimized indexing can yield order-of-magnitude performance improvements at scale. In particular, this project will show that such techniques are not only applicable today but that they will scale with hardware trends, including the widespread adoption of solid-state disks (SSDs).","title":"BIGDATA: Mid-Scale: DCM: Collaborative Research: Eliminating the Data Ingestion Bottleneck in Big-Data Applications","awardID":"1247750","effectiveDate":"2013-02-01","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[531670],"PO":["565251"]},"199147":{"abstract":"Unprecedented technological progress in the last decades makes information theory an ever more exciting and important discipline. The modern world is swarming with information streams pervading the radio, wires, fiber optic cables, and on-chip networks. Yet we are unable to answer the most basic questions such as the impact of delay on the capacity of multiple-antenna wireless channels, or the fundamental principles of protecting computation networks from local process variation in silicon chip fabrication. As such, the main purpose of this project is to advance the state-of-the-art in the fundamental limits of delay-constrained wireless communication. Computation of the impact of delay constraint in wireless communication will allow assessments of the degree of suboptimality of currently employed systems and industry standards, and likewise shed light on novel and higher-performing wireless systems.<br\/><br\/>The progress on non-asymptotic information theory is inseparable from understanding of non-Shannon information measures and their data-processing properties on general (non-linear) graphs. The progress on this topic is expected to provide the theoretical tools required for exploration of complex information processing systems including non-communication ones, such as fault-tolerant chips and noise-resistant circuits. Advanced converse techniques and graph-based data-processing will open information theory to new fields and is expected to reinvigorate the progress in the converse bounds for multi-terminal (network) problems.<br\/><br\/>The curriculum will be broadly disseminated through online resources, OpenCourseWare and MITx\/edX. The analysis of real-world communication systems also presents a rich field for undergraduate research opportunities (UROPs). Popularizing finite blocklength results is likewise expected to have industrial impact, especially in areas related to wireless and time-critical communication. The compiled performance charts and delay-constrained analysis will guide the design of next-generation mobile standards and help in fair assessment of intellectual property.","title":"CAREER: Information Theory Beyond Capacity","awardID":"1253205","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["550006"],"PO":["564924"]},"199279":{"abstract":"Content distribution is an important application domain for cryptographic techniques. Existing security solutions for multi recipient communication, like broadcast encryption, focus mostly on the concerns of the content originator. This project tackles the problem from a broader perspective that includes the privacy concerns of the recipients, and develops cryptographic models and protocols for content distribution that provide guarantees beyond the mere secrecy of the data. The outcomes of this research will enable solutions that address the privacy issues associated with cloud storage. The techniques developed in the course of the research will be stimulating for researchers across the cryptography and information-hiding communities, thus potentially fostering collaborations between the fields. <br\/><br\/>The project has four specific research objectives: (1) the design of cryptographic constructions for receiver-anonymous broadcast encryption that at once provide transmission secrecy, afford anonymity to the receivers, and enjoy performance comparable to standard broadcast encryption; (2) the exploration of the relationship between receiver anonymity and ciphertext ambiguity, which refers to the possibility that a given ciphertext might appear valid to multiple decryptors; (3) the formulation of the concept of broadcast steganography to enable the use of a broadcast channel as a medium for covert communication; and (4) the investigation of applications like collaborative remote storage, whereby a group of users accesses shared content in the cloud privately and obliviously.","title":"CAREER: Anonymous and Robust Multi-Recipient Communication: Foundations and Applications","awardID":"1253927","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[534474],"PO":["565264"]},"199169":{"abstract":"This project addresses the design of participatory systems to enable assessment of information quality and to encourage contributions. It does so by designing system interfaces that allow people to better see into processes of information production to better assess their products and, by extension, to identify valued forms of contribution. The project includes (1) construction of models of how people with different kinds and levels of expertise in information production understand and assess the quality of information in participatory environments and how these understandings intersect with patterns of participation; (2) creating experimental interfaces that support information assessment; (3) studying these interfaces in iterative deployments to develop a design framework and guidelines for assessable participatory information environments; and (4) validating this design framework through summative evaluation in a novel context. The project also includes the design and implementation of participatory information literacy education activities for students that encourage participation in public information production.<br\/><br\/>The results of this research will advance scientific understanding of information assessment habits among users of participatory media. The development of novel interfaces for well-known and familiar systems will provide design framework and guidelines that are accessible and extensible from both a scholarly and technical perspective. <br\/><br\/>The design framework and guidelines that result from this project will improve design and educational practice in an area of critical national importance, namely information literacy. Improving information literacy skills is important, as they affect citizens' ability to function in a technologically rich, free and democratic society and to make informed decisions about scientific, medical, educational and other issues.","title":"CAREER: Designing An Information Savvy Society: Assessable Participatory Information Environments","awardID":"1253302","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["558322"],"PO":["565342"]},"201314":{"abstract":"Minimization of energy consumption is critical to developing green, sustainable technologies for cognitive radio terminals that can connect to networks that operate on different frequency bands with a variety of air interfaces. The intellectual merit of this project is a unified and coherent consideration of RF components, communication system algorithms, baseband computation platforms, and design tools, to greatly increase spectrum sharing efficiency. Dataflow methodologies are a promising candidate for the modeling, analysis and verification of cognitive radio systems. As dataflow models are abstract and platform independent, the same model can be used to generate implementations for very different devices from low-power sensor nodes to high-end mobile terminals. The key novelty is in the development of systematic methods for design, implementation, and integration of configurable RF chains, and in the development of dataflow methods for formal analysis and optimization of these new capabilities. The expected results are: (1) Energy consumption models and a design framework for computation, control and configuration of future radio devices, leveraging the investigators' existing experimental testbeds, (2) Configurable radio architectures for wide-scale cognitive access of noncontiguous RF spectrum, and (3) Design methodologies for flexible, energy-efficient cognitive wireless networks. The broader impact includes international collaboration through the WiFiUS program creating a holistic design for configurable frequency agile terminals. A novel interdisciplinary approach is enabled by the unique international team, which builds upon collaborations between experts at the Tampere University of Technology and University of Oulu in Finland, and Rice University and the University of Maryland in the US.","title":"EAGER: Collaborative Research: Cross-Layer Modeling and Design of Energy-Aware Cognitive Radio Networks","awardID":"1264486","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[539717],"PO":["557315"]},"201479":{"abstract":"Minimization of energy consumption is critical to developing green, sustainable technologies for cognitive radio terminals that can connect to networks that operate on different frequency bands with a variety of air interfaces. The intellectual merit of this project is a unified and coherent consideration of RF components, communication system algorithms, baseband computation platforms, and design tools, to greatly increase spectrum sharing efficiency. Dataflow methodologies are a promising candidate for the modeling, analysis and verification of cognitive radio systems. As dataflow models are abstract and platform independent, the same model can be used to generate implementations for very different devices from low-power sensor nodes to high-end mobile terminals. The key novelty is in the development of systematic methods for design, implementation, and integration of configurable RF chains, and in the development of dataflow methods for formal analysis and optimization of these new capabilities. The expected results are: (1) Energy consumption models and a design framework for computation, control and configuration of future radio devices, leveraging the investigators' existing experimental testbeds, (2) Configurable radio architectures for wide-scale cognitive access of noncontiguous RF spectrum, and (3) Design methodologies for flexible, energy-efficient cognitive wireless networks. The broader impact includes international collaboration through the WiFiUS program creating a holistic design for configurable frequency agile terminals. A novel interdisciplinary approach is enabled by the unique international team, which builds upon collaborations between experts at the Tampere University of Technology and University of Oulu in Finland, and Rice University and the University of Maryland in the US.","title":"EAGER: Collaborative Research: Cross-Layer Modeling and Design of Energy-Aware Cognitive Radio Networks","awardID":"1265332","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["50058"],"PO":["557315"]},"196486":{"abstract":"Multicore platforms have the potential of revolutionizing the capabilities of embedded cyber-physical systems. Unfortunately, when such systems have safety-critical components, multicore platforms are rarely used. The reason is a lack of predictability associated with hardware components such as caches, memory controllers, etc., that are shared among cores. With current technology, very conservative estimates concerning the usage of these shared resources must be made, to certify that overuse violations do not occur at runtime. The resulting over-provisioning can be significant, easily negating the processing power of any additional cores. The goal of this project is to resolve this multicore \"predictability problem\" by developing allocation mechanisms that enable shared hardware resources to be controlled in a predictable way. The research agenda in this project includes fundamental research on relevant real-time resource allocation problems, prototyping efforts involving real-time operating systems and middleware, and experimental evaluations of improvements enabled by the developed mechanisms in timing analysis tools (which are used to determine task execution-time budgets).<br\/><br\/>Addressing the \"predictability problem\" associated with multicore platforms would be a breakthrough result for safety-critical, cyber-physical systems in domains such as avionics and automobiles. When using multicore platforms to host highly-critical workloads in these domains, the current state of the art is to obviate the predictability problem by turning off all but one core. Unless a more intelligent solution can be found, such domains will not benefit from savings in size, weight, and power (SWaP) and gains in functionality that multicore platforms afford. Broader impacts include joint research with industry colleagues on supporting real-time workloads in unmanned air vehicles, the development of publicly-available open-source software that can be used by other institutions for research and teaching purposes, and the development of a new course on cyber-physical systems.","title":"CPS: Breakthrough: Collaborative Research: Bringing the Multicore Revolution to Safety-Critical Cyber-Physical Systems","awardID":"1239135","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":["31436"],"PO":["565274"]},"208718":{"abstract":"The problem of visual recognition is fundamental towards the goal of automatic image understanding. While a large number of efforts have been made in the computer vision community, machine performance at these tasks remains significantly inferior to human ability. <br\/>The overarching goal of this project is to leverage the best known visual recognition system - the human visual recognition system. This project employs a \"Human Debugging\" paradigm to replace various components of a machine vision pipeline with human subjects, and examines the resultant effect on recognition performance. Meaningful comparisons provide valuable insights and pinpoint aspects of the machine vision pipeline that are performance bottlenecks and require future research efforts. Specifically, the project considers the problems of image classification and object detection, and explores the roles of local and global information, as well part-detection, spatial modeling and contextual reasoning (including non-maximal suppression) for these problems respectively. <br\/>This project touches on a wide range of problems in visual recognition including object recognition, scene recognition and object detection. This novel paradigm of identifying weak links in computational models via humans in the loop is also applicable to other vision problems, as well as other sub-fields in AI. By sharing all collected data and results, and through organized conferences and workshops, this project will initiate and fuel a dialogue with the research community about leveraging humans to advance computer vision. More broadly, this work encourages the involvement of young women and undergraduate students in computer science research.","title":"RI: Small: Debugging Machine Visual Recognition via Humans in the Loop","awardID":"1341772","effectiveDate":"2013-02-11","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[559506],"PO":["564316"]},"198147":{"abstract":"The objective of this project is to enable more efficient and reliable operation of autonomous femtocell networks with agile spectrum access, autonomous interference control, as well as intelligent network self-organization and self-optimization. This project falls into four interacted thrusts: 1) Incorporate cognition into the femtocell networks to cognitively reuse the available spectrum sensed; 2) Develop distributed, dynamic and cooperative interference management schemes exploiting antenna techniques and based on sensed environmental conditions; 3) Investigate the scenarios and schemes that femtocells can be exploited to facilitate macrocell transmissions, and the potential gains in capacity, coverage and reliability; 4) Incorporate interference cancellation for data multicast, and develop techniques to support multiuser video streaming. The project also develops a testbed with open source programmable wireless platforms, for prototyping and evaluating the effectiveness of various techniques developed. <br\/><br\/>The proposed research has the potential to significantly increase the capacity and resilience of existing and future wireless networks. The agility and resilience of the system will also make it instrumental to support communications and applications that are important for national security and economy. The PIs will facilitate technology transfer through their industrial partners and industry affiliate programs. Complementary to the research agenda, the project will carry out a broad range of education and outreach activities, including integration of research findings into the courses, promoting underrepresented and undergraduate populations, and engaging with the K-12 schools to raise the level of student interests in pursuing advanced education and career in the areas of engineering and mathematics.","title":"Collaborative Research: EARS: Cognitive and Efficient Spectrum Access in Autonomous Wireless Networks","awardID":"1247924","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":["540553"],"PO":["557315"]},"199137":{"abstract":"Many systems must be periodically updated to add features, fix bugs, patch security vulnerabilities, and eliminate performance bottlenecks. In some systems, updates can be applied by simply halting the program, updating the code and data, and restarting the new version, but in critical systems even brief interruptions for maintenance are unacceptable. Although the research community has developed techniques for updating programs on the fly, existing frameworks only handle a single machine. To update the software running on a distributed system, programmers typically use ad hoc techniques that are difficult to reason about and prone to error.<br\/><br\/>The goal of this project is to develop foundational principles and practical techniques for managing distributed updates. A central theme is the use of bidirectional transformations to bridge the gap between different versions of a program, thereby allowing multiple versions to interoperate seamlessly. Specific contributions include developing (i) formal foundations for distributed updates, (ii) programming abstractions for constructing and deploying updates, (iii) verification tools for checking update correctness properties automatically, and (iv) an evaluation of these abstractions and tools on practical examples. The project will have broad impact by (i) discovering techniques for increasing the reliability of distributed systems during updates, (ii) building reusable software infrastructure for managing updates, and (iii) improving K-12 education and increasing the participation of underrepresented minorities in science through a high school outreach program.","title":"CAREER: Principles and Practice of Distributed Updates","awardID":"1253165","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":["556302"],"PO":["564588"]},"197213":{"abstract":"This project is providing support for graduate students to attend a workshop organized in conjunction with the fall 2012 annual symposium of the Association for Advancement in Artificial Intelligence. The workshop entitled Artificial Intelligence for Gerontechnology was held November 2nd to November 4th, 2012, in Arlington, Virginia. Gerontechnology is an interdisciplinary academic and professional field combining the study of aspects of aging and technology to address the challenges arising from the demographic changes due to aging society. Artificial intelligence techniques are considered to be among the key components of the solutions within the gerontechnology domain supporting care for elders. Intellectual Merit: The symposium advances the state of the art in artificial intelligence by considering problems and solutions that are inspired by the challenges in developing gerontechnology. Specifically, the topics addressed include the following: 1) novel approaches for dealing with sparsely annotated data, 2) innovative machine learning techniques that can improve the generalization of technological solutions across a wide range of real-world settings and 3) design of modeling algorithms that take advantage of domain knowledge. Broader Impacts: While the goal of the symposium was to advance the field of AI with the focus on elder care applications, the solutions resulting from the symposium can also be applied to other health care areas such as assisting chronic patients in hospitals and homes. In addition, the educational aspect of this workshop provides the opportunity to educate future workforce with expertise at the intersection of computer science, artificial intelligence and care for the elders.","title":"AAAI Fall Symposium: AI for Gerontechnology Student Travel Support","awardID":"1242748","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[529130,529131,"547675"],"PO":["564768"]},"199204":{"abstract":"The PI's long-term goal is to create theory to inform HCI design practices, to ensure the production of egalitarian designs that reflect all users' values. In particular, she aims to create feminist theory for HCI , which she hopes will close the gap in women's participation in computing. Previously, the PI has shown how approaches to designing for women are questionable when viewed in light of feminist theory. Feminist scholars argue that the lack of women in computing further discourages women from pursuing programming-related careers, and that women are also excluded because technologies created by men better address male needs. The PI believes the problem lies not only in who is excluded but in that the design processes inherently alienate women. Her approach is to address the problem by bridging previously unrelated aspects of the learning sciences, human-computer interaction, and the science and technology studies of gender, which will be combined with findings from a multi-year ethnographic study to acquire a deep understanding of how girls co-construct their gender and technical identities, how technologies come to be associated with one gender or the other, and how this affects girls' career choices. These results will be used as the basis for participatory design with the girls to create technologies in keeping with their gender identity. In doing so the PI expects to learn about girls' needs, enabling her to develop best practices for gender-sensitive design ensuring equitable access to technology. By bridging previously unconnected literatures, the project will reframe the problem of gender-equity in computer science from a pipeline issue to one requiring improved design and evaluation practices in HCI. The multi-year ethnographic study, to be conducted both in school and at after school programs, will provide a longitudinal understanding of how young women co-construct their gender and technical identities, what appeals to them about technical careers, and the process by which technology artifacts acquire symbolic gender. Participatory design will allow theory to be applied to understand what appeals to girls in the technology design process. While the project is not itself an education intervention, by building on both the empirical and theoretical contributions this research will explore how design practices themselves can be used to increase female participation in computing.<br\/><br\/>Broader Impacts: This research will directly impact women's training in computing, as well as lead to changes in the design process to be more inclusive for women. The project will create grounded theory on gender and technical identity that will inform participatory design, which in turn will allow the identification of needed changes to the software development process so that it results in more technologies that empower young women to use technology. As a consequence, the pool of qualified computer scientists will ultimately expand to include more women, which in the long turn will increase workforce thereby making the United States more globally competitive in business and more able to pursue scientific national security efforts. Furthermore, the project will directly benefit the group of young women involved in the ethnographic study, increasing their practical experiences with technology by teaching them software design, HCI, programming skills, and a foundation in computational thinking. Through participatory design the project will also expose middle and high school teachers to ubiquitous computing technologies, providing teacher development.","title":"CAREER: Towards HCI Theory for Technical and Gender Identity","awardID":"1253465","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[534324],"PO":["565227"]},"201459":{"abstract":"In order to apply emerging technologies (e.g. dynamic spectrum sharing) to address the wireless spectrum shortage problem, there is a critical need to understand global RF spectrum usage trends. To accomplish this, a three-pronged approach is being pursued: 1) deployment of geographically dispersed, temporally coordinated RF spectrum observatories in multiple U.S. locations, and through international collaboration, in Finland. The spectrum observatories use a common platform generating a single RF spectrum measurement dataset. 2) Development of empirically validated, statistical models of spectrum utilization for different wireless application types based on this dataset. 3) Use of \"big data\" analytical techniques to mine the dataset to discover temporal and spectral correlations not obvious using traditional approaches. As the models and relationships are refined, they will enable temporal and spectral occupancy predictions to support spectrum sharing for various circumstances and wireless applications.<br\/><br\/>The generation of a high-resolution, multi-location, multi-national spectrum usage dataset using a common, consistent measurement and storage approach is unique and allows direct, unambiguous comparisons of spectrum usage across geographies and demographics. The statistical models of spectrum utilization and the identified similarities and differences between regions and wireless services are unique and inform dynamic spectrum sharing research and related regulatory action with \"real-world\" data. Importantly, this is the first time that \"big data\" analytic approaches are being systematically applied to RF utilization data providing new insights motivating novel dynamic spectrum sharing approaches and improved spectrum efficiency.","title":"EAGER: Collaborative Research: Global RF Spectrum Opportunity Assessment","awardID":"1265266","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[540078],"PO":["557315"]},"199755":{"abstract":"This research studies the use of power combining in multi-antenna radios. Modern radio systems often use multiple transmit antennas and appropriate signal coding to improve throughput and reliability of wireless links. Ideally, each amplifier should be rated at the maximum total (or sum) power that can be transmitted from all antennas. Due to cost and efficiency considerations, the power rating is usually designed to be lower (typically the maximum total power divided by the number of antennas), and this can lead to significant performance loss. This research explores a solution using Power Combining Networks (PCN) that enable the output of an amplifier to be switched\/combined into any antenna, thus moving power from a weaker to a stronger antenna, resulting in improved link performance.<br\/><br\/>The maximum output power of a MIMO (Multiple Input, Multiple Output) antenna transmitter is limited due to bio-safety considerations. MIMO transmission performs best when each power amplifier is rated at the full system transmit power. If the amplifiers are fractionally rated due to cost and efficiency considerations, the worst case loss with M antennas can reach log M dB in the presence of channel imbalances. A PCN can reduce this loss significantly, trading the loss of array gain for a better channel coupling efficiency. Use of a PCN alters the effective MIMO channel and therefore can also change the optimum transmit coding. The goal of this research is to study fast algorithms for PCN selection, appropriate signal coding schemes and the best realizable performance.","title":"Power Combining Networks for MIMO Transmission","awardID":"1256548","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["553691",535565],"PO":["564898"]},"198149":{"abstract":"The objective of this project is to enable more efficient and reliable operation of autonomous femtocell networks with agile spectrum access, autonomous interference control, as well as intelligent network self-organization and self-optimization. This project falls into four interacted thrusts: 1) Incorporate cognition into the femtocell networks to cognitively reuse the available spectrum sensed; 2) Develop distributed, dynamic and cooperative interference management schemes exploiting antenna techniques and based on sensed environmental conditions; 3) Investigate the scenarios and schemes that femtocells can be exploited to facilitate macrocell transmissions, and the potential gains in capacity, coverage and reliability; 4) Incorporate interference cancellation for data multicast, and develop techniques to support multiuser video streaming. The project also develops a testbed with open source programmable wireless platforms, for prototyping and evaluating the effectiveness of various techniques developed. <br\/><br\/>The proposed research has the potential to significantly increase the capacity and resilience of existing and future wireless networks. The agility and resilience of the system will also make it instrumental to support communications and applications that are important for national security and economy. The PIs will facilitate technology transfer through their industrial partners and industry affiliate programs. Complementary to the research agenda, the project will carry out a broad range of education and outreach activities, including integration of research findings into the courses, promoting underrepresented and undergraduate populations, and engaging with the K-12 schools to raise the level of student interests in pursuing advanced education and career in the areas of engineering and mathematics.","title":"Collaborative Research: EARS: Cognitive and Efficient Spectrum Access in Autonomous Wireless Networks","awardID":"1247929","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[531761],"PO":["557315"]},"200679":{"abstract":"The rapidly advancing field of wireless technologies and mobile health (mHealth) is likely to play an important role in the future innovations that will help in transforming healthcare to be more individual-centered with a focus on prevention and wellbeing. Yet this nascent field requires advances and innovations ranging from theoretical concepts to large scale implementation. <br\/><br\/>Intellectual Merit: This project will provide funds to enable students to attend the conference. The participating students will benefit from exposure to computational thinking and advances in in wireless health technologies that utilize real-time data acquisition and inference to support just-in-time interventions. At the same time, they will also learn of the gaps in basic science as well as engineering that need to be addressed in order to achieve the anticipated benefits of the wireless technologies and mHealth. In addition, meeting the leaders in the fields will provide the students with models for selecting and addressing the key difficult problems that need to be solved. Finally, during the workshop, the participants will be meeting their fellow students, giving them an opportunity for scientific networking, so important in a rapidly advancing field.<br\/><br\/>Broader Impact: Wireless and mobile technologies are likely to have significant societal impacts in a variety of domains. There are indications that these fields will likely contribute significantly to revolutionizing healthcare, from clinical trials to healthcare delivery. These technologies are already changing the social interactions among individuals and groups. Among the most important potential benefits of these technologies are their impacts on bringing healthcare and education to underserved populations. This is reflected in the data suggesting that mobile technology frequently provides the only way for underserved populations to connect to the Internet and interact with the healthcare system. Students working in the field will have the opportunity to accelerate these trends. To achieve these goals the proposer is planning to emphasize the recruitment of women and minority students to attend the symposium.","title":"Mentorship and Student-Author Travel Grant for Wireless Health 2012 Conference","awardID":"1261409","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":["558157"],"PO":["560586"]},"196510":{"abstract":"Multicore platforms have the potential of revolutionizing the capabilities of embedded cyber-physical systems. Unfortunately, when such systems have safety-critical components, multicore platforms are rarely used. The reason is a lack of predictability associated with hardware components such as caches, memory controllers, etc., that are shared among cores. With current technology, very conservative estimates concerning the usage of these shared resources must be made, to certify that overuse violations do not occur at runtime. The resulting over-provisioning can be significant, easily negating the processing power of any additional cores. The goal of this project is to resolve this multicore \"predictability problem\" by developing allocation mechanisms that enable shared hardware resources to be controlled in a predictable way. The research agenda in this project includes fundamental research on relevant real-time resource allocation problems, prototyping efforts involving real-time operating systems and middleware, and experimental evaluations of improvements enabled by the developed mechanisms in timing analysis tools (which are used to determine task execution-time budgets).<br\/><br\/>Addressing the \"predictability problem\" associated with multicore platforms would be a breakthrough result for safety-critical, cyber-physical systems in domains such as avionics and automobiles. When using multicore platforms to host highly-critical workloads in these domains, the current state of the art is to obviate the predictability problem by turning off all but one core. Unless a more intelligent solution can be found, such domains will not benefit from savings in size, weight, and power (SWaP) and gains in functionality that multicore platforms afford. Broader impacts include joint research with industry colleagues on supporting real-time workloads in unmanned air vehicles, the development of publicly-available open-source software that can be used by other institutions for research and teaching purposes, and the development of a new course on cyber-physical systems.","title":"CPS: Breakthrough: Collaborative Research: Bringing the Multicore Revolution to Safety-Critical Cyber-Physical Systems","awardID":"1239246","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":["553590"],"PO":["565274"]},"193200":{"abstract":"This project develops a theory for understanding the requirements for control overheads in wireless networks and mechanisms for reducing the amount of these overheads. Network control mechanisms, such as scheduling, routing, and flow control, ensure effective data transport in a communication network, but also require the exchange of network state information, such as channel conditions and queue-length information, which amounts to 'control overhead'. The project investigates the tradeoffs between the rate of sending such control information, and the ability to effectively control the network in terms of performance metrics such as throughput, stability, delay and network utility. The project takes a two-pronged approach: First, a rate-distortion framework is being developed for understanding the impact of degraded network state information on network performance. Second, mechanisms are being developed for reducing the amount of control overhead and the impact of these mechanisms on network performance is being investigated. <br\/><br\/>The project develops a fundamental understanding of the requirements for protocol overhead, which will lead to more efficient network control policies, with reduced overheads. Such improvements will have a significant impact on network performance, especially in wireless networks, which experience large overheads due to protocol inefficiencies. The results will be widely disseminated through publication in conferences, journals and the web to help advance the wireless networking field. The broader impacts include training of graduate and undergraduate students and technology transfer to industry and government laboratories.","title":"NeTS: Small: Toward Reducing Control Overheads in Wireless Networks","awardID":"1217048","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[517543],"PO":["565303"]},"205619":{"abstract":"This project seeks to help support student attendance at the ACM Annual Symposium on the Theory of Computing (STOC) in Palo Alto, California, June 1-June 4, 2013, the 45th annual occurrence of this meeting. STOC, together with the IEEE FOCS meeting, are the premier conferences on the Theory of Computing in North America. In recent years the attendance at STOC has consistently exceeded 300 people. A large fraction of the attendees have been students, for whom the conference serves as a valuable educational experience, both as regards the technical content of the talks and the opportunities for networking that it provides.","title":"Student Travel to STOC 2013","awardID":"1319775","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}}],"PIcoPI":["550576"],"PO":["565157"]},"199306":{"abstract":"This research centers on theoretical and applied research on learning and representation of high-dimensional data. The term high dimensionality refers to the property that the number of variables or unknowns is typically much larger than the number of observations available at hand. A key challenge is being able to represent and learn such phenomena with sample and computational requirements scaling favorably in the number of dimensions. This project addresses these challenges through a graphical approach by exploiting the inherent graphical structure present in many large data-sets.<br\/><br\/>This research considers modeling high-dimensional data through probabilistic graphical models, also known as Markov random fields. An important research thrust of this proposal is to develop novel algorithms for learning and inference under the framework of graphical models. Another important thrust of this proposal is to develop efficient scalable models for representing high-dimensional data beyond the traditional framework of graphical models. This research establishes strong theoretical guarantees for the developed methods, as well as applies them to real data in various domains, including genetic and financial data, and data from large online social networks such as Facebook and Twitter.","title":"CAREER: Modeling Dependencies via Graphs: Scalable Inference Methods for Massive Datasets","awardID":"1254106","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[534528],"PO":["564898"]},"199229":{"abstract":"The proposed project addresses the problem of reconstruction of ancestral genomes and evolutionary history of genomes that may deviate in gene content, resulting from genome rearrangements as well as gene duplications and deletions evolutionary events. It will close the gap between steadily growing number of sequenced genomes and incapability of existing phylogenetic reconstruction tools to process diverse varieties of genomes.<br\/><br\/>The new PRUGC software will employ the framework of multiple breakpoint graphs that will be extended to address new algorithmic challenges arising from genomes having unequal gene contents. As some of these challenges may be hard and have no computationally feasible solutions, instead of focusing on a fixed evolutionary model and attempting to fit biological problems into it, the PI will let the model be flexible and problem-driven. In the course of PRUGC development, the PI plans to address the following particularly important biological problems (listed in the order of growing complexity): the primate-rodent-carnivore split controversy in mammalian evolution (featuring relatively small number of duplications); phylogenetic analysis of a diverse variety of yeast genomes including genomes that undergone whole genome duplications; and evolutionary problems in plant evolution rich in segmental duplications. Solutions to these problems will help to better understand the mechanisms behind chromosome evolution across variety of genomes. The reconstructed ancestral genomes will provide insights to functional significance of particular gene orders, help to rigorously estimate the rate of genome rearrangements and gene duplications\/deletions in different organisms, and allow testing hypotheses about their mechanisms and influence on shaping genomic architectures. It is important to emphasize that the PRUGC software will have a wide range of applications, not limited to the aforementioned problems. The PRUGC software will be helpful in various phylogenomic studies within projects like \"Tree of Life\", \"Genome 10K\", and \"i5k\". It will be released as both a standalone open-source tool and an online web-server application readily accessible for use by biologists.<br\/><br\/> The project will support research activities in the PI's research lab. In particular, it will help to prepare a new generation of researchers in bioinformatics by providing the opportunities to have hands-on experiences in both computer science and biology. One undergraduate student and two Ph.D. students will be recruited with the support of this project, and the PI will mentor these students and prepare them for building their careers in academia or industry. The PI will make every effort to help the students gain first-hand experience of biology, including short-term visits to our local, national, and international collaborators. Such experience will also help the students to develop and enhance their ability to communicate with researchers in other areas, an important skill in interdisciplinary research.<br\/><br\/> The project will also offer an excellent opportunity for computer science students to learn about experimental and theoretical research in the interdisciplinary area of bioinformatics. Detailed explanation of the whole process of multiple genomes comparison will perfectly fit into a timeframe of a bioinformatics course. The PI plans to lecture this material within the bioinformatics course CSCE 555 offered for undergraduate and graduate students at the University of South Carolina. As a member of the Bioinformatics Education Alliance developing \"Bioinformatics for Biologists\" (B4B) textbook, the PI coordinated with the editors preparation of a new chapter module and web-based educational materials for the next edition of B4B that will expand the current chapter on genome rearrangements and illustrate their applications with a number of biological problems within the PRUGC project.","title":"CAREER: PRUGC---Phylogenetic Reconstructions with Unequal Gene Contents","awardID":"1253614","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[534374],"PO":["565136"]},"201429":{"abstract":"Transferring high bandwidth content is a challenge in vehicular and mobile networks that are limited by spectrum scarcity in the unlicensed bands, short connection times, and the cost of cellular data plans. These observations motivate the use of frequency agile cognitive radios as part of the project called CDRIVE (for Cognitive raDio enabled spectRum-aware Intelligent Vehicular nEtworks). CDRIVE involves the use of theoretical analysis tools and exploration of correlation functions. A major contribution lies in creating a new ns-2 based simulation tool that combines spectrum-related functions in a cognitive radio within a vehicular environment. CDRIVE makes advances towards developing a holistic framework for vehicular cognitive radios networks for allocating roadside base station locations that have spectrum database access capability, enhancing the science of collecting spectrum measurements under different topographical conditions, surrounding urban structures and speeds, and devising a new rate control mechanism that anticipates network and correlated road congestions, and intermittent disruptions due to spectrum outages. CDRIVE will yield insights on integrating cognitive radios with spectrum databases, especially for mobile networks, which are now mandated by the FCC. It will provide the theory and practical validation of the best mobility-aware spectrum-sensing strategies, and tightly couple the external environment with the sensing method. It will also shape future safety-related messaging in vehicles, support real-time telemetry analysis, and allow high-bandwidth communication for emergency response personnel.","title":"EAGER: CDRIVE: Cognitive Radio Enabled Spectrum Aware Intelligent Vehicular Networks","awardID":"1265166","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[540006],"PO":["557315"]},"205928":{"abstract":"The purpose of this travel grant is to increase participation at the 2013 International Workshop on Software Engineering for Computational Science and Engineering Workshop, taking place in Conjunction with the International Conference on Software Engineering 2013. The grant will increase the amount and diversity of participation from the Software Engineering and Computational Science\/Engineering communities, help nurture interactions, synergies and collaborations involving the two communities, and help build the next generation of knowledgeable researchers and practitioners working on software development to sustain and advance software for computational science and engineering. The funds will support faculty and students, with attention to underrepresented groups.","title":"Travel Grant to Support Participation in the 2013 International Workshop on Software Engineering for Computational Science and Engineering","awardID":"1321448","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["551799"],"PO":["564388"]},"206809":{"abstract":"This is funding to support participation by approximately 8 graduate students (6 domestic and 2 international) along with 4 senior members of the community (faculty and industry researchers) in a Doctoral Consortium (workshop) to be held in conjunction with and immediately preceding IEEE Virtual Reality 2013, which will take place March 18-20, in Orlando, Florida, immediately following the IEEE Symposium on 3D User Interfaces and preceding the ACM SIGGRAPH Symposium on Interactive 3D Graphics and Games. Virtual reality (VR) is a multidisciplinary field involving human-centered computer simulations that seek to imitate or augment real world senses (usually sight, sound, and touch) and experiences. VR research includes developing and assessing methods and systems, and facilitating and understanding user perceptions, beliefs, and behaviors. First organized by the IEEE Computer Society in 1993, IEEE Virtual Reality is the premier international conference and exhibition in this field and includes prestigious technical paper presentations, workshops, tutorials, research demonstrations, and exhibits from industry. Based on prior year numbers, IEEE VR 2013 expects over 300 registrants, 20 exhibitors, and 30 student volunteers. More information about the conference may be found online at http:\/\/www.ieeevr.org\/2013. <br\/><br\/>Inspired by broad student interest and successful events at past CHI and ISMAR conferences, this will be the first Doctoral Consortium associated with IEEE Virtual Reality. The schedule includes a pre-event dinner where the students can meet and encourage each other socially, followed by a day-long private workshop where they each present their work to a panel of senior VR researchers and receive specific constructive feedback. Each student will prepare a poster on his\/her research, (which will also be on display during the conference as part of the poster presentations), and will have a total of 50 minutes for a presentation during the workshop, of which approximately 20 minutes is reserved for an extensive discussion with the other graduate student participants and the senior researchers. Discussions will be run freely but will be facilitated by the DC co-chairs and mentors, who will address the strengths of the work, challenges and issues that may arise, and implications of the results. Talk titles and abstracts, along with the procedures followed, will be archived in an IEEE VR 2013 binder as a reference for the following year's conference.<br\/><br\/>Broader Impacts: The goal of the Doctoral Consortium is to provide an interactive and supportive mentoring opportunity for mid-level graduate students in virtual reality, to afford these students a valuable opportunity to get independent perspectives on their research from senior individuals with a wide collective breadth and depth of knowledge, and to build a cohort of young researchers within the VR community. The organizers will take steps to achieve diversity among the students with respect to research topics, disciplinary backgrounds, methodological approaches, and home institutions (no more than one graduate student will be accepted from any one institution). Factors such as gender and ethnicity will also be taken into account, with an emphasis on including underrepresented groups.","title":"WORKSHOP: IEEE VR 2013 Doctoral Consortium","awardID":"1330149","effectiveDate":"2013-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[553729],"PO":["565227"]},"199309":{"abstract":"Human interaction with computers, and especially with the Internet, is ever increasing. As a consequence the field of cyber-psychology, which studies the thinking, behavior and attitudes of the person using the computer, is of growing importance. To date, studies in cyber-psychology have collected Internet usage data by means of self-reported surveys only, an approach which suffers from a number of drawbacks including human error, bias due to user concerns relating to social desirability, and limits on the volume and dimensionality of the data obtained. The PI's vision in this project is to advance human behavior assessment based on real Internet usage data, that is to say Internet usage data collected continuously, passively and unobtrusively without manual intervention while carefully maintaining user privacy expectations. To these ends, the PI will develop practical foundations, create two Internet enabled applications (one relating to online mental healthcare and the other to online socializing), and leverage results in behavioral psychology to design classification algorithms that demonstrate the ability to achieve significant insights and to detect behavioral similarities (relating to symptoms of depression and preferences in social contacts) based on Internet usage. The project builds on the PI's preliminary work that exploited real Internet usage data collected from Cisco NetFlow records to identify fine-grained Internet usage features associated with symptoms of depression, and will be executed with college students as primary subjects. The PI will collaborate in the current project with experts from the psychological and social sciences, clinical psychiatry, and the FBI's cyber crimes division. Outcomes will include an accurate characterization of Internet usage minimally affected by error and bias, and a large number of Internet usage features of high granularity for assessing human behavior, which together will yield insights and conclusions readily adaptable for practical utility.<br\/><br\/>Broader Impacts: This research will advance our ability to assess human behavior based on Internet usage data. The online mental healthcare application will yield Internet enabled proactive, early and cost -effective mental health care to complement care in existing clinical settings, while the online socializing application will lead to improved online social experiences by leveraging mutual social preferences. Applications of the research to mitigating Internet fraud and detecting cyber bullying are immediate. The PI will collaborate with HBCU and RUI institutions as well as K-12 schools to further enhance project outreach.","title":"CAREER: Human Behavior Assessment from Internet Usage: Foundations, Applications and Algorithms","awardID":"1254117","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["560279"],"PO":["565227"]},"197529":{"abstract":"Increasingly, online social media are playing a pivotal role in shaping public opinion, but there are few tools available to gauge the reputation of contributors to the informal knowledge marketplace anchored by platforms like Wikipedia, YouTube, Facebook and Twitter. This project will develop a broad multi-disciplinary community of experts from the social sciences, computer sciences, and statistics focusing on researching expertise and reputation in social media and develop a data-intensive approach for research in this area (KredibleNet). It will create the community and capacity to design and build large scale data analysis and management infrastructure to engage the challenge of understanding how these new knowledge markets are shaped by social interactions and reputations built around functional roles. <br\/><br\/>Through a series of workshops and use of an online platform, this nascent community will refine the conceptualization, operationalization and measurement of reputation as a component of online knowledge and create a roadmap for future research directions. The team will also develop and disseminate tools for data management, analysis and visualization of online reputation data and collaboratively design a prototype reputation measurement cyberinfrastructure platform that can be used for experimentation. This platform will include new data management and analysis tools to enable access to live social media data from sources such as Wikipedia, Twitter and YouTube. The resulting tools and dataset will equip the community with the capability to experiment with data-intensive analytic strategies and to better understand the nature of the reputation measurement problem. <br\/><br\/>The ultimate goal of KredibleNet is to shape the next generation of theoretical and analytic strategies needed for understanding how knowledge markets are influenced by social interactions and reputations. The community discussions will ensure that the infrastructure developed to fill the current conceptualization and measurement gaps, data management capabilities and analytic tools will provide as much benefit as possible to all the related fields in industry and the sciences; they will also likely give rise to new research synergies. The tools that will be developed will render the existing large databases amenable to analysis allowing scholars and practitioners to address a broad set of questions and gain valuable insights. The potential users of these tools, data, and ideas are quite widespread extending to multiple scholarly domains, policy communities, and industry partners. They will be made available publicly, so others may benefit from the results of this project to develop the next generation of \"information gauges\" that can help tomorrow's information consumers make smarter choices.","title":"KredibleNet - Building a research community and proposing a research agenda for the study and modeling of reputation and authority across informal knowledge markets","awardID":"1244708","effectiveDate":"2013-02-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8068","name":"Data Infrastructure"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":[529956,"549253",529958,529959],"PO":["564840"]},"206093":{"abstract":"This project will support approximately 10-15 U.S.-based graduate students to attend the 11th USENIX Symposium on File and Storage Technology (FAST), which is scheduled to take place February 12-15, 2013. FAST is a leading forum for innovative research in storage systems, bringing together researchers and practitioners from both industry and academia. Topics include reliability, performance, mobility, power management, measurement, and other areas germane to file and storage systems. Participation in leading conferences is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work.","title":"USENIX Student Stipend Grant, FAST 2013","awardID":"1322157","effectiveDate":"2013-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[551737],"PO":["565255"]},"209056":{"abstract":"Linguistic code switching (LCS) is the practice of switching back and forth between the shared languages of bilingual or multilingual speakers. This phenomenon is particularly prevalent in geographic regions with linguistic boundaries or where there are large immigrant groups. Various levels of language (phonological, morphological, syntactic, semantic and discourse-pragmatic) may be implicated in LCS in different language pairs and\/or genres. Computational algorithms trained for a single language quickly break down when the input includes LCS. A major barrier to research on LCS in computational linguistics (CL) has been the lack of large, accurately annotated corpora of LCS data. In this project, a large repository of LCS data is collected and a large annotation infrastructure is developed. It is consistently annotated in different modalities (speech and text), at various levels of linguistic granularity, and across different language pairs reflecting different linguistic typologies (Standard Arabic and Dialectal Arabic, Arabic-English, Spanish-English, Chinese-English, Hindi-English). The focus of the effort is on intra-sentential LCS.<br\/><br\/>This infrastructure and unified large LCS data resource is eagerly awaited by the CL research community, since annotated LCS data provides a natural test-bed for adaptive learning algorithms and the handling of diverse data sources, as well as a framework for genuine multilingual processing. It will also be of benefit to sociolinguistic and theoretical linguistic researchers, and provide a platform for collaborative interdisciplinary research. Finally, research on LCS helps overcome biases against multilingual speakers by demonstrating the creativity of such speakers in exploiting their verbal repertoires. Such a result is particularly important for K-12 education and testing policies in the USA with its diverse immigrant population.","title":"CI-ADDO-NEW: Collaborative Research: A Repository for Annotating Multilingual Code Switched Data","awardID":"1343530","effectiveDate":"2013-02-01","expirationDate":"2015-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[560340],"PO":["565215"]},"204580":{"abstract":"This is funding to provide financial support for 10 graduate students (at least 8 of them registered at U.S. universities and working towards either their Master's degree or a Doctorate) to attend the 2013 International Conference on Intelligent User Interfaces (IUI 2013), to be held March 19-22 in Santa Monica, California, as participants in a special Student Consortium (workshop), as presenters in the main conference, and as attendees at the conference for general training purposes. Sponsored by ACM, the annual IUI conferences represent the growing interest in next-generation intelligent and interactive user interfaces; they are the premier forum where researchers from academia and industry, who work at the intersection of Human-Computer Interaction (HCI) and Artificial Intelligence (AI), come together to exchange complementary insights and to present and discuss outstanding research and applications whose goal is to make the computerized world a more amenable place. Unlike traditional AI the focus is not so much on making the computer smart all by itself, but rather on making the interaction between computers and people smarter. Unlike traditional HCI, there is a focus on solutions that involve large amounts of knowledge and emerging technologies such as natural language understanding, brain computer interfaces, and gesture recognition. To this end, IUI encourages contributions not only from computer science but also from related fields such as psychology, cognitive science, computer graphics, the arts, etc. IUI 2013 will be the 16th conference in the series; topics of interest this year include: intelligent interactive interfaces, systems, and devices; ubiquitous interfaces; smart environments and tools; human-centered interfaces; mobile interfaces; multimodal interfaces; pen-based interfaces; spoken and natural language interfaces; conversational interfaces; affective and social interfaces; tangible interfaces; collaborative multi-user interfaces; adaptive interfaces; sensor-based interfaces; user modeling and interaction with novel interfaces and devices; interfaces for personalization and recommender systems; interfaces for plan-based systems; interfaces that incorporate knowledge- or agent-based approaches; help interfaces for complex tasks; example- and demonstration-based interfaces; interfaces for intelligent generation and presentation of information; intelligent authoring systems; synthesis of multimodal virtual characters and social robots; interfaces for games and entertainment; for learning-based interactions and for health informatics; empirical studies and evaluations of IUI interfaces; and new approaches to designing intelligent user interfaces. More information about the conference is available online at http:\/\/iuiconf.org\/. <br\/><br\/>The IUI 2013 Student Consortium will build on the success of the first such event last year. The heart of the Consortium will be a full-day workshop on March 19, immediately preceding the conference, and will be structured to give student trainees exposure to their new research community by giving a 20-30 presentation on their work and receiving feedback from peers and a panel of 4-5 senior researchers. Group lunch and dinner will encourage social interaction among the student cohort and informal personal interaction with the mentors. The students' work will also be featured during the main conference in a poster session, where they will gain additional experience explaining their work to others in the field. The IUI conference organizers will pay for audio-visual services, two coffee breaks, and space for accommodating attendees in the student session; no funds are requested for these items from NSF.<br\/><br\/>Broader Impacts: This funding will enable attendance at the IUI conference by students who might otherwise be unable to do so for financial reasons. It will enhance the educational experience of funded participants, by bringing them into contact with leading researchers in the field and by exposing them to the lively discussion during the course of the conference that often leads to opportunities for career advancement. The quality of the conference itself will be enhanced as well, thanks to a broadening of the base of institutions represented and increased diversity of participants. The rich exchange of ideas at IUI has previously proven to be a valuable source of ideas for future research, as well as leading to collaborative efforts; this funding will extend the opportunities for collaboration and provide intellectual stimulus to programs that have previously sent few or no representatives to this conference. The organizing committee has undertaken to proactively recruit student participants from schools that have not traditionally been well represented in the IUI community. Women, minority students, the disabled, and veterans all will be encouraged to participate. To further assure diversity, no more than one student will be accepted from any given","title":"WORKSHOP: Student Consortium at the 2013 ACM Conference on Intelligent User Interfaces","awardID":"1313847","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[547903],"PO":["565227"]},"209156":{"abstract":"Modern data centers are becoming the next computing platform for the Internet. These massive farms of computer servers are an indispensable component of the information age, enabling applications like web search, social networks, cloud computing, as well as distributed file and video sharing. The problem of storing and processing massive amounts of information over networks is significant and challenging.<br\/>Still, most existing distributed storage systems represent information by suboptimal replication schemes combined with ad-hoc networking protocols. This research is focused on understanding, on a fundamental level, how to represent, store, and process information in distributed storage systems.<br\/><br\/>Specifically, this research involves the design of novel distributed storage codes that use network coding theory to address modern storage challenges. As is well known, general multi-source information theory problems can be notoriously intractable. This research focuses on the framework of storage networks and builds on recent results of the PI to investigate: 1) Dynamics of coded storage systems. How to maintain coded information representations over networks. Prior work has demonstrated the key role of network coding for such problems but the fundamental bounds remain unknown for several cases of interest. 2) Interference Alignment for Network Coding. Interference alignment techniques were introduced to mitigate wireless interference at the physical layer but also have surprising applicability in distributed storage and other network coding problems. This research is developing a novel mathematical framework that interprets interference alignment techniques through optimization theory. This project is strongly coupled with educational developments and outreach through an online wiki bibliography and online tutorial presentations.","title":"CAREER: Network Coding Theory for Distributed Storage","awardID":"1344179","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["560870"],"PO":["564924"]},"199180":{"abstract":"The security architecture of consumer operating systems is currently undergoing a fundamental change. In platforms such as Android, iOS, and Windows 8, each application is a separate security principal that can own data. While this distinction is a vast improvement over traditional user-focused security architectures, sharing data between applications results in an unexpected loss of control of that data, potentially exposing security and privacy sensitive information. This research improves the security of these modern consumer operating systems by providing a holistic view of data protection. In particular, this work proposes a new operating system abstraction for transparently tracking and controlling access to all data, allowing policy to determine if a reader is given the true value, a fake or modified value, or no value at all. To efficiently and practically accomplish this goal, this work combines several existing and new techniques to track and control access to data. The new abstraction provided by this work not only solves a significant problem affecting modern consumer operating systems by enabling applications to retain pervasive control over their data, but also more broadly provides a new abstraction on which a variety of new security solutions can be built.","title":"CAREER: Secure OS Views for Modern Computing Platforms","awardID":"1253346","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[534276],"PO":["565327"]},"206211":{"abstract":"The US Ignite effort is a joint public\/private initiative with the primary goal of breaking a fundamental deadlock: there is insufficient investment in gigabit applications that can take advantage of advanced network infrastructure because such infrastructure is rare and dispersed. And conversely, there is a lack of broad availability of advanced broadband infrastructure for open experimentation and innovation because there are few advanced applications and services to justify it. US Ignite intends to break this deadlock by providing incentives for imagining, prototyping, and developing public sector gigabit applications and by leveraging and extending this network testbed across US campuses and cities. Applications for US Ignite should support national priority areas of advanced manufacturing, clean energy and transportation, cyber learning, health IT, and public safety\/emergency preparedness. <br\/><br\/>This project will support participation of up to 17 academics and students in a workshop, the \"Next-Generation Developers Workshop,\" to be held February 1-2, 2013 in San Leandro, CA. The workshop purpose is to catalyze a long-term, high-level developer community to advance the creation of next generation Internet applications, especially those that make use of SDN technology.<br\/><br\/>There is significant SDN and network virtualization progress being made by private industry and the NSF Global Environment for Network Innovation (GENI)project. GENI further extends virtualization capabilities by allowing the construction of custom combinations of virtualized computation and communication. However, the process of using these advances to conceptualize next generation network applications and their capabilities is lagging. The workshop will identify existing and emerging standards, APIs, tools, educational materials, and examples that will help enlarge the US Ignite development community and engage existing members in capabilities they may not have realized were available. The workshop will develop sharable lists of issues, barriers, educational materials, missing APIs, and other impediments to creating next generation applications. In addition, the workshop will engage faculty and students in the process of understanding the technology issues associated with US Ignite and in the process of developing transformative applications.","title":"US Ignite Next Generation Developers Workshop","awardID":"1322829","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["563429"],"PO":["564993"]},"199171":{"abstract":"Wirelessly networked systems of intra-body sensors and actuators could enable revolutionary applications with a strong potential to advance medical treatment of major diseases of our times. Yet, most research to date has focused on communications along the body surface among devices interconnected through traditional electromagnetic radio-frequency (RF) waves; while the key challenge of enabling networked intra-body miniaturized sensors and actuators that communicate through body tissues is substantially unaddressed. The main obstacle to enabling this vision is posed by the physical nature of propagation in the human body, which is composed primarily of water, a medium through which RF electromagnetic waves do not easily propagate. This project takes a different perspective and investigates for the first time the fundamentals of ultrasonic networking in human tissues through a closed-loop combination of mathematical modeling, simulation, and experimental evaluation. The project is investigating four intertwined research tasks, i.e, (i) ultrasonic channel modeling and capacity analysis; (ii) physical\/medium access control layer solutions for ultrasonic communications; (iii) distributed and asynchronous cross-layer control and resource allocation algorithms based on stochastic modeling of ultrasonic interference; (iv) performance evaluation through a multi-scale simulator and a software-defined testbed.<br\/><br\/>The project will integrate research and education with the following core contributions: (i) establishment of a visiting scholar program with a focus on ultrasonic networking and its applications; (ii) establishment of a new graduate\/undergraduate course on acoustic\/ultrasonic networking, and development of a new textbook on this topic; (iii) a broad set of activities to reach out to underrepresented students; (iv) pursuit of technology transfer activities in this field. The project can lead to novel, safe and energy-efficient methods of communication between implanted medical devices and the outside world.","title":"CAREER: Towards Ultrasonic Networking for Implantable Biomedical Devices","awardID":"1253309","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["555021"],"PO":["565303"]},"199271":{"abstract":"The classical theory of error-correcting codes by Shannon and Hamming has developed into a flourishing subject, and has been hugely influential in the design of communication and storage systems. However, the more modern aspects of error-correcting codes, including those relevant to complexity theory and pseudorandomness, have lagged behind, and many challenges and problems are not well understood. This project aims to remedy this situation by systematically exploring what can be achieved in the realm of local-decoding, local-testing, list-decoding and local list-decoding, and by exploring the implications of this in complexity theory and pseudorandomness. <br\/><br\/>This project proposes to investigate new constructions of error-correcting codes supporting sublinear-time error-detection, sublinear-time error-correction and efficient list-decoding, as well as their applications in the areas of computational complexity theory and pseudorandomness. The project builds upon several recent advances made by the PI, such as the construction of new high rate error-correcting codes allowing, for the first time, sublinear-time error-correction.<br\/><br\/>The educational component of this project will involve the mentoring and education of junior researchers who intend to pursue a career in research, as well as the development and dissemination of new course materials and broadly accessible presentations of the results of this research.","title":"CAREER: Error-Correcting Codes, Complexity Theory and Pseudorandomness","awardID":"1253886","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}}],"PIcoPI":[534458],"PO":["565157"]},"199282":{"abstract":"Advances in microprocessor technology have been the main engines for growth in the computing industry for decades. Microprocessor performance has improved at a remarkable rate for many years owing to technological and microarchitectural innovations. Unfortunately technology scaling has reached an impasse in recent years. Significant challenges with the chip manufacturing process in low-nanometer dimensions are causing high variability in transistor behavior leading to lower performance, higher power consumption and higher susceptibility to errors. In general, high variability leads to larger design margins making chips less energy efficient. These technological challenges are happening at a time when the need for energy efficient computing is greatest. With the rapid proliferation of cloud-based computing and the explosion of smart mobile devices energy efficiency is now crucial to the entire range of computing markets from servers to smartphones. Achieving continued performance growth in these systems going forward requires dramatic improvements in the energy efficiency of computation.<br\/><br\/>In this work, new microarchitectural and software solutions for lowering design margins in future chips are being developed, achieving substantial energy reduction while ensuring reliable operation. These solutions employ variation-aware design across multiple layers of the computing environment including microarchitectural innovations, new firmware and operating system-based scheduling and power management solutions. New technology models that for the first time integrate multiple sources of variability are being developed for this purpose, enabling the design of variation-aware solutions. The work identifies new reliability challenges that affect supply voltage stability in chips with large numbers of compute units such as many-core and graphics processors. It develops novel process and voltage variation-aware scheduling and power management algorithms that reduce voltage instability eliminating the need for large and inefficient design margins. At the microarchitectural and firmware levels the work develops new mechanisms for dynamically reducing voltage margins by leveraging on-chip resiliency mechanisms to ensure reliable and efficient execution. These solutions are dramatically improving the energy efficiency of computation and are therefore expected to have a significant impact on the computing industry and society in general.","title":"CAREER: An Integrated Treatment of Voltage Noise and Process Variability in Many-core and GPU Systems with Microarchitectural Solutions","awardID":"1253933","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":[534480],"PO":["366560"]},"199293":{"abstract":"This project investigates how information from social networks may be used to create efficient and cooperative large-scale distributed data sharing systems. Two of the challenges facing such systems are locating data quickly and cost-efficiently, and enforcing cooperative node behaviors. Social network-based approaches seek to build social networks into data sharing systems in order to leverage the real-world friend properties of mutual trust and common interest. Although these approaches can significantly reduce cost and complexity compared to purely technical approaches, current methods only make use of a very superficial level of social network properties, and cannot support the broad goal of enabling all nodes to share data freely and efficiently. This project addresses these shortcomings through more fully leveraging social network properties, and coordinating social network-based approaches with technical approaches. Areas of investigation include infrastructures for data searching, cooperation enhancement mechanisms, and algorithms for data server selection. <br\/><br\/>Today, a multitude of large-scale distributed systems use the Internet to deliver a variety of data -- such as software and audio\/video content -- to end users. These systems support many social, commercial, and cultural activities. Millions of dollars are spent on commercial servers to deliver this data. Peer-to-peer technology, in which user computers cooperate to share content between themselves, has potential for doing this cheaper and faster. However, wider use of peer-to-peer technology is held back by several limitations. One is that nodes may misbehave, selfishly receiving content but not contributing in return, or distributing corrupted or malicious content into the system, to be further spread by unsuspecting users. Another limitation is that locating content is difficult, due to the wide distribution of nodes and the lack of a central index. This project seeks to address these limitations by making use of information obtained from social networks. Potential benefits of the work include savings in the costs of infrastructure and energy consumption for data distribution. The project also provides educational opportunities for graduate and undergraduate students, and collaborates with other educational programs for under-represented student recruitment, and outreach to K-12 students.","title":"CAREER: A New Efficient and Cooperative Large-Scale Distributed Data Sharing System","awardID":"1254006","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563519"],"PO":["564778"]},"201460":{"abstract":"Cognitive wireless systems are a collection of wireless network entities that are able to adapt intelligently to the environment through observation, exploration and learning. This project designs methods for cognitive radio systems to compete for inhomogeneous spectrum resources and to establish, without explicit coordination, a spectrum etiquette. Each system's resource utilization strategy must be decided with only imperfect information of other systems' actions, and the resulting adaptations must discourage any one system from manipulating the agreed spectrum etiquette. The framework of dynamic games with imperfect private monitoring is adopted to design coexistence mechanisms for cognitive radio systems sharing inhomogeneous resources and to analyze the stability, robustness, complexity, and convergence of these mechanisms. This work directly impacts the development and standardization of frequency agile wireless systems that can more efficiently use the available spectrum to support increasing demand for ubiquitous wireless connectivity at high data rates. The project is a collaborative effort between researchers in the US (at Virginia Tech and the University of Houston) and Finland (at the University of Oulu). This work will extend the state of the art in cognitive system adaptations by incorporating the ability to: efficiently adapt under imperfect information; fairly share inhomogeneous resources; and discourage manipulation of resource use by selfish adversaries. Results will be disseminated in high impact journals and conferences; the designed coexistence mechanisms will also be presented to industry and regulators in the US and Europe.","title":"EAGER: Collaborative Research: Joint Adaptation of Multiple Cognitive Systems without Explicit Coordination","awardID":"1265268","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[540080],"PO":["557315"]},"208842":{"abstract":"The objective of the research is to develop design technologies that can alleviate the general robustness issues of the next-generation nonvolatile memories while maintaining and even improving the generic memory specifications such as density, power and performance. Comprehensive solutions are integrated from architecture, circuit and device layers for the improvement on the density, cost and reliability of emerging nonvolatile memories. <br\/><br\/>The design techniques include 1) a new write endurance improvement technique for multi-level cell devices to prolong the lifetime of the new nonvolatile memories by applying the coding and wear-leveling techniques that are monitored and controlled by self-contained circuits; 2) self-reference and other adaptive sensing techniques to overcome the impacts of process variations and device wear-out mechanisms for yield improvement.; and 3) a new interleaved 3D-stacking memory integration scheme and peripheral circuit design to increase the number of stacks integrated within a certain height. <br\/><br\/>The broader impact of the research lies in revealing the importance of applying cross-layer design techniques to resolve the robustness issues of the next-generation NVMs and the attentions to the robust design context. The system architects, the circuit designers and the device integration engineers can be well bridged and educated by the research innovations. The developed techniques can be directly transferred to industry applications under the close collaborations with several industry partners, and directly impact the future computing systems. The activities in the collaboration also include the tutorials in the major conferences on the technical aspects of the projects and new course development.","title":"CSR: Small: Collaborative Research: Cross-Layer Design Techniques for Robustness of the Next-Generation Nonvolatile Memories","awardID":"1342566","effectiveDate":"2013-02-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["107868"],"PO":["565255"]},"199283":{"abstract":"It is estimated that in the United States many thousands of people are killed each year and billions of dollars lost due to medical errors. The PI argues that one way to reduce the incidence of such errors is through education involving human patient simulator (HPS) systems. Although perhaps the most commonly used android robots in America, a critical technology gap is that none of the commercially available HPS systems exhibit realistic facial expressions, gaze, or mouth movements, despite the vital importance of these cues in how providers assess and treat patients. The PI's goal in this project is to address this shortcoming by developing novel expression synthesis algorithms and social control methods, thereby advancing the fields of affective computing and human-robot interaction. To these ends the PI will model facial features characteristic of 3 pathologies (stroke, cerebral palsy and dystonia, the latter being a neurological disorder in which the muscles of the trunk, shoulders, and neck go into spasm so that the head and limbs are held in unnatural positions), and 2 affective states (pain and drowsiness). She will synthesize these facial features on a new HPS system and create a model of shared social control for operators of expressive robots, and evaluate their impact on educational and task outcomes. <br\/><br\/>Broader Impacts: This research will transform the state of the art in HPS technology by enabling educators to run simulations currently impossible with commercially available technology, thereby leading to more realistic training experiences for doctors, nurses, and combat medics, which will ultimately improve healthcare. It will create new facial models of stroke, dystonia and cerebral palsy, which may impact fields such as computer vision and biometrics while also enhancing our understanding of these disorders and providing a means for educating people how to better interact with those suffering from these disabilities and\/or to quickly recognize signs of stroke. The PI will also conduct substantial mentoring activities for undergraduates and outreach activities for K-12 students.","title":"CAREER: Next Generation Patient Simulators","awardID":"1253935","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[534482],"PO":["565227"]},"199294":{"abstract":"This research will advance our knowledge of user-generated doctor ratings on the Internet, thereby providing the basis for improving these systems and increasing their value for better consumer choices. In so doing, the research will achieve a more general advance in our understanding of online reputation systems. The study has three aims: (1) to examine the supply of online doctor ratings, including their prevalence, growth trends, and the factors that affect rating posting behavior; (2) to assess the informedness of online doctor ratings, especially whether these ratings truly reflect the quality of the doctor or whether they are biased and misleading, and (3) to understand the use and impacts of online doctor ratings.<br\/><br\/>Despite the growing popularity of online physician ratings, there is surprisingly little study of this emerging trend. What motivates patients to provide online ratings? To what degree do the ratings reflect a doctor's clinical quality? How do patients use these ratings, and how are their decisions affected as a result? In what situations should patients be cautious when using online doctor ratings? Can the user interface design and information display be improved to make the ratings more useful? The research represents the first systematic study of these fundamental questions.<br\/><br\/>Findings from this study will have a direct impact on the policy and practice of quality transparency in healthcare. They will be particularly beneficial for senior citizens, who require more medical services, but they also will be incorporated into new college curriculum. Furthermore, upon completion of the study, the methods and non-proprietary data will be made publicly available to further enhance the research and education infrastructure.","title":"CAREER: Choosing Wisely: Leveraging User-Generated Doctor Ratings","awardID":"1254021","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[534504],"PO":["564456"]},"199195":{"abstract":"Increasing amounts of data are being collected about users, and increasingly sophisticated analytics are being applied to this data for various purposes. Privacy analytics are machine learning and data mining algorithms applied by end-users to their data for the purpose of helping them manage both private information and their self-presentation. This research develops privacy analytics that help users answer three interconnected questions about their online persona (1) What data does the user consider sensitive, and in what contexts should one share it?; (2) What does the data say about the user; and (3) Who knows what? These privacy analytics introduce a novel, inverse data mining problem where users analyze their data to estimate the conclusions the data will produce when incorporated into larger data sets. This project designs new algorithms for quantitative and automated methods to detect privacy-related phenomena that have been observed qualitatively. These algorithms support the development of usable privacy enhancing technologies and will give users tools to cope with and manage their data in a complicated data environment. These tools will provide awareness to users about how their data is being used. These analytics will also help answer questions critical to the development of privacy law and policy.<br\/><br\/>This work involves approximately twenty-five undergraduates in research activities, exposing them to research methods and privacy issues. This project also develops novel educational materials including course offerings for an interdisciplinary master's program in security and educational tools for use by the general public to bridge the digital divide.","title":"CAREER: Privacy Analytics for Users in a Big Data World","awardID":"1253418","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["561935"],"PO":["562974"]},"204168":{"abstract":"This is funding to support a Young Pioneers Workshop (doctoral consortium) of approximately 20 graduate students and post-docs (including 15 U.S. participants) from diverse research communities (e.g., computer science and engineering, psychology, cognitive science, robotics, human factors, human-computer interaction design, and communications), along with distinguished research faculty. NSF funding will be used solely to cover travel, housing, and subsistence for eligible U.S. attendees. The event will take place on Sunday, March 3, 2013, immediately preceding the Eighth Annual Human Robot Interaction Conference (HRI 2013), to be held March 3-6, 2013, in Tokyo, Japan, and which is jointly sponsored by ACM and IEEE. HRI is a single-track, highly selective annual international conference that seeks to showcase the very best inter- and multi-disciplinary research in human-robot interaction with roots in social psychology, cognitive science, HCI, human factors, artificial intelligence, robotics, organizational behavior, anthropology and many more, and invites broad participation. The theme of HRI 2013 is \"Holistic Human-Robot Development.\" Robotic solutions are increasingly applied to real world problems such as our aging society, renewable energy, climate control, emergency response, education and exploration. These societal problems require a holistic approach to the design and development of robots that meet human needs, address technical challenges, and foster acceptance in everyday settings. More information about the conference is available online at http:\/\/humanrobotinteraction.org\/2013.<br\/><br\/>The Young Pioneers Workshop is designed to complement the conference, by providing a forum for students and recent graduates in the field of HRI to share their current research with their peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference. During the workshop, participants will talk about the important upcoming research themes in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. To these ends, the workshop format will include oral presentations from 2 student attendees, poster presentations from all student attendees, a hands-on breakout session with group presentations, a keynote, and a panel presentation by senior researchers who will share their expertise and insights on how to address the interdisciplinary challenge of HRI. The afternoon breakout session will involve small groups of 3-5 attendees with diverse backgrounds, working to design an integrative HRI project, thereby encouraging group participation and the cultivation of cross-disciplinary ideas. The presentation session afterward will allow each breakout group to present a summary to the entire workshop; the organizers anticipate that the discussions will continue during dinner. <br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (including but not limited to computer science and engineering, psychology, robotics, human factors and ergonomics, and HCI). This is important for the field, because it has been recognized that transformative advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming years. Participants will also gain leadership and service experience, as the workshop is largely student organized and student led. The PI has expressed his strong commitment to recruiting women and members from other under-represented groups. To further ensure diversity, the event organizers will consider an applicant's potential to offer a fresh perspective and point of view with respect to HRI, and no more than one applicant will be accepted from any given institution.","title":"WORKSHOP: The 2013 HRI Pioneers Workshop at the 2013 ACM\/IEEE International Conference on Human-Robot Interaction","awardID":"1311610","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[546850],"PO":["565227"]},"198162":{"abstract":"The objective of this project is to enable more efficient and reliable operation of autonomous femtocell networks with agile spectrum access, autonomous interference control, as well as intelligent network self-organization and self-optimization. This project falls into four interacted thrusts: 1) Incorporate cognition into the femtocell networks to cognitively reuse the available spectrum sensed; 2) Develop distributed, dynamic and cooperative interference management schemes exploiting antenna techniques and based on sensed environmental conditions; 3) Investigate the scenarios and schemes that femtocells can be exploited to facilitate macrocell transmissions, and the potential gains in capacity, coverage and reliability; 4) Incorporate interference cancellation for data multicast, and develop techniques to support multiuser video streaming. The project also develops a testbed with open source programmable wireless platforms, for prototyping and evaluating the effectiveness of various techniques developed. <br\/><br\/>The proposed research has the potential to significantly increase the capacity and resilience of existing and future wireless networks. The agility and resilience of the system will also make it instrumental to support communications and applications that are important for national security and economy. The PIs will facilitate technology transfer through their industrial partners and industry affiliate programs. Complementary to the research agenda, the project will carry out a broad range of education and outreach activities, including integration of research findings into the courses, promoting underrepresented and undergraduate populations, and engaging with the K-12 schools to raise the level of student interests in pursuing advanced education and career in the areas of engineering and mathematics.","title":"Collaborative Research: EARS: Cognitive and Efficient Spectrum Access in Autonomous Wireless Networks","awardID":"1247955","effectiveDate":"2013-02-01","expirationDate":"2016-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":["550958"],"PO":["565303"]},"208359":{"abstract":"New genome technologies enabled us to analyze the spatial conformation and interaction of chromatin together with their functional implication in important cellular activities such as gene regulation and cell state determination. With the influx of new details about the higher-level structure and dynamics of the genome, novel techniques will be required to visualize and model the full extent of genomic interactions to gain insight about genome functions. Current genome browsers are specifically aimed at viewing primary sequence information. Although supplemental information can be annotated via new tracks, representing structural hierarchies and interactions is quite difficult in these browsers, particularly across non-contiguous genomic segments. In addition, in spite of many recent efforts to measure and model the genome structure at various resolutions and detail, little work has focused on combining these models or taken advantage of the large amount of genomic and epigenomic data generated from new high-throughput approaches. To address these issues, the team has created a proof-of-concept interactive 3D viewer, Genome3D, to enable integration and visualization of genomic and epigenomic data in three dimension. Substantial development is needed to take advantage of the newest genomic technologies and to enable its integration with analysis pipelines. While enormous amount of spatial information for eukaryotic chromosomes have been generated, the size and complexity of these data require the design and development of new algorithms and methods in data integration and model construction. The goal is to develop a full-fledged, platform independent system that enables biologists to build and refine their own 3D genome models to analyze their data. <br\/><br\/>The intellectual merits of the research include: 1) Implementing a novel strategy to employ new engines with strong interactive design element to transform the prototype into a cloud-based 3D genome browser that can be used on various platforms including web browsers and tablets, making 3D structural genome information available to a broader research community. 2) Adding integrated tools that can analyze 3D features of genomes and support model building and validation. 3) Designing and providing robust set of APIs and scripting for customized data analysis. 4) Collaborating with other researchers to explore and visualize new three dimensional genome models.<br\/><br\/>There are a number of broader impacts in this research. A multi-scale three dimensional genome browser is crucial to achieve fuller understanding of genome functions and will provide a new way to teach genomics. Exploring genomes through 3D visualization will significantly advance genome research and will have a profound impact on comparative genomics and genetics. The use of new user interaction-intensive engines into scientific research tools and will encourage researchers in every area to use interactive visualization to analyze data. New algorithms to analyze models and visualize genomic information can be extended to problems of similar size in other fields and form the basis for new computational approaches. This project provides valuable interdisciplinary training experiences to undergraduate and graduate students and will attract more students to computational biology research. Results and the new browser will be disseminated through publications, workshops and tutorials and will enable customized development by providing detailed APIs and tutorials.","title":"III: Medium: Collaborative Research: Developing a 3D Browser to Explore Genomes","awardID":"1339470","effectiveDate":"2013-02-01","expirationDate":"2016-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[558368],"PO":["565136"]},"204268":{"abstract":"This project funds travel for graduate students to participate in PerCom 2013 to be held San Diego, Californiain March 2013. PerCom is the flagship international conference in pervasive computing. Students will participate in an organized PhD Forum, both before and during the conference, demonstrate their work in a Poster Session, give presentations about their research, and be mentored by senior researchers.","title":"IEEE PerCom 2013 Student Travel Support Request","awardID":"1312112","effectiveDate":"2013-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["564777"],"PO":["551712"]},"206028":{"abstract":"This project supports hosting the three day seventeenth edition of the GENI Engineering conference, including organizing and hosting the demo session, to be held July 21-23, 2013 in Madison, Wisconsin. The GEC location will be held at a Madison hotel within walking distance of the university campus and the demonstration session will be held in a university facility. The GENI Project Office organizes three major GENI Engineering conferences (GECs) per year, in which the entire GENI community meets to review current status, and to decide on subsequent steps in GENI's evolution. These GECs include community-based working groups leading GENI's design and planning, and demonstrating progress with live experiments. About 250 leading researchers and Ph.D. students from diverse US institutions will gather in Madison to showcase their ideas and results. In the demo session each demo will be provided with a wired connection to the GENI infrastructure. Additionally, wireless connectivity will be available for demonstrations and participants. <br\/><br\/>The Global Environment for Network Innovations (GENI) is a virtual instrument that is rapidly emerging in prototype form across the United States. GENI aims to transform experimental research in networking and distributed systems, as well as emerging research into very large socio-technical systems, by providing a suite of infrastructure for 'at scale' experiments in future internets. GENI is designed to address three issues: <br\/>- Science Issues: We cannot currently understand or predict the behavior of complex,<br\/>large-scale networks.<br\/>- Society Issues: We increasingly rely on the Internet but are unsure we can trust its security, privacy or resilience.<br\/>- Innovation Issues: Substantial barriers to at-scale experimentation with new architectures, services, and technologies.<br\/>GENI addresses these issues via scale (from federation) and support for two kinds of experiments: 1) controlled and repeatable experiments, which will greatly help improve our scientific understanding of complex, large-scale networks; and 2) in-the- wild trials of experimental services that ride atop or connect to today?s Internet and that engage large numbers of human participants. The GEC conference and associated demo sessions are a key component of the integrated development process for GENI. The GECs provide integration points for GENI development, provide time for face-to-face technical discussions about engineering, and ensure that the GENI development community is fully aware of evolving system feature sets.<br\/><br\/>The GEC meeting and Demo sessions provide graduate students with both an opportunity to demonstrate and explain their work to the GENI community prior to formal publication. It is a key part of helping new graduate students understand what is being done with GENI and who amongst their peers at other institutions might be valuable resources. It also supports outreach to new community members, including the emerging US Ignite community. GENI is already being used as an instrument for research. This proposal supports the development and use of the research instrument.","title":"The Seventeenth GENI Engineering Conference","awardID":"1321870","effectiveDate":"2013-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553458"],"PO":["564993"]},"199175":{"abstract":"Statistical privacy, or the problem of disclosing aggregate statistics about data collected from individuals while ensuring the privacy of individual level sensitive properties, is an important problem in today's age of big data. The key challenge in statistical privacy is that applications for data collection and analysis operate on varied kinds of data, and have diverse requirements for the information that must be kept secret, and the adversaries that they must tolerate. Thus, application domain experts, who are frequently not experts in privacy, cannot directly use an existing, general-purpose privacy definition. Instead, they must develop a new privacy definition or customize an existing one. Currently there exist no rigorous techniques to customize privacy to applications.<br\/><br\/>This project builds PROTEUS, a general-purpose toolkit for developing rigorous privacy definitions and mechanisms that can be customized to applications. The cornerstone of PROTEUS is a novel privacy framework that allows customized privacy protection by explicitly listing the secrets to be protected, enumerating the (potentially infinite set of) possible adversaries, and ensuring rigorous bounds on the information disclosed to each adversary about every secret. Novel theoretical tools in PROTEUS include methods to reason about privacy for correlated data, privacy against realistic adversaries, and techniques to express and enforce personalized privacy preferences. These tools result in practical privacy mechanisms for publishing social science survey data, social network analysis, and analysis of user-activity streams. Broader impacts of this project include developing new courses in privacy and big-data management, as well as technology transfer to the US Census.","title":"CAREER: PROTEUS: A Practical and Rigorous Toolkit for Privacy","awardID":"1253327","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[534266],"PO":["562974"]},"199197":{"abstract":"In this project the PI will develop the science needed to enhance mobile augmented reality applications with (a) eye tracking and (b) gaze direction. Mobile augmented reality uses a hand-held device to provide a see-through view of the physical world in which an image of the physical world is superimposed with information about the things in that view. It is as if you held a piece of glass up to the world, and text appeared on that piece of glass labeling the things you see through the glass. This project will investigate how mobile eye tracking, which monitors where a person is looking while on the go, can be used to determine what objects in a visual scene a person is interested in, and thus might like to have annotated in their augmented reality view. This project will investigate how to make these scene annotations appear and disappear in a manner that is neither distracting nor obtrusive by conducting experiments that measure a person's ability to accomplish visual tasks while presented with text annotations in different sizes, transparency levels, and distances from the point-of-gaze (the point where a person is looking). The project will develop algorithms to automatically manage the density and placement of these labels to best support human tasks while avoiding the creation of distracting \"visual clutter\".<br\/><br\/>The project will also develop the science that is needed to direct a person's gaze in the physical world by means of new visualization techniques for use in mobile augmented reality systems. In this case, it is as if the piece of glass through which you are viewing the world periodically changed slightly to unobtrusively motivate you to look more closely at different, specific, task-relevant parts of the scene. This aspect of the project will be conducted in collaboration with the Houston Museum of Fine Arts.<br\/><br\/>Broader Impacts: The project will advance discovery of visualization techniques to permit mobile applications to enhance the viewing of the physical world, while promoting the teaching and learning of science in multiple contexts. Collaborating with the Houston Museum of Fine Arts, the project will develop a freely-downloadable iPhone application that will enhance museum-goers' learning in the arts, and provide a proof-of-concept of how the techniques developed in this project could be used in other contexts.<br\/><br\/>The project pursues a number of specific new opportunities in science education, including the development of (a) project-related curriculum for a science-based summer camp for junior high school students at Texas A&M University, (b) new University-level courses on the programming for augmented reality and the human performance aspects of lighting and cinematography, and (c) conference tutorials on experimental design, eye tracking, and perception in computer graphics.","title":"CAREER: Advancing Interaction Paradigms in Mobile Augmented Reality using Eye Tracking","awardID":"1253432","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[534310],"PO":["565362"]},"199253":{"abstract":"The intellectual merit of this proposal lies in the bio-inspired approaches to novel control strategies, vision-based sensing solutions, and strategies for cooperative pursuit and herding that will be gleaned from the literature and observations of the behavior of birds. This study will result in both fundamental scientific knowledge and a practical application revolving around the development of highly maneuverable unmanned aerial vehicles based on flapping-wing robots. The intelligence of birds manifests itself in the evasive talents of flocks of birds and this proposal attempts to recreate that intelligence through the challenge of applying a bird-like robot to the problem of preventing aircraft\/bird collisions near airports. According to surveys by the International Bird Strike Committee, none of the existing systems to prevent bird strikes on airfields are adequate. The reasons include habituation by birds to these systems; movement of birds to other parts of the area, or scattering of them all over the airfield; and the tendency of birds to come back when a threat has gone. The only proven lasting way of removing birds is by using live birds of prey, but real birds are too difficult to control and train. An alternative is to study and extract the behaviors and dynamics of real birds in order to develop and deploy a robotic lookalike. The objective of this proposal, motivated by the problem of keeping airfields clear of disruptive avian flocks, is to develop control and sensing strategies for bird-like flapping robots that can be deployed in swarms to fend off \"antagonists.\" This work will build upon the PI's previous work on the control of flapping-wing aircraft using limit-cycle-based central pattern generators (CPGs), and on the dynamics and control of flexible, articulated-wing aircraft.<br\/><br\/>Broader Impacts: Society as a whole stands to benefit immensely from robotic birds that can effectively prevent bird strikes, which cause airplane crashes and millions of dollars annually in damage. Furthermore, because of their high aerodynamic efficiency in forward flight, articulated-winged flapping aerial robots equipped with sensors could have tremendous value by being able to inspect hazardous areas. For the field of robotics, the proposed transformative research will make far-reaching contributions, advancing the state of the art in aerial robotics, cooperative control theory, and control of flexible robot structures. Additionally, this project's education and outreach activities will help introduce a new generation of young people, including those from underrepresented populations, to the excitement of science and engineering careers. Multiple avenues of educational outreach will be pursued, taking advantage of the powerful appeal of the topics of robotics and bio-inspired flight.","title":"CAREER: Control and Sensing Strategies for Robotic Falcons to Prevent Airport Bird Strikes","awardID":"1253758","effectiveDate":"2013-02-15","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[534422],"PO":["564069"]},"199055":{"abstract":"Increasingly, software is expected to dynamically adapt its behavior in response to changing conditions in the computation infrastructure as well as the surrounding physical environment. Two important problems in dynamic adaptation of software are (1) how to prevent failure of the software during adaptation, and (2) how to reduce disruptions in the functionalities provisioned by the software. This research will devise a novel technique for dealing with these problems by automatically determining when is the best time for making changes to a running software system. The principles emerging from this research will provide the foundation for a new method of engineering dynamically adaptive software. The results of the research will be incorporated into education, such that tomorrow's software engineers are better equipped to tackle the challenges of constructing adaptive software. The approach will be realized via a suite of open source tools to pave the way for transitioning the research results to the industry. <br\/><br\/>All prior techniques targeted at this research problem have assumed the availability of detailed software component dependency models. This research will develop a novel technique that solves this problem in settings where such models are either not available, difficult to build, or outdated due to the evolution of the software. The hypothesis guiding this research is that by monitoring a software system?s execution history (e.g., message exchanges, method invocations) for a sufficiently long period of time, it is possible to mine an accurate model of interactions and dependencies among the system's components. The research will demonstrate how models inferred in this way can be used to (1) ensure changes in the running software do not create inconsistencies that could jeopardize the system?s functionality, (2) control the level of disruption incurred in system?s operations due to adaptation, and (3) automatically adjust the models to changing dependencies among the potentially evolving software components.","title":"CAREER: A Mining-Based Approach for Consistent and Timely Adaptation of Component-Based Software","awardID":"1252644","effectiveDate":"2013-02-01","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[534008],"PO":["564388"]},"201464":{"abstract":"Cognitive wireless systems are a collection of wireless network entities that are able to adapt intelligently to the environment through observation, exploration and learning. This project designs methods for cognitive radio systems to compete for inhomogeneous spectrum resources and to establish, without explicit coordination, a spectrum etiquette. Each system's resource utilization strategy must be decided with only imperfect information of other systems' actions, and the resulting adaptations must discourage any one system from manipulating the agreed spectrum etiquette. The framework of dynamic games with imperfect private monitoring is adopted to design coexistence mechanisms for cognitive radio systems sharing inhomogeneous resources and to analyze the stability, robustness, complexity, and convergence of these mechanisms. This work directly impacts the development and standardization of frequency agile wireless systems that can more efficiently use the available spectrum to support increasing demand for ubiquitous wireless connectivity at high data rates. The project is a collaborative effort between researchers in the US (at Virginia Tech and the University of Houston) and Finland (at the University of Oulu). This work will extend the state of the art in cognitive system adaptations by incorporating the ability to: efficiently adapt under imperfect information; fairly share inhomogeneous resources; and discourage manipulation of resource use by selfish adversaries. Results will be disseminated in high impact journals and conferences; the designed coexistence mechanisms will also be presented to industry and regulators in the US and Europe.","title":"EAGER: Collaborative Research: Joint Adaptation of Multiple Cognitive Systems without Explicit Coordination","awardID":"1265280","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[540088],"PO":["557315"]},"201486":{"abstract":"In order to apply emerging technologies (e.g. dynamic spectrum sharing) to address the wireless spectrum shortage problem, there is a critical need to understand global RF spectrum usage trends. To accomplish this, a three-pronged approach is being pursued: 1) deployment of geographically dispersed, temporally coordinated RF spectrum observatories in multiple U.S. locations, and through international collaboration, in Finland. The spectrum observatories use a common platform generating a single RF spectrum measurement dataset. 2) Development of empirically validated, statistical models of spectrum utilization for different wireless application types based on this dataset. 3) Use of \"big data\" analytical techniques to mine the dataset to discover temporal and spectral correlations not obvious using traditional approaches. As the models and relationships are refined, they will enable temporal and spectral occupancy predictions to support spectrum sharing for various circumstances and wireless applications.<br\/><br\/>The generation of a high-resolution, multi-location, multi-national spectrum usage dataset using a common, consistent measurement and storage approach is unique and allows direct, unambiguous comparisons of spectrum usage across geographies and demographics. The statistical models of spectrum utilization and the identified similarities and differences between regions and wireless services are unique and inform dynamic spectrum sharing research and related regulatory action with \"real-world\" data. Importantly, this is the first time that \"big data\" analytic approaches are being systematically applied to RF utilization data providing new insights motivating novel dynamic spectrum sharing approaches and improved spectrum efficiency.","title":"EAGER: Collaborative Proposal: Global RF Spectrum Opportunity Assessment","awardID":"1265351","effectiveDate":"2013-02-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560174"],"PO":["565303"]}}