{"50617":{"abstract":"This is a standard award to support the 5th AAAI Doctoral Consortium to be held as a workshop during the 17th AAAI conference in Austin, Texas. The workshop will provide a unique opportunity for a group of PhD students to discuss and explore their research interests and career objectives together with a panel of established researchers. The consortium has the following objectives:<br\/><br\/> * To provide a setting for mutual feedback on participants' current research, and guidance on future research directions<br\/> * To develop a supportive community of scholars and a spirit of collaborative research<br\/> * To support a new generation of researchers with information and advice on academic, research, industrial, and non-traditional career paths<br\/> * To contribute to the conference goals through interaction with other researchers and participation in conference events.<br\/><br\/>The Doctoral Consortium will be held concurrently with other workshops preceding the AAAI'00 conference. It is expected that it will attract a diverse group of student participants who reflect a wide range of topic areas and methodologies within artificial intelligence, and who have settled on their thesis directions but who still have significant research left to do. Selection will be based on clarity and completeness of the submission packet, stage of research, advisor's letter, and other evidence of promise such as published papers or technical reports. Participants' thesis summaries will be published in the AAAI-00 conference proceedings. NSF funds will be supplemented by a contribution from Microsoft Research to provide student participants with a travel reimbursement of $800. Participants will also receive complimentary conference registration. The organizing committee for the workshop consists of: Marie A. Bienkowski, Chair, SRI International; Janyce M. Wiebe, New Mexico State University; Mary P. Harper, Purdue University; Vibhu O. Mittal, Just Research and Carnegie Mellon University; and Loren Terveen, AT&T Labs. Panelists will include: Bonnie Holte Bennett , University of St. Thomas; Claire Cardie, Cornell University; Russell Greiner, University of Alberta; Mary P. Harper, Purdue University; Evangelos E. Milios, Dalhousie University; Raymond J. Mooney, University of Texas at Austin; Leora Morgenstern, IBM T.J. Watson Research; and Nils J. Nilsson, Stanford University.","title":"Workshop: AAAI-2000 Sigart \/ AAAI Doctoral Consortium","awardID":"0003142","effectiveDate":"2000-06-01","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["527853"],"PO":["565227"]},"52828":{"abstract":"In this study, the researchers propose to develop a mobility-based framework for adaptive clustering and routing in wireless ad-hoc networks-an emerging class of network architecture that is characterized by its highly dynamic topology and its limited resources. Within this framework, the researchers will address several key, as yet unanswered questions, which have been raised with respect to the routing problem in ad-hoc networks. Specifically, it has been argued that to achieve acceptable routing performance, multiple routing strategies may need to act cooperatively in the same network. However, this raises the question as to what those strategies should be, and how to effectively toggle between them. Furthermore, it has been proposed that mobility information can be used to select longer-lived routes, and to improve the efficiency of route creation and maintenance. However, no well-defined mobility based metric has been proposed that reflects a quantitative measure of path stability. In this study, the researchers explore novel and significant ideas which address each of the shortcomings described above, and builds them into a unified<br\/>routing framework. Specifically, the researchers propose to develop a well-defined mobility based routing metric, referred to as path availability. This metric is used for adaptive cluster characterization and routing in ad-hoc networks.<br\/> The mobility-based cluster characterization provides the basis for an efficient distributed clustering algorithm which adaptively maintains a cluster organization-the size and membership in each cluster is determined dynamically by the mobility characteristics of the local nodes. Using this metric, the researchers propose to investigate pro-active intra-cluster and inter-cluster routing strategies: intra-cluster routing will be based on table-driven routing protocols that maintain up-to-date routing information regarding all cluster destinations, whereas inter-cluster routing is managed on a demand-basis by constructing routes in a dynamic hierarchical fashion as a sequence of relatively stable clusters between the source and the destination. More efficient route search is enabled by the proactive maintenance of routes within each cluster, and reactive route repair is only needed if the source or destination depart their original clusters, or if the next cluster along a route becomes unreachable. Most of the reaction to node mobility is handled locally within the clusters, hence, the far-reaching effects of topological changes are minimized. By adapting the characteristics of the cluster organization to localized node mobility patterns, the strategy is expected to perform well over a wide range of conditions. Furthermore, this framework can be extended<br\/>to address the need to support QoS requirements for mutlimedia communications. Very few clustering strategies have defined either an adaptive clustering technique, or have factored mobility information into the clustering decision process. Hence, this work represents a significant, and sustainable contribution to the field.","title":"Mobility-Based Clustering for Scalable and Responsive Routing in Ad-Hoc Networks","awardID":"0073972","effectiveDate":"2000-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["533851","194325"],"PO":["7594"]},"52839":{"abstract":"Transmitting multimedia over shared network paths calls for end-to-end flow control because of expected<br\/>growth of multimedia data transmitted over the Internet. However, Internet and its access technologies are<br\/>diverse ranging over high-speed optical networks, satellite networks, cable, low-speed modem, and wireless<br\/>networks. Flow control over diverse network environments is difficult because assumptions commonly made<br\/>for traditional networks, such as symmetry, do not hold. Asymmetry in the bandwidth and delays of forward<br\/>and return paths over the range of 1600:1 to 3000:1 can be observed in most home access networks such<br\/>as cable or ADSL lines, and satellites. Multicast also do not guarantee symmetry in forward multicast and<br\/>return unicast routes. In these asymmetric networks, packet losses and delays occurring in return paths<br\/>severely degrade the performance of existing round trip based protocols, such as TCP, resulting in loss in<br\/>bandwidth utilization, fairness, and scalability.<br\/> The objective of the proposed work is to develop, verify analytically and experimentally, and implement<br\/>a suite of end-to-end flow control protocols for real-time streaming applications. The researchers will study both unicast and multicast flow control. The developed protocols are evaluated based on fairness, TCP-friendliness, stability and scalability. These properties must hold regardless of the types of networks, or specifically, whether networks are symmetric or asymmetric in bandwidth and delays. The researchers consider only end-to-end transport-level flow control in which flow control decisions are made based on the traffic characteristics observed only at the end points.<br\/> The researchers view that the performance problem of round-trip based flow control mainly originates from the tight coupling of forward and reverse path conditions into flow control of both forward (i.e., data) and reverse (i.e., feedback) path traffic. This notion does not hold when the two paths exhibit severe asymmetry. The researchers propose a complementary approach to the problem. Their approach is to completely decouple the conditions of both paths (e.g., congestion and delays) from the end-to-end considerations of flow control, and to apply separate flow control for each path. They rationalize this approach by noting that most multimedia transmissions are strictly one directional, and open-loop due to their real-time and loss-tolerant natures. Thus, conditions on return paths should not affect the performance of multimedia transmission.<br\/> To achieve TCP-friendliness with little use of return paths, the researchers propose a technique called TCP emulation at receivers (TEAR). TEAR allows receivers to detect every TCP congestion signal, such as packet losses and timeouts, as if it happens in a TCP sender with the perfect reverse path (no delay and congestion on the return path). Using the signal, receivers emulate TCP's flow control to estimate the throughput of TCP under the same operating conditions present in forward paths. The advantages of TEAR are that it can estimate<br\/>TCP throughput at any environment (of forward paths) where TCP can run, and that it inherits the fairness<br\/>and stability of TCP while filtering out its undesirable traits.<br\/> Estimated TCP throughput values at receivers are used to control the receiving rates of receivers in<br\/>unicast and multicast. The following three major research agendas are proposed.<br\/> 1. The researchers plan to develop unicast flow control techniques using TEAR. A notion of bounded fairness to \"uni-directional\" TCP is proposed. The goal is to develop a rate adjustment scheme that is provably stable and TCP-friendly under various network environments.<br\/> 2. The researchers plan to develop flow control for receiver-driven layered multicast (RLM). RLMensures scalability and inter-receiver fairness by allowing receivers to determine their own receiving rates independently. However, its stability and TCP friendliness have not been proven. Using TEAR, the researchers will investigate ways to improve these properties under heterogeneous network environments.<br\/> 3. For multimedia data transmission that is not amenable to layering, the researchers plan to develop flow control techniques for sender-driven single rate multicast. They will study the stable and fair flow control mechanisms for this type of flow control, and investigate tradeoffs among scalability, bandwidth utilization,<br\/>and responsiveness to emerging congestion.","title":"Flow Control for Multimedia Streaming Over the Internet","awardID":"0074012","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["450636"],"PO":["565090"]},"49230":{"abstract":"","title":"Computer Graphics Tools for Understanding Tensor-Valued Volume Data: A Painting Metaphor","awardID":"9996209","effectiveDate":"2000-06-01","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550484"],"PO":["532791"]},"46162":{"abstract":"EIA-9978038<br\/>O'Looney, John<br\/>University of Georgia<br\/><br\/>Digital Government: Planning Grant for Research into the Use of Internet-based Intelligent Systems for Shaping and Enhancing Citizen Participation and Service Delivery<br\/><br\/> Increasingly government at all levels is beginning to provide on-line services to the citizenry, and to collaborate and interact in a broader way with citizens, in areas such as public comments on proposed regulations. Particularly at the local level, government can be found hosting interactive discussion sites, for example, New models of government-citizen interaction are arising; this grant will begin to systematically explore issues such as equity, effectiveness, and cost of service, citizen influence, appropriate feedback mechanisms, and administrative, technical, and policy barriers. Key activities will include a survey and a subsequent workshop to assess the results.","title":"Digital Government: Planning Grant for Research into the Use of Internet-based Intelligent Systems for Shaping and Enhancing Citizen Participation and Service Delivery","awardID":"9978038","effectiveDate":"2000-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[117711],"PO":["371077"]},"48032":{"abstract":"EIA-9986024<br\/>Carla Ellis<br\/>Duke University<br\/><br\/>CISE Research Instrumentation: System Support for Mobile and Embedded Workloads<br\/><br\/>This proposal seeks funding to deploy a wireless infrastructure in the Computer Science Department at Duke University. <br\/><br\/>The requested infrastructure will be used as a testbed for our research. The individual research results will be combined to provide a coherent system for the deployment of mobile and embedded applications. A goal of this research is to evaluate the success of the individual system components by demonstrating the viability of the disaster recovery application, in effect approximating next generation environments using currently available technology. In addition to these research results, the requested infrastructure will aid the department's continuing efforts into education and outreach. The equipment will serve as the basis of a project-oriented course to develop applications and system support for the infrastructure and will also serve as the basis for summer internship projects in Duke's continuing outreach efforts to underrepresented groups.","title":"CISE Research Instrumentation: System Support for Mobile and Embedded Workloads","awardID":"9986024","effectiveDate":"2000-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["353750","555929","485593"],"PO":["309350"]},"55293":{"abstract":"This research proposes novel techniques for power analysis and optimization at software level. Specifically, the problem is addressed in the context of both general purpose or application specific processors. In addition, the case of processors with multiple instruction issues or out-of-order execution, or architectures based on the Very Long Instruction Word (VLIW) paradigm are also considered. The main feature of the proposed models is their dependency on input data, allowing profile-driven optimizations. Based on the proposed models, appropriate optimization techniques at compile-and run-time are proposed for reducing the energy of the instruction sequence. This research will enable the assessment of any energy\/performance trade-offs present in today's processors. Also, based on a power estimate of the embedded software running on application specific processors, the co-design of mixed hardware\/software systems can be extended to incorporate as a further design constraint power consumption, in addition to performance.","title":"CAREER: Software Level Power Analysis and Optimization","awardID":"0084479","effectiveDate":"2000-06-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["554462"],"PO":["562984"]},"49111":{"abstract":"","title":"KDI: Segmental and Prosodic Optical Phonetics for Human and Machine Speech Processing","awardID":"9996088","effectiveDate":"2000-06-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8876","name":"KDI OPPORTUNITY FUND"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}}],"PIcoPI":["416490","451934","558131",125664,"217779"],"PO":["246649"]},"46680":{"abstract":"Future high-speed networks will be significantly larger and more complex than any existing network. The variety and interaction of the applications, the middleware and transport protocols, and the router\/switch resource management algorithms will make the design, development, control, management and evaluation of these networks an exceptionally difficult task. One of the most critical components in the network control architecture is that concerned with congestion control. The Internet has relied till now on the additive increase, multiplicative decrease mechanism, found in most variations of TCP, for congestion control. There is increasing recognition, however, that new congestion control mechanisms, which will be able to coexist with TCP, are needed in future high speed networks. This is due to the increasing need to provide for heterogeneous application requirements and because of many future applications will rely on multicast. As is, TCP congestion control is inadequate for handling either heterogeneity or multicast.<br\/> There is also a need for a better methodology for modeling and analyzing the TCP performance and the performance of coming congestion control algorithms. The development of such a methodology is especially needed to evaluate the behavior of a mix of TCP sessions and future non-TCP sessions so as to avoid any unpleasant surprises as they are deployed. This proposal describes new and fundamental research in two broad areas:<br\/> (1)Formula-based congestion control. The researcher proposes research on a new approach to rate-based congestion control. The project introduces a formula-based approach in which a session monitors its end-end loss rate and adapts its transmission rate accordingly. The research shows how this can be used to construct a TCP-friendly rate control algorithm and then outline a research agenda for exploring and exploiting the potential of this approach to support multicast applications, and to support heterogeneous applications.<br\/> (2)Performance evaluation of congestion control algorithms. The researcher proposes research on the performance evaluation of different congestion control algorithms based on the use of <br\/>stochastic differential equations.<br\/> This proposed research represents a fundamentally important step in the understanding, design, analysis of congestion control algorithms needed by the next generation transport protocols.","title":"Internet Congestion Control: Design, Modeling, and Analysis","awardID":"9980552","effectiveDate":"2000-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["545655","526867"],"PO":["565090"]},"47440":{"abstract":"EIA-9983468<br\/>Adams, Nabil R.<br\/>Rutgers University<br\/><br\/>Digital Government: E-Government: Human-Centered Systems for Business Services<br\/><br\/>This grant will support research into distributed workflows and dynamic workflow specification, data interoperability, and provision of E-government services and creation of State to Business relationships through a single electronic interface. The research will include the State of New Jersey as a collaborator, in an application focused on guiding the user through the process of approval, permitting and regulatory compliance. Researchers from Columbia University and the University of Maryland at Baltimore County will participate in the team also.","title":"Digital Government: E-Government: Human-Centered Systems for Business Services","awardID":"9983468","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["264401"],"PO":["371077"]},"47484":{"abstract":"This is the first year funding of a four year continuing award. This proposal describes an integrated career development plan with research and educational activities centered on methods for mobile robot systems to display a basic competence in manipulation. The approach advanced by this proposal is to equip nonholonomic mobile robots with very simple manipulators and use nonprehensile manipulation techniques to accomplish a variety of manipulation tasks.<br\/><br\/>We will initially focus on two types of manipulators: a \"plan\" manipulator and a \"finger\" manipulator. A single robot with one of these manipulators can push or roll an object along the ground. Although this seems limited, a wide variety of objects can be manipulated in this manner. With two or more such robots, a much greater variety of manipulation is possible: objects can be lifted, reoriented, carried, and so on.<br\/><br\/>The proposed research has three main components: generalizing existing nonprehensile manipulation strategies and developing new ones for mobile manipulators with nonholonomic motion constraints; creating a unified framework for manipulation planning that can reason about different nonprehensile manipulation strategies; and the distribution of intelligence among multiple robots in order to achieve robust cooperative manipulation.<br\/><br\/>The proposed educational activities complement the research plan. The research will require custom-built mobile manipulators and the development of nonprehensile skills. These activities are excellent opportunities for hands-on education, and they are well within the scope of class projects and independent studies. There are three parts to the proposed educational activities: engagement of undergraduates in research; development of a hands-on course covering manipulation, mobile robotics, and robot-design; and writing a text to serve as a reference for robot design and programming.","title":"CAREER: Nonprehensile Mobile Manipulation","awardID":"9983642","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[121542],"PO":["335186"]},"46682":{"abstract":"Compared to traditional voice and data networks, next generation networks will present more difficult challenges to traffic control because (1) the carried traffic will be much more diverse and complex in nature, (2) traffic rates will be faster, and (3) network performance levels must be protected for certain applications requiring a quality of service (QoS). Traffic analysts attempt to gain an understanding of the stochastic nature of the traffic from volumes of collected traffic measurements, and derive traffic models and control algorithms to manage network resources (such as connection admission control in ATM networks). Unfortunately, traffic analysis is typically a time consuming process and requires a high level of statistical expertise. Many stochastic traffic models have been studied but methods for evaluating their validity for real traffic are generally lacking. The objective of the proposed research is to improve understanding of real network traffic by developing systematic methods for processing raw traffic measurements, deriving traffic characteristics, and applying these characteristics to real-time resource management. The approach is based on a modular library of traffic models and statistical estimation techniques to fit and test each<br\/>model to observed traffic.<br\/> The proposed research project will be carried out in three phases. The first phase will develop a modular library of traffic models including the well-known Markov on-off model, Markov modulated Poisson process (MMPP), Markov modulated fluid, autoregressive process, and fractional brownian motion or other self-similar models. Each model consists of a number of estimatable parameters and a set of structural properties. Research in the first phase will derive parameter estimation methods for each traffic model using maximum likelihood estimation or Bayesian estimation, and evaluate the validity of each model using hypothesis testing, chi-square goodness of fit tests, and other tests depending on the particular properties of each model. Given raw traffic measurements, the best-fit traffic model in the library can be methodically selected at any time.<br\/> The second phase of the proposed project will derive efficient sequential estimators from the first phase and implement these estimators in software for real-time traffic analysis and visualization. The software will work with a hardware traffic collection system to infer general statistical characteristics (such as burstiness) and display the best fitting traffic model. The traffic model will reveal the underlying behavioral properties of the traffic.<br\/> Finally, the third phase will study real-time resource allocation using the estimation methods and software from the earlier phases. Instead of assuming a traffic model a priori for resource allocation, the proposed method will dynamically select the best fitting traffic model from a library and adapt resource allocation decisions in real time. This approach may eliminate the uncertainty and inaccuracy in the traditional static approach. The method will be studied by means of OPNET simulations for the specific problem of ATM connection admission control.<br\/> Successful results from the proposed project will be software tools and algorithms to help network<br\/>administrators gain insight into the nature of network traffic and fine-tune their control of network resources. The project will also be useful to researchers, educators, and students by providing tools to examine real traffic and understand underlying behavior.","title":"Measurement-based Traffic Characterization and Resource Allocation","awardID":"9980561","effectiveDate":"2000-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["502875"],"PO":["565090"]},"47585":{"abstract":"This is the first year funding of a four year continuing award. The research plan of this CAREER award concerns basic theoretical and experimental research involving so-called stratified systems, which are systems subjected to temporally and spatially intermittent physical constraints. In particular, this research concerns the development of a new robotic manipulation control method that can analytically accommodate both rolling contact between the object and the manipulators (or fingers) as well as intermittent contact. For anthropomorphic systems, manipulation via intermittent contact is called \"finger gaiting.\" The approach is to consider the generic differential geometry inherent in stratified systems and to couple this structure with general nonlinear control techniques which also utilize tools from differential geometry. This manipulation method will be general in that it will be formulated in sufficient mathematical generality so that it is independent of any particular surface parameterization of the object, any particular finger tip parameterizations, and the kinematics of the robotic fingers or manipulators. The educational component of this award includes the involvement of graduate as well as undergraduate students in these research efforts. A new multidisciplinary component of the undergraduate engineering curriculum in the PI's department will be developed which will consist of two courses, one devoted to general legal topics which affect engineering and engineering ethics and the other entirely to intellectual property. Finally, a local outreach program will be developed to enhance the education and enthusiasm of local school children in the area of robotics.","title":"CAREER: Stratified Motion Planning with Application to Robotic Manipulation","awardID":"9984107","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["161696"],"PO":["335186"]},"47135":{"abstract":"Our ability to generate scientific data is growing much faster than our ability to understand it. The rapid advances in computing and imaging technology allow scientists to generate very large data sets for which appropriate means for in-depth analysis and understanding do not yet exist. Computational techniques allow the simulation of extremely complicated physical phenomena at ever increasing spatial and temporal resolutions, but data analysis technology for this type of data is still in its infancy. Today, one must choose one of these alternatives: One can either ignore a substantial fraction of a massive scientific data set and only analyze portions of it, or one can invest a significant amount of person-time to analyze and visualize a massive data set in great detail. Neither alternative is desirable. This project will develop the technology needed to address this issue, and will test the new techniques on data from Lawrence Livermore National Laboratory and NASA Ames Research Center.<br\/><br\/>Technically, the project will take a 5-prong approach to the large data visualization problem. First, it will extend existing hierarchical schemes - i.e., schemes approximating a data set at multiple resolution levels - to time-varying multi-valued\/multi-dimensional data. Second, it will improve topology-based approaches - i.e., approaches that extract qualitatively interesting characteristics (such as zeros, extreme, and discontinuities in scalar and vector fields) from large data sets. Third, it will develop parallel and distributed algorithms for efficient computation of hierarchical data representations, fast extraction of topology, and optimizing compute-intensive visualization processes. Fourth, it will devise interactive visualization techniques for (immersive) visualization environments that support view-dependent and user-specified, adaptive level-of-detail rendering. Fifth, it will create a simple metadata database system allow sharing of a user's experience, i.e., previously chosen rendering parameters leading to \"good imagery\" or entire rendering processes.","title":"Multiresolution- and Topology-Based Visualization of Large Scientific Data Sets in Parallel and Distributed Computing Environments","awardID":"9982251","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1597","name":"VISUALIZATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1265","name":"GEOMETRIC ANALYSIS"}}],"PIcoPI":[120659,"151489","451576","495182","552243"],"PO":["551992"]},"48587":{"abstract":"The power of modern statistical techniques is exploited to develop novel approaches to fundamental problems in image understanding. The common statistical foundation for a broad class of vision tasks is identified first, and then the underlying key problems are solved in a rigorous framework. For example, since heteroscedasticity inherently appears in most 3D vision tasks the development of a complete estimation procedure (which includes imposing further geometric constraints on the parameter estimates) is of great importance for computer vision. Such a procedure can provide a faster and more reliable alternative to the widely used (and too general) nonlinear Levenberg-Marquardt method. The task of deriving the 3D description of a scene (static or dynamic) from an image sequence captured with an uncalibrated camera was chosen as a testbed. Estimation problems related to self-calibration, object recognition supported by uncertainty information, will not only allow us to enhance our existing toolbox but also to gain expertise in integrating these tools in a closed-loop autonomous vision system.","title":"Modern Statistical Techniques For Computer Vision","awardID":"9987695","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["415854",124371],"PO":["234178"]},"47531":{"abstract":"The overall goal of this research with intelligent multi-media environments <br\/>is to produce automated and relevant high-quality signal capture in <br\/>enclosures populated with a variety of sensors (e.g. microphones, video <br\/>cameras, etc.) without the active supervision or distraction of the <br\/>system's human users. This involves incorporating several information <br\/>modalities and processing methods. In particular, the fusion of raw <br\/>acoustic and visual data provides an effective means for producing both <br\/>high-quality speech and video. An active analysis of the video stream is <br\/>performed to make intelligent decisions regarding appropriate camera <br\/>selection, image framing, and evaluation of the proceedings' semantic <br\/>content. Novel multi-channel speech processing methods are employed to <br\/>enhance distant-talker speech acquired in the presence of background noise, <br\/>reverberation effects, and competing signals. A number of practical <br\/>scenarios stand to benefit greatly from advances in this field. These <br\/>include environments with adverse noise conditions and multiple active <br\/>(possibly uncooperative) talkers, such as those found in video-conferencing <br\/>and satellite classroom environments, on a stock market floor, in a <br\/>military operations setting, under surveillance procedures, with theater or <br\/>sporting events, or in a biomedical context.<br\/><br\/>This research includes three project areas addressing the intelligent <br\/>multi-media problem described above, specifically: 1) acoustic and <br\/>visual-based systems to track and analyze participants, 2) multi-channel, <br\/>model-based approaches for distant-talker speech acquisition, and 3) hybrid <br\/>continuous-discrete methods for speech enhancement using multi-modal data. <br\/>These three modes of research focus upon a large subset of the intelligent <br\/>multi-media problem and are inherently linked to one another. For instance, <br\/>the speech acquisition and enhancement projects depend upon source location <br\/>data provided from the hybrid tracker while the tracker benefits from the <br\/>improved acoustic signals resulting from speech enhancement work.","title":"CAREER: Intelligent Multi-Media Environments","awardID":"9983839","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["184201"],"PO":["564898"]},"58433":{"abstract":"","title":"REU Supplement: POWRE: Analysis of Specialized Constraint Models for Engineering Design","awardID":"0096104","effectiveDate":"2000-06-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["488681"],"PO":["564181"]},"47356":{"abstract":"EIA-9983249<br\/>Elamagarmid, Ahmed K <br\/>Purdue University<br\/><br\/>Digital Government: Database Middleware for Distributed Ontologies in State and Federal Family and Social Services<br\/><br\/>One of the key problems in government at all levels is data interoperability. The problem arises from the distributed nature of government agencies, the lack of top down leadership, and the remnants of \"silo\" architectures seen in legacy mainframe agency information systems. The explosive growth of the web has exposed this inability to integrate data and the consequent inability to ask sensible questions which cross agency lines; e.g., \"what benefits can I expect from various government agencies when I retire.\" Moving this distributed data to one place is not an option. Rather, technology must be developed to access the data where it is held, using common data definitions, or ontologies and an interface.<br\/><br\/>This grant will support work on this problem in the areas of query infrastructure, middleware for the web, and dynamic inter-ontology support. The government collaborators are the Indiana Family and Social Services Administration, the Indiana Dept. of Workforce Development, and the US Dept. of Health and Human Services.","title":"Digital Government: Database Middleware for Distributed Ontologies in State and Federal Family & Social Services","awardID":"9983249","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["438745","316718"],"PO":["371077"]},"52240":{"abstract":"Solving many important problems in science and engineering depends on efficiently solving sparse linear systems, that is, sets of equations with many zero entries in the coefficients. This project will study techniques for creating sparse linear solvers that make efficient use of the memory hierarcy on single processor computers. It will concentrate on methods that reformulate the original system as a blocked system, with careful choices of the blocks to speed up convergence. Performance programming techniques will reduce the costs of the extra matrix-vector operations needed by the blocked version.<br\/><br\/>There are three technical goals of this work. The first is to contribute to the understanding of the numerical behavior of memory-efficient sparse linear solvers through analysis and experiment. The second is to identify at least one robust, memory-efficient sparse linear solver for inclusion in the Portable Extensible Toolkit for Scientific Computation (PETSc) library. The final goal is to develop a memory-centric performance metric for evaluating the memory traffic requirements of linear algebra algorithms.","title":"Memory-Efficient Implementation of Sparse Linear Solvers","awardID":"0072119","effectiveDate":"2000-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["518600"],"PO":["551992"]},"47741":{"abstract":"Future systems built on a billion-transistor chip will be immensely complex. These Systems-on-a-Chip (SoC) will be built with multiple heterogeneous processor cores, and an operating system is needed to control the interactions between and computations occurring in both hardware and software. This project is developing a Systems-on-a-Chip Operating System (SoCOS) implementation with timing guarantees able to satisfy hard real-time application demands. The following topics are being explored: (1) a SoCOS compiler where part of the SoCOS is implemented in hardware in order to both speed up critical bottlenecks and more effectively manage concurrency among hardware and software; and (2) design and synthesis of a Dynamic Memory Management Unit (DMMU) in hardware for multiple processors and hardware, where the SoC has two main levels of memory hierarchy: each processor's local cache, and larger on-chip memory. The DMMU handles allocation of the larger on-chip memory; software on each processor handles its local cache. A quantification of the trade-offs among implementation and synthesis strategies for SoC Operating Systems is being investigated.","title":"CAREER: Hardware\/Software Real-Time Operating System Design and Synthesis for System-on-a-Chip","awardID":"9984808","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["140002"],"PO":["562984"]},"47752":{"abstract":"This is the first year funding of a four year continuing award. This proposal outlines an extended research program to investigate a hierarchy of nonrigid motion classes, along with their identification and analysis. The educational component of this plan involves graduate and undergraduate course development, efforts for a synergy between research and teaching activities and development of active learning strategies in the proposed courses.<br\/><br\/>Invariant measures from differential geometry are mainly used for our purpose of nonrigid motion analysis. We propose algorithms for general nonrigid motion analysis, based on new distance measures using discriminant, unit?normal and Gaussian curvature variations of surfaces. The proposed system consists of a hierarchy of nonrigid motion models arranged in a simple?to?complex fashion. Our emphasis is not only in designing different classes of nonrigid motions and proposing different techniques to extract motion parameters and point correspondences, but also in applying these algorithms to extensive sets of real data involving face and cloud motion, in particular, hurricane motion. We feel that this is a good testbed for designing, testing, validating and evaluating our system, as face and clouds involve a wide variety of nonrigid motions.<br\/><br\/>This proposal seeks to address three major scientific issues: (i) How to efficiently estimate point correspondences and motion parameters during a general nonrigid motion? (ii) What motion parameters are to be used for an accurate model fit of a given unknown nonrigid motion? (iii) How to classify nonrigid motion?<br\/><br\/>The strengths of the proposed research are threefold. First, the use of invariant differential geometric parameters for nonrigid motion analysis allow the ability to be independent of coordinate system and parameterization, especially since our optimization functions are based on before motion frame's principal coordinate system. The second strength of our approach lies in its ability to interrelate the motion parameters of all the nonrigid motion classes in the hierarchy. The third strength is the ability to estimate point correspondences, nonrigid motion parameters and nonrigid motion type through a single optimization procedure.<br\/><br\/>The educational plan involves integration of research activities in teaching and efforts for undergraduate research involvement. Proposed new courses include graduate level courses in computer vision, video computing and seminar course in analysis and visualization of formable bodies.","title":"CAREER: Methods for Nonrigid Motion Analysis","awardID":"9984842","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["489739"],"PO":["317663"]},"47544":{"abstract":"CAREER: Algorithms for Organizing and Scheduling Distributed Resources<br\/><br\/>This project encompasses several basic algorithmic problems concerning the organization and scheduling of shared resources in distributed environments. Over the course of this project, problems applying to a number of different environments will be studied, including wide-area networks, asymmetric communication channels, broadcast media, and wireless networks. <br\/>An important component of this project is the study of replication, which is an effective paradigm in the design of high-performance scalable information systems. Two major goals of this project are (i) the design of a provably efficient algorithm for coordinated placement of replicated objects, and (ii) the design of a distributed service for directing access requests to appropriately chosen servers.<br\/>Once an access request is assigned to a server, the end-to-end performance observed by the request critically depends on the scheduling policy of the server and the allocation of network resources for the delivery of data from the server to the client. This project also explores competitive online algorithms for server scheduling in unicast and broadcast environments, and the approximability of certain NP-hard optimization problems arising in unicast and multicast routing.<br\/>The final research component of this project focuses on two important aspects related to resource management in wireless networks: contention and mobility. Contention resolution protocols for uplink scheduling in cellular networks and the design of basic control structures in mobile ad-hoc networks will be studied.<br\/>The integrated educational goals of this project include (i) experimental projects in cooperative caching and distributed directory services that will provide research experience for undergraduate students, (ii) the development of a new undergraduate course on the organization, representation, maintenance, and retrieval of data in diverse computing models, and (iii) the development of an advanced graduate course on algorithmic issues in mobile computing.","title":"CAREER: Algorithms for Organizing and Scheduling Distributed Resources","awardID":"9983901","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518070"],"PO":["279077"]},"47357":{"abstract":"EIA9983253<br\/>Callan Jamie<br\/>Carnegie Mellon University<br\/><br\/>Digital Government: A Language Modeling Approach to Metadata for Cross-Database Linkage and Search<br\/><br\/>A crucial problem in government on-line services is that related information is often maintained in different systems across different agencies, thus making it difficult to integrate that information. Most attempts at \"one-stop shopping\" sites in the government fail for that reason; they must be maintained manually which does not work over time. On the other hand, data warehousing, where the data is cleaned, made conformant and housed in a central location, will not work due to the distributed nature of government-held information.<br\/><br\/>One promising avenue to approach this problem would be through the use of automated systems which generate metadata (data about data) for various datasets, allowing them to be integrated more easily, while the original data remains in place at its home site. The work of this proposal will address this problem in a new way - language modeling. The government collaborators are the US Geological Survey, the US Department of Commerce, the General Services Administration and the US Library of Congress.","title":"Digital Government: A Language-Modeling Approach To Metadata for Cross-Database Linkage and Search","awardID":"9983253","effectiveDate":"2000-06-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["541869"],"PO":["371077"]},"46873":{"abstract":"Packet switching has been extensively studied for traffic problems but there has been very little work,<br\/>if any, on the complexity and methodical design of packet switching networks. Indeed, in a recent<br\/>NSF workshop report, it was stressed that a wide variety of switching system architectures have been<br\/>proposed, but little definitive evaluation or comparisons of these architectures have been made under criteria that factor in both performance and cost measures, where technology-dependent and technology-independent factors are clearly separated.\"<br\/> A buffered network model was recently introduced to examine the design and complexity problems in<br\/>packet switching networks. Building on this model, the notion of transparency is introduced in the<br\/>proposed research as a measure of a buffered network's ability to deliver its packets at a specified set<br\/>of traffic rates between its inputs and outputs. The notion of transparency quantifies the ability of<br\/>a buffered network to deliver its packets much like the nonblocking property of a circuit switching<br\/>network quantifies its ability to provide paths between its idle inputs and idle outputs. The main goal<br\/>of the proposed research is to use the notion of transparency to investigate the basic bounds of packet<br\/>transmission in packet switching networks, and construct packet switching networks which come close<br\/>to meeting these bounds. Such bounds are often imposed on a packet switching network by its topology,<br\/>buffer space, and crosspoint and routing complexity. In constrast to circuit switching networks, the<br\/>complexity of packet switching networks has escaped the scrutiny of packet switching research so far,<br\/>but without any information on their complexity, the performance of packet switching networks cannot<br\/>be quantified.<br\/> Along with the investigation of the complexity problems, the proposed research will attempt to identify<br\/>the types of traffic and assignments for which efficient buffered networks can potentially be obtained,<br\/>and actually construct such networks. Informally speaking an \"efficient buffered network\" is one which<br\/>utilizes its crosspoints and buffer space as fully as possible subject to meeting a set of traffic constraints. Both unicast and multicast buffered networks will be investigated. The main tools of the proposed research will be Hall-type theorems, Pinsker's inexplicit combinatorial constructions, and explicit recursive network construction techniques. Inexplicit constructions will be used to establish the optimality and quantify the performance of explicit recursive buffered networks. The researchers anticipate that<br\/>the complexity bounds on packet switching and recursive buffered network construction techniques to<br\/>be obtained in the proposed research will have a strong impact on the way that packet switches are<br\/>designed, and can pave the way for a methodical design of efficient and practical packet switching<br\/>networks.","title":"Complexity and Design of Transparent Packet Switching Networks","awardID":"9981187","effectiveDate":"2000-06-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["197478","226162"],"PO":["565090"]},"47852":{"abstract":"The research component of this project focuses on two fundamental<br\/>distributed network problems. The first problem is that of devising<br\/>an efficient method for accessing shared information (objects) in a<br\/>distributed scenario (Problem A); the second problem is probably the<br\/>most fundamental problem that arises in any communication network,<br\/>namely that of devising efficient point-to-point routing protocols<br\/>(Problem B).<br\/><br\/>More specifically, the PI proposes to accomplish the following<br\/>research items:<br\/><br\/>- to deliver solutions to Problem A in fixed-connection networks,<br\/> taking into account several important network parameters -- such as<br\/> link congestion, dynamic link costs, and multiple representations of<br\/> objects -- and in cellular and ad-hoc wireless mobile scenarios.<br\/><br\/>- to deliver solutions to Problem B in conjunction with Problem A,<br\/> with the aim of minimizing the cost of accessing an object.<br\/><br\/>- to deliver solutions to Problem B on its own, in wireless mobile and<br\/> fixed-connection scenarios.<br\/><br\/>Not surprisingly, the problem of accessing shared objects and the<br\/>routing problem in distributed environments are strongly related in<br\/>many ways. For example, they are directly related in dynamic<br\/>scenarios. Therefore the PI anticipates that studying these two<br\/>problems together in mobile scenarios will help devise better<br\/>solutions for both problems.","title":"CAREER: Accessing Shared Objects and Routing in Distributed Environments","awardID":"9985284","effectiveDate":"2000-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["563358"],"PO":["309350"]},"48842":{"abstract":"9988400<br\/>Stark, Louise<br\/>University of the Pacific<br\/><br\/>Special Project: Workshop on Undergraduate Education & Computer Vision<br\/><br\/>This project provides support for up to 25 faculty from primarily undergraduate teaching institutions, particularly those that serve traditionally under-represented groups, to attend the IEEE sponsored Workshop on Undergraduate Education and Computer Vision, held in conjunction with the Computer Vision and Pattern Recognition (CVPR) 2000 Conference. Growth of the field of image-related computation, including especially computer vision and pattern recognition, has created a significant need for additional educational opportunities in these areas and this project provides a highly leveraged approach toward meeting a part of that need. The workshop provides well-documented examples of courses, course modules, case studies, laboratory resources and other teaching materials to help faculty design high-quality image-related undergraduate courses. This project is a follow-on to the successful similar workshop held in 1997.","title":"Special Project: Workshop on Undergraduate Education & Computer Vision","awardID":"9988400","effectiveDate":"2000-06-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[125021,"173374"],"PO":["329035"]},"46664":{"abstract":"An ad hoc network is communication paradigm that does not rely on a pre-existing communication infrastructure. Rather, the network is established on-demand. Thus, the network needs to be deployed without prior planning and needs to operate in a variety of different and differing network propagation conditions, traffic demands, and user mobility patterns. Nodes in an ad hoc network frequently join and leave the network, without prior notice. Furthermore, the nodes are mobile and communicate by accessing a shared wireless channel. Consequently, the topology of the network is constantly changing i.e., connections between neighbor nodes (nodes that can communication directly) are established and torn down all the time. Since the diameter of the network may be significantly larger than the transmission range of a single node, communication between non-neighbor nodes is by multi-hop routing. Probably the most characteristic feature of ad hoc networks is that there is no central entity in the network. This is radically different than most other wireless networks, especially the cellular networks. Thus, nodes in an ad hoc network rely on peer-to-peer communications. Consequently, all network protocols need to be implemented in a distributed manner and need to be extremely efficient, as to ensure that the overhead caused by the frequent reconfiguration of the network is not prohibitively large. Application of ad hoc networks has been for a long time limited to the military communication environment only. However, recently, the commercial sector is increasingly interested in this technology, evidence of which is the establishment of the Intenet Engineering Task Force, MANET Working Group. ALthough it is still not clear what the main application of the commercial ad hoc network will be, applications for LAN, sensor networks, and virtual classrooms have been proposed. One of the main difficulties in promoting the concept of ad hoc networks is that, inherently, ad hoc networks are extremely vulnerable to security attacks. Not only do these networks rely nearly exclusively on unreliable and insecure wireless communication, but also the nodes in the network do not, in general, belong to the same administrative domain. Thus the standard security measure may not be readily applicable to ad hoc networks. But above all, the lack of centralized entity makes design of security protocols that much more difficult. In particular, due to possibly low availability of any network node, no one node can serve as a trustful entity in the network. Moreover, as an ad hoc network may consist of thousands to tens of thousands of nodes, it is essential that any solution be highly scaleable. Furthermore, it is imperative that the security protocols address the highly dynamic communication environment, for example, by frequent rekeying of the system. Finally, because of the nature of the nature of these networks and their intended application, high degree of reliability and survivability to node and link failures is necessary. Fortunately, many protocols that protect against intentional security attacks also guard the system again (unintentional) system failures. As part of the proposed research, the researchers plan on investigating a number of central schemes that will allow secure communication in the ad hoc networking environment. Secure communication needs to address the following attributes: availability, confidentiality, integrity, authenticity, and non-repudiation. Some of these attributes can be addressed through conventional security protocols, such as ensuring privacy of information through encryption. However, for other attributes, the standard security measures do not suffice. For example, authentication in an ad hoc network cannot rely on a signle central trustful entity. The researchers propose to use two main principles in securing the communication in an ad hoc network: use of redundancies in the network topology and distribution of trust. The main idea is that availability can be improved by relying on multiple routing paths in the network. So, if compromised paths can be eliminated, other paths can be used reliably. The second principle - the distribution of trust - is based on the assumption that as no single node is worth unlimited trust of other network nodes. However, a large enough quorum of nodes can be trusted, as the probability of compromising large number of nodes simultaneously is rather small. This research proposes to investigate the above mentioned issues of supporting secure communications in the ad hoc network by proposing and designing fundamental framework for such a communications. The researchers will use both analysis and simulation to evaluate our protocol and we intend to implement these protocols to demonstrate their behavior in a practical network.","title":"Secure Communications for Ad Hoc Networking","awardID":"9980521","effectiveDate":"2000-06-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["438934"],"PO":["565090"]},"47522":{"abstract":"The objective of this award is to build an education and a research program in digital image processing. The development of digital technology is facilitating advances in virtually every area of science. Further advances will surely accrue as the technology improves. <br\/><br\/>The objective of this award is to build an education and a research program in digital image processing. The development of digital technology is facilitating advances in virtually every area of science. Further advances will surely accrue as the technology improves. <br\/><br\/>The rapid development of digital technology is due to work that spans several disciplines. As a result, students interested in this area must cobble together courses from a range of departments. Even if students are able to take all of the necessary courses, the material is certainly not presented to them within a cohesive framework. One objective of this award is the creation of a curriculum for the study of digital image processing. This curriculum will draw from topics in computer science, electrical engineering, mathematics, optics, and psychology.<br\/><br\/>The second objective of this award is the creation of a research group dedicated to topics in digital image processing and computer vision. My group will undoubtedly be involved in a variety of research projects, but the emphasis will be on studying the mixing process that typifies the formation of digital images. This research will have a dual focus: (1) the first focus will be in separating the various components that contribute to the appearance of an image (e.g., lighting, reflectance, and shape); (2) the second focus will be in understanding how these image components are mixed to form natural images, and in characterizing the statistics of natural images.<br\/><br\/>The rapid development of digital technology is due to work that spans several disciplines. As a result, students interested in this area must cobble together courses from a range of departments. Even if students are able to take all of the necessary courses, the material is certainly not presented to them within a cohesive framework. One objective of this award is the creation of a curriculum for the study of digital image processing. This curriculum will draw from topics in computer science, electrical engineering, mathematics, optics, and psychology.<br\/><br\/>The second objective of this award is the creation of a research group dedicated to topics in digital image processing and computer vision. My group will undoubtedly be involved in a variety of research projects, but the emphasis will be on studying the mixing process that typifies the formation of digital images. This research will have a dual focus: (1) the first focus will be in separating the various components that contribute to the appearance of an image (e.g., lighting, reflectance, and shape); (2) the second focus will be in understanding how these image components are mixed to form natural images, and in characterizing the statistics of natural images.","title":"CAREER: Mixing and Separating Digital Images","awardID":"9983806","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["511583"],"PO":["317663"]},"48853":{"abstract":"This research investigates the problem of synthesizing novel views of dynamic, three-dimensional scenes containing multiple rigid objects in motion, given a set of photographs captured at different positions and different times. Image-based interpolation and extrapolation methods are developed so that physically-correct motion sequences can be synthesized showing how the scene objects could have moved during the missing time interval. Motion classes corresponding to basic types of rigid motion an object can undergo (e.g., translational motion or rotation about a single axis) will be used. For each class, techniques for synthesizing physically-correct views without first recovering the scene geometry, will be designed, implemented and tested. As an alternative to non-reconstructive image-based view and motion synthesis, methods that utilize object motion information to perform camera self-calibration and 3D scene reconstruction will also be explored. By recovering properties such as the vanishing point and the fundamental matrix for each moving object, camera calibration information can be directly computed without necessitating point correspondences. Results will include a better theoretical understanding of image-based methods for dynamic scenes, and new algorithms for motion interpolation and multi-view, motion-based scene reconstruction.","title":"View Synthesis for Dynamic Scenes, With and Without Reconstruction","awardID":"9988426","effectiveDate":"2000-06-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["501477"],"PO":["234178"]},"47677":{"abstract":"Computer Animation is a powerful medium for communication, with potential to explain, educate, or<br\/>entertain. However, the potential of animation beyond entertainment is largely untapped because of the<br\/>difficulty and cost in producing it. While the state of the art provides tools for expert animators to craft<br\/>works of art, it offers little help for those without considerable time and talent.<br\/>Our vision is that computer animation will be a widely used medium for communication, that a wide range<br\/>of users will choose to share their messages in this medium, and that the availability of this medium will<br\/>impact how we educate students. The widespread availability of internet bandwidth offers the mechanism<br\/>for creators to share animation: what is missing are the tools to create it.<br\/>Our premise is that:<br\/>1. The power of animation can be more broadly used, with particular impact in education, if we can lower<br\/>the barriers to its production with tools that democratize the medium.<br\/>2. Techniques for transforming motions can enable such tools by allowing users to leverage the work of<br\/>others if we can devise technologies that retain the desirable properties of the original during<br\/>transformation.<br\/>3. The spacetime constraints approach to motion transformation can provide this technology if it is more<br\/>fully developed.<br\/>This proposal presents a faculty career development plan committed to the vision of ubiquitous animation.<br\/>The research component will develop technologies that enable a wider range of uses of animation, and the<br\/>education component will use animation for education and better prepare computer scientists to work with<br\/>visual media.<br\/>The overall goal of the research effort is to create enabling technologies for new animation tools that are<br\/>more accessible to those who are not skilled animators. We propose techniques for transforming motions to<br\/>new uses, for example applying an action to a new character or new environment. The challenge is to create<br\/>transformations that both meet the new needs, yet preserve the desirable properties of the original. Our prior work introduced the spacetime constraints approach to motion transformations. Mathematically, the<br\/>approach poses motion transformation as a constrained optimization problem: what motion meets the<br\/>specified needs yet best preserves the original motion? Unlike most animation techniques, spacetime<br\/>constraints consider entire motions simultaneously, rather than computing instants in time individually. This requires solving a single, large numerical problem for each motion computation. Our work to date shows the spacetime constraints approach is a viable approach for tackling important problems in computer animation. The research component of the development plan is to leverage our initial results with the spacetime constraints approach towards the broader goal of democratizing animation. Specifically, work is proposed to improve the mathematical foundations of the approach to enhance its reliability and applicability, to develop new types of motion transformations, to implement systems that provide motion transformations to our target users, and to demonstrate how these new types of tools can be used for the production of effective<br\/>visual messages.<br\/>The education component of the development plan consists of three parts. First, the plan addresses the need<br\/>to train students at the University of Wisconsin in graphics and animation by developing new courses and<br\/>providing research and project opportunities for students at all levels. Second, the plan proposes to use<br\/>animation to improve pedagogy: by creating materials for classes as well as for outreach. Third, the plan<br\/>proposes to help foster the development of animation technology through outreach to the technical<br\/>community.","title":"CAREER: Motion Transformations for Animation","awardID":"9984506","effectiveDate":"2000-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["531411"],"PO":["532791"]},"53474":{"abstract":"This is funding to subsidize travel and housing expenses of a select group of US graduate students to attend the ACM International Conference on Autonomous Agents (AGENTS 2000), to be held June 3-7 in Barcelona, Spain. This is the premier conference devoted entirely to agents research, an area of artificial intelligence which is central to the success of the World Wide Web and the Internet revolution. Attending the conference will allow a diverse group of graduate students whose research spans a range of topic areas and methodologies to present their work to and receive feedback from the agents community. The students will be selected by a committee, and special mentoring activities will be planned for them with the goal of fostering interactions with senior researchers. This, in turn, will help set the directions of future research in the field, and guarantee continued growth and development of agents technology.","title":"Workshop: Support for International Travel of Graduate Students to Agents Conference","awardID":"0076319","effectiveDate":"2000-06-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["561562"],"PO":["564456"]},"47743":{"abstract":"CCR-9984812<br\/>CAREER: Type-Driven Language Technology for Software and<br\/>Information Infrastructure<br\/><br\/>Karl Crary<br\/><br\/>The research seeks to address challenges faced in developing, maintaining and deploying modern software systems by exploiting type theory along three avenues: programming language design, language-based security mechanisms, and typed compilation. The language design research focuses on support for large-scale programming, particularly module systems, for breaking up software projects into manageable pieces, and type systems capable of specifying and enforcing complex program invariants. The security research focuses on systems for checking and certifying the safety of untrusted mobile code. In particular, it investigates the extension of these systems both to support tighter security policies (including bounds on resource usage) and to loosen their restrictions on aspects of code not affecting safety. The typed compilation research seeks to advance the technology of compilers that preserve and exploit type information from source code to executables; this is the enabling technology for each of the other two avenues, providing high-performance compilation of advanced languages, and certification of the resulting executables for safety. The educational program also seeks to address these same challenges by familiarizing undergraduate students with basic formal skills for structuring and reasoning about programs, and graduate students with type-theoretic language design and compilation.","title":"CAREER: Type-Driven Language Technology for Software and Information Infrastructure","awardID":"9984812","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["339843"],"PO":["564388"]},"53188":{"abstract":"This award supports a three day symposium devoted to the topic of multiscale and multiresolution methods in computational science. Arguably, multiscale and multiresolution methods represent the most important tool in obtaining asymptotic scalability of large scale computations and data manipulation. Although a well-known paradigm of computation, recent developments in the general area of multiscale computation such as, multiscale finite element methods as well as new developments in the area of specialized multiresolution representations such as curvelets and ridgelets have suggested important new application areas for these techniques which will be highlighted by speakers at the symposium. Since multiscale and multiresolution techniques are just beginning to penetrate diverse areas of scientific computing such as molecular dynamics and scientific visualization, one goal of the symposium is to bring together as many differing perspectives on the subject as possible with the goal and expectation of inspiring new avenues of research and application.","title":"WORKSHOP: Yosemite Workshop on Multiscale and Multiresolution Methods 10\/29-11\/01\/2000, Yosemite Lodge, Yosemite National Park","awardID":"0075140","effectiveDate":"2000-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["306467",135484,135485],"PO":["179296"]},"48975":{"abstract":"Previous work has hinted that human brain signals may be able to control a computer. However, traditional mouse-oriented interaction techniques are tedious and error-prone for users controlling a computer with neural signals. In order to increase the efficacy of direct brain-computer interfaces, new paradigms of human-computer interaction must be devised in order to facilitate faster and more accurate control with minimal effort on the part of the user, through use of auditory, visual, haptic feedback. The PIs will explore hysteretic (\"nudge and shove\") user interfaces as a possible means to this end, combining the new techniques with ideas adapted from Georgia Tech's \"Aware Home\" research in an effort to find ways to improve the quality of life for locked-in patients by giving them the ability through their brain signals to control features of their personal environment such as lights, television, radio, and temperature. The PIs plan to implant six new patients and to continue working with the two patients who are already implanted. This project will lay the groundwork fir innovative methods for communication (including phonemes, codes, and iconic languages that could be mapped directly to neural signals), for Internet access (including web browsing and electronic communication); and eventually for effective ways of giving implant patients control of prosthetics which could restore movement to paralyzed limbs.","title":"Direct Brain-Computer Interfaces","awardID":"9988748","effectiveDate":"2000-06-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["506686","353970"],"PO":["565227"]},"55267":{"abstract":"0084408<br\/>Heath<br\/><br\/>This proposal is to support a workshop that will be designed to explore issues related to the future of nano-scale and molecular electronics. In particular, issues related to computer architectures for molecular and nano-electronics, chemical self-assembly as a fabrication technology, and the expected scientific challenges associated with making molecular electronics a reality will be discussed. The meeting will include presentations by leading practitioners in the fields of computer architecture and design as well as physical scientists working in the areas of nanoscale systems and molecular electronics. Of potential interest to both of these groups is the field of neuroscience, and a small number of participants (and a corresponding few scientific presentations) will be from that field. The goal of this workshop will be to explore the common ground that exists between computer architecture, molecular and nano-scale electronics, and neuroscience. The result will be a document that can assist the NSF in developing a strategy for funding these various areas. The workshop is being co-funded by NSF Divisions: ECS\/ENG, CTS\/ENG, DMR\/MPS, DBI\/BIO AND EIA\/CISE.<br\/>***","title":"Workshop: Nano-scale and Molecular Electronics Workshop","awardID":"0084408","effectiveDate":"2000-06-01","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1108","name":"INSTRUMENTAT & INSTRUMENT DEVP"}}],"PIcoPI":["293096"],"PO":["239665"]},"47546":{"abstract":"Proposal Number: CCR-9983926<br\/><br\/><br\/>TITLE: CAREER: Towards Estimating Requirements Coverage:<br\/> Managing Scenarios and Goals During Requirements Evolution<br\/><br\/>PI: Ana (Annie) I. Anton<br\/><br\/><br\/>The career development planned outlined in this proposal focuses on the<br\/>principal investigator's efforts to integrate core research and educational<br\/>objectives. The research addresses important issues in the discovery,<br\/>elaboration and management of system use scenarios for the specification of<br\/>software requirements. The ultimate goal is to develop viable solutions<br\/>for supporting the early stages of the software lifecycle by ensuring<br\/>requirements coverage. The objective is to produce a framework, and<br\/>web-based tool support, to enable the evaluation of requirements activities<br\/>and processes during scenario management and evolution as well as<br\/>requirements coverage estimation. The web-based tool will serve as an<br\/>experimental research engine, collecting data on requirements engineering<br\/>activities in a series of projects for real clients in various domains,<br\/>sites and project teams.<br\/><br\/>The educational component is closely related to the research plan.<br\/>Students, at the undergraduate and graduate level, as well as industrial<br\/>participants, will use the software produced during the research<br\/>activities. The results of this research are expected to improve the<br\/>outcome of projects that employ goal and scenario-based approaches during<br\/>requirements specification. A library of projects in various domains will<br\/>lead to new materials such as techniques, methods and cases for software<br\/>engineering education.","title":"CAREER: Towards Estimating Requirements Coverage: Managing Scenarios and Goals in Requirements Evolution","awardID":"9983926","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["517936"],"PO":["564388"]},"48767":{"abstract":"Erich Kaltofen proposes to study mathematical optimization techniques on problem formulations that are imprecise due to numerical data; randomization techniques that are the power tools in the design of fast algorithms with exact arithmetic on black box matrices; and generalization of the computer programs that implement these algorithms to multiple domains with methodologies such as generic, reusable programming and interface protocols.<br\/><br\/> A difficulty in the symbolic\/numeric area is that inputs with imprecise coefficients as a result of a physical measurement or a numerical computation can lack a known property that is of interest. For example, instead of a double real root, a polynomial has two conjugate complex roots that are very close together. The optimization problem is to compute efficiently the nearest input that has the desired singularity.<br\/>Our focus will be on the nearest pair of polynomials with a common root under coefficient-wise change (infinity norm), the nearest singular Toeplitz matrix, and the nearest bi-variate complex polynomial that factors over the complex numbers, the latter two under any reasonable norm.<br\/><br\/> A black box matrix is stored as a function that performs the matrix-times vector product. Efficient algorithms for performing linear algebra computations with exact field arithmetic, such as solving a linear<br\/>system with a black box coefficient matrix, are based on the Lanczos\/Wiedemann approach.<br\/>Randomization techniques, for instance, matrix pre-conditioning and Krylov sub-spacing with random projections, avoid self-orthogonality when the coefficients are from a finite field and general algorithmic<br\/>break-down due to certain invariant factors of the matrix. We propose to investigate how the different linear algebra problems are interelated, for example if the computation of a solution of an inhomogeneous black box linear system can be efficiently reduced to the computation of a column dependency of a black box matrix.<br\/><br\/> Generic programming is a software design technique that generalizes a program so that it can be used with more than one underlying domain. The proposed implementation of our black box algorithms not<br\/>only permits the plug-in of a black box matrix over a native coefficient field, but the code also imports internally needed operations like polynomial and vector operations from expertly fine-tuned existing packages across generic interfaces. Our library's application program interface provides a serialization mechanism for black box objects that is compliant with the MathML\/OpenMath philosophy and that allows<br\/>Internet communication.<br\/><br\/> Finally, we propose research on two classical problems. First, the polynomial-time computation of dense, low-degree factors of high-degree sparse multi-variate polynomials with rational coefficients, which would generalize a recent related result by Hendrik W. Lenstra, Jr. Second, a time- and space-efficient realization of the transposition principle for transforming a matrix-times-vector function to the transpose vector-times-matrix operation.","title":"Optimization, Randomization, and Generalization in Symbolic Computation","awardID":"9988177","effectiveDate":"2000-06-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485433"],"PO":["321058"]},"47843":{"abstract":"CCR-9985239<br\/>CAREER: A Formal Programming Methodology with Applications to<br\/>Developing Automated Verifiers<br\/>PI: James L. Caldwell<br\/><br\/>The goals of this research are (i) the development of new methods for<br\/>formal program development which combine existing approaches to<br\/>verification and synthesis; (ii) the application of those methods to<br\/>the development of correct-by-construction verification engines; and<br\/>(iii) integrating the formalized mathematics that supports these<br\/>methods into the undergraduate computer science curriculum. In<br\/>program development practice it is sometimes more expedient to verify<br\/>a known program, while at other times, synthesis is the better<br\/>approach. The research investigates methods of combining these<br\/>complementary modes of development within a single framework to<br\/>justify the correctness of complex software artifacts. The work<br\/>largely takes place within the framework of the constructive type<br\/>theory provided by the Nuprl system. This new method of program<br\/>development is applied and refined in the context of efforts to secure<br\/>correct implementations of automated verifiers; model checkers and<br\/>decision procedure based verification engines. The digital<br\/>representations of mathematical definitions, proofs, proof strategies,<br\/>and theorems that support this mode of program development formally<br\/>encode the applied mathematics of Computer Science. This research<br\/>explores new ways to incorporate this material in the undergraduate<br\/>classroom.","title":"CAREER: A Formal Programming Methodology with Applications to Developing Automated Verifiers","awardID":"9985239","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["308683"],"PO":["564388"]},"47437":{"abstract":"ABSTRACT: <br\/><br\/>The broad goal of this research program is to contribute in the development of analytical techniques for the design and performance evaluation of several transmission technologies that are candidates for future wireless communication systems. The scope of the program is broad with particular focus on diversity and adaptive transmission techniques. Successful completion of the work will allow designers of emerging wireless systems to perform tradeoff studies (performance versus complexity) among various options so as to determine the more suitable choice in the face of complexity and implementation constraints. In addition the developed generic analytical techniques will also serve for other researchers to evaluate the performance of other practical applications of their own interest. The research plan has educational benefits not only for the research assistants involved in the proposed research but also for the students enrolled in a wireless communication course that the investigator is developing and which will enhance the strong core curriculum of signal processing and communication theory classes at the University of Minnesota.<br\/><br\/>More specifically on the diversity techniques front the research involves:<br\/>1. The metrics, performance, and low complexity implementation of diversity receivers with multi-symbol and decision feedback differential detection. <br\/>2. Development of generic analytical techniques for the accurate assessment of the outage probability and average outage duration of diversity receivers.<br\/>3. Design and performance evaluation of low complexity smart antennas with successive co-channel interference reduction capabilities.<br\/>4. Accurate assesement of the diversity gain of more effective composite microscopic\/macroscopic diversity combining techniques.<br\/><br\/>Research directions for adaptive techniques focuses on the<br\/>1. Design and performance evaluation of adaptive embedded modulations. <br\/>2. Development of an analytical framework to quantify the spectral efficiency of adaptive multimedia cellular systems. <br\/><br\/><br\/>3- Level of Effort Statement<br\/>At the recommended level of support, the investigator will make<br\/>every attempt to meet the original scope and level of effort of <br\/>the project.","title":"CAREER: Analysis Techniques for the Design and Performance Evaluation of Wireless Communication Systems","awardID":"9983462","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[121430],"PO":["223414"]},"48779":{"abstract":"ABSTRACT<br\/>The dominance of interconnect delay on modern circuit performance has resulted in a shift in design practices. Modern design flows require both better area routing methods, and better support of performance constraints. This project explores a new approach to area routing, placing first priority on the functionality of interconnecting wires, with design rule compliance being considered secondarily. Under study are (1) methods to classify and characterize interconnect structures, (2) methods to evaluate the performance of groups of these structures, and (3) algorithmic techniques to select a set of interconnect structures which meet performance constraints and also obey design rules. A practical area routing tool is being developed.","title":"Functionality Based Area Routing for VLSI Design","awardID":"9988222","effectiveDate":"2000-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[124871],"PO":["201974"]},"55214":{"abstract":"The National Research Council's Board on Mathematical Sciences (BMS) and<br\/>Computer Science and Telecommunications Board (CSTB) are planning a 1.5-day<br\/>workshop to explore the actual and potential breadth and depth of their<br\/>fields' mutual interface. The goals of the planned workshop are to demonstrate<br\/>the potential for additional cooperation between the mathematical sciences and<br\/>computer science and to begin building some new research collaborations.<br\/><br\/><br\/>The workshop is planned for April 28 (afternoon) and all day on April 29, 2000.<br\/>It will be held at an NRC facility in Washington, D.C. At least 25-30 researchers<br\/>will be invited to (1) share research interests that are of interest to both<br\/>fields, and (2) discuss whether further steps by the NRC are necessary to encourage<br\/>collaborations between the fields.<br\/><br\/>This activity will be funded jointly by the Division of Mathematical Sciences of<br\/>the Mathematical and Physical Sciences Directorate, and the Division of Computer<br\/>and Computation Research of the Computer, Information Sciences and Engineering<br\/>Directorate.","title":"Workshop on Mathematical and Statistical Research Opportunities from Computer Science","awardID":"0084252","effectiveDate":"2000-06-01","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["555004"],"PO":["256494"]},"42598":{"abstract":"Abstract<br\/>CTS-9910404<br\/>H. Aref, University of Illinois Urbana-Champaign<br\/><br\/><br\/>The ICTAM 2000 meeting in Chicago will be an opportunity for cross fertilization of ideas, techniques, clarification of fundamental issues, networking, etc. within the extremely broad community encompassed by the designation: \"Theoretical and Applied Mechanics.\" The large number of participating programs (12) speaks to the breadth of interests that will be present at this meeting.","title":"ICTAM2000 - 20th International Congress of Theoretical & Applied Mechanics to be held in Chicago, Illinois August 27 - September 2, 2000","awardID":"9910404","effectiveDate":"2000-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1287","name":"MATHEMATICAL PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1522","name":"PHYSICAL METEOROLOGY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1579","name":"HYDROLOGIC SCIENCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1179","name":"Enviro Health & Safety of Nano"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1406","name":"THERMAL TRANSPORT PROCESSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1414","name":"INTERFAC PROCESSES & THERMODYN"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}}],"PIcoPI":["197952"],"PO":["255964"]},"46998":{"abstract":"9981755<br\/>Randall<br\/><br\/>This three-year award for U.S.-France cooperative research in computation and computer research involves Dana Randall, Vijay Vazirani, Leonard Schulman and other researchers from the College of Computing at Georgia Institute of Technology, and Claire Kenyon and the research group at LRI (Laboratoire de Recherche en Informatique), University of Paris, Sud. The project is supported under a joint program of the National Science Foundation and the French National Center for Scientific Research. The project focuses on four areas of research in theoretical computer science, emphasizing applications for approximation algorithms and new models of computation. The areas are: (1) Markov chain Monte Carlo methods for analysis of physical systems; (2) approximation algorithms; (3) codes and loss-resilience in the context of constructing codes for loss information retrieval; and (3) quantum computation, in particular, quantum cryptography.<br\/><br\/>This award will support the incremental costs of the international collaboration; that is, the travel to Paris, France and subsistence expenses of the U.S. investigators. The project takes advantage of complementary expertise of the U.S. and French groups and their work on similar problems. The project will advance fundamental understanding of randomness and approximation problems in computing that are connected to other fields of science, namely, statistical mechanics, data mining, coding theory, and quantum mechanics.","title":"U.S.-France Cooperative Research: Randomness, Approximation and New Models of Computation","awardID":"9981755","effectiveDate":"2000-06-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["516928","550549","518569"],"PO":["564152"]},"55347":{"abstract":"This award supports the travel, housing and registration costs of 15 students who would not otherwise be able to attend the 4th International Conference on Multiagent Systems (ICMAS-2000) in Boston, Massachusetts, July 7-12. This conference is the premier conference on agent technology and will have associated with it many tutorials, workshops and other events given by leading researchers in this field. One valuable part of student training is participation in the excitement of an international conference where major researchers present their work and engage one another in dialogue. The goal of this proposal is to enable students who are deserving but may not have the financial resources available to attend. A committee of senior ICMAS organizers has been formed to select students based on the following criteria: 1) those presenting papers; 2) those presenting posters; 3) those presenting in workshops or other associated conference forums; and 4) those whose research could benefit from attendance.","title":"ICMAS-2000 Student Travel Grant","awardID":"0084708","effectiveDate":"2000-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["362927"],"PO":["495796"]},"48857":{"abstract":"We propose research underlying the use of cobots for haptic display of solid models. The project brings together CAD graphics\/haptics researchers at Ford Motor Company with haptics\/cobot researchers at Northwestern University. A recently completed 3R haptic cobot will be the experimental testbed for the project.<br\/><br\/>Large-scale haptic display opens up new opportunities, because people interact with large objects (arm size or larger) in a very different way from that in which they interact with small objects (hand size or smaller). An example is the current use of full-size \"clay bucks\" in automobile design. A sense of the feel and sweep of an automobile body panels cannot be obtained by touching a scale model of it with a finger, as current haptic displays permit. However a full sized virtual model experienced through the proprioception of whole arm motion, in conjunction with the excellent CAD graphics now available, could bring virtual prototyping and surface editing to a new level of utility.<br\/><br\/>Cobot control for haptics differs markedly from robot control for haptics, because cobots use servo-steered rolling mechanisms, rather than servomotor actuators, to create virtual surfaces. The project addresses (1) development of a control methodology for the new power-injection architecture of the 3R cobot. (2) finding cobot-appropriate algorithms for haptic surface rendering directly from NURBS descriptions of surfaces. (3) deriving control laws for dynamic behaviors beyond hard surfaces, including compliant and viscous effects, inertia masking, and artificial potentials (4) finding algorithms for solid-model collision detection which allow the collision to be predicted and rendered by the cobot without exceeding its dynamic limits.","title":"GOALI: Haptic Cobots","awardID":"9988437","effectiveDate":"2000-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["541975","541976",125061,125062],"PO":["234178"]},"52763":{"abstract":"Recent advances in technology have provided portable computers with wireless interfaces that<br\/>allow networked communication among mobile users. The resulting computing environment, which<br\/>is often referred to as mobile computing, no longer requires users to maintain a fixed and universally<br\/>known position in the network and enables almost unrestricted mobility. An ad hoc wireless<br\/>network is a special type of wireless mobile network in which a collection of mobile hosts with<br\/>wireless network interfaces may form a temporary network, without the aid of any established<br\/>infrastructure or centralized administration.<br\/> Efficient routing among a set of mobile hosts (also called nodes) is one of the most important<br\/>functions in ad hoc wireless networks. Routing based on a connected dominating set is a promising<br\/>approach, where the search space for a route is reduced to the nodes in the set. A set is dominating if<br\/>all the nodes in the system are either in the set or are neighbors of nodes in the set. In this proposal,<br\/>the researchers study a simple and efficient distributed algorithm for calculating a connected dominating set<br\/>in an ad hoc wireless network, where connections of nodes are determined by their geographical<br\/>distances and the corresponding graph is called a unit graph. A reduced graph is then induced<br\/>from the connected dominating set and the routing process is restricted to this reduced graph. The researcher's preliminary results on random unit graphs are very promising in generating a small reduced graph in a way faster than existing methods.<br\/> The goals of the proposed research are: (1) Enhance the process (also called the marking<br\/>process) of determining a connected dominating set of a unit graph. (2) Complete the update\/re-<br\/>calculation algorithm for the connected dominating set when the topology of the ad hoc wireless<br\/>network changes dynamically. (3) Extend the proposed approach to a hierarchical structure, where<br\/>the marking process is applied on the reduced graph to generate a reduced graph of the reduced<br\/>graph. The hierarchical structure is obtained by applying the marking process iteratively. (4) Select<br\/>an appropriate routing protocol for the reduced graph. This scheme could be a proactive routing<br\/>(such as various extended link state and distance vector routing protocols), a reactive routing (also<br\/>called on demand), or a combination of both. (5) Explore the possibility of combining dominating<br\/>set information and location information provided by a Global Positioning System (GPS) to derive<br\/>a better routing scheme. (6) Integrate different components and fine tune the system through an<br\/>empirical study based on a set of well-defined quantitative performance metrics.","title":"A Dominating-Set-Based Routing Scheme in Ad Hoc Wireless Networks","awardID":"0073736","effectiveDate":"2000-06-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["7594"],"PO":["565090"]},"47714":{"abstract":"-------------------------------------------<br\/>CCR-9984681<br\/>(title unchanged)<br\/>PI: John T Boyland<br\/><br\/><br\/>Software evolves through the addition of features, removal of defects,<br\/>or improvement in the basic algorithms. The desired changes may be<br\/>easiest to incorporate if the program is first restructured. This<br\/>research has impact through its incorporation into the ACT\/Fluid<br\/>prototype software engineering tool, which supports programmer-guided<br\/>program manipulation and restructuring. Since the tool does not have<br\/>access to the whole program (portions may be hidden in libraries or<br\/>undergoing concurrent development), this research proposes decorating<br\/>interfaces between components with annotations called ``promises.''<br\/>Promises serve as surrogates of missing code during inter-procedural<br\/>analysis, serve as proof obligations when that code is itself<br\/>analyzed, and serve as contracts between separately-developed program<br\/>components. The investigator is integrating the research directly<br\/>into two computer science courses: one, a graduate course on program<br\/>analysis; the other uses the ACT\/Fluid prototype as a refactoring tool<br\/>for Java programs. Additionally, the investigator is addressing the<br\/>needs of non-traditional students through increased emphasis<br\/>on `how' and `why' issues, more supportive instructor-student<br\/>interaction, and improved assessment procedures. Successful<br\/>completion of this project will encourage the use of verified program<br\/>manipulations in software evolution, leading to better structured<br\/>programs with fewer defects","title":"CAREER: Analysis Techniques for Evolution of Modular Software","awardID":"9984681","effectiveDate":"2000-06-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["332331"],"PO":["564388"]},"49629":{"abstract":"Parallel iterative methods are leading candidates for solving large-scale engineering and scientific problems, which usually appear as sparse linear systems. However, their robustness and overall efficiency remain mixed and problem-specific. These characteristics are closely tied to the preconditioners used as inputs to these methods. Preconditioners for general sparse linear systems remain by far the biggest stumbling block to obtaining good performance for iterative solution methods on high-performance computers in engineering and scientific applications. Accordingly, the main thrust of this project is to develop a class of preconditioning techniques based on the researchers' Algebraic Recursive Multilevel Solver (ARMS) framework. The researchers will develop the new methods and test them on realistic problems arising from the researchers' collaborations.<br\/><br\/>The project will develop a class of parallel multi-level ILU-type preconditioning techniques using ARMS methods. Recursive multi-level ILU methods allow the unification of many standard iterative solvers into a single generic code. Their multi-level nature allows them to bridge the gap between the excellent problem-specifc performance of multigrid methods and the general-purpose nature of preconditioned Krylov solvers. The project will examine performance and scalability for classes of existing and new procedures thus obtained, including Schwartz procedures, Schur complement methods, direct solvers, and multilevel techniques. It will also conduct extensive realistic tests. In summary, this work promises advances in three important components of developing parallel solution methods: effective and scalable algorithms, use of effective computer science tools and data structures, and testing and validation.","title":"Parallel Algebraic Recursive Multilevel Solvers: Advances in Scalable and Robust High Performance Linear System Solution Methods","awardID":"0000443","effectiveDate":"2000-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["466669","550000"],"PO":["551992"]},"52742":{"abstract":"ICME is a new multimedia conference slated to be the major Institute<br\/>of Electrical & Electronic Engineer's (IEEE) conference on the subject<br\/>of Multimedia technologies and is to take place in New York City in<br\/>July-August 2000. The conference is meant to deal with the emerging<br\/>discipline of multimedia processing under the sponsorship of several<br\/>IEEE technical societies. This multidisciplinary conference is<br\/>expected to deal with confluence of several areas ranging from<br\/>wireless video, internet, universal access of computing devices, joint<br\/>audio-video and multimodal processing, computer animation, perceptual<br\/>human computer interfaces including newly emerging standards<br\/>technologies.<br\/><br\/>The funding involves student support by providing opportunity for<br\/>disssemination of technical information in this evolving field for<br\/>training and education of graduate students, who are the potential<br\/>leaders of technlogy workforce of the nearterm as well as longterm future.<br\/>Specific engineering disciplines addreesed are signal processing,<br\/>communications and networking, database systems, hardware and system<br\/>integration for multimedia procesing etc.","title":"International Conference on Multimedia & Expo 2000 (ICME2000) Student Registration\/Travel & Publication Cost Support","awardID":"0073641","effectiveDate":"2000-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["562984"],"PO":["564898"]},"51345":{"abstract":"","title":"CAREER: Computation Methods","awardID":"0049092","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550549"],"PO":["543507"]},"50179":{"abstract":"0001995<br\/>Aiken, Robert M<br\/>Shriver, Bruce D<br\/>Association for Computing Machinery<br\/><br\/>Special Project: U.S. Attendance at the 16th IFIP World Computer Congress (IFIP Congress 2000)<br\/><br\/>This award provides partial support for 20 representatives from the U.S. to attend the 16th IFIP World Computer Congress, in Beijing, China, August 21 - 25, 2000. The International Federation for Information Processing (IFIP) is a multinational federation of technical organizations concerned with information processing. The ACM and the IEEE Computer Society are full members of IFIP and the ACM is administering this project. The participants in the project are selected on a competitive basis by a committee of reviewers, with emphasis given to young researchers doing outstanding work and to applicants who have been accepted to present papers or are otherwise significantly involved in the conference.","title":"Special Project: U.S. Attendance at the 16th World Computer Congress (IFIP Congress 2000)","awardID":"0001995","effectiveDate":"2000-06-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[128206,128207],"PO":["329035"]},"48804":{"abstract":"A centroidal Voronoi tessellation (CVT) is a Voronoi tessellation of a<br\/>given set such that the associated generating points are centers of <br\/>mass of the corresponding Voronoi regions. Applications of CVT's <br\/>range from problems in image compression, vector quantization, <br\/>quadrature rules, grid generation and optimization, finite difference <br\/>schemes, distribution of resources, cellular biology, cluster analysis, <br\/>and the territorial behavior of animals. The goals are to develop highly<br\/>efficient parallel algorithms for the computation of CVT's, to gain <br\/>further understanding of interesting features related to the these <br\/>tessellations, to implement and test these algorithms, and to produce <br\/>a useful software suite that can serve as a design tool for many<br\/>problems in applications.<br\/><br\/>Among the theoretical questions to be studied are the complexity of <br\/>algorithms for the construction of CVT's, the effects of nonuniform <br\/>densities, CVT's in general metrics, constrained CVT's, and generalized<br\/>CVT's based on lines, curves and surfaces.<br\/><br\/>Parallel deterministic and probabilistic algorithms will be developed <br\/>and tested. In the former case, different averaging and communication<br\/>strategies will be examined; for the latter,domain decomposition <br\/>ideas will be exploited. This effort can lead to parallel grid generation<br\/> algorithms and other software useful in applications such as<br\/>clustering analysis.<br\/><br\/>Applications of CVT's will also be studied, with particular emphasis <br\/>on grid generation and optimization. The questions addressed in this<br\/>connection include the role of the density functions used to generate <br\/>the CVT's on the optimal placement of grid points, the construction of <br\/>grids with special properties and the the use of various generalized <br\/>CVT's. Another application that will be examined are the use of CVT's <br\/>in the clustering analysis of large data sets.","title":"Centroidal Voronoi Tessellations: Algorithms, Applications, and Theory","awardID":"9988303","effectiveDate":"2000-06-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["548532","549989"],"PO":["321058"]},"47715":{"abstract":"The proposed research focuses on the application of a global time base toward development and control of widely geographically dispersed applications. Recently available hardware, base on the Global Positioning System, is able to track the Coordinated Universal Time (UTC) scale within a few microseconds. The clocks of processors worldwide can then be kept within tens of microseconds of each other via their mutual synchronization to UTC. Time-based protocols for the monitoring and control of distributed computations will be developed, including protocols for the detection and resolution of distributed deadlock, detection of the occurrence of certain unstable predicates at a point in time during a computation, and techniques for the monitoring and control of dynamic systems. Additionally, the project will seek out new applications facilitated by this technology, as tight synchronization of widely dispersed processor clocks was not feasible prior to the appearance of this hardware. Development protocols will be experimentally evaluated within a GPS-synchronized wide area network. The project will result in techniques that enhance the development and control of widely dispersed computations, including distributed databases and multimedia applications. These time-based techniques will be incorporated as part of an undergraduate course in the design of secure and reliable networked applications.","title":"CAREER: Development and Control of Distributed Computations in a Global Time Frame","awardID":"9984682","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["530277"],"PO":["309350"]},"47737":{"abstract":"This research will advance the theoretical foundations and <br\/>explore practical implementations of dependable distributed <br\/>system technology. A distributed system is dependable, when <br\/>it provides guarantees regarding its performance, fault-<br\/>tolerance, correctness and compositionality.<br\/>The research objectives will be achieved through synergy <br\/>between the research in distributed systems with its focus <br\/>on fault-tolerance and correctness, the research in <br\/>parallel computing with its focus on speed-up and <br\/>efficiency, and the practical engineering considerations of <br\/>specification, development, deployment and performance of <br\/>systems. This proposal envelops three investigation areas:<br\/>(1) Robust Algorithmics: Development of fault-tolerant and <br\/>efficient distributed algorithms and exploration of <br\/>limitations on achieving robustness in distributed <br\/>computing.<br\/>(2) Building Blocks: Definition and analysis of dependable <br\/>distributed building blocks needed by applications <br\/>requiring precise guarantees; and design of specification <br\/>frameworks for capturing designs and optimizing distributed <br\/>system deployment.<br\/>(3) Distributed Implementation: Development of exploratory <br\/>implementations of compositional building blocks and robust <br\/>algorithms, and evaluation of their performance in <br\/>realistic and simulated settings; empirical evaluations <br\/>will complement the analytically established efficiency <br\/>characterizations.<br\/>The educational component includes: developing and <br\/>delivering new courses in distributed computing in support <br\/>of undergraduate and graduate programs in computer science; <br\/>and, building a research group that attracts graduate <br\/>students and postdoctoral researchers.","title":"Career: Principles and Practices of Dependable Distributed Computing","awardID":"9984778","effectiveDate":"2000-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["451177"],"PO":["309350"]},"48606":{"abstract":"Internet applications are being rapidly developed and adopted for use in the US agricultural system. Yet, to date, there has been little research or theoretical development concerning the impacts of Internet technology on the structure of value chains in agriculture. The primary goal of this SGER project is to inductively construct theoretical models of agricultural value chains and to show the impacts of Internet development on them. This goal will be accomplished through two complementary activities. First, a literature review will be done to understand the adoption and subsequent impacts of two other major network technologies - electrification and telephony -- in rural areas. This review will provide insight into agricultural value chains, how previous technologies have impacted them and the types of impacts that could be expected from the adoption of the Internet. The second activity will be to: 1) understand how firms producing agricultural inputs, marketing agricultural commodities, or processing food products use the Internet to provide information, goods, and services to farmers and ranchers; and 2) analyze the impacts of the Internet on value chains within the US agricultural system.","title":"SGER: COLLABORATIVE RESEARCH: The Internet and the U.S. Agricultural System","awardID":"9987810","effectiveDate":"2000-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["408793"],"PO":["565227"]},"47727":{"abstract":"The rapidly expanding size and complexity of digital library collections necessitates new interfaces for exploring, searching, and understanding their contents. This project will investigate how to effectively incorporate large category hierarchies into information access user interfaces and will address the following research questions: Can dynamically suggested query previews improve comprehension and findability within digital libraries and domain-specific text collections? Can categorical metadata be used effectively within such query previews? Does visualization of category metadata improve comprehension of the relationships among articles for some users? A series of designs will be prototyped and evaluated, starting with text-based displays and progressing to sophisticated visualizations. The evaluation will be of a ``regression test'' form, in which the same set of evaluation criteria are applied at each stage of the design. The educational component of this proposal will integrate the results of this and related research into a graduate curriculum on information organization, retrieval, and use. Specifically, it will answer open questions about the relationship between information organization techniques and information retrieval interfaces that can make use of such organizations.","title":"CAREER: Incorporation of Categorical Metadata into Information Access User Interfaces","awardID":"9984741","effectiveDate":"2000-06-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["315298"],"PO":["495796"]},"40578":{"abstract":"PROJECT ABSTRACT (IBN-9904633)<br\/><br\/> This study will make a direct comparison of the information processing capabilities of nonspiking and spiking neurons in a sensorimotor system. Nonspiking neurons play an important role in neuronal integration and provide a distinct mechanism for information processing in the central nervous system. These neurons transmit information using graded (or analog) changes in their membrane potential in contrast with the discrete action potentials that encode information in a digital manner in spiking neurons. Although nonspiking transmission has been investigated in various systems, the assessment of the functional advantages of nonspiking transmission has been hampered by the absence of an appropriate context for the evaluation of these systems. This project will determine the transfer functions of nonspiking and spiking proprioceptors in the first two joints of the crab leg and for the synapses and motor reflexes associated with these receptors. The basal leg joint in the crab is monitored by a single proprioceptor, the TCMRO, that contains two nonspiking and one spiking neuron. The position, velocity and acceleration of the next most distal joint is monitored by a single spiking receptor, the CB chordotonal organ, and two nonspiking elastic strand receptors. One therefore has a system that permits a direct comparison of these two distinct modes of information transmission, although the physiological functions of the receptors are very similar as are the motor behaviors that they mediate. The experimental approach will employ standard electrophysiological techniques and linear and nonlinear (Wiener kernel) systems analysis methods in order to characterize the transfer function of these proprioceptors. The Wiener approach utilizes Gaussian white noise as a test stimulus to the system under study and determines a series of filters or kernels that describe both the linear and nonlinear characteristics of the system. As the experimental preparation permits access to the reflex pathways mediated by these receptors, the systems analysis approach will be extended to investigate overall transfer properties of the synapses and motor reflexes in response to sensory input from nonspiking and spiking receptors. An additional goal will be to determine the extent and fidelity of the information transmission in nonspiking and spiking afferents using information theoretic methods that have recently been applied to neuronal systems. We will thus be able to make a direct comparison between, and contrast the functions of, nonspiking and spiking neurons and the motor reflexes mediated by these cells.","title":"Nonspiking and Spiking Information in a Sensorimotor System","awardID":"9904633","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1162","name":"COMPUTATIONAL NEUROSCIENCE"}}],"PIcoPI":[102770],"PO":["527454"]},"52559":{"abstract":"0073058<br\/>McCoy<br\/>This grant is supported by the Divisions of Materials Research, Physics and Mathematical Sciences. The focus of the grant is the exact study of statistical mechanics of strongly interacting many-body systems and their connection with pure mathematics and condensed matter physics. The strongly interacting systems of greatest interest are the XXZ spin-1\/2 chain, lattice models for generalized exclusion statistics and integrable perturbations, and Ising and dimer models particularly on higher genus lattices.<br\/>%%%<br\/>This grant is supported by the Divisions of Materials Research, Physics and Mathematical Sciences. The focus of the grant is the exact study of statistical mechanics of strongly interacting many-body systems and their connection with pure mathematics and condensed matter physics. <br\/>***","title":"Model Systems in Statistical Mechanics and Quantum Field Theory","awardID":"0073058","effectiveDate":"2000-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1287","name":"MATHEMATICAL PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["211384"],"PO":["145396"]},"50615":{"abstract":"Symposium 2000 on Adaptive Systems for Signal Processing, Communications and Control (AS-SPCC) sponsored by the Institute of Electrical and Electronics Engineers Canada (Region 7) is seeking a grant toward the cost of conference publications and to partially support graduate student participation. The symposium is the first International Symposium presenting work in Fundamentals of Adaptive and Learning Systems, Pattern Recognition, Adaptive Signal Processing, Radar Signal Processing, Wireless Communications, Adaptive Control, Nonlinear Dynamical Systems and Computational Intelligence in Finance. The Symposium is being held in Lake Louise, Alberta, Canada, October 1-4, 2000. The Symposium site is the Chateau Lake Louise.","title":"Symposium 2000 on Adaptive Systems for Signal Processing, Communications and Control","awardID":"0003138","effectiveDate":"2000-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["211323"],"PO":["564898"]}}