{"60938":{"abstract":"This award supports the travel, housing and registration costs of 18 students who would not otherwise be able to attend the 5th International Conference on Autonomous Agents (Agents 2001) to be held in Montreal, Canada, May 28- June 1, 2001. This conference is the premier conference on agent technology and will have associated with it many tutorials, workshops and other events given by leading researchers in this field. One valuable part of student training is participation in the excitement of an international conference where major researchers present their work and engage one another in dialogue. The goal of this proposal is to enable students who are deserving but may not have the financial resources available to attend. A committee of senior agents researchers and conference organizers has been formed to select students based on the following criteria: 1) those presenting papers or software systems; 2) those presenting in workshops or other associated conference forums; 3) those demonstrating financial need; and 4) new students to the area demonstrating benefit from attendance.","title":"WKS: Support for Student Attendance to Autonomous Agents Conference held in Montrea, Canada from May 28, 2001 - June 1, 2001.","awardID":"0104172","effectiveDate":"2001-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["525589"],"PO":["495796"]},"69382":{"abstract":"","title":"CAREER: Applied Algorithms for Computational Molecular Biology","awardID":"0196202","effectiveDate":"2001-03-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["560602"],"PO":["565136"]},"57680":{"abstract":"As we enter the so-called \"information age\" of global networks, ubiquitous computing devices, and electronic commerce, computer security is of increasing importance. One of the greatest challenges in computer security today is the software assurance problem: How do we deal with the fact that our most trusted software, even our security software itself, is often buggy?<br\/><br\/>This research will study two aspects of the software assurance problem: ensuring first that bad things do not happen, and second that good things do happen. The project will explore vulnerability detection of legacy software, focusing on detecting the types of security bugs that pervade systems built before security became as serious a concern as it is today. Also this work will study infrastructural support for building new systems that need to be secure. The enabling technology is a mix of lightweight formal methods (such as static program analysis) coupled with domain-specific heuristics, and a main goal will be to build tools that can be used in practice. In each case, a key selling point of the approach is that it allows us to proactively eliminate or neutralize security bugs before they are exploited.","title":"CAREER: Security in the Large: Gaining Assurance in Real-World Systems","awardID":"0093337","effectiveDate":"2001-03-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["550026"],"PO":["309350"]},"57681":{"abstract":"The long-term goal of my integrated research and educational<br\/>plan is to develop interactive virtual environment sys-tems<br\/>supporting realistic aural\/visual simulation of large 3D<br\/>models containing multiple interacting users.<br\/><br\/>Research Plan<br\/><br\/>The main objective of the proposed research project is to<br\/>develop efficient algorithms for simulating the propagation<br\/>of light and sound waves through a virtual environment by<br\/>scattering at surfaces of a 3D model. This research problem<br\/>is central to providing a realistic experience in an<br\/>immersive virtual environment, as its solution enables<br\/>global illumination and sound spatialization. It is also<br\/>significant for several other applications, including motion<br\/>planning, inverse modeling, scene capture, heat transfer,<br\/>radio power prediction, fire propagation, and traffic<br\/>analysis, which are all important in fields beyond immersive<br\/>virtual environments.<br\/><br\/>For simulations of both lighting and acoustics, the<br\/>fundamental problem is to compute a solution to an integral<br\/>equation expressing the wave field at every point in terms<br\/>of the wave field on surrounding surfaces. The main<br\/>difficulty is that the wave field has discontinuities due to<br\/>occlusions, caustics, and specular highlights, which induce<br\/>large variations over small portions of the integration<br\/>domain (i.e. surfaces or directions). Previous integration<br\/>methods based on radiosity and Monte Carlo path tracing are<br\/>generally not practical for typical virtual environments.<br\/><br\/>I plan to investigate a hybrid beam tracing and path tracing<br\/>approach. The general strategy is to trace beams that<br\/>partition the space of rays into topologically distinct<br\/>bundles corresponding to different sequences of scattering<br\/>events at surfaces of the 3D scene (reverberation<br\/>sequences), and then use them to guide sampling in an<br\/>interactive path tracing algorithm. The motivation for this<br\/>approach is that attributes of a relatively small number of<br\/>beams traced during the first phase can provide useful<br\/>information about the wave field that can be used to guide<br\/>and accelerate evaluation of samples during the second<br\/>phase. This approach enables efficient methods for: 1)<br\/>enumeration of reverberation sequences, 2) decomposition of<br\/>integration domain, 3) conservative approximation, 4)<br\/>spatial coherence in ray intersections, 5) sampling of<br\/>reverberation sequences, 6) progressive refinement, and 7)<br\/>off-line precomputation. The challenge is to develop methods<br\/>that trace beams through 3D models quickly and reap the<br\/>benefits of the traced beams in useful applications.<br\/><br\/>My research plan is to investigate hybrid beam tracing and<br\/>path tracing approaches to solve classical problems for<br\/>virtual environments. The new research contributions will be<br\/>made at four levels: theory, algorithms, applications, and<br\/>experiments. First, I plan to investigate new theory for<br\/>modeling wave propagation as a discrete set of reverber-<br\/>ation paths incorporating multiple scattering effects<br\/>including diffractions. Second, I plan to develop new<br\/>algorithms that efficiently find significant reverberation<br\/>paths with general types of scattering in general 3D models.<br\/>Third, I plan to investigate new applications where the<br\/>proposed approach for computing reverberation paths can be<br\/>used to solve classical problems. Finally, I plan to perform<br\/>experiments to evaluate the results of computed simulations<br\/>both quantitatively and qualitatively in comparison to<br\/>measured wave fields. The overall outcome of this research<br\/>will be a computational framework and a suite of methods for<br\/>computing general reverberation paths in general 3D models<br\/>and evaluating them in interactive applications.<br\/><br\/>Throughout this project, I plan to investigate the synergies<br\/>between sound and light and to apply the lessons learned<br\/>from one wave phenomenon to the other. Based on historical<br\/>precedent, I believe that it will be possible to develop<br\/>better simulations of virtual environments by studying both<br\/>sound and light together.<br\/><br\/>Educational Plan<br\/><br\/>The objectives of my educational plan are to teach students<br\/>and to develop new methods for education. In particular, one<br\/>special goal of mine is to enable the use of interactive<br\/>virtual environment systems in the educational process. I<br\/>plan to investigate this novel media for education by<br\/>designing new interdisciplinary courses that will allow<br\/>students and teachers from widely varying backgrounds to<br\/>learn about and experiment with virtual environment systems.<br\/>I also plan to develop new educational materials (textbook,<br\/>course notes, software tools, and 3D models), to mentor<br\/>students (graduate, undergraduate, and K-12), and to develop<br\/>outrea","title":"CAREER: Simulation of Lighting and Acoustics in Interactive Virtual Environments","awardID":"0093343","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["533355"],"PO":["532791"]},"57660":{"abstract":"CAREER: Fast Efficient Adaptive Filter Banks and Applications in Digital Multimedia Coding\/Processing<br\/><br\/>Tran Project Summary<br\/><br\/>With the recent emergence in popularity of the Internet, the demands for and the interests in digital multimedia are growing exponentially. A high-performance filter bank is typically at the heart of every state-of-the-art digital multimedia system. For example, current international image\/video compression standards JPEG, MPEG, H.261 and H.263 are all based on the 8x8 Discrete Cosine Transform (DCT), an 8-channel 8-tap orthogonal filter bank. Of great importance is the ability to design a filter bank that can fully exploit (i) the statistical properties of a particular signal or class of signals; (ii) the goals of the applications; (iii) the computational resources available at the processing systems. Particularly, fast, efficient, and low-cost transforms have played a crucial role in revolutionary advances throughout the history of digital signal processing. <br\/><br\/>This research involves the development of next-generation fast efficient adaptive filter banks for applications in digital multimedia coding\/processing. The implementations are VLSI-friendly, entirely integer-based, possibly even multiplier-free, while still maintaining a high level of coding performance. Moreover, all of the filter banks are constructed from modular cascades of similar building blocks where the same basic components are employed repeatedly in a highly regular fashion, resulting in smaller chip area and lower power consumption. The investigator incorporates as many desirable transform properties onto the structure as possible, leading to a much smaller space of free parameters and hence improving the effectiveness of optimization algorithms, especially in real-time adaptive systems. Well-proven techniques in optimization, linear prediction, and adaptive filtering theory are being applied toward the lattice structure optimization. The new family of filter banks is expected to provide versatility, flexibility, and adaptivity in time-frequency mapping, coding performance, cost of implementation as well as integration into modern digital multimedia processing\/communication systems. <br\/>-------------------------------------------------------------------<br\/>Level of Effort Statement.<br\/><br\/>At the recommended level of support, the PI will make every attempt to meet the original scope and level of effort of the project.<br\/><br\/>Trac D. Tran","title":"CAREER: Fast Efficient Adaptive Filter Banks and Applications in Digital Multimedia Coding\/Processing","awardID":"0093262","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["486320"],"PO":["564898"]},"57451":{"abstract":"The project addresses research issues of handling complex texture patterns in the context of computer vision. The tasks planned include surface modeling and surface measurement, integration of surface models into synthesis and recognition algorithms, and object and scene modeling with a large range of cues such as depth and motion. The final stage of the project will be integration of visual cues in order to use surface models as the building blocks of higher level object and scene models.","title":"CAREER: Surface Science for Vision and Graphics","awardID":"0092491","effectiveDate":"2001-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["475435"],"PO":["564318"]},"59377":{"abstract":"Real-time computing is an enabling technology for many current and future application areas. Many future generations real-time systems are expected to be highly dynamic and operate in fault-prone on-deterministic environments under strict timing constraints. Therefore, these systems need to be robust while delivering high performance. This motivates the need for robust resource management techniques that dynamically address real-time requirements and provide graceful degradation in the presence of uncertainty. Despite the significant body of results in resource management in real-time systems, most of them are based on<br\/>``open-loop'' strategies which are effective when the workload can be accurately modeled. These schemes are inadequate for many real world problems wherein the workload cannot be accurately modeled. Thus, there is a need for efficient architectures for resource management where predictable performance guarantees<br\/>can be obtained in the presence of uncertainty.<br\/><br\/>Feedback control theory has been central to modeling systems operating in uncertain environments. In the past few decades, this theory has made impressive strides in this direction. Correct adaptation as illustrated by feedback control theory will yield significant dividends with respect to robustness. This research focuses on developing a robust resource management framework for real-time systems employing feedback control<br\/>strategies.","title":"Robust Real-Time System Resource Management Using Feedback","awardID":"0098354","effectiveDate":"2001-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["521840","509594","553643"],"PO":["241298"]},"57475":{"abstract":"Exploratory environments - virtual worlds in which users interact with a simulation of a physical or abstract space to form, pursue and achieve their goals - have shown great success in applications ranging from education and training to entertainment to social interaction. A principal limitation of these systems, however, is that users' activities within them are typically greatly over- or under-constrained. To address this problem, the PI will develop new plan-based models for the structure of user interactions within exploratory environments. Planning techniques will be used to create novel activity within the environment that encompasses both the system-controlled characters, the environment and the actions of the user. The PI will build on his prior work in plan generation and plan-related communication to develop an architecture for creating, monitoring and controlling interaction in intelligent exploratory environments. This architecture will integrate: planning algorithms that create plans for interaction in virtual worlds whose structure is readily understandable by users; discourse generation algorithms that effectively communicate the currently unfolding plan-based activity; and execution monitoring algorithms that mediate the execution of actions between the user interface and the virtual world, intervening in appropriate ways when actions that the user intends to perform deviate from the system's current plan structure. If successful, the work will greatly increase our ability to produce engaging, novel and effective virtual environments in which users' domain- and task-oriented learning are enhanced across a range of applications and contexts.","title":"CAREER: Plan-Based Integration of Control and Coherence in Intelligent Exploratory Environments","awardID":"0092586","effectiveDate":"2001-03-15","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["550629"],"PO":["387198"]},"57497":{"abstract":"The central theme of this research plan is to formally study<br\/>numerical issues concerning algorithms for continuous<br\/>optimization. A primary goal is to address central topics in<br\/>numerical analysis - such as perturbation theory,<br\/>conditioning, and sparsity - in the continuous optimization<br\/>context. A second objective is to gain further insight into<br\/>interior point methods for convex programming. Special<br\/>attention will be paid to numerical aspects such as the<br\/>solution of the linear equations arising at each main<br\/>iteration and the effects of limited precision in arithmetic<br\/>computations. Properties of the central path and local<br\/>convergence results will be studied. Applications of the<br\/>analytical perspective for convex optimization in<br\/>probability and discrete optimization will be explored. The<br\/>educational plan involves activities both at the master and<br\/>doctoral levels. At the master level, further development of<br\/>courses in quantitative methods and applications of<br\/>operations research will be pursued. Special emphasis will<br\/>be placed on the role of mathematical models in a variety of<br\/>industrial applications. At the doctoral level, exposure to<br\/>interior point methods, semidefinite programming, and real<br\/>model computation will be provided through the graduate<br\/>nonlinear programming course, seminars, and reading courses.","title":"CAREER: Towards an Analytical Perspective for Continuous Optimization Methods","awardID":"0092655","effectiveDate":"2001-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["397660"],"PO":["532791"]},"47147":{"abstract":"The goal of this project is to enable information retrieval systems to handle speech-based information by considerably enhancing speech recognition technology. The PI's approach is to align collections of stories from text and speech sources in multiple languages, and to develop methods which exploit the resulting parallelism. The PI will improve acoustic and language models, and will develop iterative recognition methods to facilitate capture of cross-lingual information resident in text and speech. Voice-of-America broadcasts in English, Greek, and a third language to be determined, will provide the data source for this research.","title":"Robust Knowledge Discovery from Parallel Speech and Text Sources","awardID":"9982329","effectiveDate":"2001-03-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V124","name":"DARPA-TIDES PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"W282","name":"DARPA-JHU MLIAM RODIPAS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X802","name":"DARPA-JHU MLIAM RODIPAS PROJ"}}],"PIcoPI":["445172","445173","168075"],"PO":["565227"]},"56860":{"abstract":"EIA-0090000<br\/>Andrea L. Houston<br\/>Louisiana State University <br\/><br\/>Attracting Women into the Information Technology Workforce through Technology Immersion<br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds to investigate IT immersion on the college major and career choices of young women. The IT immersion program is modeled on the total immersion method of learning a foreign language. In the IT immersion program at Saint Joseph's Academy, an all-girls Catholic high school, entering freshmen receive a laptop computer the summer before they enter the Academy. They are required to take two weeks of summer school to learn to use their laptop and software that will be used in the classroom. Information technology has been totally integrated into the curriculum, and teachers are evaluated on the degree of information technology integration in their classes. This research project will use a longitudinal case study approach including observation, interviews, and biannual surveys focussing on the current 9-11th grade young women at the Academy (using the IT immersion curriculum) and comparing them to the current 12th grade and alumni from the Academy (using a similar curriculum without IT immersion). The student using the IT immersion curriculum will also be compared to another private high school which does not use the IT immersion curriculum. This project has the potential to provide valuable insights about factors that both motivate and discourage young women from choosing IT majors and careers.","title":"ITW: Attracting Women into the Information Technology Workforce through Technology Immersion","awardID":"0090000","effectiveDate":"2001-03-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["257046",146313,146314],"PO":["289456"]},"57553":{"abstract":"Proposal: An Integrated Cyclostationary Signal Processing Framework for Optimized and Robust Wireless Communications<br\/><br\/>PI: Dr. Erchin Serpedin<br\/><br\/>ABSTRACT: <br\/><br\/>The successful evolution of the future high-speed wireless communication networks requires significant advances in adaptive signal processing algorithms that are currently employed for synchronization, estimation and equalization of time-varying channels. This research involves the development of a general and novel framework for designing robust and optimal spectrally efficient channel estimation, synchronization, and equalization algorithms. Key elements of the work include development of a unified framework for designing and analyzing non-data aided joint carrier frequency-offset\/Doppler shift and symbol timing estimators in time-selective and flat-fading channels, development of a robust non-data aided framework for estimation and equalization of time- and frequency-selective fading channels, and development of a robust non-data aided space-time signal processing framework for synchronization and estimation of multipath signals arriving at an antenna array. The proposed research offers a wealth of innovative educational projects for course and laboratory instruction.<br\/><br\/>Level of Effort Statement:<br\/><br\/>At the recommended level of support, the investigator will make every attempt to meet the original scope and level of effort of the project.","title":"CAREER: An Integrated Cyclostationary Signal Processing Framework for Optimized and Robust Wireless Communications","awardID":"0092901","effectiveDate":"2001-03-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["549853"],"PO":["564898"]},"57674":{"abstract":"The project focuses on deepening of our understanding of the process of distributed manipulation. A representative set of three types of distributed manipulation systems will be considered: 1) an actuator array (a fixed planar array of many small stationary elements which cooperate to manipulate a large object); 2) a superposition of planar potential fields to manipulate objects (here air flow, using potential field theory); 3) snake-like or tentacle-like robots to wrap, fully or partially, around the manipulated object. On the education front, a wide effort on bringing mechatronics into the mechanical engineering curriculum will be made.","title":"CAREER: Multi-task-domain Distributed Manipulation and Mechatronics Education","awardID":"0093312","effectiveDate":"2001-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[148284],"PO":["564316"]},"57564":{"abstract":"Computing is rapidly moving away from traditional computers. Programs<br\/>in the future will run on collections of mobile processors that interact<br\/>with the physical world and communicate over ad hoc networks. We can<br\/>view such collections as swarms. As with natural swarms, such as a<br\/>beehive or ant colony, the behavior of a computational swarm emerges<br\/>from the behaviors of its individual members.<br\/><br\/>This project focuses on developing methods for creating,<br\/>understanding and validating properties of programs that execute on<br\/>swarms of computing devices. The work builds foundations to create and reason<br\/>about swarm programs in principled ways. A promising approach is to<br\/>construct swarm programs by combining primitives. The functional and<br\/>non-functional behavior of a primitive is described using formal<br\/>notations. The project investigates techniques based on both experimental<br\/>and analytical approaches for predicting the functional and<br\/>non-functional properties of compositions of swarm primitives.<br\/><br\/>Although the practical applications of swarm computing are in their<br\/>infancy, there is great potential for useful applications. Successful<br\/>swarm programming will depend on our ability to reason about swarm<br\/>programs and construct device programs based on high-level goals. This<br\/>Project establishes the first steps towards that target.","title":"CAREER: Programming the Swarm","awardID":"0092945","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["483825"],"PO":["564388"]},"57685":{"abstract":"High-performance network server software is already central to many users' day-to-day interaction with computers, and its importance will increase as more services become networkcentric. Despite widespread commercial and academic interest in network servers, the process of developing and maintaining this software remains in its infancy. The underlying difficulty is the blurring of the service (what gets done) with particular implementations (how it gets done).<br\/><br\/>This research focuses on automating the development and maintenance of the software's infrastructure, allowing programmers to focus their attention on the server's core functions. The approach uses semi-automatic parallelization of network applications via source-to-source transformation. This approach is well suited to the network server software domain, since common design patterns and behavior exploitable in a domain-specific manner are often used.<br\/><br\/>Fundamentally, this research advocates completely separating the server's behavioral model from its underlying software architecture. Allowing programmers to specify the behavioral description of the software in a high-level manner frees developers from worrying about hardware details and operating system interfaces. This decoupling provides benefits for server developers, and will spur new research in parallelization techniques, operating system interfaces, and software architectures.","title":"CAREER: Automatic Retargeting of Network Server Applications","awardID":"0093351","effectiveDate":"2001-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["533299"],"PO":["309350"]},"55057":{"abstract":"The PI and his team will explore solutions to the problem of access to computer graphics for blind users by combining a limited number of sensors and stimulators with the very high human capacity for fine movement control and spatial localization. He will conduct experiments to determine performance with a large number of skin stimulation points (by means of linked photosensor-to-vibratory stimulator units) on the hand, thus permitting individual finger motion (e.g., finger spreading) as well as total hand motion. Both the PI's own prior work and sensorimotor studies by others, along with concepts of the role of motor outflow brain signals in determining precise spatial localization, have led him to the hypothesis that a haptic system - as opposed to one which is strictly tactile, because the fingertips actively scan the display - can convey important spatial concepts from 2D and 3D images on a computer monitor. The PI's approach is based on concepts of brain plasticity underlying his prior sensory substitution studies, which have demonstrated that blind persons can obtain complex visual information in real-time through TV cameras leading to tactile interfaces. The current project will result in a tool for perceptual, electrophysiological and brain imaging (e.g., transcranial electromagnetic stimulation) studies on sensory substitution and late brain plasticity, and to practical applications for science education of blind students as well as for increasing their vocational opportunities in information technology.","title":"Tactile Glove for Computer Graphics for Blind","awardID":"0083347","effectiveDate":"2001-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":[140761],"PO":["565227"]},"57675":{"abstract":"Ensuring that high assurance systems meet their reliability requirements <br\/>prior to deployment is essential. The research focuses on combining the <br\/>strengths of formal verification methods and program testing. The cornerstone <br\/>of this unified, quantitative software reliability assessment framework is <br\/>the use of Bayesian inference. Subjective probabilities of software failures <br\/>are obtained through formal or informal verification. Statistical testing <br\/>can either corroborate that the required reliability level is met, or it <br\/>indicates that the subjectively established failure probabilities are not <br\/>realistic, prompting the need for rework and improvement. Several <br\/>combinations of verification techniques and statistical testing are <br\/>based on program structure. Research objectives include the identification <br\/>of program designs, which make software reliability assessment feasible, <br\/>and demonstration of their suitability for high assurance applications. <br\/><br\/>Educational activities accompanying the research theme include research <br\/>experience for undergraduate and graduate students, and curriculum <br\/>development. The goal of educational activities is to expose students <br\/>to the development and assurance of complex systems through their <br\/>participation in experiments and case studies. Participating students <br\/>form multidisciplinary teams including computer science, computer <br\/>engineering and electrical engineering majors.","title":"CAREER: Software Reliability Assessment for High Assurance Systems","awardID":"0093315","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["560285"],"PO":["564388"]},"55762":{"abstract":"The project will build on established activities exploring new modes and mechanism for scholarly communication. In particular, the project will draw on existing efforts of the Networked Digital <br\/>Library of Theses and Dissertations (NDLTD) and the Open Archives Initiative (OAI). The NDLTD promotes student production and submission of their own electronic theses and dissertations - in many <br\/>different natural languages. This project will pursue metadata standards and tool building for searching the distributed, multilingual, large-scale collection. The collaboration with the University of Oldenburg will focus on PhysNet, an existing service which collects physics papers and scholarly materials from the Web","title":"Open Archives: Distributed Services for Physicists and Graduate Students (OAD)","awardID":"0086227","effectiveDate":"2001-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["530762","550462"],"PO":["564456"]},"55894":{"abstract":"The goal of this project is to develop improved optimization techniques for use in three- and four-dimensional data assimilation in meteorology that will both reduce the computer time required in the assimilation process and increase the reliability of the results. The research will consist of experimental work with existing assimilation codes, in conjunction with a theoretical study of both the optimization algorithms and the physical models. The project represents a collaborative effort among Dr. Jorge Nocedal (Northwestern University), Dr. Stephen Wright (University of Chicago), and researchers at the National Centers for Environmental Prediction (NCEP).<br\/><br\/>The new optimization techniques include enriched limited memory quasi-Newton methods for minimizing the nonlinear cost functions, automatic preconditioners to accelerate the conjugate gradient method, and structured quasi-Newton methods of nonlinear least squares problems. The new techniques will be designed for the case in which the background covariance matrix does not have a simple sparsity structure. The techniques must also be robust when varying levels of resolution are used in the model during computation, a common situation with meteorological models. Thus, a theoretical framework that quantifies the effects of these inaccuracies on the performance of the algorithms will have to be developed.<br\/><br\/>The Divisions of Atmospheric Sciences and Mathematical Sciences jointly support this project.","title":"Collaborative Research: Improved Minimization Techniques in Meteorological Data Assimilation","awardID":"0086579","effectiveDate":"2001-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1524","name":"ATMOSPHERIC CHEMISTRY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"1527","name":"LARGE-SCALE DYNAMIC METEOROLOG"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}}],"PIcoPI":["517236"],"PO":["434790"]},"57522":{"abstract":"Technology is clearly changing the way children live and learn. What is not clear is how our classrooms will change in the future due to these new technologies. Today there are numerous questions when it comes to infusing technology into the classroom environment, particularly when it involves early childhood education environments. What will our pre-school classrooms look like with new technologies? What, if any, are appropriate new technologies for young children? Will early childhood teachers approach teaching in the same way? Will children learn differently because of these technologies? In this research the PI will explore issues relating to the development, evaluation, and dissemination of new technologies and infusion methods in early childhood education. The goals are: to understand the unique needs of young children (ages 3-6) in learning environments; to develop new technologies in partnership with children and teachers; To develop new strategies for teaching in a technology-infused early childhood education environment; to understand the impact these technologies can have on young children and their early childhood educators; and to understand when technology is an appropriate catalyst for early childhood education. The research will be an important demonstration of new approaches in interfaces, technologies, and design practices for and with children, and will further offer new educational tools that can have a broad impact on how we educate our children in our classrooms of the future.","title":"CAREER: A Classroom of the Future: Developing and Infusing New Technologies in Early Childhood Education","awardID":"0092737","effectiveDate":"2001-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["518152"],"PO":["565227"]},"57544":{"abstract":"The proposed research enables computers to attain higher speeds, at a time when even slight performance gains are increasingly difficult to achieve by conventional means. The first key discovery is that many instructions specified by a computer program are not strictly required for producing the correct answer. That is, a much shorter program can be constructed that produces the same output in a much shorter period of time. A novel method is proposed for creating a shorter program on-the-fly by completely bypassing parts of the program predicted to be unnecessary. By skipping parts of the program, however, the processor cannot verify that it was alright to do so (because the program has been transformed). The second key discovery is that the full program can be run concurrently with the short program, in order to verify the short program is correct, without noticeably slowing down the short program. The proposed method is called the Slipstream Paradigm, after a technique in auto racing where two cars collaborate aerodynamically to speed up both cars (slipstreaming). Similarly, a slipstream processor finishes two redundant copies of the program sooner that a conventional processor finishes a single copy. Redundant execution is also transparently leveraged for fault tolerance with no additional support. Finally, the Slipstream Paradigm is implementable on emerging multithreaded processors without fundamentally reorganizing their architecture.","title":"CAREER: Cooperative Redundant Threads","awardID":"0092832","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["518384"],"PO":["325495"]},"57665":{"abstract":"The project addresses development of systems that interact autonomously with their environment in an intelligent way. Applications range from intelligent home environments to autonomous mobile robots to software agents. Over the recent years, the use of probabilistic methods has led to development of reliable mobile robot systems. However, despite tremendous potential benefits of collaboration between robots, some fundamental issues in the context of probabilistic methods for multi-robot collaboration remain unexplored. The goal of this project is to bridge the scientific gap between probabilistic methods for single-robot systems and those for collaborative multi-robot systems. The research is expected to have a strong impact on the area of collaborating mobile robots. On the education side, in order to teach the skills needed to understand and develop such complex systems, a new undergraduate course on mobile robotics will be designed, which will follow a hands-on approach to teaching, involving students in investigative work with mobile robots.","title":"PECASE: The Haptic Probe: Mechanized Haptic Exploration and Automated Modeling","awardID":"0093290","effectiveDate":"2001-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["550636"],"PO":["403839"]},"57468":{"abstract":"This research applies software understanding and reengineering<br\/>techniques to the problem of retargeting embedded image processing<br\/>software to emerging parallel architectures that are capable of<br\/>efficiently exploiting the inherent data parallelism in these<br\/>applications. Image and video processing software is found in a wide<br\/>range of embedded devices. There is a significant demand for<br\/>low-power, compact imaging devices, e.g., for smart cameras, wearable<br\/>computers, and autonomous vehicle vision systems. Migrating image and<br\/>video processing programs to new or extended hardware platforms that<br\/>support data parallel execution will greatly enhance the image<br\/>processing capabilities and sophistication of embedded devices. This<br\/>research seeks to automatically expose the inherent data parallelism<br\/>in these applications to fuel a new generation of high performance,<br\/>high efficiency embedded processing systems. Software understanding<br\/>techniques are being used to provide a deep model of what computation<br\/>is being performed so that a broader set of parallelization<br\/>transformations can be accomplished and more opportunities for<br\/>parallelization can be identified. This work also integrates<br\/>software reengineering more fully into the education of computer<br\/>engineers and scientists, and help students learn parallel processing<br\/>concepts. It will support interactive application of parallelizing<br\/>transformations and allow students to sharpen their discovery and<br\/>problem solving skills","title":"CAREER: Automated Software Understanding for Retargeting Embedded Image Processing Software for Data Parallel Execution","awardID":"0092552","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["393313"],"PO":["564388"]},"57589":{"abstract":"The design and implementation of a modern microprocessor presents many reliability challenges. Designers must verify the correctness of large complex systems and construct implementations that work reliably in<br\/>varied operating conditions. The research examines the role that speculative execution could play in improving the quality and reliability of future microprocessor designs. A novel processing paradigm, called<br\/>dynamic verification, is proposed that pushes speculation into all aspects of program processing. The approach couples a traditional core processor design with a simple checker processor that verifies its<br\/>computation. The resulting core processor design has significant resistance to permanent and transient errors. The proposed research examines the design of the checker processor, with emphasis on<br\/>minimizing its cost and impact on core processor performance.<br\/><br\/>The educational component of this work seeks to better prepare the student for coming challenges in computer system design. The VeriSimple Processor tool kit will provide students with a unified computer design<br\/>experience, starting with high level design in undergraduate classes, to microarchitectural design in advanced undergraduate classes, and finally research-oriented design in graduate coursework. The tool kit<br\/>will be incorporated into the SimpleScalar tool set (simulator tools developed by the PI) and freely distributed to other institutions.","title":"CAREER: New Directions in Speculative Execution","awardID":"0093044","effectiveDate":"2001-03-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["309179"],"PO":["550859"]},"57655":{"abstract":"This project will conduct research into shape modeling and its applications coupled with the development of a methodology for teaching the skills needed for successful multi-disciplinary research projects. The education plan is integrated with the research effort, which includes development of computational tools for capturing geometry, representing it within the computer, and using those representations for specific applications in archaeology and biological modeling.<br\/><br\/>The education plan consists of a course, Interdisciplinary Scientific Visualization, and a research group. Both welcome undergraduate and graduate students alike. The class mimics the research process, from choosing a project to presenting research results. Projects must include participants from multiple disciplines. During the semester students write a proposal, review proposals by others, work together on a project, write it up as a research abstract, review abstracts by others, and present their results. As the course progresses, lectures, readings, and discussion help to teach the art and craft behind each of those steps. The research group is derived from three research groups the PI participated in during during education: a primarily undergraduate group at Brown, a primarily graduate group at Caltech, and a second Caltech group that is primarily postdocs. The group combines aspects of all three to provide an environment that it is believed will be conducive to learning how to do multi-disciplinary research at many levels.<br\/><br\/>The research is multi-disciplinary and fits well into the research group. Computational tools for capturing geometric shapes, representing them, and calculating with them will be developed and applied to problems from two disciplines: assembly of ancient pottery sherds in archaeology and modeling of wrist motion in orthopaedics and bioengineering. In both cases, shape will be captured from sampled volumetric CT medical imaging data. It will be represented implicitly using sampled signed-distance volumes and explicitly using manifold surfaces. The two representations compliment one another, together offering the strengths of both. For the archaeology application, we will develop a software architecture for decoupling the process of reasoning about artifact shapes from the understanding of their geometry. A probabilistic interface will separate the two parts. For the biological modeling application, we will develop models for bones, ligaments, and cartilage that will predict motion. We will validate the model with motion that we have already acquired and then use it to examine motion in patients with deficits that have thus far eluded an understanding.<br\/><br\/>The impact of this research will be in both application areas and the computational domain. If we are successful, pottery assembly, a process that is estimated to take over 50% of the time an excavation team spends outside of excavating, will be automated. We anticipate that this speedup will enable significant new archaeological results to emerge. A better understanding of the biomechanics of the arm and wrist and the abnormal conditions that can affect them could impact many Americans. This understanding will likely have applications in biology, bioengineering, medical applications, animation, and robotics. The numerical methods we will develop for simulating joints are likely to apply to simulations of other biological systems. Because the algorithms and tools for geometric modeling will be applied to two specific problems, they are likely to be more widely applicable.<br\/><br\/>Perhaps the most significant impact will be not in the scientific results, but in a better understanding of what makes multi-disciplinary research projects succeed or fail and in the new scientists that will emerge from Brown.","title":"CAREER: Shape Capture and Modeling for Wrist Dynamics and Ancient Pottery Analysis using Manifold Surfaces and Signed-Distance Volume Images","awardID":"0093238","effectiveDate":"2001-03-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["550484"],"PO":["532791"]},"57666":{"abstract":"The hypothesis underlying this project is that, with increasing interactivity and personalization of computing systems, just-in-time information retrieval agents (JITIRs) which proactively retrieve and present information based on a person's local context in an accessible yet non-intrusive manner, and which are implemented on wearable computers, will become a feature of the next stage of computing. To recover the user's context, the physical proximity of wearable computers to the user will be leveraged in designing perceptual systems that \"see\" and \"hear\" from the user's perspective. To these ends, the PI will create a Wearable Computer Workshop for rapid prototyping of new wearable sensors and systems. Although the mobile environment is extremely harsh for perceptual systems and algorithms that have been developed in the laboratory, systems that use standard video and audio for input will be preferred because they afford advantages such as automatic creation of new media databases for search, ease of annotation, availability of sensors, and applicability of results to other fields. The PI expects to adapt and exploit promising results from prior research in other domains, including face recognition algorithms, recognition of sign language gestures, hand movements involved in interacting with objects or performing tasks, gestures made in discourse, and user location systems. To support the desired model-based recognition systems, a new form of annotation derived from prior work in analyzing narration will be developed for the data collected during a user's everyday life. Ultimately, the PI will create a community of everyday users of his systems and perform studies to determine how access to JITIRs affects the wearer's use of knowledge. The PI expects this work to have broad impacts, including the development of radically new customizable wearable platforms with the ready ability to interface to new sensor technology, a sensor package directed at capturing a user's everyday life, prototype wearable face recognition and gesture recognition systems, and the expansion of traditional information retrieval algorithms to loosely defined multimedia query searches.","title":"CAREER: Developing Contextual Cues for Just-in-Time Information Retrieval on Wearable Computers","awardID":"0093291","effectiveDate":"2001-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["517810"],"PO":["565227"]},"57699":{"abstract":"The long-term goal of this research is to develop computational methods for predicting protein-protein interactions at a genomic level. Protein-protein interactions play a central role in how an organism functions, and computational methods for predicting these interactions will be key to understanding functional pathways within biological systems. The vast amount of biosequence data in a genome makes sophisticated computational analysis a necessity. While computational methods have already proven to be a useful first step for rapid genome-wide identification of putative protein function and structure, research on the problem of computationally determining biologically relevant partners for given protein sequences is just beginning. <br\/><br\/>This project looks at the problem of predicting protein-protein interactions from two complementary viewpoints. For both approaches, the constraint of genomic-level analysis favors development of fast, informatics-based methods. The first part of this proposal focuses on a specific well-characterized structural motif that mediates protein-protein interactions: the parallel, 2-stranded coiled coil. The goal is to develop novel computational techniques that can predict whether two coiled-coil proteins interact with each other. The second part will extend several existing non-structural whole- and cross-genome methodologies that were initially designed for inferring protein function to the problem of predicting protein-protein interactions mediated by particular protein interaction domains.<br\/><br\/>The educational goals of this project include: (1) bioinformatics curriculum development, including a graduate \"computing certificate\" for molecular biology graduate students; (2) development of interdisciplinary bioinformatics courses at the introductory level and at the graduate research seminar level; and (3) dissemination of instructional material via the internet.","title":"PECASE: Computational Methods for Genome-Wide Prediction of Protein-Protein Interactions","awardID":"0093399","effectiveDate":"2001-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1164","name":"MOLECULAR BIOPHYSICS"}}],"PIcoPI":["553259"],"PO":["564395"]},"51177":{"abstract":"0004438<br\/>Bagherzadeh <br\/><br\/>Description: This award is for support of a cooperative project by Professor Nader Bagherzadeh, Department of Electrical and Computer Engineering, the University of California, Irvine, California and Dr. Hesham Eldeeb, Computer and Systems Department, Electronics Research Institute, Cairo, Egypt. In applications requiring high computing power, one approach is to put together many processors in the same computer. The utilization of all the available computational power involves a tremendous programming effort, which creates a need for compiler and run-time support. Software developers face the challenge of how to exploit application parallelism without rewriting and redesigning current sequential programs and algorithms from scratch. One approach is to isolate programmers from parallelism by adopting optimizing compilers for parallelism detection, named as implicit parallelism. This frees programmers from the details of controlling concurrency, thus concentrate on the application. The work of the two scientists is aimed at fully automating the parallelization process of computer program applications to transform the sequential source code into parallel source code. They will introduce an Automatic Parallel Detection Layer (APDL) which accepts as input a sequential source code C program and produces as output an equivalent source case program in parallel form which is then executed on a distributed memory multicomputer machine.<br\/><br\/>Scope: This collaborative project brings Dr. Eldeeb's experience in high performance computing, parallel virtual machines, parallel logic programming and virtual reality to work in the PI's laboratory at UC, Irvine. Dr. Bagherzadeh's research interest is in the area of high performance computing, superscalar design, multithreading and virtual reality. His expertise also includes star-connected cycles interconnection networks and real-time computer processing. His theoretical and computational background will significantly help in the successful completion of this research. He will be responsible for providing the expertise to formulate the structure of the automatic layer, and will provide the applied cases for the project according to certain required applications in his research laboratory. <br\/>The project meets INT criteria for support of cooperative projects that are mutually beneficial. Funding for this project is provided by the Division of International Programs and the Division of Computer-Communications Research.","title":"US-Egypt Cooperative Research: Design and Implementation of Automatic Parallel Detection Layer","awardID":"0004438","effectiveDate":"2001-03-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["444397"],"PO":["540599"]},"57535":{"abstract":"Most words in natural language have multiple possible meanings. This simple fact causes no end of difficulties for computer systems that seek to understand and generate natural language. The semantic ambiguity of words impacts natural language subtasks such as prepositional phrase attachment and pronoun reference resolution, as well as large-scale applications such as machine translation and information retrieval. Automatic methods that resolve ambiguity in word meaning have the potential to advance the state-of-the-art in natural language processing as a whole, but most approaches to word sense disambiguation have proven difficult to deploy on a wide scale because they are dependent on the availability of specialized sources of knowledge that do not exist across a range of domains. The PI's goal in this project is to develop techniques that will ease and ultimately eliminate knowledge acquisition bottlenecks for word sense disambiguation. He will achieve this by pursuing three specific objectives: 1) develop methods that automatically identify the most relevant contextual features for determining the sense of any ambiguous word; 2) develop disambiguation algorithms that learn from \"just a few\" manually created examples; and 3) develop unsupervised methods that allow any set of word meanings to serve as the target of the disambiguation process. The combined effect of meeting these objectives will be to liberate word sense disambiguation from dependence on particular knowledge sources and thereby simplify their integration into natural language processing systems","title":"Automatic Resolution of Semantic Ambiguity in Natural Language","awardID":"0092784","effectiveDate":"2001-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[147996],"PO":["565215"]},"57689":{"abstract":"All too often, decisions about whom to trust in computer systems are<br\/>driven by the needs of system management rather than data security.<br\/>In particular, data storage is often entrusted to people who have no<br\/>role in creating or using the data--through outsourcing of data<br\/>management, hiring of outside consultants to administer servers, or<br\/>even collocation servers in physically insecure machine rooms to gain<br\/>better network connectivity.<br\/><br\/>SUNDR is a network file system designed to run on untrusted servers.<br\/>SUNDR servers can safely be managed by people who have no permission<br\/>to read or write data stored in the file system. Thus, people can<br\/>base their trust decisions on who needs to use data and their<br\/>administrative decisions on how best to manage the data. Moreover,<br\/>with SUNDR, attackers will no longer be able to wreak havoc by<br\/>compromising servers and tampering with data. They will need to<br\/>compromise clients while legitimate users are logged on. Since<br\/>clients do not need to accept incoming network connections, they can<br\/>more easily be firewalled and protected from compromise than servers","title":"CAREER: The Secure Untrusted Data Repository (SUNDR)","awardID":"0093361","effectiveDate":"2001-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["462739"],"PO":["309350"]},"49627":{"abstract":"EIA-0000439<br\/>Bruce Jacob <br\/>University of Maryland<br\/><br\/>Title: Hardware-Software Co-Design of Real-Time Operating Systems and Embedded Microprocessors<br\/><br\/><br\/>The objective of this experimental research is to improve the performance, predictability, and reliability of embedded applications by simulating a processor, building a hardware filed-programmable gate array prototype and implementing a real-time operating system and virtual machine environment to support associated embedded applications. This work must be approached experimentally rather than theoretically due to the difficulty in designing and implementing analytical models which are complex enough to inform the design of real world systems. The design of hardware and software elements concurrently should lead to greater integration and higher performance by several orders of magnitude than the design of either element separately.","title":"Experimental Partnership - Hardware-Software Co-Design of Real-Time Operating Systems and Embedded Microprocessors","awardID":"0000439","effectiveDate":"2001-03-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["283200"],"PO":["371077"]},"62112":{"abstract":"This proposal is to fund travel to a workshop in San Francisco, March 12-13, 2001, on the subject of digital preservation and digital archiving. The workshop will identify and stimulate pilot projects in the collectin<br\/>and use of born-digital information, build agreement on guidelines for servicing and use of born-digital material, and write a white paper on the role of born-digital resources in research libraries, including an outline of next steps and identification of the individuals and organizations that could take them. It will improve our understanding of how to use digital information for long-term societal benefit.","title":"Association of Research Libraries and Internet Archive Workshop: \"Research in the 'Born-Digital' Domain\" on March 12-13, 2001 in San Francisco, California","awardID":"0109524","effectiveDate":"2001-03-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[159584,"406745","323015",159587],"PO":["433760"]},"57734":{"abstract":"The goal is a new computational method for the design of controllers for hybrid robotic systems. The method will be based on algorithms for extracting piecewise-linear approximations of nonlinear hybrid systems, and will be applied to two problems in robotics: 1) stability of limit cycles for hybrid systems; and 2) passivity analysis of hybrid systems. Stability criteria that exploit concepts of partial order and multiple Lyapunov functions will be adapted to piecewise-linear systems, and used with the proposed computational method to characterize passivity of hybrid systems. On the education side, the PI will develop a robotics curriculum that emphasizes close interaction between engineering and computer science; hybrid robotic systems will be used as motivating examples. The curriculum will underline the importance of interdisciplinary education for solving new technological challenges.","title":"CAREER: A Computational Approach to Control of Hybrid Robotic Systems","awardID":"0093581","effectiveDate":"2001-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["460591"],"PO":["335186"]},"57702":{"abstract":"The project addresses development of systems that interact autonomously with their environment in an intelligent way. Applications range from intelligent home environments to autonomous mobile robots to software agents. Over the recent years, the use of probabilistic methods has led to development of reliable mobile robot systems. However, despite tremendous potential benefits of collaboration between robots, some fundamental issues in the context of probabilistic methods for multi-robot collaboration remain unexplored. The goal of this project is to bridge the scientific gap between probabilistic methods for single-robot systems and those for collaborative multi-robot systems. The research is expected to have a strong impact on the area of collaborating mobile robots. On the education side, in order to teach the skills needed to understand and develop such complex systems, a new undergraduate course on mobile robotics will be designed, which will follow a hands-on approach to teaching, involving students in investigative work with mobile robots.","title":"CAREER: Probabilistic Methods for Multi-Robot Collaboration","awardID":"0093406","effectiveDate":"2001-03-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["550054"],"PO":["335186"]},"57955":{"abstract":"This proposal is to support two workshops on the important topic of Secure Campus Infrastructures. Security in general and secure campus systems in particular is a topic that has been discussed for years. It is now becoming critical to information flow into, across, and out of the campus network infrastructure that some consensus be reached on some security solutions and a basic implementation strategy be defined and executed. The goal of the workshop will be to combine information dissemination with design and practice collaboration to meet the following objectives: (1) To facilitate communication between schools at the forefront of implementing these new technologies with those schools in the beginning or planning stages, (2) To engage in dialogue leading to a consensus of an initial set of best practices and policies in the design and development of authentication and authorization services, and (3) To facilitate communication with content providers of core and complementary academic and research resources to ensure interoperability and usage of leading resources and applications.","title":"Workshop: Designing Secure Campus Infrastructures Using Directories and Certificate Authorities","awardID":"0094465","effectiveDate":"2001-03-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[148885],"PO":["389815"]},"57317":{"abstract":"In the last few years a greater emphasis on causality has enhanced the expressiveness of logic-based action representations. An example of this is the \"causal theories\" formalism of McCain and Turner, which can be used to conveniently describe action domains in which: (a) actions have indirect, nondeterministic, and\/or delayed effects; (b) things change by themselves; and (c) concurrent actions have interacting effects. Although causal theories are nonmonotonic, they are mathematically simple. In fact, in their most commonly used form they have a concise translation into classical propositional logic. This last fact is particularly significant in light of the remarkable success of the satisfiability planning method of Kautz and Selman, which has greatly influenced recent AI planning research. While most current work on satisfiability planning involves propositional encodings of STRIPS-like action descriptions, the expressiveness of causal theories will support satisfiability planning in relatively complex action domains. For example, there has been little progress in AI planning for action domains in which concurrently executed actions may have interacting effects. Causal theories can be used to describe them, and the resulting descriptions can be used for planning by the satisfiability method. A unifying goal of the current research is to broaden the applicability of AI planning by means of contributions in the following areas: (a) mathematics of causal theories and related formalisms; (b) representations of complex action domains as causal theories; and (c) automated planning and reasoning about actions.","title":"CAREER: Causal Theories of Action for AI Planning","awardID":"0091773","effectiveDate":"2001-03-15","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[147466],"PO":["387198"]},"61894":{"abstract":"","title":"Technical Support Services","awardID":"0108504","effectiveDate":"2001-03-01","expirationDate":"2002-03-01","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0500","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["300026"],"PO":[159072]},"57615":{"abstract":"Many important non-numeric applications are data intensive; hence, they will experience performance degradations as the gap between future processor and memory speeds widen. Unlike scientific workloads, non-numeric applications perform unstructured computations that exhibit low control-flow and address stream predictability, and low instruction and thread-level parallelism. These attributes limit the effectiveness of existing techniques for improving memory performance on non-numeric applications.<br\/><br\/>This CAREER award addresses the memory gap problem for non-numeric applications through an integrated research and education agenda. In research, several novel latency tolerance techniques will be developed to target unstructured computations. First, techniques for guiding prefetch instrumentation through runtime profile information will be studies to address unpredictable program behavior. Second, pointer prefetching techniques that aggressively schedule serialized memory operations will be developed to expose memory parallelism in pointer-intensive computations. Finally, \"code-space\" prefetch scheduling techniques will be investigated to enable prefetching along the multiple paths of execution commonly found in unstructured computations. In education, the topics and tools developed through research will be integrated into a curriculum that emphasized a \"learn-by-doing\" philosophy. In addition, undergraduate research programs and graduate student workshops will be created. Together, these education activities will produce students with a strong background in experimental systems.","title":"CAREER: Closing the Memory Gap for Unstructured Applications","awardID":"0093110","effectiveDate":"2001-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["486066"],"PO":["325495"]},"60377":{"abstract":"The objective of this research is to explore information visualization schemes to interactively control, drive and analyze simulations of adaptive resource management protocols in mobile networks. The considerable number of system variables and metrics that characterize adaptive resource management protocols and the need to monitor them in real-time results in a data explosion, necessitating data visualization schemes for efficient analysis and optimization. Two ideas will be explored:<br\/><br\/>1. Interactively steer simulations to optimize multi-layer adaptive protocols, via visualization interactions of appropriate simulation variables (system monitoring metrics, metric paramaters and simulation system parameters).<br\/>2. Characterize and segment simulations in terms of their critical features (e.g., congestion, failure) under a variety of dynamic network conditions.<br\/><br\/>Objective 1 is aimed at making the user central to the simulation environment, allowing simulations to be conrolled (stopped, backed up, variables\/protocols changed) and directed towards certain predefined objectives. Dynamic visualizations of system variables and interactions among them are fundamental to this interactive exploration, and more important, the user's intuition and domain expertise helps explore (reduce) a large search space of these variables. Objective 2 is targeted at characterizing simulations by focusing on critical features of a simulaltion, such as normal, congestion, transient and steady state failure, and recovery conditions. A robust scheme to detect and track these features will permit large amounts of simulation data to be compactly represented, stored and searched. The goal is to evaluate the application of this approach to automating adaptive protocol design and optimization.<br\/><br\/>The two proposed ideas will be evaluated for a specific problem instance that is being addressed by an ongoing NSF project on survivable wireless access networks. The problem is to develop a scaleable resource management scheme that integrates the use of adaptive admission control and adaptive multiple access control within hierarchical cellsite architectures of mobile networks. This multi-layer analysis and optimization problem presents a hugh search space of simulation scenarios, posing significant challenges to any type of comparative or systematic study. Earlier work has largely been restricted to individual components of such problems, at best. The approach is to cast this as a multi-variate data analysis problem, and explore several interactive multi-variate visualization methods. This should help in understanding the complex spatial and temporal relationships among the search space variables. Interactive steering is an efficient means to exploring this space and lead to desired objectives, while abstracting simulations by extracting and parameterizing critical features serves to facilitate automated evaluation of batch siumlation runs or network monitoring.<br\/><br\/>Support by an SGER is being requested for two reasons. (1) The proposed application of information visualization to the mobile networking domain has not previously been attempted. The proposed work shows great promise to dramatically change\/improve current approaches to development and simulation-based analysis of adaptive protocols. However, this work requires experimentation with new ideas in emerging research areas (interactive steering and feature characterization), and specific outcomes are not guaranteed. (2) Immediate support is needed since the proposed work is to be conducted in conjucntion with a newly-funded NSF project. It is expected that this will greatly enhance the progress achieved within both projects.","title":"SGER: Exploratory Research: Interactive Visualization and Control of Mobile Network Simulations","awardID":"0101866","effectiveDate":"2001-03-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["530662","464128"],"PO":[155235]},"60960":{"abstract":"The PI will conduct a preliminary investigation of immunity-based computational techniques to pave the way for more complex studies of this subject in the future. The ultimate goal of this research is to develop computational techniques inspired by the natural immune system for solving real-world science and engineering problems. The natural immune system is a distributed novel-pattern recognizer which uses intelligent mechanisms to detect a wide variety of antigens (novel patterns). From the computational point of view the immune system uses learning, memory, and associative retrieval to solve recognition and classification tasks. The immune system is a subject of great research interest, not only in the hope of finding cures for many diseases but also as a means for understanding its powerful information processing capabilities. In the current project the PI will investigate immunological principles, explore the underlying concepts and mechanisms, and take initial steps towards the development of intelligent computational techniques for solving problems in the field of science and engineering.","title":"SGER: Preliminary Research on Immunity-Based Computational Techniques","awardID":"0104251","effectiveDate":"2001-03-15","expirationDate":"2002-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[156824],"PO":["564456"]},"60379":{"abstract":"The proposal provides travel expenses for US researchers to <br\/>participate in a DELOS workshop on \"Information Seeking, Searching, <br\/>and Querying in Digital Libraries\" to be held in Zurich, Switzerland <br\/>December 11-12, 2000. DELOS is a major forum for and organizer of <br\/>digital libraries research and planning activities in Europe. It is <br\/>funded by the Information Societies Technologies (IST) 5th Framework <br\/>Programme of the European Commission.<br\/><br\/>The workshop continues the planning and research agenda put forward <br\/>by the multi-year NSF-EU working groups' process jointly sponsored by <br\/>CISE\/IIS, SBE\/INT and the European Union. In the groups' final <br\/>report \"An International Research Agenda for Digital Libraries\", <br\/>increased levels of collaboration and interaction was seen as <br\/>critical to building multi-lingual, multi-national digital libraries.","title":"NSF-DELOS Workshop on \"Information Seeking, Searching, and Querying in Digital Libraries\" in Switzerland","awardID":"0101885","effectiveDate":"2001-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["507668"],"PO":["433760"]},"60457":{"abstract":"The program coordinators propose to organize a workshop titled \"The Internet as a Large-Scale Complex System\" to be held at the Santa Fe Institute in March 2001. The main purpose of the workshop is to provide a forum for disseminating relevant accomplishments and discussing future challenges associated with trying to gain a solid understanding of the dynamics and evolution of the global Internet from a broad and still unconventional perspective-complex systems dynamics. The coordinators plan to bring together network researchers with a group of distinguished researchers with expertise ranging from statistical physics, dynamical systems theory, and control theory to biological, physical and social systems. Select contributions from invited speakers will be published as part of the SFI book series by Oxford University Press.","title":"Conference: The Internet as a Large-Scale Complex System; Santa Fe, NM; March 2001","awardID":"0102129","effectiveDate":"2001-03-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["551079","409715"],"PO":["234222"]},"57707":{"abstract":"Cryptography has gained interest from the industry as a result of the increasing electronic commerce market. The secure utilization of electronic devices in business transactions frequently involves cryptography in order to protect or verify the authenticity of the information being transferred by these devices. For several applications, the hardware implementation should not only be fast, but also to have features such as low power, reduced area, and scalability. This project involves the investigation and development of scalable structures for arithmetic operations for cryptography. Scalability is defined here as the capability to compute any long-precision result using fixed precision arithmetic units. These arithmetic units are adjustable to the available area, organized for concurrent execution, and reused as needed to obtain any desired precision. This project explores new computer arithmetic algorithms and design strategies for basic operations in cryptographic applications, leading to reusable, scalable, and efficient implementations. The utilization of design alternatives such as digit codes, scheduling techniques (space and time), and system organization will be considered in detail. The PI looks into operations in Galois Fields GF(p) and GF(2^m). These operations are used in classical cryptographic algorithms and the more recent Elliptic Curve cryptography, which offers a higher degree of security.","title":"CAREER: Computer Arithmetic Algorithms and Scalable Hardware Designs for Cryptographic Applications","awardID":"0093434","effectiveDate":"2001-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[148351],"PO":["180163"]},"62933":{"abstract":"Recent advances in computer and network technologies and storage, the explosion of publishing, and the vast increase in data availability from sources such as the Internet and satellites, that have enabled the emergence of an unprecedented number of new computer applications, present a new challenge to the ways data and information are used and managed. This challenge will shape both the research agenda as well as the technology to be developed for the 21st century. The objective of this workshop is to bring together the PIs and Co-PIs currently funded by the Information and Data Management Program (IDM) of the National Science Foundation to: (1) cooperatively analyze and focus on the research and development issues of problems that are fundamental in making progress towards this new challenge; (2) share, provide demonstrations and interact with each other on the objectives, contributions and challenges of major research activities funded by the IDM and explore fruitful collaboration and synergism; and (3) provide an opportunity to NSF program officers, other foundations and funding agencies, and industry representatives to learn more about the current research efforts and successes of projects funded by IDM, and for such officers to share their program highlights and concerns. <br\/><br\/>The workshop will generate a proceedings on all projects currently funded by IDM in both hard copy and electronic form. The workshop will also generate a report detailing future directions of research and will suggest promising modalities of research with an aim to foster innovation and technology transfer. The proceedings will provide project information searchable by different criteria and provide connections between discoveries and their use to society. The workshop website (http:\/\/itlab.uta.edu\/idm01) will also include links to other relevant material.","title":"2001 NSF Information and Data Management Program Workshop","awardID":"0112914","effectiveDate":"2001-03-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["553596","547675"],"PO":["563751"]},"60997":{"abstract":"This project is to support a problem-posing and problem-<br\/>solving workshop on an emerging new topic in Computational<br\/>Geometry, with applications in Graphics, Robotics, and<br\/>Mobile Computing. Funding will support a small<br\/>international group of participants, including students and<br\/>post-docs, to get together and draft a list of the main<br\/>questions to be answered about this relatively new data<br\/>structure, and to work on solving some of them.","title":"Workshop on Pseudo-Triangulations to be held Jan. 26 - Feb. 2, 2001 at McGill University, Barbados, West Indies","awardID":"0104370","effectiveDate":"2001-03-01","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550373"],"PO":["179846"]},"57609":{"abstract":"Because general-purpose deduction in first-order languages is undecidable, it has been difficult to incorporate into practical relational concept learning. In this project the PI will explore the use of powerful polynomial-time deductive reasoning procedures to benefit relational learning systems. The research introduces a new learning setting called \"learning from immediate consequences\" which is parameterized by a polynomial-time deductive reasoning procedure that can be viewed as defining the \"immediate consequences\" of any set of formulas relative to a query. The learning goal in this setting is to take as input a set of examples that are not currently immediate consequences of the background knowledge, and induce a definition of the target concept such that the positive examples become immediate consequences but the negative examples do not. A rough analogy can be drawn between immediate consequences and those consequences that are obvious to humans. When given a query, a human is able to determine immediately whether or not the answer to it is obvious, in the same sense that a low-order polynomial-time inference procedure can quickly answer the same question. Given this analogy, the proposed learning setting can be viewed as learning a target concept that makes the positive examples obviously covered while the negative examples remain apparently uncovered. Formal representation languages other than classical predicate calculus will be considered, which are designed to facilitate discovery of useful immediate consequences quickly; the resulting learning system can express and learn target concepts in a language that is strictly more expressive than the standard Horn clause language.<br\/><br\/>This approach stands in contrast to that used by perhaps the most well-known efficient relational learning system, FOIL, which avoids the undecidability of general-purpose deduction entirely by requiring that all background knowledge be extensionally specified, and making no attempt to go beyond that specification deductively. In spite of the contrast between the PI's approach and that of FOIL, it is feasible to integrate many of the ideas from FOIL and other relational learning systems into this new learning setting, with the intention of retaining the advantages of those systems. The potential impact of this work includes improved induction and data-mining algorithms for use in many industrial contexts. These algorithms will be particularly advantageous in situations where the data to be analyzed are highly structured, and thus are not ideal for current state-of-the-art attribute-value learning techniques. This work will provide means to recognize rich structure in data without using expensive theorem-proving techniques and\/or assuming an extensionally represented background knowledge base. Natural language text databases on the world-wide web form a central source for learning problems that will benefit from such efficient use of structured representations.","title":"CAREER: Learning to Understand -- Integrating Reasoning and Learning","awardID":"0093100","effectiveDate":"2001-03-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":["402461"],"PO":["387198"]}}