{"4895":{"abstract":"9521778 Ritzwoller Dr. Ritzwoller will study the shapes of the helioseismic spectral lines to deduce key information about large-scale aspherical structures, convection, magnetic fields and excitation mechanisms. The line shape interpretation requires separating structural, dynamical and excitation effects on mode peaks from the artifacts of data reduction techniques and is not entirely straightforward since the seismic effects of various excitation mechanisms and solar structures are not yet well understood. ***","title":"Modeling and Analysis of GONG Lineshapes","awardID":"9521778","effectiveDate":"1996-03-01","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1215","name":"STELLAR ASTRONOMY & ASTROPHYSC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1523","name":"SOLAR-TERRESTRIAL"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["75924","533749"],"PO":["140537"]},"5611":{"abstract":"The research goal is to model the dynamic vibratory motion of the vocal folds using an interactive, three dimensional vocal fold model, whose parameters can be adjusted by the researcher to interactively test new hypotheses concerning voice production. The methodology includes spectral shaping and noise modeling of fricatives, plosives and affricatives as well as nonlinear dynamic modeling of vocal fold motion. A major motivation for this model is that imaging and other methods for measuring aspects of vocal fold vibratory motion are difficult tasks that involve probes inserted into the throat. The vocal fold model will be tested using an articulatory speech synthesizer developed by the author under previous NSF sponsorship. The significance of this interactive model is that its features and parameters can be modified and are related to physiological characteristics of the speech production process. Three applications for the research results are training aids for the hearing impaired, methods to improve the design of speech production systems for the vocally impaired, and improved speech coding based on articulatory movement.","title":"Interactive Model of the Vocal Folds and Turbulent Noise forSpeech Synthesis","awardID":"9526049","effectiveDate":"1996-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[13769,13770],"PO":["565227"]},"5424":{"abstract":"NCR-9523767 Pearlman, William A. Rensselaer Polytechnic Institute New Techniques for Audio, Image, and Video Compression The goal of this research is to investigate more effective techniques for digital audio, image, and video data compression. For audio, the intention is to employ more efficient entropy-constrained, conditional and unconditional, quantization in the coding of the critical subbands of the MPEG audio standard. The dependence of the subbands is next exploited using set partitioning in hierarchical trees (SPIHT) as done originally in embedded, wavelet, zerotree coding of images. The resulting embedded coding allows delivery of different qualities of service with a single compressed bit stream. A newly developed SPIHT procedure, which obtained probably the best-to-date monochrome, still image results (lossy or lossless) and with extremely fast encoding and decoding, is utilized for audio and also for color image and video coding. The extremely fast execution of the SPIHT coding procedure makes it especially suitable for video, where a requirement of real-time coding becomes an insurmountable obstacle for other procedures. Both lossy and lossless coding are investigated, as they fit naturally into the SPIHT framework. It is expected that the results will surpass those of existing standard systems, which do not produce naturally embedded code, and are far more complex operationally and hence slower in execution. Other investigations involve the use of information theoretic criteria to create optimal adaptive subband compositions and the use of trellis coded quantization (TCQ) in block discrete cosine transform (DCT) and lapped orthogonal transform (LOT) coding. The adaptive subband decompositions pay off in better compression for a given subband coding technique. TCQ coding brings an efficient, but complex technique operating on transform blocks, which preserve regional characteristics of the image. Finally, the SPIHT coding algorithm pr ovokes several theoretical questions which are addressed. Among them are the minimal information rates to determine octave ranges of random variables and convey subset partition numbers and element numbers, and the mutual information between significant bits of dependent random variables and between their respective residual bits. Satisfactory answers to these questions will lead to more efficient coding techniques with decreased complexity.","title":"New Techniques for Audio, Image, and Video Compression","awardID":"9523767","effectiveDate":"1996-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["196769"],"PO":["150411"]},"6998":{"abstract":"9530506 Goodman This meeting will bring together researchers in computational and discrete geometry. The purpose of the meeting is to foster interaction, centered on geometric questions, between computer scientists and mathematicians. Such interaction started mainly by a similar conference held in Santa Cruz in 1986. During the ten years since that meeting, researchers in each area have made substantial contribution to the other. Combinatorial and discrete geometers have gotten more and more interested in algorithmic and complexity-related questions, while the computational geometers have used their techniques successfully to make inroads into problems that had previously seemed intractable to mathematicians. Both fields have grown as a result of this interaction. The present meeting will survey much of the progress made during the past decade, and delineate the areas in which progress is likely to take place during the coming years. ***","title":"Conference on Discrete and Computational Geometry, July 13-19, 1996, Mount Holyoke College, South Hadley, MA.","awardID":"9530506","effectiveDate":"1996-03-15","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["113154"],"PO":["187585"]},"1147":{"abstract":"Requirements completeness is the extent to which an application meets user needs. Many applications fail to meet user needs because their requirements incompletely specify what should happen in non-normative situations. Such applications constrain users' actions, so that \"workarounds\" must be invented. This project is to develop and evaluate novel methods for improving and predicting the completeness of requirements with an emphasis on interactive applications for individual users and small groups. It is assumed that requirements can be derived from user and enterprise goals, and so completeness is defined as the fit between a feature set and the goals and goal-thwarting obstacles that arise in the use context. There are two research challenges: (i) development of methods for analyzing the use of context to uncover goals and obstacles, and (ii) development of methods for deriving requirements from goals and obstacles. Approaches are to be developed for performing these transformations: identifying goals, decomposing goals into subgoals,clarifying goal dependencies, transforming goals into operations, establishing the boundary between application and environment, allocating operations to application and users, identifying obstacles, inventing scenarios for analysis of obstacles, and adding operations or goals to deal with obstacles. The project also seeks to extend and specialize for goal refinement the Inquiry-Based Requirements Analysis process (in which requirements derivation intertwines the expression of models, discussion of their content, and transformation). Work in design rationale is applicable to guiding recurring patterns of goal refinement. Candidate feature sets can be compared by exploring scenarios that are derived systematically from the goal structure: Scenarios are generated using a story grammar, with each significant episode representing a goal or an obstacle. Scenario generation heuristics lead to greater goal\/obstacle coverage, and therefore greater requirements completeness without unnecessary redundancy. Development and evaluation of the goal refinement strategy are proceeding simultaneously. The number and quality of additional requirements that are identified as a result of applying the strategy to realistic case studies will be measured. Industrial case studies are carried out in parallel with industrial funding. ***","title":"Improving Requirements Completeness through Inquiry-Based Goal Refinement","awardID":"9503863","effectiveDate":"1996-03-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["235460"],"PO":["150697"]},"6736":{"abstract":"CDA-9529561 Cook, Diane J. Shirazi, Behrooz A. Kavi, Krishna M. University of Texas- Arlington Design of a Distributed Computing Environment Using Power PC Micro Kernel The goal of this project is to investigate, design, and develop a unique distributed computing environment using a cluster of 12 networked PowerPcs. The uniqueness of the proposed research is based on the development of a set of tailor-made, PowerPC micro kernel routines to efficiently manage the overall system for a specific, large-scale AI application: parallel knowledge discovery from large complex databases. The main objectives are: (1) Developing a set of new and unique load balancing schemes for management of distributed systems. The schemes will be tailored for AI applications and implemented using the PowerPC micro kernel routines. (2) Developing a new distributed system for parallel knowledge discovery from large complex databases. The application will be carried out using the computing facility and proposed load balancing environment.","title":"CISE Research Instrumentation: Design of a Distributed Computing Environment Using PowerPC MicroKernel","awardID":"9529561","effectiveDate":"1996-03-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["13545","559679","547675"],"PO":["301532"]},"4712":{"abstract":"Szyld This award will support collaborative research between Daniel Szyld of Temple University, and Rafael Bru, Polytechnic University of Valencia, Spain. The proposed study will focus on the parallel solution of large systems of linear algebraic equations. In particular, asynchronous iterative methods and preconditioned Krylov-type methods, for both singular and nonsingular systems, will be studied. The primary benefit of the collaboration is the joining of complementary skills and compatible research views. Professor Bru's work on the convergence of the product of nonnegative matrices is relevant to Szyld's work on analyzing the convergence of two-stage iterative methods and on asynchronous methods, and has already led to joint publications by the collaborators or their students. The proposed research includes theoretical, algorithmic, and experimental elements. It will explore convergence properties and implementation details of parallel block and asynchronous iterative methods. Numerical experiments will be performed.","title":"U.S. Spain Cooperative Research: Parallel Solutions of Linear Systems","awardID":"9521226","effectiveDate":"1996-03-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["485287"],"PO":["214302"]},"15191":{"abstract":"The problems of interference detection are fundamental in computational geometry, solid modeling, robotics, manufacturing, computer graphics and computer-simulated environments. These include collision detection between geometric models undergoing motion, surface intersection between linear and curved surfaces, collision avoidance for robot motion planning, visibility computations, hidden surface removal and boundary computations. This research takes a three-fold approach to these problems using algebraic, numeric and geometric techniques: 1. Develop fast and robust algorithms for interference detection between geometric models in static and dynamic environments. The set of models include polyhedra, splines, algebraic surfaces and deformable objects. 2. Specialize these algorithms to interactive collision detection, hidden surface removal, surface intersection and boundary computation with special emphasis on robustness. 3. Develop efficient software libraries for interference detection between moving polyhedral objects, solid models defined using algebraic surfaces and boundary evaluation. The resulting libraries will be distributed as public domain code and demonstrated on different applications. The research efforts will be complemented with the following educational goals: 1. Development of undergraduate and graduate courses on geometric, symbolic and scientific computing. 2. Develop novel teaching methods and electronic course notes using the World-Wide Web (WWW) technology. 3. Use of graphics, geometry and animation tools to develop an algorithm animation and programming laboratory for undergraduate courses. 4. Serving as a mentor to high school and undergraduate students to work on graphics and modeling related projects in our laboratory. ***","title":"CAREER: Algebraic and Geometric Techniques for Interface Detection in Static and Dynamic Enviroments","awardID":"9625217","effectiveDate":"1996-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["543535"],"PO":["179846"]},"6716":{"abstract":"CDA-9529503 Gultekin Ozsoyoglu Z. Meral Ozsoyoglu Case Western Reserve University Presentation Languages in Multimedia Databases Multimedia presentation refers to the concurrent presentation of multimedia data using monitors for text, video or still images, and speakers for audio. Each presentation contains multimedia segments retrieved from a database, and is constructed and played out by a presentation manager software. This research has three components. (a) A prototype system is developed to automate the assembly of presentations from multimedia databases for beginning computer users. The system is then revised and evaluated in different application domains. One example is a Course-Assistant software in education. (b) A presentation construction language for intermediate computer users is implemented and evaluated in different application domains. The language provides control on the number and contents of concurrent segments in a presentation, and has the ability to specify playout-time changes in a presentation, and communication and synchronization among multiple playout managers. (c) For advanced users, a presentation manipulation language is developed and evaluated. The development is carried out on multimedia personal computers with MPEG capture and playout capabilities and on workstations, acquired by the instrumentation grant. The development platforms are Windows NT and UNIX.","title":"CISE Research Instrumentation: Presentation Languages in Multimedia Databases","awardID":"9529503","effectiveDate":"1996-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["448583","393279"],"PO":["301532"]},"1667":{"abstract":"Over the past decade, researchers have developed tools that offer automated support for applying formal methods to the design and analysis of concurrent software systems. In principle, these tools allow system designers to utilize formal system verification techniques without requiring them to know all the details of the underlying mathematical theories. In practice, however, the impact of the tools has been limited because of the relatively small scale of the problems they can handle and because of their lack of support for more traditional development methods for software, such as structured design techniques, simulation, and debugging. This research project aims at extending the applicability of existing automated formal techniques for concurrent systems to problems of real-life scale and complexity. The focus is on two broad issues: (1) increasing the efficiency and scalabity of existing approaches; and (2) enhancing the usability of existing techniques by integrating them with more traditional software development methods. More specifically, it seeks to develop advanced state-space management techniques for checking system specifications against logical properties expressed in the modal mu-calculus, and techniques for graphically conveying diagnostic information for systems that fail to meet their logical specifications. The impact of the research is being assessed by analyzing several real-life applications, such as sliding-window communications protocols and cache coherency protocols for distributed shared memory. This research builds on the investigators' prior work on the Concurrency Factory, an integrated toolset for specification, simulation, verification, and implementation of concurrent systems. *** _","title":"Practical Techniques for the Design, Specification, Verification, and Implementation of Concurrent Systems","awardID":"9505562","effectiveDate":"1996-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451745","123463"],"PO":["150697"]},"6707":{"abstract":"CDA-9529460 Camps, Octavia I. Sznaier, Mario Kasturi, Rangachar Pennsylvania State University Robust Purposive Vision Lab A Robust Purposive Vision Laboratory using high performance image processing and imaging equipment is established within the Electrical Engineering and the Computer Science and Engineering Departments at the Pennsylvania State University. This laboratory supports research towards the development of both theoretical tools and specific algorithms for robust vision systems. Despite their potential to reduce costs and increase flexibility and safety, vision systems are not common in industrial environments. This can be traced to the inability of many algorithms to handle uncertainty. The main contribution of our on-- going and proposed research is to develop robust purposive vision methods, by combining functional and physics based computer vision with newly developed multiobjective robust control and filtering techniques. We expect that this combination will result in robust systems that can be successfully moved from a controlled university environment into the \"real world\". In particular, these results will be applied to reverse engineering, target tracking and motion detection.","title":"CISE Research Instrumentation: Robust Purposive Vision Laboratory","awardID":"9529460","effectiveDate":"1996-03-01","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["424181","549740","549739"],"PO":["557609"]},"17273":{"abstract":"This research explores visualization methods for examining high-dimensional data with low-dimensional projections with CAVE Virtual Reality technology. Dynamic graphical methods for exploratory data analysis are examined in a 3-d immersible environment. The methods are based on generating motion graphics from continuous sequences of 3-d projections of high-dimensional data. Interactive user control is considered in the form of controlling the path of the 3-d sequences in the data space. Virtual Reality offers the construction and realization of an artificial 3-dimensional world that has important potential use in scientific areas. Statistics is the science of making sense of complicated data. For example, typical environmental data sets may contain thousands of data values on hundreds of variables. Graphical methods are needed for exploring and determining relationships among variables such as tree crown health, topography, temperature, population density and atmospheric pollutants. This research explores statistical graphical methods for visualizing many variables simultaneously using CAVE Virtual Reality technology. The research relates to the Federal Strategic Area of Improved Environmental Quality in that the examined methods can provide insights for examining spatially measured environmental data. It also relates to the Federal Strategic Area of Harnessing Information Technology because it examines using Virtual Reality technology for organizing and synthesizing information.","title":"Using CAVE Technology to Explore High-Dimensional Data","awardID":"9632662","effectiveDate":"1996-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["530406"],"PO":["331535"]},"15354":{"abstract":"9625755 Ginsberg, Matthew L. University of Oregon, Eugene Postdoc: Planning and Scheduling as Constraint Satisfaction Investigating Fundamental Similarities and Differences This award supports CES Associate David Joslin. Although planning and scheduling are closely related fields, the latter has enjoyed far greater success in recent years. Research in the field of scheduling has benefited greatly from treating scheduling problems as constraint satisfaction problems (CSPs); the application of CSP techniques to planning has been more limited, and has tended to be ad hoc. The Descartes algorithm, introduced by Joslin in 1995, has demonstrated that planning problems can be transformed into dynamic CSPs, allowing CSP techniques to be applied uniformly to all decisions. The CSP formulation also makes it possible to leverage successful scheduling algorithms in the solution of planning problems. The focus of this research is on understanding when and why CSP-based scheduling techniques are (or are not) effective when applied to planning problems. In the first phase, an efficient scheduling algorithm is integrated with the Descartes planning algorithm. The resulting hybrid system is experimentally evaluated on both planning and scheduling problems. In the second phase, differences between planning and scheduling are characterized in terms of a common CSP representation, and these differences are exploited to improve the performance of the planning system. ***","title":"Postdoc: Planning and Scheduling as Constraint Satisfaction Investigating Fundamental Similarities and Differences","awardID":"9625755","effectiveDate":"1996-03-15","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[38780],"PO":["564412"]},"15894":{"abstract":"9627463 Hart Organism-flow interactions are potentially important in a wide variety of ecological settings. Unfortunately, it is often difficult to quantify the complex flow fields in which organisms actually live, thereby limiting our understanding of the direct and indirect effects of flow on various ecological processes and patterns. This collaborative research, which combines expertise in aquatic ecology and mechanical engineering (simulation and measurement of flow and transport processes), will apply recent methodological advances in engineering to describe the flow environments inhabited by stream benthic animals. Specifically, the research will use computational fluid dynamic models t o simulate benthic flow fields, and will validate the predictions using recently developed acoustic Doppler velocimeters as well as hot-film anemometers. These validated models can provide detailed descriptions of spatial and temporal variations in flow field characteristics. The effects of different flow fields on pattern of feeding, habitat selection, and distribution of suspension-feeding stream insects will then be examined via experimental studies in laboratory flumes and in the field. How such organism-flow relationships vary with spatial scale will also be examined. This 'Small Grant for Exploratory Research' will demonstrate the value of this interdisciplinary approach for ecological studies in streams and rivers. It can ultimately lead to major advances in the study of organism-flow interactions in a wide variety of ecological systems.","title":"SGER: Collaborative Research: Ecological Studies of Organism-Flow Interactions via Advanced Simulation and Diagnostic Techniques","awardID":"9627463","effectiveDate":"1996-03-01","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1182","name":"POP & COMMUNITY ECOL PROG"}}],"PIcoPI":["553915"],"PO":["563582"]},"15322":{"abstract":"9625668 Davis, Larry University of Maryland, College Park CISE Postdoctoral Program: Postdoctoral Research Associate in Computational Science & Engineering Science: High Performance Computing for Remote Sensing Applications This award supports CES associate David Bader. The main objective of the proposed training and research plan is to develop innovative computational methods and software for applying high performance computing to fundamental problems arising in the analysis of remotely sensed image data. This work will be conducted at the University of Maryland Institute for Advanced Computer Studies (UMIACS) in close cooperation with Professor Davis (Computer Science), Goward (Geography), Ja'Ja' (Electrical Engineering), and Townshend (Geography), who are pursuing a number of closely related efforts. The application to be developed is a high performance system for estimating net primary production (NPP) using the production efficiency model (PEM) developed at the University of Maryland. The overall aim is to build a family of software modules that make use of a variety of algorithms to carry out geometric correction of images, to eliminate signals from extraneous sources (e.g. atmospheric correction), to sample spatially and temporally, and to generate derived geophysical properties. The modules will be constructed using proven portable and practical high performance programming languages and libraries. Our applications development will be conducted on two high performance computing platforms at UMIACS; a 16-node IBM SP-2 and a Digital Alpha cluster consisting of 40 Alpha processors networked via a Digital ATM Gigaswitch. The Maryland facility has approximately 300GB of online disk storage and a multi-terabyte tertiary storage system. ***","title":"CISE Postdoctoral Program: Postdoctoral Research Associate in Computational Science & Engineering Science: High Performance Computing for Remote Sensing Applications","awardID":"9625668","effectiveDate":"1996-03-15","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["564721"],"PO":["564412"]},"15355":{"abstract":"9625756 Colgate, James E. Northwestern University CISE Postdoctoral Program: Robust Haptic Display of Dynamical Virtual Environments This award supports associate Brent R. Gillespie. To provide for direct interaction and to more effectively immerse their users, the designers of virtual environments now have the option to render objects for the haptic (touch) senses, thanks to the new and flourishing field of haptic interface technology. At present, however, the fidelity of haptic display is limited. Restrictions must be placed on the mechanical impedance of the virtual object or exceptional computational power must be demanded of the interface controller lest sustained or even unstable vibrations arise between user and virtual object. This postdoctoral research aims to remove these obstacles by developing simulation and control methods which guarantee the absence of unstable vibrations and other non-physical interactive behaviors. The research begins by noting that the destabilizing effects of sampled-data and computational delays can be fully compensated out if the entire coupled dynamical system is modeled, including the human limb. On-line system identification of the coupled human limb is integrated into the controller design to allow for active behavior on the part of the human. Concurrent theoretical treatments and hardware\/software development efforts are employed to extend the methods to dynamical objects and objects which are subject to changes in kinematic constraint. ***","title":"CISE Postdoctoral Program: Robust Haptic Display of Dynamical Virtual Environments","awardID":"9625756","effectiveDate":"1996-03-15","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["541976"],"PO":["557609"]},"15554":{"abstract":"9626370 Mitchell, Joseph S SUNY @ Stony Brook CISE Postdoctoral Program: Efficient Geometric Algorithms in Support of Virtual Reality Systems (ES Postdoctoral Associate) This award supports CES associate Claudio Silva. The goal of this project is to advance the state of the art in virtual environment systems by making use of methods of the field of computational geometry and the power of highly parallel computing architectures. New efficient algorithms are being devised and implemented for critical geometric problems that arise in virtual environments and three-dimensional simulations, including collision detection, visibility\/visualization, and mesh simplification. A prototype software system is being written, incorporating new algorithms (sequential and parallel), and a library of efficient code for geometric primitives. Special attention is being given to robustness and efficiency issues of the algorithms and implementations. The impact of the project will be to advance the state of the art in virtual environment simulations, by increasing the complexity of the models that can be handled in real time. ***","title":"CISE Postdoctoral Program: Efficient Geometric Algorithms in Support of Virtual Reality Systems (ES Postdoctoral Associate)","awardID":"9626370","effectiveDate":"1996-03-15","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["471875"],"PO":["297837"]},"14412":{"abstract":"This grant is to support travel for the ACM Workshop on Applied Computational Geometry to be held on May 27-28, l996 in conjunction with the second Federated Computing Research Conferences (FCRC) in Philadelphia, immediately following the ACM Symposium on Computation Geometry. This workshop is mainly designed to bring together practitioners and theoreticians in computational geometry and other related applied fields to discuss the current research and future directions in these communities, to facilitate technology transfer from theory to practice, and to identity future joint programs and collaboration. ***","title":"ACM Workshop on Applied Computational Geometry, May 27-28, 1996, Philadelphia, PA.","awardID":"9622493","effectiveDate":"1996-03-15","expirationDate":"1996-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["543535"],"PO":["187585"]},"15415":{"abstract":"9625910 Kuh, Ernest S. University of California, Berkeley CISE Postdoctoral Program: Research in Computer Aided Design of VLSI Circuits with Emphasis on Deep Submicron Technology This award supports associate John P. Lillis. With the advent of deep submicron technology, the VLSI community is now faced with many new technical challenges which are currently inadequately addressed by the state of the art in Computer Aided Design for VLSI circuits. Because of the scaling of feature size in the submicron domain, performance of VLSI systems is now largely dominated by interconnect delay. Some powerful techniques for addressing this interconnect dominance are timing optimization by buffer insertion, wire sizing and performance driven routing. We propose that the time during the award period be used to further develop these techniques into a mature, cohesive set of tools. Among the research objectives of the proposals are (1) development of algorithms for routing and buffer insertion to address the problems of electromigration and crosstalk noise, (2) experimental evaluation of gate replication techniques for timing optimization and (3) integration of the optimization techniques at a higher level in the physical layout process which included circuit placement. All of these topics are of great practical importance in deep submicron systems of today and the future.","title":"CISE Postdoctoral Program: Research in Computer Aided Design of VLSI Circuits with Emphasis on Deep Submicron Technology","awardID":"9625910","effectiveDate":"1996-03-15","expirationDate":"1998-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[38935],"PO":["564412"]},"14800":{"abstract":"9623585 Chen This project will study the design, analysis, and implementation of algorithmic techniques for solving geometric shortest path problems, their generalizations, and applications. Of interest are not only theoretically efficient algorithms, but also practically efficient ones. The research has three main interests: (a) Develop efficient algorithmic solutions for several fundamental geometric shortest path problems that are still outstanding (e.g., geometric shortest path queries), (b) investigate new approaches to computing approximate geometric shortest paths, and (c) design effective and practically efficient paradigms for planning robotic shortest paths in the plane and in higher dimensional spaces. Several general frameworks for processing exact and approximate geometric shortest path queries will be investigated. These frameworks offer the promise of achieving new efficient algorithmic techniques and data structures for geometric shortest path queries and for other related problems. Also, a paradigm is being studied for obtaining practical solutions to planning shortest obstacle-avoiding paths for robot motion in planar and higher dimensional environments. This paradigm is based on new data structures called framed-quadtrees and framed-octrees, and has led to new practical robotic path planning algorithms. In addition, algorithmic solutions for shortest paths and their generalizations are applied to practical applications such as data compression, computer vision, image processing, and VLSI design. New approaches for solving application problems based on algorithms for shortest path problems and their generalizations are studied. The possibility of finding new methods for geometric shortest paths that yield efficient implementation performance on existing Massively Parallel Processing (MPP) systems is also explored. The research also includes an important experimental component. The education plan is to develop a new environment for t eaching and experimenting with Massively Parallel Processing (MPP) systems by utilizing the new EXECUBE-based MPP architectures. The goal is to develop an inexpensive, but very robust, MPP system for upper level undergraduate and entry level graduate students to study and gain \"hands on\" experience with parallelism. The curriculum materials to be developed include concise programming tutorials, lecture notes, sample programs, and projects with sample solutions. This work could provide an integral part of not just electives in parallelism, but virtually of all the upper level computer science and engineering curriculum, and could even provide a basis to spill over into other engineering and scientific disciplines. ***","title":"CAREER: Theoretical and Practical Solutions for Geometric Path Planning and Related Problems","awardID":"9623585","effectiveDate":"1996-03-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["518029"],"PO":["179846"]},"3390":{"abstract":"This three-year award will support U.S.-France cooperative research in numeric computation with researchers Shantanu Dutt, Vipin Kumar at the University of Minnesota and Catherine Roucairol at the Rocquencourt campus of INRIA (the French National Institute for Research in Computer Science and Applied Mathematics). The objectives of their research are to develop highly parallel branch-and-bound algorithms for solving combinatorial optimization problems (COPs) and software for optimization computations on parallel computers. Branch-and-bound algorithms are used widely in solving combinatorial optimization problems that appear in a variety of applications like computer vision, robot motion planning, and integer programming and computer-aided design of very large scale integrated circuits. These problems take a long time to solve. The U.S. investigators propose to develop time and memory efficient techniques for solving these problems using parallel processing. The U.S. investigators bring to this research their expertise in parallel computing and techniques for solving COPs using distributed memory machines and workstation clusters. This is complemented by the French investigator's expertise in operations research and her work on branch-and-bound algorithms techniques suitable for shared-memory multiprocessors.","title":"U.S.-France Cooperative Research: Highly Parallel Branch- and-Bound Algorithms for Solving Optimization Problems (with INRIA)","awardID":"9512014","effectiveDate":"1996-03-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["532322","563608"],"PO":["323582"]},"7350":{"abstract":"The Micro-Electro-Mechanical Systems (MEMS) process technology has matured to the point where it is possible to fabricate a chip with both electrical and mechanical pomponents on it. However, tools and design methodologies are lacking. This worksho is to bring together design researchers from the VLSI CAD and MEMS design fields to discuss and develop ideas for a new design methodology for combined MEMS\/VLSI structures.","title":"Joint Research Between VLSI CAD and MEMS Areas: The Fifth Physical Design Workshop; April 15-17, 1996; Reston, Virginia","awardID":"9531666","effectiveDate":"1996-03-01","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["486396"],"PO":["321058"]},"15409":{"abstract":"9625898 Vardi, Moshe Y Felleisen, Matthias William Marsh Rice University CISE Postdoctoral Program: Diagrammatic Reasoning in Hardware Verification This award supports CES associate Kathryn Fisher. Diagrams are fundamental to hardware design. Designers use them extensively to convey details, to express properties, and to reason informally about designs. Despite this, little attention has been paid to supporting diagrammatic reasoning in verification. As a result, a substantial gap exists between design practice and verification methodology that makes performing verification difficult for designers. The project aims to bridge this gap through a logic developed around common hardware representations. The logic has five syntactic representations: three diagrammatic and two sentential. The inference rules support reasoning with information from multiple representations, thereby providing formal support for how diagrammatic information is used in practice. The practical objective is to investigate whether this logic makes verification easier for designers. A verification tool based on the logic will be implemented and evaluated alongside existing methodologies by both novices and experienced practitioners. The main theoretical objective is to examine how diagrammatic information can help refine the current boundaries between automated and interactive verification methodologies. The integration of these approached will be an important feature of the tool ***","title":"CISE Postdoctoral Program: Diagrammatic Reasoning in Hardware Verification","awardID":"9625898","effectiveDate":"1996-03-15","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["475166","565263"],"PO":["297837"]},"6351":{"abstract":"This research program investigates an advanced video compression approach for applications such as multimedia, video on networks, video conferencing, and video on demand. It is a novel combination of object-based coding usually used for very low rates and 3-D subband\/wavelet waveform-based coding, usually reserved for higher rates. In this method, the motion field is first segmented into objects which make up the image frame, and move at different velocities. The boundaries of these objects are coded using a type of contour coding which preserves the shape of the edge. This contour coding is performed as an update on the object boundaries found for the previous frame. Finally the interior of these space-time objects is coded using the waveform coding method based on motion compensated 3-D subband filtering. The overall goal is an efficient unified set of video compression algorithms scalable from video phone up to HDTV.","title":"Motion Compensated Object Based Video Coding","awardID":"9528312","effectiveDate":"1996-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["451716"],"PO":["564898"]},"6572":{"abstract":"The investigators' research in multiple reference point models of information petrieval (IR) has led to the development of a collection of visual information retrieval interfaces (VIRIs) embodying different approaches to visualizing similarity and semantic relations among documents. These VIRIs are intended to aid users in retrieval and organization of online information. VIRIs based on visualization of Boolean\/set operations (BIRD), distance measures in a reduced space defined by reference points (GUIDO), similarity with respect to multiple reference points (VIBE), and similarity defined jointly by distance and angular separation (DARE) have been developed. User studies will be conducted with these VIRIs in order to: 1) improve usability of their interfaces, 2) investigate conceptual accessibility of different visualizations to potential user populations, and 3) evaluate utility of the VIRIs for prototypical information retrieval and organization tasks. These studies will provide the first systematic investigation of the usefulness of document space visualizations to expected user populations for a variety of information retrieval and organization tasks. The interface features enhancing VIRI usability, and information visualizations demonstrating usefulness are expected to augment hypertext as mechanisms for organizing and accessing online information.","title":"Visual Information Retrieval Interfaces","awardID":"9529072","effectiveDate":"1996-03-15","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["553586","29286"],"PO":["565227"]},"4894":{"abstract":"Korzennik, Sylvain 95-21777 Dr. Korzennik will analyze and interpret solar data from the Global Oscillations Network Group (GONG) in order to advance our understanding of the causes of the 11-year cycle of sunspots and solar magnetic activity. Decades of study of magnetic activity strongly suggest that the activity cycle is somehow caused by a dynamo process involving the interaction of rotation and convection in the interior. Unfortunately, detailed understanding of this process is frustrated by our inability to measure the rotation or convective flows deep within the Sun. Helioseismic data from the GONG will permit the study of rotational and convective flows at and beneath the solar surface, with velocity precision and spatial resolution sufficient to test theoretical models of solar magnetic field generation.","title":"Constraining the Solar Activity Cycle Using GONG Data","awardID":"9521777","effectiveDate":"1996-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1215","name":"STELLAR ASTRONOMY & ASTROPHYSC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1523","name":"SOLAR-TERRESTRIAL"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["482117","15817","461463"],"PO":["150096"]},"2122":{"abstract":"This three-year award will support U.S.-France cooperative research in theoretical computing and programming languages between research groups at the University of Illinois and at INRIA (the French National Institute for Research in Computer Science and Applied Mathematics). The U.S. investigators, Edward Reingold and Nachum Dershowitz, propose to collaborate with Claude Kirchner and Michael Rusinowitz at INRIA\/Lorraine and with other researchers at the University of Nancy and the French Center for Research in Informatics at Nancy. Their research deals with problems in term rewriting and search techniques and in solutions of constraint and search algorithms. The U.S. investigators bring to this collaboration expertise in algorithms and equational reasoning. This is complemented by the French investigators' expertise in programming languages, constraint-based reasoning, and term rewriting techniques. The problems under study have important applications in image processing, programming languages, and automated deduction.","title":"U.S.-France Cooperative Research: Specifying and Finding Solutions to Constraint and Search Problems (with INRIA)","awardID":"9507248","effectiveDate":"1996-03-01","expirationDate":"2000-02-29","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["48787","17022"],"PO":["323582"]}}