{"1406":{"abstract":"A Workshop on Computer Support for Policy Analysis and Design was supported by this award. This is a topic that has been addressed in many journal and conference papers, but never in a coordinated way: thus a paper on security policy seldom deals with safety or high-speed response considerations, except as a footnote or ending paragraph. The purpose of this workshop was to provide a forum in which researchers in different fields could discuss their interests in computer support for policy.","title":"Workshop on Computer Support for Policy Analysis and Design, George Mason University","awardID":"9504746","effectiveDate":"1995-02-15","expirationDate":"1995-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[3240],"PO":["561889"]},"1314":{"abstract":"This workshop is to develop a seminal statement about research topics needed in developing a science of tools for electronic systems design. It brings together academic and industrial researchers with experience in VLSI chip, electronic system, and other design automation fields to integrate their varied points of view. The workshop facilitates the integration of a wide range of design automation research ideas, and their integration into a new science for systems design.","title":"Workshop on the CAD Needs for Supporting System Design for the Next Ten Years; Boulder, Colorado, March 1995","awardID":"9504395","effectiveDate":"1995-02-15","expirationDate":"1996-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["468664"],"PO":["321058"]},"1652":{"abstract":"This project deals with both theoretical and prototyping research in parallel processing to harness the power of workstation clusters. The primary techniques will based on aggressive scheduling, evasive memory and dispersed data management. The formal work expands the previous results of the PIs in asynchronous computing in several directions: (1) Extend the models to models of fine-grained programs. (2) Permit the inclusion of architecture specific characteristics into theoretical frameworks. (3) Techniques to distinguish inconsistencies in memory states as viewed by different processors resulting from time-outs, interrupts and failures (or indefinite postponement of a computation). (4) Techniques to allow non-deterministic executions. (5) Model input\/output operations of fault-tolerant programs. The experimental part of the project will build a scaled version to execute parallel programs on clusters of workstations. The prototype will address issues related to the eager scheduling of threads, the implementation of evasive memory and data management. The prototype will attempt to evaluate the effectiveness of the environment in terms of efficiency. This project is conducted jointly by P. Dasgupta of Arizona State University and Z. Kedem, of New York University.","title":"Collaborative Research: High Performance Parallel Processing: Fault Tolerant Computing on a Network of Workstations","awardID":"9505519","effectiveDate":"1995-02-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["448647"],"PO":["74434"]},"9563":{"abstract":"","title":"Modeling the Lung: Computational Analysis of 3D Viscous Airflow Through Bifurcating Tubular Networks","awardID":"9596075","effectiveDate":"1995-02-15","expirationDate":"1997-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1155","name":"INTEGRATIVE ANIMAL BIOLOGY"}}],"PIcoPI":[24072,"545885"],"PO":["76397"]},"2647":{"abstract":"9509244 McKnight Partial support is requested for a two-day workshop on Internet economics that will convene technologists, economists, business leaders and policy makers to discuss the Internet as an economic system. It will bring together researchers and practitioners across disciplines to help understand Internet economics in order to plan for the growth of this medium. The goal of this workshop is to plan and develop a framework for understanding the Internet as a self-sustaining economic system through panels and facilitated discussions.","title":"Workshop on Internet Economics; March 9-10, 1995; Cambridge, MA","awardID":"9509244","effectiveDate":"1995-02-01","expirationDate":"1995-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["410674"],"PO":["43608"]}}