{"70978":{"abstract":"The nature of the terrorist attacks on the World Trade Center in New York City demonstrates the need for understanding the interdependencies between physical infrastructure and social networks. The benefits of such understanding may include possible recommendations on modifying the design of the physical infrastructures to improve their resilience to catastrophic disruptions. Models of social networks relying on wireless and wired communication infrastructures would allow the development and testing of efficient algorithms to determine critical blocks in the infrastructures, whose distraction will adversely affect the communication traffic inside of and among social networks. This research project will use the graph-theoretic approach to model social networks and their reliance on physical infrastructures, focusing mainly on social networks in the New York City area and the providing infrastructures, including telephone networks, towers for the wireless communication, transportation and emergency services. This knowledge will be used to identify opportunities for reducing vulnerabilities, developing countermeasures to mitigate the impact of disruptions, and guiding actions for timely response and discovery.","title":"SGER: The Impact of Breakdowns of Physical Infrastructure on Social Networks","awardID":"0204758","effectiveDate":"2002-02-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["548125","320859","554109"],"PO":["495796"]},"68370":{"abstract":"EIA 0137743 <br\/>Elrad, Tzilla H.<br\/>Illinois Institute of Technology <br\/><br\/>Title: ADVANCE Fellows: Aspect Oriented Framework for Software Development<br\/><br\/>Project Proposed:<br\/><br\/><br\/>This proposal, applying aspect-oriented (AO) approach, aims at building a framework design to open software systems in a systematic way that factors into the initial design the capacity to evolve, be extended, and be adaptive to future changes. The work will employ the Dynamic Weaver Framework (DWF) under development by the Concurrent Programming Research group lead by the PI. This framework allows for a separation of software system aspects from the system components, providing a systematic well-defined structure to open the software system to enable evolution, extendibility, and adaptation. Motivated by the increased complexity resulting from adding more basic software components, this research addresses the following for AO software systems:<br\/><br\/>Modeling<br\/>Supporting lifecycle development with End-to-End automation <br\/>Experimenting with more real-life applications, with current case tools supporting the model, and with <br\/>on-demand system re-modularization<br\/><br\/>Aspect-oriented software development is an approach that cuts across functional components to present different views of software products. It supports and enhances software evolution by focusing on separation of concern issues, particularly to distributed systems.<br\/><br\/>Results from this work are expected to demonstrate slower degradation in component cohesiveness, and improvements in maintainability and evolution capacity of systems that require inter-component dependencies and communication.","title":"ADVANCE Fellows Award","awardID":"0137743","effectiveDate":"2002-02-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1681","name":"ADVANCE - FELLOWS"}}],"PIcoPI":[176972],"PO":["564181"]},"67381":{"abstract":"With each successive generation of microprocessors designers push the envelopes of technology and complexity. But these factors are conspiring to make the accepted practice of custom ASICs, and generational processors obsolete. Overhead costs such as design, validation, mask-generation, and test are growing and will make it prohibitive to continue with the current strategies. Concurrent with this trend is the growing realization that we are well past the point of diminishing returns for enhancing single-threaded computational performance. The future will migrate us towards ubiquitous parallel models of execution. Finally, users are starting to demand not just performance but reliability and security from their computing infrastructure. While the obvious substrates are sea-of-gates FPGAs, they are highly inefficient and do not take advantage of the wealth of processor research conducted over the last 50 years. Instead, we propose SISC, or Soft-Instruction-Set-Computing. A SISC processor is a universal processor, with no fixed legacy instruction set architecture, and no fixed interface to the surrounding system envi-ronment. However, it does exploit the best features of both fixed-logic superscalar processors and fine-grained FPGAs to provide an efficient, generic, computing substrate on which to experiment and build the secure, robust and distributed systems of the future. We will demonstrate the capabilities of configurable substrates by showing that SISC processors provide efficient emulation of existing legacy instruction set architectures, a platform to provide peek performance on streaming data-flow applications, a unification of single, multi-threaded and multi-processor architectures, a computing device on which to provide application-specific architecture security, integrated hardware support for high-level languages and a flexible substrate for enhanced undergraduate and graduate level computer architecture research. These application goals will drive our research in the design of a truly universal computing substrate. We expect the following products from this career plan:<br\/><br\/>1. A configurable processor design capable of emulating most modern instruction sets and a platform on which to construct new secure application architectures.<br\/>2. An infrastructure of simulation tools, emulation techniques, and hardware prototypes to demonstrate the benefits of reconfigurable processing substrates.<br\/>3. Automated compilation algorithms and tools for runtime customization of the SISC architecture.<br\/>4. A set of secure application compilation targets and operating system techniques to dynamically apply them as a response to network attacks.<br\/>5. Students trained in efficient system design and rigorous evaluation methodologies through research, student workshops and new courses.","title":"CAREER: Soft Instruction Set Computing","awardID":"0133188","effectiveDate":"2002-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["555935"],"PO":["565272"]},"67492":{"abstract":"Collaborating groups are dynamic affairs in which patterns of activity, working styles, levels of interaction, information structures and other elements emerge dynamically in response to the circumstances and settings in which work is carried out. In contrast, the technologies that we offer to support collaboration are static and rigid. Conventional software architectures support only limited degrees of adaptation and dynamic response. Combining analysis, design, and evaluation, this research investigates metalevel architectures, an alternative approach supporting radically dynamic application response. If successful, this will yield both applications and application platforms which provide much more seamless support for collaboration than is currently possible. It also forges new connections between the two major areas of CSCW research, social analysis and technical design. The complex relationship between these two areas of interest is a major challenge to research and teaching. This research further supports the training of a new generation of CSCW researchers who are not just familiar with both halves of the puzzle, but have the skills to put them together.","title":"CAREER: Integrating CSCW Technology and Practice using Metalevel Architectures","awardID":"0133749","effectiveDate":"2002-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["464219"],"PO":["564456"]},"67482":{"abstract":"This CAREER project investigates embedded systems architectures through the application of compiler and architectural techniques which use an existing processor more efficiently. Rather than automatically adopt existing personal computer paradigms for embedded systems, the main theme of this research is to rethink architectures and compilers in the context of embedded systems and how they are designed. <br\/><br\/>Software thread integration (STI) is a novel compiler technique for automatically interleaving multiple procedures (which implement multiple threads of control) into one non-speculative implicitly multithreaded procedure. The threads are integrated at the assembly language level; the compiler applies transformations to resolve conflicts in control-flow and resource sharing. <br\/><br\/>This research project uses STI in two ways. The first builds on the extraction of more fine-grain concurrency from a generic processor. STI enables switching from one thread to another with negligible (if any) performance penalty or delay. This means that some of the hardware resources added to compensate for the processor's poor fine-grain concurrency are eliminated and the functions move to software. The research is developing efficient methods to perform this hardware to software migration efficiently and precisely enough to implement network protocol interfaces completely in software, reducing size, weight, cost and development time for low-end embedded systems.<br\/><br\/>The second uses integration's augmentation of a thread's instruction-level parallelism, leading to faster execution on processors which are able to execute multiple instructions simultaneously. Modern digital signal processors used in high-end embedded systems are able to do so, yet they are poorly utilized because single threads do not contain enough independent instructions. STI helps by increasing the number of independent instructions in a thread to keep more functional units busy and finish the computation faster. This enables the more efficient use of lower-performance processors, reducing system costs and development time. When coupled with power management techniques, it also reduces power consumption and increases battery life.<br\/><br\/>The PI is creating a new embedded systems track within the computer engineering curriculum at NC State University. Two new hands-on courses on processor-based embedded systems are being added to supplement the PI's existing embedded system design course. The first is a junior-level course that introduces students to microcontrollers, interfacing them to the physical environment, and using a real-time operating system with modern development tools. The second is a graduate course that covers high-performance embedded systems for media processing. Students learn to program and optimize media applications (e.g audio or video compression and decompression) on various architectures (superscalar, VLIW, chip multi-processor). The PI is also involved in outreach activities at the NC School of Science and Mathematics to promote interest in embedded systems design and programming.","title":"CAREER: Software Thread Integration for Low-End through High-End Embedded Processors","awardID":"0133690","effectiveDate":"2002-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["485952"],"PO":["561889"]},"66790":{"abstract":"The proposed research will lead to the creation of next-generation Netlib (Netlib.ng). While preserving and strengthening Netlib's ability to provide its traditional services: reliable, fast access to latest and best computational software packages, we will explore technologies that adapt Netlib repositories to the new challenges presented by today's computing environment. We will first enhance Netlib's traditional services for both users and developers, principally by using the Repository in a Box (RIB) toolkit to upgrade Netlib's catalogue technology for improved usability and interoperability. Applying RIB tools to Netlib will make it compliant with IEEE metadata standards, substantially improve user interfaces, accelerate repository updates, simplify and decentralize administration, and enable for Netlib.ng to participate in larger virtual repositories without compromising its high standards for quality control. The second part of research aims to automate the full software deployment and management process, i.e. its compilation, installation, configuration, and management. When this work is completed, we believe Netlib.ng will leverage the power of this major community asset to create a rich and scalable solution to some of the complex problems of software deployment and management in the new era of high performance distributed computing we have entered.","title":"SOFTWARE: Advanced Capabilities for Netlib Computational Software Repositories","awardID":"0130499","effectiveDate":"2002-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}}],"PIcoPI":["558550","211371","486078",173136],"PO":["565272"]},"66780":{"abstract":"Solving problems that have large computational and storage requirements is becoming increasingly critical for advances in many domains of science and engineering. Runtime and compiler technology can significantly accelerate advances in such domains by enabling the programming of algorithms for these problems at very high levels of abstraction. Our research focuses on an important class of scientific and engineering problems: data intensive computations. Such computations arise in many domains of scientific and engineering research. We are targetting two high-level programming models for this class of computations:<br\/><br\/>1. Object-Oriented (Java-Based): Object-oriented features like encapsulation and polymorphism can ease software development and allow better long-term management of large computational projects. We are using a dialect of Java for expressing data intensive computations. An initial prototype compiler for this dialect of Java has been built. Our compiler uses static interprocedural slicing technique to extracting required functions for utilizing an existing runtime system, Active Data Repository (ADR). <br\/><br\/> 2. Declarative (XQL-Based): The very high-level nature of declarative languages can allow rapid prototyping of new computational techniques. XML (Extensible Markup Language) is getting accepted as the format for the logical layout of data which may be made available over the web or exchanged between organizations. We will make extensions to XML Schemas for expressing multidimensional collections of elements. We also will also make extensions to XQL, which is a query language for XML documents, for expressing processing of large datasets.<br\/><br\/>We propose innovative research in five important areas:<br\/><br\/>1. Execution Strategies for Disk Resident Datasets.<br\/><br\/>2. Advanced Symbolic Analysis. <br\/><br\/>3. Interprocedural Code Motion Techniques for Object-Oriented Programs. <br\/><br\/>4. Combined Compiler and Runtime Techniques for Locality Management. <br\/><br\/>5. Advanced Interprocedural Slicing Techniques for Object-Oriented Languages.","title":"SOFTWARE: High-level Programming Methodologies for Data Intensive Computations","awardID":"0130437","effectiveDate":"2002-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["410444","558505"],"PO":["565272"]},"68562":{"abstract":"EIA-0138549-David Wallace-University of Michigan-SGER Planning Grant to Investigate the Incorporation of Born Digital Records into an EFOIA Request Processing System: Current Practices and Promising Technologies<br\/><br\/>This grant will support preliminary explorations in integrating 10 datasets, some digital and some paper, related to the modeling of the flow of freight carried by trucks, rail, and ship in the greater Los Angeles area. The collaboration will be between information scientists and experts in transportation planning and policy and will involve the collaboration of several government agencies.","title":"SGER: Planning Grant to Investigate the Incorporation of Born Digital Records into an EFOIA Request Processing System: Current Practices and Promising Technologies","awardID":"0138549","effectiveDate":"2002-02-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["259240"],"PO":["371077"]},"68189":{"abstract":"EIA-0136996<br\/>Francioni, Joan<br\/>Computing Research Association<br\/><br\/>Managing the Academic Career for Women Faculty at Undergraduate Computer Science and Engineering Institutions.<br\/><br\/>This award to the Computing Research Association (CRA), provides funds to support a workshop entitled \"Managing the Academic Career for Women Faculty at Undergraduate Computer Science and Engineering Institutions\". The workshop will be co-located with the ACM's conference on Computer Science Education (SIGCSE 2002) and will be organized by the CRA's Committee on the Status of Women in Computer Science and Engineering (CRA-W). The workshop is planned to provide faculty members in undergraduate education information and tools to build successful academic careers. Further, the workshop will provide mentoring activities targeting women in undergraduate teaching and research who face particular challenges in pursuing and maintaining academic careers at primarily undergraduate teaching institutions.","title":"Special Projects: Managing the Academic Career for Women Faculty at Undergraduate Computer Science and Engineering Institutions","awardID":"0136996","effectiveDate":"2002-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7427","name":"CCLI-EDUCATIONAL MATERIALS DEV"}}],"PIcoPI":["239558","208531","209556","239559"],"PO":["289456"]},"67485":{"abstract":"Min Wu<br\/>U of MD College Park<br\/>0133704<br\/><br\/>Having recognized that the advantages offered by the information technology era cannot be fully deployed without the guarantee on the security and protection of multimedia data, this project focuses on the investigation of multimedia security and information protection through two types of complementary signal processing techniques, namely, multimedia encryption and data embedding. The main function of multimedia encryption is to protect the confidentiality and thus performs access control, while data embedding or digital watermarking concerns how to associate a set of imperceptible data with the host media in a seamless way. The embedded data can be used to accomplish ownership verification or authentication even<br\/>after decryption.<br\/><br\/>The research component of this project involves three parts. The investigator first explores the protection of content confidentiality under three different levels of threats by designing and analyzing signal processing based encryption algorithms that are computationally efficient and easily compatible with lossy communications. In addition, new challenging problems of multimedia data hiding are studied based on a<br\/>layered algorithmatic architecture, and a software testbed is developed. Finally, the project investigates the joint use of encryption and data hiding as well as their interplay for providing comprehensive protection.<br\/>The educational component of this project focuses on two themes, namely, using multimedia as a powerful tool to enhance the productivity of multimedia education, and using carefully designed projects to provide<br\/>students with hands-on experience that will well prepare them for joining the future technical force of information technology. In addition to the curriculum development, the investigator makes special effort to nurture the under-represented students especially young women and to attract them to step into the EE\/CS disciplines.","title":"CAREER: Signal Processing Approaches for Multimedia Security and Information Protection","awardID":"0133704","effectiveDate":"2002-02-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["98543"],"PO":["564898"]},"66782":{"abstract":"The Design and Development of a Network Process Migration System<br\/><br\/>Intensive research has been done in process migration and mobility. However, most present successes are<br\/>based on safe-languages such as Java. While this safe-language approach provides a satisfactory solution for many applications, it has inherent limitations, especially for technical computing applications. During the last few years, the Principle Investigator (PI) and his research group have developed a set of methodologies to support heterogeneous process migration for high performance computing. This has included a practical data-collection-restoration methodology applicable to codes written in legacy languages such as C or Fortran, an effective data representation and transfer scheme for heterogeneous network environments, and a feasible<br\/>communication protocol for process coordination in a migration-supported dynamic environment. In this research, the PI proposes to further test these existing methodologies, develop a methodology for I\/O state<br\/>transfer, and explore the design of an integrated network process migration system to support process migration of legacy codes written in stack-based languages such as C, Fortran, or C++ in a heterogeneous <br\/>network environment.","title":"SOFTWARE : The Design and Development of a Network Process Migration System","awardID":"0130458","effectiveDate":"2002-02-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["557489"],"PO":["551992"]},"67541":{"abstract":"The dependability of critical systems is an increasing source of<br\/>concern. Modern software systems are routinely composed of millions of<br\/>lines of source, including \"legacy\" code from previous generations and<br\/>other vendors, yet critical Internet services and financial systems are<br\/>expected to exhibit \"four nines\" or \"five nines\" (99.99% or 99.999%)<br\/>availability. Vast prior evidence suggests that despite our best<br\/>efforts at achieving a correct design, complex systems can and will fail<br\/>in unpredictable ways, often resulting from unforeseen interactions<br\/>between well-tested components not designed to be used together. The<br\/>measured effects of such failures in the Internet arena are staggering,<br\/>and in mission-critical systems the costs could be measured in human<br\/>lives, as was nearly the case with bugs in the Patriot missile guidance<br\/>software used in the Gulf War.<br\/><br\/>Since unexpected failures do in fact occur even in the most careful<br\/>designs, this work proposes a new approach in which system design<br\/>focuses not only on fault avoidance, but on rapid recovery from<br\/>unexpected faults. In many cases, fault detection and recovery can<br\/>exploit relatively simple, well known techniques that have been proven<br\/>to work in keeping Internet systems highly available---despite their<br\/>very large scale, stressful workloads, and requirements of continuous<br\/>uptime in spite of high levels of software churn and integration of<br\/>legacy code. Software watchdogs and timeouts can catch unexpected<br\/>exceptional conditions; reactive or prophylactic process- or node-level<br\/>restarts can recover from or prevent transient errors resulting from<br\/>aging-related state corruption or unreclaimed resources; virtual machine<br\/>technology can effectively contain faults in complex software systems.<br\/>Although these mechanisms are simple, the challenge lies in determining<br\/>how software must be structured so that the mechanisms can be applied.<br\/>Similar techniques are well-known in the Internet protocol design<br\/>community and embedded-systems community, prior work from which has<br\/>inspired this approach.<br\/><br\/>Brown and Patterson have proposed the term \"Recovery-Oriented Computing\"<br\/>(ROC) to broadly describe the above philosophy. The primary goals of<br\/>the proposed work include the systematic investigation of ROC<br\/>engineering techniques to reduce MTTR (mean time to recovery) in complex<br\/>software systems, characterization of the properties of software systems<br\/>that make them amenable to ROC, and a set of design rules and<br\/>(re)structuring techniques for applying ROC to software systems.<br\/>Evaluation will include quantification of the trade-offs between<br\/>improvement in service availability and quality of service delivered to<br\/>users. Testbeds for the work include a ubiquitous computing environment<br\/>co-developed with the Stanford Interactivity Lab, and a prototype<br\/>COTS-based satellite ground station network co-developed jointly with<br\/>the Stanford Space Systems Development Lab.<br\/><br\/>The research is complemented by new course offerings and revision of<br\/>existing course offerings, at the graduate and undergraduate levels, to<br\/>refocus the software engineering curriculum on models closer to<br\/>industrial practice for building complex critical-infrastructure<br\/>systems. A new joint graduate course being co-taught with Prof. David<br\/>Patterson at UC Berkeley focuses on applying ROC to a variety of student<br\/>research projects across many domains. Proposed revisions to<br\/>advanced-undergraduate courses present Internet software systems<br\/>engineering as it is practiced in the field. In both cases, recognized<br\/>industrial researchers and practitioners are contributing both their<br\/>experience and concrete data that currently is nowhere published about<br\/>how complex systems really fail in the field.","title":"CAREER: Capturing the Lessons of Internet Services: Recovery Oriented Computing","awardID":"0133966","effectiveDate":"2002-02-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":[175014],"PO":["561889"]},"67552":{"abstract":"This research project will develop techniques and systems that answer the following question, independent of content type: \"What items have the highest probability of being both interesting and relevant to my information need?\" Whether or not an item (document, resource, etc) is \"interesting\" for a given information need will depend on the user's background and taste. Book and web page recommenders will be built and evaluated that predict relevance and interest based on content and interest ratings entered by each member of a large Internet community. A content rating indicates how much a user believes that a relationship exists between an item and a content attribute while an interest rating specifies the user's level of interest in an item. Affinities between users' interests and users' perception of content relationships will be leveraged to transfer recommendations implicitly between users. The career development plan involves a) the development of a graduate focus in \"Intelligent Information Systems,\" which allies approaches from artificial intelligence, information retrieval, and human computer interaction against problems of information overload, and b) development of a summer REU program with the goal of increasing the number of broadly educated US Citizens (particularly women) in Ph.D. computing graduate programs.","title":"CAREER: Collaborative Knowledge Spaces for Filtering Information","awardID":"0133994","effectiveDate":"2002-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V252","name":"NSA-KNOWLEDGE CAPTURE & MGMT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V463","name":"NSA-MEIDS PROJECT"}}],"PIcoPI":["255543"],"PO":["564456"]},"67475":{"abstract":"There is a growing scientific community working to provide solid<br\/>theoretical and algorithmic foundations for the study of communication<br\/>networks. This project furthers this goal through a combination of<br\/>research and education. In particular, it addresses theoretical and<br\/>algorithmic issues that arise in a central area of networking: the<br\/>efficient utilization of communication bandwidth. The research<br\/>component of this project addresses several different approaches for<br\/>the succinct representation of information in communication networks.<br\/>This includes the investigation of (a) the efficient use of<br\/>communication bits to provide accountability in the Internet (which is<br\/>a means of combating cyber-terrorism), (b) new approaches to<br\/>compression that arise in new communication technologies, and (c)<br\/>minimizing the amount of control information required to make<br\/>communication robust with respect to network faults. The integrated<br\/>educational objectives of this project include both graduate student<br\/>collaboration and curriculum development. The former consists of<br\/>student involvement with the research component of the project, as<br\/>well as organization of summer schools and workshops. The later<br\/>includes the incorporation of networking topics into a graduate level<br\/>algorithms course, as well as the development of a new advanced<br\/>graduate course addressing the algorithmic and theoretical challenges<br\/>and achievements in the area of networking.<br\/><br\/>For the research question of providing accountability in the Internet,<br\/>this project studies the IP Traceback problem: given a stream of<br\/>packets arriving at a node of the Internet, determine the source of<br\/>those packets. This is an important tool for dealing with denial of<br\/>service attacks, since accountability discourages such attacks and<br\/>provides an automated mechanism for halting attacks in progress. This<br\/>project studies probabilistic packet marking schemes for this problem,<br\/>with the goal of determining the optimal tradeoffs between the number<br\/>of marking bits used per packet, the number of packets required to<br\/>reconstruct the source information, and the number of simultaneous<br\/>sources of attack that can be dealt with. A number of new<br\/>technologies also present us with entirely new approaches to<br\/>compression. The resulting compression problems are fundamental, but<br\/>since the motivating technologies have a short history, these problems<br\/>have not been considered previously. In this project, we consider<br\/>compression problems that arise from three such technologies:<br\/>asymmetric communication channels, networks that are able to multicast<br\/>information efficiently, and the compression of the World Wide Web.<br\/>Finally, we also consider reducing bandwidth utilization by minimizing<br\/>the amount of control information required to make communication<br\/>robust against faults.","title":"CAREER: Algorithms for Efficient Bandwidth Utilization in the Internet","awardID":"0133664","effectiveDate":"2002-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["226157"],"PO":["499399"]},"66871":{"abstract":"EIA-0130828 -Bruce C. Wheeler-University of Illinois-BITS: Information processing in Designed Neuronal Circuits<br\/><br\/>BITS: Information processing in Designed Neuronal Circuits<br\/><br\/>The aim of this project is to enhance our understanding of information processing by small numbers of neurons arranged in designed circuits. This is an ideal time for this initiative because:<br\/><br\/>We can intentionally design neuronal microcircuits due to progress in serum free media to support relatively pure neuronal populations, in microlithgraphy as applied to the deposition of proteins and other biomolecules to surfaces, and in understanding of the conditions under which sparse pattern populations of neurons become functionally active in culture.<br\/><br\/>We can study the information processing capabilities of these neuronal circuits due to advances microelectrode array technology, permitting both stimulation and recording of electrical activity, as well as the supporting real-time data acquisition technology. <br\/><br\/>We can analyze the data utilizing theories of neural coding derived as applications of rich theoretical foundations in signal processing and communications theory.<br\/><br\/>We have three specific goals, creation of reliable, repeatable, robust neuronal circuits of cultured hippocampal neurons. Stable circuit behavior is essential to further investigation of information processing.<br\/><br\/>The first aim emphasizes geometric properties, including guiding axonal extension, the second aim emphasizes functional properties, and the third aim is neuronal information processing. Models to be evaluated include rate codes, precise timing codes and phase synchronization codes.","title":"Biological Information Technology Systems - BITS: Information Processing in Designed Neuronal Circuits","awardID":"0130828","effectiveDate":"2002-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[173364],"PO":["565223"]},"67774":{"abstract":"The proposed activities aim to create mathematical and computational methods for modeling large biological molecules. Computational simulation of dynamics and sampling of proteins, DNA, and nucleic acids promise to be a tool for understanding the relationship between structure and function, and for computer assisted drug design. Processes of interest include protein dynamics and folding and the study of other cellular components. Despite significant progress in the field, there is still a gap between the simulations that can be routinely performed with current technology and the complexity of processes and systems of biological interest. The proposed mathematical and computational methods will overcome the size and time scale limitations inherent in atomistic dynamics and sampling, while preserving the atomistic resolution of the biological systems. The new methods will be disseminated for research and educational purposes through an open source and scalable software framework called ProtoMol, and tested in a range of systems, from small proteins to potassium channels that reside in lipid bilayers. These new algorithms will translate into speedups of one or more orders of magnitude over current methodologies. This technology will enable simulations that are sorely needed in the expanding field of proteomics and the processing of data from the human genome project. To study dynamical processes, trajectories of large biomolecules are generated using molecular dynamics (MD). In an attempt to overcome the time scale limitations, multiple time stepping (MTS) integrators have been introduced. Nevertheless, even these methods have been limited by stability, and thus the time steps used in MD have not been dramatically increased. The PI proposes to devise multiscale algorithms for MD that are not limited by stability. To accomplish this goal, research will proceed in two phases: the _rst will extend the PI's work on stabler MTS numerical integrators by overcoming instabilities present in these methods. This will allow an estimated two- to eight-fold speedup over current methods for MD. The second phase involves the use of a symplectic semi-implicit method for MD using a splitting that separates cleanly many time scales, and incorporates the faster and less interesting ones in a more approximate manner. Speedups of two orders of magnitude or more are possible, depending on the degree of accuracy desired. This proposal will also tackle the related problem of statistical sampling. The large conformational space of biomolecular systems causes many difficulties to traditional sampling methodologies such as MD and Monte Carlo methods, or hybrids of both, all of which super performance degradation as the system size increases. We will use a biased hybrid Monte Carlo method that scales nearly linearly with system size. This will produce speedups of one or two orders of magnitude over MD, MC, or conventional hybrid MC methods. Synergy between this research project and teaching will occur at several levels. There will be an enhancement of materials of undergraduate and graduate courses taught by the PI, on data structures and applied algorithms, numerical methods, and computational methods for biomolecular modeling. Learning modules for engineering and science students will be developed in ProtoMol to facilitate an understanding of the behavior of large biological molecules.","title":"CAREER: Scalable Mathematical and Computational Models for Biomolecular Modeling","awardID":"0135195","effectiveDate":"2002-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["451806"],"PO":["565272"]},"67038":{"abstract":"EIA-0131554<br\/>Donald F. Norris<br\/>University of Maryland Baltimore County<br\/><br\/>Digital Government: Analysis of Barriers to Local Government Adoption of Digital Government and Strategies to Overcome the Barriers<br\/><br\/>This is a proposal to explore the uptake of IT by local government, in particular the provision of transactions and services over the Web, and identify solutions to hurdles which are found. Focus groups will be established consisting of local government Chief of Information Officers, Mayors and other elected and appointed individuals. This project is in collaboration with the Office of Telecommunications and Information Applications of the National Telecommunications and Information Administration, part of the US Department of Commerce.","title":"Digital Government: Analysis of Barriers to Local Government Adoption of Digital Government and Strategies to Overcome the Barriers","awardID":"0131554","effectiveDate":"2002-02-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["256630"],"PO":["371077"]},"72340":{"abstract":"EIA-0209878<br\/>Charles Stewart, III<br\/>MIT<br\/><br\/>Digital Government: Workshop on Election Systems Standards<br\/><br\/>This workshop is a logical successor to a Presidentially-mandated workshop on on-line voting, held in October 2000. The extremely close national election in November of 2000 elicited great interest in the voting process within the research community.<br\/><br\/>An outgrowth of that interest was a joint effort by Cal Tech and MIT to develop a prototype voting system, in the process surfacing many technical, legal, and social issues. This proposed workshop will build on that joint effort, to examine current voting systems standards, and develop possible research topics related to those standards.","title":"Digital Government: Workshop on Election Systems Standards","awardID":"0209878","effectiveDate":"2002-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["503787"],"PO":["371077"]},"67445":{"abstract":"The problem of data synchronization is inherent to systems that require consistency among<br\/>distributed information. In light ofthe vision of pervasive computing, in which any two mo-<br\/>bile or fixed computing devices would be able tointeract, data synchronization is increasingly<br\/>becoming an essential technology.<br\/>To date, most research on data synchronization has focused on database issues related to<br\/>con ict resolution. However, we feelthat current trends towards pervasive computing point<br\/>to communication becoming the primary bottleneck for synchronization. For example, the<br\/>Palm Pilot IIIxe, a popular and representative Personal Digital Assistant, can take even 20<br\/>minutes to synchronize with a desktop PC in certain practical scenarios. There are many<br\/>other diverse examples of the need for communication-aware data synchronization, including<br\/>synchronization of mobile data, resource discovery, and even reconciliation of nucleotide<br\/>sequences in DNA.<br\/>We intend to investigate practical data synchronization techniques that minimize com-<br\/>munication complexity, building upon a foundation of recent research connecting such tech-<br\/>niques to graph coloring problems and the design of error-control codes. These connections<br\/>allow for application of the latest results in these fields, such as the capacity-approaching Low<br\/>Density Parity-Check codes, to important synchronization issues. The synchronized schemes<br\/>we propose to research promise to be much faster and more general than those currently in<br\/>use, offering applications to fault-tolerance, file synchronization, and image comparison.<br\/>At the same time, we outline an ambitious, but attainable, educational plan based on<br\/>years of experience with a diverse body of students. Our goals include: 1) strengthening<br\/>ties with high schools through mentoring involvement in prize-based research programs; 2)<br\/>expanding involvement of undergraduates in the proposed research through targeted projects<br\/>and collaboration with graduate students; 3) enhancing graduate education through the use<br\/>of real-life projects and raw, unfinished research. We have already begun to work towards<br\/>these goals and describe some of our successes.","title":"CAREER: Practical Data Synchronization: Minimizing Communication","awardID":"0133521","effectiveDate":"2002-02-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["449083"],"PO":["432103"]},"67456":{"abstract":"CCR-0133580<br\/>CAREER: Automatically Generating Specifications to Improve Program Correctness and Maintainability<br\/>Michael D. Ernst<br\/><br\/>Ensuring software correctness, modifying software, and many other software<br\/>engineering tasks are greatly eased by the presence of specifications that<br\/>document program behavior. Unfortunately, specifications are usually<br\/>absent, leading to problems with program understanding and maintenance.<br\/>This research extends work in automatically generating (inferring) partial<br\/>program specifications from program executions. The research goals are to<br\/>detect conditional invariants (implications) that are true only sometimes,<br\/>to scale the technology, to enable online processing, to investigate new<br\/>inference strategies, to improve usability, to evaluate via experiments and<br\/>case studies, to integrate the techniques and tools into education, and to<br\/>transfer technology to industry. The research has three broad impacts: (1)<br\/>it explains, advances, and evaluates the theory and practice of automatic<br\/>generation of program specifications; (2) it enables easier, more<br\/>effective, and broader use of specifications, by automating generation of<br\/>partial specifications and by extending their scope to likely (as opposed<br\/>to guaranteed) properties; and (3) it applies specifications to specific<br\/>program tasks via new techniques and tools for program modification,<br\/>testing, reuse, and documentation. Evaluation includes theoretical<br\/>evaluations of the accuracy of the underlying techniques, case studies of<br\/>substantial software projects, and controlled experiments to determine the<br\/>efficacy of the resulting tools.","title":"CAREER: Automatically Generating Specifications to Improve Program Correctness and Maintainability","awardID":"0133580","effectiveDate":"2002-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["501796"],"PO":["562984"]},"67479":{"abstract":"The proposed research concerns computational principles of touch sensing in the context of part localization, model-based recognition, and shape reconstruction; it encompasses a number of areas of robotics - touch sensing, part orientation and localization, shape recognition, grasping, dextrous manipulation. The proposed localization scheme aims at determining the pose of an object with known geometry relative to the (robot) hand through contact. Algorithms will be developed for processing tactile data, computing geometric invariants, and registering them onto the object's surface. The education part of the project includes development of interdisciplinary courses with an emphasis on robotics and geometric computation.","title":"CAREER: Shape Localization, Recognition, and Reconstruction through Touch Sensing","awardID":"0133681","effectiveDate":"2002-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["409118"],"PO":["403839"]},"67436":{"abstract":"EIA-0133493 <br\/> Matsui, Hiroshi<br\/> CUNY Hunter College<br\/><br\/>Title: CAREER: Economical and Simple Fabrication of Quantum Dot-Electronics Using Biofunctionalized Protein Nanotubes as Building Blocks<br\/><br\/>The project involves a blending of molecular biology, nanotechnology, and materials physics, in an attempt to create a new class of electronics. A new architecture for nanostructures using biologically modified metal \/semiconductor coated protein ananotube and quantum dots are being created that will inherently be high speed, light weight, high stability, and low power consumption.<br\/><br\/>The architecture being used is a form of molecular self-assembly based on biological models. The protein nanotubes are formed from tubular peptide templates, which can be coated with various semiconductors, metals, and quantum dots. By functionalizing the end of the tubes with specific protein molecules, the nanotubes can use biological recognition, modeled after the biological antibody-antigen interactions, to attach the wire end to the appropriate substrate location. This strategy is at the center of the fabrication method being investigated. Designs of electronics devices are built into nanostructures by themselves, rather than having to be imposed afterwards using a patterning process. The functionality of this biological recognition is one of the major advantages as compared with other nanotubes. <br\/><br\/>The project is having a significant educational benefit for the graduate, undergraduate and high school students in this interdisciplinary research ranging from spectroscopy to materials characterization. A summer Nanotechnology laboratory course is being offered to talented high school students.","title":"CAREER: Economical and Simple Fabrication of Quantum Dot-Electronics Using Biofunctionalized Protein Nanotubes as Building Blocks","awardID":"0133493","effectiveDate":"2002-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["377652"],"PO":["521045"]},"66645":{"abstract":"The Domain Name System (DNS) is a hierarchically distributed<br\/>database that provides information fundamental to Internet<br\/>operations, such as translating between human readable host names<br\/>and Internet Protocol (IP) addresses. Due to the importance of<br\/>the information served by DNS, there is a strong demand for<br\/>securing communication within the DNS system. The current<br\/>(insecure) DNS does not prevent attackers from modifying or<br\/>injecting DNS messages. Users accessing hosts on the Internet<br\/>rely on the correct translation of host names to IP addresses by<br\/>the DNS. A typical attack, referred to as DNS spoofing, allows an<br\/>attacker to manipulate DNS answers on their way to the users.<br\/>If an attacker makes changes in the DNS tables of a single<br\/>server, those changes will propagate across the Internet as a<br\/>viral infection. Increasingly, DNS is also being used to perform<br\/>load distribution among replicated servers. For instance,<br\/>companies such as Akamai have used DNS to provide Web content<br\/>distribution. Moreover, there is consensus that since DNS is a<br\/>global and available database, it can be employed as a Public Key<br\/>Infrastructure (PKI) which would enable e-commerce applications.<br\/><br\/>Securing DNS means providing data origin authentication and<br\/>integrity protection. Existing proposals for securing DNS are<br\/>mainly based on public-key cryptography. In this proposal, the researcher<br\/>describes a new approach based on standard symmetric (or<br\/>secret-key) cryptographic techniques. The researcher introduces the concept of<br\/>DNS symmetric certificate that are used to create a trusted path<br\/>from the DNS root server to a server that is authoritative for a<br\/>portion of the DNS tree. This strategy is very similar to the one<br\/>introduced by Davis and Swick and symmetric certificates can be<br\/>seen as a sort of tickets in the Kerberos system which create a<br\/>trusted path from the authentication server to the destination<br\/>server going through the ticket-granting server. DNS symmetric<br\/>certificate are as manageable as public-key certificates with the<br\/>exception that they cannot be shared, which is not generally<br\/>required in the DNS system. The project solution enables a wide range of<br\/>secure services previously believed impractical or too difficult<br\/>to manage, such as mutual authentication and key revocation.<br\/>Moreover, the gain in terms of computational complexity, network<br\/>traffic, and storage requirements is impressive when compared<br\/>with public-key cryptography based approaches. The research has clear<br\/>ideas on how to define a secure DNS system based on symmetric-key<br\/>cryptography. The researcher proposes to build such a system and make public<br\/>the prototype implementation.<br\/><br\/>The second part of the proposed research, would focus on a still<br\/>unresolved problem: A DNS server represents a single point of<br\/>attack which could easily be compromised. The researcher would like to<br\/>investigate the possibility to distribute the role of a single<br\/>DNS server among several servers. The research proposes a proactive DNS<br\/>system that can survive component failures (whether malicious or<br\/>not) by combining standard techniques of decentralized storage<br\/>and dynamic self-maintenance. The researchers approach would allow DNS<br\/>servers to automatically recover from possible, undetected<br\/>break-ins and then maintain uninterrupted security. The researchers propose to<br\/>use the proactive security model, which provides a method for<br\/>maintaining the overall security of a system even when individual<br\/>components are repeatedly broken into and controlled by an<br\/>attacker, as long as not too many servers are compromised at the<br\/>same time. The approach employed by the proactive security model<br\/>is to first distribute the cryptographic capabilities among<br\/>several servers, next have the server periodically engage in a<br\/>refreshment protocol. Information gathered by an attacker before<br\/>a refreshment period becomes useless to attack the system in the<br\/>future. The researcher proposes to define, and build, an architecture that<br\/>combines decentralized storage system technologies, data<br\/>redundancy and encoding, and dynamic self-maintenance to create<br\/>survivable DNS servers based on the proactive security model.","title":"Secure and Proactive DNS","awardID":"0129627","effectiveDate":"2002-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["339640"],"PO":["564246"]},"66887":{"abstract":"EIA-0130874 -John Yin -University of Wisconsin -Genomic Information Processing by a Virus-Host System<br\/><br\/>The proposed research aims to advance biologically inspired computing by providing insights into the mechanisms and dynamic of genomic information processing for an experimentally well-characterized system. The system of study will be a computer simulation for the growth of bacteriophage T7 in Escherichia coli, a model virus-host system that integrates genetic, physiological, biochemical, and biophysical laboratory data spanning more than 30 years. The overarching aim of the study will be to identify and characterize modular features of integrated information processing during the simulated intracellular growth of the virus. More specifically, the work will entail defining measures of system performance under different host resource environments, quantifying the sensitivity of this performance to perturbations of pair-wise and higher order interactions between genetically-encoded functions, and extracting from these studies patterns of interaction that reflect modular features of biological information processing.","title":"Biology & Information Technology Systems: Genomic Information Processing by a Virus-Host System","awardID":"0130874","effectiveDate":"2002-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["299213"],"PO":["565223"]},"67459":{"abstract":"The goal of the project is to bridge the gap between human and machine vision by designing active vision systems modeled after neurobiology. Such systems can benefit from the ability to make eye, head, and body movements for active sensing, and can learn robust models of the visual world directly from interaction with the environment. Computational models of active vision will be formulated within the context of neurobiological data, addressing the problems of object identification, detection, attention, tracking, modeling self-motion, and oculomotor learning. An anthropomorphic real-time binocular active vision system will be designed based on commercially available camera platforms and real-time image processing hardware. The performance of the approach will be evaluated on both wheeled and legged robots in tasks involving visual navigation and multi-robot collaboration. The education part of the project includes development of an interdisciplinary curriculum in computational neuroscience.","title":"CAREER: Neurally Inspired Active Vision: Theory, Models, and Applications in Mobile Robotics","awardID":"0133592","effectiveDate":"2002-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":["550053"],"PO":["317663"]},"66844":{"abstract":"EIA 0130746-Giles J. Laurent-California Institute of Technology - Biological computation in olfactory systems: experiments, theory and analog circuit modeling<br\/><br\/>Pattern recognition (e.g., face, voice recognition) remains one of the most difficult problems for computer science. Odors are complex physical objects (blends of molecules) and yet, are perceived as singular objects (e.g., coffee, jasmine); because olfactory circuit designs appear similar across animal species (from insects to mammals), olfaction constitutes a potentially ideal system to identify key solutions to pattern recognition. The investigators are an interdisciplinary team from Biology, Physics, Computer Science and Electrical Engineering from Caltech and from the University of California-San Diego. They are investigating the basic computational principles of olfactory processing and recognition in animals, with the long-term goal to build \"intelligent\" pattern storage and recognition devices, designed using rules inspired by neurobiology.<br\/><br\/>We plan to study how to build simple and later, scale up, both in number of processors and in frequency, \"electronic antennal lobes and mushroom bodies\" so that one might, in the future, adapt and exploit the design of biological pattern recognizers and provide new computational paradigms for human uses.","title":"Biological Information Technology Systems - BITS: Biological Computation in Olfactory Systems: Experiments, Theory and Analog Circuit Modeling","awardID":"0130746","effectiveDate":"2002-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[173279],"PO":["565223"]},"66756":{"abstract":"EIA-0130352-Robert Kozma-University of Memphis-Percolation Model of Phase Transitions in the Central Nervous Systems during Perceptual Information Processing <br\/><br\/>The proposed research will explore the close link between pattern-based information processing using dynamical memories and percolation phenomena. Percolation models have been used to analyze a wide range of processes in physics and electronics, and in biological and ecological systems. In the last decade and a half, many variants of the standard percolation models have been studied. In particular, there has been much work on the family or processes known as bootstrap percolation. Computer experiments performed by physicists have suggested interesting non-trivial models. The solid mathematical theory of percolation in lattices to lay down the foundations of dynamical memories and the related phase transitions will be applied.","title":"Percolation Model of Phase Transitions in the Central Nervous Systems during Perceptual Information Processing","awardID":"0130352","effectiveDate":"2002-02-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":[173039,"541501","546530","541502"],"PO":["521045"]},"67438":{"abstract":"CCR-0133502<br\/>CAREER: Delphin: Functional Programming in Logical Frameworks<br\/>Carsten Schuermann<br\/><br\/>Data structures such as lists, trees, graphs, arrays along with<br\/>operations on them are one of the most studied concepts in computer<br\/>science and supported by most modern programming languages. Theorems,<br\/>proofs, and derivations on the other hand have elegant representations<br\/>in expressive logical frameworks but lead in general to complicated,<br\/>convoluted, and ultimately unreliable encodings even in modern<br\/>programming languages.<br\/><br\/>The proposed Delphin project engages in fundamental research on how to<br\/>bring together the computational features of programming languages<br\/>with the representational features of logical frameworks. In Delphin<br\/>programmers can write automated theorem provers, interpreters, and<br\/>compilers with elegant and compact data objects representing typing<br\/>derivations (for compilers), proofs (for proof carrying code), and<br\/>computation traces (for abstract machines). The proposed project<br\/>employs techniques from higher-order theories, dependent types,<br\/>meta-logical frameworks, and functional programming languages.<br\/><br\/>Delphin will shed some light on the epistemological tension between<br\/>abstract concepts and their representations; and it will provide<br\/>answers concerning their manipulation. Moreover, it will open up new<br\/>research areas of how to incorporate logical framework technology into<br\/>other mainstream programming languages such as Java and C#.","title":"CAREER: DELPHIN: Functional Programming in Logical Frameworks","awardID":"0133502","effectiveDate":"2002-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["226192"],"PO":["564388"]},"66625":{"abstract":"Much good Internet research is being frustrated by an inability to<br\/> deploy experimental router software at points in the network where it<br\/> makes most sense. This problem affects a wide range of research,<br\/> including routing protocols themselves, active queue management<br\/> schemes, and so-called \"middlebox\" functionality such as intrusion<br\/> detection systems. Research becomes unrealistic because of the<br\/> difficulty of experimenting under real network conditions; often ideas<br\/> never make it out of the network simulator.<br\/><br\/> To address these problems, the XORP project will develop a complete<br\/> open-source router software platform, from forwarding path to routing<br\/> protocols, using an architecture that permits extensibility whilst at<br\/> the same time providing stable well-performing basic router<br\/> functionality. The vision is of an integrated router software<br\/> platform running on off-the-shelf hardware, that is sufficiently well<br\/> performing and reliable to see production service in a wide range of<br\/> network conditions. The software architecture will be designed with<br\/> extensibility in mind from the start. The goal is for Internet<br\/> researchers needing access to router software to have a common<br\/> platform for experimentation; this will provide all the basic router<br\/> functionality that the researcher can then use to perform measurements<br\/> or augment with new protocol functionality.","title":"An eXtensible Open Router Platform (XORP)","awardID":"0129541","effectiveDate":"2002-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V544","name":"DARPA-XORP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["184210","259985"],"PO":["7594"]},"67516":{"abstract":"Programming for distributed object computing systems is complicated by the fact that objects persist and interact with a number of other objects in the system. When programmers change and evolve their objects, the ramifications are felt by clients in other parts of the system, not just within the application that is being programmed. Therefore, distributed object programmers require mechanisms to manage this evolution and make it known to other objects in the system.<br\/>The dynamically configurable distributed object (DCDO) model is a first step toward managing evolution in distributed object systems. The DCDO model, implemented within the Legion grid computing system, helps enable object evolution and facilitate the development of distributed objects from multiple independent implementation components. Using DCDOs, programmers can evolve existing active objects to accept new member functions, to change the interface and behavior of their member functions, and to remove member functions from their external (public) or internal (private) interface. Programmers can make these changes on the fly, without deactivating any part of the system, without replacing binary exe-cutables, without interrupting the clients of evolving objects, and without having to know what the changes will be at the time the objects are initially compiled and run. The model supports evolution management strategies that define when and how object types evolve from one version to the next, and determine when a type change is propagated to existing instances. The evolution management strategies built into the DCDO model are a good start toward managing change, but they are not sufficient. Programmers require a more general purpose mechanism for defining how objects can change, and for restricting how evolutions can take place. The research described in this proposal will address this problem. In particular, we will make the evolution characteristics of an object a first class entity in the distributed system, so that it can be read by other objects, which can then behave appropriately based on how their peers have evolved and may evolve in the future. Clients will be able to read the evolution histories of servers, and will be able to determine the restrictions, if any, that are placed on future server evolution. Further, clients will be able to register call-back functions with servers in order to be informed when changes take place. When they do, the clients can be given some control over when and how the changes can be carried out. In some cases, a client may be able to veto an evolution operation, or delay it until the client has finished its current application. This functionality is implemented in terms of a protocol that is initiated by the call back functions among the clients who have registered interest in the evolution operation. This begins to address the problem of implementations changing out from under clients that are built to support a different interface. In another important part of the research, we will study how real applications change over time, in order to effectively design evolution management strategies and constraints. We will include a wide range of different applications in the study, including the core Legion objects themselves, high performance scientific applications, and distributed collaborative environments. In the educational component of the proposed program, we will implement the Student Centered Applied Learning through Industry Projects (SCALIP) program. In this program, students work with local industries to define class projects for other students in future instantiations of core graduate courses.","title":"CAREER: Supporting Evolution in Distributed Object Computing Systems","awardID":"0133838","effectiveDate":"2002-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["553586"],"PO":["565272"]},"67429":{"abstract":"Data mining is the process of automatically extracting useful information hidden in large data sets. This emerging discipline is becoming increasingly important as advances in data collection have lead to the explosive growth in the amount of available data. This project aims to develop a wide-range of novel data mining algorithms suitable for the characteristics of scientific data sets arising in genomics and fluid dynamics. Our research will focus on developing algorithms both for sequential datasets and for datasets that can be represented by directed labeled graphs. The graph-based modeling enables us to capture in a single and unified framework many of the spatial, topological, geometric, and other types of relational characteristics present in scientific datasets. The specific research tasks that we plan to address are: (i) Development of scalable algorithms for finding frequently occurring patterns in graph data sets and algorithms for finding patterns whose frequency decreases as a function of the pattern-length. (ii) Development of scalable and high quality clustering algorithms for sequence and graph data sets which operate directly in the native feature space. (iii) Development of scalable and accurate classification algorithms based on automated sequential or relational feature extraction approaches. These algorithms will be validated by analyzing data sets arising<br\/>in genomic and turbulent fluid flow. The project integrates the data mining research with an educational plan that focuses on initiating undergraduate and graduate students to the various computational and data analysis aspects of genomic research and developing a comprehensive bioinformatics curriculum whose goal is to foster multi-disciplinary research and collaboration. In addition, a comprehensive set of software tools will be developed and made available that can be used both to train students in using data mining techniques and to conduct novel research expanding the levels of understanding in various scientific disciplines.","title":"CAREER: Scalable Algorithms for Knowledge Discovery in Scientific Data Sets","awardID":"0133464","effectiveDate":"2002-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["531622"],"PO":["565272"]},"72699":{"abstract":"In the future, communications systems are expected to be characterized as<br\/>ubiquitous, pervasive, very mobile, and highly distributed, among other at-<br\/>tributes. In contrast to current systems, such as cellular systems or the<br\/>current Internet, the reliance on central network components will be much<br\/>reduced and ad hoc methods for forming networks will become more preva-<br\/>lent. Additionally, the number of connected devices, including both sensors<br\/>and actuators as well as processors, will increase dramatically and many<br\/>network devices will operate autonomously. Massive quantities of data of<br\/>various highly structured formats will need to be accessed and distributed<br\/>across these networks. Wireless and wireline systems will interconnect with<br\/>optical fiber and free space communications media.<br\/>This workshop is intended to bring together a distinguished group of<br\/>research scientists\/educators and industry and government experts to discuss<br\/>and identify critical research in communications to support this vision. The<br\/>workshop will provide an opportunity to interact with experts from related<br\/>fields, primarily computer science, working on different aspects of future<br\/>communication systems. A list of invitees for this workshop is provided in<br\/>the appendix.<br\/>The workshop aims to identify research challenges and opportunities as-<br\/>sociated with the emerging vision for future communications systems. We<br\/>expect a report to come out of the workshop reflecting the themes discussed.","title":"Proposal for a Workshop on Research Directions for Communications After the Internet and Cellular Systems","awardID":"0211487","effectiveDate":"2002-02-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[188391,"511513"],"PO":[188393]},"65868":{"abstract":"This proposal will support a workshop of researchers in medical informatics, database systems,<br\/>health care issues, and clinical information systems to discuss the use of clinical records in medical and computer science research. It will address issues in system interoperability, user needs, privacy,<br\/>security, economic issues, and most importantly national needs and opportunities with respect to the very rich medical information base in clinical records.","title":"Workshop: Transformation of Clinical Research and Health Care Through Information Technology, Washington, DC","awardID":"0126259","effectiveDate":"2002-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[170530],"PO":["433760"]},"66859":{"abstract":"EIA-0130797 -Harvey Rubin-University of Pennsylvania-Modeling and Analysis of Biological and Information Networks <br\/><br\/>The overall goals of our research are to: 1) create enabling technologies and experimental systems that are necessary to understand and predict the integrated functions of two bacterial sensing and regulatory networks--porim osmo-regulation in E.coli and oxygen sensing regulation of DNA synthesis in Mycobacterium tuberculosis; 2) model and abstract principles of organization, design control and coordination of biological systems. We believe that a better understanding of networked, hybrid models in biology will provide deeper insights into networked, embedded systems. No systematic approach to designing and developing such hybrid systems exists today.<br\/><br\/>Our research on the porin osmo-regulatory system in E. coli will investigate crosstalk between the porin osmo-regulatory system and other signaling systems. We suggest that the ability of the sensing element of the system, EnvZ, to act as both a kinase and phosphatase is crucial for the control of information flow and to minimize crosstalk. We will extend our models in a related series of experiments on the PhoQ\/PhoP two component systems, which responds to changes in the extracellular magnesium concentration. Since the levels of the histidine kinase PhoQ and response regulator PhoP are modulated by the concentration of phosphorylated PhoP, we will be able to establish the effect of this feedback and its influence on robustness of the overall system behavior.","title":"Biological Information Technology Systems - BITS: Modeling and Analysis of Biological and Information Networks","awardID":"0130797","effectiveDate":"2002-02-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["309636","553286","461485","497082","526896"],"PO":["565223"]},"56905":{"abstract":"The researchers are working to develop general tools to diagnose end-to-end<br\/>performance problems of advanced network applications on<br\/>high-speed research networks. This tool development will be grounded<br\/>in addressing the needs of two representative applications,<br\/>one with bulk throughput requirements and one with interactive<br\/>requirements. The researchers capitalize on the existing Surveyor infrastructure and<br\/>will work with other NSF-funded projects (both applications and<br\/>measurement), coordinating closely with the Internet2 End-to-End<br\/>Performance Initiative to ensure the results continue to be<br\/>used past the expiration of this grant for problems facing<br\/>higher-education.","title":"Targeted Assistance and Instrumentation for Internet2 Applications","awardID":"0090136","effectiveDate":"2002-02-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["239096","452007"],"PO":["250082"]},"70985":{"abstract":"EIA-0204796 <br\/>Steckler, Nicole<br\/>Oregon Graduate Institute<br\/><br\/>SGER: Organizational Facilitators and Inhibitors to Information-Sharing Across Federal Agency Boundaries<br\/><br\/>This small grant will study the organizational facilitators and inhibitors to sharing of information across government agencies. This testbed is an existing multi-agency group working on the topic of Adaptive Management Areas of the national forests in the Northwest US. Participating agencies are the US Department of Agriculture and the US Department of the Interior. This multi-agency group also collaborates on a multi-agency portal with another Oregon Graduate Institute grantee of the Digital Government program, thus providing a natural collaboration between the disciplines of computer science and social science.","title":"Organizational Facilitators and Inhibitors to Information-Sharing Across Federal Agency Boundaries","awardID":"0204796","effectiveDate":"2002-02-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["533018",183718,183719],"PO":["371077"]},"66839":{"abstract":"EIA-0130708-Mikhail I. Rabinovich-University of California-San Diego -Title: Principles of Information Dynamics in Basic Neural Circuits: A Hybrid System Approach<br\/><br\/>Hybrid systems: biological neurons interacting with electronic model neurons via electronic or computer simulated synapses can be a powerful approach for understanding basic neural computational principles and for building small hybrid and artificial processors that will create new perspectives for modern information technologies.<br\/><br\/>Based on our previous studies on neural dynamics in living cells, computer models and analog electronic implementations of model neurons and connections, we are planning to work in two directions: (i) we will explore the main principles of information processing that uses dynamical elements, i.e. neurons, synapses and small neural circuits; and (ii) we will reconfigure real biological networks by utilizing electronic neurons and synapses in order to transform such circuits into controllable information devices with new functions and new abilities.","title":"Biological Information Technology Systems - BITS: Principles of Information Dynamics in Basic Neural Circuits: A Hybrid System Approach","awardID":"0130708","effectiveDate":"2002-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[173264],"PO":["521045"]}}