{"186450":{"abstract":"Free Space Optics (FSO) provide a cost-effective, license-free, high-bandwidth and long-range solution to meet the escalating demand for wireless network capacity and scalability. This project aims to develop technologies for robust FSO networks from the network and cross-layer optimization perspective. Various network dynamics will be addressed with the following approaches. (i) For dynamics at large timescales, network planning and topology optimization will be investigated based on the concept of algebraic connectivity. (ii) For mid-timescale dynamics, effective load balancing and adaptive multipath routing will be developed. (iii) For small timescale dynamics, channel estimation will be investigated to enable rate adaptation and optimal receiver design. Wavelength diversity will also be exploited for the diversity-multiplexing tradeoff.<br\/><br\/>If successful, this project will enable scalable wireless access networks with multi-gigabit rates, to accommodate the predicted increase in wireless data. Project outcomes will be disseminated and incorporated into the Auburn University Wireless Engineering curriculum. The PIs will strive to involve REU students, and to participate in Auburn?s TIGERs Camp for outreach to K-12 students. The PIs have collaborations with an HBCU on research, curriculum, and recruiting minority graduate students.<br\/><br\/>This is a timely project given the imminent explosive increase in wireless data. This project is of high risk, due to the lack of measurement data in the public domain and the novel approach taken in this research. This project is also of high payoff. If successful, it can bring about the much needed technologies for high rate, long distance, and scalable wireless access networks.","title":"EAGER: An Exploratory Study Toward Robust Free Space Optical Networks","awardID":"1145446","effectiveDate":"2012-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550958","540567"],"PO":["565303"]},"186054":{"abstract":"With different gaseous pollutants collectively responsible for an estimated 41,200 annual deaths in the U.S. air quality monitoring becomes an imperative for the health and well-being of the population. The project GENIUS (for Green sEnsor Networks for aIr qUality Support) aims at building a continuously operational pollution monitoring network through proposing advancements in sensor hardware, communication protocols, analytical models with the goal of realizing self-sustaining sensor nodes.<br\/><br\/>The design of an integrated sensor combining an on-demand wake-up radio and energy harvesting technologies is a key contribution of this research, enabling the deployment of energy neutral sensor networks for pollution monitoring that are virtually perennial. GENIUS revisits the network protocol stack in light of this new node architecture. Techniques for jointly optimizing duty cycles based on energy prediction, the choice of energy storage components, as well as finding routes that ensure the highest throughput for a given energy availability are being explored in this work. Moreover, Òpollution mapsÓ using novel spatio-temporal data modeling tools are integrated with the protocol design to improve the operational performance.Ê<br\/><br\/>Energy neutral sensor networks will impact many different applications, such as environmental, structural, and patient health monitoring, where deployed sensors are not easily accessible. The project also involves international collaboration with India, giving an opportunity for U.S. students and researchers to interact with their Indian counterparts, conduct joint experiments, and develop mutually beneficial research strategies to combat the global challenges posed by air pollution.","title":"PC3: Collaborative Research: GENIUS: Green Sensor Networks for Air Quality Support","awardID":"1143681","effectiveDate":"2012-01-01","expirationDate":"2014-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[499280,"540006"],"PO":["563661"]},"187165":{"abstract":"Large-scale virtualized hosting infrastructures have become the fundamental platforms for many real world systems such as cloud computing infrastructures, enterprise data centers, educational computing platforms, and data-intensive computing systems. However, due to their inherent complexity and sharing nature, hosting infrastructures are prone to various performance anomalies caused by software bugs or hardware failures. <br\/><br\/>The overarching objective of this proposal is to systematically explore innovative runtime reliability management techniques for large-scale virtualized hosting infrastructures. Our research focuses on handling performance anomalies in distributed systems that are often very difficult to reproduce offline. The PI plans to combine the power of online learning, knowledge-driven first-response recovery, and in-situ diagnosis to handle unexpected system anomalies more efficiently and effectively. She aims at transforming the runtime system anomaly management from a trial-and-error guessing game into an efficient knowledge-driven self-healing process.<br\/><br\/>Techniques developed in this project will generate significant impact on improving the reliability and diagnosability of many real world hosting infrastructure systems. The PI plans to develop new course modules and programming courseware based on the research prototype developed in this project. The prototype developed in this project will be applied to the Virtual Computing Lab at NCSU, an educational computing platform for K-12, community colleges and universities. She will also disseminate her results and collected data broadly through publication and technology transfer. Developed software artifacts and experimental datasets will also be released for public use.","title":"CAREER: Enable Robust Virtualized Hosting Infrastructures via Coordinated Learning, Recovery, and Diagnosis","awardID":"1149445","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[502081],"PO":["563661"]},"196241":{"abstract":"For this research project highly sensitive Single wall carbon nano-tubules (SWNTs)are deposited by chemical vapor deposition (CVD) techniques on the surface of novel contour-mode AlN piezoelectric MEMS\/NEMS resonators to form batteryless acoustic sensor wireless platforms for the detection of different gas species. A circuit will detect a particular species by finding differences between the resonant frequencies of micro\/nanoresonators loaded with carbon nanotubes and decorated with inkjet deposited ss-DNA sequences. A high degree of specificity will result from the sequence dependent adhesion between the volatile organic molecules and the resonators. After a few seconds, the organic molecules will detach from the DNA enabling built-in reset as the environment changes. The RF interface electronics will periodically report these changes to an external interrogator. The resonant aluminum nitride (AlN) contour-mode sensor platform functionalized by combinations of single stranded DNA on single wall carbon nanotubes that is proposed here will permit several orders of magnitude enhancement of state-of-the-art sensor performance. Specifically, the new platform will make possible: (i) 10x reduction in the false alarm rate, (ii) 1,000x improvement in sensitivity (from part per billion to part per trillion thanks to extremely small resonant mass and high frequency of operation), (iii) 1,000x reduction in size for 100 analytes detection in a small volume, (iv) 200x power savings, (v) faster response time (< 5 seconds thanks to self-refreshing sensor), (vi) dramatically reduced fabrication costs (thanks to batch production), (vii) remote operations (resonator as RFID tag) and (viii) almost zero operating expenses (thanks to the disposable nature of the sensor).","title":"WIRELESS ORGANIC CHEMICAL SENSOR (15P07HNWLBauh)","awardID":"1237960","effectiveDate":"2012-01-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}}],"PIcoPI":["555639"],"PO":["565136"]},"186286":{"abstract":"People can perform with ease many tasks that remain difficult or impossible for computers, including vision, motion planning, and natural language understanding. New \"crowdsourcing\" platforms like Amazon's Mechanical Turk make it easier than ever to harness human computational power by streamlining job posting, tracking, and payment for workers. However, the lack of automation means that crowdsourcing currently does not scale up. Low quality results must be filtered out, but checking human computations can be difficult. Economic incentives and anonymity expose crowdsourcing to fraud. Deciding how much to pay workers for particular tasks and how many workers to hire remains an art.<br\/><br\/>This project introduces crowdprogramming, an approach that fully integrates human and digital computation. In crowdprogramming, humans are modeled as function calls in a standard programming language. This approach lets programmers focus on programming logic, while the crowdprogramming runtime system manages the critical tradeoffs between cost, time, and data quality. Crowdprogramming will dramatically lower the barriers to harnessing human computational power. It will enable a rich new class of applications that divide labor between digital and human computations, where computers and humans do the work each does best. It will enable complex orchestration of human computations, automatically control quality to maintain high accuracy and avoid fraud, and schedule tasks and adjust payments to maximize speed while staying within budget. By streamlining the incorporation of human labor into computation, crowdprogramming has the potential to add an entirely new job sector to the economy.","title":"EAGER: Programming the Crowd","awardID":"1144520","effectiveDate":"2012-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["562740"],"PO":["564388"]},"186089":{"abstract":"ISVD 2012 will be the continuation of a highly successful and innovative series of conferences within the geometric modeling and computer graphics disciplines. The eight previous events were held in Tokyo, Japan; Seoul, Korea; Banff, Canada; Kiev, Ukraine; Copenhagen, Denmark; Quebec City, Canada, and Quin Dao, China. While many conferences in the areas of computational geometry, computer graphics and engineering have touched some topics covered by the proposed event, it is only recently that the Voronoi diagram research has formed into a separate discipline and the unique forum on Voronoi Diagrams in Science and Engineering was created.<br\/><br\/>The goal of the International Conferences on Voronoi Diagrams in Science and Engineering is to concentrate specifically on unique aspects of the research into the Voronoi diagrams and on practical applications of this research to manufacturing engineering, VLSI design, communication, geomatics, GIS (geographical information systems), urban planning, medicine, bioinformatics, high-performance computing, education and other applications. Another unique aspect is that this year will also feature a Voronoi Art Symposium that runs concurrently with the conference and showcases artistic drawings and interpretations of the Voronoi concept. This event, without a doubt, bridges the gap between Sciences and Arts.","title":"Application for Grant to support ISVD2012, the 9th International Symposium on Voronoi Diagrams in Science and Engineering, July 2012","awardID":"1143838","effectiveDate":"2012-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[499376],"PO":["565157"]},"196496":{"abstract":"Nowadays, a burgeoning amount of data is made available continuously. Example sources include various sensors, RFID, computer network traffic, phone conversations, and web searches. Much of this data is noisy, inconsistent, or even erroneous. Compared to deterministic data, uncertain data carries more information. Forcing uncertain data to be deterministic (e.g., by taking the expectations) can cause significant information loss in query results, possibly leading to wrong judgments for queries that aid decision making. Moreover, real-time decisions based on these data can have a significant impact on the quality of life, on the economy, and on our security. However, fast and real-time processing of uncertain data is a difficult problem. The broad goal of the RURAL (querying Rich Uncertain data in ReAL time) project is to provide techniques that make this query processing task feasible. To achieve this goal the project includes: (1) integrating data cleansing, distribution learning, and query processing through pipelining; (2) developing fast and online query processing algorithms on uncertain data; (3) providing a rich treatment of uncertain data distributions including compression, sharing, and gauging their reliability; (4) using predictive models to infer uncertain data distributions; and (5) answering top-k queries with consideration of typicality of results.<br\/><br\/>The RURAL project extends the state of art in real-time query processing of uncertain data for decision-making. It is used by the Kentucky Transportation Center for the application of dynamic traffic routing and control, and by the Biomedical Division at the University of Kentucky for real-time monitoring applications. The research results are integrated with education through class projects in Computer Science graduate courses at the University of Kentucky and tutorials at conferences. Further information on the project can be found on the project web page: http:\/\/protocols.netlab.uky.edu\/~ge\/projects\/rural.","title":"III: Small: Rural: Querying Rich Uncertain Data in Real Time","awardID":"1239176","effectiveDate":"2012-01-20","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["550480"],"PO":["563727"]},"187256":{"abstract":"Social, technological, information and biological systems can be studied as graphs, where nodes represent entities (i.e., people, websites) and edges represent interactions (friendships, communication). The project aims to analyze and discover explanatory and predictive models of networked systems, such as large groups of people and societies, or large biological and technological systems, in order to understand their structure and make predictions about their global dynamics.<br\/><br\/>The research studies the structure and dynamics of communities of nodes, with the goal to invent novel network community detection methods and build predictive models of behavior of groups of nodes. The proposed research has three main thrusts: (1) Structure and discovery of network communities, (2) Dynamics and \"health\" of network communities, and (3) Supervised community detection in networks with rich node and edge metadata. The research focuses on harnessing massive network datasets, as certain behaviors and patterns are observable only when the amount of data is large enough. The intellectual focus of the project is on increasing the expressivity of the models to also include rich node and edge metadata and explore the connections between the network structure and the attributes\/features of nodes and edges.<br\/><br\/>The education plan provides for rich research experiences and helps students develop the interdisciplinary attitudes and skills needed for this work through courses that look at real-world network problems and data. An integral part of this proposal is public release of datasets and computational tools for analysis of large networks. Additional information about the project including publications, data sets, source code, and educational materials can be accessed through the project website at http:\/\/snap.stanford.edu.","title":"CAREER: Mining structure and dynamics of groups of nodes in real-world networks","awardID":"1149837","effectiveDate":"2012-01-15","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["507065"],"PO":["565136"]},"187267":{"abstract":"This project expands classical information and coding theories to the interactive communication settings. Information and coding theories give us a near-perfect understanding of the capacity of networks, such as the Internet or mobile networks, to transmit information. This understanding however, is generally limited to the non-interactive setting: there is a sender and a receiver and the goal is to transmit a message from the sender to the receiver as quickly and reliably as possible. In recent years, applications such as cloud computing gave rise to interactive communication problems, where the goal is to implement a whole functionality over a communication channel, rather than just transmit data. The investigators study fundamental questions surrounding extending information theory approaches to interactive problems. The project aims to establish the limits of interactive computation, as well as to develop new encoding algorithms that make interactive computing more efficient.<br\/><br\/>The key technical concept being developed by the investigators is that of information complexity. Information complexity is the natural generalization of Shannon's entropy to interactive problems. Shannon's entropy measures the amount of information contained in a random message. Interactive information complexity measures the amount of information contained in the interactive computation, as perceived by the participating parties. The project develops this concept to address problems in communication complexity, such as direct sum theorems, multi-party communication complexity, and hardness amplification. More broadly, the investigators develop techniques for applying information theory to computational complexity, with the aim of expanding the technical toolbox available to attack fundamental problems in complexity theory.","title":"CAREER:Coding and Information Theory for Interactive Computing","awardID":"1149888","effectiveDate":"2012-01-15","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["516903"],"PO":["564924"]},"193031":{"abstract":"This grant provides NSF support to broaden participation in the Sixteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS 2012), to be held in London, UK in March 2012. ASPLOS is the premiere forum for research involving the interaction of computer architecture, compilers, and operating systems. It brings together leading researchers from these diverse communities to one conference offering opportunities to interact across traditional disciplinary boundaries. This proposal aims to increase the impact of this conference by enabling participation by additional students and faculty for whom travel support would otherwise preclude their attendance. Priority for these funds will be given to defray the travel expenses of under-represented groups.","title":"Travel Support for the Conference on Architectural Support for Programming Languages and Operating Systems","awardID":"1216358","effectiveDate":"2012-01-01","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["555936"],"PO":["564388"]},"185167":{"abstract":"The University of Colorado proposes Computational Thinking for Teaching Computing (CT4TC) to develop a Computational Thinking (CT) empowered 21st century workforce by extending and validating the the research base of an iDREAMS strategy project. The iDREAMS project developed the Scalable Game Design curriculum that has been embedded in existing courses and used to introduce students to computational thinking through game and STEM simulation design. CT4TC will explore the influence of mediation as a pedagogical and scaffolding approach employed by teachers to implement Scalable Game Design curriculum, and assess subsequent impact on student motivation, performance and ownership.<br\/><br\/>This effort will have two expected outcomes. First, CT4TC will verify a theory of broadening participation in computing. The project staff will explore the influence of mediation as pedagogical and scaffolding approaches employed by teachers as they implement Scalable Game Design curricula, and assess subsequent impact on student motivation, performance and ownership. Gender and ethnicity-specific effects of scaffolding approaches employed by teachers will be systematically researched and validated. Second, CT4TC will deliver CT education with measurable learning outcomes. Measurable learning outcomes are essential to an iterative design approach based on providing feedback to professional development models. The Computational Thinking Pattern Analysis, developed by the iDREAMS project, employs a unique Latent Semantic Analysis inspired mechanism of computationally analyzing games and STEM simulations submitted by students.<br\/><br\/>The project will bring CT education to K-12 students in tech hub, urban, remote rural, and Native American communities. The focus of this investigation will be at the middle school level in computer education and STEM (mostly Science and Math) courses.","title":"Type II: CT4TC - Computational Thinking for Teaching Computing: Validating a Theory of Broadening Participation","awardID":"1138526","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["561255","547105","547106"],"PO":["560704"]},"187268":{"abstract":"Novel technologies such as software defined networking are changing the networking landscape by giving individual domains (such as ISPs) flexible control over their routers' behavior. Yet the Internet's interdomain routing architecture, which requires coordination among domains, remains mired in inflexibility. Indeed, many of the key shortcomings of the Internet's architecture --- including unreliability, inefficient resource allocation, and insecurity --- can be attributed in large part to inflexible routing. The Internet's BGP and IP protocols offer only a single path to each destination, and this path may be broken, inefficient, or insecure.<br\/><br\/>This project is developing an approach to bring flexibility to the Internet's routing and forwarding architecture. To break through the current logjam of inflexible routing, the project is advancing source-controlled routing (SCR) as an architectural approach to enable fundamentally more flexible routing. Rather than embedding the routing decisions within the network, routing decisions are a parameter to the network chosen at the source, i.e., the user's device or one acting on its behalf. That flexibility yields solutions to multiple problems, including reliability, performance, and protection from certain traffic attraction attacks.<br\/><br\/>To achieve a viable SCR architecture, the project is solving three key challenges: policy flexibility of the core architecture; security; and scalability. First, while past SCR architectures gave route control to users, they took away control from network owners and operators. The key need is \"policy flexibility\" in the architecture, to enable SCR without limiting network owners' control. The project is developing a formal theory of policy flexibility and designing an architecture which achieves high policy flexibility. Second, the project is quantifying the vulnerability of SCR architectures to denial-of-service attacks and developing techniques to limit the worst-case damage attackers can inflict. Third, the project is developing techniques for sources to utilize flexible routing in a scalable way, improving latency and reliability of Internet communications.<br\/><br\/>Broader Impact.The result of this project will be the theoretical foundations, design, and implementation of an Internet architecture that offers significant gains to areas which are the most critical challenges for the Internet today --- including reliability, performance, and security. The project's theoretically-grounded research methodology, including a novel theory of protocol flexibility, will be integrated with education via development of material for a graduate-level \"Theory of Computer Networks\" course and survey papers. Results will be disseminated through publications, presentations, and a public software release.","title":"CAREER: Flexible Networks with Source Control","awardID":"1149895","effectiveDate":"2012-01-15","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["508065"],"PO":["565090"]},"187786":{"abstract":"This project explores new directions to solving top-down modulated visual saliency maps with three basic principles: discriminancy, sparsity and connectivity. The research identifies key factors for advancing the state-of-the-art and presents a novel latent variable model, which extends the classical conditional random field with an embedded layer of latent variables to exploit the sparsity nature of features for saliency maps. This sparse latent variable conditional random filed model can be considered as a joint optimization of group sparse coding and conditional random field, which can be solved with an efficient stochastic gradient descent algorithm. Unlike bottom-up saliency, this model facilities high-level visual recognition tasks by learning sparse image structures from objects of interest. The key intellectual contributions of this project are a novel formulation that considers all three important properties for visual saliency in a unified framework, and an efficient learning algorithm to estimate the model parameters. <br\/><br\/>With the developed techniques, the search regions of these vision tasks can be constrained and thereby reduce the computational complexity and enhancing robustness. Effective top-down modulated visual saliency algorithms have broad applications including object detection, object recognition, visual tracking, scene analysis, image compression, surveillance, and robotics. It also provides a crucial tool for studying and analyzing fixations of eye movements in cognitive science. The research results including code and data are made public on the project web site.","title":"EAGER: Visual Saliency with Discriminancy, Sparsity and Connectivity","awardID":"1152576","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[503401],"PO":["564316"]},"186048":{"abstract":"With different gaseous pollutants collectively responsible for an estimated 41,200 annual deaths in the U.S. air quality monitoring becomes an imperative for the health and well-being of the population. The project GENIUS (for Green sEnsor Networks for aIr qUality Support) aims at building a continuously operational pollution monitoring network through proposing advancements in sensor hardware, communication protocols, analytical models with the goal of realizing self-sustaining sensor nodes.<br\/><br\/>The design of an integrated sensor combining an on-demand wake-up radio and energy harvesting technologies is a key contribution of this research, enabling the deployment of energy neutral sensor networks for pollution monitoring that are virtually perennial. GENIUS revisits the network protocol stack in light of this new node architecture. Techniques for jointly optimizing duty cycles based on energy prediction, the choice of energy storage components, as well as finding routes that ensure the highest throughput for a given energy availability are being explored in this work. Moreover, Òpollution mapsÓ using novel spatio-temporal data modeling tools are integrated with the protocol design to improve the operational performance.Ê<br\/><br\/>Energy neutral sensor networks will impact many different applications, such as environmental, structural, and patient health monitoring, where deployed sensors are not easily accessible. The project also involves international collaboration with India, giving an opportunity for U.S. students and researchers to interact with their Indian counterparts, conduct joint experiments, and develop mutually beneficial research strategies to combat the global challenges posed by air pollution.","title":"PC3: Collaborative Research: GENIUS: Green Sensor Networks for Air Quality Support","awardID":"1143662","effectiveDate":"2012-01-01","expirationDate":"2014-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["527036"],"PO":["563661"]},"200315":{"abstract":"Multi-program execution, the concurrent execution of multiple independent applications, will play an important role in efficiently exploiting the potential of future multi-core systems. Researchers use multi-program workloads to evaluate proposed designs and policies for various aspects of multi-program execution. Unfortunately, the fixed workload and variable workload multi-program workload methodologies used today are unsound and lead to incorrect results. Therefore, the proposed research is aimed at investigating a new multi-program workload construction scheme, called FIESTA (Fixed Instruction with Equal STAndalone runtimes), in which application samples are chosen so that individual application have equal runtimes when executing alone. Samples are then mixed and matched to form multi-program workloads, but the same samples are used in every experiment. The research will investigate two issues related to FIESTA: Generation of application samples and Extension to multi-threaded environments. FIESTA workloads should produce results that are internally consistent and plausible.<br\/><br\/>Computer architecture research surges when new tools, benchmarks, and methodologies are introduced and distributed. The quality and depth of single-program experimental evaluation improved when efficient sampling and simulation techniques like SimPoints were introduced. FIESTA should provide the same impetus for multi-program execution research and education, while becoming the standard methodology for sampling both single-threaded and multi-threaded programs.","title":"SHF: EAGER: FIESTA: A Sound Multi-Program Workload Methodology","awardID":"1259028","effectiveDate":"2012-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":[536996],"PO":["366560"]},"181241":{"abstract":"The project develops mechanisms for reliable communications over wireless mesh networks, which have recently emerged as a promising solution for providing last-mile Internet access. Such networks operate at the edge of the Internet and consist of wireless routers that provide a backbone over which users can access the Internet. While wired networks are highly dependable, wireless networks are notoriously unreliable due to interference, obstructions, jamming, and mobility. The goal of this project is to develop mechanisms for reliable communications in this challenging environment. In particular, the project adapts some of the techniques that have been successfully used to provide reliability in wired networks to the wireless environment. An important aspect of this research is the design of protection and restoration mechanisms that are tightly integrated with the wireless transmission medium, and take into account interference affects. These mechanisms include protection along preplanned backup paths, diversity routing along multiple paths, and spare capacity allocation for providing reliability guarantees. Methods from stochastic network control will be used to develop autonomous restoration algorithms, and techniques from the field of robust optimization will be used to design reliable network architectures. <br\/><br\/>This project develops mechanisms for making wireless networks reliable, and thus, tightly integrated with the wired Internet. Such mechanisms will help increase Internet access to locations worldwide lacking in communication infrastructure. The results will be widely disseminated through publication in conferences, journals and the web. The broader impacts include training of graduate and undergraduate students and technology transfer to industry and government laboratories.","title":"NeTS: Small: Protection and Restoration in Wireless Mesh Networks","awardID":"1116209","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["517543"],"PO":["557315"]},"186237":{"abstract":"The purpose of this project is to promote student participation in the long-running EDBT\/ICDT conference series, to be held in March 2012 in Berlin, Germany. This will be the 15th EDBT and 15th ICDT, and will be the 4th year continuously that the two conferences are run as a joint one. These two conferences are internationally leading database systems and theory conferences, and have been well attended by the leading researchers in the area from all over the world. Being in Europe, the joint conference tends to attract more European researchers than other database conferences do. This student travel grant will encourage the interaction of the US students with their counterparts and senior researchers from Europe and elsewhere, increasing the international awareness of the participating US students. Students participation of international scientific discussion forums is always an important part of their education and a great way to build a mature work force in scientific research. The project will also emphasize on recruiting under-represented groups of students in this effort.","title":"Student Travel Support for U.S. Graduate Students to Participate in EDBT\/ICDT 2012","awardID":"1144371","effectiveDate":"2012-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["543520"],"PO":["565136"]},"186678":{"abstract":"Logic circuits, hence the computational electronic systems that they enable, have to date been implemented primarily with CMOS (complementary metal oxide semiconductor) transistors. The improvement in CMOS technology for the past several decades has led to remarkable progress in electronic system capabilities and complexity. As we reach the physical limits of this progress, there is a need to explore radical new technologies and corresponding circuits that will enable similar progress in the future. This project explores the use of magnetic state of electrons, rather than the typical measure of total electron charge, to define the logic states that represent the signal information. Since magnetic state has previously been used only to construct memory or storage devices, its use for logic circuits requires this project to explore and co-optimize novel magnetic devices and new circuit technologies that incorporate them.<br\/><br\/><br\/>Through direct collaboration with industry, the aforementioned novel devices and circuits could enable new electronic products and markets in the semiconductor industry. Furthermore, collaboration is planned with Entrepreneuring Youth (www.eyouthamerica.org), a nonprofit organization in Pittsburgh that designs middle school and high school programs that use entrepreneurial learning and business creation to engage young people in learning. The technical aspects of this work will be used as a platform to expand the coverage of magnetics in the middle schools, high schools and undergraduate college curriculums.","title":"EAGER: Preliminary Studies on Novel Four-Terminal Spin Transfer Torque Devices to Enable All-Magnetic Logic Circuits","awardID":"1146799","effectiveDate":"2012-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":[500881,"549747"],"PO":["562984"]},"187107":{"abstract":"Attacks on software applications such as email readers and web browsers are common. These attacks can cause damages ranging from application malfunction, loss of private data, to a complete takeover of users' computers. One effective strategy for limiting the damage is to adopt the principle of least privilege in application design: the application is split into several protection domains and each domain is given only the necessary privileges to perform its task. In this design, the compromise of one domain does not directly lead to the compromise of other security-sensitive domains. The PI proposes to design and implement a framework that makes it easy for software developers to apply the principle of least privilege to their applications. The proposed framework will significantly improve the security of critical software applications. It will benefit the software industry by designing new technologies for building secure software systems.<br\/><br\/>The proposed research combines several novel ideas: (1) user-space protection domains through binary-level enforcement of isolation and information-flow security; (2) a declarative language that allows for flexible configuration of an application's security architecture; (3) a binary-level partitioning tool that automatically splits an application into components of least privilege; (4) a compositional reasoning mechanism that allows developers to perform formal reasoning about an application's end-to-end information security. By staying in the user space, the proposed framework is OS independent, and by working on binary code, it is source-language agnostic, making it more broadly applicable. Developers can use it to partition an application, flexibly configure its security architecture, and reason about its information security. On the education side, the PI will organize a series of activities to increase high school students' awareness of security, privacy, and secure programming. The central activity is a summer workshop that gathers local high-school technology teachers and helps them design lesson plans that can be integrated into their schools' technology curriculum.","title":"CAREER: User-Space Protection Domains for Compositional Information Security","awardID":"1149211","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["517943"],"PO":["564388"]},"192530":{"abstract":"In this proposal, the PIs are planning, organizing, and chairing a National Science Foundation (NSF) workshop on Security of Cloud Computing Services and Systems. The major objectives of this workshop are (a) to develop a research agenda for the security of cloud computing services and systems, (b) to rally a broader computer science and engineering research community behind this agenda, and (c) to help identify the research problems that need to be solved in this area.","title":"Security for Cloud Computing - NSF Workshop","awardID":"1213373","effectiveDate":"2012-01-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563534","561784"],"PO":["565255"]},"181542":{"abstract":"Voice over IP (VoIP) over IEEE 802.11 based wireless networks leads to a promising all-IP platform provisioning economic high-quality voice services to mobile users anytime and anywhere. Due to the openness and distributed nature of the protocols involved in the VoIP over wireless, it becomes easy for malicious users to achieve their own gain or disrupt the service by deviating from the normal protocol behaviors. This project develops a real-time intrusion detection framework, requiring no modification to the relevant standard protocols. Analytical tools are also developed for guiding the detection system design for guaranteed performance.<br\/><br\/>This research is expected to significantly advance the state of the art of real-time intrusion detection for VoIP over 802.11 based wireless networks, through three complementary tracks: selfish behavior detection over the 802.11 protocol, session initiation protocol (SIP)-layer attacks and detections, and development of a cross-layer intrusion detection framework. On the education front, the proposed interdisciplinary research seamlessly integrates theoretical studies in the areas of Markov decision process, wavelet analysis, 802.11 protocol analysis, and traffic modeling, as well as computer simulation and testbed experiments, with the advantages of providing various training projects to undergraduate and graduate students with different interests. On the industry front, the success of this project will generate an intrusion detection framework for the VoIP over wireless networks with the advantages of robust detection performance, provable detection quality of service, and excellent extendibility for future intrusion detection techniques.","title":"TC: Small: Real-Time Intrusion Detection for VoIP over IEEE 802.11 Based Wireless Networks: An Analytical Approach for Guaranteed Performance","awardID":"1117687","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["549772"],"PO":["564223"]},"182642":{"abstract":"This research will develop a cyber-enabled discovery system, integrating state of the art thinking and methodologies from computer, transportation, mathematical, and social sciences, for management of logistics in humanitarian responses to disasters. It will (1) create new paradigms of humanitarian logistic models that explicitly consider two key aspects not studied by the current techniques: non-hysteretic deprivation costs (lack of access to a given good or service), and materiel convergence (physical movement of supplies and equipment); (2) develop appropriate models to represent human suffering as a deprivation cost; (3) develop analytical models to quantify and influence the amount, type, and arrival patterns of donations; (4) gain insight into the links between media framing of needs and materiel convergence; (5) define mechanisms to modify donor behavior; and, (6) develop algorithms and heuristics to solve these formulations. This will lead to models that correctly consider the impacts of logistic decisions on the impacted populations, more effective delivery strategies, more coordinated and effective relief flows, and less congestion at entry points.<br\/><br\/>This research is an ambitious and transformative effort to build a holistic, quantitative understanding of how humanitarian logistics should consider deprivation costs and emergent donor response to disasters. This is based on state of the art economic, logistic, and social science research into the impacts of delivery actions, media portrayal of disaster events, and response needs. The core impact of this research will be improved allocation and delivery of critical supplies during disaster response, as well as better coordination with emergent distributed donor sites, leading to improvement of the nation?s emergency response capabilities. The research team will maximize the broader impacts through: (1) the integration of research into undergraduate and graduate courses; (2) the involvement of undergraduate and graduate students as research assistants; (3) the use of outreach events to communicate research results to undergraduate and high school students and stimulate them into research; (4) the recruitment of women and minority students; and (5) the dissemination of project findings among professionals and researchers with interest in humanitarian logistics and disaster response.","title":"Collaborative CDI-Type II: Cyber Enabled Discovery System for Advanced Multidisciplinary Study of Humanitarian Logistics for Disaster Response","awardID":"1123924","effectiveDate":"2012-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7751","name":"CDI TYPE II"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["554238"],"PO":["564456"]},"193796":{"abstract":"The national transmission networks that deliver high voltage electric power underpin our society and are central to the ongoing transformation of the American energy infrastructure. Transmission networks are very large and complicated engineering systems, and \"keeping the lights on\" as the transformation of the American energy infrastructure proceeds is a fundamental engineering challenge involving both the physical aspects of the equipment and the cyber aspects of the controls, communications, and computers that run the system. The project develops new principles of cyber-physical engineering by focusing on instabilities of electric power networks that can cause blackouts. It proposes novel approaches to analyze these instabilities and to design cyber-physical control methods to monitor, detect, and mitigate them. The controls must perform robustly in the presence of variability and uncertainty in electric generation, loads, communications, and equipment status, and during abnormal states caused by natural faults or malicious attacks.<br\/><br\/>The research produces cyber-physical engineering methodologies that specifically help to mitigate power system blackouts and more generally show the way forward in designing robust cyber-physical systems in environments characterized by rich dynamics and uncertainty. Education and outreach efforts involve students at high school, undergraduate, and graduate levels, as well as dissemination of results to the public and the engineering and applied science communities in industry, government and universities.","title":"CPS: Medium: Collaborative Research: The CyberPhysical Challenges of Transient Stability and Security in Power Grids","awardID":"1219917","effectiveDate":"2012-01-01","expirationDate":"2015-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[518956],"PO":["565239"]},"185506":{"abstract":"1140384 (Ramaswami). This award is funded under NSF's Science, Engineering, and Education for Sustainability (SEES) activities, which aims to address the challenges of creating a sustainable world. This project will develop a research collaboration network (RCN) across 20+ US universities and 2 national labs to coordinate work on the overarching theme of sustainable cities, with focus on reducing energy use, carbon emissions and mitigating climate-risks to water supply and public health in cities. The US network will collaborate with international sustainability research networks (in Australia, EU, Asia) and with a network of practitioners and policymakers in US and global cities. RCN activities will lead to the development of (a) inter-disciplinary systems framework(s) to represent linkages between people, infrastructures and the natural system, from the city-scale to the global scale, that shape sustainability outcomes in cities, (b) harmonized methods and international data standards to operationalize the framework, to report, for example, the carbon footprints of cities, water vulnerability of cities, or to analyze social actors who shape urban infrastructures and consumption patterns toward sustainability, (c) a network of 12 global cities for testing the framework and its component theories and models\/methods in cities with different natural, infrastructural, socioeconomic and cultural characteristics, (d) a virtual collaborative forum to share research methods, experiences and teaching tools across more than 20+ US universities on the common thematic area of sustainable cities. The RCN will provide science based systems analysis tools, much needed by more than 1000 cities worldwide that are developing sustainability plans addressing energy, water and climate change. A unique aspect of this RCN is broad-based integration across urban ecology, industrial ecology, atmospheric sciences, infrastructure engineering, architecture, urban planning, behavioral sciences, public affairs and public health toward the goal of sustainable cities. Cross-discipline integration, coordination of data across scales, and cross-city comparisons are expected to advance the science of sustainable cities. The RCN has potential to impact more than 1200 students in participating US universities and 65 million people in the network of cities where field work will be coordinated. Dissemination potential is high through network links with policy groups such as ICLEI-USA and The World Bank who work with cities worldwide.","title":"RCN - SEES: Sustainable Cities - People and the Energy-Climate-Water Nexus","awardID":"1140384","effectiveDate":"2012-01-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"7977","name":"CR-Water Sustainability & Clim"}}],"PIcoPI":["529527","554207","564480",497824,"396872"],"PO":["565364"]},"182625":{"abstract":"This project brings together an interdisciplinary team of learning science researchers, game designers, game theory researchers, and environmental scientists to engage diverse audiences in the science of sustainability and sustainable development. Taking its inspiration from Buckminster Fuller's \"World Game\" - conceived nearly fifty years ago as a tool to facilitate a comprehensive, participatory approach to addressing the problems of the world - the team is developing, testing, and delivering a real-time, collaborative environment using a distributed, technology-enhanced, game-based architecture to enable groups of individuals to explore the interconnected nature of the economic, social and environmental factors that influence sustainability. The intellectual merit of the project has two key dimensions. First, by making visualizations of scientific data available in public spaces for groups of informal learners, the investigators seek to understand the nature of the resulting participatory engagement with data, giving particular attention to discovering design principles that influence the effectiveness of the visualizations. Second, the investigators are creating innovative interfaces that make computers \"invisible\" and provide alternative tactile, social, and spatially distributed ways to interact with the underlying data, and then studying how such interfaces promote generative and cooperative thinking about sustainability issues. The project is exercising its broader impacts through its contribution to the field's general understanding of the ways in which social, highly participatory environments support deeper and more reflective learning about complex multivariate data. Moreover, the research team is advancing the public understanding of science in general, and sustainability and environmental science in particular.","title":"DIP: Interaction Research in Complex Informal Learning Environments","awardID":"1123832","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7444","name":"NATIONAL SMETE DIGITAL LIBRARY"}}],"PIcoPI":["526223","540207",489275,489276,489277],"PO":["560894"]},"191469":{"abstract":"This project funds travel for graduate students and speakers to participate in PerCom 2012 to be held in Lugano, Switzerland in March 2012. PerCom is the flagship international conference in pervasive computing. Students will participate in an organized PhD Forum, both before and during the conference, demonstrate their work in a Poster Session, give presentations about their research, and be mentored by senior researchers. The funded speakers will participate in a featured panel where they will explore, with each other and with the audience, controversial issues realted to pervasive computing.","title":"IEEE PerCom 2012 Travel Support","awardID":"1208284","effectiveDate":"2012-01-15","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["564777"],"PO":["551712"]},"182813":{"abstract":"This research will develop a cyber-enabled discovery system, integrating state of the art thinking and methodologies from computer, transportation, mathematical, and social sciences, for management of logistics in humanitarian responses to disasters. It will (1) create new paradigms of humanitarian logistic models that explicitly consider two key aspects not studied by the current techniques: non-hysteretic deprivation costs (lack of access to a given good or service), and materiel convergence (physical movement of supplies and equipment); (2) develop appropriate models to represent human suffering as a deprivation cost; (3) develop analytical models to quantify and influence the amount, type, and arrival patterns of donations; (4) gain insight into the links between media framing of needs and materiel convergence; (5) define mechanisms to modify donor behavior; and, (6) develop algorithms and heuristics to solve these formulations. This will lead to models that correctly consider the impacts of logistic decisions on the impacted populations, more effective delivery strategies, more coordinated and effective relief flows, and less congestion at entry points.<br\/><br\/>This research is an ambitious and transformative effort to build a holistic, quantitative understanding of how humanitarian logistics should consider deprivation costs and emergent donor response to disasters. This is based on state of the art economic, logistic, and social science research into the impacts of delivery actions, media portrayal of disaster events, and response needs. The core impact of this research will be improved allocation and delivery of critical supplies during disaster response, as well as better coordination with emergent distributed donor sites, leading to improvement of the nation?s emergency response capabilities. The research team will maximize the broader impacts through: (1) the integration of research into undergraduate and graduate courses; (2) the involvement of undergraduate and graduate students as research assistants; (3) the use of outreach events to communicate research results to undergraduate and high school students and stimulate them into research; (4) the recruitment of women and minority students; and (5) the dissemination of project findings among professionals and researchers with interest in humanitarian logistics and disaster response.","title":"Collaborative CDI-Type II: Cyber Enabled Discovery System for Advanced Multidisciplinary Study of Humanitarian Logistics for Disaster Response","awardID":"1124827","effectiveDate":"2012-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7751","name":"CDI TYPE II"}}],"PIcoPI":["381805","549071",489824,"565034"],"PO":["564456"]},"191508":{"abstract":"This is funding to support a Doctoral Consortium (workshop) of approximately 14 promising graduate students from the United States and abroad, along with a panel of about 6 distinguished research faculty mentors. The event will take place in conjunction with the ACM 2012 Conference on Human Factors in Computing Systems (CHI 2012), which is sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI) and will be held May 5-10 in Austin, Texas. The annual CHI conference is the leading international forum for the presentation and discussion of human-computer interaction (HCI) research and practice, and is attended by approximately 2,500 HCI professionals from around the world. Research reports published in the CHI Conference Proceedings and the CHI Extended Abstracts are heavily-refereed and widely cited; they are among the most scientifically respected and impactful research publications in the field of HCI. CHI 2012 will focus on the centrality of experience, from the models, theories and practical insights needed to understand and design for user experience to the irreplaceable value of experiencing innovation in the HCI field through hands-on interactivity. More information about the conference is available at http:\/\/chi2012.acm.org.<br\/><br\/>The Doctoral Consortium is a research-focused meeting that has taken place annually at the CHI conference since 1986, and has helped to launch the careers of many outstanding HCI researchers. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their research during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on May 5-6, with follow up activities planned during the technical program of the conference. Extended abstracts of the students' work will be published in the CHI 2012 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars; many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is HCI-related, regardless of the fields in which they are earning their degrees. While NSF funds will be used chiefly to support participation by students enrolled in graduate programs in the United States, some international participants may be supported as well in recognition of the fact that the HCI field embraces educational and cultural traditions that vary in different parts of the world. The organizers have undertaken to work to identify and include the broadest possible group of highly qualified participants; as a consequence, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"Workshop: Human-Computer Interaction Doctoral Research Consortium at Association for Computing Machinery Computer-Human Interaction 2012","awardID":"1208510","effectiveDate":"2012-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[513299],"PO":["565227"]},"190728":{"abstract":"This award suppors the international travel of 10 US scientists to attend the Grid Computing - The Next Decade workshop that will be held in January 4-6, 2012, in Zakopane, Poland. This interdisciplinary, international workshop will discuss the state of the art of Grid computing, its applications and, more importantly, its future. The detailed results of the workshop will be published in the form of a report that will be made available to the public.","title":"Workshop: Grid Computing - The Next Decade","awardID":"1205193","effectiveDate":"2012-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}}],"PIcoPI":["565247","559182"],"PO":["525727"]},"187081":{"abstract":"This project enhances the research direction of the interdisciplinary arts-engineering Media Arts & Technology (MAT) doctoral program at UC Santa Barbara, through the introduction of a practice-based, study in visually applied robotics. The ultimate challenge in any arts, science and engineering collaboration is a convincing articulation as to why and how artistic contribution can be of benefit to the scientific and engineering research. We propose to develop a prototype multi-camera instrument consisting of three robotically actuated cameras for experiments in content recognition and image stabilization of real-time noisy images generated by the moving cameras which try to synchronize their visual content. Our project?s purpose is to develop new solutions in image synchronization through the study of images generated by machine behavior, bridging knowledge perspectives from visualization experts from the two fields of arts and engineering.<br\/><br\/>Through the iterative working process of experimental staging and evaluation of results, we plan to identify and formally define methodology similarities and differences by which artists and engineers arrive at solutions. We are therefore interested in closely examining problem-solving at the implicit and explicit levels. Our project?s principal objectives are to: a) To develop an instrument of an exploratory, experimental nature that will be used in multiple ways to stimulate advances in research dealing with the optical-mechanical robotic vision machine; the study of machine behavior, and the study of machine generated images. b) Advance the infrastructure for research and education through the creation of an imaging instrument that will bring together specialists from different disciplines to explore a common computational imaging problem and lead to further arts-engineering collaboration, and c) the intent is to position artistic vision as a contributing force to advancing research and thereby to push recognition of the artistic paradigm as of relevance to the research community. A part of this work will therefore be to identify opportunities that current scientific\/engineering research have not explored but that have potential and resonances for both disciplines.<br\/><br\/>The project will have significant educational impact as imaging-computational-robotics is a curriculum and research direction that MAT has desired to integrate for years, and the project will formally set the stage for direct engagement with the controls mechanical engineering branch of the College of Engineering. Dissemination of results will occur in a broader spectrum then conventional research such as engineering conference papers and arts academic presentations. This proposal also includes the creation of a state-of-the-art installation based on the result of the experimental studies, to be circulated in the general public context of exhibitions in museums, where feedback can be further collected.","title":"EAGER: Distributed Imaging Through Networks of Robotically Actuated Cameras","awardID":"1149001","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["528224"],"PO":["532791"]},"187170":{"abstract":"Detecting and repairing concurrent software defects has always been labor-intensive due to the inherent complexity in analyzing the astronomically large number of thread interleavings. The situation is exacerbated by the increasingly widespread use of multicore processors, whose computing power can only be unleashed by concurrent software. Automation of this detection and repair process promises to drastically reduce the time spent in debugging such systems, leading to reliable and secure software as well as fully utilized parallel hardware. The objective of this research is to improve the concurrent software reliability and security through innovations in automated concurrency debugging. <br\/><br\/>This project will investigate new theoretical and algorithmic advances, and tools to fully automate the crucial process of bug detection, diagnosis, repair, and optimization for large concurrent software. The unifying theme of this research is the judicious application of logical constraint based symbolic methods and automated thread interference abstractions. Symbolic methods will mitigate interleaving explosion, which is the major scalability bottleneck in concurrent software analysis, verification, synthesis and maintenance. Interference abstraction will enable the use of the most economical methods to analyze properties of the system via under- or over-approximated modeling of thread interactions. The PI will incorporate the results from this research into the undergraduate computing curriculum and summer retraining courses for Information Technology (IT) practioners with the aim of maintaining the competitive vitality of the U.S. IT workforce.","title":"CAREER: Automated Concurrency Debugging ? An Essential Ingredient for Safety-Critical Software Assurance and Security","awardID":"1149454","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["408703"],"PO":["565264"]},"187292":{"abstract":"Human communication is typically robust even at high speeds. This suggests that both speakers and listeners efficiently deal with the uncertainty and noise inherent to perception, production, and the environment. This CAREER award investigates how the human brain accomplishes this. A mathematical model of efficient communication based on probability and information theory (the Ideal Speaker model) is tested against data from conversational speech. Specifically, the project investigates how the pronunciation of words in spontaneous speech depends on words' expected confusability in context, the cognitive load the speaker is under and the situational incentive for robust communication. The Ideal Speaker model also predicts that efficient communication with a particular interlocutor requires adaptation to that interlocutor, a prediction that the project tests in behavioral paradigms against task-oriented speech production. <br\/><br\/>The project contributes to our understanding of how humans produce language, why language has the properties it has, and to what extent the neural systems underlying language production can adjust to different communicative task demands. These insights can contribute to the development of better automatic speech recognition systems (this project is limited to the evaluation of such systems). In addition, novel paradigms to gather large amounts of language data are developed that will dramatically cut research costs. Finally, training in the emerging field of computational psycholinguistics is provided to a broad international audience via summer schools and workshops. This will contribute to a new generation of multidisciplinary scientists working across traditional boundaries between computer science, linguistics, and cognitive psychology.","title":"CAREER: Communicative Efficiency and Adaptiveness in the Ideal Speaker","awardID":"1150028","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["554036"],"PO":["565215"]},"187260":{"abstract":"CAREER: Understanding, Representing, and Enhancing Scenes at the Internet-scale<br\/><br\/>Photography has an enormous impact on society -- it is our primary visual history and a medium for storytelling, entertainment, and art. But our visual world is extraordinarily complex which makes it difficult for computer vision to understand photos and for computer graphics to synthesize visual content. However, the emergence of Internet-scale photo collections in recent years enables new research directions. We use scene-based representations to leverage Internet-scale data. Scenes (places or environments) are the context in which all other visual phenomena exist and it seems possible to brute-force the space of scenes -- with millions of scenes, we find qualitatively similar scenes and create massively data-driven algorithms with capabilities that are complementary to typical bottom-up graphics and vision pipelines. The underlying principle of this study is that joint investigations of scene representations and large image databases will advance the state-of-the-art in graphics and vision. <br\/><br\/>First, we are investigating detail synthesis tasks which alleviate camera shake, motion blur, defocus, atmospheric scattering, or low resolution. Scene representations are robust enough to find matching scenes in Internet-scale photo collections even in the presence of dramatic blurring. These matching scenes provide a context-specific statistical model which can be used to insert convincing texture and object detail. Second, we are studying attribute-based representations of scenes. We use crowdsourcing to discover attributes and build large databases for the community. Attributes are a powerful intermediate representation for the next generation of big data imaging research which can have broad societal impact through applications such as robotics, security, assistance to vision-impaired, and vehicle safety. The investigators also are developing a new introductory course for Brown students to explore big data computing across scientific disciplines and are creating an online community for visual computing education to benefit students interested in photography and programming.","title":"CAREER: Representing, Understanding, and Enhancing Scenes at the Internet-Scale","awardID":"1149853","effectiveDate":"2012-01-15","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["528661"],"PO":["565227"]},"187150":{"abstract":"As Cyber-Physical Systems (CPSs) employing mobile nodes continue to integrate into the physical world, ensuring their safety and security become crucial goals. Due to their mobility, real-time, energy and safety constraints, coupled by their reliance on communication mediums that are subject to interference and intentional jamming, the projected complexities in Mobile CPSs will far exceed those of traditional computing systems. Such increase in complexity widens the malicious opportunities for adversaries and with many components interacting together, distinguishing between normal and abnormal behaviors becomes quite challenging.<br\/><br\/>The research work in this project falls along two main thrusts: (1) identifying stealthy attacks and (2) developing defense mechanisms. Along the first thrust, a unifying theoretical framework is developed to uncover attacks in a systematic manner whereby an adversary solves Markovian Decision Processes problems to identify optimal and suboptimal attack policies. The effects of the attacks are assessed through different instantiations of damage and cost metrics. Along the second thrust, novel randomization controllers and randomization-aware anomaly detection mechanisms are developed to prevent, detect and mitigate stealthy attacks.<br\/><br\/>The outcomes of this CAREER project will ultimately provide concrete foundations to build more secure systems in the areas of robotics, autonomous vehicles, and intelligent transportation systems. The educational activities--as in curriculum development and hands-on laboratory experiences--will provide students with the essential skills to build dependable and trustworthy systems, while ensuring the participation of undergraduates, women and underrepresented minorities. The outreach activities will expose high school students to Computer Science education and scientific research.","title":"CAREER: Securing Mobile Cyber-Physical Systems (CPSs) Against Stealthy Attacks","awardID":"1149397","effectiveDate":"2012-01-15","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["505636"],"PO":["562974"]},"187282":{"abstract":"Robots hold the promise of delivering significant social contributions in such key domains as education, rehabilitation, and collaboration, but to achieve this promise they must be able to communicate effectively with people. The goal of this project is to design effective social behaviors for robots by modeling human verbal, vocal, and nonverbal behavior using computational tools, regenerating them in robots, and evaluating their effectiveness in human-robot studies in social scenarios such as storytelling, interview, conversation, instruction, and collaborative work. The research will follow an interdisciplinary approach, combining computational and social-scientific methods toward advancing the state of the art in robotic technology.<br\/><br\/>Intellectual Merit: The research will create a set of design specifications that robot designers can use to create robots that effectively communicate with people. These specifications will be openly disseminated to robot designers and researchers as modules for the open-source Robot Operating System (ROS). The project will also lead to new computational tools that will enable modeling human behavior and synthesizing effective behaviors for robots. In addition, this research will contribute to social science by providing a more detailed, computational understanding of human social behavior. <br\/><br\/>Broader Impacts: The research will enable robots to communicate more effectively with people in such critical domains as education, collaborative work, and health and wellbeing. The projects will also introduce computational tools into areas that have not yet substantially benefited from advancements in computer technology, such as the diagnosis and treatment of autism and traumatic brain injury. Through an integrated education and outreach program, this project will also contribute to interdisciplinary education, undergraduate and graduate curricula, K-12 and special education, public understanding of science and technology, and further inclusion of minorities and children with disabilities in scientific research and education.","title":"CAREER: Designing Socially Adept Robots","awardID":"1149970","effectiveDate":"2012-01-15","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["520932"],"PO":["565227"]},"187250":{"abstract":"Monolayer materials are two-dimensional sheets of a single atomic layer. Recent experimental demonstration of electronic devices based on various monolayer materials, both from academia and industry, show that the promise of these devices to augment or in some cases replace CMOS based logic systems may soon become a reality. This necessitates that appropriate design tools are available so that individual device behavior observed in experimental labs can be assessed from both a fundamental and also a system point of view. The major intellectual contribution of the efforts proposed in this proposal will be to develop a design software for monolayer devices that is based on fundamental physics yet will exploit the increasing computational capability made available through multi-core architecture and super computing clusters for real time and realistically sized device simulation. The general software will be an integrated tool that describes electron and spin transport in monolayer devices in presence of dissipation mechanisms within a full quantum description and also extend those numerical results to compact models appropriate for circuit and system level simulation. This work will thus, on one hand, advance the fundamental understanding of electronic and spin transport in monolayer 2D materials and on the other, make it possible to take those insights to circuit and system level, thereby fostering disruptive innovation in design and optimization with these emerging materials. <br\/><br\/><br\/>As the Si based CMOS technology runs its course, new materials with novel functionalities will be necessary to continue the growth of electronics that contributes significantly to the US economy and also to ensure US leadership in computing technologies. New materials may also lower the energy necessary to run computers. Energy dissipation in computers accounts for a few percent of the national energy needs in the US and this percentage is projected to go up as the use of Cloud technology becomes increasingly commonplace in our daily life. This proposal will train graduate students to think about these issues and also encourage them to look for potential solutions. This work will draw on electrical engineering, material science, computational science and physics, thus providing a true interdisciplinary research experience for the students. A number of UC-Berkeley-run programs will be leveraged to include undergraduate researchers specifically focusing on minority and women. Simulation modules will be made available on line to encourage and foster research in new materials for electronic devices. In addition, industrial collaborations will be leveraged for critical feedback and also to provide a channel for commercialization of any relevant technology developed in this research.","title":"CAREER: Monolayer Devices: A Simulation Study","awardID":"1149804","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[502253],"PO":["562984"]},"185161":{"abstract":"North Carolina State University proposes the ENGAGE project to develop, implement, and evaluate a middle grade version of the CS Principles course that is fully situated within an immersive game-based learning environment. ENGAGE has three thrusts: (1) developing and implementing a highly engaging game-based learning environment that delivers a CS Principles course for middle grade students and their teachers; (2) making a significant educational research contribution by evaluating the effectiveness of game-based learning for computer science education; and (3) making a significant contribution to broadening the participation in computing by evaluating the effectiveness of the game-based learning framework for student learning, computing interest, and self-efficacy, particularly for underrepresented groups.<br\/><br\/>ENGAGE leverages the strengths of game-based learning, particularly narrative-centered learning, in which the game is driven by an engaging and highly motivating story. Within ENGAGE, students explore and solve global computing problems they encounter on a remote volcanic island, Crystal Island. Students work collaboratively, think creatively, deal with \"big data,\" and analyze how their computing artifacts or those created by others are likely to impact their world. The project also includes a major focus on in-service professional development through the EngageToTeach summer institute designed not only to build teachers' computational fluency, but to instill a sense of advocacy toward computing education.<br\/><br\/>ENGAGE will see the development of a game-based learning environment for middle grade computational fluency that is expected to be highly effective for all students. With a specific focus on serving underrepresented groups, the project will draw on a partnership with North Carolina State University and diverse middle schools, including a public middle school of Johnston County, North Carolina, and a private middle school of Durham, North Carolina.","title":"Type I: ENGAGE: Immersive Game-Based Learning for Middle Grade Computational Fluency","awardID":"1138497","effectiveDate":"2012-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[496816,496817,"561013",496819],"PO":["560704"]},"187240":{"abstract":"This project develops efficient and effective algorithms to handle challenging problems in visual tracking such as drift, heavy occlusion, and failure recovery. The research team is developing an integrated framework in which object detection, tracking and recognition are addressed simultaneously. Within this framework, the prior knowledge is learned from a large set of images pertaining to object classes of interest. Such knowledge serves as long-term memory for the proposed appearance models which are then adapted to unseen new object instances. In addition, a top-down saliency model for each object class of interest is developed in order to handle heavy occlusion and failure recovery. The project has four major components: developing algorithms for learning visual prior and transferring knowledge for online appearance model, designing tracking algorithms that handle draft with the proposed appearance model, modeling top-down saliency maps to handle full occlusion and tracking failure, evaluating state-of-the-art algorithms with a large benchmark dataset. <br\/><br\/>This project provides a building block for robust object tracking, which can be applied to motion analysis, surveillance, and multi-object tracking. The developed top-down saliency map provides a flexible way to represent objects, which can be extended to object detection and segmentation. The proposed tracking library and benchmark data set provide a platform for evaluation of advances in object tracking. This research is integrated with education and outreach by courses and activities aimed at attracting students to this field and encouraging interdisciplinary collaborations.","title":"CAREER: Visual Tracking with Online and Prior Learning","awardID":"1149783","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7731","name":"OTHER GLOBAL LEARNING & TRNING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["503401"],"PO":["564316"]},"187043":{"abstract":"On-chip embedded memory is a critical component in today?s large-scale integrated systems. This project aims to develop a completely new memory design methodology that is referred to as Maximum-Information Memory System (MIMS). The key idea is to maximize the information density (i.e., the number of information bits per unit area) or information efficiency (i.e., the number of information bits per unit power). Towards this goal, a radically new information theoretical framework will be developed with three critical components: (1) an analytical information model to quantitatively measure the number of information bits stored in a given memory system, (2) a number of different circuit implementation options to achieve maximum-information storage, and (3) a comprehensive study of high-level performance metrics (e.g., signal-to-noise ratio) to demonstrate the efficacy of the proposed MIMS system in real-life signal processing applications. The combination of these research efforts would provide a fundamental infrastructure that facilitates next-generation memory design for nanoscale IC technologies.<br\/><br\/>The proposed project offers a fundamentally new view of memory design based on information theory. It is expected to yield significant performance improvement for on-chip memory circuits over a broad range of applications, from consumer electronics (e.g., smart phones) to medical instruments (e.g., implantable medical devices). Hence, successful development of the proposed MIMS framework will have both short-term and long-term impacts on U.S. industry and improve U.S. competitiveness in science and technology. In addition, given its broad coverage of multiple science and engineering fields such as statistics, circuits, etc., the proposed project offers a number of unique education and training opportunities for both university students and industrial engineers. It will substantially improve the education infrastructure and generate high-quality researchers and engineers in related fields.","title":"CAREER: Maximum-Information Memory System: Theory, Implementation and Application","awardID":"1148778","effectiveDate":"2012-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["531467"],"PO":["562984"]},"188077":{"abstract":"As the amount of digital information explodes, two new trends are emerging. First, data is increasingly being stored and managed in the \"cloud\", an untrusted trove of computing power and storage space for rent. Second, computer devices (e.g., cars, cell phones, medical implants) are everywhere and continuously exchanging messages.<br\/><br\/>This research addresses the security issues raised by these trends by developing cryptography-based security solutions for processing large volumes of data in an untrusted setting. The main goals are (1) practical solutions for outsourcing sensitive computations to untrusted parties and (2) new methods for automatically converting a standard signature verification procedure into one that efficiently processes a batch of messages. An initial focus is to explore pairing-based solutions as a means of keeping the bandwidth overhead low. The primary technical challenges are designing formal models to capture the desired security guarantees, designing efficient systems and testing these systems in practical settings.","title":"EAGER: Outsourcing and Automating Cryptography in the Cloud","awardID":"1154035","effectiveDate":"2012-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["521326"],"PO":["564223"]}}