{"104137":{"abstract":"0505998<br\/>McMullen<br\/><br\/>This proposal is to support a planning visit by Dr. Donald F. McMullen and Dr. Michael A. Evans, Pervasive Technology Labs, Indiana University, Bloomington, Indiana. They seek to establish an international research network between the US and Turkey to examine how corresponding research agencies in different countries coordinate to establish research priorities and programs. They plan to establish a core US-Turkey research group, to conduct preliminary research at TUBITAK, the Turkish Government science agency, in Ankara, to plan a reciprocal visit by their collaborators there, and to lay the groundwork for an international workshop on the role of \"egovernment\" in assisting the coordination of international scientific research. The foreign collaborators are: Dr. Kurat Cayltay, Department of Computer Education and Instructional Technology, Middle East Technical University and Dr. Mete Yildiz, Department of Public Administration, Hacettepe University, both in Ankara, Turkey.<br\/><br\/>Intellectual Merit - The research agenda is unique. For the most part egovernment studies have narrowly focused on the interaction of citizens with government services and processes, and not as much on interactions between government agencies. There are no reported studies on the interactions between similar agencies in different countries in the service of scientific discovery. An understanding of the knowledge requirements for coordination between agencies with similar missions and an understanding of the degree to which the satisfaction of these requirements could be subsumed by an information system would be a useful addition to the field. As an initial approach the PIs plan to examine the interactions between the NSF and TUBITAK. Turkey is chosen as the initial participating international partner for four reasons: 1) Turkish students are among the top-ten in number of foreign nationals studying in the US and thus a large source for \"brain drain\"; 2) Turkey plays an important role in the Middle East acting as a bridge between the Central Asia republics of the Russian Federation and Europe; 3) Turkey is held up as a model for neighboring countries in the region for many aspects, including a growing market economy, democracy and education; and 4) Turkey is aggressively working to organize government, industry, and academia for scientific and engineering research purposes.<br\/><br\/>Broader Impacts - The major benefit of the project will be the development of a research network to investigate interagency coordination and knowledge discovery in international scientific collaborations among US and Turkish (and possibly other Middle Eastern) researchers. The expected benefits anticipated are as follows: 1) A network of researchers investigating international interagency coordination and scientific collaboration will be established between the US and Turkey (and possibly interested Middle Eastern countries); 2) A long-term research agenda to study the possibilities and consequences of e-Government initiatives between the US and the Middle East will be initiated. 3) The identification of salient variables that inhibit or facilitate coordination and collaboration will be identified and investigated. 4) Recommendations for policy changes to facilitate coordination and collaboration among participating countries will be offered. 5) Requirements for socio-technical systems to implement policy changes and facilitate future coordination and collaboration will be derived.","title":"US-Turkey: Plannning Visit for Research on Interagency Coordination in International Science and Engineering Research: Implications for Policy Formation & Scientific Collaboration","awardID":"0505998","effectiveDate":"2005-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["471971","486881"],"PO":["540599"]},"101156":{"abstract":"This award provides funds to subsidize the travel and registration expenses of 10 young scientists and 20 invited speakers selected to participate in the Structural, Functional and Evolutionary Genomics Gordon Conference which will be held on June 19-23, 2005, at Bates College in Lewiston, Maine.<br\/><br\/>The conference will provide formal and informal opportunities for the participants to interact to share ideas and to stimulate collaborations. This provides the young scientists with invaluable exposure to outside perspectives on their work, at a critical time in their research, and also enables them to explore their career objectives. This conference contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"2005 Structural Functional & Evolutionary Bioinformatics Gordon Conference","awardID":"0449573","effectiveDate":"2005-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":[266709,"563235"],"PO":["565136"]},"106876":{"abstract":"Constituting a Blue Ribbon Panel to Prepare a Roadmap for Advances in Simulation Based Engineering Science<br\/><br\/>Abstract<br\/><br\/> It is proposed that a Blue Ribbon Panel (BRP) on Simulation Based Engineering Sciences be constituted to conduct a detailed study of the potential benefits of interagency support of research and development in this discipline. The Panel will have a membership of 11 individuals (with one alternate). The charge of the BRP will be to develop a roadmap for accelerated developments of SBES in a broad list of research areas. The report will delineate goals of SBES research, address the barriers and challenges to advancement in the discipline, make recommendations on how the developments in SBES can be greatly accelerated, and provide a roadmap for fully developing and exploring the potential benefits of SBES research. The roadmap should serve as a resource for planning the research agendas for agencies and for university and laboratory research units. <br\/> An important event to take place prior to the work of the BRP is the organization of a two day workshop on the subject. The workshop will be attended by a larger group of specialists who will be asked to provide direction and advice to the BRP. An attendance of approximately 35 to 50 individuals is anticipated. In addition, regular video- and\/or teleconference meetings will be held as well as meetings of the Panel and other interested parties at national conferences on simulation and computational science. <br\/> The final product produced by the Panel will be a detailed report that will be made available to the broad research community, to affected agencies, particularly the NSF, and to the general public.","title":"Constituting a Blue Ribbon Panel to Prepare a Roadmap for Advances in Simulation Based Engineering Science","awardID":"0519469","effectiveDate":"2005-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7552","name":"COFFES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1956","name":"STATISTICAL AND SIMULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["485474"],"PO":["371937"]},"104622":{"abstract":"Support for Students<br\/>to Attend the Eighth US National Congress on Computational Mechanics<br\/><br\/><br\/>Austin Convention Center<br\/>Austin, Texas, July 24-28, 2005<br\/>http:\/\/compmech.ices.utexas.edu\/usnccm8.html<br\/><br\/><br\/><br\/>Funds for supporting the travel, local expenses, and registration of over 30 young student-scholars in Computational Engineering and Sciences (CES) to attend the Eight U.S. Congress on Computational Mechanics, one of the most important events in CES community worldwide, have been requested.<br\/><br\/>The 2005 Congress theme is Spanning Computational Engineering and Sciences. The theme reflects the interdisciplinary character of the host institution, the Institute for Computational Engineering and Sciences, and reinforces the effort to broaden the traditional engineering participation to include applied mathematics, biomedical engineering, nanoscience, computational sciences, and computational electromagnetics, among others. A major emphasis will be placed on complex coupled problems requiring interdisciplinary approaches and the use of large computer resources.<br\/><br\/>The Eight Congress involves 64 mini-symposia which form the backbone of the meeting, and is expected to be the most important meeting to date.<br\/><br\/>It comes at a time in which the entire future of computational sciences and computer simulations is undergoing dramatic changes.<br\/><br\/>New challenges that are developing such as multi-scale modeling, stochastic modeling, and dramatic applications to biomedicine, homeland security, energy and the environment. These challenges have enticed the world's top researchers to attend the meeting to discuss new results, trends and important new developments.","title":"A Request for Support for Students to Attend the Eighth US National Congress on Computational Mechanics","awardID":"0508603","effectiveDate":"2005-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}}],"PIcoPI":["402079"],"PO":["371937"]},"101025":{"abstract":"Wireless embedded sensing systems (WESS) are enabling innovations in many disciplines while driving research and education activities. Unfortunately, even experts today cannot easily compare competing WESS designs due to the lack of commonly accepted metrics and benchmark suites, and difficulties with reproducing sensing conditions. <br\/><br\/>The PI identifies fitness-based metrics for quantitative evaluation of WESSs. To maximize fitness to the diverse sensing requirements, including size, power, and timing, the PI constructs a modular, configurable, multi-microcontroller WESS architecture called pico-cluster that spans the space from ultra-compact, wirelessly-networked event detectors to high duty-cycle data acquisition units. True parallelism of a pico-cluster enhances timing fitness, while de-centralized, multi-supply, load-matching power management techniques maximize power fitness and improve data fitness. Embedded systems so optimized will achieve new levels of energy efficiency by balancing energy harvesting and consumption while delivering high-quality data in a timely manner. To enable WESS benchmarking, the PI extends the B# battery emulator to emulating environmental stimuli and non-ideal power sources with full reproducibility. To advance the field of WESS based on concrete, measurable results from actual applications, the PI assembles and distributes a comprehensive, real-world benchmark suite, emulation-based evaluation framework, and the WESS architecture openly to the research community at large. The PI evaluates WESS architectures by actual deployment with collaborators in civil and mechanical engineering, medicine, and performance art while advancing the state-of-the-art in these fields. The compelling application drivers make project courses rewarding for students and add excitement to outreach activities particularly for women and minorities.","title":"CAREER: Design Optimization and Quantitative Evaluation of Wireless Embedded Sensing Systems","awardID":"0448668","effectiveDate":"2005-04-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["421837"],"PO":["535244"]},"107978":{"abstract":"OISE 0525345<br\/><br\/><br\/>This award will provide the U.S. government contribution to the Second Phase of the World Summit on the Information Society (WSIS II), to be held in Tunis in November 2005. The UN General Assembly in 2001 endorsed the holding of the World Summit on the Information Society (WSIS) in two phases. The first phase was held in Geneva, Switzerland in 2003. Through this award, the US National Committee for CODATA (the Committee on Data for Science and Technology of the International Council for Science - ICSU) will compile an inventory of US public sector scientific and technical activities that respond to the action items proposed in the WSIS I Agenda for Action for formal submittal by the US Department of State. This will involve a broad search of internationally focused projects and programs of US government agencies, universities and non-governmental organizations that are responsive to the relevant action items in the WSIS Agenda for Action, with primary focus on developing countries. The report will be available to the public and widely disseminated. The U.S. National Committee for CODATA will also work with other foreign science and technology organizations to coordinate activities and develop common positions for WSIS II.","title":"Scientific and Technical Information Issues in the World Summit on the Information Society: Promoting U.S. Interests and Activities","awardID":"0525345","effectiveDate":"2005-04-15","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["499569"],"PO":["323582"]},"101676":{"abstract":"ABSTRACT<br\/>OCE-0451951<br\/><br\/>The study has two components: (i) numerical and theoretical studies of nonlinear coherent structures and waves in the ocean and atmosphere and (ii) the further development of high-order numerical algorithms, especially spectral methods. Pseudospectral\/Newton\/continuation numerics will be applied to three species of coherent structures: equatorially-trapped Kelvin waves in the sea, Tropical Instability Waves (TIW's) in the ocean, and large-amplitude baroclinic vortices in the atmosphere. The singularity of the slope-discontinuous Kelvin corner wave motivates one of the proposed numerical topics: blending ?lters and rational Chebyshev reconstruction to improve the ability of spectral algorithms to cope with shocks, fronts, and other singularities. Also, the struggle to solve discretized nonlinear eigenvalue problems for coherent structures has led to new methods for computing the roots and algebraic varieties of polynomials expressed in Chebyshev, Legendre, tensor-product Legendre or spherical harmonic form. These geophysical problems together with broader need for improved \"dynamical cores\" for weather forecasting and climate modelling motivate the other proposed numerical studies. One is further experimentation and theory for a prolate spheroidal basis, instead of the usual Legendre polynomials, in spectral element codes. Another is improved blending of regional spectral models and data analysis schemes into global models through C8 windowing and local Fourier basis (Coifman-Meyer basis) ideas. This extends, through closely-related mathematics, to the fundamental problem of applying global spectral methods on irregular domains: the proposed work will build upon the PI's previous studies in this area.<br\/><br\/>The topics, both geophysical and numerical, are still full of questions. Why does the Cnoidal\/Corner Wave\/Breaking bifurcation of the Kelvin wave occur in so many other kinds of wave species including ordinary surface gravity water waves? What is generic about this bifurcation? What is nongeneric? Why do Tropical Instability Waves evolve to quasi-steady translating vortices resembling solitons in shear? Why are baroclinic vortices in the atmosphere unstable, self-focusing into wavepackets, intermittent instead of steady? Are Legendre polynomials, with their highly nonuniform grid, really the best way to do high order p-type ?nite elements or spectral elements? Can a combination of ?ltering and reconstruction using rational Chebyshev functions succeed well where one or the other has succeeded only partially for shocks & fronts? How can one ?nd the level curves of a truncated spherical harmonic or multidimensional Legendre series without the numerically ill-conditioned step of converting to an ordinary multivariate polynomial?<br\/><br\/>Broad Impact<br\/>Kelvin waves are the main oceanic component of the coupled ocean-atmosphere oscillation known as El Nino, whose droughts and heavy rains have a large global impact. Baroclinic instability is the main engine of large-scale weather in the middle latitudes. Spectral methods are widely used in almost all branches of science and engineering from simulations of gravity waves in general relativity to seismic waves in the earth to sloshing ?ows in the engine of an automobile; fronts, shocks and other high-gradient regions are a ubiquitous complication in most of these ?elds: a good ?lter\/recontruction procedure will have very wide applicability. There are many technical advantages to Fourier series for regional data analysis and modelling of the weather and climate; better blending and extension methods for limited-area spectral series will therefore have immediate societal bene?ts. The powers-of-x form of polynomials is notoriously ill-conditioned; root?nding methods for the Chebyshev form will be valuable in every ?eld where ?nding roots is important. On the human side, a graduate student will be trained broadly in both geophysics and computational techniques. Several undergraduates will also participate in research, through university-funded programs.","title":"Solitons and Wavepackets in the Ocean and Atmosphere and High-Order Numerical Algorithms","awardID":"0451951","effectiveDate":"2005-04-01","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1610","name":"PHYSICAL OCEANOGRAPHY"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"5740","name":"CLIMATE & LARGE-SCALE DYNAMICS"}}],"PIcoPI":["472322"],"PO":["563981"]},"101016":{"abstract":"The design of systems that can detect and recognize objects in large image and video repositories will enable significant developments in areas as diverse as life sciences, surveillance and law enforcement, entertainment, advertisement, and copyright protection, among others. While significant progress has been achieved in this area over the last decades, the design of such systems still requires vast amounts of expert knowledge and manual labor. This project lays the foundation for a long-term vision of recognition systems containing banks of recognition modules fully trainable by naive users, with minimal requirements in terms of manual data pre-processing and computational complexity. From a technical standpoint, the project addresses two fundamental barriers in the path to this objective: 1) the dependence of current classifiers on carefully assembled and pre-processed training sets, and 2) the training complexity of state-of-the-art classification architectures. The first is addressed through the introduction of a new statistical learning framework, denoted by weakly supervised assembly of training sets, which combines elements of discriminant visual saliency and image matching to automate the process of assembling the training sets required for detection and recognition. The second is addressed through the introduction of new, and computationally efficient, boosting methods for the design of cascades of large-margin classifiers, with support for both template and constellation-based object representations. At the educational level, the project will contribute to the advancement of the coverage of the recognition problem, through the introduction of new courses, and the development of a software library to be used as a teaching aid in visual information retrieval courses. The design of this library will also provide research opportunities for students from underrepresented backgrounds at a scale well beyond what can usually be found at the undergraduate level.","title":"CAREER: Weakly Supervised Recognition","awardID":"0448609","effectiveDate":"2005-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["513306"],"PO":["564316"]},"104506":{"abstract":"Traditional cellular wireless networks have limited capacity because of the scarcity of available spectrum and inefficient spectrum reuse. To overcome these limitations new regulatory policies are being considered to allow segments of spectrum to be dynamically shared. This project uses dynamically allocated spectrum to form multi-hop relay networks consisting of mobile nodes that forward data to base stations on behalf of each other to increase network capacity. In this work we address two challenges: (1) rapid dynamic network formation and (2) verifying and accounting for which part of the spectrum is used by which nodes. The first problem is important because it is likely that many (tens or hundreds) of nodes may attempt to join a relay network, resulting in high overhead and network formation latency. The second problem is important for motivating users to participate and compensating service providers for sharing spectrum. Algorithms for scheduling and network formation are being designed and evaluated in this work. These algorithms provide low latency and overhead, and include provisions for verifying which nodes participate in the relay network. The presence of base stations is also leveraged to quickly disseminate information to assist in relay network formation.","title":"SGER: Exploratory Research on Relay Networks of Agile Radios","awardID":"0508114","effectiveDate":"2005-04-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550356","518380"],"PO":["7594"]},"100954":{"abstract":"Title: Computation Platform for the Design of Hybrid Systems<br\/>PI: Takkuen John Koo, Dept. of EECS, Vanderbilt University<br\/><br\/>Abstract<br\/>From home appliances to aircraft and from medical devices to power distribution<br\/>networks, embedded software systems monitor and control our physical world in a<br\/>computational manner. The goal of this NSF CAREER Development project is to <br\/>develop the theoretical foundations, design tools and education programs to enable the <br\/>modern system engineers to effectively and efficiently design embedded software based <br\/>on hybrid systems theory for performance-critical and safety-critical applications.<br\/>The research has four focus areas of research. (a) Multi-resolution Computation <br\/>of Interface Evolution. The focus here is to develop computational methods,<br\/>by combining the Level Set Methods with the Multi-resolution Analysis, for computing<br\/>the evolution of interfaces of high-dimensional continuous systems with level-of-control<br\/>in solution resolution. (b) Model-Based Computation Platform. The goal is to<br\/>develop a computation platform that allows systematic construction of algorithms for the<br\/>design of hybrid systems and enables automatic synthesis of associated embedded<br\/>software. (c) Experimental Research. Two experimental testbeds, which are a FPGAbased reconfigurable power electronic circuit and a multi-vehicle <br\/>multi-model system, provide case studies for the computational methods <br\/>and software tools developed in this research. (d) Improving Undergraduate and <br\/>Graduate Education. The research advancements made in this research <br\/>would be integrated into an Interdisciplinary Curriculum that combines lecture and laboratory instruction in the design of hybrid systems for both undergraduate <br\/>and graduate education. The broader impact on society made by this CAREER Development Plan is the generation of new paradigms and tools for the design <br\/>of complex embedded software systems to ensure reliability and performance.","title":"CAREER: Computation Platform for the Design of Hybrid Systems","awardID":"0448234","effectiveDate":"2005-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[266289],"PO":["561889"]},"100756":{"abstract":"The focus of this proposal is on the effective use of parser-derived and tagger-derived features within discriminative approaches to language modeling for automatic speech recognition. Discriminative<br\/>language modeling approaches provide a tremendous amount of flexibility in defining features, but the size of the potential parser-derived feature space requires efficient feature annotation and selection algorithms. The project has four specific aims. The first aim is to develop a set of efficient, general, and scalable syntactic feature selection algorithms for use with various kinds of annotation and several parameter estimation techniques. The second aim is to develop general tree and grammar transformation algorithms designed to preserve selected feature annotations yet lead to faster parsing or even tagging approximations to parsing. The third aim is to evaluate a broad range of feature selection and grammar transformation approaches on a large vocabulary continuous speech recognition (LVCSR) task, namely Switchboard. The final aim is to design and package the algorithms to straightforwardly support future research into other applications, such as machine translation (MT); and into other languages, such as Chinese and Arabic. The algorithms developed as a part of this project are expected to contribute to improvements in LVCSR accuracy and applications that rely upon this technology. The algorithms are being packaged into a publicly available software library, enabling researchers working in many application areas including LVCSR and MT and various languages to investigate best practices in syntactic language modeling for their specific task, without having to hand-select and evaluate feature sets.","title":"CAREER: Discriminative Syntactic Language Modeling: Automatic Feature Selection and Efficient Annotation","awardID":"0447214","effectiveDate":"2005-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["467640"],"PO":["565215"]},"100977":{"abstract":"The primary goal of this research effort is to improve the effectiveness of skill transfer, rehabilitation, and collaboration via haptic devices. To do so, the PI will formulate requirements for shared control between humans and robots in haptic systems designed for training, rehabilitation, and collaboration. An experimental test-bed comprised of two commercial haptic devices with force sensing capabilities will be employed throughout the project. The PI will study two shared control system architectures for skill transfer. In the first, the human acts as the novice or patient, and the robot serves as the expert. Control schemes for the expert system (the haptic device) will be designed and analyzed theoretically and experimentally. The second phase of the research effort will explore human-robot-human interfaces. Here, the PI will focus on expert-novice and therapist-patient teams, with a robotic system acting as the mediator between the two. <br\/><br\/>The intellectual merit of this research and education plan is that human factors and control system design will be used to develop effective human-robot systems for skill transfer and rehabilitation. A set of fundamental human-robot interaction issues will be addressed theoretically and experimentally: (1) the design of system architectures for effective skill transfer between humans and robots, (2) skill transfer between human-human teams as a model for human-robot interaction, and (3) the design and implementation of control algorithms that promote efficient skill transfer by effectively controlling feedback to each member of the system. <br\/><br\/>The broader impacts of this work are improved health care through more efficient and effective robot assisted rehabilitation practices, enhanced skill training for defense and surgical applications, and improved understanding of human-robot interactions for skill transfer. Specific education goals are to create innovative laboratory modules using haptic devices to enhance student learning of important engineering concepts, reinvigorate an introductory robotics course to include hands-on experiments with haptics and robotics, and high school outreach that includes internships, days-on-campus, and demonstrations using haptics to encourage students to pursue careers in science and engineering. Each of these educational goals ties closely to the PI's existing NSF support for curriculum enhancement, and further supports her commitment to combining research and education into a cohesive and integrated career plan","title":"CAREER: Shared Control for Skill Transfer in Human-Robot Haptic Interactions","awardID":"0448341","effectiveDate":"2005-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["532891"],"PO":["491702"]},"100901":{"abstract":"The overall goal of this project is to explore novel summarization models for semi-structured data, in order to enable approximate query answering within data-centric and document-centric databases. The following key problems are investigated:<br\/><br\/>(a) Approximate query answering for data-centric XML databases. The project explores summarization models that capture both the structural and the value-based characteristics of a semi-structured data set. The developed models take into account the heterogeneity of the value content and can be dynamically maintained when the base data is modified.<br\/><br\/>(b) Document-centric XML summarization. A summarization model is explored that enables the approximate computation of distance, under various metrics, between a summarized document and an input query. The project investigates the application of this model in approximate query answering for document retrieval queries, as well as its integration within the query processing engine for the fast computation of candidate matches.<br\/><br\/>(c) Relational synopses for join queries. A novel class of relational synopses is explored that uses summarization models for semi-structured data in order to approximate the statistical characteristics of a relational database.<br\/><br\/>The results of this research are applicable in areas that involve the exploration of large semi-structured data sets, e.g., scientific databases or digital libraries. To facilitate the evaluation of the proposed techniques in these target areas, system prototypes will be developed and be made publicly available. The project will train graduate and undergraduate students on data reduction and approximation techniques, while the resulting publications, collected data sets, and developed software will be made available on the web for broader dissemination.<br\/><br\/>http:\/\/www.cs.ucsc.edu\/~alkis\/APX\/","title":"CAREER: Novel Summarization Techniques for Semi-Structured Data","awardID":"0447966","effectiveDate":"2005-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["542080"],"PO":["543481"]},"100903":{"abstract":"This CAREER project develops, implements, and validates Orchestra, a general middleware layer for supporting collaborative data sharing: the effective exchange of data and updates between loose confederations of scientific collaborators who may disagree about their preferred schema, or even about which data items or updates are correct. The proposed methodology is \"peer-to-peer\" and \"bottom-up\" in style: it provides mechanisms by which one can rapidly join a data sharing confederation, by mapping a new data source to existing schemas within the confederation and then specifying what updates are to be trusted and accepted. The primary means of data exchange is through reconciling modifications made locally with those (trusted) updates made elsewhere; operations from elsewhere can always be overridden locally. Additionally, the research develops mechanisms for globally querying across all data sources and schemas. The work naturally extends techniques from data integration and peer data management.<br\/><br\/>Broader Impact: This work enables greater data sharing in the scientific community, especially bioinformatics: it focuses on the use, derivation, and sharing of information in bioinformatics databases and warehouses, and it will be evaluated in such applications. The developed system will be disseminated on the Web and promoted through seminars delivered at the Penn Center for Bioinformatics and the regional Greater Philadelphia Bioinformatics Alliance, as well as other scientific forums. The research project will be integrated into an educational program (graduate and undergraduate) to teach data management in the broader context, focusing on data integration and exchange as well as traditional databases.<br\/><br\/>http:\/\/www.cis.upenn.edu\/~zives\/orchestra\/","title":"CAREER: Orchestra - Managing the Collaborative Sharing of Evolving Data","awardID":"0447972","effectiveDate":"2005-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["517980"],"PO":["469867"]},"100926":{"abstract":"The goal of this project is to investigate tractable approaches to large-scale correspondence problems in computer vision and robotics. Correspondence is a central problem in many vision and robotics applications, and the proposed research centers on three of those: large-scale 3D reconstruction from digital imagery in space and time, simultaneous localization and mapping using mobile robots, and tracking large numbers of visually similar objects, such as ants in an ant-hill or people in a crowd. To eclipse existing state of the art methods, this proposal aims to investigate approximate inference through Markov chain Monte Carlo (MCMC) sampling. MCMC provides an approximate solution for an otherwise intractable problem, and has a number of attractive advantages with respect to other approaches. In addition, practical insights gained in applying MCMC to this problem can cross-pollinate other fields and spawn new theoretical investigations. In terms of broader impact, this project's integrated research and education plan will help produce a next generation of researchers, intimately familiar with these new methods first discovered in statistical mechanics. In addition, the project has a strong outreach component through museum exhibits and interaction with local high schools. Taking a longer view, the proposed research will enable novel and large-scale<br\/>applications of computer vision and robotics that are expected to have far-reaching<br\/>implications for society. Robots are on the verge of playing a much larger role in our lives, as evidenced for example by the increasingly popular consumer robots now available. More immediately, the advent of cheap digital photography and video is exponentially increasing the volume of digital imagery that can be used, analyzed, and re-synthesized in new and creative ways. The correspondence problem lies at the heart of many of these novel uses.","title":"CAREER: Markov Chain Monte Carlo Methods for Large Scale Correspondence Problems in Computer Vision and Robotics","awardID":"0448111","effectiveDate":"2005-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["485377"],"PO":["564316"]},"99231":{"abstract":"This project addresses a problem domain related to the design of Discrete Event Dynamic Systems (DEDS). The goal of the project is to identify tractable synthesis of supervisory policies that control those systems. Examples of DEDS include: air-traffic control systems; automated manufacturing systems; computer networks; integrated command, control, communication and information (C3I ) systems; operations-management of multi-component organizations with event-driven dynamics like shipyards, airports, hospitals, etc. Despite the myriad and diverse applications for DEDS, advances in core aspects of supervisory control of DEDS have not found application beyond academia, primarily due to the fact that synthesis procedures require complete specification of the desired behavior of the system, a difficult, if not impossible task. Even when complete specifications are available, the synthesis of the appropriate supervisory policy can be intractable. This project develops a normative theory of how DEDS should be structured so that, starting from a supervisory policy that enforces an incompletely specified behavior, progressive supervisory corrections can be applied such that the (complete) desired specification is eventually enforced.<br\/><br\/>The supervisory policy advocated by this project is based on analysis of observed \"desirable\" and \"undesirable\" states of a system. This project focuses on three areas of DEDS: (1) Learning phase: the development of learning algorithms for supervisory systems where desired behavior can be easily earned\/identified using examples\/counter-examples, (2) Supervisory policy synthesis phase: the identification of DEDS structures where learning is tractable, and (3) Progressive improvement phase: the development of methods for improving learned behavior that can be progressively improved with little computational effort as additional information is made available.<br\/><br\/> The successful resolution of the open research topics related to this project may mean that idiosyncratic problems in each of the examples of DEDS described above (air-traffic bottlenecks, dead-lock\/live-lock in automated manufacturing, poor quality of service in networks, poor triage services in the emergency room of a hospital, etc.) could be eliminated.","title":"SoD: A Normative Theory for the Design of Discrete Event Dynamic Systems for Supervisory Control","awardID":"0437415","effectiveDate":"2005-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["383890"],"PO":["557609"]},"98198":{"abstract":"The SecureCore project will investigate and design a secure integrated core architecture for trustworthy operation of mobile computing devices consisting of: a security-aware general-purpose processor, a small security kernel and a small set of essential secure communications protocols. The research will use a \"clean slate\" approach to define a minimal set of fundamental architectural features required for such a secure core, for use in resource-constrained, ubiquitous computing platforms exemplified by secure embedded systems (e.g., computer in a heart monitor), pocket devices (e.g., contact-less smart card), and mobile computing devices (e.g., handheld web-enabled computer). This approach shows what is possible when security is designed in at the beginning rather than added as an after-thought. It also changes the design paradigm from an emphasis on performance to one on trustworthy, dependable operation. The goal is to achieve the desired security levels without compromising performance, size, cost, energy consumption, or usability. Threat models will be re-examined in the new context of continuously networked commodity devices and Internet-scale epidemics such as DDoS, worms and viruses. The broader impact is to provide the scientific basis for trustworthy computing, communications and storage in pervasive computing environments. SecureCore impact will be immense if its architecture influences the design of future trustworthy commodity products, as well as the curriculum for computer hardware and software engineering education.","title":"Collaborative Research: SecureCore for Trustworthy Commodity Computing and Communications","awardID":"0430487","effectiveDate":"2005-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T470","name":"DARPA-NSF CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T951","name":"DARPA - CYBER TRUST PHASE III"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V933","name":"DARPA-CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["518483","561963"],"PO":["529429"]},"98210":{"abstract":"The SecureCore project will investigate and design a secure integrated core architecture for trustworthy operation of mobile computing devices consisting of: a security-aware general-purpose processor, a small security kernel and a small set of essential secure communications protocols. The research will use a \"clean slate\" approach to define a minimal set of fundamental architectural features required for such a secure core, for use in resource-constrained, ubiquitous computing platforms exemplified by secure embedded systems (e.g., computer in a heart monitor), pocket devices (e.g., contact-less smart card), and mobile computing devices (e.g., handheld web-enabled computer). This approach shows what is possible when security is designed in at the beginning rather than added as an after-thought. It also changes the design paradigm from an emphasis on performance to one on trustworthy, dependable operation. The goal is to achieve the desired security levels without compromising performance, size, cost, energy consumption, or usability. Threat models will be re-examined in the new context of continuously networked commodity devices and Internet-scale epidemics such as DDoS, worms and viruses. The broader impact is to provide the scientific basis for trustworthy computing, communications and storage in pervasive computing environments. SecureCore impact will be immense if its architecture influences the design of future trustworthy commodity products, as well as the curriculum for computer hardware and software engineering education.","title":"Collaborative Research: SecureCore for Trustworthy Commodity Computing and Communications","awardID":"0430598","effectiveDate":"2005-04-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T470","name":"DARPA-NSF CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T951","name":"DARPA - CYBER TRUST PHASE III"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V933","name":"DARPA-CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["427568","561510","561510"],"PO":["521752"]},"107173":{"abstract":"CISE Special Projects Program - FY05<br\/><br\/>CRA-W has been funded by the CISE Special Projects program to support the 2005 Career Mentoring Workshop for Women in Research Careers in Computer Science and Engineering, to be held in April 2005 in Washington, DC. The workshop will target women in universities and national and industrial laboratories where a substantial research program is important. The workshop will have two tracks: industry and government lab researchers, and pre-tenure academic researchers.","title":"Workshop: Support for the CRA-W Career Mentoring Workshop for Women in Research Careers in Computer Science and Engineering; Washington, DC","awardID":"0520856","effectiveDate":"2005-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["527984"],"PO":["564181"]},"107890":{"abstract":"We propose to hold a one and a half day workshop in Ann Arbor during the month of May 2005<br\/>(exact dates to be determined) to gather together key contributors to the field of active<br\/>sensing and sensor management. We will discuss the state-of-the-art in active sensing<br\/>research, the main mathematical approaches to design and performance approximation, the<br\/>problems solved and the problems remaining. This workshop will be a launching point for a<br\/>monograph on active sensor management written by the workshop participants.","title":"Active Sensor Management Workshop","awardID":"0524865","effectiveDate":"2005-04-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"V974","name":"DARPA-ACT SENSOR MGMT WKSHP"}}],"PIcoPI":["518010"],"PO":["348215"]},"98204":{"abstract":"The SecureCore project will investigate and design a secure integrated core architecture for trustworthy operation of mobile computing devices consisting of: a security-aware general-purpose processor, a small security kernel and a small set of essential secure communications protocols. The research will use a \"clean slate\" approach to define a minimal set of fundamental architectural features required for such a secure core, for use in resource-constrained, ubiquitous computing platforms exemplified by secure embedded systems (e.g., computer in a heart monitor), pocket devices (e.g., contact-less smart card), and mobile computing devices (e.g., handheld web-enabled computer). This approach shows what is possible when security is designed in at the beginning rather than added as an after-thought. It also changes the design paradigm from an emphasis on performance to one on trustworthy, dependable operation. The goal is to achieve the desired security levels without compromising performance, size, cost, energy consumption, or usability. Threat models will be re-examined in the new context of continuously networked commodity devices and Internet-scale epidemics such as DDoS, worms and viruses. The broader impact is to provide the scientific basis for trustworthy computing, communications and storage in pervasive computing environments. SecureCore impact will be immense if its architecture influences the design of future trustworthy commodity products, as well as the curriculum for computer hardware and software engineering education.","title":"Collaborative Research: SecureCore for Trustworthy Commodity Computing and Communications","awardID":"0430566","effectiveDate":"2005-04-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T470","name":"DARPA-NSF CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T951","name":"DARPA - CYBER TRUST PHASE III"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V933","name":"DARPA-CYBER TRUST PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["528231"],"PO":["497499"]},"99436":{"abstract":"0438970<br\/>PI: Vaclav Rajlich<br\/>Wayne State University<br\/><br\/>Design of Incremental Change<br\/><br\/>Incremental change (IC) is at the core of many software engineering processes, including maintenance, iterative development, iterative enhancement, agile development, software evolution, and so forth. Design <br\/>of IC assesses IC alternatives and helps prevent the software decay. This research addresses design of IC in a novel way through combination of classical static program analysis and information retrieval. This <br\/>proposal builds on and brings together existing results from program analysis, information retrieval, classical object oriented design, and case studies of IC in order to explore techniques for IC design. It <br\/>involves validation of the proposed techniques through case studies on the evolution of a large and widely-used academic bioinformatics software system. The research will contribute to the Science of Design by producing design techniques for proposed IC of existing software and by obtaining new insights into the IC design. It will contribute directly to the improvement of software quality and to the reduction of software maintenance costs. It will build a software engineering foundation for the emerging agile development processes.","title":"SoD: Design of Incremental Change","awardID":"0438970","effectiveDate":"2005-04-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["374749","439289","511418"],"PO":["564388"]},"104140":{"abstract":"This Small Grant for Exploratory Research (SGER) project will extend data integration technologies in partnership with two Texas State agencies and the City of Gainesville TX on the topic of legacy criminal justice databases.<br\/><br\/>Technically the project will examine (1) architectural solutions to constructing mediated databases, and (2) new methods for automating schema matching. More specifically,the research will demonstrate the feasibility of representing the mappings between the virtual global database and the various data sources as XQuery queries. XQuery should provide efficiencies in processing the data, ability to describe the data mappings, and potential for improving standardization. The project's second task will address the schema matching problem among heterogeneous databases, investigating severalprocedures based on techniques already successfully employed in Computational Linguistics.<br\/><br\/>Intellectual Merit <br\/><br\/>This research is on integrated information technology related to the development of metadata and the use of automation of schema matching by means of linguistic based techniques. The work of the proposed study will be vertically integrated, with a significant amount of effort devoted to research on the principles underlying the proposed projects, development of practical technology based on the research, and demonstrations and test beds that illustrate the technology. The major goal of the proposed research will be the creation of a prototype information system for integrating legacy criminal justice information within the State of Texas. The effectiveness of the prototype will then be assessed and results of the evaluations will be used to develop generalpurpose approaches to data assimilation and schema integration.<br\/><br\/>Broader Impact <br\/><br\/>The proposed research will benefit the State of Texas by helping counties transmit legacy criminal justice data to the State's information system. By the end of the proposed research, the team will complete: (1) a prototype architecture and a set of specifications that support data integration of justice information; and (2) a set of tools and techniques for automated schema matching. Beyond the direct involvement of graduate students conducting research towards their theses and dissertations, the project will develop artifacts for courses in the areas of database, natural language processing, and machine learning. The research will involve undergraduate students and members of the nearby community.","title":"SGER: Investigating Research Problems Related to Exchanging Information from Heterogenous Data Sources","awardID":"0506024","effectiveDate":"2005-04-15","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["334005","564432"],"PO":["371077"]},"108035":{"abstract":"DCOSS (Distributed Computing on Sensor Systems) 2005 will take place in Marina del Rey, California during June 30 - July 1, 2005. The conference will provide a forum for researchers and practitioners to present their contributions related to the above high-level aspects of distributed sensor systems.<br\/><br\/>Intellectual Merit<br\/>The focus of the conference is on distributed computing issues in large-scale networked<br\/>sensor systems (including systematic design techniques and tools, algorithms, and<br\/>applications), but networking-related contributions that support high level abstractions<br\/>are also welcome. In addition to contributed papers, the meeting will also include keynote<br\/>addresses by leading researchers, a panel discussion, and a poster\/presentation session.<br\/><br\/>Broader Impact<br\/>Participation in conferences such as DCOSS 2005 is an extremely<br\/>important part of the graduate school experience. The conference provides an opportunity<br\/>to interact with more senior researchers, other graduate students and be exposed to<br\/>leading edge work in the field. The support requested will enable graduate students to<br\/>attend this important conference in the emerging area of networked sensor systems who<br\/>would otherwise be unable to attend DCOSS 2005.","title":"Education and Workforce: Student Travel Awards for DCOSS 2005; June 30 - July 1, 2005; Marina del Rey, CA","awardID":"0525670","effectiveDate":"2005-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["563658","501549"],"PO":["565272"]},"99328":{"abstract":"A large number of accidents have always been attributed to operator error. While automation has eliminated many types of operator error, it has also resulted in new types of operator error. Many of these new errors are the result of what human factors experts have labeled technology-centered automation, where designers focus most of their attention on the mapping from software inputs to outputs, on mathematical models of required functionality, and on the technical details and problems internal to the computer. Little attention is usually given to designing and evaluating software with respect to whether it provides transparent and consistent behavior that supports operators in their monitoring and control tasks. Human factors experts have tried to overcome what they call clumsy automation by changing the human interface to the automation, by changing operator training, or by designing new operational procedures to eliminate the human errors resulting from poor software design. These efforts have had only limited success. Some human factors researchers have concluded that training cannot and should not be the fix for bad design, and have called for more human-centered automation. If we can identify software design features that lead to human error, then we should be able to design software in such a way that errors are reduced without sacrificing the goals for which computers are being introduced, such as increased productivity and efficiency. Building on previous preliminary work by the PI, the goal of this research is to identify problematic software behavior (design features) that can lead to human operator error, to define algorithms for analyzing formal software specifications for these features, and to create new human-centered software design practices that will lead to reduced operator errors and safer systems. <br\/><br\/>Broader Impacts: Most researchers in human-computer interaction have focused on the design of the interface between the human and the computer. Software design, however, is starting to play an important role in accidents by confusing human operators and contributing to new types of human error. Very little is currently known about the relationship between software design and operator error. The potential benefits of developing this relatively under-researched area in the science of software design are obvious in terms of saving lives and property. In addition, students will get the opportunity to work in and learn about an interdisciplinary field that requires knowledge from both computer science and from psychology and human factors. The results of this research will be disseminated widely and incorporated into both undergraduate and graduate classes.","title":"Designing Software to Reduce Operator Error","awardID":"0438153","effectiveDate":"2005-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["296879"],"PO":["565227"]},"107794":{"abstract":"While the traditional method of note-taking is a practice rooted in the past, in the age of ubiquitous digital technologies a new Web-based note-taking paradigm is rapidly emerging. Students can no longer successfully conduct research in the library, work with group members, run experiments in the lab, or come to class equipped solely with a paper notebook and pen. Rather, they are now expected to record and assimilate, in different locations and at different times, information that comes from a variety of disparate digital sources in order to accomplish a wide range of tasks. To effectively do this, students need tools and access points that allow them to combine notes effectively from many sources and on multiple computer platforms. To lay the groundwork for the development of such tools, the PI will in this project examine how students' note-taking practices have evolved, how they differ from traditional paper-based note-taking, what the new expectations are for students in higher education, and how students' tasks and requirements dictate the need for new software tools. To these ends, she will interview up to 50 undergraduate and graduate students from a variety of disciplines and review their current note-taking habits, paying particular attention to questions of how and why they currently take academic notes electronically, where they take notes, where they store their notes, what the components of their notes are, what the source of their notes are, which tasks they currently have difficulty with and which they feel are well supported by existing tools. She will also interview up to 20 instructors and professors to learn how they utilize digital resources in their courses, and what they expect of students taking their classes in terms of accessing and integrating these sources.<br\/><br\/>Broader Impacts: This research is a necessary first step in assessing the need for software tools to assist students with their digital note-taking tasks. The PI expects the development of such tools to prove invaluable to society as a whole, by helping people in all walks of life manage their daily tasks.","title":"SGER: Student Notetaking in the Digital Age","awardID":"0524175","effectiveDate":"2005-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["345635"],"PO":["565227"]},"98009":{"abstract":"Early procedures and algorithms for digital orthophoto generation in the National Digital Orthophoto Program (NDOP) were based on historic US Geological Survey mapping operations, such as field control,aerotriangulation, the quarter-quadrangle-centering, 1:40,000 aerial photographs, and 2.5D digital<br\/>elevation models, some of which have not been updated in decades. Additionally, the Standard for Digital Orthophoto formulated by the NDOP has not considered the requirements of large-scale urban orthophoto generation. This collaborative project with USGS is intended to provide the technical base (algorithms, procedures, etc.) and experience needed for urban large-scale digital orthophoto creation for the near future national large-scale urban digital orthophoto deployment and the revision of the Standards for National Large-scale City Digital Orthophoto in the National Digital Orthophoto Program (NDOP). The project will build on an earlier small NSF grant which explored true orthophoto generation using existing algorithms and procedures. In that effort, the problems of the existing algorithms, and investigated potential techniques for solving them were identified. Phase II, (this project) will conduct a systematic, end-to-end scientific investigation, including:<br\/>o How to plan urban photogrammetric flying missions to minimize the impact of occlusion,<br\/>o How to effectively represent buildings (i.e., digital building model-DBM) for the detection of the<br\/>occluded and shadow areas when generating urban orthophotos,<br\/>o How to automatically (NOT manually) compensate for the occluded and shadowed areas from<br\/>conjugate areas in adjacent .slave. orthophotos,<br\/>o How to automatically (NOT manually) choose the .best. imagery and optimal seam lines when<br\/>refilling the occluded areas,<br\/>o How to automatically compensate for the missed wall information\/data in true orthophoto, and<br\/>o How to best deploy these technical improvements within the National Digital Orthophoto Standard<br\/>initiative.<br\/><br\/>The broad impacts from this project are expected to include: <br\/><br\/>(1) Develoopment of revised National Standards for Digital Orthophoto specifications to ensure that large-scale urban orthophoto products under the National Mapping Program (NMP) reflect current mapping and data policies and are accurate and consistent in style and content.<br\/>(2) All levels of government who will be users of large-scale urban digital true orthophotos. Recent advances in GIS technology have facilitated the integration of digital orthophotos, with an increasing variety of other geospatial data, into myriad applications. Traditional users of USGS orthophotos, like federal land and resource management agencies, will be principal users. <br\/>(3) Advances in true orthophoto generation that will be transferred to American industry to contribute to the competitiveness of these companies in the global GIS marketplace. ESRI Inc. joins this Phase II as a collaboratork and will be in a position to make direct use of project results.<br\/>(4) The developed procedures and algorithms, and the firsthand research results will be directly and immediately fed into photogrammetry and GIS courses at Old Dominion University and other academic institutions. The created experimental data sets,including original images, orthorectified images, DEM, urban spatial data, 3D urban model, etc., will be directly used in laboratory classes of photogrammetry and GIS.","title":"Urban True Orthophoto Generation and Its Standard Initiative - Phase II","awardID":"0429210","effectiveDate":"2005-04-01","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["258652"],"PO":["371077"]},"108312":{"abstract":"A huge amount of government information is available on the Web. The web sites containing that information are, however, often extremely complex and difficult to navigate. In this type of environment, simple queries are not very helpful in locating relevant information. The current information retrieval (IR) landscape, however, is dominated by simple queries because that is what Web search engines are good at doing. These simple queries generally help the user to find a good home page. In the case of government information on the web, however, a home page is often of little help in finding the right answers and, instead, a considerable amount of additional user effort is required. Most information needs would be better expressed as complex queries; current systems impose a bottleneck where users are forced to use keyword-based simple queries. Some types of professional searchers (e.g. intelligence analysts, paralegals) do formulate longer and more complex queries, but complex queries will only become common if systems are capable of providing good answers to those queries, and longer, grammatical questions were easier to ask. The latter issue will be eventually addressed by speech interfaces, but improving the capability of systems to handle complex queries represents the major long-term goal of IR. This award will support initial experiments with retrieval models for complex queries that go beyond the typical bag-of-words approach. There are two major issues that will be explored in the development of new retrieval models. First, in order to improve system robustness, models will be developed that more reliably capture topical relevance than our current models. . Second, in order to improve the system accuracy in the top ranked documents, models will be explored that more precisely capture topical relevance.<br\/><br\/> Intellectual merit of the proposed activity: <br\/><br\/>Answering complex queries is a hard problem, and one that has a long history of attempted solutions. There are a number of factors, however, that indicate that it should now be possible to make significant progress. In particular, there has been a recent surge of interest in a new approach to retrieval based on language models. The proposed research will leverage this recent work and study complex queries from a new perspective. <br\/><br\/>Broader impacts resulting from the proposed activity:<br\/><br\/> In the one-year time frame of this proposal, the award will support exploration of these new models to obtain preliminary results on their effectiveness with government information and on complex queries that are most representative of people with information needs related to government. This is a high-risk research project because of the lack of progress in this area in the past. The payoff of even moderate success will be high, however, as it will make the difference between a government information system returning a useful response to a query instead of either failing completely or providing very little assistance to the people seeking answers.","title":"SGER: Breaking the Keyword Bottleneck: Towards More Effective Access of Government Information","awardID":"0527159","effectiveDate":"2005-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["507668"],"PO":["371077"]},"95427":{"abstract":"Robot developers focus mostly on programming behaviors, particularly in regards to the robot's navigation and sensor systems. All too often, the human-robot interaction (HRI) design is an afterthought, if any thought is given to it at all. Lessons learned from decades of research in human-computer interaction (HCI) are rarely applied to robotic systems. In this project, the PIs will attempt to bridge this gap by studying existing human-robot interfaces and developing novel interfaces using HCI techniques modified for robot applications. To these ends, the PIs will first evaluate the current state of HRI for urban search and rescue, by studying the AAAI Rescue Competition and through formal testing with domain experts. Particular emphasis will be placed in this study on: discovering best practices for providing situation awareness in HRI where the operator is physically separated from the robot; discovering the best methods for HRI when switching autonomy levels in a robot system, either when the switch is robot-driven or human-driven; and investigating how HRI is affected when a robot can change its shape. The PIs will abstract from their study guidelines for designing effective HRI; these in turn will inform the PIs' design of a system for urban search and rescue, where the design of the robot's behaviors occurs simultaneously with the design of the robot's interface.<br\/><br\/>Broader Impacts: Evaluation methods for human-robot interaction in general, and improved HRI for urban search and rescue applications in particular, will directly benefit society as a whole. Insights acquired in this project into data presentation and fusion will inform the design of future human-machine systems that involve decision-making in safety-critical situations. Similarly, better understanding of the types of awareness required of the human in a human-robot system will impact the multi-user computing domain in general. Since robots often carry more than one on-board sensor (such as video and sonar), information visualization techniques developed during this project that combine disparate sensor information will be applicable to systems such as air defense systems or mass transit control rooms.","title":"Collaborative Research: Novel Approaches to Human-Robot Interaction","awardID":"0415224","effectiveDate":"2005-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["526078"],"PO":["565227"]},"104982":{"abstract":"This is funding to support a doctoral research symposium (workshop) of approximately 5 promising doctoral students from the United States, along with distinguished research faculty. The event will take place in conjunction with the 2005 Computer Supported Collaborative Learning (CSCL'05) conference, to be held May 30-June 4 in Taipei, Taiwan. CSCL'05 will be the 7th conference in the series, which began in 1995 and has become an internationally recognized forum for the exchange of research findings related to learning in the context of collaborative activity and the exploration of how such learning might be augmented through technology. An important theme in the CSCL conferences has been the development of an active student community. The 2005 Student Community Workshop will be a one-day event held prior to the start of the conference proper. Workshop objectives include providing a setting for mutual feedback on current research and guidance on future research directions, developing a supportive community of scholars and a spirit of collaborative research across institutions, and contributing to the conference experience of students by fostering interactions with peers and key faculty. Applications from PhD students at the dissertation stage will be reviewed by a 3-member committee chaired by the PI. Participants will be selected on the basis of their anticipated contribution to the workshop goals, with specific emphasis on forming a diverse group of high quality students to include underrepresented minorities and persons with disabilities. Successful applicants will present their doctoral research at the Workshop, and receive feedback from their peers and from an international group of senior faculty mentors. Because the 2005 conference will be held in Taiwan, it will offer a rare opportunity for students from the US to meet future colleagues from around the world, and especially from Asia, thereby promoting greater understanding by our students of scientific and technical developments in the East Asia and Pacific region. <br\/><br\/>Broader Impacts: This workshop will directly support the development of a strong student community in CSCL research. It will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Similar programs at other conferences have played a major role in building enduring and supportive ties within and between generations of researchers. Because the students and faculty constitute a diverse group across a variety of dimensions, the students' horizons are broadened to the future benefit of the field.","title":"Computer Supported Collaborative Learning Student Community Workshop","awardID":"0510274","effectiveDate":"2005-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["494943"],"PO":["565227"]},"101000":{"abstract":"ABSTRACT<br\/>0448501<br\/>Grigore Rosu <br\/>University of Illinois at Urbana - Champaign<br\/>TITLE: CAREER: Runtime Verification and Monitoring<br\/><br\/><br\/>This project addresses software development and analysis techniques that take runtime monitoring as a foundational principle. The proposed research is based on the idea that effective monitoring code is automatically generated from high-level, human-readable system requirements specifications, and then used to either detect or predict violations of requirements in software systems at runtime. The proposed techniques aim at detecting errors in complex software systems and at narrowing the gap between specification and implementation by allowing the former to play an active role in the execution of programs via monitoring and guiding.<br\/><br\/>Many aspects of the proposed research focus on designing and implementing monitor synthesis and integration algorithms. A generic method to add new requirements specification formalisms modularly and compactly to a runtime environment is designed. Techniques to detect not only errors that happened, but especially errors which were close to happen are developed, together with techniques to monitor complex concurrent systems in a decentralized manner. The proposed research is expected to lead to novel scalable techniques to detect errors in software systems, as well as to programming methodologies for robust and dependable software, thus having a direct impact on how high-quality software is being tested and developed.","title":"CAREER: Runtime Verification and Monitoring","awardID":"0448501","effectiveDate":"2005-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["549774"],"PO":["564388"]},"107513":{"abstract":"This workshop will expose to the research community a set of research needs identified by the U.S. Treasury Department as both high priority and medium to high research risk. Topics to be presented include: securing software environments including COTS software, technology to defend against insider cyber attacks, high reliability biometric identification systems, pattern recognition for asset movement, data replication technology, and technology to prevent or recover from widespread identity theft. Researchers with activities relevant to these areas will be identified and invited to participate in the workshop. The Treasury Department will coordinate participation of appropriate members of the financial community. The expected results of the workshop include improved opportunities for effective research and technology transfer that will mitigate some of the problems faced by the Treasury Department and the U.S. financial infrastructure overall. During the workshop, reports and briefings will also be produced.","title":"Workshop on Resilient Financial Information Systems","awardID":"0522217","effectiveDate":"2005-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["431190"],"PO":["521752"]},"95418":{"abstract":"Robot developers focus mostly on programming behaviors, particularly in regards to the robot's navigation and sensor systems. All too often, the human-robot interaction (HRI) design is an afterthought, if any thought is given to it at all. Lessons learned from decades of research in human-computer interaction (HCI) are rarely applied to robotic systems. In this project, the PIs will attempt to bridge this gap by studying existing human-robot interfaces and developing novel interfaces using HCI techniques modified for robot applications. To these ends, the PIs will first evaluate the current state of HRI for urban search and rescue, by studying the AAAI Rescue Competition and through formal testing with domain experts. Particular emphasis will be placed in this study on: discovering best practices for providing situation awareness in HRI where the operator is physically separated from the robot; discovering the best methods for HRI when switching autonomy levels in a robot system, either when the switch is robot-driven or human-driven; and investigating how HRI is affected when a robot can change its shape. The PIs will abstract from their study guidelines for designing effective HRI; these in turn will inform the PIs' design of a system for urban search and rescue, where the design of the robot's behaviors occurs simultaneously with the design of the robot's interface.<br\/><br\/>Broader Impacts: Evaluation methods for human-robot interaction in general, and improved HRI for urban search and rescue applications in particular, will directly benefit society as a whole. Insights acquired in this project into data presentation and fusion will inform the design of future human-machine systems that involve decision-making in safety-critical situations. Similarly, better understanding of the types of awareness required of the human in a human-robot system will impact the multi-user computing domain in general. Since robots often carry more than one on-board sensor (such as video and sonar), information visualization techniques developed during this project that combine disparate sensor information will be applicable to systems such as air defense systems or mass transit control rooms.","title":"Collaborative Research: Novel Approaches to Human-Robot Interaction","awardID":"0415168","effectiveDate":"2005-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[250214],"PO":["565227"]},"94978":{"abstract":"This project explores new locomotion techniques that will enable<br\/>robotic systems to recover from a variety of failures. The primary<br\/>focus is on a class of robot locomotion termed dynamically coupled<br\/>locomotion. The most familiar forms of locomotion, such as human<br\/>walking or automobile rolling, employ kinematic coupling. But<br\/>locomotory systems are subject to error conditions such as falling or<br\/>becoming high-centered. Recovery from such errors sometimes requires<br\/>locomotion modes that, while less efficient, are nonetheless essential<br\/>to the robustness and overall competence of the robotic system. One<br\/>example would be a six-legged robot that has become high-centered on<br\/>an obstacle such that its legs no longer reach the ground -- by<br\/>aggressively moving its legs it is possible to excite vibration modes<br\/>that cause the robot to gradually move off of the obstacle. The<br\/>specific goal of this project is to explore the theoretical and<br\/>practical capabilities of such locomotion modes, to survey their<br\/>potential application in mobile robotic systems, and to demonstrate<br\/>their usefulness in real robots. The main theoretical thrust of the<br\/>work is to characterize the motion capabilities of dynamically coupled<br\/>locomotion, and to synthesize motion patterns for mobile robots to<br\/>recover from errors. Experimental and simulation work will serve to<br\/>demonstrate and validate the research. Surveys of mobile robot<br\/>structures and failure modes will provide context and grounding to<br\/>assess the potential usefulness of the work.","title":"Automatic Gait Generation and Recovery for Mobile Robots","awardID":"0413251","effectiveDate":"2005-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":[249126,"560864"],"PO":["403839"]}}