{"152482":{"abstract":"North Carolina Agricultural and Technical State University (NCAT) proposes a novel, 2-way collaboration between HBCUs and research universities in order to increase the number of African Americans who obtain graduate degrees and enter faculty and research careers in computing. Alliance participants include HBCU's - NCAT, Bennett College, Dillard University, Jackson State University, and Norfolk State University - and majority, research universities - the University of Colorado, Georgia Institute of Technology, and Virginia Polytechnic Institute and State University. North Carolina State and the United Negro College Fund Special Programs will provide consulting. <br\/><br\/>The program will have three components. Firstly, it will strengthen undergraduate computing programs at the HBCUs by changing curriculum and pedagogy to include collaborative learning environments, discovery-based and hands-on learning. The Alliance will create research and educational experiences for undergraduates and graduate students providing authentic learning in the form of design, research, industry and workshop experiences. The students will be given social, academic, and career support through peer-, step- and faculty-student mentoring. Secondly, Alliance activities will institutionalize two-way research opportunities and teaching partnerships for students and faculty. This will be done with the development of joint research and teaching, both remotely and through student and faculty visits and exchanges. Faculty will partner on research teams and graduate student supervision. Thirdly, the Alliance will support ongoing research partnerships among faculty members and will provide pathways for HBCU students to pursue faculty careers after graduation. All of these activities are based on a unique, dual feeder model that allows some HBCU undergraduates to pursue Master's study at a research intensive HBCU (NCAT) before going on to Ph.D. study at a research university. The collaborations developed under this Alliance will be meaningful, two-way relationships that will be built from the PIs' experience in facilitating collaborations between research universities and HBCUs.","title":"BPC-A: Collaborative Research: Alliance between Historically Black Universities and Research Universities for Collaborative Education and Research in Computing Disciplines","awardID":"0910493","effectiveDate":"2008-10-01","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["425936"],"PO":["561855"]},"143440":{"abstract":"Experimental cybersecurity research is inherently risky. An experiment may involve releasing live malware code, operating a botnet, or creating highly disruptive network conditions. Realism is required in replicating attacks so that proposed defenses can be thoroughly tested and future attacks anticipated. This proposal, in addressing intellectual merit, seeks to develop a unique model for risky experiment management; enabling researchers to carry out experiments that interact with their larger environment while retaining both control and safety. The model forwarded here is based on a very simple line of reasoning: If the behavior of an experiment is completely unconstrained, the behavior of the host environment must be completely constraining, because it can assume nothing about the experiment; but, if the behavior of the experiment is constrained in some particular and well-chosen way or ways, the behavior of the host testbed can be less constraining, because the combination of experiment and environment constraints together can provide the required overall assurance of good behavior. The key benefit of this model is that both experimenter and testbed operator can proceed with assurance in carrying out a wide and interesting range of previously unsupportable experiments. The ultimate goal is to develop both implementation and formalization of this model, including logical tools to reason about experiment and testbed constraint composition (broader impact). Initial work will develop mechanisms to support the model in the DETER facility and similar Emulab-based testbeds.<br\/><br\/>The proposal was reviewed by panelists and received one Very Good, one Very Good\/Good and one Good. Panelists viewed all three elements of the proposal (risky experimentation support, dynamic health monitoring, and federation of testbeds) to represent contributions to the field, with the most valuable area of the three being risky experimentation support. The panel overall wanted to see a stronger case made for improving existing security testbeds in general, and particularly a tie in with current uses and needs of the DETER testbed by researchers. Panelists recognized the team as being well qualified for the work. If successful, the activities were viewed as advancing the state-of-the-art in experimental facilities for cybersecurity.","title":"CCollaborative Research: CT-M: Beyond Testbeds-Catalyzing Transformative Research and Education through Cybersecurity Collaboratories (BTCT)","awardID":"0831491","effectiveDate":"2008-10-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["458851","550312"],"PO":["497499"]},"143561":{"abstract":"This research project examines fundamental issues in the current Internet architecture, namely \"routable identity\", explicit trust\/reputation control, and security\/privacy considerations for online social networks such as Facebook and SecondLife. It posits a dramatic change in Future Internet\/networking design to facilitate future social communication systems. The research builds and evaluates this new design, and examines the potential social impacts and insights from it. The following research objectives are being studied: (1) Can a social peer generate, manipulate and protect all layers of routability toward his\/her own identity? (2) How should the notions of trust and reputation be explicitly and formally represented and embedded in a large-scale communication architecture? (Trust\/reputation become central in a network architecture based on social identities). (3) What are the trade-offs between the utilization of the social information by the network and the privacy protections needed for it? <br\/><br\/>For evaluation and validation, a social-network based communication system, named Davis Social Links (DSL), is being built, over Facebook, both to mimic the human communication model and to integrate social trust relationships into the network service infrastructure. Among its benefits, due to the routability design, the DSL architecture will offer a new take on prevention of unwanted traffic (denial of service and so on), a costly and urgent problem in the architecture as it is now. <br\/><br\/>The DSL project additionally investigates the communication model and its security and safety issues under virtual reality social systems such as SecondLife. The ultimate goal of the DSL project is to study a dynamic, scalable, trust-based, decentralized communication system\/architecture for large-scale networks (10 million ~ 10 billion nodes).<br\/><br\/>This multi-disciplinary project is a joint effort among academic researchers and industrial collaborators from computer science, sociology, statistics, and techno-cultural studies. The broader impacts of the research advance potentially both the understanding and the innovation of communication networks. As communications networks exist to support social purposes, the DSL research team carefully examines a number of implications regarding societal relationships and how the Internet user community can directly benefit that relationship.","title":"FIND: Davis Social Links","awardID":"0832202","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[382335,382336,"507838","550684"],"PO":["565090"]},"143451":{"abstract":"A deep, pervasive problem when attempting to secure modern computer networks arises from the bewildering range of applications that these networks carry.<br\/>Unless a specific application is understood, its presence cannot be soundly monitored and controlled. Yet we have seen in the past decade the rise and use of many hundreds of applications, a growth far outpacing the ability of security practitioners to apprehend their individual operation and implications. <br\/><br\/>This research effort aims to facilitate pervasive understanding and control of the wealth of application protocols running on today's networks. Developing in-depth visibility into these protocols will perforce lead to new capabilities for exposing the inner-workings of modern applications that have yet to be well understood within the community. Such understanding will provide pragmatic, high-impact functionality, since operators will be able to directly incorporate this information in their monitoring efforts.<br\/><br\/>A key goal of the undertaking is to facilitate the means by which the broader network research community can work together to jointly construct application analysis resources that are shared across the field. The project envisions a \"lingua franca\" for expressing application protocol structure and semantics that moves beyond the status quo by providing a common platform and language for expressing a wide range of semantics and analyses. While the focus within our project is on application analysis for purposes of monitoring and securing networks, the tools we develop will often lend themselves to repurposing in support of other networking concerns such as network management, trouble-shooting, and performance optimization.","title":"CT-L: Collaborative Research: Comprehensive Application Analysis and Control","awardID":"0831535","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["562327","563433","562329"],"PO":["497499"]},"143242":{"abstract":"Multi-user wireless communications systems form competitive environments, where heterogeneous and self-interested users compete for the limited spectrum resources. However, the techniques that have recently dominated multi-user communication research are not well suited for heterogeneous environments, because they usually assume transceivers that have similar standards and passively select their actions based on either complete or no knowledge about the competitors? protocols, utilities etc. Such passive system designs do not take advantage of the users? ?smartness? and may lead to inefficient spectrum usage. <br\/>In contrast, this research characterizes and constructs multi-user communications systems, where users engage in proactive interactions for dividing the spectrum. A new multi-user communication paradigm is proposed, where the interaction between users and their resulting performance is driven not only by their ability to adapt their communication strategies, but also by their ability to make optimal decisions about information exchanges based on their knowledge about their competitors and the environment. <br\/>The research has two main research thrusts. First, the investigators determine ?the value of knowledge?, which are the performance bounds that can be attained, when users and resource moderators with different amounts of knowledge about the entire communication system and the competing users interact. Moreover, how strategic users should proactively accumulate knowledge and improve their utility is also investigated. Second, the investigators construct operational algorithms that can approach these performance bounds, by systematically acquiring information about other users and deploying strategic learning solutions that enable them to forecast the other users? responses and, ultimately, to optimize their transmission actions. The ?values of learning?, which capture the performance gains for various strategic learning techniques requiring various information overheads and complexity costs, are also quantified.","title":"Knowledge and Strategic Learning in Multi-user Communications","awardID":"0830556","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["558132"],"PO":["564898"]},"143363":{"abstract":"National Science Foundation<br\/>NSF Cyber Trust Program<br\/><br\/>Proposal Number: 0831060<br\/>Principal Investigator: Ness Shroff<br\/>Institution: Ohio State University<br\/>Proposal Title: CT-ISG: Collaborative Research: Router Models and Downscaling Tools for Scalable Security Experiments<br\/><br\/>Project Summary<br\/><br\/><br\/>It is critical to protect the Internet from attacks such as denial of service, and attacks on inter-domain routing. Although several defenses have been proposed, actual deployments have been limited. A primary reason for this lack of deployment is that most defenses have not been validated under realistic conditions, or at sufficiently large scales. Many attacks also have second-order effects that are not well understood. This is because it is difficult to incorporate all the protocols involved at any reasonable scale in analytical, simulation, or emulation models or testbeds. This project includes two complementary efforts to address both the fidelity and scale challenges in security experiments by designing the following: (1) Router models: High-fidelity yet scalable models for routers and other devices will be designed that are based on simple device measurements under a few well-crafted scenarios. Both the queueing behavior in the data plane and resource consumption in the control plane will be considered. (2) Downscaling tools: Techniques will be developed to simplify experimental scenarios before studying them using simulation, emulation, or testbed experiments. Algorithms that can downscale an experimental scenario while still preserving the important queueing or routing characteristics of this scenario will be devised. Broader Impact: Development and public dissemination of general- purpose experimental tools, large-scale testing techniques, methodologies for the use of testing frameworks, and related graduate- level courseware will be undertaken. Significant outreach is planned to simulation and testbed teams, e.g., ns-3, C-BGP, and DETER (based on Emulab), and to industry, specifically Cisco, Intel, and AT&T. Students from under-represented minority groups in computer science and electrical engineering will be actively involved.","title":"CT-ISG: Collaborative Research: Router Models and Downscaling Tools for Scalable Security Experiments","awardID":"0831060","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["548182"],"PO":["565136"]},"145673":{"abstract":"As organizations tackle increasingly sophisticated problems, they seek methods for enhancing the collective intelligence of workgroups. A key problem is how to coordinate activity when the task definitions, task owners, and communication paths can be known only as the work unfolds. Can constraints be imposed on the behavior of workgroup members that are flexible enough to allow this kind of creativity, but structured enough to make best use of the group's cognitive resources? Many organizations find dynamic workflow to be a challenging problem and actively seek better methods.<br\/><br\/>This pilot project addresses the question of dynamic workflow using formal Workgroup Protocols as an organizing principle. The first step is to define an execution model for structuring the stream of tasks, without limiting the content of the tasks. The next step is to define explicit protocols for such common activities as planning, delegation, reporting, and so on. Finally, experiments will be conducted with human subjects, to test impacts on performance and general usability of the protocol framework.<br\/><br\/>The intellectual merit of this work rests in the novel approach to structuring collaborative work. Rather than relying on free-form communication to allocate cognitive resources, this research explores how design ideas from computer systems may be adapted to fit emergent cognitive activity, and what kinds of modifications would be needed.<br\/><br\/>The broader impacts of this work would be seen in three areas: (i) providing a new vision for managing knowledge work, with more dynamic control over accountability and transparency; (ii) setting a research agenda for developing tools, models, languages, and systems; and (iii) suggesting massively-collaborative structures, similar to Wikipedia, but with more intricate task dependencies and communication flows.","title":"SGER: Workgroup Protocols: Human Protocols for Synchronization of Task Planning, Execution and Information Exchange in Groups","awardID":"0841793","effectiveDate":"2008-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[388677],"PO":[388678]},"143396":{"abstract":"Answers to database queries often form the basis for critical decision-making. To improve efficiency and reliability, answers to these queries can be provided by distributed servers close to the querying clients. However, because of the servers' ubiquity, the logistics associated with fully securing them may be prohibitive; moreover, when the servers are run by third parties, the clients may not trust them as much as they trust the original data owners. Thus, the authenticity of the answers provided by servers in response to clients' queries must be verifiable by the clients. More generally, database responses are more useful if they contain the evidence of their own correctness. For example, this enables a consumer to provide her own credit report to a creditor without having the creditor request it from the reporting agency to establish the validity of the report. This project is developing methods for authenticating the validity and authenticity of a variety of database queries, including general relational, data cube, and spatio-temporal queries. Furthermore, techniques that use powerful cryptographic primitives are being developed for providing authentication and confidentiality. This research will enable utilization of this infrastructure in applications where users must rely on the authenticity of the answer, such as in financial systems, network monitoring, traffic control, or applications yet to be imagined. The results of this project will be disseminated through publications in journals and conferences. Furthermore, source code of these methods, in the form of libraries, will be made available over the web.","title":"CT-ISG: Collaborative Research: Towards Trustworthy Database Systems","awardID":"0831281","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["550881","449084"],"PO":["543481"]},"142693":{"abstract":"Understanding how animals perceive and act upon complex natural environments is one of the most pressing challenges in neuroscience, with applications that have potential to revolutionize not only our understanding of the brain, but also machine vision, artificial intelligence, and robotics. Until now, studying the neural basis of active vision - how visual stimuli give rise to eye movements under diverse task conditions - has largely been restricted to simplified laboratory stimuli, presented to overtrained animals performing stereotypical tasks. With funding from the National Science Foundation, the Canadian Institute of Health Research, and the National Geospatial Intelligence Agency, Dr. Douglas Munoz at Queens University in Canada and Dr. Laurent Itti at the University of Southern California will combine neurophysiology and computational modeling to investigate free viewing in natural environments. Using multi-electrode arrays, this project will record in a deep brain structure, called the superior colliculus (SC). The SC is a layered structure comprising several well-understood neural maps, from purely sensory representations in the superficial layers, to sensorimotor representations linked to the control of eye movements in the deeper layers. The project will start by characterizing responses of neurons in the SC under simple stimulus conditions: When the animal is simply looking at a central fixation cross on a display while small isolated patterns are presented at other visual locations; when the animal searches for an oddball item among an array of distracting items; and when the animal inspects natural images and video clips. The project will extend the investigators' salience map theories and models, and develop a new model of the SC. The complete model will predict, from any image or video clip, which visual locations are more salient, task-relevant, and candidate targets for eye movements.<br\/><br\/>The project leverages a cross-disciplinary collaboration between a neurophysiology lab (co-PI Douglas P. Munoz) and a computational modeling lab (PI Laurent Itti). This will allow, through the combination of experiments and modeling, the interpretation of an otherwise undecipherable mass of data collected during natural viewing. Conversely, the theories will guide further experiments. Coupling multi-unit recording with modeling during free-viewing of natural videos has never been attempted before, and it is expected that it will lead to new understanding of how percepts map into actions under natural conditions. The project will support undergraduate and graduate students, and post-doctoral researchers, who will benefit from exposure to combined physiological and computational techniques, as will the investigators' teaching. In addition to publications, all theory and algorithm source code will be freely distributed, and data will be available through the CRCNS data sharing web site. This research is hence expected to lead to new and broadly accessible fundamental advances in the understanding of how animals use visual information to guide behavior, and how one could build machines which act in similar ways when faced with the complex natural world.","title":"Neural Basis of Active Perception in Natural Environment","awardID":"0827764","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H448","name":"NATL GEO-INTELLIGENCE AGENCY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["549488",379872],"PO":["497328"]},"143441":{"abstract":"A deep, pervasive problem when attempting to secure modern computer networks arises from the bewildering range of applications that these networks carry.<br\/>Unless a specific application is understood, its presence cannot be soundly monitored and controlled. Yet we have seen in the past decade the rise and use of many hundreds of applications, a growth far outpacing the ability of security practitioners to apprehend their individual operation and implications. <br\/><br\/>This research effort aims to facilitate pervasive understanding and control of the wealth of application protocols running on today's networks. Developing in-depth visibility into these protocols will perforce lead to new capabilities for exposing the inner-workings of modern applications that have yet to be well understood within the community. Such understanding will provide pragmatic, high-impact functionality, since operators will be able to directly incorporate this information in their monitoring efforts.<br\/><br\/>A key goal of the undertaking is to facilitate the means by which the broader network research community can work together to jointly construct application analysis resources that are shared across the field. The project envisions a \"lingua franca\" for expressing application protocol structure and semantics that moves beyond the status quo by providing a common platform and language for expressing a wide range of semantics and analyses. While the focus within our project is on application analysis for purposes of monitoring and securing networks, the tools we develop will often lend themselves to repurposing in support of other networking concerns such as network management, trouble-shooting, and performance optimization.","title":"CT-L: Collaborative Research: Comprehensive Application Analysis and Control","awardID":"0831501","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["526903"],"PO":["497499"]},"143452":{"abstract":"Security is of primary importance in many modern computer applications, like electronic payments, personalized news broadcasts, location aware electronic services, automatic sharing and exchange of personal information for social networking, etc. Cryptography provides many technical tools that can be used to achieve security and privacy goals, but at a substantial computational cost. Traditionally, this cost has been measured in terms of the number and size of messages exchanged during the cryptographic protocol execution. However, such traditional efficiency measures are not representative of performance as perceived by the final user: the main efficiency measure of interest to the end user is real time, i.e., the amount of clock time elapsed since the user issues a request, till the moment the request is served. This is especially true for applications that run over an heterogeneous network like the Internet, where latency and bandwidth can substantially vary both across the network and over time. This project investigates the design and analysis of cryptographic protocols in a real time model, with two main objectives: (1) designing cryptographic protocols that are efficient with respect to realistic time complexity measures, as perceived by the end user, and (2) exploiting time itself as a tool to achieve security goals. For example, local timing constraints (e.g., delays and time-outs) can be used to enforce restrictions on the order in which events take place in a global execution environment. Time can also be used to introduce asymmetries between the capabilities of different parties similar to what is typically achieved using expensive public key cryptographic operations. Finally, the value associated to information usually varies with time: what is valuable confidential information today, may be publicly available tomorrow. This project will investigates all these different aspects of real time cryptographic protocol design, first focusing on zero-knowledge proof systems (a representative and very useful class of cryptographic protocols), and then, after appropriate models for timed cryptographic protocol execution have been developed, expanding our study to larger classes of applications.<br\/><br\/>Broader significance: Security is essential in many modern computer applications, and to ensure public confidence in the cyber infrastructure. Cryptography has developed many tools that can be used to secure electronic transactions, but still many cryptographic protocols are seldom used in practice because they are too complex or computationally expensive. This project investigates cryptographic protocols that make use of timed operations to achieve security goals at a reduced computational cost, and according to a metric directly related to efficiency as experienced by the end user. As such, the project will help making cryptography more usable and more used in practice.","title":"CT-ISG: Real Time Cryptography","awardID":"0831536","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["486529"],"PO":["565264"]},"143463":{"abstract":"Optical flow switching has recently emerged as a promising new approach to address the exponentially growing traffic demands in optical networks. In order to realize this new paradigm for optical networks, the core network must be capable of wavelength reconfiguration and service provisioning on time scales approaching one second or faster. The present methods used in wavelength division multiplexed (WDM) optical transmission are designed for static wavelength channels, which can increase in number over time and may be configurable to form different paths at the time of provisioning. Provisioning new wavelengths is a methodical, one at a time, step-wise process of ?turning up? the optical signal along the path, which requires minutes to hours in order to achieve the final stable state, appropriate for GMPLS networks. Furthermore, the extensive literature on optical transmission assumes this quasi-static network environment. <br\/><br\/>The intellectual merit of this project will be to determine both the practical and fundamental limitations on optical flow switched networks imposed by physical layer constraints, including optical transmission in a dynamic, wavelength switching environment. This goal is particularly challenging because of the multi-layer nature of the problem. The network topology and signaling protocols will dictate physical layer transmission requirements, such as how fast the optical signal must achieve an error free condition and over what transmission distance. Likewise the physical limitations both in terms of performance and cost will motivate design choices for the architectures and protocols. In order to address the multi-layer nature of optical flow switched networks, this GOALI project is proposed as a mechanism to utilize the novel optically transparent mesh network testbed facility within Bell Laboratories to extend the network architecture activities within the NSF funded NeTS-FIND Future Optical Network Architectures program at MIT. In particular, targeted experiments will be conducted in the testbed in conjunction with the optical flow switched network optimization studies at MIT. This new testbed has recently been used to study both the power dynamics and the transmission performance of signals in reconfigurable optical networks. These two elements are essential for understanding the physical layer in a transparent switched network and this facility is unique in that it combines these in a broadband, long haul transmission configuration, typical of core networks. <br\/><br\/>This university-industry collaboration will have broader impact at many levels. The problem of scaling optical networks to serve the dramatic rise in internet traffic has broad social ramifications. The project will enable cooperation between two synergistic research efforts to address this important problem: at MIT and at Bell Labs. The academic participants will have the opportunity to work in a premier industrial research laboratory and benefit from the knowledge and skills specific to that environment. In the process, the program will provide a unique opportunity to merge the traditions within both organizations of promoting individual driven","title":"GOALI-FIND: Optical Flow Switched Core Networks","awardID":"0831612","effectiveDate":"2008-10-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["483597"],"PO":["564993"]},"143375":{"abstract":"Computer security is a field in which defenses are pitted against adversaries. Thus, it is critical to understand the capabilities and motivations of the adversary if one is to plan effective defenses. However, modern Internet-based attacks are largely driven by economic factors that are only understood in the abstract. While we know that it is sufficiently cheap to compromise Internet hosts that large-scale botnets have become a compelling platform for launching attacks, we simply do not understand the scale of the revenue that that such activities bring in. While we understand that billions of spam e-mails are sent per day, the conversion rate of this spam ? the probability that a sent message will result in a ?sale? ? is largely unknown. Absent such information it is difficult to reason about the structural nature of the conflict between attackers and defenders.<br\/><br\/>Traditionally, obtaining information about the critical economic factors in Internet attacks is difficult because such information is only visible to the attacker themselves. Our research is focused on sidestepping this issue by infiltrating the technical infrastructure ? the botnets themselves ? used by Internet miscreants. Our technique, called ?distribution infiltration? provides a means to directly quantify key aspects of spam and phishing campaigns as well as to measure the impact of defenses on an economic footing (i.e., their impact on the profitability of e-crime). Our research will both refine these methodologies and produce concrete data for developing economic-based threat models of computer security.","title":"Collaborative Research: CT-M: Understanding and Exploiting Economic Incentives in Internet-based Scams","awardID":"0831138","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["525660","525661"],"PO":["493916"]},"143386":{"abstract":"Many applications of social networks require relationship anonymity due to the sensitive or confidential nature of relationship. Anonymizing graphs by replacing the identifying information of the nodes with random ids does not guarantee privacy since the identification of the nodes can be seriously jeopardized by applying subgraph attacks. This project is exploring new approaches with novel applications of matrix perturbation and spectrum analysis in privacy preserving social network analysis, and is developing new effective techniques and tools for edge-based social network randomization. Specifically, the project is investigating how well edge-based randomization protects link privacy and how much it affects the graph's utility. Utility loss is quantified by focusing on the change of the spectrum and eigenvectors of networks since both the spectrum and eigenvectors have close relation with many real space graph characteristics. Further, the project is developing spectrum\/utility preserving randomization methods which can better preserve graph characteristics without sacrificing much privacy protection. The research is advancing the theoretical understanding of fundamental issues related to both privacy and spectral analysis of social networks and the design and implementation of practical edge-based randomization techniques for publishing social network data. The research also involves, through courses and thesis projects, graduate and undergraduate students to enhance their knowledge and skills in privacy preserving social network analysis.","title":"CT-ER: Privacy and Spectral Analysis in Social Network Randomization","awardID":"0831204","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["492490"],"PO":["543481"]},"143067":{"abstract":"The development of high density, integrated circuit (IC) technology in the late 1970s has been a fundamental enabler for today?s computation and communication infrastructure. Despite their many advantages, silicon ICs are difficult, if not impossible, to fully utilize at the molecular scale for applications in biological science. The challenge arises from the need for environmental compatibility and single molecule sensing. Therefore, to date, silicon ICs have been limited to computational domains at the macro scale with few exceptions. Unfortunately, this prevents biological scientists from fully leveraging computing as a way to improve and accelerate their daily experiments.<br\/>Intellectual Merit? The proposed vision is to expand the computing domain by developing a fused sensor-compute node that is compatible with cells and is functional in aqueous fluids. This represents progress in two areas identified by the recent NSF Workshop on Nanoelectronics as important for the development of the EMT program: DNA-Based Electronics (EMT: BSSE) and Nanoarchitecture (EMT: NANO)[1]. To meet the challenges of this new domain this proposal explores resonance energy transfer (RET) logic on DNA nanostructures as a technology for biologically compatible fused sensor-compute nodes. The primary research component of this proposal is the fabrication and characterization of simple RET circuits and sensing modes on DNA grids.<br\/>The proposed research is highly interdisciplinary and requires that theoretical research (i.e., circuit and architecture design and evaluation) occur simultaneously with experimental research (i.e., fabrication and characterization). The previous collaborative research by the PIs on DNA nanostructures, nanoscale devices, circuits and architectures demonstrates the expertise necessary to successfully perform the research outlined in this proposal.<br\/>Broader Impacts? These research activities will involve undergraduate students in development roles through independent studies and summer research positions. Attention will be focused on engaging students from underrepresented groups. Recently, an African-American undergraduate student was involved with the PIs? other projects through an NSF-REU program run jointly by UNC and Duke. A graduating Ph.D. materials science student with a CS BSc was recruited through this same program and with continued support will take on a postdoctoral position working on DNA self-assembly and electrochemistry at Duke. Currently, three undergraduates are working in the group on research projects. This proposal will expand these efforts by working with the nationally recognized outreach programs at Duke run by Ms. Martha Absher.<br\/>Potential for Transformative Change? The integration of sensing and computation at the molecular scale expands the computing domain and enables the new paradigm of diffusion limited computation. This new paradigm has a wide variety of potential applications from querying the status of a cell to accelerating the progress of biomarker assays. This represents a fundamentally new way to apply computing to common problems in the biological sciences.","title":"EMT: MISC: Expanding the Computing Domain with Self-assembled Nanophotonics","awardID":"0829911","effectiveDate":"2008-10-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["555929","518001"],"PO":["565223"]},"147357":{"abstract":"To support the funding for travel of eligible graduate students from US institutions of higher learning to the 6th ACM Conference on Embedded<br\/>Networked Sensor Systems (SenSys 2008). Grant recipients will be required to attend the conference and participate in a bird-of-a-feather session to discuss their experience. The goal of the grants is to encourage research interest and involvement of students who are not well-funded, under-represented, or otherwise not likely to be able to attend high-profile conferences in the field. By financially facilitating attendance and generating discussion the grant will encourage such students to become active in the latest research directions in this important field. The Sensys conference will take place in Raleigh, NC, in November 2008. Sensys is a highly selective, single-track forum for the presentation of research results on systems issues in the area of embedded, networked sensors. It provides an ideal venue to address the resear ch challenges facing the design, deployment, use, and fundamental limits of these systems. Sensor networks require contributions from many fields, from wireless communication and networking, embedded systems and hardware, distributed systems, data management, and applications, so we welcome cross-disciplinary work. The author of this proposal is the General Chair of the conference. <br\/><br\/>To interest young researches in the field of networking technology and systems,<br\/>this proposal is to create a number of travel grants for student travel to Sensys. Grant recipients will be required to attend the conference and discuss this experience in a special session. The purpose is to encourage under-represented and under-funded students to become more actively engaged in research of interest to networking technology. An announcement to that effect will be made at the conference web page with an acknowledgement to NSF as the sponsor of the student travel grants. The proposal is to create 25 NSF-sponsored student travel grants of approximately $600 each, for a total of $15,000. This amount is payable as registration fees to cover participation cost. Eligibility criteria, listed in the project description, will be announced and a procedure will be put in place to select the most appropriate applicants in accordance with these criteria.","title":"Student Travel Support to Sensys 2008","awardID":"0848914","effectiveDate":"2008-10-15","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553633"],"PO":["535244"]},"143431":{"abstract":"This project is motivated by the fundamental question of whether it is possible to achieve verifiable end-to-end security properties by adding suitable security mechanisms on top of commercially available applications executing on an untrusted computing platform. A concrete example of such a scenario is provided by a user interacting with a bank's web server using a web browser running SSL. An important end-to-end security property in this context is protecting the confidentiality and integrity of the exchanged information and the user's password from malware and insider attacks on the local machine or the bank's server, as well as an active adversary trying to compromise the network communication. The untrusted computing platform here is the user's machine, which is running a commodity OS such as Windows or Linux and applications such as Internet Explorer or Firefox.<br\/><br\/>We believe that this goal can be achieved if one takes the approach of (1) minimizing the liability of security-property proof based on differentiated application services, and well-defined, useful properties of security-sensitive code, and (2) supporting the identified and proved properties by a security architecture that is compatible with commercially available platforms. Our system architecture includes novel components (e.g. trusted paths to local and remote security sensitive code) and integrates existing <br\/>technologies (e.g., hypervisors, isolated execution environments) in a way that minimizes the size of both system and security-sensitive application code, thus enabling formal verification.<br\/><br\/>The project will provide extensive educational opportunities for undergraduate and graduate students; research results will be integrated into courses at CMU and disseminated via technical publications, student internships, the CyLab Industrial Partners program, and the CMU Women@SCS roadshow program.","title":"CT-M: Realizing Verifiable Security Properties on Untrusted Computing Platforms","awardID":"0831440","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["468291","496764","475098"],"PO":["565327"]},"147831":{"abstract":"The IEEE COMPSAC2009 will be held in Seattle, Washington from July 20 to July 24, 2009. <br\/>This preeminent technical conference is the primary venue for presenting new research <br\/>results in the computer systems and software: theory and applications along with a number<br\/>of workshops with topics such as Security, Trust, Privacy for software; Barriers towards <br\/>Internet-Driven Information Services, Software Cybernetics, Open Complex <br\/>System - Metasynthesis of Computing Paradigms, and is widely attended by researchers and<br\/>practitioners in the field. Attending conferences such as COMPSAC is of paramount<br\/>importance for the research and career development of graduate students. Participants<br\/>have the opportunity to present their work, attend panel and keynote talk sessions, and<br\/>interact with many others performing leading-edge research in the field.<br\/><br\/>This proposal requests funding to support approximately 12 graduate students in the United <br\/>States to attend this premiere conference. The travel awards will target graduate students,<br\/>in particular, women and under-represented minority students, since attending conferences<br\/>is an important part of their educational experience, and they often have limited travel <br\/>funds.","title":"NSF Travel Grant Support for IEEE Computer Software and Applications Conference (COMPSAC) 2009","awardID":"0850818","effectiveDate":"2008-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["425155","425156"],"PO":["432103"]},"143365":{"abstract":"National Science Foundation<br\/>NSF Cyber Trust Program<br\/><br\/>Proposal Number: 0831068<br\/>Principal Investigator: George Kesidis<br\/>Institution: Pennsylvania State University<br\/>Proposal Title: CT-ISG: Collaborative Research: Router Models and Downscaling Tools for Scalable Security Experiments<br\/><br\/>Project Summary<br\/> <br\/> <br\/>It is critical to protect the Internet from attacks such as denial of service, and attacks on inter-domain routing. Although several defenses have been proposed, actual deployments have been limited. A primary reason for this lack of deployment is that most defenses have not been validated under realistic conditions, or at sufficiently large scales. Many attacks also have second-order effects that are not well understood. This is because it is difficult to incorporate all the protocols involved at any reasonable scale in analytical, simulation, or emulation models or testbeds. This project includes two complementary efforts to address both the fidelity and scale challenges in security experiments by designing the following: (1) Router models: High-fidelity yet scalable models for routers and other devices will be designed that are based on simple device measurements under a few well-crafted scenarios. Both the queueing behavior in the data plane and resource consumption in the control plane will be considered. (2) Downscaling tools: Techniques will be developed to simplify experimental scenarios before studying them using simulation, emulation, or testbed experiments. Algorithms that can downscale an experimental scenario while still preserving the important queueing or routing characteristics of this scenario will be devised. Broader Impact: Development and public dissemination of general- purpose experimental tools, large-scale testing techniques, methodologies for the use of testing frameworks, and related graduate- level courseware will be undertaken. Significant outreach is planned to simulation and testbed teams, e.g., ns-3, C-BGP, and DETER (based on Emulab), and to industry, specifically Cisco, Intel, and AT&T. Students from under-represented minority groups in computer science and electrical engineering will be actively involved.","title":"CT-ISG: Collaborative Research: Router Models and Downscaling Tools","awardID":"0831068","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["562302"],"PO":["565136"]},"147501":{"abstract":"Abstract<br\/><br\/>IIS - 0849511 <br\/>SGER: International Digital Sanskrit Library Integration<br\/>Govindaraju, Venugopal <br\/>SUNY at Buffalo<br\/><br\/>This SGER builds on discoveries made in IIS- 0 535038 and explores altogether new functionalities for the International Digital Sanskrit Library Integration project. The International Digital Sanskrit Library Integration project is createing a globally distributed, internet-based, digital library in Sanskrit, one of the world's richest culture bearing languages. This project will explore new feasibilities and functionalities associated with automatic OCR technologies for segmenting and structuring Sanskrit and other foreign language non-Roman script documents, including Arabic and Persian. The resulting integrated information system helps to overcome obstacles to internet research and study on scripts of particulary complexity and difficulty.","title":"SGER: International Digital Sanskrit Library Integration","awardID":"0849511","effectiveDate":"2008-10-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["548306"],"PO":["433760"]},"143266":{"abstract":"Abstract: Automated intrusive algorithms for numerical<br\/>simulation of partial differential equations via software-based<br\/>Frechet differentiation <br\/><br\/><br\/>Computers were invented to automate tedious and error-prone numerical<br\/>computations; ironically, programming computers is itself a tedious<br\/>and error-prone task. Given the importance and expense of developing<br\/>scientific simulation programs, it is worth studying whether computers<br\/>can improve the development, as well as the execution, of these<br\/>programs. This project focuses on the open-source software Sundance,<br\/>which automates transition from high-level mathematical abstractions<br\/>to high-performance, parallel partial differential equation (PDE)<br\/>simulation code, freeing users from the burden of low-level<br\/>programming. This approach can reduce simulator development time from<br\/>months or years to days or even hours. Less obvious, but equally<br\/>important, benefits of basing software firmly on mathematical<br\/>abstractions are that internal performance improvements can be<br\/>automated, and that intrusive algorithms -- algorithms that require<br\/>transformation of the equation set to produce nonstandard operators --<br\/>can be implemented much more easily because such transformations can<br\/>be carried out automatically.<br\/><br\/>This is enabled by formulating programming tasks as mathematical<br\/>problems whose solutions are then automated. Central to this is a <br\/>theorem establishing Frechet differentiation as a ``bridge'' between<br\/>high-level symbolic programming and high-performance numerical<br\/>computing. Previous work has laid the foundations for this; this<br\/>extends those results work to other aspects of PDE simulation and to<br\/>non-PDE paradigms such as density functional theory (DFT), and <br\/>investigates intrusive preconditioners for coupled multiphysics<br\/>problems. The combination of automatic high performance and<br\/>the ready availability of efficient intrusive algorithms for<br\/>preconditioning, sensitivity analysis, and PDE-constrained<br\/>optimization makes it possible for a high-level, general-purpose tool<br\/>such as Sundance to actually outperform hand-coded special-purpose<br\/>simulators. The ready availability of advanced optimization<br\/>algorithms with finite element discretizations for nonlinear coupled<br\/>systems, all with efficient implementation and a short development<br\/>cycle, will be transformative to how computational scientists work.","title":"Automated Intrusive Algorithms for Numerical Simulation of Partial Differential Equations via Software-Based Frechet Differentiation","awardID":"0830655","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["486475","552996","486477"],"PO":["565157"]},"143773":{"abstract":"This research develops shared-address-space (SAS) programming models for distributed computer architectures. Almost all of today's high-end computers (HEC) have a distributed system architecture. Programming such architectures is tedious and contributes to very high software costs. SAS programming is easier and leads to higher software productivity. Achieving the set goals of developing translators that efficiently execute SAS programs on distributed computer systems may have a large impact on the software industry and on the way software engineering for HEC is taught.<br\/><br\/>The specific research is motivated by recent successes of a new SAS model and compiler that has demonstrated to perform close to hand-coded message passing programs by successful translation of the OpenMP SAS model to MPI. <br\/>This project brings together expertise in programming models, compilers for parallel computing, compiler infrastructures, and languages for HEC, including HPF and OpenMP. The new system will allow current OpenMP programs to run on large HEC platforms, and will allow programmers to incrementally port and debug their sequential programs to utilize the OpenMP SAS model while achieving the benefits of larger-scale parallelism than is available on a single node. A number of novel compiler techniques, such as dynamic affinity optimizations, scalability enhancements, runtime array range detection, multicore integration, and parallel data-flow semantics will be developed and implemented in a prototype OMP-D (OpenMP for Distributed architectures) translator. The performance will be evaluated on a large set of benchmarks from the NAS, SPEC OMP, and SPEC MPI suites as well as several other HEC applications.","title":"OMP-D: Shared-Address-Space Model and Programming System for High-End Computing","awardID":"0833115","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7583","name":"ITR-HECURA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["558595","550995"],"PO":["565272"]},"143311":{"abstract":"In today?s digital age almost all aspects of both federal and commercial day-to-day operations are cyber-based. This heavy reliance on cyber-infrastructure requires security, as without security modern networks are susceptible to both internal and external attacks. This project will result in the advancement of our state of knowledge and our understanding of a number of fundamental cryptographic tasks needed for securing cyber-infrastructure. The efficiency of cryptographic tasks is typically measured in terms of computational load, communication bandwidth needed, and the number of rounds of interaction required. <br\/><br\/>The goals for this research include a study of public key encryption schemes that allow one to encrypt functions of private keys. Another goal is to embark on a broad study of public key encryption schemes with additional algebraic properties that allow combining cyphertexts (without knowing the decryption). Yet another goal of this research effort is to study new techniques for speeding up the computation involved in performing cryptographic tasks. <br\/><br\/>This effort will sponsor new students to join the research program, and it will exercise outreach efforts through education?including education for minority student and security professionals and consultants. Additionally, the results of this project will be integrated into the course curriculum at UCLA at both the graduate and undergraduate levels.","title":"An In-Depth Study of Homomorphic Encryption in Cryptography","awardID":"0830803","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["533831","521734"],"PO":["497499"]},"145973":{"abstract":"CCF-TFNSG: Uniting Discrete Methods, Optimization and the CISE Community with the Community studying Matrix Operations, Tensors, Verifiable Computational Experiments and Scalability<br\/><br\/>The 2009 SIAM Annual meeting is taking place in Denver, Colorado. There is typically a great deal of representation of the SIAM Computer Science and Engineering group at the Annual meeting that studies matrix operations, tensors, verifiable computing and scalability, but little or no representation of the CISE Community, the Discrete Methods or the Optimization Communities. As a pilot effort to study the feasibility of promoting such interaction, Lenore Cowen from the SIAM Discrete Math activity group, and Tamara Kolda from the CS and E SIAM activity group, chaired the 2008 SIAM Annual Meeting. On the CS and E side, both a full CS and E track was organized, and also a meeting theme of Numerical Linear Algebra and Tensor methods. On the Discrete and CISE side, a special theme of Networks: Biological, Social and Internet was organized. <br\/><br\/>In 2009, Lenore Cowen has agreed to organize a track at the SIAM Annual meeting through the Discrete Math activity group. The Discrete Math activity group runs its own biannual conference, plus it and ACM SIGACT co-run SODA (The Discrete Algorithms conference) every year. The goal of this proposal is to get participant communities that normally attend the SIAM Discrete Math and the ACM-SIAM SODA conferences to come attend the annual meeting in minisymposium sessions design to promote interaction in topics in mutual interest. <br\/><br\/>Our plan for this is threefold: 1) To have Bruce Hendrickson on the CS and E side run a minisymposium on Combinatorial Scientific Computing, and also to have someone on the CS and E side run a minisymposium on tensors and data mining (possibly Tammy Kolda). <br\/>2) To have a repeat of the Networks: Biological, Social and Internet theme for several minisymposia to bring in the CISE people and <br\/>3) To bring in some of the core Discrete Math and Optimization people by co-locating a banquet, separate from the SIAM annual meeting, in honor of Danny Kleitman?s 75th birthday. <br\/>The result will hopefully be a truly interdisciplinary meeting. <br\/><br\/>We ask for $20,000 to help support registration, travel and housing fees for minisymposium speakers; this will be spread among 28-32 minisymposium speakers, with preference for funds going to those coming from further away and\/or who do not have other sources of grant money for travel. We ask for an additional $15,000 for travel grants for graduate student attendance, and every effort will be made to reach out and broaden participation to a diverse group of graduate students. No money is requested for the non-SIAM activities at the meeting, i.e. the banquet in honor of Danny Kleitman?s birthday. Participants will cover the cost of the banquet on their own.","title":"CCF-TFNSG: Uniting the Discrete Methods, Optimization and the CISE Community with Community Studying Matrix Operations, Tensors,Verifiable Computational Experiments and Scalability","awardID":"0843426","effectiveDate":"2008-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[389398],"PO":["399214"]},"143432":{"abstract":"The project on the Theory and Practice of Accountable Systems investigates computational and social properties of information networks necessary to provide reliable assessments of compliance with rules and policies governing the use of information. In prior research, project leaders have demonstrated that achieving basic social policy goals in open information networks will require increased reliance on information accountability through after-the- fact detection of rule violations. This approach stands in contrast to the traditional mechanisms of policy compliance in network environments that rely on security technology to enforce rules by denial of access to resources at risk of abuse. So, access-based systems must be supplemented with accountability-based systems. To ensure that accountable systems can provide a stable, reliable, trustworthy basis on which to ground social policy arrangements in the future, it is necessary: 1) to research practical engineering approaches to designing these systems at scale, and 2) to develop a theory of the operating dynamics of accountable systems in order to establish what types of accountability assessments can be made, when those assertions are reliable, and what vulnerabilities accountable systems may have to attack, intrusion and manipulation. The key hypothesis to be tested regarding Information Accountability is that people are more likely to comply with rules (social or legal) if they believe that their non-compliance will be noticed. Successful study and development of accountable systems will ultimately enable real people, communities and institutions to take advantage of Information Accountability as a means of achieving better privacy and compliance with other information usage rules.","title":"CT-M: Theory and Practice of Accountable Systems","awardID":"0831442","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["551967",381930,"499228","485691","547850",381934],"PO":["565327"]},"143685":{"abstract":"Across all science and engineering disciplines, research is conducted in theoretical, experimental, and computational modes. In some disciplines, such as meteorology, the dominant mode of research is computational. Yet extant instructional materials for responsible conduct of research focus on ethical issues that arise in experimental research, and do not address specific issues that arise in computational modeling and research. In this project which encompasses a combination of research and education, the PIs will determine empirically the ethical issues and accepted standards for the responsible conduct of computational modeling and research, in a form suitable for teaching graduate students. Specifically, the PIs will articulate the standards for model integrity and validity, model robustness, representations and visualizations, data and code integrity, and intellectual property. They will develop instructional materials, case studies and associated commentaries to teach these standards to graduate students in science and engineering, will assess the quality and effectiveness of the instructional materials, and will disseminate them through conferences, journals, and the Web. The expertise of the project team includes computational dynamics, computational biomechanics, engineering ethics, instructional design, and educational assessment.<br\/><br\/>Broader Impacts: In collaboration with both graduate and undergraduate students, the PIs will develop cases based on actual situations, and commentaries on the cases for teaching the professional standards of computational modeling to graduate students in science and engineering. These materials will be tested and assessed with students and instructors in two institutions, and with professionals at technical conferences. The materials will be disseminated through academic conferences and archived at the Online Ethics Center of the National Academy of Engineering. The standards will be proposed for inclusion in the publication guidelines of research journals.","title":"Collaborative Research: The Responsible Conduct of Computational Modeling and Research","awardID":"0832843","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7787","name":"EESE"}}],"PIcoPI":["497959","531274",382743],"PO":["565227"]},"143476":{"abstract":"Wireless video multicast is increasingly popular, driven by users' desires to watch live TV and sporting events on laptops and handheld devices. The problem however is that wireless users have very different channel characteristics. Transmitting the video separately to each user is unscalable, yet transmitting a single video stream that serves all users despite their diverse channels is a challenging problem.<br\/><br\/>This project introduces Digital Rain, a new paradigm for streaming video to heterogeneous wireless receivers. Digital Rain builds on the theory of compressed sensing to develop a novel approach to video multicast where the source simply broadcasts coded packets belonging to a video stream. Receivers exploit all received video packets, even those with bit errors. Receivers that collect more packets, or experience fewer bit errors in each packet, see higher video quality without any need to receiver feedback, retransmissions, or changing the rate of the codec.<br\/><br\/>This research creates a bridge between the theory of compressed sensing and practical wireless network design. Further, it significantly improves the scalability of wireless video multicast, and hence has a direct and broad impact on emerging wireless video applications (e.g., IPTV, or Television over Internet Protocol), as well as the corresponding wireless industry. The research is integrated and synergistic with an educational plan that, in addition to standard graduate and undergraduate research and course development, directly supports MIT's effort to provide a more nurturing environment for women and underrepresented minorities. Finally, as in previous funded work, the project will result in open source, downloadable code.","title":"NeTS-ANET: One Video Multicast to Serve Diverse Wireless Receivers","awardID":"0831664","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["560189"],"PO":["565090"]},"143267":{"abstract":"Collaborative Research: Matrix-Model Machine Learning: unifying machine learning and scientific computing<br\/><br\/>To analyze the ever-growing massive quantities of data for pattern recognition and knowledge discovery, effective machine learning models and efficient computational algorithms are essential tools. The goal of this research is to establish a theoretical foundation for solve challenging machine learning problems utilizing matrix\/tensor computational methodologies, leveraging over the success of scientific computing over recent decades - including well-developed algorithms and mature, freely-available software.<br\/><br\/>This research begins with a critical connection between machine learning and scientific computing: an effective global solution to K-means clustering algorithm is provided by the principal component analysis which is based on singular value decomposition (SVD). This fundamental relationship will be systematically extended to matrices, tensors and multi-relational data, to deal with increasingly higher dimensions, multiple indexes and data types. The key goal of this research is to establish that well-known scientific computing techniques such as SVD, matrix and tensor decompositions can be directly utilized for pattern discovery, and further develop these computational methodologies for semi-supervised learning, clustering and classification. The focus will be on multi-index data (tensors, such as a sequence of weather maps or a sequence of traffics over a network) and multi-relational data (multiple pairwise relations, such as protein domains ? proteins ? pathways or words ? documents ? authors). Applications in genomics, text mining, and computer vision will be investigated.","title":"Collaborative Research: Matrix-Model Machine Learning: Unifying Machine Learning and Scientific Computing","awardID":"0830659","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["550720"],"PO":["565157"]},"143301":{"abstract":"Collaborative Research: Matrix-Model Machine Learning: unifying machine learning and scientific computing<br\/><br\/>To analyze the ever-growing massive quantities of data for pattern recognition and knowledge discovery, effective machine learning models and efficient computational algorithms are essential tools. The goal of this research is to establish a theoretical foundation for solve challenging machine learning problems utilizing matrix\/tensor computational methodologies, leveraging over the success of scientific computing over recent decades - including well-developed algorithms and mature, freely-available software.<br\/><br\/>This research begins with a critical connection between machine learning and scientific computing: an effective global solution to K-means clustering algorithm is provided by the principal component analysis which is based on singular value decomposition (SVD). This fundamental relationship will be systematically extended to matrices, tensors and multi-relational data, to deal with increasingly higher dimensions, multiple indexes and data types. The key goal of this research is to establish that well-known scientific computing techniques such as SVD, matrix and tensor decompositions can be directly utilized for pattern discovery, and further develop these computational methodologies for semi-supervised learning, clustering and classification. The focus will be on multi-index data (tensors, such as a sequence of weather maps or a sequence of traffics over a network) and multi-relational data (multiple pairwise relations, such as protein domains ? proteins ? pathways or words ? documents ? authors). Applications in genomics, text mining, and computer vision will be investigated.","title":"Collaborative Research: Matrix-Model Machine Learning: Unifying Machine Learning and Scientific Computing","awardID":"0830780","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["560636","425256"],"PO":["562984"]},"143686":{"abstract":"Across all science and engineering disciplines, research is conducted in theoretical, experimental, and computational modes. In some disciplines, such as meteorology, the dominant mode of research is computational. Yet extant instructional materials for responsible conduct of research focus on ethical issues that arise in experimental research, and do not address specific issues that arise in computational modeling and research. In this project which encompasses a combination of research and education, the PIs will determine empirically the ethical issues and accepted standards for the responsible conduct of computational modeling and research, in a form suitable for teaching graduate students. Specifically, the PIs will articulate the standards for model integrity and validity, model robustness, representations and visualizations, data and code integrity, and intellectual property. They will develop instructional materials, case studies and associated commentaries to teach these standards to graduate students in science and engineering, will assess the quality and effectiveness of the instructional materials, and will disseminate them through conferences, journals, and the Web. The expertise of the project team includes computational dynamics, computational biomechanics, engineering ethics, instructional design, and educational assessment.<br\/><br\/>Broader Impacts: In collaboration with both graduate and undergraduate students, the PIs will develop cases based on actual situations, and commentaries on the cases for teaching the professional standards of computational modeling to graduate students in science and engineering. These materials will be tested and assessed with students and instructors in two institutions, and with professionals at technical conferences. The materials will be disseminated through academic conferences and archived at the Online Ethics Center of the National Academy of Engineering. The standards will be proposed for inclusion in the publication guidelines of research journals.","title":"Collaborative Research: The Responsible Conduct of Computational Modeling and Research","awardID":"0832844","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7787","name":"EESE"}}],"PIcoPI":[382745],"PO":["565227"]},"143455":{"abstract":"The explosive growth of mobile devices coupled with near universal connectivity creates new opportunities for community based mobile social networking applications. <br\/>In this class of applications each user in a community contributes their knowledge about their surrounding environments and the collective knowledge is used by the group members for a personal or social benefit. The foundational underpinning of all mobile social networks is a participant's desire to take advantage of the collective knowledge gained from other users in the community. However, as security concerns grow there is a desire to protect one's own privacy. Thus all mobile social networks have a fundamental tension between privacy and information utility. This tension can be well formulated as a game theory problem where a self-interested agent's behavior alters dynamically based on the behavior of other agents in the system. This research will investigate the existence and efficiency of Nash equilibria and also design mechanisms that can maximize application performance while satisfying the privacy concerns of users. In particular, this research is conducted in the context of two specific case studies: one pertaining to a mobile device-based real time vehicular traffic information application and another pertaining to a community based mobile application for enhancing personal safety. This research will provide an important proof-of-concept that a rigorous game-theoretic analysis and design<br\/>methodology can lead to practical systems to provide appropriate tradeoffs between privacy and user service. The lessons learned in this project will be broadly useful to the development of next-generation social participation-based applications for mobile devices.","title":"CT-ISG: A Game Theoretic Framework for Privacy Preservation in Community-Based Mobile Applications","awardID":"0831545","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["531832","518642"],"PO":["497499"]},"143378":{"abstract":"This research asks how one might design a network architecture to support three-dimensional virtual worlds as a dominant application platform. The architecture is based on three key design principles. First, rather than being centralized or peer-to-peer, the architecture is based on federation: cooperative but not necessarily collaborative interaction between multiple parties. This enables providers to enforce local administrative and security policies, yet requiring new support for discovery, messaging, and migration between and within domains. Second, application communication is grounded in three-dimensional coordinate spaces: objects can only communicate after being introduced through proximity. This geometric addressing decouples applications from their physical locations on hosts, and introduces interesting security protections from unwanted communication. Third, by using this communication model, the architecture can directly interface with and connect the physical world, leading to new possibilities for virtual interactions.<br\/><br\/>Much as the Internet was designed with a layered communication model, this research designs a new layered approach for virtual worlds: from a high-level object layer providing a rich programming environment for immersive virtual worlds, to the narrow waist of geometry-based communication, and down to the underlying service layer that implements computation, storage, and communication mechanisms. With backgrounds across networking, systems, and graphics, the investigators have been previously developing a highly expansible and personalizable virtual world system, Meru. This new project will develop the network architecture necessary to enable the seamless interaction and interoperation between many different Meru-based virtual worlds.<br\/><br\/>Integrating virtual worlds is already a pressing issue and concern among providers. Research towards a unifying networked system architecture would improve these efforts and could lay the groundwork for a next-generation programming platform for the Internet. It would integrate the current divide between the logical, host-centric networks and the emerging sensor networks of tomorrow. By incorporating existing efforts towards building an open, scalable virtual world system, the research will have impact in all of the areas virtual worlds are already bringing change. Fundamentally, virtual worlds, even more so than the Internet, are a platform for inter-personal communication, affecting education, public services and planning, commerce, and social networks.","title":"Collaborative Research: NeTS-ANET: A Network Architecture for Federated Virtual\/Physical Worlds","awardID":"0831163","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["451500","483871","475015"],"PO":["565090"]},"137669":{"abstract":"This is a project to give the end user some ability to debug programs that were written by a machine instead of a person, especially when the users are not expert programmers. This is the problem faced by users of a new sort of program, namely, one generated by a machine learning system. For example, intelligent user interfaces, categorizers of email and web sites, and recommender systems use machine learning to learn how to behave. This learned set of behaviors is a program. Learned programs do not come into existence until the learning environment has left the hands of the machine learning specialist, because they learn from the user's ongoing data. Thus, if these programs make a mistake, the only one present to debug them is the user. Giving end users the ability to debug such programs can improve the speed and accuracy of these systems.<br\/><br\/>Specifically, the project envisions a fine-grained, iterative, interactive debugging process. First, a user notices an erroneous classification (with the system's help, based on reasoning about its own competence), such as an email message that might be misfiled. Second, the user asks for an explanation. Third, using the system's explanation, the user provides reasoning constraints, declaring, for example, that \"today\" is not an important word, and that anything from the company president should go into the \"company\" folder. The learned program reevaluates competence models and redoes its reasoning, giving the user an opportunity to immediately see the result of the change. The loop then begins again. Thus, the goals of this project are the following: 1. To help users identify reasoning problems, and to provide explanations of the behavior of machine-learned programs suitable for end users. 2. To elicit rich feedback from the user, incorporating it into the reasoning of the learned program. 3. To improve the speed and accuracy of machine learning by integrating this rich feedback into learning.<br\/><br\/>In addition to the potential speed and accuracy improvement in the machine learner, users may become more productive and make fewer errors. Providing disclosure of the learned programs' reasoning engenders trust, and with it, increased willingness to use the system. Thus, this project has the potential to make significant advances in the user acceptance of machine learning in a variety of new, real-world applications. Combining human constraints and guidance with statistical learning could enable highly accurate learning from small data sets, which is critical to creating successful intelligent user interfaces. The project will also result in learning systems whose data sources and input features are easy to change and whose behavior is easy to control. In combining human-computer interaction principles with machine learning, this project opens opportunities for novel perspectives, especially in the realm of interdisciplinary education. Graduate students will be trained in this blended research area, and aspects of it will be incorporated in classes in both human-computer interaction and machine learning, and in other educational experiences for undergraduates and high school students.","title":"HCC-Medium: End-user debugging of machine-learned programs","awardID":"0803487","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["554550","548135",365938,"514058"],"PO":["564456"]},"143401":{"abstract":"Layer-8 attacks (e.g., spam and phishing) are launched from a malicious service platform, e.g., botnet, which consists of a large number of infected machines (or bots). Such an attack platform relies on lower-layer network services to achieve efficiency, robustness, and stealth in communication and attack activities. These services include look-up (e.g., DNS), hosting (e.g., Web servers), and transport (e.g., BGP).<br\/><br\/>The main research goals and approaches of the CLEANSE project are:<br\/><br\/> 1. Control-plane monitoring. Much of the infrastructure for mounting layer-8 attacks involves abuse of the control plane in core network services (e.g., DNS and BGP).<br\/>The CLEANSE project develops control-plane anomaly detection sensors that are distributed, online, and real-time.<br\/><br\/> 2. Data-plane monitoring. The project develops new and general network anomaly detection algorithms based on traffic sampling and clustering for monitoring high-speed traffic.<br\/><br\/> 3. Improved security auditing capabilities. The CLEANSE project develops packet \"tagging\/tainting\" techniques to enable tracking and clustering of network traffic flows (e.g., that are generated by the same bot program). The project also develops improved traffic sampling capabilities that are attack-aware and distributed network-wide.<br\/><br\/>By focusing on monitoring of core network services, the CLEANSE framework can detect future layer-8 attacks and new forms of large-scale malware infections. The project also creates educational contents, including new textbooks and on-line course materials, which directly benefit from the research activities. The CLEANSE project team also work with industry partners (including the ISPs) to organize focused workshops that bring together researchers from academia and practitioners from the industry\/ISP, government, and law enforcement agencies to foster the exchange of ideas, data, and technologies.","title":"Collaborative Research: CT-L: CLEANSE: Cross-Layer Large-Scale Efficient Analysis of Network Activities to Secure the Internet","awardID":"0831300","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1668","name":"FED CYBER SERV: SCHLAR FOR SER"}}],"PIcoPI":["549757","533287","543138","561756","409253"],"PO":["565239"]},"143412":{"abstract":"National Science Foundation<br\/>NSF Cyber Trust Program<br\/><br\/>Proposal Number: 0831353<br\/>Principal Investigator: Sonia Fahmy<br\/>Institution: Purdue University<br\/>Proposal Title: CT-ISG: Collaborative Research: Router Models and Downscaling Tools for Scalable Security Experiments<br\/><br\/>Project Summary<br\/> <br\/> <br\/>It is critical to protect the Internet from attacks such as denial of service, and attacks on inter-domain routing. Although several defenses have been proposed, actual deployments have been limited. A primary reason for this lack of deployment is that most defenses have not been validated under realistic conditions, or at sufficiently large scales. Many attacks also have second-order effects that are not well understood. This is because it is difficult to incorporate all the protocols involved at any reasonable scale in analytical, simulation, or emulation models or testbeds. This project includes two complementary efforts to address both the fidelity and scale challenges in security experiments by designing the following: (1) Router models: High-fidelity yet scalable models for routers and other devices will be designed that are based on simple device measurements under a few well-crafted scenarios. Both the queueing behavior in the data plane and resource consumption in the control plane will be considered. (2) Downscaling tools: Techniques will be developed to simplify experimental scenarios before studying them using simulation, emulation, or testbed experiments. Algorithms that can downscale an experimental scenario while still preserving the important queueing or routing characteristics of this scenario will be devised. Broader Impact: Development and public dissemination of general- purpose experimental tools, large-scale testing techniques, methodologies for the use of testing frameworks, and related graduate- level courseware will be undertaken. Significant outreach is planned to simulation and testbed teams, e.g., ns-3, C-BGP, and DETER (based on Emulab), and to industry, specifically Cisco, Intel, and AT&T. Students from under-represented minority groups in computer science and electrical engineering will be actively involved.","title":"CT-ISG: Collaborative Research: Router Models and Downscaling Tools for Scalable Security Experiments","awardID":"0831353","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["550639"],"PO":["565136"]},"142686":{"abstract":"The organization of movement is a complex and difficult problem, in part because of a \"degrees of freedom problem\" in motor control. The richness of an animal's movement possibilities makes its choice of movement controls complex. However, unlike current robots, animals cope efficiently with their degrees of freedom. A newborn wildebeest calf walks with the herd within a few hours of birth. A frog or a turtle, using just its spinal cord, can control complex goal-directed trajectories. The spinal cord can also rapidly correct such movements if they are perturbed. It has been argued that these remarkable capacities are modular, constructed with small sets of primitives or motor building blocks. How such primitives arise and are used is the focus of this project.<br\/><br\/>The concepts of modularity and motor primitives have provided useful descriptions of the organization of spinal motor systems. Modular organization has been shown to support spinal behaviors, and may help to \"bootstrap\" motor learning. Nonetheless, modularity is controversial at many levels. Spinal primitives might need to be supplanted or augmented in order to perform complex, voluntary behaviors. This project attacks this problem in frog prey strike behaviors, a voluntary and adapted behavior in a system that is fundamentally important to the animal, and has also been well characterized in previous studies of modularity. The neuromechanics of prey strike is examined from a multi-disciplinary perspective. The importance of modular organization in neuroscience and behavior extends well beyond biological motor control, with ramifications in evolutionary and cognitive psychology. Biological strategies and solutions are also highly relevant to future technologies and robotics.<br\/><br\/>A computer model of prey strike will be developed using a novel approach based on Cosserat strand-elements. The model will be developed by a team of four investigators: Simon Giszter (neurophysiology) and Jonathan Nissanov (anatomy, imaging) at Drexel University, Dinesh Pai (computer science, biomechanical modeling) at the University of British Columbia, and Kiisa Nishikawa (neuromechanics) at Northern Arizona University. Cryoplane microscopy will be used to reconstruct bullfrog sensorimotor anatomy in detail. These structures will be modeled using a strand-based approach to incorporate this detail. Experimental and model analyses of prey strike using these data will inform one another to establish the benefits and limits of fixed or adaptive modular mechanisms, and the biological implementation used in frogs.","title":"Collaborative Research: Neural and mechanical bases of motor primitives in voluntary frog behavior","awardID":"0827684","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[379851,379852],"PO":["564318"]},"143423":{"abstract":"Recent years have witnessed a dramatic change in the goals and modus<br\/>operandi of malicious hackers. In particular, hackers realized the<br\/>potential monetary gains associated with Internet fraud. As a result,<br\/>there has been an integration of sophisticated computer attacks with<br\/>well-established fraud mechanisms devised by organized crime. This<br\/>process has created a vibrant underground economy.<br\/><br\/>Recent research has mostly focused on the visible aspects of the<br\/>underground economy, such as botnets, spam, and phishing. However,<br\/>little has been done to understand this economy as a whole and to<br\/>analyze and model its characteristics. What is needed is a holistic<br\/>approach to the study and analysis of the underground economy that<br\/>includes all aspects of the criminal process. In this project, novel<br\/>techniques and tools are developed that help to analyze the<br\/>underground economy and obtain a comprehensive picture of the complete<br\/>criminal process. More precisely, the underground economy is analyzed<br\/>and modeled from two different vantage points: First, the analysis<br\/>identifies the actors participating the underground economy and models<br\/>their different roles. Second, the analysis examines the<br\/>infrastructure that is used by criminals to carry out their<br\/>operations.<br\/><br\/>The results of this project are techniques and tools to gather<br\/>information about the infrastructure of the underground economy and<br\/>the involved actors. The broader impact is a reduction in the amount<br\/>and severity of crime performed in the Internet. Moreover, the results<br\/>of this project support the task of cyber crime law enforcement in<br\/>their fight against the underground economy.","title":"CT-M: Understanding the Underground Economy","awardID":"0831408","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["402618","535035","535036"],"PO":["565327"]},"143698":{"abstract":"The mobile phone network is emerging as the largest sensor network on the planet. Mobile phone users, however, are generally unaware of the dual uses of this network, in which their communication devices are also information gathering devices. In participatory urban sensing, everyday mobile devices become a platform for coordinated investigation of the environment and human activity. But transforming phones into data collection instruments raises both technical and ethical challenges. The PI believes that researchers should utilize this network of sensors with the consent and active participation of users. Facilitating responsible, socially trusted, and participatory ethics for data collection and analysis with urban sensing systems remains an open problem, and is the challenge undertaken in this research and education project. In this project, the PI and her team will formalize and qualitatively assess an important test case in participatory ethics: a participatory approach to managing privacy in urban sensing applications. They will create both an immersion curriculum (using a hands-on laboratory approach) and an interdisciplinary seminar-style curriculum to teach participatory ethics for urban sensing to diverse STEM undergraduate and graduate students, and will evaluate these curricula and synthesize classroom findings into best practices which will then be disseminated for education in participatory urban sensing ethics to urban sensing, ubiquitous computing, and broader technology education communities through white papers, guest lectures, video presentations and discussions, and an active website.<br\/><br\/>Broader Impacts: This work will benefit many areas of mobile and ubiquitous technology research. The multidisciplinarity and rapid pace of system development, the social diversity of users, and the diversity of urban sensing applications are exhilirating yet pose significant challenges to developing a participatory ethics framework. Much as traditional human subjects research guidelines apply to a broad and diverse research scope, the PI believes that similarly powerful principles can be specified for human sensing research. The pedagogical tools developed in the education phase of this project will train a diverse group of STEM students to align technological advances with human practices and ethics. Involving students in discussions and practical implementation of participatory ethics will integrate considerations of values into their research and design practice. Students and researchers trained in participatory urban sensing ethics will design systems that reflect participatory ethics and balance technical and human values. Students will also bring the ethical thinking and value commitments formed during their education to careers in academia, technology industries, and policy arenas. As a critical test case in participatory ethics for urban sensing, formalizing and refining participatory privacy regulation will contribute to fields struggling with meaningful privacy design, including mobile and ubiquitous computing, social networking, and web community systems design.","title":"Ethics Education for Participatory Urban Sensing","awardID":"0832873","effectiveDate":"2008-10-01","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7787","name":"EESE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1733","name":"GEOSCIENCE EDUCATION"}}],"PIcoPI":["560926","537785","552479"],"PO":["565227"]},"148516":{"abstract":"This is a request to support a US \/ Japan Future Network Workshop. The Workshop will bring together leading US and Japanese network researchers and network research infrastructure developers.<br\/><br\/>The workshop will bring together a diverse group of researchers from the US and Japan to discuss the science and technology advances needed to advance our fundamental understanding of the design, deployment and operation of the increasingly complex, networks of the future. The outcome of this workshop will lead to a better understanding of network research and<br\/>network research infrastructure activities in the two countries.<br\/><br\/>The proposed workshop will result in more efficient ways of how peer researchers in networking research and infrastructure, from both countries, will collaborate and communicate with each other. The workshop has potential for the development of individual linkages between peer<br\/>researchers in each country.","title":"US \/ Japan Future Network Workshop","awardID":"0853414","effectiveDate":"2008-10-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["541801"],"PO":["402055"]},"151454":{"abstract":"This project links for the first time high level planning and reconfiguration to low level execution in heterogeneous multi-agent systems. Planing decisions are automated and combine the diverse capabilities of the underlying systems towards a common objective. The derived plans have guaranteed refinement into timed switching sequences of novel, decentralized continuous controllers. The interconnected system can complete a variety of complex cooperative tasks without hardware reconfiguration. This is the first scalable methodology for complete planning and controlled execution in heterogeneous interconnected systems.<br\/><br\/>The method builds on a hierarchical hybrid architecture in which decision making takes place in the higher purely discrete layers, while the execution of plans is supervised by continuous controllers at the lower layers. The link between the low continuous dynamics and the higher discrete models is established using abstraction. Different homogeneous robotic groups obtain asymptotic abstract discrete representations via a palette of cooperative controllers. Controller switching within a group, as well as concurrent and synchronized execution among several groups is captured in a product-timed automaton. The timed automaton is further abstracted into a purely discrete push down automaton that uses its stack to store timing information. From the push down automaton we extract an equivalent context free grammar, and express the cooperative tasks as words in this grammar. Automatic parsing yields derivations that correspond to cooperative plans, in the form of sequences of controller activations in the underlying groups.<br\/><br\/>Being one of the three Hispanic Serving Institutions in Carnegie Doctoral\/Research Universities-Extensive, UNM is uniquely positioned to recruit Hispanic and Native American students","title":"CAREER: Formal Cooperative Planning of Decentralized Robot Actions - Career Development Plan","awardID":"0907003","effectiveDate":"2008-10-31","expirationDate":"2012-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["460474"],"PO":["562760"]},"142687":{"abstract":"Last Modified Date: 08\/01\/08 Last Modified By: Kenneth C. Whang <br\/> <br\/>Abstract <br\/>The organization of movement is a complex and difficult problem, in part because of a \"degrees of freedom problem\" in motor control. The richness of an animal's movement possibilities makes its choice of movement controls complex. However, unlike current robots, animals cope efficiently with their degrees of freedom. A newborn wildebeest calf walks with the herd within a few hours of birth. A frog or a turtle, using just its spinal cord, can control complex goal-directed trajectories. The spinal cord can also rapidly correct such movements if they are perturbed. It has been argued that these remarkable capacities are modular, constructed with small sets of primitives or motor building blocks. How such primitives arise and are used is the focus of this project. <br\/><br\/>The concepts of modularity and motor primitives have provided useful descriptions of the organization of spinal motor systems. Modular organization has been shown to support spinal behaviors, and may help to \"bootstrap\" motor learning. Nonetheless, modularity is controversial at many levels. Spinal primitives might need to be supplanted or augmented in order to perform complex, voluntary behaviors. This project attacks this problem in frog prey strike behaviors, a voluntary and adapted behavior in a system that is fundamentally important to the animal, and has also been well characterized in previous studies of modularity. The neuromechanics of prey strike is examined from a multi-disciplinary perspective. The importance of modular organization in neuroscience and behavior extends well beyond biological motor control, with ramifications in evolutionary and cognitive psychology. Biological strategies and solutions are also highly relevant to future technologies and robotics. <br\/><br\/>A computer model of prey strike will be developed using a novel approach based on Cosserat strand-elements. The model will be developed by a team of four investigators: Simon Giszter (neurophysiology) and Jonathan Nissanov (anatomy, imaging) at Drexel University, Dinesh Pai (computer science, biomechanical modeling) at the University of British Columbia, and Kiisa Nishikawa (neuromechanics) at Northern Arizona University. Cryoplane microscopy will be used to reconstruct bullfrog sensorimotor anatomy in detail. These structures will be modeled using a strand-based approach to incorporate this detail. Experimental and model analyses of prey strike using these data will inform one another to establish the benefits and limits of fixed or adaptive modular mechanisms, and the biological implementation used in frogs.","title":"Collaborative Research: Neural and mechanical bases of motor primitives in voluntary frog behavior","awardID":"0827688","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["526024"],"PO":["564318"]},"143226":{"abstract":"Scheduling policies are explicitly (or implicitly) used everywhere that resources need to be allocated, and resultantly the theory of scheduling has a long and varied history. Out of this large body of work, two distinct research communities have emerged and, unfortunately, researchers in each community are often not aware of results from the other community. One set of researchers from the theoretical computer science and optimization communities has focused on providing competitive guarantees for scheduling disciplines in the worst-case environment. A different set of researchers, from the performance modeling and applied probability communities, has focused on providing exact performance analyses of scheduling policies in stochastic\/probabilistic environments. Each of these approaches have specific advantages and disadvantages when carried out on their own. The aim of this project is to develop techniques that can achieve the \"best of both worlds\", i.e., to combine ideas from each community to arrive at results neither has been able to achieve alone. Specifically, the goal of this project is to develop approaches that combine worst-case results and techniques with qualitative and quantitative techniques for analyzing stochastic models, thus combining the breadth of models where worst-case results can be applied with the real-world applicability of stochastic analysis. This is an ambitious goal, but one that will open up a new avenue of research in an important, well established field. If successful, it can bring together ideas from two distinct communities which attack similar problems with very different techniques, and thus is likely to identify new scheduling disciplines that will impact system design in practice. Additionally, the project will have a broad impact on the education of both undergraduate and graduate students through the development of a new unified approach to teaching scheduling theory.","title":"Collaborative Research: Bridging probabilistic and competitive analysis of scheduling policies","awardID":"0830511","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550593"],"PO":["565251"]},"152896":{"abstract":"This project will develop a dynamic, data-driven application system for signal and image processing under resource constraints. This system would lay a foundation for highly optimized implementations of fundamental signal and imaging processing computations that arise in many science and engineering problems, including image recognition, communications analysis, speech processing, querying, indexing, and retrieval from multimedia databases, and image segmentation of aerial, satellite, and astronomical images. The proposed multidisciplinary approach optimizes from algorithm specification, to mathematical representation, to software and hardware (FPGA) implementation, based on properties of data and unique requirements of <br\/>the environment and the target hardware device. <br\/>The novelty of the system is twofold: (1) it performs joint optimization<br\/>across mathematical, software and hardware (system-on-a-chip FPGA) domains; and, (2) it is a dynamic, data-driven system in that signal-processing transforms are tailored to algorithm requirements and input signals, for reduced distortion and increased compression, and the system can be queried and steered during execution. Implementations are based on the best mathematical formulation of the problem coupled with automated selection of the best implementation among a space of alternatives, through the integration of models relating mathematical properties to implementation<br\/>behavior. Both hardware and software optimization are treated in a unified way. It is anticipated that with these methods the design-time will be decreased by two orders of magnitude or more, compared to implementations derived in a traditional way. Because the proposed system can explore a broad range of implementations that exceed the capabilities of a human designer, the implementations derived by the approach pursued in the project may even exhibit lower resource costs and higher performance. This research will provide a foundation for signal processing at all scales, providing key building blocks for engineers to build complex, distributed networks of adaptive signal processing sensors.","title":"Collaborative Research: DDDAS-SMRP: Optimizing Signal and Image Processing in a Dynamic, Data-Driven Application System","awardID":"0911750","effectiveDate":"2008-10-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}}],"PIcoPI":["542054"],"PO":["535244"]},"141203":{"abstract":"Proposal Number: 0820907<br\/>PI: Giovanni Vigna<br\/>Institution: University of California ? Santa Barbara<br\/>Title: SGER: Grand Challenges in Cyber Security<br\/><br\/>Proposal Summary:<br\/>The goal of this exploratory project is to design and run the first Grand Challenge Competition in Cyber Security. Among four possible candidate domains, (the development of a secure voting system, the identification of sophisticated vulnerabilities, the elimination of SPAM, and the design of a ?hackproof? server), one will be selected for the initial competition. The lessons learned from the design and execution of this initial challenge will be used for the design and implementation of subsequent contests.<br\/>The idea for a security grand challenge competition is inspired by the very successful DARPA Grand Challenges <br\/>The design of the rules of engagement and criteria for selecting a ?winner? of a computer security grand challenge is an extremely difficult endeavor, and is the part of the focus of this research. <br\/>It is expected that the first carry competition will be held at a major computer security conference in 2009. There is a pressing need for a challenging contest that will attract the public interest and galvanize the research community.","title":"SGER: Grand Challenges in Cyber Security","awardID":"0820907","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["535035"],"PO":["565327"]},"152467":{"abstract":"Cooperative transmission is an emerging wireless communication paradigm that improves wireless channel capacity by creating multi-user cooperation in the physical layer. In cooperative transmission, when the source node transmits a message to the destination node, the nearby nodes that overheard this transmission will \"help\" the source and destination by relaying the replicas of the message, and the destination will combine the multiple received waveforms so as to improve the link quality. This technology departs from the traditional point-to-point link abstraction of wireless connections, and is expected to have a profound impact on network performance and design. <br\/><br\/>The current algorithm design, protocol development and performance evaluation for cooperative transmission assume that all wireless nodes are trustworthy. Investigation of the security issues is lagging behind. This research addresses the major security issues related to cooperative transmission. In particular, does cooperative transmission provide new opportunities for attackers to undermine network performance? Conversely, are there new ways to defend wireless networks through physical layer cooperation? <br\/><br\/>Any project in an open area in security benefits the larger society which now has urgent need of true innovations in security. In addition, this project will have broader impacts through its education plan, which focuses on an outreach program integrating campus summer camps for high school-age women\/minority students and an online mentoring group, in addition to graduate and undergraduate student participation. In summary, the PIs are equally dedicated to improving wireless network performance through security-assured cooperative transmission and to enhancing female and minority participation in engineering.","title":"CT-ISG Collaborative Research: Trusted Cooperative Transmission: Turning a Security Weakness into a Security Enhancement","awardID":"0910461","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["540080"],"PO":["497499"]},"142688":{"abstract":"Many neurons in the auditory system respond to sounds nonlinearly; that is, its response to two sounds played simultaneously differs from the sum of its responses to each sound played alone. Nonlinearities are necessary for many computational functions, but unlike nonlinear models that allow closed-form solutions, nonlinear models are often too hard to characterize in practice. To make nonlinear models tractable, this project will combine single-unit recording in awake marmoset monkey with automated online stimulus design by parallel computing. The goal of this stimulus design is not to maximize the firing rate of a neuron, but to extract the most information about the global stimulus-response relationship. Optimal sounds will be designed \"on the fly\" according to a neuron's response history, with the help of a fast parallel computer whose running time is compatible with the single-unit recording experiment. The proposed research is expected to produce practical and widely applicable methods for characterizing nonlinear sensory neurons. The auditory system is an ideal system for this type of online experiment because sound space is of lower dimensions and allows faster computations. The methods developed here are expected to generalize to nonlinear problems in other sensory modalities.<br\/><br\/>Theory and algorithm development will focus on generating sound stimuli which can either most accurately estimate a given model, or maximally distinguish competing models. Nonlinear models with various degrees of complexity, including neural network models, will be used simultaneously, and contrasted against one another in the automated experiment. The model-based sound design method will be used to characterize complex response properties of neurons in auditory cortex and inferior colliculus of awake marmoset monkey, a vocal primate. This project focuses on the auditory cortex because studies of its pronounced nonlinearities may potentially benefit most from the new method. For comparison the same method will also be applied to the inferior colliculus, the inputs to which are better known, allowing more realistic hierarchical models to be developed. The models obtained from this method should provide a concise summary of the global stimulus-response relationship of a neuron that generalizes across all types of stimuli. Neural network models may also help extract additional information about the connectivity between different neuronal types, thus providing a link between the stimulus-response function and the structure of the underlying neural circuits.","title":"Characterizing nonlinear auditory computations","awardID":"0827695","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H428","name":"NIDCD"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H429","name":"NIH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H446","name":"NATL INST OF BIOMEDICAL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H450","name":"NIH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H466","name":"NIH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H467","name":"NIH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H470","name":"NIH"}}],"PIcoPI":["492401",379857,"461610"],"PO":["564318"]},"143447":{"abstract":"The Data Tethers project is building an operating system that prevents loss of sensitive data when portable computers or storage devices are lost or stolen. Loss of such information is commonplace and often very <br\/>damaging. Data Tethers addresses this problem by ensuring that when a <br\/>portable device leaves a secure environment, sensitive data is not allowed to go with it. Many organizations have policies saying that such data should not leave their premises, but they have no enforcement mechanism. Data Tethers provides that mechanism. Data Tethers must track data as it is copied from file to file, since the goal is to prevent data loss, not just to protect particular files. The system must deal with issues of data lingering on in deleted files, temporary storage locations, and other obscure places in a modern computer, since <br\/>thieves will look for sensitive data in those places, as well. Data <br\/>Tethers is being added to Sun Microsystem's Open Solaris, an existing operating system in common use, and will make use of Sun's standard mechanism for adding functionality to Open Solaris. The expected results of the Data Tethers project will be a working open source operating system that will allow the owners and curators of sensitive data to avoid loss of that data through loss of their devices. This system will be freely available to all through a well-known web distribution mechanism, and will also serve as a template for how other operating system providers can add similar services to their systems.","title":"CT-ISG: Data Tethers - Preventing Sensitive Data from Loss and Theft","awardID":"0831520","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["485932"],"PO":["565327"]},"146549":{"abstract":"This grant funds a workshop that will bring together invited participants from both the software design community and the general design community aimed at improving out understanding of how software designers tackle early design problems, as formed through a broad range of perspectives including problem solving strategies, representations, communication patterns and language use, and different forms of knowledge that are applied. Expert designers will be videotaped to capture how they think, apply knowledge, make decisions and communicate. The grant will fund the videotaping sessions, transcription of the videotapes, and publication. At a subsequent workshop, participants will submit papers that analyze the videotapes\/transcripts from a variety of different perspectives, discuss these papers at the workshop, and produce an edited book covering revised chapters and discussions. The approach to studying design is patterned after the Delft design workshop.","title":"Workshop Proposal: Studying Experts Engaged in Early Software Design","awardID":"0845840","effectiveDate":"2008-10-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551130"],"PO":["564388"]},"143448":{"abstract":"The popularity of personal gadgets opens up many new services for ordinary users. Many everyday usage scenarios involve two or more devices \"working together\". (Emerging scenarios are beginning to involve sensors and personal RFID tags.) Before working together, devices must be securely \"paired\" to enable secure and private communication. <br\/><br\/>However, the human-imperceptible nature of wireless communication prompts the very real threat of Man-in-the-Middle (MiTM) attacks. Another challenge arises due to the lack of a global security infrastructure. Consequently, traditional cryptographic means alone are unsuitable, since unfamiliar devices have no prior security context and no common point of trust. Therefore, some human involvement in secure device pairing is unavoidable. At the same time, most devices have limited hardware and\/or user interfaces, thus complicating human involvement. <br\/><br\/>This project?s goals are three-fold: (1) design a set of pairing methods suitable for most common devices and a general user population, based on comprehensive and comparative usability studies, (2) develop secure pairing techniques for personal RFID tags, and (3) construct a set of user-friendly, scalable and secure methods for sensor initialization. <br\/><br\/>Benefits of this project will include accumulation of valuable expertise in designing truly usable security methods. Notably, the project expects to experimentally assess the value of usable security with respect to the general population. Furthermore, the need for, and the utility of, user-centric secure control of personal RFID tags and sensors will be demonstrated. Since device pairing is one of the very few areas where security directly involves and affects the average user, the greatest impact of proposed research is expected to be the broader participation in security practices and better appreciation of security and its benefits. The project also emphasizes industry outreach and technology transfer by working with manufacturers and industrial consortia. <br\/><br\/>In addition, students taking part in the project are expected to acquire currently uncommon skills at the cusp of Human-Computer Interaction, Usability and Cyber Trust.","title":"CT-ISG: User-Aided Secure Association of Wireless Devices","awardID":"0831526","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["515757","432332"],"PO":["543481"]},"143208":{"abstract":"The NP-hardness of many natural computational problems has become a strong obstacle to the real world of computing, where we are experiencing a pervasion of virtually all aspects of life by computers. Dealing with NP-hard problems in practice has become unavoidably important. A number of approaches have been proposed but none of them has perfectly satisfied the requirements posted in applications. This proposed research studies an alternative approach to NP-hard problems, parameterized computation, which has recently turned out to be very promising and useful, in particular when traditional approaches are not applicable. The research will emphasize the difference between parameterized computation and traditional computational approaches, and develop new and non-traditional algorithmic techniques that are effective and special for parameterized computation. More specifically, the following new algorithmic techniques in parameterized computation will be systematically investigated: (1) parameter dual bounds; (2) effective process of small unknown subsets; (3) new analysis techniques for parameterized algorithms; (4) parameterized computational lower bounds; and (5) parameterized algorithm libraries. The success of the proposed research will significantly advance our understanding on the concepts of computational tractability and intractability, and provide effective techniques and solutions for solving difficult computational problems in the real world of computing.","title":"Studies on New Algorithmic Techniques for Parameterized Computation","awardID":"0830455","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["410068"],"PO":["565157"]},"144815":{"abstract":"Virtual organizations (VOs) are increasingly significant to research and teaching. Traditional tools to support VOs (e.g., electronic mail) enable communication and coordination at a distance and across institutional barriers. In such cases, the organizational work of forming and sustaining VOs focuses on the use of these tools to foster trust and to negotiate equitable and efficient resource utilization. More recently, research in computer science has sought to delegate such organizational work to a new class of VO tools, collectively termed ?Grid? technologies. Grid technologies are envisioned to provide new modes of collaboration, improved allocation of scarce resources, and novel pathways for discovery and innovation. While past research has successfully addressed questions of long-distance communication and coordination involving traditional tools, much less is known about how new tools may transform VOs. Open questions include: the consequences of delegating trust, access and resource distribution to Grid-based systems; the challenges of sustaining computationally-supported VOs; and the new kinds of organizational roles and responsibilities necessary for the upkeep and maintenance of VOs. <br\/><br\/>This project undertakes a comparative study of VO formation and maintenance in two leading collaborative science networks: the Long Term Ecological Research Network (LTER) and the Open Science Grid (OSG). Both LTER and OSG are mature enterprises for supporting multidisciplinary scientific research; however, they differ in the nature of their VO tool use. Whereas LTER uses a broad variety of conventional tools to augment organizational communication (exhibiting the communicational paradigm, or a 'weakly technically delegated' VO), OSG delegates key components of organizational life and maintenance to Grid-based mechanisms (i.e., a ?strongly technically delegated VO, exemplifying the computational paradigm). Using ethnographic and comparative methods, and drawing on theories from science and technology studies (STS), organization science, and human-computer interaction, this study will compare the different approaches taken by LTER and OSG to: i) provide a better and more sophisticated mapping of the characteristics of individuals, groups and organizations that embrace VOs; and ii) develop rigorous comparative models for the differential human and technical work which sustain VOs.","title":"VOSS: Delegating Organizational Work to Virtual Organization Technologies: Beyond the Communicational Paradigm","awardID":"0838383","effectiveDate":"2008-10-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7642","name":"VIRTUAL ORGANIZATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["498457","536933","560633"],"PO":["446196"]},"143407":{"abstract":"Cooperative transmission is an emerging wireless communication paradigm that improves wireless channel capacity by creating multi-user cooperation in the physical layer. In cooperative transmission, when the source node transmits a message to the destination node, the nearby nodes that overheard this transmission will \"help\" the source and destination by relaying the replicas of the message, and the destination will combine the multiple received waveforms so as to improve the link quality. This technology departs from the traditional point-to-point link abstraction of wireless connections, and is expected to have a profound impact on network performance and design. <br\/><br\/>The current algorithm design, protocol development and performance evaluation for cooperative transmission assume that all wireless nodes are trustworthy. Investigation of the security issues is lagging behind. This research addresses the major security issues related to cooperative transmission. In particular, does cooperative transmission provide new opportunities for attackers to undermine network performance? Conversely, are there new ways to defend wireless networks through physical layer cooperation? <br\/><br\/>Any project in an open area in security benefits the larger society which now has urgent need of true innovations in security. In addition, this project will have broader impacts through its education plan, which focuses on an outreach program integrating campus summer camps for high school-age women\/minority students and an online mentoring group, in addition to graduate and undergraduate student participation. In summary, the PIs are equally dedicated to improving wireless network performance through security-assured cooperative transmission and to enhancing female and minority participation in engineering.","title":"CT-ISG Collaborative Research: Trusted Cooperative Transmission: Turning a Security Weakness into a Security Enhancement","awardID":"0831315","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["491296"],"PO":["497499"]},"143539":{"abstract":"This project introduces a novel communication paradigm, called profile-cast, to support new classes of interest-aware services in mobile networks. Unlike unicast, multicast or directory-based paradigms, profile-cast infers user interest using implicit behavioral profiling via a self-monitoring and mining technique. Privacy preserving design is a high priority. A spatio-temporal representation is introduced to capture users' interest within a behavioral-space. Users identify similarity of interest based on their position in such space. The design philosophy begins by intensive analysis of measurements from the target context that drives the modeling and protocol design through a systematic framework, called TRACE.<br\/><br\/>Components of TRACE include: 1. Tracing and monitoring of behavior, 2. Representing and Analyzing the data, 3. Characterizing behavioral profiles using data mining techniques, and 4. designing mobile user behavioral models and efficient protocols for future mobile societies. This project tackles the design and development of profile-cast and TRACE, and quantifying the extent to which they are privacy-preserving, scalable, efficient, flexible and robust.<br\/><br\/>The broader impacts of this research include enabling new classes of socially valuable service, from navigation of mobile societies, to emergency alert systems. The mobility models developed will provide novel and key elements for the success of future mobile networks. The project includes education plan to involve students at the university in using profile-cast devices and to integrate the research into curricula both at the University of Florida, and into K-12 schools in north-central Florida.","title":"ANET: Interest-Aware Delivery for Future Mobile Social Networks: A TRACE-driven Approach","awardID":"0832043","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["550970"],"PO":["565090"]},"151789":{"abstract":"It is widely acknowledged, both in academic studies and the marketplace, that the most effective form of education is the professional human tutor. A major difference between human tutors and computer tutors is that only human tutors understand unconstrained natural language input. Recently, a few tutoring systems have been developed that carry on a natural language (NL) dialogue with students. <br\/>Our research problem is to find ways to make NL-based tutoring systems more effective. Our basic approach is to derive new dialogue strategies from studies of human tutorial dialogues, incorporate them in an NL-based tutoring system, and determine if they make the tutoring system more effective. For instance, some studies are determining if learning increases when human tutors are constrained to follow certain strategies. In order to incorporate the new dialogue strategies into our existing text and spoken NL-based tutoring systems, two completely new modules are being developed. One new module will interpret student utterances using a large directed graph of propositions called an explanation network, which is halfway between the shallow and deep representations of knowledge that are currently used. The second new module uses machine learning to improve the selection of dialogue management strategies.<br\/>The research is thus a multidisciplinary effort whose intellectual merit lies in new results in the cognitive psychology of human tutoring, in the technology of NL processing, and in the design of effective tutoring systems. Improved NL-based tutoring systems could have a broad impact on education and society.","title":"ITR : Tutoring scientific explanations via natural language dialogue","awardID":"0908146","effectiveDate":"2008-10-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["498182"],"PO":["564318"]},"142967":{"abstract":"Computers are becoming essential in all disciplines. Researchers in the social sciences rely on the availability of large data repositories and the general availability of data over the Web. Researchers in the humanities are increasingly looking to analyze the growing number of electronic corpora. Workers in all fields are making use of new ways to publish data and of to interact with colleagues and others using electronic media. Moreover, more and more jobs and companies are relying on the understanding and processing of information. Modern companies as diverse as Google, WalMart, Amazon, and Goldman Sachs all owe their success in large part to their ability to evaluate and act on available information. It is estimated that in the next ten years, over twelve million people in the U.S. workforce will consider programming their primary job, which is far more than the current or near-term number of computer science majors. To address these needs, to better prepare students for careers involving information processing, to prepare<br\/>tomorrow?s researchers in the humanities and social sciences, and to prepare tomorrow?s workers for an information-based world, computer science needs to reach out beyond its traditional audience and even beyond the sciences. This project focuses on disciplines that have traditionally<br\/>been neglected by computer scientists, harnessing the growing revolution in applying computing to social artifacts. Second, it will result in a novel, application-driven, on-demand presentation of computing material, coming to topics like machine-learning and data-mining very early, rather than late, in the curriculum. Third, the development of a curriculum arranged in concentric rings of growing commitment, where a student who stops early will still get a meaningful education. It will provide the proper foundation for the growing use of computing and cyberinfrastructure in the humanities and social sciences. It will ultimately train such students have been relegated to with the tools to make their own non-trivial contributions to cyberinfrastructure. It will result in more women and minorities, groups traditionally underrepresented in computing, working with and using computation and cyberinfrastructure. Finally, it will enable students to wed their deep social and humanistic insights to tools that can enable them to build wonderful inventions that have the power to greatly enrich society.","title":"CPATH CB: Applied Computer Science for the Humanities and Social Sciences","awardID":"0829533","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":["448702",380627,"532660","519555"],"PO":["565136"]},"151558":{"abstract":"This NSF project provides travel funds to assist approximately 25 US researchers to participate in the 2008 IEEE\/RSJ International Conference on Intelligent Robots and Systems (IROS), in a time where airfare costs are increasing. This meeting has served as a forum gathering international researchers together for the exchange of ideas on technical problems and their solutions.<br\/>One distinguishing aspect of IROS, setting it apart from its sister conference ICRA, is the increased presence of participants from Asia. The conference is held in Nice, France, and the transatlantic flight will incur a significant portion of the whole cost of attendance for US participants.<br\/><br\/>The purpose of this Group Travel Grant Proposal is two-fold:<br\/>- To assist US participation in this key international conference, and<br\/>- To stimulate collaborations between US researchers and their international colleagues.<br\/><br\/>A strong participation and presence of US researchers at IROS 2008 is expected to facilitate the exposure of US scientists to ideas from around the world, promote their own work, and increase their opportunities for international collaborations and visits. The financial support provided by this NSF project stimulates interaction between US scientists with their colleagues abroad, and contributes to the professional development of the former.","title":"Group Travel Assistance Fund for 2008 IEEE\/RSJ IROS","awardID":"0907374","effectiveDate":"2008-10-31","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["460474"],"PO":[403839]},"143419":{"abstract":"This research asks how one might design a network architecture to support three-dimensional virtual worlds as a dominant application platform. The architecture is based on three key design principles. First, rather than being centralized or peer-to-peer, the architecture is based on federation: cooperative but not necessarily collaborative interaction between multiple parties. This enables providers to enforce local administrative and security policies, yet requiring new support for discovery, messaging, and migration between and within domains. Second, application communication is grounded in three-dimensional coordinate spaces: objects can only communicate after being introduced through proximity. This geometric addressing decouples applications from their physical locations on hosts, and introduces interesting security protections from unwanted communication. Third, by using this communication model, the architecture can directly interface with and connect the physical world, leading to new possibilities for virtual interactions.<br\/><br\/>Much as the Internet was designed with a layered communication model, this research designs a new layered approach for virtual worlds: from a high-level object layer providing a rich programming environment for immersive virtual worlds, to the narrow waist of geometry-based communication, and down to the underlying service layer that implements computation, storage, and communication mechanisms. With backgrounds across networking, systems, and graphics, the investigators have been previously developing a highly expansible and personalizable virtual world system, Meru. This new project will develop the network architecture necessary to enable the seamless interaction and interoperation between many different Meru-based virtual worlds.<br\/><br\/>Integrating virtual worlds is already a pressing issue and concern among providers. Research towards a unifying networked system architecture would improve these efforts and could lay the groundwork for a next-generation programming platform for the Internet. It would integrate the current divide between the logical, host-centric networks and the emerging sensor networks of tomorrow. By incorporating existing efforts towards building an open, scalable virtual world system, the research will have impact in all of the areas virtual worlds are already bringing change. Fundamentally, virtual worlds, even more so than the Internet, are a platform for inter-personal communication, affecting education, public services and planning, commerce, and social networks.","title":"Collaborative Research: NeTS-ANET: A Network Architecture for Federated Virtual\/Physical Worlds","awardID":"0831374","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["533355","533300"],"PO":["565090"]},"144170":{"abstract":"Error-correcting codes, studied in a branch of science and engineering known as coding theory, safeguard data against the adverse effects of noise and enable reliable storage and communication of information. Such codes pervade our daily lives, with applications ranging from computer hard-disks and UPS bar-codes to cell phones and the Internet to deep space communication. One of the most fundamental questions in coding theory is the following: What is the largest possible fraction of errors that a code of information rate R can correct? Recent theoretical breakthroughs provide a complete answer to this question, namely that the ultimate error-correction radius of 1-R can be reached (by codes over sufficiently large alphabets). Moreover, it can be reached constructively with polynomial-time list decoding, via codes closely related to Reed-Solomon codes, which are ubiquitous in practice.<br\/><br\/>From a practical standpoint, this promises a factor of two improvement over classical error-correction algorithms that are in widespread use today. While this is extremely encouraging, numerous challenges must be overcome in order to bring the theoretical promise of the recent results to practice. This project, led by a multi-disciplinary team, involves an integrated collection of research activities targeted at progress towards the long term goal of attaining the fundamental limit of error-correction. At the theoretical end, the goals include improving the complexity of the decoding algorithms as one approaches the optimal error-correction radius of 1-R, and devising faster algorithms and heuristics for the key steps involved in algebraic list decoding. The project also studies methods to reap the practical benefits of combining the new codes with soft-decision decoding, putting to use the ample amount of probabilistic symbol reliability estimates often available to decoders. Furthermore, the research lays the groundwork for eventual implementation of such algorithms in high-speed\/low-power VLSI, thereby enabling the potential deployment of the new codes in a broad range of communication and storage systems. On the education front, the project provides a stimulating research environment for graduate students, encouraging team-work across university boundaries and collaboration across disciplines (computer science, communication theory, and VLSI design).","title":"Collaborative Research: CDI-Type I: Realizing the Ultimate Potential of List Error-Correction: Theory, Practice, and Applications","awardID":"0835782","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7750","name":"CDI TYPE I"}}],"PIcoPI":["390981"],"PO":["565157"]},"143380":{"abstract":"Layer-8 attacks (e.g., spam and phishing) are launched from a malicious service platform, e.g., botnet, which consists of a large number of infected machines (or bots). Such an attack platform relies on lower-layer network services to achieve efficiency, robustness, and stealth in communication and attack activities. These services include look-up (e.g., DNS), hosting (e.g., Web servers), and transport (e.g., BGP).<br\/><br\/>The main research goals and approaches of the CLEANSE project are:<br\/><br\/> 1. Control-plane monitoring. Much of the infrastructure for mounting layer-8 attacks involves abuse of the control plane in core network services (e.g., DNS and BGP).<br\/>The CLEANSE project develops control-plane anomaly detection sensors that are distributed, online, and real-time.<br\/><br\/> 2. Data-plane monitoring. The project develops new and general network anomaly detection algorithms based on traffic sampling and clustering for monitoring high-speed traffic.<br\/><br\/> 3. Improved security auditing capabilities. The CLEANSE project develops packet \"tagging\/tainting\" techniques to enable tracking and clustering of network traffic flows (e.g., that are generated by the same bot program). The project also develops improved traffic sampling capabilities that are attack-aware and distributed network-wide.<br\/><br\/>By focusing on monitoring of core network services, the CLEANSE framework can detect future layer-8 attacks and new forms of large-scale malware infections. The project also creates educational contents, including new textbooks and on-line course materials, which directly benefit from the research activities. The CLEANSE project team also work with industry partners (including the ISPs) to organize focused workshops that bring together researchers from academia and practitioners from the industry\/ISP, government, and law enforcement agencies to foster the exchange of ideas, data, and technologies.","title":"Collaborative Research: CT-L: CLEANSE: Cross-Layer Large-Scale Efficient Analysis of Network Activities to Secure the Internet","awardID":"0831170","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["402605","548389"],"PO":["565239"]},"143391":{"abstract":"Layer-8 attacks (e.g., spam and phishing) are launched from a malicious service platform, e.g., botnet, which consists of a large number of infected machines (or bots). Such an attack platform relies on lower-layer network services to achieve efficiency, robustness, and stealth in communication and attack activities. These services include look-up (e.g., DNS), hosting (e.g., Web servers), and transport (e.g., BGP).<br\/><br\/>The main research goals and approaches of the CLEANSE project are:<br\/><br\/> 1. Control-plane monitoring. Much of the infrastructure for mounting layer-8 attacks involves abuse of the control plane in core network services (e.g., DNS and BGP).<br\/>The CLEANSE project develops control-plane anomaly detection sensors that are distributed, online, and real-time.<br\/><br\/> 2. Data-plane monitoring. The project develops new and general network anomaly detection algorithms based on traffic sampling and clustering for monitoring high-speed traffic.<br\/><br\/> 3. Improved security auditing capabilities. The CLEANSE project develops packet \"tagging\/tainting\" techniques to enable tracking and clustering of network traffic flows (e.g., that are generated by the same bot program). The project also develops improved traffic sampling capabilities that are attack-aware and distributed network-wide.<br\/><br\/>By focusing on monitoring of core network services, the CLEANSE framework can detect future layer-8 attacks and new forms of large-scale malware infections. The project also creates educational contents, including new textbooks and on-line course materials, which directly benefit from the research activities. The CLEANSE project team also work with industry partners (including the ISPs) to organize focused workshops that bring together researchers from academia and practitioners from the industry\/ISP, government, and law enforcement agencies to foster the exchange of ideas, data, and technologies.","title":"Collaborative Research: CT-L: CLEANSE: Cross-Layer Large-Scale Efficient Analysis of Network Activities to SEcure the Internet","awardID":"0831245","effectiveDate":"2008-10-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["553884","565326"],"PO":["565239"]},"139640":{"abstract":"This project provides solutions to one of the important components of an interactive, object-based, semantic multimedia information retrieval system: \"mosaic\" generation. A mosaic can be considered as a static component (or background) of a scene that does not change over a sequence of frames and is obtained by computing the global motion between frames, warping according to the global motion, and then blending the frames. Mosaic generation plays an important role in many applications including object-based coding (where objects in a scene are also coded or compressed independent of regular rectangular frame coding), video compression, video indexing, object tracking, virtual environments, security surveillance, wide-area surveillance, panoramic video, traffic monitoring, object recognition, and human behavior analysis since these applications usually require the subtraction of actual scenes from the background (or the mosaic) to determine the foreground objects. Since traditional mosaic generation methods require object segmentation for videos containing moving objects, they are not suitable for real-time mosaic generation and especially for video encoders that require sprite coding (coding based on layering objects on top of a mosaic or a sprite). This project (i) develops mosaic generation solutions for larger domains of videos; (ii) generates mosaics for videos containing many shots by classifying video shots; and (iii) develops objective evaluation methods for mosaic generation by producing ground-truths. Sprite fusion method blends assertive and conservative sprites that are generated using the aligned frame differences without object segmentation thus eliminating the object occlusion problem especially for videos where the camera tracks an object. Since the sprite fusion method computes the global motion once for a pair of frames and does not require object segmentation, it suits well for real-time mosaic generation or sprite coding for video encoders. As the mosaic is constructed for a sequence, the global motion vectors are stored to be able to generate (or warp) any frame with respect to another frame thus allowing to provide multiple degrees-of-freedom for spatial interactions including up-down, left-right, move forward-backward, and rotation. The multiple degrees-of-freedom with the warping of the current (or active) scene forms the basis of interactive video reproduction by regenerating any frame from the mosaic and then overlaying the active (current scene) on top of the reproduced frame. <br\/><br\/>The educational component of this project includes development of a new course on multimedia that appeals to any freshman students in order to grow interest in computer science. This course covers fundamental concepts in computer science including types of media, color models, storage devices, multimedia authoring, and internet. A multimedia workshop is planned for K-12 students. The results of this research project will be disseminated via Internet (http:\/\/www.cs.uah.edu\/~raygun\/projects\/mosaics.htm), including a video database system (video sets and any truth annotation for it) to share test data with other researchers and to encourage open metrics-based evaluations across research institutions. This project will foster the development of photo-realistic visualization systems using interactive video reproduction, with a wide range of applications.","title":"III-COR-Small: Developing Novel Mosaic Generation Methods for Object-Based Multimedia Information Systems","awardID":"0812307","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[371172],"PO":["563751"]},"143381":{"abstract":"Layer-8 attacks (e.g., spam and phishing) are launched from a malicious service platform, e.g., botnet, which consists of a large number of infected machines (or bots). Such an attack platform relies on lower-layer network services to achieve efficiency, robustness, and stealth in communication and attack activities. These services include look-up (e.g., DNS), hosting (e.g., Web servers), and transport (e.g., BGP).<br\/><br\/>The main research goals and approaches of the CLEANSE project are:<br\/><br\/> 1. Control-plane monitoring. Much of the infrastructure for mounting layer-8 attacks involves abuse of the control plane in core network services (e.g., DNS and BGP).<br\/>The CLEANSE project develops control-plane anomaly detection sensors that are distributed, online, and real-time.<br\/><br\/> 2. Data-plane monitoring. The project develops new and general network anomaly detection algorithms based on traffic sampling and clustering for monitoring high-speed traffic.<br\/><br\/> 3. Improved security auditing capabilities. The CLEANSE project develops packet \"tagging\/tainting\" techniques to enable tracking and clustering of network traffic flows (e.g., that are generated by the same bot program). The project also develops improved traffic sampling capabilities that are attack-aware and distributed network-wide.<br\/><br\/>By focusing on monitoring of core network services, the CLEANSE framework can detect future layer-8 attacks and new forms of large-scale malware infections. The project also creates educational contents, including new textbooks and on-line course materials, which directly benefit from the research activities. The CLEANSE project team also work with industry partners (including the ISPs) to organize focused workshops that bring together researchers from academia and practitioners from the industry\/ISP, government, and law enforcement agencies to foster the exchange of ideas, data, and technologies.","title":"Collaborative Research: CT-L: CLEANSE: Cross-Layer Large-Scale Efficient Analysis of Network Activities to SEcure the Internet","awardID":"0831174","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["464147","553725"],"PO":["565239"]},"147462":{"abstract":"Unlike current telecommunications based on electrical or optical signals, the biological communications technology uses chemical signals as carriers of information. This technology exhibits various distinct features such as biocompatibility and energy-efficiency, potentially enabling new Bio-ICT (Information and Communications Technology) applications that are not likely achieved by current silicon-based technology. For example, molecular communication can be applied to biocompatible information systems in which implanted biological devices chemically interact with tissues and organs in the human body. It is also applicable to unconventional information systems in which biological cells chemically coordinate to grow into a three dimensional structure that functions as information processing and storage systems.<br\/><br\/>In this project, the investigator is exploring biological cells and cell-to-cell communication mechanisms. The specific objectives in this project are fourfold; (1) design and engineering of system components - designing, engineering and characterizing necessary building blocks of molecular communication systems (e.g., repeaters and switches), (2) system integration - developing a microplatform that can integrate independent components into a working system, (3) application designs - demonstrating novel applications using an integrated molecular communication system, and (4) establishment of information theory - addressing the theoretical basis such as channel capacity and coding mechanisms of molecular communication. <br\/><br\/>The project is expected to provide new insights and findings into science and engineering. It examines how information is communicated, processed and stored in biological systems from a communication and engineering view point, which may help enhance current engineering principles as well as advance bio-inspired information technology. It is also expected to address a number of unanswered questions on design principles of biological systems.","title":"SGER: Molecular Communication Using Epithelial Cells","awardID":"0849358","effectiveDate":"2008-10-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7946","name":"BIO COMPUTING"}}],"PIcoPI":[392840],"PO":["564898"]},"144186":{"abstract":"Error-correcting codes, studied in a branch of science and engineering known as coding theory, safeguard data against the adverse effects of noise and enable reliable storage and communication of information. Such codes pervade our daily lives, with applications ranging from computer hard-disks and UPS bar-codes to cell phones and the Internet to deep space communication. One of the most fundamental questions in coding theory is the following: What is the largest possible fraction of errors that a code of information rate R can correct? Recent theoretical breakthroughs provide a complete answer to this question, namely that the ultimate error-correction radius of 1-R can be reached (by codes over sufficiently large alphabets). Moreover, it can be reached constructively with polynomial-time list decoding, via codes closely related to Reed-Solomon codes, which are ubiquitous in practice.<br\/><br\/>From a practical standpoint, this promises a factor of two improvement over classical error-correction algorithms that are in widespread use today. While this is extremely encouraging, numerous challenges must be overcome in order to bring the theoretical promise of the recent results to practice. This project, led by a multi-disciplinary team, involves an integrated collection of research activities targeted at progress towards the long term goal of attaining the fundamental limit of error-correction. At the theoretical end, the goals include improving the complexity of the decoding algorithms as one approaches the optimal error-correction radius of 1-R, and devising faster algorithms and heuristics for the key steps involved in algebraic list decoding. The project also studies methods to reap the practical benefits of combining the new codes with soft-decision decoding, putting to use the ample amount of probabilistic symbol reliability estimates often available to decoders. Furthermore, the research lays the groundwork for eventual implementation of such algorithms in high-speed\/low-power VLSI, thereby enabling the potential deployment of the new codes in a broad range of communication and storage systems. On the education front, the project provides a stimulating research environment for graduate students, encouraging team-work across university boundaries and collaboration across disciplines (computer science, communication theory, and VLSI design).","title":"Collaborative Research: CDI-Type I: Realizing the Ultimate Potential of List Error-Correction: Theory, Practice, and Applications","awardID":"0835843","effectiveDate":"2008-10-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7750","name":"CDI TYPE I"}}],"PIcoPI":["485936"],"PO":["565157"]},"139622":{"abstract":"The research objective is the theoretical and practical design and implementation of new computational data models and query languages for the trajectories (both historical and predicted) of moving objects in both constrained and unconstrained environments. One aspect is to include the modeling and querying of current and predictive movement (e.g., the prediction of the future evolution of hurricanes and wild fires) into databases. This especially introduces the inherent feature of uncertainty of moving objects, incorporates the database support of prediction models independent of applications, and includes a homogeneous and seamless integration of both historical and predictive moving objects in unconstrained environments that allow free movement. Another aspect relates to the special situation of moving objects in constrained environments, and here especially in spatial networks (like vehicles in transportation networks). The main issues here are how spatial networks as well as moving objects in them can be designed, queried, and implemented within a database system. The solution approach is based on three fundamental algebras or type systems that are embedded into database systems: (i) the Moving Balloon Algebra (MBA) for predictive moving objects in unconstraint environments, (ii) the Network Algebra (NETALG) for geometric networks in spatial databases, and (iii) the Moving Object in Network (MONET) Algebra for moving objects in spatial networks. <br\/><br\/>The resuls of this research are expected to have applications in areas where dynamically evolving spatial objects -- which change their location, shape, and extent over time -- play a role. Examples are meteorology, hurricane research, fire management, disaster management, navigation systems, environmental monitoring, transportation and distribution, emergency services, telecommunications, to name only a few. The educational component of this project includes specialized classes that focus on important aspects of this project, the creation and use of new GIS educational materials, and the involvement of students in interdisciplinary research. The project Website (http:\/\/www.cise.ufl.edu\/~mschneid\/Research\/FundedResearchProjects\/NSF-IIS-0812194\/)is used for the dissemination of research results, educational material, publications, generated data sets, produced software, and other information of interest.","title":"III-COR: Modeling and Querying Moving Objects in Unconstrained and Constrained Environments","awardID":"0812194","effectiveDate":"2008-10-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H447","name":"NATL GEO-INTELLIGENCE AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"H449","name":"NATL GEO-INTELLIGENCE AGENCY"}}],"PIcoPI":["409138"],"PO":["563751"]}}