{"189983":{"abstract":"The Programming Languages Mentoring Workshop (PLMW) will take place just before the flagship programming language conference, Principles of Programming Languages (POPL 2012). This grant will support 15 or more students to attend the PLMW event plus the POPL conference. While there is other funding available, this grant is intended specifically to increase the numbers of students from underrepresented groups and gives priority to US citizens and permanent residents. The broader impacts of the grant relate to the need to broaden participation, provide opportunities for students to receive mentoring from top members of the programming languages community, and build the next generation of researchers and knowledgeable practitioners in this important research arena.","title":"Student Travel Support for Programming Language Mentoring Workshop (PLMW 2012)","awardID":"1201858","effectiveDate":"2011-11-15","expirationDate":"2012-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["550615"],"PO":["564388"]},"193691":{"abstract":"This research involves collaboration among investigators at four institutions. Recent advances in motor behavior have uncovered structure in the supporting neural control architecture, including distinctions between feed-forward and feedback control functions and learning. While the neural code has not yet been cracked, much is now known about how its foundations for sensorimotor control differ from those of even the most modern computer-based algorithms. For example, neural function must accommodate transmission and processing delays, so feedback control is subservient to feed-forward and anticipatory control. The nervous system produces exquisite, constantly and widely available predictions concerning body and environment interactions. These predictive models (also called internal models) are constructed by learning the invariants in the mapping from motor commands to sensory feedback (and inverses thereof). The PIs have developed a unique approach based upon readings from a scalp array of EEG electrodes for the construction of algorithms (decoders) which predict motor behavior (control signals) as a weighted sum of the EEG data from all electrodes at multiple time lags. The team has demonstrated two-axis control over a screen cursor using only 10 minutes of EEG and motion training data, a feat far surpassing any brain-computer interface (BCI) available to date. In the current project, the team will build upon this prior work to design and validate noninvasive neural decoders that generate agile control in upper limb prosthetics. To this end, they will investigate neural correlates of brain adaptation to multiple sources of feedback using EEG and functional near infrared spectroscopy (fNIR). An important challenge will be to provide sensory feedback appropriate to contact tasks performed with a prosthesis. Existing BCIs and neuro-prosthetic devices rely at best on vibrotactile feedback and often only on visual feedback. The PIs will add haptic and proprioceptive feedback in concert with a novel adaptation of vibrotactile, skin stretch, and arm squeeze technologies in the prosthesis interface, to provide intuitive control over contact tasks and to strengthen the motor imagery whose neural correlates are processed by the EEG decoder. To establish baseline measures, the team will compare prosthetic performance under direct brain control to myoelectric prosthetic control and direct manual control. Experiments will be performed involving both able-bodied individuals and amputees, in which real-time decoding (EEG) and analysis (EEG\/fNIR) of sensorimotor control and cognitive load will be combined. <br\/><br\/>Broader Impacts: This research will revolutionize the control and interface of upper limb prosthetics. The work will lead to a better understanding of the role of sensory feedback in brain-computer interfaces and will lay the foundation for restoration of motor and sensory function for amputees and individuals with neurological disease. The project will create a unique interdisciplinary environment enabling education, training, co-advising and exchange of graduate students, course development, and involvement of undergraduates in research. The PIs will also participate in outreach activities on their various campuses, targeting underrepresented groups in science and engineering.","title":"HCC: Medium: Collaborative Research: Improved Control and Sensory Feedback for Neuroprosthetics","awardID":"1219321","effectiveDate":"2011-11-01","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["547729"],"PO":["565227"]},"185158":{"abstract":"Northwestern University proposes to develop computational thinking (CT) activities that can be embedded throughout existing high school STEM curricula. The approach casts a wide net, introducing a diverse range of students (including those from traditionally underrepresented groups) to CT skills through STEM courses that they are already taking. The intent is that students understand that computing is more than programming, it is a vital skill set that pervades modern STEM fields. In addition to the embedded CT activities, the project will develop a full-year course that explores the use of computational methods across a range of disciplines including math, physics, chemistry, biology, and earth\/environmental science. This project builds on existing partnerships with local schools and teachers and on an NSF GK12 program, Reach for the Stars, that pairs graduate students in CS\/STEM disciplines with local middle and high school teachers to develop CT activities based on the graduate students' research. The current proposal will use this rich set of initial CT activities as a starting point for developing 60 refined CT activities that can be embedded in traditional STEM courses. Two summer professional development workshops and ongoing Saturday sessions will be used to train a team of 30 pilot teachers to test the CT activities in their STEM classrooms. These professional development resources will then be revised for larger-scale replication of our CT curriculum. Evaluation studies will document the CT learning and attitudinal gains for both teachers and students and provide initial evidence on the success of our embedded CT approach.","title":"Type 1: Casting a Wide Net: Applied Computational Thinking","awardID":"1138461","effectiveDate":"2011-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["562574","564206","501314",496807,"564207"],"PO":["560704"]},"184115":{"abstract":"How the brain estimates the 3D shape of objects in our surroundings remains one of the most significant challenges in visual neuroscience. The information provided by the retina is fundamentally ambiguous, because many different combinations of 3D shape, illumination and surface reflectance are consistent with any given image. Despite this ambiguity, the visual system is extremely adept at estimating 3D shape across a wide range of viewing conditions, something that no extant machine vision system can do. The long-term goal of the project is to develop a computational model in neural terms to explain how 3D shape is estimated in the primate visual system. It will build upon the responses of cells early in visual cortex (V1) and develop models of how they can be organized into mid-level configurations that specify 3D shape properties. Importantly, the project will also measure human perception of 3D shape in a series of psychophysical experiments designed to test specific predictions, bringing together the complementary expertise of Roland W. Fleming (Giessen University: human perception, psychophysics) and Steven W. Zucker (Yale University: computational vision, computational neuroscience). The results should provide a deeper understanding of visual circuit properties in the ventral processing stream; they should provide models for 3D computer vision and graphics; and they may pave the way for the development of rehabilitation strategies for patients with visual deficits.<br\/><br\/>The basic approach starts with populations of neurons tuned to different orientations and seeks to understand how these provide basic information about local shape properties according to the principles of differential geometry. Specifically, when 3D surfaces are projected onto the retina, the distorted gradients of shading and texture lead to highly structured patterns of local image orientation, or orientation fields, which can be inferred via circuits involving long-range horizontal connections. The investigators seek to derive formal models showing how these networks can be organized to infer 3D surface properties. The specific approach is involves four stages: (i) modeling how the visual system obtains clean and reliable orientation fields from the outputs of model V1 cells through lateral interactions and feedback; (ii) establishing how local measurements are grouped into specific \"mid-level\" configurations to support the recovery of 3D shape properties (modeling V2 to V4); (iii) modeling how these low- and mid-level 2D measurements can be mapped into representations of 3D shape properties (V4 to IT); and (iv) modeling how grouping and global constraints can convert these shape estimates into global shape reconstructions (again V4 to IT). Targeted psychophysical experiments will complement all of the modeling and test specific predictions from it. The resulting stimuli will support next generation neurophysiological experiments. Although the above stages define a working strategy, dependencies among these stages should also provide a model of the feedforward\/feedback projections that link different areas of cortex. The ultimate goal is a model that can correctly predict the errors, the successes, and the limits of human shape perception. <br\/><br\/>This project is jointly funded by Collaborative Research in Computational Neuroscience and the Office of International Science and Engineering. A companion project is being funded by the German Ministry of Education and Research (BMBF).","title":"US-German Collaboration: Towards a Neural Theory of 3D Shape Perception","awardID":"1131883","effectiveDate":"2011-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["560901"],"PO":["564318"]},"186658":{"abstract":"This is funding to support a doctoral symposium and meeting of the Principle Investigators (PIs) for the NSF Social-Computational Systems (SoCS) program that will be held in July 2012. All PIs and co-PIs funded through the 2010, 2011, and 2012 SoCS programs will be invited to attend, as well as a few other distinguished researchers. The PIs will share ideas and insights with each other about research in the emerging new area of social computational systems, with the specific goal of helping to strengthen the nascent research community. A doctoral symposium will be held prior to the beginning of the PIs meeting. Participating students will experience a full day of presentations and discussions of doctoral research, mentored by a diverse set of experienced faculty.<br\/><br\/>Intellectual merit: Systems in which people and computers work together in a socially intelligent manner represent a new form of computing that brings together the challenges of traditional computing (e.g., algorithms, information representation, information acquisition, data quality) with those of human interaction (e.g., cognition, social interaction, culture, learning) and indeed a whole host of new challenges related to the combination of humans and computers (e.g., computer reasoning about human knowledge and abilities, socially-intelligent human-computer interaction, social computing). Individuals and groups have been working on particular problems in this space for decades, but this work has often been carried out in research pockets connected to existing fields, and unfortunately isolated from each other. As the introduction of the NSF SoCS program illustrates, there is good reason to believe that the widespread work in social-computational systems would benefit from cross-fertilization and from bringing together diverse researchers into a meaningful community. The SoCS doctorial symposium and PI meeting is one step in that process. Doctoral students pursing SoCS research face numerous challenges, including defining research that spans computing and human elements, but also identifying meaningful evaluation for their research (often in the absence of close precedents) and positioning their research to fulfill the requirements of disciplinary dissertation committees. The doctoral symposium will help students hone their dissertation projects so that they can make better contributions to the solution of these intellectual challenges, and also help them build a social network of fellow doctoral students and more senior researchers to support their careers. The PI meeting will feature tutorials that build common ground among researchers from various disciplinary backgrounds. A series of small poster sessions will allow PIs to engage with the emerging results of other SoCS-funded projects and get feedback on their own work.<br\/><br\/>Broader impacts: Many of the biggest challenges in successfully deploying computer systems in organizations come down to the difficulty of adapting technology to human organizations and vice versa. The development of the SoCS field will directly create new knowledge and understanding in how to more successfully manage the relationship between social (human) organizations and the computer tools they use to work together more effectively. This new understanding has the potential to directly benefit a wide variety of users of information technology. The development of doctoral students is itself a key broader impact. As a result of the PI Meeting, participants will be in a stronger position to do SoCS research. New collaborations and new grant proposals are two anticipated concrete outcomes.","title":"Workshop: SoCS Doctoral Consortium and PI Meeting","awardID":"1146664","effectiveDate":"2011-11-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7953","name":"SOCIAL-COMPUTATIONAL SYSTEMS"}}],"PIcoPI":["539967"],"PO":["564456"]},"193027":{"abstract":"Social science takes as axiomatic that agents act on beliefs: however, teasing out the correlations between belief and action is no simple feat. Traditionally, social scientists relied on survey data to measure sentiment that might indicate changing economic trends, and on lab experiments to test actions given manipulated beliefs. Surveys, however, are notoriously expensive to scale, difficult to conduct frequently, and possess bias; lab experiments artificially constrain decision-making and thus fail to capture the complex dependencies of real-world actions. <br\/><br\/>This project will generate measurements of public sentiment directly from the actions of people, using one of the largest datasets of human behavior ever studied: online opinions expressed on platforms like Twitter or comments posted on news websites, time series representing the volume of search queries on Google, and call detail records. Using these digital footprints, the project will develop new social-computational measures of public sentiments related to the state of the economy, expected unemployment, and concerns about national priorities. <br\/><br\/>Broader impacts: The project will offer new alternatives to surveys as a measure of public sentiment, and will also generate unprecedented insight into the online and onsite behavior of the American population. This research also has the potential to help public and private organizations better understand the dynamic behaviors of customers and constituents, and to make business and policy decisions informed by economic trends derived from data. The project will enhance education through the interdisciplinary training of graduate students. Both graduate and undergraduate students from underrepresented groups will be actively encouraged to participate in the project. A public website will also be set up detailing the project results.","title":"Collaborative Research: Using Multi-Modal Digital Footprints to Infer Public Sentiment","awardID":"1216345","effectiveDate":"2011-11-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7953","name":"SOCIAL-COMPUTATIONAL SYSTEMS"}}],"PIcoPI":[517099],"PO":["565215"]},"184107":{"abstract":"For over 80 years, researchers have observed rhythmic electrical activity in the neocortex, the outer shell of neurons covering the mammalian brain. Despite the prevalence of these oscillations, their meaning for computation--if and how they help us move, perceive and\/or think--is a topic of intense debate. Beta oscillations, rhythmic activity at 15&#8208;29 Hz, are prominent in neocortex. Overexpression of beta is a hallmark of Parkinson's disease, and treatments that relieve its motor symptoms also diminish beta. Similarly, beta oscillations predict failure by human subjects to perceive sensory stimuli. These findings directly implicate beta as important for information processing and healthy brain function. Understanding the detailed origins of beta is crucial to knowing its role and to potentially guiding targeted therapies.<br\/><br\/>The present study will test a recently developed hypothesis that explains the natural expression patterns of beta in the human brain. This hypothesis emerged from a detailed biophysically accurate and multi&#8208;area computational neural model. To test this hypothesis, the proposed research will use detailed simulations of multiple brain areas to guide experimental recordings and brain stimulation. These data will in turn be used to advance and constrain the model. As part of this research, the model will be elaborated to include interconnected elements from the basal ganglia, thalamus and neocortex.<br\/><br\/>These same areas will be targets for neural recording, to understand how their activity correlates with neocortical beta in anesthetized and behaving preparations processing sensory information. Causal testing of model predictions will be achieved by leveraging recent innovations in optogenetics, the application of light pulses to turn neurons on and off with millisecond precision and cell-type specificity. Optogenetics will test in a real brain the sufficiency and necessity of the activity patterns that are predicted by the model to lead to expression of this brain rhythm.","title":"CRCNS Research Proposal: Contributions of the Thalamus and Basal Ganglia to Neocortical Beta Oscillation: A Novel Computational Hypothesis","awardID":"1131850","effectiveDate":"2011-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7334","name":"MATHEMATICAL BIOLOGY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[493725,493726],"PO":["564318"]},"193910":{"abstract":"This project focuses on deriving novel control strategies, inspired by properties exhibited in nature, for networked cyber-physical systems, with specific application to networked autonomous vehicles. Many phenomena in nature cannot be explained in the framework of integer-order dynamics. Similarly, networked cyber-physical systems operating in complex environments often demonstrate non-integer-order (i.e., fractional-order) dynamics. Flocks of birds often exhibit distributed coordinated tracking behavior. Similarly, distributed discrete-time coordinated tracking strategies that are candidates for implementation on networked embedded computers are important in many applications involving networked autonomous vehicles. The thrusts of this project are (i) analysis and design of distributed strategies for coordination of networked fractional-order systems, (ii) analysis and design of distributed discrete-time coordinated tracking strategies, and (iii) experimental validation of new distributed strategies on teams of networked ground robots and unmanned aerial vehicles (UAVs). Specifically, the PI will analyze and design distributed coordination strategies for networked fractional differential equations and derive an optimal coordination strategy with varying fractional orders. The PI will also address the theoretical challenges of distributed discrete-time coordinated tracking in the presence of dynamic network topology, time delay, asynchronous interaction, and information feedback. The research is expected to lead to new thinking about networked cyber-physical systems operating in complex environments, provide coordination schemes accounting for real-world constraints, and help bridge the gap between theory and applications in distributed coordination of networked autonomous vehicles. The research has impact on numerous civilian, homeland security, and military applications involving networked cyber-physical systems. Examples include precision agriculture, automated mining, environmental monitoring, border patrol, surveillance, and reconnaissance. On the education side, the PI will mentor and educate undergraduate and graduate students through his research, a yearly Sumo Robot competition, and the Utah State University Robotics Club. The project will also provide research experience for K-12 teachers and students.","title":"CSR-EHCS(CPS), SM: Nature-inspired Control of Networked Cyber-physical Systems","awardID":"1221384","effectiveDate":"2011-11-04","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["484812"],"PO":["535244"]},"192408":{"abstract":"This research entails: (1) CyberGRID Net - developing a research data collection and analysis tool integrated into an existing global virtual engineering team working environment, and (2) CyberGRID Networks - utilizing that tool to develop fundamental insights into how globally distributed engineering teams enact complex design work together and with affordances in the virtual environment. The CyberGRID Net will be a research tool that augments an existing virtual environment developed by the investigators for global design work. It will extend current pedagogical tool functionality with the following research-oriented features: (1) the existing TeamWall model-sharing display will detect and track locations of object referencing actions (e.g., pointing to a feature in a design) and functionality will be added for participants to self-indicate when phenomena of research interest occur, (2) virtual environment recordings will be time-stamped when researcher-specified interactions take place, (3) avatar-avatar and avatar-object interactions will be detected along with metadata about the interaction, and (4) functionality will be added for collaborative discussion, data analysis and annotation across a global virtual research team.<br\/><br\/>In a series of experiments, the CyberGRID Net research infrastructure will be used to engage critical organizational research questions: How are Building Information Models (BIM) in the virtual environment used as a boundary objects to resolve conflicts in the knowledge system of global virtual engineering teams? How do conflicts emerge in avatar-avatar interactions? How are conflicting obligations resolved in virtual teams by emergent virtual team leaders? How are boundary objects used in a cross-cultural context? How do leadership styles and community of practice formation vary when team members come from different countries representing different cultures and standards of practice? These questions will be explored in three separate experiments employing a multi-method approach which includes ethnographic observation, social and interaction network analyses, and user reflection. They will involve international activities and will include graduate engineering students in the U.S., India and Finland, as well as industrial participants utilizing the CyberGRID in an industrial test case.<br\/><br\/>This research will utilize computational thinking to develop a new research tool to transform the way global virtual teams are researched, and to link avatar-object interactions into network analyses to transform approaches to modeling knowledge systems in global virtual teams. The CyberGRID Net tool will be used in experiments to expand knowledge system dynamics theory as well as theories of virtual team network formation and leadership. This research may lead to fundamental transformations in design pedagogy which, in turn, can provide new exciting engineering career paths. The research may also improve strategies of engineering firms and policymakers concerned about the leadership role of U.S. engineers in the global workforce.","title":"VOSS: Collaborative Proposal: CyberGRID Networks - Cyber-enabled Global Research Infrastructure for Design Networks","awardID":"1212673","effectiveDate":"2011-11-01","expirationDate":"2014-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["217344"],"PO":["564456"]},"182719":{"abstract":"This is funding to support next year's CSCW doctoral research consortium (workshop) of approximately 14 promising doctoral students from the United States and abroad, along with 6 distinguished research faculty. The event will take place in conjunction with the ACM 2012 Conference on Computer Supported Cooperative Work, to be held in Bellevue, Washington on February 11-15, 2012, and sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). The CSCW conferences are a premier venue for the presentation of research relating to the design and use of technologies that affect groups, organizations, and communities, and are attended by approximately 500 professionals from around the world. The development and application of new technologies continues to enable new ways of working together and coordinating activities. Although work is an important area of focus for the conference, technology is increasingly supporting a wide range of recreational and social activities. CSCW has also embraced an increasing range of devices, as we collaborate from different contexts and situations. The conference brings together top researchers and practitioners from academia and industry who are interested in both the technical and social aspects of collaboration. CSCW 2012 will be the 24th conference in the series. Research reports published in the CSCW Conference Proceedings are heavily refereed and widely cited. More information about the conference may be found at http:\/\/www.cscw2012.org.<br\/><br\/>The Doctoral Colloquium at CSCW 2012 will take place on Saturday, February 11 and Sunday, February 12, with follow-up activities (including poster sessions) during the conference's main technical program. Goals of the doctoral consortium include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field mentor them and provide constructive advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants, who are chosen by a review committee based on materials submitted by applicants in response to the CSCW Call for Participation, will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other CSCW research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Extended abstracts of the students' presentations will be published in the CSCW supplemental proceedings, which are distributed to all attendees. The organizing committee will take proactive steps to ensure and increase participation from institutions and ethnic groups that have been traditionally underrepresented at CSCW.<br\/><br\/>Broader Impacts: The CSCW doctoral consortia, which began in 1992, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today?s leading CSCW researchers participated as students in earlier consortia. These doctoral consortia traditionally bring together the best of the next generation of CSCW researchers, allowing them both to sharpen the research skills and to create a social network among themselves and with senior researchers at a critical stage in their professional development. Maintaining and fostering research dialog among the diverse disciplines that are present in the CSCW community results in synergistic and transformative research collaborations. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: 2012 Computer Supported Cooperative Work Doctoral Consortium","awardID":"1124314","effectiveDate":"2011-11-01","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[489545],"PO":["565227"]},"189252":{"abstract":"This project is a three-day public summit on fostering partnerships and linkages between disciplines, sectors, agencies and nations in sustainability science and innovation. The summit will feature invited presentations and discussions to showcase U.S. federal investments and institutional structures regarding sustainability, identify opportunities to help promote practices that would lead communities toward sustainability, and address communication issues needed to recognize science and innovation as central to the understanding and adoption of sustainable practices. An ad hoc organizing committee will develop the agenda, and select and invite speakers and discussants. Nominees to the organizing committee as well as the ~200 conference participants will include those with expertise in sustainability from a variety of perspectives, including federal, state and local government, the private sector, academia, nongovernmental organizations, and international bodies. The format will include multi-partner panels, plenary and breakout sessions addressing a variety of sustainability concepts, including, but not limited to, examples of successful partnerships, communication and outreach of sustainability science, sustainability metrics, infrastructure and data needs, and international sustainability efforts. <br\/>Broader Impacts<br\/>The summit will be held in spring 2012 and a brief summary of the event will be issued. This summary will be developed in accordance with institutional guidelines and will be subject to appropriate review procedures prior to release. The summary will be disseminated widely to interested audiences within local, state and federal governments, industry, universities and nongovernmental organizations.","title":"Fostering Partnerships and Linkages in Sustainability Science and Innovation - A Summit","awardID":"1160430","effectiveDate":"2011-11-01","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7742","name":"PIRE"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7699","name":"ICER"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1401","name":"Division of ARCTIC SCIENCES DIVISION","abbr":"ARC"},"pgm":{"id":"5202","name":"ARCTIC RES & POLICY SUPPORT PR"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"5130","name":"ANTARCTIC COORDINATION & INFOR"}}],"PIcoPI":[507390],"PO":["564294"]}}