{"132011":{"abstract":"SCENS (Secure Content Exchange Negotiation System) is a centralized repository of metadata that indexes data held on other sites and allows data holders to set conditions for data access and reuse. The system extends previous work on MetaDLs (metadata digital libraries) to enable different entities to advertise their data holdings through a common, structured interface. In addition to matching data holders with those searching for data, SCENS functions as a broker of data exchanges, recording agreements on usage (and thus also documenting statistics of data demand and usage), and also providing a receptacle for collecting feedback. The system is being developed in the domain of healthcare data, but the negotiation model it represents is powerful, with applications to many other domains. Once data sharing has been demonstrated as improving efficiency and usability of acquired information within the involved heath care agencies, and has become an integral part of workflow and communication, it will be easier for other biomedical organizations, government agencies, and other entities to be convinced that adopting data sharing will make it easier to achieve objectives, exploit synergies, and gain access to more information than previously possible. The project's findings have wide applicability in many fields, such as medicine, science, commerce, entertainment, and security, and will be available at the project Web site (http:\/\/heracleia.uta.edu\/scens\/). From a management viewpoint, overall efficiency and optimal redistribution of resources within an organization can be improved by monitoring the sharing of data between separate parts of it. SCENS aims to provide a flexible yet powerful method of achieving these goals.","title":"Data Management of Protected Information for Data Sharing and Collaboration","awardID":"0733673","effectiveDate":"2006-11-15","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["229551"],"PO":["469867"]},"132012":{"abstract":"We propose a system, MS-Analyze, to analyze and detect patterns in Multiple Sclerosis (MS), a brain disease that can lead to loss of motor and memory skills and even death, as the disease progresses over time. Magnetic Resonance Imaging (MRI) is used to monitor brain changes at regular time intervals using different imaging modalities, and subjects are also tested for their motor and cognitive fitness, as different drug treatments are explored to slow the disease. Effective correlation of patterns in pathology with drug treatments requires access to large amounts of integrated data, which is usually not available to any one given laboratory.<br\/>MS-Analyze addresses both of these challenges by combining data collection, data fusion, data analysis, and secure data sharing. The proposed work will generate new methods of representing and managing heterogeneous data streams. It will provide new mechanisms for data sharing and research collaboration, fast pattern discovery and a testbed for developing standards for sharing sensitive information. MS is a good application to demonstrate the system because it offers rich data that challenge the system development.<br\/>Broader Impact: Aside from solving the immediate need for data, this project also has a strong educational and training component as it is built also to train users in dealing with complex data as in MS.","title":"ITR: A System for Data Integration and Pattern Discovery in Multimodal, Spatio-temporal Data: Lesion Analysis and Data Sharing","awardID":"0733674","effectiveDate":"2006-11-15","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["414759","229551"],"PO":["563751"]},"118923":{"abstract":"This project will implement a Knowledge-Based Archaeological Data Integration System (KADIS) that employs novel, query-driven, ad hoc data integration strategies. This effort responds to the results of a two-year long investigation into the information-integration demands of archaeology that revealed fundamental technical challenges that could not be handled by a straightforward adaptation of existing technologies. Once archaeologists have registered datasets though KADIS, researchers across scientific disciplines can, over the Web, extract sensibly integrated and appropriately scaled databases of analytically comparable observations from numerous archaeological datasets gathered using incommensurate recording protocols. Although initial development of KADIS will focus on fauna from archaeological contexts, it establishes an open-source, extensible foundation for a global, archaeological information infrastructure. The project will establish the capacity to build and access a worldwide archive of primary data representing the full history of human use of animals. Concept-oriented queries of this archive will advance socio-ecological modeling efforts and allow scientists to address large-scale and long-term social and natural science questions with empirical support that has heretofore been unthinkable. Testbed research will investigate the socio-environmental conditions that lead to depressed abundance of preferred game - over two millennia in two US regions. <br\/><br\/>The query-driven, ad hoc integration architecture of KADIS will be applicable to many other science informatics domains in which complex inferences need to be made over multiple heterogeneous, inconsistent, and context-dependent sources. Using KADIS, specialists in other fields could use intermediate-level archaeological knowledge to obtain primary data scaled to the scope of their inquiries. By providing scholars in diverse fields with meaningful access to long-term data on society, population, and environment, archaeology can help explain the complex human and social dynamics that have constituted today's social world and shaped the modern environment. Impacts on the infrastructure of social and natural science extend far beyond the traditional boundaries of academia. KADIS addresses critical needs of private, tribal, and governmental archaeology programs. In addition, it enables serious archaeological research by individuals outside academia and those lacking physical or financial capacity to do fieldwork. It provides a means to maintain the long-term utility and accessibility of irreplaceable primary data in the face of inadequate metadata and rapidly changing technology. <br\/><br\/>This research will engage a multidisciplinary team of graduate assistants and undergraduate interns and will be a testbed for Computer Science students to explore key issues of science informatics. Undergraduates worldwide can become a new community of users as critical thinking exercises in anthropology courses are redesigned to employ large-scale research datasets using KADIS, rather than the artificial data usually analyzed.","title":"AOC: Archaeological Data Integration for the Study of Long-Term Human and Social Dynamics","awardID":"0624341","effectiveDate":"2006-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["503649","497627","509597","558560","464839"],"PO":["564456"]},"121776":{"abstract":"Science uses models not just to represent theories, but to think with. The models are most useful if they are powerful enough to capture the phenomena, and small enough to be comprehensible. This is not done enough in the expedient world of computing, where the artifacts tend to be functional rather than understandable. Much coding today uses techniques from the 60s, often resulting in millions of lines of code. But one's sense of intuitive entropy insists the mathematical content is tiny compared to the code size. Environments are not just used, but also lived in and learned. So advances in self-explanation would lift both software engineering (a disclosable system would be of great utility for practical programming) and computer science (the requirements for understandability and disclosure would naturally lead to the invention of better and higher level computational structures). These in turn would lift design (the visible system at all levels should be clean, compact, powerful, simple, and pretty, not dirty and ponderous). The PI's long and illustrious research career has combined interests and inventions in computer science (object-oriented programming, reflective whole systems, and networking), UI (overlapping windows and icons), education (particularly for children), design (striving for beauty as well as problem solving), and computer engineering (learning how to efficiently make whole hardware\/software systems). The alternative systems he has developed have been small in comparison with standard practice. Squeak, for example, covers much of personal computing (including its own applications, operating environment, UI and development tools, etc.) in ~2.8MB of code (about 200,000 lines). With a careful new design the PI is confident it could be smaller by a factor of 10 or more. In this project the PI and his team will design and build an extremely compact and practical model of an entire personal computing system from the metal upwards, including the equivalents of an operating system, development tools, graphical user interface, applications, media, end-user programming, and internet communications, sharing and media (analogous to the web++) - as an \"Exploratorium\" for itself that can be readily understood by teenagers on up. Each part of the dynamic architecture will use wholly new or newly adapted powerful ideas that should help advance understanding of how to design and build whole systems from the metal up through UI and applications; much of the small model size will derive from abstracting \"the many\" into \"the one\" and other special mathematical approaches. This funding is for support of the central part of this large project (which is partitioned so that a complete and interesting system will result from the NSF support alone). The software developed will be freely disseminated on multiple platforms, and extensive user testing will be conducted in schools and universities. A key platform will be the under-powered \"$100 laptop\", an acid test of the pragmatic depth of the system.<br\/><br\/>Broader Impacts: Most early learning of programming is done in a non-scalable way, somewhat equivalent to banging together a doghouse with nails and planks. What is learned doesn't scale well by a factor of 5, let alone by factors of 100+. Even more critically, the deeper mathematics-like nature of the most powerful ideas in computing is poorly described and learned via papers, which even if they are read are often difficult to understand. Making a well-designed system that is also instrumented to promote learning and to facilitate changes will have a dramatic and positive impact on many areas of computing. It will constitute an example of \"the system is the curriculum\" for learning many important and powerful ideas, especially by teenagers and university students who comprise tomorrow's programmers, and who will find ways to make great use of a simpler yet stronger approach to personal computing.","title":"Steps Toward the Reinvention of Programming","awardID":"0639876","effectiveDate":"2006-11-15","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["535733","535734",323639,323640],"PO":["565227"]},"122835":{"abstract":"This proposal requests funds to support a workshop on the next generation of distributed repositories for scholarly information managed by academic institutions. The workshop will be international in scope, with participation and support from the British Joint Information Systems Committee (JISC). Participation and support is also expected from the Library of Congress, and the NSF Office of Cyberinfrastructure. The workshop is planned to be held in conjunction with the meeting of the Coalition for Networked Information (CNI) in Phoenix, Arizona, in April 2007. Preliminary planning sessions of the organizers and funders are also planned to take place in Washington, DC. The Impact of this proposed workshop promises to be significant, as efforts to create interoperable repositories proliferate around the globe and consensus is rapidly building on the essential elements and features that each repository must have to allow effective distributed architectures to emerge.","title":"The Next Generation of Academic Repositories Phoenix, AZ April 2007","awardID":"0645988","effectiveDate":"2006-11-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["464231"],"PO":["433760"]},"120809":{"abstract":"To achieve more efficient spectrum utilization, the FCC has been revisiting traditional license-based policies and moving toward the increased use of unlicensed, rule-based, strategies. In this scenario, attention is being given to cognitive radio, which uses spectrum on an opportunistic basis. <br\/>The investigators study the design and performance evaluation of algorithms for the transmission of real-time video over cognitive radio channels. Since this technology involves sharing common spectrum, one key question is how much interference its deployment will impose upon the primary users' signals occupying the band. The investigation involves designing specific compression algorithms for video transmission over an opportunistically-used channel, and determining end-to-end performance in terms of video quality.<br\/><br\/>The goal of a cognitive radio is to increase the spectral efficiency of allocated spectral bands by opportunistically making use of spectrum that is temporarily free of traffic. This is accomplished by sensing the channel, and adapting parameters of the transmit waveform such as modulation format, power, bandwidth, frequency location, and code rate. This research takes a cross layer approach, involving physical layer waveform design, receiver design, and channel state information, and application layer considerations, such as scalable video coding, multiple frame prediction, and end-to-end distortion measures.<br\/>System components consume bandwidth and delay, and the research involves allocating a fixed bit budget and\/or delay budget across layers. For example, a delay constraint necessitates tradeoffs between system components such as interleaver size and source encoder output buffer size. The main topics investigated are: (a) Adaptive receiver design and performance analysis for video transmission over cognitive radio mobile channels, (b) Optimal design of scalable video encoding for a cognitive radio environment, and (c) Optimal delay budget allocation.","title":"Video Coding for Cognitive Radio","awardID":"0635165","effectiveDate":"2006-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["507610","507609"],"PO":["432103"]},"118896":{"abstract":"This interdisciplinary effort develops, integrates, and refines a suite of activity and behavioral observation tools supporting the automatic collection, annotation, access, analysis, and archiving of behavioral data for individuals and groups. These tools capture a continuous audiovisual record of human activity in various settings and apply machine intelligence technology to automatically process that record for efficient use by analytical observers to monitor situational behavior over time. The annotated record provides a level of completeness not feasible with human observers, allowing, for the first time, large-scale longitudinal behavioral and clinical research based on continuously captured and processed data, enabled through extensible interfaces accessing such voluminous records in a user-friendly, yet utilitarian manner. The record will be processed with data reduction and extraction technologies that recognize faces and speech, track moving individuals, and identify social interactions, while protecting the confidentiality of the participant's identity in collaboratively accessible, computerized databases. <br\/><br\/>The tools focus on the automatic identification of features within the audiovisual record to improve the accuracy and completeness of manual, labor-intensive rating instruments. Through computer vision, speech recognition, sensor integration, and machine learning, multimedia data extraction technologies will be developed for individual behavioral measurements. Additional tools will be developed to mine the resulting annotated longitudinal datasets for insights into individual interactions and reactions. The relevance of the tools will be demonstrated, refined, and validated through an initial challenge application and environment: the elderly residents in a continuing care retirement community. Collaborating studies of parent-child, teacher-student and autistic children social interactions will validate portability and utility across domains of behavioral research. The tools will be extensible, enabling behavioral scientists to better accommodate novel situations and source material. Specifically, the scientist will be able to identify a need for a class of audiovisual detection, adeptly supply training material for that class, and iteratively evaluate and improve the resulting automatic classification produced via machine learning and rule-based techniques. <br\/><br\/>The project's broader impacts include supplying social and behavioral scientists with automated tools supporting novel approaches to creating and analyzing data in their endeavors to characterize human behavior. Research by sociologists, psychologists, anthropologists, and medical clinical investigators will be enabled in new modes with greater accuracy and precision of observation than has heretofore been possible or practical. Ethical issues are explicitly and proactively addressed to engage the larger social concerns.","title":"HSD: Extensible Machine Intelligence for Automated Video Understanding of Longitudinal Change in Individual and Social Behavior","awardID":"0624236","effectiveDate":"2006-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":["420371","333951","371226","533348","371225"],"PO":["564456"]},"123891":{"abstract":"0650577<br\/>OH <br\/>This award supports a planning visit to enable Dr. Paul Oh of Drexel University and Dr. Dennis Hong of Virginia Institute of Technology, together with four U.S. graduate and undergraduate students, to meet with Dr. Jun Oh of the Korea Advanced Institute of Science and Technology and Dr. Jae Song of Korea University. The timing of the visit will coincide with the annual Robot Week in Seoul, permitting the U.S. team to also meet with a large number of Korea's roboticists from academia, industry and government agencies. The visit will help develop a concrete plan for collaborative research on humanoid robotics. In particular, the visit will facilitate the U.S. team's efforts to construct an adult-size biped humanoid and legged walker. The long-term goals of the collaborative research include using humanoids: to validate hypotheses on human balance disorders, like Parkinson's disease, that involve head-torso locomotion and vestibular-ocular reflex; to identify legged locomotion designs to help ambulate the elderly or traverse rough terrain; and as a platform to gain insight on teaching multi-disciplinary international design teams. It is anticipated that this project will provide unique training and educational opportunities for U.S. students to obtain global research experience, and that the collaborations will benefit the participating institutions in both countries.","title":"Korea Planning Visit for Humanoids-based Multidisciplined International Teaming and Large Scale Systems Integration","awardID":"0650577","effectiveDate":"2006-11-15","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["403839"],"PO":["497457"]},"118931":{"abstract":"This is a study of social relationship formation and development, on a massive scale, making use of a very large online personals website. For decades, psychologists have studied interpersonal attraction and social relationships. Yet relationship formation - the intervening process between attraction and a stable relationship - has been understudied. This is due in large part to the difficulty of recruiting study participants at this delicate stage; a dyad (pair) on a second date will not respond to a recruitment call for a couples study because, at that point, the people themselves do not know if they will become a couple. Understanding what leads to successful formation is a critical step in understanding successful relationships generally. <br\/><br\/>The research will capture relationship formation at its early stages. By tracking communicating dyads before they meet in person, through their face-to-face meeting, and on to the establishment of a relationship, researchers will have access to their perceptions of each other throughout the crucial but ambiguous process of relationship formation. At each step, some dyads will dissolve - that is, some will never meet in person, and of those that do, only a fraction will form a relationship - but by taking an initial sample in the hundreds of thousands, the research will be assured of a large set of participants who do progress to a full-fledged relationship. Psychologists have long sought longitudinal data of this scale and scope but until now have had no practical way to obtain it.<br\/><br\/>The work is an interdisciplinary combination of methods from the fields of social psychology, human-computer interaction, and quantitative sociology. It will use questionnaire techniques from personality studies, the results of which will be analyzed with statistical methods including structural equation models and event-history analysis. An alternative user interface will be developed on the basis of results of the statistical analyses. This will be followed by a new round of questionnaires and analysis to determine the effects of the intervention. <br\/><br\/>The research will advance scientific knowledge by deepening our understanding of relationship formation processes in general, on a scale large enough to be broadly generalizable and statistically powerful. The results should shed new light on several important questions in social psychology, including the role of personality and attitudinal similarity in long-term relationship satisfaction and success, and the balance between positive and authentic self-presentation for relationship formation. This research will also contribute further to our understanding of the effects of computer-mediated communication on interpersonal relationship formation. An understanding of interpersonal compatibility over computer-mediated communication should help improve collaborative processes in many spheres, including students working together in distance education, and facilitate geographically dispersed team formation for businesses, government, and other organizations.","title":"DHB: Large-Scale Analysis of Computer-Mediated Social Relationship","awardID":"0624356","effectiveDate":"2006-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}}],"PIcoPI":[315297,315298,"551795","551795"],"PO":["564456"]}}