{"41915":{"abstract":"This grant supports a workshop to define a new research area called \"computational topology\". The workshop will bring together about 20 research leaders from a variety of fields, such as topology, computational geometry, statistical learning, computer graphics, computer-aided design and manufacturing, and physical simulation. Currently each of these fields has its own approach to shape. It is believed that computational topology can unify these approaches, and help develop principled, robust algorithms for creating, describing, and manipulating shapes.","title":"Workshop on Computational Topology, Miami, FL, June 10-11, 1999","awardID":"9908620","effectiveDate":"1999-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1265","name":"GEOMETRIC ANALYSIS"}}],"PIcoPI":["517727"],"PO":["187585"]},"38283":{"abstract":"9875732 Anurag Acharya<br\/>The goal of this project is to evaluate Active Disk architectures which integrate significant processing power and memory into a disk drive and allow application-specific code to be downloaded and executed on the data that is being read from (written to) disk. This project takes a vertical approach spanning architectures, programming model, operating systems and algorithms. A stream-based programming model is developed for disklets and their interaction with their peers. A restricted execution environment is designed for the execution of disklets. A simulator that contains detailed models for disks, networks and the associated libraries and device drivers and relatively coarse-grain models of processors and I\/O interconnects is developed. Active Disk algorithms are developed for a suite of data-intensive algorithms for relational databases, image processing and satellite data processing. The performance of these algorithms running on Active Disks is compared with that of efficient algorithms running on conventional architectures, such as clusters and SMPs.","title":"CAREER: Architectures And Algorithms for Rapidly Growing Datasets","awardID":"9875732","effectiveDate":"1999-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[97258],"PO":["113883"]},"38680":{"abstract":"Despite the tremendous rise of visual representations in human interaction with computers, most of the underlying computation is still sentential - based on traditional string languages. This goal of this project is to enrich the interactive computational environment through the addition of spatially dense, non-sentential representations. The PI and his students will develop a theoretical basis and use it to explore new forms, behaviors, interactions, algorithms and problems, new interaction paradigms built on those, and the construction of new sorts of applications. The PI's BITPICT paradigm will serve as a vehicle for some of this work, which is expected to have application to a wide variety of domains including interactive image analysis, robot motion planning, interactive weather or physics simulation, new analysis techniques for 2D simulation results, less-crisp representations for early-stage design, and new sorts of games. If successful, the principal broad impact of this work will be the expansion of the range and variety of interactions that humans will have with computers, in work and play settings, which in turn may possibly encourage us to think about new types of problems. More speculatively, the development of the underlying graphical computation theory could enable new sorts of theories of how human spatial processing might work, and also provide a new understanding of fundamental computational aspects of space and spatial representations, as well as limits on spatial abstraction.<br\/>http:\/\/www.si.umich.edu\/ComPix","title":"Enriching Interaction Space with Densely Graphical Computing","awardID":"9877170","effectiveDate":"1999-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["225889"],"PO":["246649"]},"34083":{"abstract":"Advanced applications of Active Networks require support for robust configurable Quality of Service (QoS), and to also prevent or mitigate sophisticated \"denial of service\" attacks on security. A major unsolved problem for active networks is mapping application requirements into a distributed resource multiplexing strategy. Since this problem bedevils the Internet community as well (viz., IP Telephony, RSVP, etc.) a solution would have broad and immediate impact on the networking community beyond Active Networks.<br\/><br\/>The Penn\/Bellcore SwitchWare active networks project uses programming-language restrictions to balance flexibility, security, usability and performance. In contrast to operating system enforced memory protection, the programming language approach can be viewed as restricting the addresses which can be generated by programs. The advantage of this approach is that some restrictions can be enforced once, at compilation time, versus repeatedly at run-time. In addition, programming language technologies such as ML provide strong type-checking, a key to automated checks of program behavior. The SwitchWare project has used the Caml-lite ML dialect to build an active bridge and an ultralightweight Programming Language for Active Networks (PLAN) appropriate for capsules.<br\/><br\/>The Cambridge Nemesis Operating System supports \"soft\" real-time continuous media traffic. To avoid QoS crosstalk, it performs processor multiplexing at a single point, the lowest possible layer in the system, so that even a large portion of interrupt handler execution is performed under scheduler control. Nemesis is an<br\/>operational single-address space operating system, providing protection by means of virtual-address permissions. Protocols on Nemesis are \"vertically-structured\", meaning that applications are responsible for resources involved in their own protocol processing, using either default shared libraries or private<br\/>libraries.<br\/><br\/>Resource Controlled Active Network Elements (RCANE) can be constructed with a synthesis of SwitchWare and Nemesis. This synthesis will entail: (1) extending the QoS management of Nemesis to be managed by<br\/>programming language stubs; (2) supporting Caml-lite under Nemesis; (3) developing Caml support for specifying QoS; and (4) developing robust support for co-scheduling based on multiple resources, e.g.,<br\/>CPU cycles, real memory, network bandwidth. This co-scheduling is particularly relevant to Active Networks, where new resources are exposed to users of the network element. RCANE will produce a novel<br\/>active network element able to support QoS for multimedia traffic and limit or resist denial-of-service attacks of many forms, including \"receive-livelock\" and TCP SYN-ACK attacks.<br\/><br\/>The two research groups have broadly similar interests, a tradition of excellence in experimental systems work, and a history of cooperation, personnel exchanges and collaborations. RCANE is a unique opportunity<br\/>to provide secure, controlled virtualization of active network elements. This proposal requests funds for the U.S. (Penn) portion of this collaborative effort; Cambridge is applying for funds from European analogues of the National Science Foundation.","title":"Resource Controlled Active Network Elements (RCANE)","awardID":"9813875","effectiveDate":"1999-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["527253"],"PO":["565090"]},"38153":{"abstract":"Increasing empirical evidence has demonstrated the presence of subexponential, heavy-tailed, long range dependent and self-similar statistical characteristics of traffic streams in modern multimedia networks. Examples of traffic streams with subexponential characteristics range from variable bit rate (VBNS) compressed video to various Web and Internet related applications. Traffic streams with these characteristics differ radically from conventional voice streams. The difference is not only quantitative, but qualitative as well. For example, when observed on a slow time scale voice traffic averages out and shows very little fluctuations while VBNS video traffic exhibits a dynamic statistical behavior on multiple time scales; this is often termed self-similar behavior. Furthermore, large deviations from the typical behavior of a subexponential random sequence occur in a completely different manner than with an exponential (e.g., voice) stream. Understanding these novel and intriguing statistical phenomena is of utmost importance when designing efficient and reliable wired, or wireless, multimedia communication networks.<br\/><br\/>The most common way of increasing the efficiency of communication networks is through the sharing of network resources, e.g., link capacity and buffer space. This process leads to the degradation of quality of service (QoS) that is perceived by individual network users. The design objective is to maximize the efficiency subject to the QoS constraints, e.g., delay distributions and loss probabilities. This design process naturally breaks down into the following three areas: 1) statistical data analysis and traffic modeling; 2) performance analysis and control; 3) construction of numerical and software tools for network design. These three areas of research are inherently interconnected and an effective solution used for any one of them must be based on the advances in the other two areas. Therefore, a comprehensive and integrated research agenda is suggested.<br\/><br\/>The focus of this proposal is on fundamental problems that are important for developing current technologies, e.g., Atm., TCP\/IP-based and wireless data networks, as well as being potentially applicable to future network designs. The scope of the proposed research ranges from probability theory to software engineering. The impact is not only limited to multimedia communication networks, but is also important for understanding the problems in operations research, finance and insurance theory where subexponential models play an important role.<br\/><br\/>In addition to the proposed research, a curriculum that integrates theory with computing is presented. Great scientific advances have often occurred through an interplay of theory and experiment. From this perspective the researcher believes it is essential that engineers are exposed early in their careers<br\/>to theoretical and experimental knowledge in a unified fashion. This enables them to recognize the potential and limitations of both theory and experimentation and use it successfully to their advantage. This approach<br\/>also speeds up the learning process by demonstrating theoretical results on real world problems and teaches students how to abstract the essential information from the experimental observations into ever-lasting design principles.","title":"PECASE: Modeling, Analysis and Control of Subexponential Traffic Streams in Multimedia Networks","awardID":"9875156","effectiveDate":"1999-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["493395"],"PO":["565090"]},"37780":{"abstract":"Metacomputing with the IceT System<br\/><br\/>The focus of this project are novel methodologies for concurrent and distributed computing on heterogeneous networks. The proposed IceT system builds upon prior work in metacomputing technologies and extends this mode of high performance computing to incorporate cooperative resource sharing, process mobility, and agent technologies. IceT facilitates the development of portable software modules and application sub-components that are freely exchangeable among users; these modules may also be used as vehicles for modifying or enhancing virtual machine (VM) characteristics. Such a cooperative metacomputing environment facilitated by IceT will provide the traditional benefits of high performance computing on networked systems while enabling significant new and emerging distributed applications. A core activity of our proposed project will be to investigate issues in dynamic merging and splitting of virtual machines and developing mechanisms to allocate pooled resources in accordance with owners' constraints. <br\/><br\/>The second major portion of the proposed work involves the creation of a computational infrastructure in which processes may be uploaded and soft-installed at remote locations, migrated during execution, or travel as an agent to several parts of the VM. The basis for this model in IceT is the Java language. IceT builds a complete runtime system upon Java facilities to allow movement not only of bytecode, but also natively compiled relocatable object modules, thereby enabling high efficiencies for compute-intensive applications. A major portion of our effort will be devoted to designing and constructing the mobile process infrastructure in IceT, with particular focus on resource management and security issues inherent in merged virtual machines.","title":"MetaComputing with the IceT System","awardID":"9872167","effectiveDate":"1999-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["489599"],"PO":["551992"]},"38242":{"abstract":"This research is focused on active prostheses, which are capable of generating and sustaining knee joint torques. Active porstheses are advantageous over conventional passive prostheses, since the latter cannot generate knee torques in response to the amputee's demands or in opposition to externally applied torques and thus have limited usefulness for activities requiring weight bearing on a partially flexed knee. The project investigates a unique power source - the dynamics of the gait cycle - to provide sufficient energy that can be recovered, stored and used by active prostheses for torque generation. A knee-ankle actuator that can recover energy from the gait cycle and generate knee joint torques for gait and stair climb will be modeled, designed, and built. An extensive experimental study will evaluate its energy recovery and active torque generation capab - ilities. The education component focuses on the development of biomechanical engineering courses, targeted at graduate students and upper level undergraduates, that promote interaction between engineering students and clinical and medical professionals, emphasizing the importance of communication and collaboration for improved treatments and devices. A biomechanics laboratory supporting analytical and experimental research projects will be developed to facilitate research efforts and to provide experimental support to course topics. Other educational objectives include promoting distance learning, and encouraging women and underrepresented minorities to pursue careers in engineering.","title":"CAREER: A Gait Powered, Active Above-Knee Prosthesis: Synthesis and Mechanical Evaluation","awardID":"9875530","effectiveDate":"1999-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[97176],"PO":["234178"]},"38221":{"abstract":"CCR-9875452<br\/>Selesnick<br\/>Polytechnic University<br\/><br\/><br\/>The theory of filtering and transforms is fundamental for the compression, transmission, and analysis of signals from biomedical, geological, or entertainment sources, in audio, image, or video format. Because many natural signals are modeled more accurately by nonlinear models than by linear models, it is especially important to pursue the design, implementation and evaluation of nonlinear transforms. This research<br\/>advances the state-of-the-art multiresolution analysis tools by bringing powerful mathematical tools from algebraic geometry to bear upon the design of systems for linear and nonlinear signal analysis. The use of Groebner bases fundamentally improves one's ability to construct discrete-time systems, even when the corresponding design equations are nonlinear. This research will lead to a deeper understanding of how to successfully apply Groebner bases in practice, and what their limitations are.<br\/><br\/>The investigator will also organize an Internet website, `A Signal Processing Exercise and Lab Bank', devoted to signal processing education. The website will be an evolving collection of innovative exercises, projects and demos contributed by educators and researchers, that illustrate both basic theory and its application to real-world signals, and which can be updated to reflect the progress in signal processing techniques. It will facilitate the integration of signal processing research and education, and will likewise help in modernizing SP curriculums, by giving educators access to a collection of introductory exercises illustrating recent and ongoing research topics. By drawing together existing resources, and by providing a point for the dissemination of future innovative exercises and labs, the website will enhance the NSF's existing investment in signal processing education and research.","title":"CAREER: Systems for Linear and Nonlinear Signal Analysis - Design via Groebner Bases","awardID":"9875452","effectiveDate":"1999-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["451533"],"PO":["564898"]},"38144":{"abstract":"The research component of this project concerns developing and studying database theory and implemen-<br\/>tation techniques for supporting on-line interactive time series analysis. The target application domains are<br\/>those involving a large volume of time series that are kept in a database. An on-line interactive analysis<br\/>system allows users to observe and analyze the time series retrieved by one query and then to use the ob-<br\/>tained knowledge to form the next one. Thus, the system supports an interactive access environment that is<br\/>especially useful when users only have some ' intuitive idea (which may be changing with each time series<br\/>analyzed) about what they are looking for. The key objective of this project is to provide fast response from<br\/>the system, which is obviously crucial to the success of this interactive environment. The basic strategy of<br\/>the proposed work is to provide approximation for time series, and to develop indexing and precomputa-<br\/>tion techniques. The project also contains a prototyping component to build a test bed system. The results<br\/>from this project will lead to a better understanding of, and a number of basic tools for, interactive systems<br\/>supporting time series analysis.<br\/><br\/>The education component of this project concentrates on developing courses dealing with theories and tools necessary for on-line interactive analysis, including those developed in this project. The target students are from information technology as well as computational science areas and the courses are thus interdisciplinary in nature. Science and engineering nowadays rely heavily on the ability to analyze large volumes of data, and the courses developed will directly contribute to these fields by exposing the students to the methods and techniques for interactive analysis, and helping the students to apply these tools to their fields of study. The students will also be involved directly in the research component of this project. In addition to the courses developed, several Ph.D. dissertations are expected.","title":"CAREER: Towards Database Support for On-Line Time Series Analysis","awardID":"9875114","effectiveDate":"1999-05-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["427499"],"PO":["563751"]},"38386":{"abstract":"Object identification -- the task of deciding that two observed objects are in fact one and the same object -- is a fundamental requirement for any intelligent system or situated agent that reasons about individuals. An approach to this problem has been developed in recent years based on a Bayesian framework that determines the probability for an object's expected appearance at subsequent observations, given its current appearance. The theory has been successfully applied to the task of recognizing cars observed by cameras at widely separated sites in a freeway network. This research will build upon and extend theoretical results involving object identification and data association, and will show how to apply these results to real-world problems.<br\/><br\/>This research has three primary thrusts. One aim is to integrate and generalize work from the data association community, which has focused on tracking independently moving objects whose state can be modeled by multivariate Gaussians, with work from the uncertainty in artificial intelligence community, which has produced a variety of compact state representations and associated inference algorithms. The goal is to present a unified framework with broader applicability than current theory. A second aim is to develop improved heuristic algorithms for approximating solutions to intractable problems that arise when the theory is applied to real-world domains. The goal is to develop new algorithms and demonstrate improved performance over existing ones. The third aim is to apply the theory to other real-world tasks, such as maintaining consistency and eliminating duplicate entries in databases. The goal is to illustrate the patterns of reasoning involved in moving from domain-independent theory to domain-specific problems. These research activities form part of a more general effort within the AI community to develop models and algorithms for reasoning in uncertain environments with noisy and imprecise sensors. <br\/><br\/>The PI's education plans will strengthen the computer science program at Middlebury College in particular, and at liberal arts institutions in general, in two ways: through innovative, inter-disciplinary approaches to presenting introductory computer science concepts so as to increase the interest among first and second year college students in this field at a time when many of them might otherwise stop taking courses in mathematics or science; and through early involvement of students in undergraduate research projects. The project's ultimate goal is to provide a model for others to follow in ways to integrate research and education activities at undergraduate liberal arts institutions.","title":"CAREER: Object Identification in Intelligent Systems","awardID":"9876181","effectiveDate":"1999-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[97465],"PO":["491702"]},"38321":{"abstract":"IIS-9875867 <br\/>Taylor, Camillo<br\/>University of Pennsylvania<br\/>$86,316 - 12 mo.<br\/><br\/>CAREER: Object-Level 3D Reconstruction Techniques for Mobile Robots<br\/><br\/><br\/>This is the first year funding of a four-year continuing award. The research component of this CAREER program will focus on the problem of constructing an object level, 3D model of a scene using the image data obtained from one or more video cameras mounted on a mobile robot platform. The ability to construct and maintain accurate, object level models of the environment registered to the image data is a fundamental capability that could be exploited in a variety of ways in a mobile robot application. Toward this end, research will be carried out on three related problems: (1) extending the reconstruction <br\/>techniques to make use of the imagery acquired with an omnidirectional camera system (2) developing effective model tracking algorithms that can be used to update the model of the scene as the robot moves (3) developing algorithms that can automatically determine how a given scene could be modeled in terms of parameterized primitives.<br\/>The education component of this award includes new course curriculum development, undergraduate and graduate research projects, mentoring of minority students and outreach in the K-12 system. Outreach efforts to minority high-school students will include the development of new course curriculum modules which take advantage of students' natural curiosity about robotic systems to reinforce learning of fundamental techniques in mathematics, physics and computer science.","title":"CAREER: Object-Level 3D Reconstruction Techniques for Mobile Robots","awardID":"9875867","effectiveDate":"1999-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["456808"],"PO":["317663"]},"49332":{"abstract":"","title":"NSF Young Investigator: Theoretical Underpinnnings of Formal Analysis of Concurrent Systems","awardID":"9996312","effectiveDate":"1999-05-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["417615"],"PO":["150697"]},"36353":{"abstract":"Abstract<br\/><br\/><br\/>IIS-9820291<br\/>Kevin Knight<br\/>University of Southern California<br\/>$143,499 - 12 mos.<br\/><br\/>Robust, Scalable Language Generation Using Symbolic and Statistical Techniques<br\/><br\/> This is a three-year continuing award. Natural language processing comprises both language analysis (text in) and language generation (text out). While many applications need both capabilities, the bulk of research and development has so far been on the former. As a result, weaknesses in many practical systems (e.g., translation, explanation, dialogue) are traceable to classic problems in natural language generation (NLG). New statistical techniques have made it possible to address classic problems through the extraction of knowledge automatically from online text corpora, but so far these techniques have been applied primarily to language analysis, and not to NLG. For example, word-sense disambiguation (word to concept) has been the object of intense recent study, while lexical selection (concept to word) has languished, relatively speaking. A similar discrepancy exists between sentence parsing (analysis) and sentence structuring (generation). While trainable parsers can now operate on unrestricted text, NLG usually requires perfect inputs and relies on handcrafted, domain-specific knowledge. We believe that statistical methods have the potential to improve NLG technology in the near term, to enable new applications, and to open up new research problems. Our research will emphasize accuracy, scalability, robustness, and evaluation; it will combine hand-built grammar, online lexical resources, and novel \"learning by reading\" approaches for gathering knowledge automatically from online texts.","title":"STATGEN: Robust, Scalable Language Generation Using Symbolic and Statistical Techniques","awardID":"9820291","effectiveDate":"1999-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["404736"],"PO":["565227"]},"38168":{"abstract":"In integrated services wireless networks, geographically distributed heterogeneous applications must share a common wireless channel. To coordinate the sharing of the transmission resources, a multiple access protocol such as time-division multiple access (TDMA) or code-division multiple access (CDMA) is required. To control QoS in an integrated services network, usually both call admission and resource management (scheduling at the packet level) among the admitted calls are needed.<br\/><br\/>At call admission, it must first be determined if there exists a slot allocation (as in the case of TDMA) or power management (as in case of CDMA) policy that can deliver a target QoS to each application in the<br\/>network. To answer this question, the region of achievable QoS (set of performance vectors that can be delivered under any admissible policy) needs to be identified. The region of achievable QoS will depend on the underlying channel conditions and the multiple access technology. Each access technology has its inherent advantages and disadvantages in combating the effects of the wireless channel and in its ease of accommodating variable rate service while delivering diverse QoS requirements. The determination of the region of achievable QoS leads to the development of call admission and scheduling functions.<br\/><br\/>The PI has been conducting research in the area of integrated services over wireless networks for the past five years and now proposes to translate some of his and others prior research into viable technology<br\/>and educational tools through the development of an integrated services wireless network (ISWN) test-bed. The ISWN project is multifaceted in the sense that it contains educational, development, and research components. The project will be implemented in three phases: system design and specification, development of novel approaches to support multi-media traffic and software implementation in an operational system.","title":"CAREER: Achievable QoS and Scheduling Policies for Integrated Services Wireless Networks","awardID":"9875209","effectiveDate":"1999-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["118474"],"PO":["565090"]},"35342":{"abstract":"Before the advent of digital information, attention to information integrity was the charge of a number of institutions - among them research libraries, publishers, and legal authorities. A major challenge in the digital age, and essential to the creation of digital libraries, is the creation of new mechanisms to ensure information integrity and new methods to administer those mechanisms. Information integrity, has three major characteristics:1) reliability, which ensures that information is available where and when people want it.; 2) security, which protects both the privacy rights of users of information and the intellectual property rights of content creators, and 3) preservation, which ensures the longevity of intellectual content for use by future generations. Failure to create these will inevitably threaten the viability of all institutions - government, business, education, and defense - that rely on digital technology for their mission-critical information resources.<br\/><br\/>The Cornell Digital Library Project will investigate and develop working prototypes of a digital library architecture with particular attention to supporting these integrity issues. The architecture will build on the notion of reusable components, which focus on the critical realities and benefits of the networked environment, global distribution, federation of content and services distributed among multiple administrative entities, and extension where- new components and capabilities can be added to the architecture to suit community-specific requirements or in response to new technologies.","title":"DLI-2: Security and Reliability in Component-based Digital Libraries","awardID":"9817416","effectiveDate":"1999-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X438","name":"DARPA-DIGITAL LIBRARY INITIATI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y995","name":"DARPA-DIGIAL LIB INIT PHASE II"}}],"PIcoPI":["541699"],"PO":["564456"]},"35353":{"abstract":"Abstract<br\/><br\/>IIS-9817496<br\/>Carnegie Mellon University<br\/>Howard Wactlar<br\/>$1,000,000 - 12 mos.<br\/><br\/>DLI Phase 2: Informedia-II: Integrated Video Information Extraction and Synthesis for Adaptive Presentation and Summarization from Distributed Libraries<br\/><br\/>The Informedia-II Project continues the pursuit of search and discovery in the video medium. This phase will transform the paradigm for accessing digital video libraries through meaningful, manipulable overviews of video document sets, multimodal queries, and adaptive summarizations of very large amounts of video from heterogeneous distributed sources. Video information collages are the key technology in Informedia-II and will be built by advancing information visualization research to effectively deal<br\/>with multiple video documents. A video information collage is a presentation of text, images, audio, and video derived from multiple video sources in order to summarize, provide context, and communicate aspects of the content for the originating set of sources. The collages to be investigated include chrono-collages emphasizing time, geo-collages emphasizing spatial relationships, and auto-documentaries which preserve<br\/>video's temporal nature. Users will be able to interact with the video collages to generate multimodal queries across time, space, and sources.<br\/><br\/>Together with external partners, the project will also create an accessible, lasting digital video archive of historical, political and scientific relevance. Vast collections of video and audio recordings have captured the events of the last century, yet these remain a largely untapped resource of historical and scientific value.","title":"DLI Phase 2: Informedia-II: Integrated Video Information Extraction and Synthesis for Adaptive Presentation and Summarization from Distributed Libraries","awardID":"9817496","effectiveDate":"1999-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X438","name":"DARPA-DIGITAL LIBRARY INITIATI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y995","name":"DARPA-DIGIAL LIB INIT PHASE II"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}}],"PIcoPI":["371226"],"PO":["433760"]},"38301":{"abstract":"With the increased deployment of high-speed local- and wide-area networks carrying a multitude of information from email to bulk data to voice and video, provisioning adequate quality of service (QoS) to the diverse application base has become an important problem. Current techniques---some stemming from intrinsic limitations---make it difficult to provide differentiated QoS and guarantees without resorting to over-provisioning which renders these services prohibitive.<br\/><br\/>Given the expected use of the Internet as an everyday, casual, yet evermore indispensable component of economic, educational, entertainment, and other societal functions by the population at large, a new architecture is needed to transform the homogeneous clump that constitutes today's best-effort bandwidth into stratified services with graded QoS properties that better matches the diverse QoS needs of a compendium of applications, multimedia or otherwise. Crucial to the success of this venture is that neither the user nor the network be required to engage in complex computations which would thence make the solution outright infeasible or render it equally as expensive as over-provisioning.<br\/><br\/>This proposal describes a QoS provision architecture suited for best-effort environments based on ideas from microeconomics and noncooperative game theory. We construct a noncooperative QoS provision model where users are assumed to be selfish, and packets are routed over switches where---as a function of their enscribed priority---differentiated service is delivered. Quality of service is an induced phenomenon, achieved as a result of interaction between selfish applications mediated by the underlying network<br\/>substrate.<br\/><br\/>The present approach differs from previous works in three significant ways---one, it is one of the most comprehensive noncooperative resource allocation models specifically formulated to model QoS provision, two, the approach describes a specific network architecture suited to many-switch wide area network environments, and three, it addresses both theoretical and practical aspects, with an emphasis on realizability. Not only does the PI study the noncooperative QoS provision modelfrom a game-theoretic<br\/>perspective showing the existence of a rich structure relating Nash equilibria to Pareto and system optima, he also investigate the problem of facilitating adequate services when the model is extended to incorporate<br\/>multi-dimensional QoS vectors with possibly conflicting requirements, the effect of system variance on QoS rendered, the adaptive relocation of network resources to hot spots using programmable general processor sharing switches, and the myriad of distributed control problems arising in many-switch systems.<br\/><br\/>This proposal describes the PI's previous research---both single-switch and many-switch---and outlines a program for future research that emphasizes an integrated approach to theoretical and practical issues with a strong view toward feasible implementations.<br\/><br\/>The dual goal of this proposal is to describe a strategy for developing the networking curriculum and education in the Computer Sciences Department at Purdue University. The main goals are threefold. First, expand and reorganize the existing networking curriculum to impart more structure, depth, and guidance to the student. This is achieved by enhancing the graduate program with two new networking courses, Advanced Topics in Networking (already implemented) and Experimental Networks. In the undergraduate curriculum, a new networking course was recently introduced by the PI with several more in the planning stage. Second, enhance the strength of the graduate research program by incorporating state-of-the-art networking technology into the curriculum (the PI has procured equipment funding for ATM switches which will be incorporated into the fall 98 networking curriculum) and devising a new course in Experimental Networks<br\/>involving active student participation as players in network games where noncooperative and cooperative protocols and their behavioral consequences are studied. Finally, with distance learning fast becoming a reality spurned by the growth in enabling networking technology and continuing education demand, the PI hopes to develop an undergraduate-level networking course that can be effectively taught over the Web. This will be facilitated by the PI's graduate networking course being televised in the fall 1998 semester as part of Purdue's CEE program to off-campus sites who will receive live video\/audio feed and a voice channel for questioning.","title":"Career: Toward a QoS Provision Architecture in Noncooperative Networks: Theory and Implementation.","awardID":"9875789","effectiveDate":"1999-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["409715"],"PO":["565090"]},"39611":{"abstract":"This standard award is for support of a PostDoc to work with the PI on his ongoing research whose objective is to apply advanced techniques from machine learning and information theory to study the problem of protein structure prediction. The techniques to be used include the utilization of intelligent ways of constructing useful composite attributes, and the dynamic reallocation of search effort as better approaches become recognized. Such techniques cannot be used blindly, but must be tailored to the special requirements of scientific discovery. The results of this work should have broad applicability to many aspects of automated and semi-automated scientific discovery, but the specific focus - understanding protein folding - is in itself extremely important to both protein chemists and society, because it will open new opportunities for research and medicine. Also, demonstrating a general technique for computer-aided scientific model design should help scientists in a variety of scientific disciplines, as they record more data than they can meaningfully analyze manually.","title":"Learning to Predict Protein Structure with a Representation Reduction Approach","awardID":"9901617","effectiveDate":"1999-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["550649"],"PO":["564456"]},"38478":{"abstract":"It is increasingly the case that a given Internet interaction could be satisfied by one of a number of Internet hosts. Examples range from short-lived interactions such as a single web page access to any one of multiple equal-content web servers to a long-term peering relationship between two news (NNTP) servers.<br\/><br\/>In any such interaction, all other things being equal, it is advantageous to access the ``nearest'' choice. By near we mean in terms of Internet performance metrics, such as low latency or high bandwidth. Even when all other things are not equal, such as the case where different web servers have different response times, it is still useful to include distance to each candidate host as one of several criteria for making a selection.<br\/><br\/>One approach to obtaining this distance information is for the initiating host to measure it itself, using either unicast (ping, traceroute) or multicast (expanding ring search) tools. While these tools have a wide range of<br\/>uses, their utility is generally limited by their overhead. For instance, the cost of running a single traceroute can exceed the cost of the web page access itself. More important still, a large number of hosts making independent and frequent measurements could have a severe impact on performance overall. Ideally, measurements made by one system (host or router) should be made available, at low cost, to other hosts.<br\/><br\/>A useful general service for the Internet would be one whereby a host could quickly and efficiently learn the distance between any two hosts. To be widely useful, such a service should provide an answer with a delay and overhead less than those of the gains achieved by using the service. A simple protocol for such a service (SONAR) was discussed in the IETF (Internet Engineering Task Force) as early as February 1996, and in April 1997 as a more general service called HOPS (Host Proximity Service). Both of these efforts proposed lightweight client\/server query\/reply protocols along the lines of a DNS (Domain Name System) query\/reply. Both also required that the server be able to produce an answer in a very short time---preferably, though not necessarily, by using information already stored locally.<br\/><br\/>This proposal is concerned with the problem of how servers in such a SONAR\/HOPS service can obtain the distance information needed to answer queries. Specifically, we explore the following questions:<br\/>- Which systems originally produce the distance information, and how is it produced?<br\/>- How does the distance information get from these producing systems to the servers?<br\/>- What form does the distance information take, and how is it used to produce answers for specific pairs of Internet hosts?<br\/><br\/>After discussing basic aspects of the questions outlined above, this proposal presents a general architecture for an underlying service that provides the basic information used by a SONAR\/HOPS service. This underlying service is called IDMaps, for Internet Distance Map Service.<br\/><br\/>This work is being proposed in parallel by the PI, Sugih Jamin, and the co-PI, Lixia Zhang. Sugih Jamin's prior research has been in Internet traffic characterization and measurement-based admission control. Lixia Zhang has been an active participant in research on scalable reliable multicast. The PIs will work closely with Paul Francis of NTT Software Labs and Vern Paxson of LBNL. Paul Francis has been active on research in distributed hierarchy construction algorithms. Vern Paxson is active in Internet performance measurement and is the PI of the NSF-funded National Internet Measurement Infrastructure (NIMI) effort. IDMaps can be built on the NIMI substrate. Letters from Paul Francis and Vern Paxson confirming these<br\/>collaborations are attached to this proposal.","title":"An Architecture for a Global Internet Host Distance Estimation Service","awardID":"9876541","effectiveDate":"1999-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["201028"],"PO":["234222"]},"38413":{"abstract":"The rapidly evolving nature of the mobile application base, mobile service demands and underlying network technologies presents a significant challenge to the mobile computing and communications research community. Existing mobile network architectures exhibit three basic limitations that prevent us from meeting this challenge: (i) the lack of quality of service support for the transport of audio, video and<br\/>real-time data; (ii) the lack of intrinsic architectural flexibility in the adaptation to new mobile user and service provider needs; and (iii) the lack of automation of the process of realization and deployment of<br\/>new and distinct mobile network architectures. In response to these limitations, the PI argues that there is a critical need to propose, investigate and evaluate alternative mobile network architectures to<br\/>those existing today. The proposed research goes far beyond a proposal for yet another experimental mobile network architecture, e.g., mobile IP++. Rather, it calls for new innovative approaches to the way we<br\/>design, develop, deploy, observe and analyze next-generation mobile networking architectures in response to the future needs and requirements of mobile users, service providers and equipment vendors.<br\/><br\/>The goal of this research in \"spawning networks\" is to: (i) establish a methodology and creation environment for spawning and prototyping virtual mobile networks and their architectures; (ii) deploy programmable foundation services, network controllers and open programmable networking interfaces for a distinct set of baseline architectures that will include a new broadband cellular network architecture, next-generation mobile Internet architecture and mobile ad hoc network architecture; (iii) demonstrate the spawning, visualization and management of these baseline virtual mobile networks over the same physical high-speed mobile networking testbed; and (iv) investigate trade-offs in the architectural design space of the spawned architecture through visualization, management and refinement.<br\/><br\/>The realization of spawning networks capable of profiling, spawning, visualizing and managing distinct virtual mobile networking architectures will represent a major shift in the way network architects design, deploy and manage new and novel mobile networking architectures.<br\/><br\/>The PI is also responding to the strong demands from industry and academia for graduate students with mobile networking and distributed systems skills through the introduction of new and innovative initiatives in education. The PI has introduced a graduate-level course in Wireless and Mobile Networking and is teaching another newly created course in Distributed Telecommunications Systems. Each course addresses<br\/>fundamental concepts, through the presentation of state-of-the-art research seminars from some of industry's leading researchers and emphasizes \"hands on\" term projects. The PI is very keen to promote<br\/>interaction between academia and industry. This interaction provides a great learning opportunity benefiting students, faculty and industry alike.","title":"CAREER: Programmable Mobile Networking","awardID":"9876299","effectiveDate":"1999-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["529645"],"PO":["194325"]},"39219":{"abstract":"9900491 Libeskind-Hadas, Ran<br\/>Networks of workstations (NOWs) provide an inexpensive alternative to parallel computers. An important problem in parallel computing is that of efficient support for collective communication operations. The objective of this study is to develop efficient techniques for collective communication in networks of workstations. Specifically, the research comprises three fundamental components. First, efficient communication techniques are investigated in systems with little or no hardware support for collective communication operations. Second, hardware-supported techniques are investigated for collective communication in NOWs. Third, portable and flexible simulation tools are implemented to analyze a variety of communication techniques in networks of workstations under traffic generated by real parallel applications. The design of efficient collective communication operations in NOWs has a direct impact on improving the performance of numerous parallel computing applications.","title":"Efficient Collective Communication in Switch-Based Networks of Workstations","awardID":"9900491","effectiveDate":"1999-05-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["561152"],"PO":["113883"]},"41650":{"abstract":"Abstract<br\/>CTS-9907890<br\/>J. Lumley\/Cornell University<br\/><br\/><br\/>The topical areas to be covered in this workshop: flow fields that are relevant to the environment and to aircraft and the approaches: basic fluid dynamics, applied mathematics and dynamical systems theory, are quite relevant to several of the research program at the National Science Foundation (Fluid Dynamics and Hydraulic, Applied Mathematics, Oceanography and Atmospheric Sciences) as well as other government agencies. The planned workshop is expected to provide both valuable presentations and to engender useful discussions thereof. Their reporting in the planned volume will add to the timely literature in these areas.","title":"A Symposium: Fluid Mechanics and the Environment: Dynamical Approaches, August 23 - 24, 1999, Ithaca, New York","awardID":"9907890","effectiveDate":"1999-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1522","name":"PHYSICAL METEOROLOGY"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}}],"PIcoPI":["157782"],"PO":["135431"]},"41045":{"abstract":"The Computer Graphics and Visualization Education Workshop brings together computer graphics educators to consider the future of computer graphics education. The recommendations will influence many ongoing efforts in curriculum development, including the ACM\/IEEE computer science curriculum 2001 effort. The focus of the workshop is twofold: 1) teaching computer graphics and visualization and 2) using computer graphics and visualization for education in general.<br\/><br\/>The outcomes of the workshop will be 1) a set of recommendations for future computer graphics education; 2) an ongoing collaboration in this area between US and European educators, with particular emphasis on Portugal; 3) evaluation of existing collaborative teaching tools and shared immersive environments and recommendations for future development, and 4) reports from the workshop available for international dissemination on a website.","title":"Portugal Workshop on Computer Graphics and Visualization Education","awardID":"9906124","effectiveDate":"1999-05-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7428","name":"CCLI-ADAPTATION AND IMPLEMENTA"}}],"PIcoPI":["246151","246152","320844"],"PO":["209556"]},"35348":{"abstract":"Abstract<br\/><br\/>IIS-9817473<br\/>Chen , Hsinchun <br\/>University of Arizona<br\/>$166,666 - 12 mos.<br\/><br\/>DLI Phase 2: High-Performance Digital Library Classification Systems: From Information Retrieval to Knowledge Management<br\/><br\/>This is the first year funding of a three year continuing award. The proposed research aims to develop an architecture and the associated techniques needed to automatically generate classification systems from large domain-specific textual collections and to unify them with manually created classification systems to assist in effective digital library retrieval and analysis. Both algorithmic developments and user evaluation in several sample domains will be conducted in this project. Scalable automatic clustering methods including Ward's clustering, multi-dimensional scaling, latent semantic indexing, and self-organizing map will be developed and compared. Most of these algorithms, which are computationally intensive, will be optimized based on the sparsity of common keywords in textual document representations. Using parallel,<br\/>high-performance platforms as a time machine for simulation, we plan to parallellize and benchmark the above clustering algorithms for large-scale collections (on the order of millions of documents) in several domains. Results of these automatic classification systems will be represented using several novel hierarchical display methods.<br\/><br\/>The testbed of research will include three application domains that consist of both large-scale collections and existing classification systems: (1) medicine: CancerLit (700,000 cancer abstracts) and the NLM's UMLS (500,000 medical concepts), (2) geoscience: GeoRef and Petroleum Abstracts (800,000 abstracts) and Georef thesaurus (26,000 geoscience terms), and (3) Web application: a WWW collection (1.5M web pages) and the Yahoo! classification (20,000 categories). Medical subjects, geo scientists, and WWW search engine users will be used in the evaluation plan.","title":"DLI-Phase 2: High-Performance Digital Library Classification Systems: From Information Retrieval to Knowledge Management","awardID":"9817473","effectiveDate":"1999-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["548216",88868],"PO":["433760"]},"44412":{"abstract":"9970831<br\/>O'Leary<br\/><br\/>This Americas Program award will jointly fund, together with the NSF Division of Mathematical Sciences, the attendance of 10 junior faculty and graduate students from the United States to the Householder Symposium XIV on Numerical Algebra to be held June 14-18, 1999 in Whistler, British Columbia. The activity is being organized by the Householder Program Committee, together with the SIAM Activity Group in Linear Algebra. <br\/><br\/>This multi-national symposium is held once every three years to review advances in numerical algebra and to foster new collaborative efforts. The meeting brings together theoreticians, numerical analysts, and application researchers from all over the world. Selection of US junior faculty and students will be made by soliciting applications through electronic bulletin board announcements and advertisements in cognizant journals. <br\/>***","title":"Support of Householder Symposium XIV on Numerical Algebra; Whistler, British Columbia, June 14-18, 1999","awardID":"9970831","effectiveDate":"1999-05-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["450658","279149"],"PO":["531406"]},"36503":{"abstract":"This award provides funds for a Research Experiences for Undergraduates Site on Human Technology Interactions at the University of Oklahoma. This interdisciplinary REU Site will give undergraduates the opportunity to engage in research on human-technical systems. A total of 15 students, 10 funded by NSF and 5 funded by OU will spend eight weeks in the program. A student's time will be divided into three types of activity: individual research, team research, and collective activities. Each student will participate in individual research within an active laboratory. Research assistantships will be available in Cognitive Psychology, Social Psychology, Computer Science, Industrial Engineering, Library and Information Studies, History of Science, Information Systems, and Communication. A distinguishing characteristic of this program is that students will also participate on one of three multidisciplinary research teams composed of undergraduates and supervised by faculty and graduate students. Team projects will fall under the rubric of Community Networks, Computer-supported Cooperative Work, or Human-Computer Interaction. To provide students a sense of community spirit of science, they will also participate in seminar series, workshop series, and special events. Students will be recruited nationally and regionally with an emphasis on students who would otherwise have little opportunity to gain research experience or to develop technical expertise. <br\/><br\/>This award contributes to the Foundation's continuing efforts to attract talented students into careers in science through active undergraduate research experiences.","title":"REU: REU on Human Technology Interactions","awardID":"9820689","effectiveDate":"1999-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}}],"PIcoPI":["170682",91997,"476812"],"PO":["231322"]},"41501":{"abstract":"9907441<br\/>Akasofu<br\/><br\/>The Computer-Assisted Translation of Alaska Native Languages (CATANAL) Project is designed to explore the application of computational linguistics, machine translation, speech recognition and optical character recognition to the translation and preservation of Alaska Native languages. The urgent need to preserve and translate the Alaska Native languages derives from a number of problems in the social and natural sciences, as well as educational, political, and economic problems caused by powerful forces that are shaping events in the Arctic at the turn of the millennium. This project will develop a succinct statement of the most important needs in translation and preservation of the Native Languages and what role computational linguistics can play in addressing these problems. This project will support a workshop involving parties interested in this problem. The workshop is planned for May 19-22, 1999 at the new International Arctic Research Center (IARC) at the University of Alaska Fairbanks (UAF). The workshop has been preceded by organizational and steering committee activities. Following the workshop a report will be produced and disseminated. This project is jointly supported with a number of organizations in the State of Alaska.","title":"Workshop on Computer Assisted Translation of Alaska Native Languages (CATANAL), May 19 - 22, 1999, Fairbanks, Alaska","awardID":"9907441","effectiveDate":"1999-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1401","name":"Division of ARCTIC SCIENCES DIVISION","abbr":"ARC"},"pgm":{"id":"5208","name":"ARCTIC RESEARCH AND EDUCATION"}}],"PIcoPI":["6371","227375"],"PO":["305265"]},"40038":{"abstract":"It is increasingly the case that a given Internet interaction could be satisfied by one of a number of Internet hosts. Examples range from short-lived interactions such as a single web page access to any one of multiple equal-content web servers to a long-term peering relationship between two news (NNTP) servers. <br\/><br\/>In any such interatction, all other things being equal, it is advantageous to access the \"nearest\" choice. By near we mean in>terms of Internet performance metrics, such as low latency or high bandwidth. Even when all other things are not equal, such as the case where different web servers have different response times, it is still useful to include distance to each candidate host as one of several criteria for making a selection.<br\/><br\/>One approach to obtaining this distance information is for the initiating host to measure it itself, using either unicast (ping, traceroute) or multicast (expanding ring search) tools. While these tools have a wide range of<br\/>uses, their utility is generally limited by their overhead. For instance, the cost of running a single traceroute can exceed the cost of the web page access itself. More important still, a large number of hosts making independent and frequent measurements could have a severe impact on performance overall. Ideally, measurements made by one system (host or router) should be made available, at low cost, to other hosts.<br\/><br\/>A useful general service for the Internet would be one whereby a host could quickly and efficiently learn the distance between any two hosts. To be widely useful, such a service should provide an answer with a delay and overhead less than those of the gains achieved by using the service. A simple protocol for such a service (SONAR) was discussed in the IETF (Internet Engineering Task Force) as early as February 1996, and in April 1997 as a more general service called HOPS (Host Proximity Service). Both of these efforts proposed lightweight client\/server query\/reply protocols along the lines of a DNS (Domain Name System) query\/reply. Both also required that the server be able to produce an answer in a very short time---preferably, though not necessarily, by using information already stored locally.<br\/><br\/>This proposal is concerned with the problem of how servers in such a SONAR\/HOPS service can obtain the distance information needed to answer queries. Specifically, we explore the following questions:<br\/>- Which systems originally produce the distance information, and how is it produced?<br\/>- How does the distance information get from these producing systems to the servers?<br\/>- What form does the distance information take, and how is it used to produce answers for specific pairs of Internet hosts?<br\/><br\/>After discussing basic aspects of the questions outlined above, this proposal presents a general architecture for an underlying service that provides the basic information used by a SONAR\/HOPS service. This underlying service is called IDMaps, forInternet Distance Map Service.<br\/><br\/>This work is being proposed in parallel by the PI, Sugih Jamin, and the co-PI, Lixia Zhang. Sugih Jamin's prior research has been in Internet traffic characterization and measurement-based admission control. Lixia Zhang has been an active participant in research on scalable reliable multicast. The PIs will work closely with Paul Francis of NTT Software Labs and Vern Paxson of LBNL. Paul Francis has been active on research in distributed hierarchy construction algorithms. Vern Paxson is active in Internet performance measurement and is the PI of the NSF-funded National Internet Measurement Infrastructure (NIMI) effort. IDMaps can be built on the NIMI substrate. Letters from Paul Francis and Vern Paxson confirming these<br\/>collaborations are attached to this proposal.","title":"An Architecture for A Global Internet Host Distance Estimation Service","awardID":"9902925","effectiveDate":"1999-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["543560"],"PO":["250082"]},"41832":{"abstract":"This workshop, sponsored by the National Science Foundation and the National Science Council of Taiwan, is an assessment of the challenges and critical research needs of design and verification in giga-scale (nanometer) technologies. Rapid scaling of technologies enables a very high degree of chip integration. It will soon be feasible to integrate a complex electronic system on onto a chip, including microprocessors, embedded<br\/>memories, programmable logics, and various application specific circuit components. However, there is no proven design methodology and tools to support such giga-scale design and integration. Research questions being addressed are: How to provide sufficient design abstraction which takes into consideration the electrical details in nanometer design?; How to represent and characterize reusable blocks which can be used across the boundaries of technology generations, foundries and design environments?; How to model the interaction of heterogeneous functional blocks for overall simulation and optimization?; How to certify \"known good design\" under functional specification and performance constraints? The workshop report contains a statement of the workshop findings with regard to promising opportunities for innovation, and recommendations regarding the style and kind of research to be conducted. It identifies and suggestions to the community as to how to implement the recommendations.","title":"NSF Workshop on Challenges and Opportunities in Gig-Scale Integration for System-On-A-Chip","awardID":"9908422","effectiveDate":"1999-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["558485"],"PO":["321058"]},"41889":{"abstract":"This award supports international travel for twelve U.S. students and researchers who would not otherwise be able to attend the First AgentLink European Agent Systems Summer School being held in Utrecht, the Netherlands on July 26-30, 1999. AgentLink, Europe's ESPRIT-funded Network of Excellence for agent-based computing, organizes the school (http:\/\/www.agentlink.org). It is a world-class event that will bring together internationally recognized researchers in the area of agents and multi-agent systems to present introductory and advanced courses in the theoretical and practical aspects of agent-based computing. The objective of this award is to encourage and enable two groups of U.S. researchers to attend this event: 1) graduate students of outstanding merit who are interested in research in agent systems but have no current funding to enable such participation; and 2) researchers in other related fields who need encouragement to bring their particular expertise to this field and for them to learn about agent-based computing so that they may apply it to their own fields. This travel grant will cover their travel, hotel, registration fees, and some subsistence. The Europeans are giving similar support to their graduate students, i.e., those at European universities who are registered AgentLink members. This travel grant allows a strong and diverse group of US researchers to attend EASS '99 rather than just a small group of elite researchers. Further, because the summer school is in Europe, it provides a unique opportunity for American researchers to have direct contact with their European colleagues.","title":"U.S. Students' and Researchers' Travel to the First European Agent Systems Summer School (EASSS '99), July 26 - 30, 1999, Utrecht, The Netherlands","awardID":"9908539","effectiveDate":"1999-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["525589"],"PO":["495796"]},"35928":{"abstract":"This project will study the design and implementation of congestion-sensitive pricing schemes for the Internet. Pricing is >viewed as a tool to achieve economic objectives as well as a complementary instrument to existing traffic management techniques to achieve provisioning and congestion control objectives. The work is based upon Internet pricing concepts such as expected capacity and smart markets, and will focus on the differentiated-services framework (a new Internet standard) for its implementation.<br\/><br\/>The schemes designed will be broadly based upon the economic concept of contracting. The central hypothesis in our framework is that a network could, based upon congestion monitoring mechanisms, raise prices and vary contract terms dynamically. The project will investigate a range of mechanisms including soft (short-term) contracts, bidding models for receiver-initiated services, usage-based or flat prices for excess traffic, and congestion-sensitive update of prices. An important objective of the project is to develop schemes that can be readily implemented in the differentiated services architecture, without need for additional standardization.<br\/><br\/>The PIs will collaborate to investigate specific issues arising in their areas of expertise: a) traffic management mechanisms in the Internet, and b) information systems (IS) and economic underpinnings<br\/>of pricing mechanisms. The pricing schemes and demand models derived in this framework will be integrated into detailed packet-level network simulations to study the combined impact of these technical and economic control techniques.","title":"Congestion-Sensitive Pricing for the Internet","awardID":"9819112","effectiveDate":"1999-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":[90401,"342900"],"PO":["292741"]},"41727":{"abstract":"9908084<br\/>Sen, Arunabha<br\/>Arizona State University<br\/><br\/>Special Project: 1999 International Workshop on Discrete Algorithms and Methods for Mobile Computing and Communications<br\/><br\/>This award will support graduate student participation to the Third Annual Workshop on Discrete Methods for Mobile Computing and Communications to be held in conjunction with ACM Mobicom '99 in Seattle, WA on August 20, 1999. The workshop, intended to serve as a forum for open discussion and lively debate, will be devoted to discrete algorithms and methods in the context of mobile and wireless computing and communications, an area that is already having and will have enormous impact in our lifestyle over the next several decades.<br\/><br\/>The workshop, also called DIAL M, encouraging research papers based on work-in-progress, brings together distinguished members of the computer science and engineering community. Since the mobility aspect of the hosts and routers introduces a whole gamut of new research issues, the planned panel discussions and hot topic sessions should highly benefit graduate students.","title":"Special Project: 1999 International Workshop on Discrete Algorithms and Methods for Mobile Computing and Communications","awardID":"9908084","effectiveDate":"1999-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[105639],"PO":["297837"]}}