{"120351":{"abstract":"ABSTRACT<br\/>0632742<br\/>David Kahaner<br\/>Asian Technology Information Program<br\/><br\/>ATIP 3rd Workshop on High Performance Computing in China<br\/>(Solution Approaches to Impediments for High Performance Computing)<br\/><br\/>ATIP requests support for the third ATIP China HPC Workshop. The Workshop will consist of a day-long set of presentations from a delegation of Chinese academic, research laboratory, and industry experts, and will include individual presentations and panels addressing topics that include Government Plans, University Research, Applications, select programs at the Chinese Academy of Sciences, and presentations by both Chinese and international vendors to get their perspectives on the status of computing in China. A key aspect of the proposed Workshop will be the unique opportunity for members of the US research community to interact and have direct discussions with top Chinese scientists who will travel to the US to participate.","title":"ATIP 3rd Workshop on High Performance Computing in China (Solution Approaches to Impediments for High Performance Computing)","awardID":"0632742","effectiveDate":"2007-02-15","expirationDate":"2008-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["496762"],"PO":["565272"]},"134883":{"abstract":"When we reach toward a visual object, there is a precise and continuous flow <br\/>of information from the visual areas to the motor circuits that control arm and <br\/>hand movements. But a moment later, we may be engaged in scratching an ear, with <br\/>the same motor circuits now guided by tactile sensation and uncoupled from <br\/>vision. This research project asks fundamental questions about how neural <br\/>circuits perform such complex switching functions to re-route the flow of <br\/>information during controlled and adaptive behaviors. A critical role in <br\/>functional switching may be played by gain modulation, in which a type of <br\/>\"volume-control\" mechanism at synapses adjusts neural responses. An important <br\/>novel component is a testable hypothesis of a specific biophysical mechanism for <br\/>gain modulation. Mathematical models of neurons and neural populations will be <br\/>constructed based on detailed anatomical and physiological data, and the results <br\/>arising from these models will be compared with experiments involving visual, <br\/>discrimination, and motor tasks. Results of the proposed research will shed <br\/>light on some of the complex features of neural circuitry that allow animals and <br\/>people to control their actions and modify and tune their behaviors to specific <br\/>conditions. <br\/> The scientific goal is to relate these behavioral aspects of neural circuitry <br\/>to the underlying cellular and biophysical mechanisms that generate them, using <br\/>mathematical modeling to bridge the gaps between our knowledge at the cellular <br\/>and behavioral levels. In addition, the proposed research will play a critical <br\/>role integrating mathematics and biology into the education and training of <br\/>undergraduate and graduate students, through classroom work, honors and rotation <br\/>projects, and thesis research. This project is jointly supported between <br\/>Computational Neuroscience (BIO) and Applied Mathematics (MPS).","title":"Mathematical Modeling of Neural Populations","awardID":"0748976","effectiveDate":"2007-02-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7334","name":"MATHEMATICAL BIOLOGY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1162","name":"COMPUTATIONAL NEUROSCIENCE"}}],"PIcoPI":[358354],"PO":[358355]},"122464":{"abstract":"On the surface, analyzing the 2003 blackout in New York City, evaluating transportation systems for bottlenecks and emergency preparedness, and imaging a cell's genetic activity are very different challenges. However, these and many other important problems are all characterized by limited measurements of discrete events, such as a cascading series of system failure events, vehicles passing a small number of checkpoints in a transportation network, or tiny pulses of light emitted by a gene-triggered dye. This research is focused on the development of innovative theoretical and computational tools based on sophisticated statistical analyses for extracting meaningful information from small numbers of indirectly observed discrete events. Several educational programs are tightly coupled with these research pursuits, including the development of novel hands-on student activities focused on deriving information from indirect measurements.<br\/><br\/>These programs are designed to stimulate interest in engineering disciplines through real-world examples and ultimately improve technical literacy. Data-starved inference on high-dimensional point processes encompasses a wide variety of fundamental theoretical challenges coupled with many critical applications, including fluorescence microscopy, network traffic analysis, astrophysics, and spectroscopy. This research comprises the development of a theoretical and methodological framework for analyzing and guiding the design of high-dimensional, data-starved, and complex event-based systems which may be dynamically changing, marked with auxiliary feature vectors, or supported on irregular topologies. The educational aspects of this work are tightly integrated with the research activities and help further advance the understanding of signal processing challenges and tools among both engineers and society at large. In particular, the investigators are designing outreach activities for primary and secondary school students and developing undergraduate- and graduate-level courses on multidimensional and statistical signal processing.","title":"CAREER: Data-Starved Inference on Point Processes","awardID":"0643947","effectiveDate":"2007-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550641"],"PO":["564898"]},"122365":{"abstract":"This CAREER award will support research in algorithms to design motion strategies for robots and other mechanical systems. Applications include mobile-robot control, analysis of protein structure for drug design, and design of more reliable tools for automated manufacturing. <br\/><br\/>There are a number of fundamental open problems. Given a resource to conserve, such as time, energy, precision, or opportunities for sensing, what is the optimal trajectory between two configurations? How should motions be planned for highly-constrained mechanical systems, for which it is difficult to automatically generate feasible configurations? Can mechanical devices be designed so that all motions lead reliably to the goal, in spite of errors in sensing and control?<br\/><br\/>These challenges span several facets of the motion problem, but there is an underlying theme. Constraints due to the requirement for optimality, kinematics of the mechanism, or frictional contact mechanics impose a global structure on the space of possible configurations of the system. Often, the configuration space can be described as a collection of relatively homogeneous regions, separated by sharp boundaries at which the behavior of the system changes. <br\/><br\/>The basic goal is to extract as much information as possible about the structure of the configuration space using whatever analytical techniques are most appropriate, including Pontryagin's Maximum Principle, Morse Theory, and tools from mathematical programming. Once this structure has been determined, the next step is to find ways to represent the space and reason about it automatically. <br\/><br\/>The research program will be complemented by the development of a strong curriculum in robotics and geometric-reasoning algorithms. The award will support a small team of graduate student researchers, the development of a core group of classes to prepare undergraduate and graduate students for robotics research, and a summer robotics camp for K-12 students.","title":"CAREER: Finding and using global structure in state-space planning problems","awardID":"0643476","effectiveDate":"2007-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["517794"],"PO":["491702"]},"122443":{"abstract":"The goal of this project is to help users ask complicated<br\/>questions over unstructured text and get as results a<br\/>concrete answer and not simply pointers to more data, as is<br\/>currently the practice with general search engines. The<br\/>research examines how to execute efficiently complex queries<br\/>over multiple web sources and how to estimate the quality of<br\/>the returned results. The research also examines how to<br\/>execute queries over subjective, sentiment data by examining<br\/>the economic context in which the stated opinions are<br\/>evaluated. The experimental research is strongly linked to<br\/>the educational goals of the project that include, among<br\/>others, modernization of the undergraduate curriculum on<br\/>databases to include the latest trends in database and<br\/>information systems and the introduction of a graduate course on<br\/>the transformative role of search technologies in business and<br\/>society. The results of this project will give the power<br\/>and tools to the users to quickly process the vast amount of<br\/>available data on the web and get back answers (and not more<br\/>documents or data to process). The systems built as<br\/>part of this project, together with the related data sets, will<br\/>be available on the project website (http:\/\/text-centric-db.stern.nyu.edu\/), <br\/>allowing everyone to evaluate complex queries over web data<br\/>and build novel applications on top of the built infrastructure.","title":"CAREER: Towards a Text-Centric Database Management System","awardID":"0643846","effectiveDate":"2007-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[325213],"PO":["469867"]},"122487":{"abstract":"Regardless of advances in technology, a continual challenge to science, math, and engineering (SMET) education for blind students, and for their careers, is the task of examining and interpreting data, typically accomplished with visual graphs by sighted users. While there have been many projects aimed at enhancing SMET education and scientific access for the blind by adding sound in some manner, there has been very little systematic study of how, exactly, to create effective auditory graphs. Without such auditory display tools (in combination with visual graphs), there is little chance for visually impaired individuals to participate in science, especially when collaborative discussions are part of the learning or discovery process. In this project, the PI will conduct a program of research and empirical validation into the most effective ways to design and develop auditory graphs, train users to interpret them, and evaluate their effectiveness and appropriateness alongside visual graphs. The PI's preliminary findings indicate that both sighted and visually impaired students and scientists can make use of the auditory display of quantitative information, so long as the displays are sophisticated and well designed, the listeners are trained, and the designer is aware of any differences that may exist in how the various listeners tend to interpret what they hear. A multimodal display should be even more effective, especially when there are both sighted and blind participants in a classroom or research team. Building on these insights, the PI will first perform fundamental experiments aimed at determining the optimal methods for providing contextual cues to auditory graphs, analogous to the axis or tick marks in a visual graph. Once these auditory graph design guidelines have been determined, open source software will be developed to produce both auditory and visual graphs simultaneously, so that teachers or others working with data need not duplicate their efforts. The PI will then conduct experiments to determine the most effective ways to train listeners to interpret the auditory graphs, since it is crucial to overcome the lack of experience that most students, sighted or blind, have with auditory displays. Online training materials will also be developed in order to ensure that the teachers who are likely to create and utilize these sophisticated auditory graphs have the requisite knowledge and skills. The training methods and materials will be evaluated and validated in an experiment and focus group with teachers who work with sighted and visually impaired students. Finally, the efficacy of the enhanced auditory+visual graphs will be validated by comparing the learning outcomes for students who are taught science concepts with the aid of auditory vs. auditory+visual graphs. All of these studies will involve the participation of teachers and both visually impaired and sighted students. <br\/><br\/>Broader Impact: Well-designed auditory displays should be invaluable for both sighted and visually impaired students. Having multiple formats for the data displays will allow all users to maximize learning, and have a shared basis for collaboration. The ongoing research projects will be tied in to university level classes, so that students can learn by taking part in the research efforts; the results and findings will then be rolled into the materials for subsequent classes in computing, psychology, and assistive technology. Visually impaired participants will be a major constituent in focus groups, experiments, and prototype evaluation; this will encourage them to become involved in future R & D efforts that focus on technologies of use and of interest to them. Project outcomes will be disseminated through the PI's various partner organizations and international research collaborators; web sites will make the software, training, and research materials freely available worldwide.","title":"CAREER: Fundamental Research, Design and Evaluation of Auditory and Multimodal Graphs","awardID":"0644076","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["529975"],"PO":["565227"]},"122498":{"abstract":"Most of the mobile robots nowadays essentially move on the ground without wall-climbing capability. The \"City-Climber\" robots developed at the City College of New York (CCNY) are able to move on virtually any kind of smooth or rough surfaces and can carry a relative large payload. Unlike the conventional ground mobile robots operating in 2D space, and UAVs in 3D space, the City-Climber robots operate in constrained 3D space, i.e., its action space is confined within planar surfaces while the sensing space is 3D, facilitated by the freedom of motion on ground, walls, and ceilings. This attribution provides both opportunities and challenges. One of the benefits is that the City-Climber can take vantage positions on a ceiling or wall to gain better view of the scene. The challenges lie in the fact that most of the existing planning\/control methods for multi-robot systems are no longer valid and it demands new framework to deal with this hard yet previously unexplored research domain involving wall-climbing robots. The PI proposed to develop a general framework and provide a theoretical foundation to deal with planning, control and coordination problems for a group of heterogeneous wall-climbing robots and ground robots operating in the constrained 3D space of urban environments. The issues to be studied in this thrust include: abstraction of world models for complex urban environments; computational efficiency and data structure for the world abstraction and representation; dynamic view planning and motion planning for a multi-robot team in constrained 3D space; a framework integrating the discrete world representation, high level planning and lower level control primitives; case studies of the framework using several exemplar tasks (i.e., self-deployment, surveillance coverage, formation control of multi-robots, and target tracking), and the experimental validation of the proposed methods and algorithms. Being an integral part of the career development plan, the proposed education activities include: integration of research into curriculum, mentored research experience for students, improving the educational pipeline with coherent education and outreach activities, enhancing the robotics extension programs targeted for K-12 education.","title":"CAREER: Advancing Mobile Robots to 3D","awardID":"0644127","effectiveDate":"2007-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["554596"],"PO":["543539"]},"122278":{"abstract":"ABSTRACT<br\/><br\/><br\/>Functional imaging has been one of the most important measurement tools in the study of brain function. While earlier fMRI-based findings were limited to localization of brain regions strongly modulated by the experimental protocol, the images also contain a wealth of information about the spatial nature of the networks involved in perception and cognition. This project aims to construct novel representations of spatial patterns of activation, to develop methods for extracting such representations from fMRI images and to build visualization tools for interpretation of the detected patterns. Computational tools for modeling spatial patterns of activation will significantly increase the utility of fMRI for investigating the brain function and its organization.<br\/><br\/>The present approach is based on the empirical observation that the spatial patterns of activation are inherently hierarchical. Similar to anatomical hierarchies that represent the structure of the brain as a tree of increasingly simple systems, the functional description of the brain should also be of a hierarchical nature. In this work, functional region hierarchies are constructed to represent functional organization of the brain. In addition to enabling robust and accurate models of functional organization, this new representation reduces the gap between the theories of functional organization of the brain and the functional models extracted from fMRI data. Moreover, a hierarchical structure can be naturally interpreted by a human observer, providing an intuitive and meaningful representation that can be easily integrated with neuroanatomy and other available sources of information. <br\/><br\/>The methodology developed in this project will improve our understanding of spatial connectivity patterns implicitly captured by fMRI. The analysis and visualization tools will enable new ways to investigate the function of the brain. The experimental findings in the collaborative studies will directly produce new hypotheses about functional organization of the relevant systems. The tightly integrated educational and outreach components of the project will directly affect a large number of MIT students and other groups outside MIT by exposing them to open problems and research methods in biomedical imaging and analysis.","title":"CAREER: Computational Modeling of Spatial Activation Patterns in fMRI","awardID":"0642971","effectiveDate":"2007-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["401912"],"PO":["564318"]},"126887":{"abstract":"This project provides support for a planning phase to extend and refine the Computing Educator Oral History project. The Computing Educator Oral History project is a multi-year grassroots effort within the computing educator community to create a historical record of computing educators to serve as a source of inspiration and information for the field and to preserve the history of the field's pioneers. This project develops plans for a 3-5 year period which will fully develop both the technical and intellectual components oral history collection as well plans for outreach to a broad user community. <br\/><br\/>Intellectual Merit: This project will preserve the narratives of pioneers in computing education and create a repository for doing thematic studies of their career pathways. It fills a critical need for a well developed, user-accessible collection that focuses both on the history of computing educators and on the underrepresented groups within that population.<br\/><br\/>Broader Impact: The Computing Educator Oral History collection may encourage prospective computing students through providing relevant role model stories. It will allow historians to study pathways of early pioneers in computing education. Project such as this one can play a key role in increasing the population of people entering and staying in computing careers, particularly computing education careers.","title":"Planning Grant: Computing Educators Oral History Project","awardID":"0710536","effectiveDate":"2007-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[336695],"PO":["564181"]},"122554":{"abstract":"PROJECT ABSTRACT<br\/>Hong Hua<br\/>Proposal No. 0644446<br\/><br\/>Many applications, from planetary sciences to medicine, require practitioners to correlate and understand complex datasets through a range of dimensions, scales, resolutions, and temporal dynamics. Such complex nature is referred to as data heterogeneity. Clearly, how we organize, visualize, and correlate these heterogeneous datasets will influence the effectiveness of information interpretation and decision-making, and ultimately reflect on the success of a task.<br\/>Many technical challenges persist in effectively dealing with complex visualization tasks involving large-scale heterogeneous data. To address some of the challenges, the PI aims to develop a heterogeneous display environment integrated with versatile data visualization and user interaction capabilities. The design of the visualization system is guided by a theory where the various aspects of complex controls on 3D visualization and user interaction are viewed as a multidimensional continuum space. The proposed system can potentially facilitate the process of visualizing and correlating large-scale heterogeneous data. Particularly, the PI will evaluate the effectiveness of the proposed technology using scenarios directly related to scientific activities underway by researchers in NASA's Mars Exploration Program. The system will also offer a platform to refine the continuum theory and investigate methods that could improve the effectiveness of complex data visualization and user interaction. <br\/><br\/>The PI further outlines a comprehensive plan for developing interdisciplinary education opportunities tightly integrated with the proposed research agenda for a wide range of learner groups. Examples include training opportunities embedded in research activities for diversified learner groups, curriculum development to address the educational needs for students in interdisciplinary areas of research; and the development of short courses and hands-on projects for summer schools and community outreach events. The PI will also explore the value of 3D visualization techniques in science and engineering education.<br\/><br\/>The success of these plans will set up a solid foundation for the PI to achieve her life-long goals of establishing first-class interdisciplinary research and educational programs.","title":"CAREER: Development of a Heterogeneous Display Environment to Support Complex Data Visualization","awardID":"0644446","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7632","name":"HUMAN-ROBOT INTERACTION"}}],"PIcoPI":["485281"],"PO":["565227"]},"122444":{"abstract":"The goal of this project is to contribute to an understanding of the economic impact of new kinds of online information content, measuring their value and helping educate the next generation of business and technology professionals. An important use of the Internet today is in providing a platform for consumers and firms to disseminate information about themselves as well as about products. Indeed, a large amount of information is being generated as online markets also facilitate the creation of online communities and social networks. Much of that textual content has concrete economic value that is often embedded in it. While there are several kinds of information published in online markets, the project will analyze three important and interrelated categories of information: (i) the economic value of textual feedback that is ubiquitous on the Internet such as in reputation systems in electronic markets, product reviews in online communities, and product descriptions in used good markets and social networks, (ii) the economic value of social information such as geographical locations and other self-descriptive information disclosed by users during interactions in digital markets, and (iii) the economic cost of information consumption such as costs of searching and modifying information as well as the costs of processing textual information incurred by consumers.<br\/><br\/>By measuring the \"economic value of online textual information,\" this research will go beyond analyzing the numeric information that has been done in prior work. By producing novel ways of measuring the value of user generated online content, the research activities will make actionable recommendations to practitioners to improve the design of feedback systems in electronic markets as well as help firms display information efficiently in social shopping networks. This research program can have important implications for the debate on the \"digital divide,\" and underserved communities, because it will offer new insights into how geographical locations affect economic and social behavior. Finally, an explicit understanding of the magnitude of various kinds of costs incurred by users during Internet usage will contribute to policies that lead to greater social and economic benefits for all participants. By drawing on multiple methodologies such as empirical analysis, analytical modeling, statistics, experimental methods and text mining, this project will advance current methodologies for interdisciplinary work. The educational activities will result in a new mentoring program for Undergraduate and Graduate students, a new course development titled \"Electronic Markets and Digital Content\" at Stern's Undergraduate Business program and a new Ph.D. seminar that will introduce new techniques for measuring economic value of online content. Further, the datasets and educational exercises resulting from this project will be made available to the academic community to further disseminate the planned research and teaching advances.","title":"CAREER: Identifying and Measuring the Economic Value of Information on the Internet","awardID":"0643847","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["540654"],"PO":["564456"]},"122488":{"abstract":"TCP friendliness has been proposed and used as a fundamental design principle for traffic control in the best-effort Internet in the last few years. The current notion of TCP friendliness is well suitable for applications that can adapt their rates to network congestion. However, a significant fraction of Internet traffic is multimedia streaming traffic, which inherently has limited rate adaptability. As a result, the current notion of TCP friendliness considerably restricts the design space of traffic control protocols for multimedia streaming.<br\/><br\/>The goal of this project is to develop stochastic TCP-friendliness as a new fundamental design principle for traffic control in the best-effort Internet with the following two major research components: 1) developing a stochastic TCP-friendliness framework to qualitatively measure the statistical impact of a traffic control protocol on TCP performance, and to relatively compare the statistical impacts of two different protocols and 2) designing and evaluating a new class of stochastically TCP-friendly traffic control protocols for multimedia streaming, with the aim to considerably improve both TCP and UDP performance when compared with existing TCP-friendly protocols.<br\/><br\/>Broader Impacts: Stochastic TCP-friendliness as a new fundamental design principle will enable other researchers to develop many other new protocols better tailored to their specific needs. It is an important step on the path to move the Internet from a world dominated by TCP users to a world shared among diverse users. This project also includes a strong education component to attract more undergraduate students, and to engage both undergraduate and graduate students into research.","title":"CAREER: Stochastic TCP Friendliness: Exploring the Design Space of TCP-Friendly Traffic Control in the Best-Effort Internet","awardID":"0644080","effectiveDate":"2007-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["451311"],"PO":["565090"]},"122511":{"abstract":"This CAREER project will develop representations and reasoning algorithms for Distributed Constraint Reasoning (DCR) to support the coordination of autonomous agents operating in real-time, open and large-scale real-world environments. The extension to existing DCR algorithms is the use of intelligent clustering of autonomous agents to reduce the time to find a solution. The research plan will result in a publicly available toolkit of DCR algorithm implementations, a common DCR algorithm evaluation environment, and a library of benchmark DCR models and datasets of real-world applications that will greatly facilitate the design and use of DCR algorithms. <br\/><br\/>The critical need addressed in this research project is for representations, domain modeling techniques, and efficient algorithms for allowing loosely-coupled agents to coordinate effectively through distributed reasoning about interactions between individual agent decisions. The specific issues addressed are: time limitations, and privacy and security. This project investigates how to design algorithms that allow agents to tradeoff solution quality for computation time in domains where time is limited. This project investigates bottom-up clustering as a key technique for approximation for large problems. The key outstanding challenge is how to do the clustering so that the small communities can do problem solving independently without large or unknown effects on overall quality. Privacy and security concerns are ubiquitous when agents are used to represent the interests of humans. This project addresses the issue of privacy and security by developing a language and models for DCOP that will allow users to express policies for information they would like agents to keep private while solving the DCOP. The language will be formal so that algorithm designers can develop DCOP algorithms that can be proven to adhere to these policies, perhaps at the cost of efficiency or solution quality. <br\/><br\/>The project will validate and implement the developed technology in three real-world domains which require coordination at varying time-scales: a) Cognitive radio, which requires coordination on the order of seconds or minutes, b) mission scheduling, which requires coordination on the order of hours or days, and c) digital assistants, which requires coordination on the order of weeks, months or years. Performance measurement and comparison of distributed algorithms is more complicated than for traditional centralized algorithms. To more accurately measure the performance of DCOP algorithm, the project uses a constraint-based metric by counting concurrent constraint checks and the time required in a cycle to deliver all messages sent in the previous cycle.","title":"CAREER: Coordinating Autonomous Agents via Distributed Constraint Reasoning","awardID":"0644192","effectiveDate":"2007-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[325349],"PO":["565227"]},"125569":{"abstract":"This collaborative project, developing and evaluating lifelike, natural computer interfaces as portals to intelligent programs in the context of Decision Support System (DSS), aims at providing a natural interface that supports realistic spoken dialog, non-verbal cues, and the capability of learning to maintain its knowledge current and correct. The research objectives focus around the development of an avatar-based interface with which the DDS user can interact. Communication with the avatar takes place in spoken natural language combined with gesture expressions or by pointing on the screen. The system supports speaker-independent continuous speech input as a spontaneous dialog within the specified DSS domain. A robust backend that can respond intelligently to the questions asked by the DDS user is expected to generate the responses spoken in reply by the avatar with realistic inflection and visual expressions. <br\/><br\/>The work develops, prototypes, and evaluates the desired user interface capabilities by using the model of a program officer to create a realistic avatar that can answer users' questions and respond in a humanly natural manner. The project extends a current sponsored project on information gathered related to a centers program where a program officer serves as subject matter expert. The recently-developed AlexDSS system that answers questions to users about the I\/UCRC program provides the baseline intelligent system behind the avatar. The avatar interfaces are targeted for both general users as well as for experts responsible for updating\/correcting the domain knowledge therein. <br\/><br\/>The work represents a collaborative project between the Intelligent Systems Laboratory (ISL) at UCF and the Electronic Visualization Laboratory (EVL) at UIC. The EVL team focuses on avatar development encompassing Visualization and Interaction with Realistic Avatars and Evaluation of System Naturalness and Usability. The ISL team concentrates on Natural Language Recognition and on Automated Knowledge Update and Refinement.","title":"Collaborative Research: Towards Life-like Computer Interfaces that Learn","awardID":"0703916","effectiveDate":"2007-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}}],"PIcoPI":["557607","495168","558518","474264","558519"],"PO":["557609"]},"122435":{"abstract":"Algorithms for learning to classify data have important applications in almost every area of computer science including data mining, computer vision, compiler design, operating system design, speech recognition, computational biology, computational game theory, computational neuroscience, and traditional algorithm design. A common, simplifying assumption in learning theory is that labeled data can be classified by a halfspace in many dimensions. <br\/>The intellectual merit of this research involves understanding the computational complexity of fundamental halfspace-based learning tasks. The investigators focus on the following three challenges: 1) develop algorithms for learning a halfspace in the presence of noise; 2) efficiently learn intersections of halfspaces; 3) prove hardness results for learning various halfspace-based concept classes. In terms of broader impact, as alluded to above, this research gives new tools for practitioners in a variety of fields including computational biology, economics, and statistics.<br\/><br\/>The research relies heavily on new techniques from approximation theory and harmonic analysis to give provably efficient algorithms for learning halfspaces (also known as linear threshold functions) in malicious noise models with respect to many natural distributions. A recent polynomial-regression algorithm due to the principal investigator and his colleagues for agnostically learning halfspaces generalizes previous work in Fourier-based learning. The investigators study other applications of these techniques to discover new algorithms for learning intersections of halfspaces and, more generally, arbitrary convex sets with respect to natural distributions. In addition, the investigator applies properties of new lattice-based cryptosystems to show the intractability of learning intersections of halfspaces in distribution-free models.","title":"CAREER: The Computational Complexity of Halfspace-Based Learning","awardID":"0643829","effectiveDate":"2007-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["451925"],"PO":["565157"]},"126659":{"abstract":"The proposed research will create environments that go beyond existing Wikis (being primarily focused on hypertext) to permit the integration (not just attachment) of other forms of media ranging from movies and animations, to sharing of datasets, to the creation and utilization of social network information to support community interaction, to conceptual mind-mapping media.<br\/><br\/>The proposed research will<br\/>- examine how current wiki-like environments are limited in supporting the different ways in which creative people might represent and contribute to a body of knowledge and study what other types of objects, context and interfaces (beyond hyperlinked text) would be desirable, usable, and useful;<br\/>- analyze and create specifically the following entities: mind maps, videos, anecdotes\/stories and how these could be designed to allow them to be readily and rapidly developed and extended by participants;<br\/>- explore different (potentially intertwined) \"modes\" interacting with such an environment (including: face-to-face activities, synchronous, and asynchronous activities); and<br\/>- utilize new paradigms (such as the emerging Web 2.0 framework) for developing systems that are open and extensible, permitting the inclusion of new forms of information and representation within the community memory.<br\/><br\/>The proposed research meets specifically the following SGER criteria:<br\/>- having urgency with regard to availability of, or access to unique opportunities - the opportunity to study the creation and support of the CreativeIT research community, as represented by efforts already undertaken to seed an initial Swiki for the workshop held November 1-3, 2006. The opportunity to study this community building effort and supporting it with a new class of wiki represents a unique opportunity.<br\/>- ventures into emerging and transformative research ideas - the emerging efforts to establish a program within NSF linking IT with creative endeavors will catalyze the self application of the programs goals to the development of the program.<br\/>- application of new expertise or new approaches to established research topics - the synergy of a challenging task, the involvement of the emerging research community, and the expertise and experience of the proposing researchers will offer unique perspectives on the creation and evolution of a new generation of web-based tools for community development.<br\/><br\/>Intellectual Merit. The proposed activity will permit the development of grounded theories and effective architectures for the use of new technologies in this field.<br\/><br\/>Broad Impact. The socio-technical environment developed will have the potential for broad impact by supporting creative communities, which are a critical resource for the competitive ability of the US workforce. The effort to create a community around the CreativeIT Initiative within CISE provides an opportunity to study the use of community-building creativity-support tools for a community where support for development and sharing of creative ideas is critical.","title":"SGER: A New Generation Wiki for Supporting a Research Community in Creativity and IT","awardID":"0709304","effectiveDate":"2007-02-15","expirationDate":"2008-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["483372","483373"],"PO":["424970"]},"123602":{"abstract":"The Basic Science Scholars (BASS) Program at the University of Massachusetts Lowell focuses on providing interdisciplinary research experiences for undergraduate students. The BASS program provides students with a rigorous, interdisciplinary, research-based program, which integrates molecular genetics, computer science and engineering. Participating scholars receive academic support and intensive mentoring with the objective of promoting their entry into, and completion of, doctoral programs in science and engineering. BASS Scholars spend two consecutive years (Junior and Senior years) in the program and undertake research projects under the direction of one or more faculty mentors concomitant with their baccalaureate degree courses. The objective is to equip students with the requisite research skills for the successful pursuit of doctoral degrees in STEM disciplines.<br\/><br\/>The research investigates genetics and computer science methodologies, which can used to reconnect individuals to their lost ancestry. The genetics component of the BASS Program focuses on linking African-Americans and Caribbean blacks to their ancestral ethnic groups in Africa via Y-chromosome and mitochondrial DNA analysis. The development of new computer technologies and methodologies that allow the rapid genetic analysis of the human DNA data collected is the focus of engineering and computer science participants.","title":"Basic Science Scholars Program","awardID":"0649235","effectiveDate":"2007-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["557340"],"PO":["523800"]},"122546":{"abstract":"The ability to manage and efficaciously reason with molecular structural information has enormous impact both for bio-chemical research as well as for the discovery of new and more efficacious therapeutics. The advent of technologies like NMR, Crystallography, and Combinatorial Chemistry, allow us today to generate unprecedented amounts of information at the molecular structural level. However, the capacity to generate molecular structural data far exceeds our ability to effectively manage, query, and assimilate it at the state-of-the-art.<br\/><br\/>From a computer science perspective, molecules are complex, multidimensional entities which present critical challenges for effective and efficient design of representation, retrieval, modeling, and interaction techniques. In this context, this research focuses on three challenges: (1) Designing techniques for representation and similarity-based matching of molecules, (2) Development of indexing strategies for molecular query-retrieval, and (3) Designing knowledge environments for discovery of therapeutics. The specific research innovations include design of standard coordinate systems to represent highly complex molecular surfaces, developing efficient information matching and retrieval techniques for comparing molecules, and design of integrated information management of molecular structures and biological properties including the development of user-data interaction techniques and algorithms for context supportive access to meta-knowledge. <br\/><br\/>Broader Impact: Techniques and systems developed as part of this research will be made publicly available and allow fundamental advancements in management, exploration, analysis, and reasoning with molecular information. This has the potential to introduce ground breaking advancements in areas like drug\/therapeutics discovery and thus is critical to the society at large. Furthermore, this research will establish \"Molecular Query-Retrieval and Molecular Informatics\" as an integral part of computer science research in information management, retrieval, analysis, and assimilation. This will allow computer scientists to participate and advance a critical and new interdisciplinary area. Finally, the education and outreach component will (a) develop models to enhance research experience and productivity of students, (b) providing exposure to computer science at the grassroots-level through novel interactions with students and teachers at K-12 levels, and (c) broaden participation by mentoring women and minority students.","title":"CAREER: Designing Systems for Molecular Query-Retrieval and Molecular Informatics","awardID":"0644418","effectiveDate":"2007-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["548759"],"PO":["560586"]},"120787":{"abstract":"Methods to exploit the diversity of propagating waves are crucial to the efficient operation of wireless communication systems. Such diversity occurs along two different dimensions: space and time. Both of them pose fundamental limits on the amount of information that can be carried by electromagnetic radiation. This project attempts to present a unified view of these separate axes, based on the physical notion of space frequency spectrum of the propagating field, and to draw connections between the fields of information theory and electromagnetic theory.<br\/><br\/>More specifically, the project defines the concept of information transmission in a multiple antenna channel from physical principles, and investigates how the amount of information transported over the channel to the receiver depends on both the spatial and the frequency bandwidth of the radiating system composed by the transmitting antennas and the scattering objects present in the environment. The spatial information content is quantified in a similar fashion than its temporal counterpart, by reducing the inverse problem of field reconstruction to a communication problem in space, and determining the relevant communication modes of the channel by rigorously applying the sampling theorem on the field's vector space. This research involves extensions of the concept of information rate from time to space, and is aimed at revealing fundamental dualities and trade-offs between these two dimensions.","title":"Wave diversity in wireless communication","awardID":"0635048","effectiveDate":"2007-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["409707"],"PO":["564898"]},"131688":{"abstract":"The objective of this project is to formulate a framework for a non-layered internetworking architecture in which complex communication tasks are accomplished by combining elemental functional blocks in a configurable manner. The framework consists of (1) building blocks of fine functionality, (2) explicit support for combining elemental blocks to accomplish complex communication tasks, and (3) control elements to facilitate cross-layer interactions. This is a holistic view of network design, allowing applications to work synergistically with the network architecture and physical layers so as to meet the application's needs within resource availability constraints. The architecture is flexible and extensible so as to foster innovation and accommodate change, it supports a unified Internet, it allows for the integration of security and management features at any point in the networking stack, and it is positioned to take advantage of hardware-based performance-enhancing techniques. A significant amount of effort is devoted to fleshing out the details and refining the various elements of the architecture, and to laying the theoretical foundations for facilitating a synergy among the applications, network architecture, and physical layers so as to select the appropriate functional building blocks and tune their behavior for a specific communication task.<br\/><br\/>Broader Impact<br\/><br\/>This project has the potential to open new directions in the design of self-configurable and self-optimizing network architectures. The framework of automatically assembled fine-grain functional building blocks can be the centerpiece of a future Internet architecture which interacts harmoniously with applications and the physical layer to optimize user experience.","title":"Collaborative Research: NeTS-FIND: The SILO Architecture for Services Integration, controL and Optimization for the Future Internet","awardID":"0732330","effectiveDate":"2007-02-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[349727],"PO":["565090"]},"122514":{"abstract":"Steady advances in enabling technologies such as semiconductor circuits, wireless networking, and micro-electro-mechanical systems (MEMS) are making possible the design of complex distributed (networked) embedded systems which are expected to benefit important application areas such as public infrastructure, industrial automation, automotive industry, and consumer electronics. However, the heterogeneous and distributed nature of many such systems requires design teams with a multifaceted set of skills spanning automatic control, communication networks, and hardware\/software computational systems. <br\/>Computer-aided design, a traditionally interdisciplinary research area, is instrumental in making these systems feasible and in enhancing the productivity of the design process. This NSF CAREER research is developing new modeling techniques, optimization algorithms, communication protocols, and interface processes that combined yield a novel design automation flow for distributed embedded-control applications that must depend on networked communication, such as automotive \"X-by-wire systems\" and integrated buildings. The goal is both to simplify the integrated design and validation of these systems and to foster collaboration among engineers with different expertise. Research contributions include new methods for the robust deployment of real-time embedded software and for the synthesis of distributed implementations that meet performance requirements while balancing the usage of communication and computational resources. The companion educational program is founded on the belief that the academic curriculum needs to be updated in order to overcome the historical and artificial boundaries among those disciplines in electrical engineering and computer science that lie at the core of embedded computing.","title":"CAREER: Integrating Control, Computation, and Communication - A Design Automation Flow for Distributed Embedded Systems","awardID":"0644202","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518555"],"PO":["565255"]},"123515":{"abstract":"DIMACS, the Center for Discrete Mathematics and Theoretical Computer<br\/> Science, headquartered at Rutgers University, will run an REU program in<br\/> collaboration with DIMATIA, the Center for Discrete Mathematics,<br\/> Theoretical Informatics, and Applications, based at Charles University<br\/> in Prague, Czech Republic. This program will provide an exciting<br\/> research experience for undergraduates that will help them decide on<br\/> future educational and career paths. 17 students from all across the<br\/> U.S. and from the Czech Republic will be recruited annually. Most of the<br\/> program will take place at DIMACS, but some of the U.S. students will<br\/> spend time at DIMATIA and all participants will get a taste of the<br\/> international scientific enterprise. The program will include a pilot<br\/> academic-industrial co-mentoring program and will collaborate with a<br\/> Department of Homeland Security REU program at DIMACS.<br\/><br\/> Scientific fields to be emphasized include graph theory, computational<br\/> geometry, logic and complexity theory, and combinatorial optimization,<br\/> with applications to DNA topology, biomedical engineering,<br\/> epidemiological modeling, economic applications involving e-commerce,<br\/> information management in massive data sets, etc. Students will be<br\/> exposed to modern industrial research on network analysis, sensor<br\/> location, and internet auctions, as well as to homeland security<br\/> applications of methods of computer science and mathematics. The program<br\/> will have broader impacts through increasing scientific collaborations<br\/> between U.S. and Czech researchers and students and, through<br\/> dissemination of the model, raise the awareness of a large community<br\/> about opportunities for young people in international cooperation and<br\/> collaboration. The program will also include career counseling and<br\/> guidance on how to make presentations and should greatly influence the<br\/> choices about further education and future careers of the students<br\/> involved.","title":"REU Sites: DIMACS\/DIMATIA U.S.\/Czech International REU Program","awardID":"0648985","effectiveDate":"2007-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7335","name":"WORKFORCE IN THE MATHEMAT SCI"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["264120"],"PO":["523800"]},"120843":{"abstract":"In the last decade, decoding of codes from low-density matrices (LDPC codes) using the sum-product algorithm was shown to yield dramatic improvement over classical coding schemes. Unfortunately, the decoding algorithm is not understood well enough to indicate how optimal LDPC codes should be constructed. Code performance can only be verified by computationally intensive simulation. The goal of our work, which will use a combination of theoretical analysis and structured, carefully targeted computer simulation, is <br\/><br\/>The proposed research comprises three complementary innovations, which will lead to a better understanding of the sum-product algorithm and of code design. First, we have developed an algebraic model for the algorithm in which we can study the fixed locus, and the dynamics after several iterations. We have used this model to establish exact results about convergence of the algorithm for small codes and successfully applied heuristics from small examples to understand codes of larger practical sizes. Second, we have improved on a widely used method for constructing LDPC codes in which the parity-check matrix is a block matrix with circulant submatrices. Our method works for very general block matrix structures and provides control over the existence of small cycles in the bipartite graph of the check-matrix. We will pursue a systematic comparison of a variety of codes constructed with this method, as well as comparisons with other methods. Third, we have developed a grid-based software infrastructure for studying the decoding properties of different codes at high signal-to-noise ratios. Using this infrastructure, we will be able to gather statistical<br\/>data about decoding failure at high signal-to-noise ratio. We can examine properties of input vectors that lead to decoding failure and test the relationship between decoding failure and the graphical model of the code.<br\/><br\/>Broader Impact: Successful completion of our research will have a significant impact on error-correction technology, which is playing an increasingly important role in data communication and storage. Commercial applications in the area of cellular and wireless technologies will benefit immediately. Our work will also influence emerging research disciplines in the area of low-power and unreliable communications systems such as sensor networks.<br\/><br\/>The research project will aid the Department of Mathematics and Statistics at San Diego State University in its goal of developing focused areas of applied mathematics research and collaborations with scientists and engineers in a variety of disciplines. Through the project's collaboration, we believe it will also encourage students to pursue doctoral research that combines rigorous mathematics with advanced computer systems techniques.<br\/><br\/>Intellectual Merit: The intellectual merit in this proposal is embodied in three of its features. First, it develops and applies a new approach that focuses on the foundations of belief propagation and the mathematical definition of high-quality LDPC codes. Second, it uses novel nationally distributed large-scale computing capabilities to guide and aid analysis rather than simply to offer empirical evidence of code quality. Finally, it blends expertise in mathematics and high-performance computer systems in a way that will both generate significant results and will motivate students to pursue similar interdisciplinary approaches to research.","title":"Collaborative Research: Improving Low-Density Parity-Check Codes Through Algebraic Analysis of The Sum-Product Algorithm","awardID":"0635382","effectiveDate":"2007-02-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["409512"],"PO":["432103"]},"120678":{"abstract":"The UCLA Henry Samueli School of Engineering and Applied Science proposes a project, called the Frontier Opportunities in Computing for Underrepresented Students (FOCUS), which aims to increase the number of underrepresented minorities interested in, prepared for, and retained to baccalaureate degree completion in computing disciplines. A collateral goal is to prepare students who possess these skills, knowledge and resiliency, to competitively enter and succeed in either the computing workforce or in graduate studies. FOCUS will form partnerships with the regional NSF STEP-UP project, the UCLA Center for Excellence in Engineering and Diversity (CEED), and industries. It will build learning communities around transition and bridging programs to provide an academic and non-academic support system that includes mentor networks, and industry and research internships. FOCUS will offer summer computing immersion experiences and computer programming modules for community college students and UCLA computing undergraduates. FOCUS will conduct Counselor and Faculty Institutes to produce effective and lasting communities of practice and commitment to diversify the computing student population and workforce. The FOCUS project will impact over 400 students in the three years and can serve as a model for other institutions.","title":"UCLA Frontier Opportunities in Computing for Underrepresented Students","awardID":"0634520","effectiveDate":"2007-02-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["504614",320635,"539241","504617",320638],"PO":["561855"]},"122537":{"abstract":"Communication technology is a major driving force for advances in the modern society. The fundamental problem of communication is on one hand a problem of signal detection and estimation, and on the other a problem of efficient information representation and transmission.<br\/>Regarding information theory and estimation theory as two sides of the same coin, this research systematically explores the fundamental relationship between the two theories, and studies their application to the design and optimization of future wired, wireless and optical communication systems.<br\/><br\/>This research is divided into two parts. Part I is inspired by fundamental formulas which relate the mutual information and estimation errors in Gaussian and Poisson channels. The investigators study the operational meaning and generalizations of the formulas; their application to information inequalities; and the general role of estimation in efficient information transmission through time-varying channels. Part II of the research is concerned with communication systems which explore spaces of increasingly high dimensions for efficiency (e.g., in coding, spreading, multiplexing). The research is inspired by heuristic results (via statistical physics) which show that the multiple dimensions of the input signal to a linear system decouple asymptotically. Equipped with rigorous techniques developed for sparse systems, a series of conjectured generalizations of the decoupling result are studied, as well as the self-averaging phenomenon of large systems, which is related to the asymptotic equipartition property in information theory. The program also includes training students in research and broadening the scope of information science curricula at Northwestern.","title":"CAREER: Information Transmission and Optimal Estimation: Fundamentals and Applications","awardID":"0644344","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["523548"],"PO":["564924"]},"131767":{"abstract":"Low-level motion control and high-level decision-making algorithms must be integrated to enable full automation of complex dynamic systems. This project investigates knowledge representation and inference mechanisms for end-to-end plan construction in domains, such as spacecraft flight, where resource consumption is dependent both on computational processes and physical characteristics of each vehicle and its environment. This is an important and difficult problem that has been somewhat neglected by the robotics and AI communities. To address this challenge, the project aims to develop a Task and Motion Planning Architecture (TAMPA) and apply it to two realistic problem domains: ground transport and spacecraft mission design. TAMPA is composed of task and path planners, resource scheduler, and plan executor, bridging the long-standing gap between cognitive (symbolic) strategic-level and physics-based (continuous) tactical-level reasoning algorithms. Single and formation spacecraft missions will be designed in terms of science data quality and quantity, observation costs, and tradeoffs between algorithm complexity and solution optimality.<br\/><br\/>The education component of this award cuts across K-12 and higher education. This project plans to pursue engineering and K-12 curriculum enhancements to encourage computationally-aware students at all levels, working toward a basic understanding analogous to that achieved for math and science. Outreach to K-12 and undergraduate researchers will use hands-on robotic experiments to draw students of all ages into a second century of air and space operations in which autonomy will enable missions previously considered impossible.","title":"CAREER: State-dependent Resource Management for Integrated Task and Motion Plans","awardID":"0732592","effectiveDate":"2007-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["553549"],"PO":["387198"]},"122439":{"abstract":"This project seeks to develop new algorithms for data acquisition that mitigate fundamental limitations in real-world measurement devices. All measurement devices are limited in their speed and timing accuracy. The corresponding primary goal is to develop algorithms to compensate for effects of timing inaccuracy and to extract information effectively from samples taken slowly. This could enable cheaper, smaller and lower-power measurement devices and thus hasten the deployment of large-scale and battery-operated sensing systems. Magnetic resonance imaging (MRI) systems are limited by the homogeneity of the induced magnetic excitation. A second project goal is to optimize excitation sequences for homogeneity without increase in excitation time. This would make ultra high-field MRI more useful clinically and in physiological research, with a significant impact on health care. Key to the technological advances is the careful integration of tools from approximation and compression into data acquisition. The research plan is complemented by the development of a textbook, a graduate course, and materials to be shared online at MIT Open Course Ware and FourierAndWavelets.org.<br\/><br\/>The research has three parts: (a) Algorithms to mitigate jitter in sampled, quantized data will be developed. Since some power consumption is inversely proportional to the variance of jitter, these algorithmic improvements can enable lower power. The project further seeks to determine fundamental scaling laws for the effect of jitter. (b) The project addresses the estimation of signals from a small (sub-Nyquist) number of samples. Preliminary results demonstrate that approximation theory and information theory give quite different perspectives on the efficacy of existing techniques, and new acquisition and reconstruction algorithms will be developed. (c) MRI excitation design is posed as an approximation problem amenable to sparsity-based optimization","title":"CAREER: Acquisition, Approximation, and Compression - An Integrated Study","awardID":"0643836","effectiveDate":"2007-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["508043"],"PO":["564898"]},"127818":{"abstract":"This SGER award supports a study that will contribute to a new Cyber-Physical Systems (CPS) vision being developed in NSF's Computer and Network Systems division. The goal of CPS research is new science and engineering methodologies that integrate the interacting cyber and physical elements of future engineered systems. CPS seeks new design principles and systems technology that can routinely yield high-confidence physical and engineered systems. This study will develop a consolidated statement of research needs and a research agenda for next-generation cyber-intensive physical and engineered systems, based on a series of workshops, discussions, and ongoing community interaction.","title":"SGER: Enabling Cyber-Physical Systems","awardID":"0714576","effectiveDate":"2007-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["461012"],"PO":["561889"]},"120811":{"abstract":"Wireless network design poses several challenges that do not exist in wired networks. The wireless medium suffers from random time variations, the broadcast nature of wireless signals causes interference, the wireless spectrum is limited and mobile terminals have small batteries. These features become especially limiting for applications such as multimedia over wireless and low power sensor networks, where maintaining the end-to-end signal quality given the specific system resources is difficult. <br\/><br\/>This research outlines a cross-layer approach between the application layer and the physical layer to address these problems. The objective is to design joint source and channel coding techniques to minimize the end-to-end source distortion. A general source and channel separation theorem for wireless networks does not exist; optimality of Shannon's separate source and channel code design fails for non-ergodic fading channels or for multiuser communication systems. On the other hand, even when source and channel separation is not optimal, it is desirable to have only a loose coupling between the source and channel coders to simplify the designs. <br\/><br\/>The research addresses joint source and channel coding for the fundamental building blocks of a wireless network, namely single user (point-to-point), multiple access, broadcast and interference channels. The system model is general to encompass different communication scenarios: Correlation among the source signals is allowed, the receivers may have correlated side information, the channel can be time-invariant or fading may be present, links can have multiple degrees of freedom such as multiple antennas or multiple fading blocks. This project investigates the design of optimal joint source and channel coding strategies, and performance improvements when minimal interaction among the source and channel coders is allowed. The goal is to discover scenarios under which separation is optimal, or close to optimal. The information theoretic results will be complemented by analytical and experimental studies for video transmission over wireless channels.","title":"Joint Source and Channel Coding for Wireless Networks","awardID":"0635177","effectiveDate":"2007-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["559524"],"PO":["432103"]},"120845":{"abstract":"In the last decade, decoding of codes from low-density matrices (LDPC codes) using the sum-product algorithm was shown to yield dramatic improvement over classical coding schemes. Unfortunately, the decoding algorithm is not understood well enough to indicate how optimal LDPC codes should be constructed. Code performance can only be verified by computationally intensive simulation. The goal of our work, which will use a combination of theoretical analysis and structured, carefully targeted computer simulation, is <br\/><br\/>The proposed research comprises three complementary innovations, which will lead to a better understanding of the sum-product algorithm and of code design. First, we have developed an algebraic model for the algorithm in which we can study the fixed locus, and the dynamics after several iterations. We have used this model to establish exact results about convergence of the algorithm for small codes and successfully applied heuristics from small examples to understand codes of larger practical sizes. Second, we have improved on a widely used method for constructing LDPC codes in which the parity-check matrix is a block matrix with circulant submatrices. Our method works for very general block matrix structures and provides control over the existence of small cycles in the bipartite graph of the check-matrix. We will pursue a systematic comparison of a variety of codes constructed with this method, as well as comparisons with other methods. Third, we have developed a grid-based software infrastructure for studying the decoding properties of different codes at high signal-to-noise ratios. Using this infrastructure, we will be able to gather statistical<br\/>data about decoding failure at high signal-to-noise ratio. We can examine properties of input vectors that lead to decoding failure and test the relationship between decoding failure and the graphical model of the code.<br\/><br\/>Broader Impact: Successful completion of our research will have a significant impact on error-correction technology, which is playing an increasingly important role in data communication and storage. Commercial applications in the area of cellular and wireless technologies will benefit immediately. Our work will also influence emerging research disciplines in the area of low-power and unreliable communications systems such as sensor networks.<br\/><br\/>The research project will aid the Department of Mathematics and Statistics at San Diego State University in its goal of developing focused areas of applied mathematics research and collaborations with scientists and engineers in a variety of disciplines. Through the project's collaboration, we believe it will also encourage students to pursue doctoral research that combines rigorous mathematics with advanced computer systems techniques.<br\/><br\/>Intellectual Merit: The intellectual merit in this proposal is embodied in three of its features. First, it develops and applies a new approach that focuses on the foundations of belief propagation and the mathematical definition of high-quality LDPC codes. Second, it uses novel nationally distributed large-scale computing capabilities to guide and aid analysis rather than simply to offer empirical evidence of code quality. Finally, it blends expertise in mathematics and high-performance computer systems in a way that will both generate significant results and will motivate students to pursue similar interdisciplinary approaches to research.","title":"Collaborative Research: Low-Density Parity-Check Through Algebraic Analysis of the Sum-Product Algorithm","awardID":"0635389","effectiveDate":"2007-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":[321072],"PO":["432103"]},"122517":{"abstract":"The intent of this research project is to support adaptive and personalized information environments. Central to this vision is the need to improve activity discovery and representation of user behavior. This will necessitate the development of novel machine learning algorithms for building models of that activity. (An extension of the ABL agent language with support for looping prediction suffix trees is proposed.) This approach will be applied to two innovative domains, user interactions with smart appliances and semi-autonomous agents in online gaming environments.","title":"CAREER: Activity Discovery for Programmable & Adaptive Personalized Environments","awardID":"0644206","effectiveDate":"2007-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559402"],"PO":["564456"]},"122507":{"abstract":"CAREER: Scalable Rendering for Visual Realism in Scale-Complex Scenes<br\/>PI: Kavita Bala<br\/><br\/>A fundamental challenge in computer graphics is to create interactive virtual environments that accurately depict the complex natural scenes of the real world. These virtual environments are vital for a wide variety of applications, including e-commerce, education, industrial design and architectural planning, games and movies, safety analysis and virtual training, and cultural heritage. Realistically simulating the visual appearance of the real world is extremely challenging because scenes of interest have complex geometry, material, and lighting interacting across a wide range of physical scales, ranging from millimeter-sized surface bumps to large-scale structure. We call such scenes scale-complex. Current rendering methods are blind to scale, making it infeasible to realistically simulate the complex paths along which light reflects and scatters in such scale-complex scenes. This project develops a novel framework for realistically rendering images of scale-complex scenes. Importantly, the framework supports rich illumination phenomena and rendering effects such as indirect illumination, participating media, subsurface scattering, motion blur, and depth-of-field.<br\/><br\/>For the proposed framework to be scalable, it must perform well even with growing complexity of the scene and of simulated illumination phenomena. This project explores the following new approaches: (a) a unified treatment of all illumination phenomena and rendering effects, (b) novel multiresolution representations coupled with perceptual metrics based on early vision and higher level vision to eliminate computation where it is not visually important, (c) new methods for accurately computing illumination detail as needed, with illumination-driven simplification of geometry and material, and (d) new hybrid CPU\/GPU algorithms for interactive performance.","title":"CAREER: Scalable Rendering for Visual Realism in Scale-Complex Scenes","awardID":"0644175","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["508159"],"PO":["559883"]},"120847":{"abstract":"In the last decade, decoding of codes from low-density matrices (LDPC codes) using the sum-product algorithm was shown to yield dramatic improvement over classical coding schemes. Unfortunately, the decoding algorithm is not understood well enough to indicate how optimal LDPC codes should be constructed. Code performance can only be verified by computationally intensive simulation. The goal of our work, which will use a combination of theoretical analysis and structured, carefully targeted computer simulation, is <br\/><br\/>The proposed research comprises three complementary innovations, which will lead to a better understanding of the sum-product algorithm and of code design. First, we have developed an algebraic model for the algorithm in which we can study the fixed locus, and the dynamics after several iterations. We have used this model to establish exact results about convergence of the algorithm for small codes and successfully applied heuristics from small examples to understand codes of larger practical sizes. Second, we have improved on a widely used method for constructing LDPC codes in which the parity-check matrix is a block matrix with circulant submatrices. Our method works for very general block matrix structures and provides control over the existence of small cycles in the bipartite graph of the check-matrix. We will pursue a systematic comparison of a variety of codes constructed with this method, as well as comparisons with other methods. Third, we have developed a grid-based software infrastructure for studying the decoding properties of different codes at high signal-to-noise ratios. Using this infrastructure, we will be able to gather statistical<br\/>data about decoding failure at high signal-to-noise ratio. We can examine properties of input vectors that lead to decoding failure and test the relationship between decoding failure and the graphical model of the code.<br\/><br\/>Broader Impact: Successful completion of our research will have a significant impact on error-correction technology, which is playing an increasingly important role in data communication and storage. Commercial applications in the area of cellular and wireless technologies will benefit immediately. Our work will also influence emerging research disciplines in the area of low-power and unreliable communications systems such as sensor networks.<br\/><br\/>The research project will aid the Department of Mathematics and Statistics at San Diego State University in its goal of developing focused areas of applied mathematics research and collaborations with scientists and engineers in a variety of disciplines. Through the project's collaboration, we believe it will also encourage students to pursue doctoral research that combines rigorous mathematics with advanced computer systems techniques.<br\/><br\/>Intellectual Merit: The intellectual merit in this proposal is embodied in three of its features. First, it develops and applies a new approach that focuses on the foundations of belief propagation and the mathematical definition of high-quality LDPC codes. Second, it uses novel nationally distributed large-scale computing capabilities to guide and aid analysis rather than simply to offer empirical evidence of code quality. Finally, it blends expertise in mathematics and high-performance computer systems in a way that will both generate significant results and will motivate students to pursue similar interdisciplinary approaches to research.","title":"Collaborative Research:Improving Low-Density Parity-Check Codes Through Algebraic Analysis of the Sum-Product Algorithm","awardID":"0635391","effectiveDate":"2007-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["402357"],"PO":["432103"]},"120806":{"abstract":"Abstract<br\/><br\/>The project contains two main themes that are related in various ways:<br\/>(1) approximation algorithms for counting problems, and (2) computational aspects of statistical physics. Counting problems arise in numerous application areas, including combinatorics, algebra, volume and integration, statistical physics, computational finance and statistical hypothesis testing. In almost all cases they are intractable in exact form; theme (1) of the project is focused on constructing efficient algorithms for these problems that guarantee any desired degree of approximation. Theme (2) of the project aims to better understand deep emerging connections between phase transitions in physical systems on the one hand, and computational complexity or the running time of algorithms on the other. The two themes are united by various algorithmic and mathematical techniques (notably, the Markov chain Monte Carlo paradigm). In addition, there is a focus in the project on the application of ideas from theoretical Computer Science to problems in other sciences.<br\/><br\/>Specific goals of theme (1) include the following: to resolve the status of a number of important counting problems, either by developing efficient approximation algorithms or by proving them hard to approximate; to construct more efficient approximation algorithms for central problems in the field; and to explore novel application areas such as computational finance. Specific topics to be addressed within theme (2) include the mixing time of Glauber dynamics; the behavior of message-passing algorithms such as Belief Propagation; and connections between physical models and random constraint satisfaction problems.","title":"Approximate Counting, Statistical Physics and Computation","awardID":"0635153","effectiveDate":"2007-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["450995"],"PO":["550329"]},"120817":{"abstract":"Intellectual merit. Numerous basic questions related to resource allocation remain open. This project<br\/>addresses some of the central open questions in the area. Is it possible to build a resource allocation<br\/>infrastructure that is both general-purpose and efficient? What are the appropriate primitives from which to construct efficient resource allocation algorithms? Can these primitives be efficiently implemented in a fully distributed manner? Is it possible to coordinate the internet so that, for a fair price, an arbitrary user can easily tap into its vast pool of underutilized resources? The project addresses these questions by drawing<br\/>on established techniques from a wide range of areas of computer science including online algorithms and<br\/>competitive analysis, parallel and distributed computation, and randomized algorithms and probabilistic<br\/>analysis as well as various fields outside of computer science, such as game theory, operations research,<br\/>and economics. With regard to text compression, the proposed algorithmic framework appears likely to yield<br\/>an interesting new tradeoff between running time and compression ratio for this fundamental problem.<br\/>Broader impact. The ever-increasing size and complexity of distributed systems demands a modular<br\/>solution to the resource allocation problem. A general-purpose self-tuning resource allocation infrastructure provides such a module, and also provides the ideal platform for an internet resource exchange. The establishment of such an exchange would enable a broad new class of applications. For example, it would allow an arbitrary program to cheaply acquire vast CPU resources for a brief period of time in order to rapidly perform a computationally intensive, but highly parallelizable, task. Through the exploration of fundamental tradeoffs in resource allocation, theoretical computer science has already played a major role in reshaping the infrastructure of the internet. If the recent past is any guide, progress on the resource allocation questions addressed in this project will have a profound impact on the nature of the internet. In addition, the framework for text compression explored in this project has the potential to boost performance in certain emerging applications, such as internet search, where the ability to efficiently search for a string in the compressed file represents a distinct advantage.","title":"Toward Self-Tuning Algorithms for Distributed Resource Allocation","awardID":"0635203","effectiveDate":"2007-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518067"],"PO":["565251"]},"127373":{"abstract":"The growing diffusion of new media raises questions about people's ability to appropriate new technologies for their empowerment. While information technologies (IT) have become a staple of adolescents' lives, we know very little about general trends in the use of specific types of services. Web sites such as MySpace and Facebook are used by millions of people daily, are constantly the topic of popular debates and have also become the target of legislation. Yet there is very little systematic work that looks at young people's uses of such online services.<br\/><br\/>Through original data collection, the overall project will allow us to (1) develop a baseline understanding of college students' Internet uses, participation and skill and how IT uses are integrated into adolescents' everyday lives; (2) implement and assess a training intervention targeting improved use, participation and skill; and (3) make methodological advancements regarding information integration from diverse data sources based on surveys, observations and mobile computing applications related to people's everyday communication practices, methods that will be generalizable to the study of IT uses by different groups.<br\/><br\/>Intellectual Merit<br\/><br\/>There has been considerable debate about whether information technologies are alleviating or contributing to social inequality. Related research tends to focus on access differences with little emphasis on the disparities among users especially concerning a fully wired population. There is little systematic analysis of adolescents' digital media uses based on a representative large sample. <br\/><br\/>Broader Impacts<br\/><br\/>As the use of digital media diversifies with people relying on multiple devices to keep in contact with their networks and access content, it is essential that we develop ways in which we can collect and integrate data about the diverse nature of user practices. The methods developed in this project will be relevant to more and more types of data collection in the future as research on users catches up with media use trends and integrates user practices into data collection procedures.","title":"SGER: Integrating Diverse Data to Explore Adolescents' Information Technology Uses","awardID":"0712874","effectiveDate":"2007-02-01","expirationDate":"2008-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[337814],"PO":["469867"]},"119377":{"abstract":"Sensor networks are vulnerable to a variety of attacks because of the broadcast nature of wireless communications and the unattended operation in harsh environments. The well-established PKI-based key management schemes such as RSA are unfavorable due to the conflict between the extensive computation and large memory requirements, and the sensor node constraints and networking constraints. Symmetric key cryptography, on the other hand, is attractive and applicable to sensor networks due to its efficiency. Therefore establishing shared keys for communicating parties becomes a central problem for sensor network security research. Within the past few years, researchers proposed a number of probabilistic-based approaches relying on preloading keying information to each sensor for bootstrapping pairwise keys after deployment. However, the nondeterministic nature of all probabilistic-based schemes causes problems such as low scalability in network size and the unavoidable conflict between key-sharing probability and resilience against node capture attacks.<br\/> This project intends to design truly in-situ key establishment schemes for large-scale sensor networks. Our algorithms require no keying information to be preloaded into regular worker sensors. A small number of sensors serve as service providers to facilitate the key establishment among worker sensors. This is a fundamentally different approach. Our preliminary research indicates that with low communication overhead and zero deployment knowledge our in-situ key establishment can achieve high scalability and resolve the conflict faced by probabilistic-based schemes. However, there are challenges that still need to be addressed in the context of in-situ key<br\/>establishment, and we propose novel approaches to address these challenges. We also intend to systematically compare and contrast major existent key establishment schemes, and to study the geometric problems recasted by the sensor network security research. All outcomes will be infused into our KEYING SUITE, a library of keying mechanisms that will be open to the public to facilitate relevant research.","title":"Collaborative Research: KEYING SUITE - A Protocol Library for Key Establishment in Sensor Networks","awardID":"0627233","effectiveDate":"2007-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["450698"],"PO":["564388"]},"122380":{"abstract":"Award Abstract<br\/><br\/>Yan Sun<br\/>University of Rhode Island<br\/>Building Trust in Distributed Networks: Theories, Architecture and Applications<br\/><br\/>When network participants do not know how to trust each other, network operations suffer. Participants that naively trust will be victimized and their resources misused. Mistrustful participants will ignore opportunities and their resources will be wasted through inefficiencies. Current research on the establishment of trust often focuses on narrow models and specific domains. There is a gap between point solutions and a system-wide trust infrastructure. This research will address the major issues in designing such a trust infrastructure. In particular, what are the threat models for a trust infrastructure? How should those threats be mitigated? What is the meaning of trust, its properties, and measurement? Where and how should trusts in applications and across networks be managed? This project has several major components: a formal methodology for trust quantification and establishment, case studies, architectural design, graduate and undergraduate education, and outreach to the community at large. The goal of this research is to improve network performance without sacrificing network security through the right trust infrastructure.","title":"CAREER: Building Trust in Distributed Networks: Theories, Architecture and Applications","awardID":"0643532","effectiveDate":"2007-02-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["491296"],"PO":["565327"]},"119389":{"abstract":"IEEE Information Theory Workshops (ITWs) are held on topics of special research interest<br\/>at irregular intervals. A 2006 ITW will be held at the Chengdu International Exhibition<br\/>and Convention Center, Chengdu, China, October 22 - 26, 2006,<br\/>http:\/\/sist.swjtu.edu.cn\/imc\/itw06\/.<br\/><br\/>This proposal requests support for the travel expenses of junior participants from the U.<br\/>S., such as graduate students, research associates, and new faculty hires. These<br\/>participants will be individuals whose papers have been selected for presentation at the<br\/>workshop, but who lack funds and would not be able to attend without travel support. ITW<br\/>has a strong tradition of junior participation that has helped it to maintain its<br\/>reputation as a leading forum for new ideas. It is proposed that the two U. S.-based<br\/>co-chairs of the symposium, Shu Lin and Daniel Costello, make the awards. The total<br\/>amount requested is $15,000; this is based on 15 awards (averaging $1,000 apiece).","title":"2006 IEEE Information Theory Workshop","awardID":"0627278","effectiveDate":"2007-02-01","expirationDate":"2008-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508186"],"PO":["432103"]},"122480":{"abstract":"This research involves the use of high-dimensional geometry in attacking problems at the forefront of computer science. This includes closing fundamental gaps in our understanding of theoretical issues, as well as solving practical problems that arise from the need to analyze and manipulate massive data sets. Such data sets arise naturally in disparate fields like machine learning, computer vision, and bioinformatics.<br\/>On the foundational side, high-dimensional geometric techniques play a pivotal role in obtaining fast, approximate solutions to classical hard problems which are difficult to solve exactly.<br\/>The investigator will study these connections and the development of new algorithmic techniques to exploit them.<br\/><br\/>More specifically, the PI will seek new algorithms which provide better approximate solutions to a variety of classical problems in areas such as graph partitioning, data clustering, and graph coloring. Many of these approaches are based on semi-definite programming and an important goal of the project is to understand exactly the power that this class of algorithms provides, via both new algorithmic techniques and complexity-theoretic lower bounds. These endeavors will incorporate techniques from high-dimensional geometry and probability, functional analysis, and extremal combinatorics. Another goal concerns coping with the dimensionality of data sets. For this purpose, the goal is to develop both new dimension reduction techniques, as well as algorithms and data structure that are able to operate directly on intrinsic low-dimensional structures inside data whose representation is, a priori, high-dimensional.","title":"CAREER: Geometric Phenomena in Algorithms and Complexity","awardID":"0644037","effectiveDate":"2007-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["517683"],"PO":["565157"]},"119401":{"abstract":"Collaborative Research: KEYING SUITE - A Library of Key Establishment Schemes for Sensor Networks<br\/><br\/> Xiuzhen Cheng, The George Washington University<br\/> Dechang Chen, Uniformed Services University of the Health Sciences<br\/> Ding-Zhu Du: University of Texas as Dallas<br\/><br\/>Abstract:<br\/><br\/>Sensor networks are vulnerable to a variety of attacks because of the broadcast nature of wireless communications and the unattended operation in harsh environments. The well-established PKI-based key management schemes such as RSA are unfavorable due to the conflict between the extensive computation and large memory requirements, and the sensor node constraints and networking constraints. Symmetric key cryptography, on the other hand, is attractive and applicable to sensor networks due to its efficiency. Therefore establishing shared keys for communicating parties becomes a central problem for sensor network security research. Within the past few years, researchers proposed a number of probabilistic-based approaches relying on preloading keying information to each sensor for bootstrapping pairwise keys after deployment. However, the nondeterministic nature of all probabilistic-based schemes causes problems such as low scalability in network size and the unavoidable conflict between key-sharing probability and resilience against node capture attacks.<br\/><br\/>This project intends to design truly in-situ key establishment schemes for large-scale sensor networks. Our algorithms require no keying information to be preloaded into regular worker sensors. A small number of sensors serve as service providers to facilitate the key establishment among worker sensors. This is a fundamentally different approach. Our preliminary research indicates that with low communication overhead and zero deployment knowledge our in-situ key establishment can achieve high scalability and resolve the conflict faced by probabilistic-based schemes. However, there are challenges that still need to be addressed in the context of in-situ key establishment, and we propose novel approaches to address these challenges. We also intend to systematically compare and contrast major existent key establishment schemes, and to study the geometric problems recasted by the sensor network security research. All outcomes will be infused into our KEYING SUITE, a library of keying mechanisms that will be open to the public to facilitate relevant research.","title":"Collaborative Research: KEYING SUITE -- A Library of Key Establishment Schemes for Sensor Networks","awardID":"0627322","effectiveDate":"2007-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["557144","438415"],"PO":["432103"]},"118796":{"abstract":"This project will develop and test psycholinguistic models of the relationship between first language fluency, second language competence and second language fluency. These models will be applied toward the automatic assessment of fluency in a second language. The project involves a unique collaboration between researchers with backgrounds in second-language pedagogy, testing methodology, linguistics, speech and language technology, and psychology, and is organized around a common set of data, namely oral presentations given by university students in third year Mandarin classes. These student performances are videotaped, transcribed and rated by trained raters who rate the students' fluency according to a custom-designed and validated testing procedure. The same students will be recruited at the beginning of the semester to participate in psycholinguistic experiments to measure their first language fluency, and related studies will be conducted during the course of the year. The results from expert rating of second-language fluency will be correlated with the psycholinguistic studies of first-language fluency. In parallel with this, the team will develop algorithms that will automatically assign scores to a student's second-language performance that will correlate with expert judgments. These algorithms will range from low-level signal processing methods to estimate such factors as syllable rate and pause duration, to Dynamic Bayesian Networks that combine information from large number of sources to improve the performance of Automatic Speech Recognition on the data. The results of this work will be both a better understanding of what it means to be fluent in a second language, as well as robust methods that will allow for objective automatic assessment of fluency.","title":"DHB: An Interdisciplinary Study of the Dynamics of Second Language Fluency","awardID":"0623805","effectiveDate":"2007-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["491938","389587",314872,"426305","467639"],"PO":["565227"]},"122272":{"abstract":"CAREER: A New Look at the Fundamental Limits of Lossy Network Compression<br\/><br\/>Lossy compression plays a key role in our information economy. By far, most of the information that we<br\/>generate as a society represents pictures, sounds, and videos, and for this kind of data, lossy compression <br\/>yields a tremendous reduction in transmission and storage requirements. The aim of this project is to <br\/>understand the fundamental limits of lossy compression,especially in the context of networks, which dominate today's communication infrastructure. Previous work on this problem has not led to a fundamental understanding of lossy network compression nor has it had a significant impact on the design of practical systems. <br\/><br\/>This research overcomes the limitations of prior work using two novel approaches. First, the highly general models of the past are eschewed in favor of canonical, concrete problems that are simultaneously more tractable and more relevant to applications. Building on recent results of the PI, the work develops a comprehensive and conclusive understanding of the fundamental limits of lossy network compression for Gaussian sources under quadratic distortion constraints and discrete sources under erasure distortion <br\/>constraints. Second, these fundamental limits are studied under more realistic scenarios in which the source, the network, and the allowable distortion all change in unpredictable ways. To help students learn how to create probabilistic and information-theoretic models that are tractable yet also applicable to real systems, existing courses at both the graduate and undergraduate level are being remade to include greater emphasis on modeling. The project also includes significant outreach, involving an interactive tutorial on compression delivered to women and underrepresented-minority engineering undergraduates and rural high-school students.","title":"CAREER: A New Look at the Fundamental Limits of Lossy Network Compression","awardID":"0642925","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["518371"],"PO":["564924"]},"125572":{"abstract":"This collaborative project, developing and evaluating lifelike, natural computer interfaces as portals to intelligent programs in the context of Decision Support System (DSS), aims at providing a natural interface that supports realistic spoken dialog, non-verbal cues, and the capability of learning to maintain its knowledge current and correct. The research objectives focus around the development of an avatar-based interface with which the DDS user can interact. Communication with the avatar takes place in spoken natural language combined with gesture expressions or by pointing on the screen. The system supports speaker-independent continuous speech input as a spontaneous dialog within the specified DSS domain. A robust backend that can respond intelligently to the questions asked by the DDS user is expected to generate the responses spoken in reply by the avatar with realistic inflection and visual expressions.<br\/><br\/>The work develops, prototypes, and evaluates the desired user interface capabilities by using the model of a program officer to create a realistic avatar that can answer users' questions and respond in a humanly natural manner. The project extends a current sponsored project on information gathered related to a centers program where a program officer serves as subject matter expert. The recently-developed AlexDSS system that answers questions to users about the I\/UCRC program provides the baseline intelligent system behind the avatar. The avatar interfaces are targeted for both general users as well as for experts responsible for updating\/correcting the domain knowledge therein.<br\/><br\/>The work represents a collaborative project between the Intelligent Systems Laboratory (ISL) at UCF and the Electronic Visualization Laboratory (EVL) at UIC. The EVL team focuses on avatar development encompassing Visualization and Interaction with Realistic Avatars and Evaluation of System Naturalness and Usability. The ISL team concentrates on Natural Language Recognition and on Automated Knowledge Update and Refinement.","title":"Collaborative Research: Towards Life-like Computer Interfaces that Learn","awardID":"0703927","effectiveDate":"2007-02-15","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":["496768","496769"],"PO":["557609"]},"122493":{"abstract":"The increasing complexity, scale, and dynamics of networked computing systems make it hard for users and system administrators to understand and control these systems. A significant fraction of time and money is spent tackling unexpected system performance problems or tuning large systems with many components, the performance of which depends on thousands of dependencies and parameters. This problem is tackled by the Ques project using innovative data management techniques. Ques treats a computing system as a rich source of data about system configuration and activity, available typically as continuous, rapid, and time-varying data streams. System administrators are given the ability to pose a broad range of system management queries over this data. Ques addresses challenges in developing simple and intuitive ways to express these queries, processing the queries automatically and efficiently using query execution plans, and controlling systems based on statistical and performance models learned from system data. A fully functional prototype of Ques is developed and deployed in a real world setting. The ideas from Ques are incorporated into two new courses for graduate and undergraduate students at Duke. Automated plan generation algorithms for complex system management queries will have a major impact towards making systems more manageable by human administrators. The source code of Ques will be released publicly and the technology will be migrated potentially to industrial strength system management products. Results from Ques will be disseminated via the project Web site (http:\/\/www.cs.duke.edu\/~shivnath\/ques.html).","title":"CAREER: Querying and Controlling Systems","awardID":"0644106","effectiveDate":"2007-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["550820"],"PO":["565136"]},"123351":{"abstract":"Title: REU Site: Research Experiences For Undergraduates in Virtual Reality, Robotics and Visualization<br\/><br\/><br\/>PI: Sharon Stansfield<br\/>institution: Ithaca College<br\/><br\/>The goal of this program is to encourage students enrolled at non-research universities and primarily undergraduate institutions to pursue graduate study and research careers in Computer Science. The eight week summer program provides an opportunity for students to work on research projects that give them the \"real world\" experience of working in collaboration with their own research team (led by a faculty mentor,) as well as with researchers from other disciplines. The research projects include developing virtual reality software for education, therapy, and basic research into human motor control; exploring robotics as an assistive technology to aid the disabled and elderly; and analysis and visualization of three-dimensional fractal trees, with an eye toward their use as a modeling tool within disciplines such as biology, economics, medicine.<br\/><br\/>In addition to working on the research project itself, students in the program participate in a number of other activities aimed at providing information and experiences that will be helpful in their pursuit of technical careers. These activities include presenting an oral proposal for their project toward the middle of the program and disseminating results through a final poster session to which members of the academic community are invited. Participants are also encouraged to present their work at other venues after the program ends. Other activities include presentations on choosing and applying to graduate school, research methods, and using library research databases. Research-oriented presentations and demonstrations by faculty and others are also scheduled. <br\/><br\/>The program will encourage a diverse group of undergraduates to consider attending graduate school and embarking on research careers. This addresses the important national need of attracting a diverse group of students to research-oriented science careers.","title":"REU Sites: Research Experiences For Undergraduates in Virtual Reality, Robotics and Visualization","awardID":"0648211","effectiveDate":"2007-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[327312],"PO":["433760"]},"122295":{"abstract":"Future unmanned vehicle (UV) systems will be deployed for homeland security missions including Chemical, Biological, Nuclear, Radiological, and Explosive (CBRNE) event response. UV systems that incorporate large numbers of ground and aerial UVs [67] (large, mixed-type UV systems) are envisioned. This project will develop visualization techniques that provide a scalable interface incorporating integrated and easily understood information, thus permitting supervision of large, mixed-type UV systems. This project includes three Human-Robotic Interaction (HRI) challenge areas: the development of a data abstraction framework; the development of scalable interface visualization techniques; and the development of visualization transition techniques. During the first four years, the PI will develop and evaluate data abstractions, visualization, and transition techniques. The fifth year focuses on CBRNE field evaluations. A new module for the PI's Complex Human-Machine Interaction course and a new Introduction to Robotics course will be developed. Each summer an undergraduate student and a high school teacher will join the research team. The intellectual merits of this project include: formulation of a data abstraction framework for providing scalable, integrated visualizations; creation and evaluation of visualization and visualization transition techniques; and validation of all hypotheses via quantitative and qualitative usability evaluations with simulated and real UVs.<br\/>Broader impacts: The development of visualization techniques for large, mixed-type UV systems that allow emergency responders to quickly assess a situation while reducing exposure to contaminants. The development of HRI techniques that will impact UV system development for homeland security that increase personnel capabilities, reduce exposure to dangerous situations, and cover difficult terrain. The development of visualizations may influence interface design for complex system domains such as air traffic control and nuclear process monitoring. The inclusion of high school teachers in summer research projects encourages inclusion of research examples in their courses and may result in increasing student interest in engineering.","title":"CAREER: Human interaction with large numbers of unmanned vehicles","awardID":"0643100","effectiveDate":"2007-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7632","name":"HUMAN-ROBOT INTERACTION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["379282"],"PO":["565227"]},"122495":{"abstract":"Title: CAREER: Cornflower Project<br\/><br\/>PI: Meinolf Sellmann<br\/>Institution: Brown University<br\/><br\/>The dawn of the new century casts light on three dramatic economic challenges that will determine our future as a society: demography, globalization, and shortage of natural resources. Today we need to develop the technology that will allow our children to maintain our standard of living. Therefore, we need to find ways to increase our economical efficiency. Computer science can play a decisive role when facing this challenge. After more than 60 years of research, algorithmic computer science can offer a lot to help saving. However, the main impact of computational optimization support is currently limited to large companies in few core application areas such as the transportation industry. Specialized algorithmic solutions have shown to be extremely successful in these domains. While the algorithmic technologies that were developed are by no means specific to the current areas of application, the main obstacle for a broader realization of their vast potential is largely due to the lacking ease of use. Therefore, the main goal of the Cornflower Project is to develop techniques that allow inexperienced users to exploit optimization power efficiently.<br\/><br\/>Intellectual Merits: Optimization techniques have been developed in three historically separate research areas:<br\/>constraint programming, operations research, and algorithm theory.<br\/>While the main<br\/>focus of the project is to provide a high level of automization and algorithms that can be hooked to intuitive modeling primitives that facilitate the use of intelligent optimization support, we do not stop at the boundaries of traditional research areas. Instead, we integrate and hybridize ideas developed in different communities in order to provide easily accessible high performance optimization technology.<br\/>Particularly, we focus on the development of high-level constraints that allow users to model their problems as conjunctions of intuitive substructures and provide hybrid methods for their efficient combination.<br\/>Moreover, we develop automization techniques for the handling of symmetries that can be the cause of severe inefficiencies when handled poorly.<br\/><br\/>Broader Impact: The main goal of the Cornflower project is to solve the algorithmic problems that arise in the context of optimization driven decision support systems that are intuitive to use and that provide a high level of automization. By making algorithms and methods publicly available in the Cornflower Library, the project contributes to widening the access to computational decision support.<br\/>Our goal to broaden the accessibility of computational decision support while breaking the barriers between theoretical and practical computer science goes hand in hand with the educational goals of the project.<br\/>Optimization techniques play an ever more important role for many other CS disciplines.<br\/>By developing optimization courses that integrate methods from various research areas, Cornflower helps to educate the next generation of experts in combinatorial algorithms, while students moving on to other disciplines take away a sound understanding how to tackle combinatorial problems and how to utilize standard solvers for their own purposes.<br\/>Attracting both students who are mainly interested in technical methodology as well as those who are primarily attracted to specific applications is also a promising approach to broadening participation in science at large.<br\/>Through the outreach program<br\/>Artemis, a five-week summer program for high-school girls, young are encouraged women to pursue careers in science and engineering.","title":"CAREER: Cornflower Project","awardID":"0644113","effectiveDate":"2007-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[325317],"PO":["460643"]},"122033":{"abstract":"Geometric representations of the physical world and of abstract information permeate science and engineering. Algorithms on geometric objects are central in mathematical programming, computer graphics, robotics, data mining, information retrieval, computational structural biology, scientific computing, and machine learning. This research spans the current agenda in geometric algorithm design and addresses fundamental problems whose resolution can impact the aforementioned fields.<br\/><br\/>The research pursues four key themes: The design of novel algorithms for linear programming and related polytope-theoretic problems in computer science, a systematic application of smoothed analysis to popular geometric heuristics, the design of polynomial time approximation schemes for NP-hard geometric problems, and a resolution of the remaining issues in the theory of arrangements.<br\/><br\/>Broader impacts: The investigator attracts students from underrepresented groups into computer science and sponsors research opportunities for undergraduate students from underrepresented minorities. Teaching and research are tightly integrated through the development of new introductory and graduate courses.","title":"CAREER: Fundamental Geometric Algorithms","awardID":"0641402","effectiveDate":"2007-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["451500"],"PO":["565157"]}}