{"210980":{"abstract":"Today the Internet constitutes a critical infrastructure: an attack or disruption has the potential to cause serious damage to institutions supporting key resources, such as water, power, transportation, finance, emergency response, business operations and manufacturing supply chains. Consequently, there is interest in a myriad of interdisciplinary approaches to achieve increased security.<br\/><br\/>The PI proposes to conduct a 2.5-day workshop for 20-30 invited participants in order to gain a deeper understanding of the challenges and potential solutions for a secure Internet. The workshop brings together experts in network design, cybersecurity, and policy, spanning industry, academia, and the government. The goal of the Ideas Lab is to explore pathways and find solutions for a secure Internet based on interdisciplinary approaches that take into account technology, social sciences, policy and education. The Ideas Lab will be coordinated by a five-member Steering Committee composed of leading experts and the PI. In addition, expert facilitators will be used to create a highly productive workshop that will be tailored to achieve the specific objective of finding solutions for a secure Internet.","title":"Ideas Lab: Interdisciplinary Pathways towards a Secure Internet","awardID":"1418289","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[565195],"PO":["565264"]},"208329":{"abstract":"The Museum of Science in Boston will investigate different museum exhibit design strategies for building computational thinking capacity among diverse middle and high school learners. The goal of this project is to identify how novice learners can be supported to make sense of and interact with computational thinking tools, problem solving strategies, and technical solutions. Exhibits designed in this project will support visitors to engage with the steps of algorithmic problem solving and to evaluate the efficiency and correctness of algorithms. Each of the exhibits involved in this project will undergo initial design and development, including formative prototyping and evaluation to ensure they are easily usable and meet intended educational goals. This traveling museum exhibition has the potential not only to stimulate awareness and practice of computational thinking skills, but also to stimulate capacity, interest, and self-efficacy for computing and computing careers among diverse learners who may not otherwise have exposure to computational thinking.","title":"Building Computational Thinkers through Informal Exhibit Experiences","awardID":"1339244","effectiveDate":"2013-12-01","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["534737",558281,558282,558283],"PO":["560704"]},"205744":{"abstract":"The objective of this project is to conduct a holistic protocol design for large-scale cognitive radio networks. To support a large number of wireless devices as secondary users that able to dynamically access available channels, it is necessary to design decentralized architecture and solutions for cognitive radio networks. Based on the decentralized architecture, this project addresses important problems in spectrum sensing, spectrum allocation and pricing, and spectrum usage monitoring and charging in dynamic spectrum access networks. More specifically, this project focuses on three research thrusts: (1) A robust collaborative spectrum sensing algorithm to tolerate arbitrary false data reports from adversaries, (2) An efficient spectrum allocation and pricing scheme for a large number of secondary users to share spectrum resources based on localized and approximation algorithms, and (3) A scheme for monitoring and charging the spectrum usage of secondary users without sacrificing secondary users' privacy. <br\/><br\/>The proposed architecture and the solutions to the relevant problems have the potential to significantly advance the state-of-the-art of cognitive radio networking research, in particular, in improving the efficiency of spectrum sharing. The technology developed in this project will facilitate a wide variety of scientific and engineering applications and result in a significant impact on the society. The project will perform a wide range of education and outreach activities, including integration of research findings into courses and curricula, and involving under-represented students in research projects. Research results will be broadly disseminated through conference and journal publications, research talks, and via the Internet.","title":"NeTS: Small: Spectrum Sensing, Allocation, and Charging for Cognitive Radio Networks","awardID":"1320453","effectiveDate":"2013-12-01","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["551983"],"PO":["557315"]},"210487":{"abstract":"The Research and Education (R&E) communities of the U.S. and Mexico have a long history of cross-border collaborations. Given the proximity and the breadth of research taking place at R&E institutions in California and Mexico, the opportunity for enhancing network-dependent cross-border science research and education collaborations holds great promise. An important cross-border collaboration involves Mexico's Center for Scientific Research and Higher Education (CICESE) and the University of California San Diego (UCSD).<br\/><br\/>In 2010, the NSF International Research Networks Connections (IRNC) program funded FIU's Americas Lightpaths (AmLight ) proposal, which included upgrading the network connection between Los Angeles, San Diego, and Tijuana to 10Gbps. With support from Mexico's National Council for Science and Technology (CONACYT), Corporación Universitaria para el Desarrollo de Internet (CUDI), and other institutions in Mexico, the 10Gbps network connection was extended from Tijuana to Ensenada to connect CICESE.<br\/><br\/>There are continuing challenges in cross-border science research and education collaborations benefiting from the use of the enhanced network infrastructure between Mexico and California, and the U.S. Researchers, both in the U.S. and Mexico, must be better informed of the network capability the AmLight project has made available, and explore how to leverage the network?s capability to dramatically enhance cross-border research and education activities.<br\/><br\/>In an effort to stimulate growth in cross-border science research and education, FIU and CENIC (stakeholders of the AmLight project), with support from UCSD, CUDI, and CICESE, a Big Data, Big Networks workshop explores how to enhance existing or to form new cross-border networks of collaboration between researchers and students connected by the AmLight West 10G link. The broader impacts of the Big Data, Big Networks workshop are aimed at identifying opportunities to underpin with the AmLight cross-border network infrastructure the current and planned cross-border Big Data projects, and at linking into U.S.-Mexico inter-governmental activities aimed at fostering cross-border science research and education collaborations, such as initiatives fostering innovation and education.","title":"Big Data, Big Networks: Big Opportunities for Collaboration between Mexico and the United States","awardID":"1357928","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":[564023,564024,564025],"PO":["564246"]},"210961":{"abstract":"This is funding to support participation by 2 graduate students from U.S. institutions in a Doctoral Consortium (workshop) that was held in conjunction with the 2013 International Symposium on Mixed and Augmented Reality (ISMAR 2013), which took place October 1-4 in Adelaide, Australia, and which was organized by the IEEE Computer Society with academic sponsorship from the Association for Computing Machinery (ACM). For over a decade, ISMAR (and its forerunner events IWAR\/ISAR and ISMR) has been the premier international conference on research into the science, technology, applications and uses of Mixed Reality (MR) and Augmented Reality (AR). The proliferation of powerful mobile hardware has opened up new avenues of research into MR and AR while enabling corporate and consumer applications on a wide scale. Across this spectrum fascinating new types of user interfaces, technologies, and concepts are beginning to emerge. The field is highly interdisciplinary in nature, bringing together technologists, educators, humanists, artists and social scientists, among others. ISMAR is one of the largest meetings devoted to the advancement of mixed reality, augmented reality, virtual reality, and human-computer interaction with the physical world, and encourages six different submission types: Papers and Posters, Workshops, Panels, Tutorials, Demonstrations and Contests. Because of the diverse fields relevant to mixed and augmented reality, ISMAR content is organized in two tracks: The Science & Technology (S&T) program and The Arts, Media and Humanities (AMH) program. The top papers are often extended, reviewed, and submitted for publication in the prestigious IEEE Transactions on Visualization and Computer Graphics. More information about the conference may be found at http:\/\/ismar.vgtc.org\/. <br\/><br\/>This was the second Doctoral Consortium held in conjunction with an ISMAR symposium. A total of 7 graduate students participated in the workshop, along with senior members of the community (faculty and industry researchers) who served as mentors. The goal was to provide the students with an opportunity at a critical time in their careers to present their work to a group of mentors and peers from a diverse set of academic and industrial institutions, to receive feedback on their doctoral research plan and progress, and to build a cohort of young researchers within the ISMAR community. To these ends participants were asked to prepare both a technical presentation and a poster describing their work. A pre-event social dinner allowed the attendees (students, mentors and organizers) to get to know each other. The following day all attendees met for an informal breakfast at 8:00 AM, after which each student participant had 50 minutes devoted to his\/her research, beginning with a presentation for approximately 30 minutes followed by about 20 minutes reserved for an extensive discussion with the other graduate student participants and the senior researchers. The discussion was facilitated by the Doctoral Consortium co-chairs and mentors, with the goal of addressing the strengths and weaknesses of the research, challenges and issues, implications of the results, potential suggestions for additional approaches or follow-on work, and career guidance related to the student's work and area. The posters were on display during the ISMAR conference poster sessions (in which the students were expected to take part), and were marked as being part of the Doctoral Consortium. All results from the Doctoral Consortium, including the procedures followed, were archived in the ISMAR 2013 DC binder as a reference for next year's conference.<br\/><br\/>Broader Impacts: The organizers took steps proactively to achieve a diversity of research topics, disciplinary backgrounds, methodological approaches, and home institutions among the students, to ensure that they met people outside their own specific area. For example, a maximum of one graduate student per institution was selected. Factors such as gender and ethnicity were also taken into account, with an emphasis on including underrepresented groups. Due in part to the remote location of this year's conference, in the end most of the student participants were from foreign universities; funding for the international students was secured from other sources, with NSF funds being requested only to support the 2 students from U.S. institutions of higher learning.","title":"WORKSHOP: ISMAR 2013 Doctoral Consortium","awardID":"1417007","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565150],"PO":["565227"]},"210785":{"abstract":"This project funds travel support for academic participation in a workshop organized by the Networking and Information Technology Research and Development (NITRD) Subcommittee's Large Scale Networking (LSN) Coordinating Group, and co-sponsored by NSF and DoE, on issues associated with the national deployment of an inter-carrier Software Defined Networking (SDN) service. The workshop will be held at NSF on December 17th and 18th, 2013.<br\/><br\/>The overarching goal of the workshop is to explore the steps to an operational prototype SDN network and to identify the required longer term research. Specific goals also include:<br\/><br\/>1. Identifying current capabilities and resources that contribute to development and operation of an SDN prototype network that interoperates seamlessly with the current public Internet<br\/>2. Identifying research, resource, and collaboration needs in creating such a system<br\/>3. Identifying gaps in operational software tools necessary for running a production, multidomain SDN network<br\/>4. Identifying opportunities for SDN virtualized networks to interact with 'clouds' of computation and storage<br\/>5. Providing a workshop report to NSF and the other NITRD agencies on needed research and development, resources and collaboration for the prototype system<br\/><br\/>SDN is a key emerging technology and is being used to support a number of national priority programs. Developing a sound basis for inter-carrier SDN will enable the widespread deployment of applications using SDN.","title":"Travel Support for 2013 Software Defined Networking Program Review","awardID":"1404415","effectiveDate":"2013-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[564751],"PO":["564993"]},"210951":{"abstract":"This is funding to provide financial support for 10 graduate students (all from U. S. universities and working towards either their Master's degree or a Doctorate) to attend the 2014 International Conference on Intelligent User Interfaces (IUI 2014), to be held February 24-27 in Haifa, Israel, as participants in a special Student Consortium (workshop), as presenters in the main conference, and as attendees at the conference for general training purposes. Sponsored by ACM, the annual IUI conferences represent the growing interest in next-generation intelligent and interactive user interfaces; they are the premier forum where researchers from academia and industry, who work at the intersection of Human-Computer Interaction (HCI) and Artificial Intelligence (AI), come together to exchange complementary insights and to present and discuss outstanding research and applications whose goal is to make the computerized world a more amenable place. Unlike traditional AI the focus is not so much on making the computer smart all by itself, but rather on making the interaction between computers and people smarter. Unlike traditional HCI, there is a focus on solutions that involve large amounts of knowledge and emerging technologies such as natural language understanding, brain computer interfaces, and gesture recognition. To this end, IUI encourages contributions not only from computer science but also from related fields such as psychology, cognitive science, computer graphics, the arts, etc. IUI 2014 will be the 17th conference in the series; topics of interest this year include: intelligent interactive interfaces, systems, and devices; ubiquitous interfaces; smart environments and tools; human-centered interfaces; mobile interfaces; multimodal interfaces; pen-based interfaces; spoken and natural language interfaces; conversational interfaces; affective and social interfaces; tangible interfaces; collaborative multi-user interfaces; adaptive interfaces; sensor-based interfaces; user modeling and interaction with novel interfaces and devices; interfaces for personalization and recommender systems; interfaces for plan-based systems; interfaces that incorporate knowledge- or agent-based approaches; help interfaces for complex tasks; example- and demonstration-based interfaces; interfaces for intelligent generation and presentation of information; intelligent authoring systems; synthesis of multimodal virtual characters and social robots; interfaces for games and entertainment; for learning-based interactions and for health informatics; empirical studies and evaluations of IUI interfaces; and new approaches to designing intelligent user interfaces. More information about the conference is available online at http:\/\/iuiconf.org\/. <br\/><br\/>The IUI 2014 Student Consortium will build on the success of the previous two such events. The heart of the Consortium will be a full-day workshop on February 24, immediately preceding the conference, and will be structured to give student trainees exposure to their new research community by giving a 20-30 presentation on their work and receiving feedback from peers and a panel of senior researchers. Group lunch and dinner will encourage social interaction among the student cohort and informal personal interaction with the mentors. The students' work will also be featured during the main conference in a poster session, where they will gain additional experience explaining their work to others in the field. The IUI conference organizers will pay for audio-visual services, two coffee breaks, and space for accommodating attendees in the student session; no funds are requested for these items from NSF.<br\/><br\/>Broader Impacts: This funding will enable attendance at the IUI conference by students who might otherwise be unable to do so for financial reasons. It will enhance the educational experience of funded participants, by bringing them into contact with leading researchers in the field and by exposing them to the lively discussion during the course of the conference that often leads to opportunities for career advancement. The quality of the conference itself will be enhanced as well, thanks to a broadening of the base of institutions represented and increased diversity of participants. The rich exchange of ideas at IUI has previously proven to be a valuable source of ideas for future research, as well as leading to collaborative efforts; this funding will extend the opportunities for collaboration and provide intellectual stimulus to programs that have previously sent few or no representatives to this conference. The organizing committee has undertaken to proactively recruit student participants from schools that have not traditionally been well represented in the IUI community. Women, minority students, the disabled, and veterans all will be encouraged to participate. To further assure diversity, no more than one student will be accepted from any given institution.","title":"WORKSHOP: Student Consortium at the 2014 ACM Conference on Intelligent User Interfaces","awardID":"1415879","effectiveDate":"2013-12-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565127],"PO":["565227"]},"211006":{"abstract":"With the advent of Internet, numerous applications in the context of network traffic, search, and databases are faced with very large, inherently high-dimensional, or naturally streaming datasets. To effectively tackle these extremely large-scale practical problems (e.g., building statistical models from massive data, real-time network traffic monitoring and anomaly detection), methods based on statistics and probability have become increasingly popular. This proposal aims at developing theoretical, well-grounded statistical methods for massive data based on random projections, including data stream algorithms, quantized projection algorithms, and sparse projection algorithms.<br\/><br\/>Massive data are often generated as high-rate streams. Network traffic is a typical example. Effective measurements (and updates) of network traffic in real-time using small storage space are crucial for detecting anomaly events, for example the DDoS (Distributed Denial of Service) attacks. For many applications such as databases and machine learning, appropriate quantization of random projections will substantially improve the accuracies (in terms of variance per bit) and provide efficient indexing and dimension reductions to facilitate efficient search and learning. The proposed research will tackle a series of mathematically challenging problems in the development of random projections. A wide range of statistical learning and numerical linear algebra algorithms will be re-engineered to take advantage of the state-the-art projection methods.<br\/><br\/>These days, many industries such as search are in urgent demand for statistical algorithms which can effectively handle massive data. It is expected that algorithms to be developed in this proposal will be integrated with parallel platforms, to solve truly large-scale real-world problems. Research results will be disseminated to practitioners through publications, conference presentations, industry visits and collaborations, tutorials, and open-source distributions. Many of the proposed research problems involve statistical analysis and may continue to help attract statisticians\/mathematicians to work on area of big data. The proposed research activities will engage both undergraduate and graduate students in statistics and engineering, through innovative curriculum and research training.","title":"BIGDATA: Small: DA: A Random Projection Approach","awardID":"1419210","effectiveDate":"2013-12-01","expirationDate":"2016-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[565250],"PO":[565251]},"210974":{"abstract":"With the proliferated growth of wireless communication services, the radio spectrum has become a precious resource. On the other hand, many licensed spectrum bands are considerably under-utilized in both time and spatial domains. This situation has motivated dynamic spectrum access to increase spectrum utilization. <br\/><br\/>This project proposes a novel application-oriented dynamic spectrum access model, termed on-demand spectrum access (ODSA), to capitalize on recent spectrum policies evolution, while eliminate technical barriers bothering the existing dynamic spectrum access model. We consider a spectrum service provider to offer on-demand spectrum services to users, such that users can dynamically set up application-oriented virtual topologies to carry out specific applications. This project will develop optimal or near-optimal spectrum allocation algorithms, and novel techniques to improve spectrum sharing and increase spectrum utilization. <br\/><br\/>The developed algorithms, techniques, and architectures have the potential to affect the spectrum authorities on policy reform of spectrum management, and affect the design, deployment, and operation of future wireless communication systems, to result in significant economical, societal, and public safety impacts. This project also offers an excellent opportunity to promote broadening participation of underrepresented minority students in research and education, by directly supporting underrepresented minority students and outreach activities.","title":"NeTS: Small: RUI: On-Demand Spectrum Access: Application-Oriented Dynamic Spectrum Access","awardID":"1418012","effectiveDate":"2013-12-04","expirationDate":"2015-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["565184"],"PO":["565303"]},"210897":{"abstract":"This grant supports the fall 2013 Future Internet Architecture (FIA) principal investigator meeting. The meeting enables PIs to discuss four topics: 1) the management of faults, which includes detection, localization, isolation\/avoidance\/working around them, and repair\/recovery; 2) routing where the interest here is not the complete details of how the schemes are currently doing routing, but what the different approaches provide as foundations for routing, and what they require from a routing protocol; 3) the Internet of Things (IoT), which is of interest to several of the projects that have a point of view about sensors, machine to machine (M2M), etc.; and 4) performance, since most of the FIA proposals do not distinguish themselves from the current Internet on the basis of simple performance improvements (e.g., efficient use of links), but do raise different and interesting questions about aspects of performance. The goal of this session is to tease these questions out and compare the FIA proposals in this light.<br\/><br\/>Intellectual Merit: The discussions of these topics lead to a better focus by the various FIA projects on key issues, such as network management, which have not received high-level attention in previous FIA meetings. The discussion also lays the groundwork for a more substantive discussion of security, perhaps at the next meeting in spring 2014. The discussions of routing and performance tie the FIA efforts to some more traditional topics of network research. The discussion of IoT provides a lens into the applicability of the different FIA proposals for an important application space. The intention is that these discussions provide an in-depth assessment of these issues, which should be of direct benefit to the projects themselves as well as the broader networking community.<br\/><br\/>Broader Impacts: The broader goal of the NSF FIA effort is enhancing the relevance and impact of the NSF program of network research, intellectual enrichment of the network research community, and the contribution of new concepts and thought leadership to the future of the Internet. FIA in general and the workshops in particular are a means to train a cohort of academic network researchers in the practice of long-range architectural thinking. FIA has the potential to contribute to a future Internet that is materially more secure, robust, economically viable, and fit for the needs of society than the Internet of today. The results of this workshop, posted on the FIA website (www.nets-fia.net) for public dissemination, are expected to provide a contribution to this broader goal.","title":"Workshop:FIA investigator meeting fall 2013","awardID":"1413817","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[565000],"PO":["565090"]},"210931":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for approximately 12 graduate students, along with a panel of 3 distinguished research faculty mentors. The event will take place in conjunction with the 2014 International Conference on Supporting Groupwork (GROUP 2014), to be held November 9-12 on Sanibel Island, Florida, and sponsored by the Association for Computing Machinery's Special Interest Group on Computer-Human Interaction (ACM SIGCHI). For over 25 years, the bi-annual GROUP conferences have been a leading international forum for the presentation and discussion of research and practice on organizational behavior, information systems, social informatics, human-computer interaction (HCI), and computer supported cooperative work (CSCW), providing a showcase for innovative work on the development, introduction, management, deployment, and analysis of computer-based collaborative systems. A strong emphasis of the GROUP conferences is to foster discourse on collaborative technology that bridges the fields of CSCW, information systems, technology enhanced learning, and learning at the workplace; relevant issues include the design, implementation, deployment, evaluation, and impact of these systems, as well as examinations of relevant research methodologies. Research reports published in the GROUP conference proceedings are competitively reviewed and widely cited. More information about the conference may be found online at http:\/\/www.acm.org\/conferences\/group\/conferences\/group14\/. <br\/><br\/>The GROUP 2014 Doctoral Consortium (DC) will be a research-focused day-long meeting on Sunday, November 9, with follow-up events that take place during the conference's main technical program. Student participants will be later stage doctoral students from both the United States and abroad, who represent the various disciplines and subfields of interest to the conference. The goals of the workshop are to build a cohort group of young researchers who will then have a network of colleagues spread across the world, to guide and shape the work of the new researchers by having experts serve as mentors and give advice, to provide encouragement and support for the selection of GROUP research topics, to make it possible for promising new entrants to the field to attend a leading research conference and to illustrate for them the interrelationship and diversity of GROUP research, and in general to make the new entrants' experience at the GROUP conference enjoyable and rewarding, so that they will be encouraged to return and submit to future conferences in the series.<br\/><br\/>Broader Impacts: The GROUP conferences represent a critical link between the research communities supported by CISE\/IIS and the broader social, behavioral, and management sciences. Maintaining and fostering research dialog among these diverse disciplines will result in synergistic and transformative research collaborations. Further, developing young researchers who can effectively bridge two or more of the broader CISE\/IIS, social and management sciences is an important goal to ensure the future vitality of the IIS research community. The GROUP 2014 DC will bring together the best of the next generation of organizational systems, information systems, social informatics, and CSCW researchers. The social network among this next generation of researchers, and the relationships with senior researchers, created by the workshop will play a critical role in their enculturation into the profession. The organizers will be proactive in order to ensure that both students and faculty are a diverse group across multiple dimensions including nationality, scientific discipline, gender, institutional affiliation, and under-represented minority status. To further ensure diversity, no more than 2 student participants will be accepted from any one institution.","title":"WORKSHOP: ACM Group 2014 Conference Doctoral Research Consortium","awardID":"1414780","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565070],"PO":["565227"]},"210700":{"abstract":"The award supports the attendance of students to the 20th Annual IEEE International Symposium on High Performance Computer Architecture (HPCA 2014), to be hosted on February 15-19th, 2014 in Orlando, Florida. The HPCA Symposium, a top-tier conference on computer architecture related research, has enjoyed a rich history of success. The research results presented at HPCA conferences have shown strong impacts in this research field and are highly regarded among the computer architecture community. Students have much to gain from attending HPCA such as learning state-of-the-art methodologies, being exposed to novel techniques, and interacting with senior researchers in their chosen area of expertise.<br\/><br\/>The importance of formal verification is becoming widely accepted. Increasing the attendance of students in HPCA will expose more students to the exciting developments in the field and in the long run will help to build a broad base of expertise in the field, which will impact both industry and academia.","title":"Student Travel Support for the 20th Annual IEEE International Symposium on High Performance Computer Architecture (HPCA 2014)","awardID":"1363290","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["446394"],"PO":["565264"]},"210866":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 13 promising graduate students from U.S. institutions of higher learning along with distinguished research faculty, to be held in conjunction with the Seventh International Conference on Pervasive Technologies Related to Assistive Environments (PETRA 2014), which will take place May 27-30 on the island of Rhodes, Greece. The PETRA mission is to promote interdisciplinary research on ways to use pervasive ambient intelligent environments to improve the quality of life and enhance human performance with greater capabilities; it is the only annual conference that brings together theoreticians and practitioners from a wide variety of disciplines to focus on the application of pervasive technologies to assistive environments. Innovations to be presented at PETRA 2014 include smart tools for human sensing, devices to empower persons with disabilities, algorithms for data fusion, new computer aided rehabilitation methods, therapy game environments that can be personalized, gesture recognition tools, medication management, remote secure communications and data sharing, and remote health monitoring, among others. The PETRA proceedings are published by the ACM digital library, and the authors of the best papers are invited to submit to special journal issues after the end of the conference. More information about the conference may be found online at http:\/\/www.petrae.org. <br\/><br\/>The goals of the day-long Doctoral Consortium are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance in a supportive and interactive environment from a group of senior researchers. Student participants will be drawn from diverse communities including computer science, engineering, psychology, social science, neuroscience, human-computer interaction, cognitive science and communication. They will make formal 20-minute presentations of their work and will receive feedback from a faculty panel; the feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The workshop faculty members will bring a wide spectrum of expertise, and provide student mentoring and coordination. Doctoral Consortium attendees will be asked to create and maintain a \"digital workbook\" where along with their work they include feedback on papers they attended and observations that they gathered (e.g., through meetings and discussions with conference speakers and other participants) that will apply to and impact their work. Short papers on the participants' work will be published in the conference proceedings, and a summary report on the event will be posted on the conference website. <br\/><br\/>Broader Impacts: The PETRA 2014 Doctoral Consortium will bring together some of the best students, researchers and practitioners in relevant fields, and will thereby afford the younger participants a unique opportunity to gain wider exposure for their innovative ideas while also receiving reinforcement for the importance and value of conducting research with societal impact. The workshop will allow the junior participants to create a social network both among themselves and with senior colleagues. The organizing committee will make a concerted effort to attract participants who are women, members of under-represented minorities, and persons with disabilities. To further assure diversity, NSF funds will be used to support no more than 2 student participants from any one institution. And this year, for the first time, NSF funds will also be used to support attendance at the conference of 2 select undergraduate students, in the hope of exciting them about possible career choices in science.","title":"WORKSHOP: Doctoral Consortium at the PETRA 2014 Conference","awardID":"1409897","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["229551",564932],"PO":["565227"]},"210945":{"abstract":"This proposal provides travel support for the 2013 Energy CPS workshop, covering speakers, breakout session moderators, and scribes important to the workshop's overall success. Support will also be provided to enable the participation of underrepresented minorities and women, to ensure the discussions will represent important and emerging areas throughout the CPS and energy research communities. The intellectual merit of the proposal is due to the important nature of the workshop -- to define a research agenda for cyber-physical systems in the context of energy. The broader impact is due to the pervasive nature of energy in CPS, and the generation of a long-range research agenda as well as the formulation of new collaborative teams pursuing efforts in this space.","title":"Travel Grant Energy Cyber-Physical Systems Workshop","awardID":"1415530","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[565111],"PO":["565274"]},"210659":{"abstract":"The focus of this proposal is to provide technical coordination for the 2013 Cyber-Physical Systems (CPS) Principal Investigators' (PI) meeting and multiple CPS-related workshops in the areas of Energy, Transportation, Medical Devices, and Agriculture in late 2013 and early 2014. The workshops, each comprising 50-60 leading academic researchers and government as well as industrial technology managers, will help the community understand the research challenges at the intersection of cyber-physical systems and these application domains, and help build research agendas for these domains going forward. Technical coordination to be provided includes creating web resources ahead of the PI meeting and workshops; coordination and formulation of the program agendas via planning committees for the events; developing, editing, and archiving content from these meetings; and contributing to the writing, editing, and publishing of research needs reports resulting from these meetings. The broader impact of this project is comprised of the meeting\/workshop artifacts, particularly a broad and compelling research agenda to guide future investments in cyber-physical systems R&D, particularly in the areas of energy, transportation, medical devices, and agriculture.","title":"2013 CPS PI Meeting and CY 2013-CY 2014 Workshops on CPS Energy, CPS Transportation, CPS Agriculture, and CPS Medical Devices","awardID":"1361258","effectiveDate":"2013-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[564429,564430],"PO":["565274"]},"210902":{"abstract":"This is funding to support travel for a diverse group of U.S. PhD students and distinguished faculty mentors to participate in a doctoral colloquium (workshop) on research on information science that will be co-located with the 2014 iConference to be held March 4-7 in Berlin, Germany, and jointly hosted by the Berlin School of Library and Information Science at Humboldt-Universitat zu Berlin and the Royal School of Library and Information Science at the University of Copenhagen. The iConferences, the annual meetings of the iSchool community (cf. http:\/\/ischools.org\/ for more information) are a leading forum that brings together faculty, students, research staff, and industry practitoners with a common interest in supporting and augmenting human engagement with information and technology. Open to broad participation, the iConferences have been successful in building a sense of community around the information field, bringing together people who otherwise might rarely interact with one another, and helping them share findings and exchange views relating to their interdisciplinary research. More information about the 2014 iConference may be found online at http:\/\/ischools.org\/theiconference\/call-for-participation\/. <br\/><br\/>The 2014 iConference Doctoral Colloquium, which will take place on March 7, 2014 (the final day of the iConference), will be a day long research-focused meeting of approximately 35 selected PhD candidates studying all aspects of information science (IS) together with 12 distinguished mentors (NSF funds will be used to support 16 student participants from U.S. institutions). The primary objective of the Doctoral Colloquium is to help train the next generation of information science researchers. To this end, it will provide the student participants with an environment in which they can share and discuss their goals, methods and results at an early stage of their research. By participating in the doctoral colloquium, students will gain feedback on their work both from the mentors and from other students, which should allow them to enhance their research. Students will also develop a better understanding of the different research communities engaged in the study of information science, and learn how to position their work within the IS community. In addition, the colloquium will provide students with opportunities to make new professional connections beyond their own disciplines. <br\/><br\/>Broader Impacts: The iConference doctoral colloquia traditionally bring together the best of the next generation of researchers in information science and related areas, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Participation is encouraged from a broad range of relevant disciplines and approaches, thereby broadening attendees' perspectives on their topics of study and promoting advancement of the field. No more than one student will be accepted from any given institution, and priority will be given to students who have not previously attended an iConference Doctoral Colloquium. The organizers will proactively work to include women and minority representation among the student participants to the extent possible. As a consequence of these steps, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"WORKSHOP: iConference 2014 Doctoral Research Colloquium","awardID":"1413869","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565010],"PO":["565227"]},"210748":{"abstract":"The award supports the attendance of twelve students to the International conference on Verification, Model Checking, and Abstract Interpretation (VMCAI), to be hosted in San Diego, January 19-21. VMCAI is a successful established conference that bridges the gap between the various methodologies that are used for formal verification. VMCAI been a source for much collaboration and cross-fertilization and has attracted many of the key researchers in the related fields. Students have much to gain from attending VMCAI like learning state-of-the-art methodologies, being exposed to novel techniques, and interacting with senior researchers in their chosen area of expertise. <br\/><br\/>The importance of formal verification is becoming widely accepted. Increasing the attendance of students in VMCAI will expose more students to the exciting developments in the field and in the long run will help to build a broad base of expertise in the field, which will impact both industry and academia.","title":"Student Travel Support for VMCAI 2014","awardID":"1401905","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[564664],"PO":["565264"]},"210936":{"abstract":"This award supports student travel to the IEEE Conference on Computational Complexity (CCC), in Vancouver, British Columbia, Canada, on June 11-14, 2014.","title":"CCF: AF: Student Travel Support for the IEEE Conference on Computational Complexity 2014","awardID":"1415168","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[565081,565082],"PO":["565157"]},"210727":{"abstract":"This grant encourages the careers of new researchers by providing travel support for student authors of accepted papers at the Financial Cryptography 2014 conference. The FC conference is prestigious, and the students' work will stand alongside some of the most impactful research in the field. FC's research agenda includes SaTC's Trustworthy Computing System Perspective and Social, Behavioral and Economic Sciences Perspective. The nature and inspiration of the field encompasses at its foundations the invention of cryptographic means to support social protocols such as contracts, exchange, and information intimacy.<br\/><br\/>The effect of the proposed activity is to sustain and expand the vibrancy of Financial Cryptography research, and research of allied fields, by connecting promising young students of the field to the research community. Their presence at the Financial Cryptography conference will establish relationships that will continue for decades, and guide the young researchers' careers.","title":"Financial Cryptography Conference Student Awards","awardID":"1401071","effectiveDate":"2013-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[564616,564617],"PO":["565327"]},"210959":{"abstract":"This is funding to support participation by approximately 12 graduate students (9 domestic and 3 international), along with 5 senior members of the community (faculty and industry researchers), in a Doctoral Consortium (workshop) to be held in conjunction with IEEE Virtual Reality 2014 conference that will take place March 29-April 2 in Minneapolis, and which is collocated with the IEEE Symposium on 3D User Interface. Virtual reality (VR) is a multidisciplinary field involving human-centered computer simulations that seek to imitate or augment real world senses (usually sight, sound, and touch) and experiences. VR research includes developing and assessing methods and systems, and facilitating and understanding user perceptions, beliefs, and behaviors. First organized by the IEEE Computer Society in 1993 and held annually since 1995, IEEE Virtual Reality is the premier international conference and exhibition in this field and includes technical paper presentations, workshops, tutorials, research demonstrations, and exhibits from industry. The IEEE Symposium on 3D User Interfaces has been held annually and colocated with IEEE VR since 2006. Based on prior year numbers, the combined 2014 conferences are expected to attract 350-400 registrants, 15-20 exhibitors, and 30 student volunteers. More information may be found online at http:\/\/www.ieeevr.org\/2014.<br\/><br\/>This year's IEEE VR Doctoral Consortium is inspired by and similar in format to last year's successful inaugural event, which was also supported by NSF. The main activities of the DC will take place on Sunday, March 30, immediately prior to the start of the IEEE VR conference proper and in parallel with the second day of the IEEE Symposium on 3D User Interfaces; additional smaller activities will take place at scattered times over the rest of the week. The workshop will include morning and afternoon sessions in which each student presents his\/her work to the other student participants and a panel of senior VR researchers, with sufficient time set aside after each talk for discussion and constructive feedback that addresses the strengths of the work, challenges and issues that may arise, and implications of the results. A group working lunch attended by all the students and mentors will be particularly valuable for unifying the individual goals and projects presented within the group as part of a \"big picture\" envisioning of the future of the field over the next 10-20 years. Each student will also be asked to prepare a poster on his\/her research that will be on display during the conference as part of the poster sessions, and to submit a short (2-page) abstract to be archived in the IEEE Digital Library.<br\/><br\/>Broader Impacts: The goal of the Doctoral Consortium is to provide an interactive and supportive mentoring opportunity for mid-level graduate students in virtual reality, to afford these students a valuable opportunity to get independent perspectives on their research from senior individuals with a wide collective breadth and depth of knowledge, and to build a cohort of young researchers within the VR community. The organizers will make a special effort to recruit participants from groups traditionally underrepresented in computer science, including women, persons of color, and persons with disabilities. They will take steps to achieve diversity among the students with respect to research topics, disciplinary backgrounds, methodological approaches, and home institutions (for example, no more than one graduate student will be accepted from any given institution).","title":"WORKSHOP: IEEE VR 2014 Doctoral Consortium","awardID":"1416888","effectiveDate":"2013-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565145,565146],"PO":["565227"]},"210939":{"abstract":"This award supports an NSF\/CISE CAREER Proposal Writing Workshop, to be held as a one-day event in March 2014 in Arlington, VA. The workshop will introduce junior faculty to the NSF CAREER program and provide them with invaluable insights from past awardees and NSF program managers on features of effective CAREER proposals. The objective is to better equip junior faculty to write effective, ultimately successful, CAREER proposals. <br\/><br\/>The NSF CAREER program is central to NSF efforts to identify, foster and support the nation's most promising junior faculty in research and education. It is well known that junior faculty have had limited experience on grant writing and few opportunities of interaction with NSF program directors. As many faculty learn during their careers, the opportunity to obtain direct insights and feedback from grant awardees and NSF program directors is invaluable to learning how to write effective, ultimately successful, grant proposals. The purpose of this workshop is to provide such a venue for junior faculty to help them jumpstart their academic careers. <br\/><br\/>A limited number of scholarships will be made available for HBCU and other minority faculty, including women, to attend the workshop. The workshop will be a unique opportunity for such faculty to network with recent NSF CAREER awardees. This will enhance the overall research capabilities of HBCU and other minority faculty to perform cutting-edge research. Additionally, presentation materials (slides, videos, etc.) from the panel sessions will be made available on the workshop website for other junior faculty to download; this will allow the impact of this workshop to reach beyond the direct participants to other junior faculty nationwide.","title":"Workshop: 2014 NSF CISE CAREER Proposal Writing Workshop","awardID":"1415210","effectiveDate":"2013-12-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[565088,565089],"PO":[565090]},"209172":{"abstract":"This INSPIRE award is partially funded by the CE21 Program in the Division of Computer & Network Systems in the Directorate for Computer & Information Science & engineering (CISE), the Cyberlearning Program in the Division of Information & Intelligent Systems in the CISE Directorate, and the Discovery Research K-12 Program in the Division of Research on Learning in Formal and Informal Settings (DRL) in the Directorate for Education & Human Resources (EHR). Clemson University will design, develop, and evaluate a virtual environment and associated curriculum for blending movement and computer programming as a novel and embodied way to engage 5th- and 6th-grade girls with computational thinking. This research will test the hypothesis that girls creating interactive movement for their virtual characters and using their bodies to think through the actuation of the characters should bootstrap their intuitive knowledge in order to learn computational concepts, utilize computational practices, and develop computational perspectives. <br\/><br\/>The project staff will 1) develop a desktop-based virtual environment in which students must program a 3-dimensional character with which they can later interact (this environment builds on previous successes of similar programming environments, but will utilize grounded embodied pedagogical strategies); 2) conduct iterative design experiments to answer a set of research questions (how does an embodiment-centered curriculum support the development of computational thinking? how does an embodiment-centered curriculum support interest in STEM fields?); and 3) capitalize on the results of these experiments to iteratively refine the virtual environment and curricular materials.","title":"Virtual Environment Interactions: Exploring Grounded Embodied Pedagogy in Support of Computational Thinking","awardID":"1344228","effectiveDate":"2013-12-15","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8078","name":"INSPIRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7645","name":"DISCOVERY RESEARCH K-12"}}],"PIcoPI":[560700,560701,560702,560703],"PO":[560704]},"209131":{"abstract":"This INSPIRE award is partially funded by the Geospace Facilities Program in the Division of Atmospheric and Geospace Sciences in the Directorate for Geoscience, and the Computing Research Infrastructure and Networking and Technology and Systems Programs in the Computer and Network Systems Division in the Directorate for Computer and Information Science and Engineering.<br\/><br\/>The investigators will perform a proof-of-concept demonstration of a revolutionary architecture that uses mobile devices to form a global space weather monitoring network. Current sensors observing the space weather environment are sparsely deployed and relatively costly to operate. A promising technique to overcome this issue leverages existing Global Positioning System (GPS) infrastructure; more specifically, delays in the multi-frequency GPS signals observed at the ground that are caused by ionospheric electron density. Modern mobile devices constitute a vast network of multicore parallel computers that provide the computational power needed for geospace data processing and storage. With connectivity available worldwide, even in remote places, mobile devices are thus excellent candidates to establish global relays that feed sensor data into a cloud processing environment that reconstructs the structure of the space environment, and its dynamic changes. This project will enable space weather data collection even in the most remote places on Earth, resulting in dramatic improvements in observational gaps that exist in space weather research today. Kila Mahali means \"everywhere\" in the Swahili language. Space weather phenomena in Earth's upper atmosphere influence our daily lives, but prior technical limitations have made a thorough understanding of these phenomena difficult. In today's networked society, it is critical to monitor and predict extreme space weather events and their impacts on the ionosphere, because they can affect human systems for power, communications, and navigation. Recent studies have also demonstrated that tsunamis and earthquakes perturb the density of electrons in the ionosphere, and that even climate change has a measurable impact on ionospheric electron density. This interdisciplinary project explores how to make this possible by leveraging mobile devices as enabling relays for a dense mesh of measurements. This approach will create totally new opportunities for Space Weather monitoring, scientific investigation, and potentially use of the entire ionosphere as a sensor to monitor natural disasters and help save human lives.","title":"INSPIRE Track 1: Mahali: Space Weather Monitoring Everywhere","awardID":"1343967","effectiveDate":"2013-12-01","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8078","name":"INSPIRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[560571,560572,560573,560574,560575],"PO":["564736"]},"209264":{"abstract":"The goal of this project is to develop a fully-passive intra cranial sensing system. This novel electronic brain-machine interface utilizes an implantable miniaturized neurosensor based on microwave back-scattering, a miniature textile antenna, and RF circuits on flexible polymer substrate. It has the unique properties of only minor heating, thus, minimizing injury and trauma to the brain, eliminating the need for wires through the cranium, and preserving natural lifestyle and comfort. The acquired neurosignals are collected by a self-powered wearable body area network for continuous real-time monitoring and subsequent physiological interpretation. The project includes physiological studies of the acquired brain signals. <br\/><br\/>While conceived initially as a tool for long-term monitoring of brain signals, this sensing technology has a very wide range of potential applications in health, including control of prosthetics and early detection of seizures. Overcoming the challenges in safety and long-term reliability presented by conventional neurosensor technology could transform healthcare for people suffering from severe chronic neurological disorders. Results of the physiological studies are disseminated through a data repository for understanding brain disorders. Research is integrated with education through several activities, including hands-on experience for students in this new area, summer camps, and a variety of outreach activities to attract women and minorities in engineering.","title":"SCH: INT: Collaborative Research: Physiological Studies of Brain Signals using a Wireless Neuro-Sensing-Diagnostic System","awardID":"1344825","effectiveDate":"2013-12-01","expirationDate":"2017-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":["562653",561016,561017],"PO":["564778"]},"208341":{"abstract":"The University of California San Diego (UCSD) will implement a structured early-college research program to increase retention in Computer Science and Engineering (CSE). During their first and second years in CSE, students will participate in team-based research projects. Goals of the program include increased retention, particularly of women and underrepresented minorities, in the CSE major, an exportable model for engaging first and second year students in the research community at a large university, and increased performance in first and second year computer science courses. These goals will be evaluated through formative assessments, program guidance, and directed assessment of specific educational goals as well as a comparison to similar programs nationwide.<br\/><br\/>This project will change the environment at UCSD to draw early undergraduates into the existing research culture of the CSE department, impacting not only the 40 students per year in the program but also those not directly engaged in the program. More broadly, this project will provide a model that can be replicated at large research-focused institutions for engaging and retaining early undergraduates in computer science research.","title":"BP: CSE Early Research Scholars Program","awardID":"1339335","effectiveDate":"2013-12-01","expirationDate":"2016-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":[558317],"PO":["560704"]},"209269":{"abstract":"The goal of this project is to develop a fully-passive intra cranial sensing system. This novel electronic brain-machine interface utilizes an implantable miniaturized neurosensor based on microwave back-scattering, a miniature textile antenna, and RF circuits on flexible polymer substrate. It has the unique properties of only minor heating, thus, minimizing injury and trauma to the brain, eliminating the need for wires through the cranium, and preserving natural lifestyle and comfort. The acquired neurosignals are collected by a self-powered wearable body area network for continuous real-time monitoring and subsequent physiological interpretation. The project includes physiological studies of the acquired brain signals. <br\/><br\/>While conceived initially as a tool for long-term monitoring of brain signals, this sensing technology has a very wide range of potential applications in health, including control of prosthetics and early detection of seizures. Overcoming the challenges in safety and long-term reliability presented by conventional neurosensor technology could transform healthcare for people suffering from severe chronic neurological disorders. Results of the physiological studies are disseminated through a data repository for understanding brain disorders. Research is integrated with education through several activities, including hands-on experience for students in this new area, summer camps, and a variety of outreach activities to attract women and minorities in engineering.","title":"SCH: INT: Collaborative Research: Physiological Studies of Brain Signals using a Wireless Neuro-Sensing-Diagnostic System","awardID":"1344928","effectiveDate":"2013-12-01","expirationDate":"2017-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[561032],"PO":["564778"]},"209259":{"abstract":"The goal of the project is to develop fundamental science, knowledge, tools, and technologies for smart diagnosis and monitoring of heart conditions based on automated cardiac auscultation. An innovative wearable multimodal acoustic array (the StethoVest) is proposed. This sensory array localizes and separates acoustic broadband sources in space by measuring spatial and temporal derivatives of the acoustic field. Using this StethoVest, first-of-their-kind maps of the cardiac acousteome are generated. These maps include not only 4D (3D space and time) measurements of heart sounds; they are accompanied by high-fidelity hemoacoustic simulations that delineate cause-and-effect, as well as simulation-guided source-identification algorithms that provide unprecedented diagnostic sensitivity and specificity. The simulations take cardiac imaging data as input, and simulate cardiac blood flow as well as the associated heart sounds. The latter part of this four-year project focuses on investigating the physics of aortic valve murmurs as well as StethoVest based screening for hypertrophic obstructive cardiomyopathy.<br\/><br\/>Annual national expenditure on heart disease exceeds half a trillion dollars with over half a million deaths attributed to this disease each year. The proposed research leverages emerging capabilities in biosensing, computational modeling, imaging and signal processing, to produce a diagnostic technology that moves us away from management of heart disease that is mostly reactive, expensive and hospital-centric, towards an approach that is smart, proactive, patient-centric and cost-effective. The sound inventory generated from continuous, automated monitoring and interpretation of heart sounds has the potential to generate unprecedented understanding of human physiology. The project promotes interdisciplinary education and workforce development through involvement of undergraduates, graduate students, and postdocs in the research, development of courses and clinical training tools, and local and international outreach activities.","title":"SCH: INT: Mapping the Cardiac Acousteome: Biosensing and Computational Modeling Applied to Smart Diagnosis and Monitoring of Heart Conditions","awardID":"1344772","effectiveDate":"2013-12-01","expirationDate":"2017-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560997,560998,560999,561000],"PO":["564778"]},"209238":{"abstract":"The vision of patient-centric, personalized, precision medicine and wellness will be fully realized only when an individual?s self-care and clinical decision making are informed by a rich, predictive model of that individual?s health status. The evolution and dissemination of mobile technology has created unprecedented opportunities for highly detailed and personalized data collection in a far more granular, unobtrusive, and even affordable way; these data include activity levels, location patterns, sleep, consumption, and communication and social interaction. However, turning this potential into practice requires that we develop the algorithms and methodologies to transform these raw data into actionable information. The research will develop novel and generalizable techniques to derive robust measures relevant to individual health and clinical decision making. The team will develop and evaluate tools that convert raw human-activity data into clinically actionable behavioral biomarkers. This demands creative uses of the underlying technical capabilities (i.e., passive data capture, data analysis and machine learning, data visualization, user experience), as well as rigorous understanding of the underlying health condition and management (i.e. functional health measures, achievable and optimal health outcomes, patient challenges in adherence, risks and benefits associated with medication and other aspects of treatment, and clinical decision making). The approach has broad applicability across disease management (e.g., auto-immune, gastrointestinal, depression, cognitive decline, and neurologic disorders), but also calls for tailoring to specific conditions and individuals. Therefore, we will conduct this initial work in a specific context, that of chronic pain management for three prominent conditions: rheumatoid arthritis, osteoarthritis, and lower back pain. The behavioral biomarkers associated with our initial target domain, pain management, center around: (i) decline in activity levels; (ii) increase in stress; (iii) decrease in sleep quality; (iv) drop in function, e.g., reduction in travel distance or inability to go to work. The effectiveness of passive sensing capabilities of the mobile phone to track sleep, changes in activity level, stress, social isolation, geographic location and several other indicators that are likely antecedents or symptoms of pain interference has been demonstrated previously. <br\/><br\/>While behavioral biomarkers rely extensively on passively captured data streams (such as activity, location, communication, application usage and audio), there remain important cases in which self-report data is required to augment or clarify passively collected data. However, the standardized patient survey instruments that assess relevant symptoms and behavior are not suitable for use on a daily basis because of length, question design, or both. Further, traditional forms of self report are often intrusive, burdensome, and suffer high rates of attrition. A new approach, contextual recall, aims to mitigate the issues related to self-report through three key mechanisms: optimizing the delivery of prompts, providing the user with key contextual cues to improve recall, and employing visual input techniques as an alternative to long-form measures that do not scale well to frequent mobile self-reports. The approach to personalizing disease management is intentionally scalable in terms of affordability and accessibility. Passive data collection requires no user attention, and contextual recall is a form of self-report designed for busy individuals with a range of demands and constraints on their time, as well as potential literacy and numeracy constraints. The clinician-facing components of this approach are also designed to work in resource-constrained clinical settings where clinicians are under particular time pressure. The team will recruit patients and clinicians from typically underserved communities to engage in the participatory design process. The overall contributions of this work will include development and evaluation of: (1) software techniques to combine and transform passively monitored and self-reported data streams into clinically meaningful, actionable, and personalized indicators, which we call behavioral biomarkers; (2) contextual recall that allows the collection of highly granular and contextually specific self-report data to enhance passively captured data with information from the patient perspective, while balancing the tension faced in balancing recall bias and usability; and (3) a methodology that systematizes the collaboration with clinical domain experts to develop and integrate behavioral biomarkers into clinical decision making for specific diseases. We will create and evaluate a modular and extensible suite of analytics and user interaction techniques designed to facilitate iterative implementation and evaluation. These modules will themselves be a contribution, but","title":"SCH: INT: Novel Techniques for Patient-centric Disease Management using Automatically Inferred Behavioral Biomarkers and Sensor-Supported Contextual Self-Report","awardID":"1344587","effectiveDate":"2013-12-01","expirationDate":"2017-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560926,560927,560928,560929,560930],"PO":["565136"]},"210261":{"abstract":"The Third Programming Languages Mentoring Workshop (PLMW) will take place as part of the flagship programming language conference, Principles of Programming Languages (POPL 2013), which is being held in San Diego California. This grant will support approximately 20 students to attend the PLMW event plus the POPL conference. While there is other funding available (through ACM SIGPLAN PAC) for students who are presenting papers at POPL, this proposal is intended specifically to increase the numbers of students from underrepresented groups and gives priority to US citizens and permanent residents. The broader impacts of the grant relate to the need to broaden participation, provide opportunities for students to receive mentoring from top members of the programming languages community, and build the next generation of researchers and knowledgeable practitioners in this important research arena.","title":"Programming Languages Mentoring Workshop","awardID":"1353927","effectiveDate":"2013-12-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[563479],"PO":["564588"]}}