{"13593":{"abstract":"9617781 Jullig An international workshop on Constructive Programming will be held in Rio de Janeiro, Brazil to explore future directions in formal methods, programming logics, and programming languages. The workshop will take place November 4 to 8, 1996 and will combine 3 days of technical exchange with 2 days of discussions to produce recommendations to the science funding agencies of the U.S. and Brazil: NSF, CNPq, and FINEP. In recent years Brazilian researchers have made significant contributions in constructive programming and related areas, establishing a number of contacts with U.S. researchers. This workshop will promote further collaborations and provide information and recommendations for future research efforts and funding initiatives. ***","title":"Workshop on Formal Foundations of Software Systems: Rio de Janeiro, Brazil, May 5-9, 1997","awardID":"9617781","effectiveDate":"1996-11-01","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[34466,34467],"PO":["150697"]},"29166":{"abstract":"","title":"System Software Support for Input-Output on Parallel Computing","awardID":"9796029","effectiveDate":"1996-11-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["560392"],"PO":["250083"]},"17592":{"abstract":"This grant will support the American participants in a workshop on Applied Formal Methods to be held in Hyderabad, India, in December 1996. The goal of the workshop is to bring together several international experts from the U.S., India, and elsewhere with the purpose of capturing the state of the art in the technology and the state of practice in the applications of formal methods. The workshop scope includes the study of specification languages and logics and verification methods, such as theorem proving, model checking, and safety analysis. Formal methods are increasingly applied to the core algorithms in safety-critical systems and in the verification of hardware circuit designs. A workshop of this nature provides a timely means for developing a common understanding of the capabilities and the potential applications of these technologies. The organizers will edit a technical report providing an up-to-date survey of applied formal methods. ***","title":"An International Workshop on Applied Formal Methods: Hyderabad, India, December 14-17, 1996","awardID":"9633644","effectiveDate":"1996-11-01","expirationDate":"1997-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["555363"],"PO":["150697"]},"11866":{"abstract":"Advances in technology have made it possible to integrate a processor core, a program ROM, and application-specific circuitry all on a single IC. Thus, high-level language compilers are essential tools for overcoming complexity in embedded system design. This research is on development of a retargetable compiler framework that can generate optimized code for a variety of processor architectures. The approach includes development of a machine description language to describe a wide range of processor architectures. Further tasks include: building a retargetable code generator and optimizer, and a simulator for the compiled code to obtain performance metrics. Very general code optimization algorithms that are parameterizable with respect to the number of functional units, registers, and the topology of interconnect between them are being explored. The developed algorithms are being integrated into a framework for machine-dependent code generation and optimization.","title":"A Computer-Aided Design Methodology for Application-Specific Embedded Processors","awardID":"9612632","effectiveDate":"1996-11-15","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["561979"],"PO":["321058"]},"29276":{"abstract":"","title":"RIA: Frequency to Digital Conversion","awardID":"9796139","effectiveDate":"1996-11-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["560228"],"PO":["564898"]},"13271":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for an OC-3 ATM connection to the Very High Performance Backbone Network Service (vBNS). Applications include: - Computational Astrophysics in conjunction with the National Center for Supercomputer Applications and the Pittsburgh Supercomputer Center. - Berkeley-Illinois-Maryland Millimeter Wavelength Astronomical Array in conjunction with the University of California at Berkeley and the University of Illinois. - Space and Plasma Physics National Center for Supercomputer Applications, the Pittsburgh Supercomputer Center and the Jet Propulsion Laboratory. - Processing, Storage and Retrieval of Remote Sensing Imagery in conjunction with the NASA EROS Data Center in Sioux Falls, South Dakota Cornell University and the San Diego Supercomputer Center. - National Scalable Cluster Project in conjunction with the University of Pennsylvania, University of Illinois at Chicago, and Drexel University. - High Performance Communications for Meteorological Applications in conjunction with the University of California at Los Angeles, the San Diego Supercomputer Center and Cornell University. - Steerable Scientific Computations and Interactive Visualization in conjunction with the Maui HPCC and Wright Patterson AFB. - Visualization and Analysis of Chaotic Dynamical Systems Cornell University and the San Diego Supercomputer Center.","title":"Connecting the University of Maryland to vBNS","awardID":"9616921","effectiveDate":"1996-11-15","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["501013",33581],"PO":["121202"]},"29319":{"abstract":"","title":"NSF Young Investigator Award","awardID":"9796182","effectiveDate":"1996-11-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["99057"],"PO":["557315"]},"13309":{"abstract":"9616992 Evans, D. L. Hestenes, David Arizona State University CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies Program: Planning Grant for Center for Collaborative Research in Learning Technologies based at Arizona State University Arizona State University has been awarded funding in the amount of $50,000 for a 12 month planning grant for a Center to address the rapid development of two types of delivery systems - integrated software for science, engineering, and mathematics education use, and technology improvements for distributed\/distance education. The desired outcomes are to enhance the quality and accessibility of education at all academic levels, K-16, graduate, and extended education. A key role of the Center will be to provide tools for functioning as team and facilitation of team processing. Partners in this planning project include Motorola, Intel, Cox Communications, Peoples Choice, and the Foundation Coalition Schools.","title":"CISE\/EHR\/ENG\/MPS CRLT: Planning Grant for Center for Collaborative Research in Learning Technologies based at Arizona State University","awardID":"9616992","effectiveDate":"1996-11-01","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["200655",33693,"313722",33695,"177484","192133","544879","436249","552465","190632",33702],"PO":["297837"]}}