{"156420":{"abstract":"This award supports the Visual Analytics Science and Technology (VAST) Challenge Workshop 2009. This workshop is bringing together individuals who participate in the VAST 2009 Challenge Competition taking place from February 2009 to July 2009 to present their results and discuss their experiences.<br\/><br\/>Research on visual analytics is very timely, and it is clearly attracting a lot of interest in the research community. VAST 2009 is expected to contribute to the following goals: (1) focus the community on working on useful and realistic visual analytics problems, (2) compare and contrast systems developed or used by the participants, and (3) gather lessons learned from testing novel methodologies and metrics for evaluation.<br\/><br\/>The workshop will bring visual analytics developers and evaluators together for a full day to present the results of the Challenge, and discuss lessons learned about evaluation. It will expose many researchers -- in particular students -- to the challenges of evaluating complex systems for use by analysts.<br\/>Papers summarizing the challenge and workshop results will be widely disseminated, including the VAST 2009 Website (http:\/\/www.cs.umd.edu\/hcil\/VASTchallenge09\/).","title":"Collaborative Research - Visual Analytics Science and Technology Challenge Workshop","awardID":"0925482","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7701","name":"DATA INTEROPERABILITY NETWORKS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["440679"],"PO":["563751"]},"146454":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\"<br\/><br\/>This project is concerned with retrieval of information contained in the tables, figures and references contained in digital document on the web. At present a large amount of information present in tables and figures in documents is not easy accessible by automated methods. End-users cannot confidently pose a query and retrieve data presented in tables and figures in documents directly through a search engine. While there has been substantial research on table boundary detection and some research on table content extraction, none of these methods tried to identify the data and segregate it from the metadata present in the tables and figures which would represent a significant step forward. The research goal of this proposal is to make fundamental contributions in digital document processing and information retrieval. The objective is to identify data clearly, separate it from the metadata automatically, and store in a digital repository. An end-user will then be able to effectively query and retrieve datasets or their interesting parts.","title":"CAREER: An Integrated Framework for Extracting and Utilizing Information from Tables and Figures in Digital Libraries","awardID":"0845487","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["456076"],"PO":["563751"]},"146355":{"abstract":"Research under this award is developing efficient and effective methods for strategic decision making by an individual artificial agent cohabiting with other agents in uncertain environments. For example, how should an autonomous unmanned aerial vehicle decide between closer surveillance of a possible fugitive or intercepting the target who may be aware of the monitoring? Toward this goal, the research is identifying the sources of computational complexity and understanding the conflicting interrelationship between computational efficiency and decision-making effectiveness. This problem of individual decision making in uncertain multiagent settings is formalized using a recognized framework that combines the decision-theoretic paradigm of partially observable Markov decision processes (POMDPs) with elements of Bayesian games and interactive epistemology. In this framework, called interactive POMDP (I-POMDP), the research utilizes innovative ways of minimally modeling contextual knowledge in multiagent settings, exploits novel decision-making heuristics and embedded structure in problems.<br\/><br\/>Integration of research and education is manifest in the development and delivery of a multi-disciplinary course on strategic decision making under uncertainty, which integrates and compares normative theories with real human decision-making behavior.<br\/><br\/>By combining aspects of decision and game theories, both of which seek to understand normative ways of decision making, with attention to real human decision-making behavior, this research is contributing to long-term research and development of artificial agents that can assist with rational, long-term decision making and planning in areas including emergency response, environmental sustainability, autonomous vehicles and many others.","title":"CAREER: Scalable Algorithms for Individual Decision Making in Multiagent Settings","awardID":"0845036","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["561860"],"PO":["562760"]},"158962":{"abstract":"This award supports a student session at the 2nd Workshop on Question Generation. The aim of the workshop is to strengthen the Question Generation (QG) research community and create consensus with respect to QG as a shared task. The 2nd Workshop on Question Generation is a 1-day workshop organized into two sets of sessions. In the morning sessions, regular paper presentations on general topics related to QG are scheduled. The afternoon sessions are dedicated to discussions and presentations related to QG in Intelligent Tutoring Systems, one category of shared tasks identified at the previous Workshop on The Question Generation Shared Task and Evaluation Challenge. As part of the afternoon sessions we have a student session. Attending the workshop will greatly impact the scientific awareness and skills of students. It will allow students to become real contributors and leaders of the QG research community by engaging in discussions at the workshop about important research issues in this area of research. The workshop is a great venue for student to be exposed to interdisciplinary research which will definitely strengthen their skills. The broad implications of QG research will increase students? motivation to do research in this area. The students attending the workshop will be among future leading scientists who could boost our national STEM education, a mission of particular interest to the National Science Foundation, due to the importance of QG in learning technologies. We will encourage participation of groups underrepresented in science and engineering, including minorities, women, and persons with disabilities.","title":"The 2nd Workshop on Question Generation","awardID":"0938239","effectiveDate":"2009-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["482198","446709"],"PO":["565215"]},"158534":{"abstract":"This project supports US student researchers to travel to the Doctoral Consortium and the premier international conference on autonomous agents and multiagent systems. The International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS 2009) will be held in Budapest, Hungary between May 10 and May 15, 2009. The conference provides these students with a platform to present their research results and allows them to participate in valuable discussions that will likely shape the future of this critically important field. The technical program is complemented with an array of workshops, tutorials and other events, as it has in previous years. The wide variety and significance of the topics typically presented at AAMAS, in both the technical program and the workshop program, provides opportunities for students to share, exchange and learn from each other. A Doctoral Mentoring Program is available for Ph.D. students in advanced stages of their research. This program will provide an opportunity for students to interact closely with established researchers, to receive feedback on their work and to get advice on managing their careers.","title":"Doctoral Consortium and Mentoring of Local Students at the International Conference on Autonomous Agents and Multi-Agent Systems","awardID":"0935952","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["561562"],"PO":["564316"]},"151396":{"abstract":"This award supports participation of doctoral students in the Thirteenth SIGART\/AAAI Doctoral Consortium to be held July 12-13, 2009 in Pasadena, CA in conjunction with the 2009 International Joint Conference on Artificial Intelligence, July 11-17, 2009. The Doctoral Consortium aims to: (1) provide a setting for feedback on participants' current research and guidance on future research directions; (2) develop a supportive community of scholars and a spirit of collaborative research; and (3) support a new generation of researchers. The Doctoral Consortium organizers strive to recruit and include students from underrepresented groups (e.g., women and underrepresented minorities) and smaller schools and schools with less established programs in artificial intelligence. Each student gives a 25-minute presentation to be followed by 20 minutes of discussion; there are one-on-one meeting with a faculty mentor. There will also be opportunities to discuss career issues in both academic and other career pathways. A report on the Consortium will be published in the AI Magazine.","title":"2009 SIGART\/AAAI Doctoral Consortium","awardID":"0906798","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["460842",403473],"PO":["564316"]},"155301":{"abstract":"Dynamic mobile sensor networks are a distributed collection of mobile robots, each of which has sensing, computation, wireless communication and mobility capabilities. In a traditional wireless sensor network, although mobile robots are being used as sensor nodes, their dynamics and mobility are not fully exploited to improve the quality of collaborative sensing. This project explores research challenges in learning-based robotic wireless sensor networks by exploiting techniques in multi-robot research and wireless sensor networks with mobility taken into consideration. The proposed research aims to develop distributed learning algorithms and adaptive sensing coordination strategies for monitoring properties of mobile wireless sensor networks and adjusting locations of mobile sensor nodes to achieve better quality of collaborative sensing and environmental inference. The impact of this research lies in the novelty and synergism among networking, machine learning, signal processing and control to adaptively control the network structure, data routing, and signal processing in the mobile robotic sensor network to achieve better collaborative sensing. Expected results from this research will find applications in homeland security, environmental monitoring and sampling, and autonomous mobile robots for better collaborative sensing and information processing. The proposed project will serve as an excellent vehicle to recruit graduate students, especially those from underrepresented populations, to pursue their doctoral degree, and to recruit high-school students and encourage them to select engineering\/computer science for their choice of career.","title":"Learning-Based Mobile Robotic Sensor Networks","awardID":"0921810","effectiveDate":"2009-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["335186"],"PO":["543539"]},"158821":{"abstract":"This award gives travel, housing, and registration-cost support to selected students and other young researchers from U.S. universities for their participation in the International Summer School on Planning and Scheduling, which is affiliated with the 19th International Conference on Automated Planning and Scheduling (ICAPS-09) held September 19-23 in Thessaloniki, Greece. Artificial Intelligence planning and scheduling is relevant to a wide variety of applications such as software engineering, manufacturing, transportation, and robotics. The ICAPS-09 Summer School includes a poster session, where students present their research ideas for commentary by more senior researchers, as well as intensive study of foundational material and the latest research in automated planning and scheduling. The Summer School realizes an integration of research and education in its preparation of emerging scientists.","title":"Support for Participation in the 2009 International Summer School on Planning and Scheduling","awardID":"0937593","effectiveDate":"2009-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["485994"],"PO":["564316"]},"146501":{"abstract":"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).<br\/><br\/>Intellectual Merit.<br\/>High throughput sequencing that allows human genetics to access rare variation \"Next Generation\" sequencing is transforming human genetics: several disruptive technologies are coming of age and now enable resequencing throughput of megabases per dollar. Specifically, thousands of individuals can now be sequenced for targeted regions of the genome, in pools of individuals. The complete spectrum of common and rare alleles thus revealed is a key resource for understanding origins, genomics, and heritable traits of our species. Naïve tests of association of a heritable trait to a common variant are inappropriate for analysis of rare gene variants, since the contribution of each such rare variant to the trait is often statistically undetectable. The hope for finding an associated gene therefore lies in accumulating association signal across multiple functional variants. The problem of multiple-variant association is complicated by background correlations between nearby variants.This proposal tackles two challenges:<br\/><br\/>1.Initial task: Recovery of individual identity of mutation carriers from pooled sequencing data<br\/><br\/>2.Main task: Using individual-level mutation data for scoring of association to multiple variants in a locus<br\/><br\/>Proposed solution: Bayesian scoring, decomposable by individual and by variant.<br\/>This proposal involves design of overlapping pools for recovering mutation carrier identity. Each individual will be sequenced in a unique combination of pools. Mutations observed in such a set of pools will be inferred to be carried by the corresponding individual, addressing the initial task. This proposal tackles the main task by Bayesian scoring for genomic intervals containing functional variants. Comparative genomics is used to guide a prior distribution for whether a sequenced variant is likely to be functional. The association score is further decomposed to contributions of each sample and each site, with Markovian dependency between such contributions along the genome. A dynamic-program is proposed for optimizing the causal locus boundaries.<br\/><br\/>Broad Impact.<br\/>The outcomes of the project would facilitate new paradigms in genetic research, alongside the recently launched high throughput experimental technologies. Specifically, projected impacts include:<br\/><br\/>- software tools and tailored interfaces to be disseminated to the reseaerch community.<br\/>- Education for undergraduates by project courses implementing proposed research tasks and for K-12 students by curriculum development and delivery to high-school diversity students<br\/>- allowing a generation to have widespread access to their individual DNA.","title":"CAREER: Computational Infrastructure for Full-Sequence Association Studies with Pooled Individuals","awardID":"0845677","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[390619],"PO":["543481"]},"157633":{"abstract":"This is funding to support a Graduate Student Symposium (workshop) for about 12 promising graduate students, along with a panel of distinguished research faculty mentors, which will take place in conjunction with the 2009 ACM Creativity & Cognition Conference (CC 2009), to be held October 27-30, 2009, at the Berkeley Art Museum in Berkeley, California. ACM's Creativity & Cognition Conference series began in 1993, and has evolved into a lively multidisciplinary event combining research and practice. As computers become pervasive in all of society, there is a growing need to encourage interaction between the disciplines of computer and information technology and the disciplines of digital arts, design, and cognition. Many envision that interactions across these disciplinary boundaries are fundamental to research advances. Thanks in part to this conference series, rigorous research is expanding as theoretic foundations are emerging and goals become more well-defined. Successful practice manifests itself in a growing array of creativity support tools for discovery and composition by software and other engineers, diverse scientists, product and graphic designers, architects, new media artists, musicians, educators, students, and many others. Creativity & Cognition 2009 is focused on the theme of everyday creativity: shared languages and collective action.<br\/><br\/>Involving young researchers during their graduate education is a key opportunity to seed and encourage the interactions the conference seeks to nurture. Thus, the primary goal of the Graduate Student Symposium is to expand the participation of young researchers pursuing graduate degrees in areas with an emphasis on creativity and cognition, by giving their work wider exposure in the community, by helping to foster a sense of community among them, and by providing them with an opportunity to obtain feedback and guidance from senior members of the research community in an interactive and supportive environment. Student participants will meet and discuss their ideas with each other and with a panel of experienced researchers and practitioners, the objective being to offer them fresh perspectives on their current work. The student participants will take part in all aspects of the conference; descriptions of their research projects will be published in the conference proceedings and posted on the conference web site.<br\/><br\/>Broader Impacts: This workshop will substantially increase participation in the Creativity & Cognition 2009 conference by young researchers pursuing graduate degrees in fields contributing to understanding creativity and cognition. The event will increase the exposure and visibility of these young researchers' ideas within the community. PhD and MFA students from all disciplines concerned with creativity and cognition will be encouraged to apply. Thus, links will be created across these disciplines, and a sense of community will be established among the next generation of researchers. In selecting the student participants, the PI and the members of the organizing committee will consider factors of institutional balance (e.g., ensuring that there are not too many students from one institution, and that institutions not normally represented are included), as well as diversity across traditionally underrepresented groups.","title":"ACM Creativity and Cognition Graduate Symposium","awardID":"0930677","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["563995"],"PO":["565227"]},"146545":{"abstract":"Virtualization technology is rapidly being adopted in modern cluster platforms that support performance-sensitive applications such as web services, real-time financial transactions, data mining, eScience, and E-commerce. State-of-the-art techniques for virtual machine (VM) scheduling, allocation, and migration often treat the VMs in isolation rather than within the context of other VMs and the cluster environment with which they constantly interact. This project investigates cluster-wide coordination mechanisms that exploit inter-VM and VM-cluster interactions to improve both application performance and cluster utilization. The research targets four specific directions: (1) improving timeliness across inter-VM interactions for time-sensitive applications, (2) virtualizing cluster-wide memory resources to support large memory and large dataset applications within VMs, (3) exploiting inter-VM dependencies to guide VM migration decisions, and (4) reducing network fabric contention through coordinated network access across VMs and virtual clusters. Broader impact of the project will be in the development of virtualization technologies that better support performance-sensitive applications in emerging data centers and high-performance computing clusters. Educational impact will be in training technology experts in virtualization, strengthening the experimental computer science curriculum at Binghamton University, and mentoring of undergraduate, minority, and high school students.","title":"CAREER: Coordination Mechanisms for Performance-aware Virtualization in Clusters","awardID":"0845832","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550962"],"PO":["535244"]},"147799":{"abstract":"The proposed project approaches the problem of library development by a fundamentally different approach -- one in which the knowledge abstractions at an appropriate level are represented and then this knowledge is converted into implementations optimized for different target platforms and circumstances. The primary intellectual merit here is the automation of high quality numerical code generation. <br\/><br\/>The broader impact is that abstraction driven automation for library developers can significantly cut down the \"software gap\" -- delay between development of new architectures and new software that maximizes its use. The impact of this will be broad across all disciplines that use HPC.","title":"Collaborative Research: Mechanical Transformation of Knowledge to Libraries","awardID":"0850680","effectiveDate":"2009-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["501334"],"PO":["565255"]},"158602":{"abstract":"This CISE Broadening Participation award provides funding for approximately eighty undergraduate and graduate students each year to attend the 2009 - 2011 Grace Hopper Celebration of Women in Computing. The Grace Hopper Celebration is designed to bring the research and career interests of women in computing to the forefront. Leading researchers present their current work and special sessions focus on the role of women in today's technology fields. NSF scholarship support allows students who could not otherwise attend to participate and become part of the broad Hopper community of young female computing professionals that is nurtured through the event.<br\/><br\/>The intellectual merit of this project lies in the access to the many technical presentations and researchers at the conference. In addition, students have the opportunity to participate in poster sessions and receive feedback from discipline specialists. The Grace Hopper Celebration provides a unique, supportive environment for intellectual discourse that is particularly appealing for women and other under-represented groups. <br\/><br\/>The broader impacts of this project deal with providing resources and support to students that will help them persist in their programs as well as access to avenues to continue through the IT workforce pipeline. Students who attend the Grace Hopper Celebration will be exposed to women who are creating, improving, and studying computer and information technologies who serve as role models and mentors. This travel scholarship support provides a unique opportunity to directly affect the careers of future computer scientists and increase the representation of women in computing.","title":"Undergraduate and Graduate Student Scholarship and Travel Grants for 2009-2011 Grace Hopper Celebration of Women in Computing","awardID":"0936346","effectiveDate":"2009-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["561154","529248","424014"],"PO":["564181"]},"156424":{"abstract":"This award supports the Visual Analytics Science and Technology (VAST) Challenge Workshop 2009. This workshop is bringing together individuals who participate in the VAST 2009 Challenge Competition taking place from February 2009 to July 2009 to present their results and discuss their experiences. <br\/><br\/>Research on visual analytics is very timely, and it is clearly attracting a lot of interest in the research community. VAST 2009 is expected to contribute to the following goals: (1) focus the community on working on useful and realistic visual analytics problems, (2) compare and contrast systems developed or used by the participants, and (3) gather lessons learned from testing novel methodologies and metrics for evaluation. <br\/><br\/>The workshop will bring visual analytics developers and evaluators together for a full day to present the results of the Challenge, and discuss lessons learned about evaluation. It will expose many researchers -- in particular students -- to the challenges of evaluating complex systems for use by analysts. <br\/>Papers summarizing the challenge and workshop results will be widely disseminated, including the VAST 2009 Website (http:\/\/www.cs.umd.edu\/hcil\/VASTchallenge09\/).","title":"Collaborative Research - Visual Analytics Science and Technology Challenge","awardID":"0925511","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7701","name":"DATA INTEROPERABILITY NETWORKS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["429576"],"PO":["563751"]},"146304":{"abstract":"0844850<br\/>Christine Julien<br\/>University of Texas at Austin<br\/>CAREER: Opportunistic Middleware for Delay-Tolerant Networks<br\/><br\/>Delay-tolerant networks are characterized by extreme unpredictability of connectivity due to disconnections between senders and receivers that often persist for long periods of time. This style of network has become increasingly important, largely due to emerging applications, such as enabling access to the Internet in remote areas, social networking, and mobile search and rescue. Existing solutions are generally tailored to very specific applications, instead of focusing on application properties in general. <br\/><br\/>Intellectual Merit. This project uses applications' common characteristics to drive the development of coordination support for delay-tolerant networks by simplifying application development and providing an expressiveness that enables new classes of fluid and responsive applications. The project begins by developing an understanding of coordination in delay-tolerant networks by developing a theory of temporally extended conversations among communicating parties. To support these conversations, the research also examines the creation of new communication protocols that adapt their behavior in response to changing conditions, enabling the communication infrastructure to continue to meet applications' requirements, even as the network's operating conditions change. To support this adaptation, the project develops new notions of context-awareness, or the ability to collect and interpret information about an application's environment. The project ties these three components together to create an adaptive middleware for delay-tolerant networks that provides a software support system that enables application developers to use simple constructs to create expressive coordinating applications. <br\/><br\/>Broader Impact. The project includes an education agenda that relies on these tangible applications for delay-tolerant networks to increase the accessibility of mobile computing to students and the public through hands-on demonstrations and course projects.","title":"CAREER: Opportunistic Middleware for Delay-Tolerant Networks","awardID":"0844850","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["527052"],"PO":["565090"]},"146326":{"abstract":"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).<br\/><br\/>Intellectual Merit<br\/>The research objective of this proposal is to develop a new regularization framework for effectively identifying molecular signatures under the following practical challenges: (a) small n large p data; (b) sparse signatures; (c) structured features; and (d) noisy features. Molecular profiling usually entails collection of a massive amount of features (i.e., large p) for only a small number of biological individuals (i.e., small n), and therefore identifying the underlying sparse signatures presents a task of finding a very few needles in a haystack. A regularized orthogonal-components regression framework is proposed to address these challenges for effective dimension reduction and thus signature identification. Traditional unsupervised dimension reduction can be used to exclude many features from constructed sparse signatures, but the false discovery rate can be very high. On the other hand, available supervised dimension reduction ignores the sparse nature of the underlying signatures. Furthermore, all these methods assume that the feature values are accurately measured, and do not incorporate functional relatedness of candidates. As a result, despite years of searching, only a handful of predictive bio-markers have advanced to general clinical practice. Clearly, more effective approaches are needed to realize the true potential of predictive molecular signatures. The main idea behind this approach is to construct properly regularized orthogonal components using generalized thresholding estimators which can be implemented by a Bayesian approach. Such a Bayesian implementation will provide a flexible structure for realizing different types of regularization. For example, a sparsity-oriented regularization (SORE) will provide sparse signatures, while a locality-oriented regularization (LORE) will be able to incorporate the structure of features (e.g. functional relatedness). Indeed, even the implementation with a simple SORE has certain ability to identify signatures with clustered features. Furthermore, the proposed framework is naturally enabled to integrate collinear or nearly collinear features. Such properties will make it possible to relieve the effects of measurement errors in observed feature values. Preliminary studies show that this new framework, even implemented with a very simple SORE, provides a clear and significant benefit to the general task of variable selection in the large p small n paradigm with clustered features. A simulation study demonstrated that it can reduce as much as 79% of the loss, and decrease the FDR from 41% to 9%. It confirmed the utility of the new method in molecular signature identification, thus indicating an enormous promise for its use in early disease detection, assessment of prognosis, measurement of drug efficacy, and eventually, personalized medicine. The full potential of the new framework, however, lies in providing breakthrough solutions to structured noisy features. <br\/><br\/>Broader Impacts<br\/>Molecular signatures are crucial for understanding complex biological systems. With the new regularization framework, development of signature identification methodologies will be carried out with applications to gene expression profiling, expression quantitative trait loci mapping, genome-wide association study and comparative metabolomics. This project will involve and train interdisciplinary graduate students in analyzing high-dimensional data. The research results will be disseminated through cceHUB, the web server of the multi-institutional Cancer Care Engineering project, to benefit research inside\/outside this community.","title":"CAREER: A New Regularization Framework for Identifying Composite Signatures","awardID":"0844945","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[390251],"PO":["543481"]},"149835":{"abstract":"Principal Investigator: Shapira, Asaf <br\/>Proposal Number: DMS - 0901355<br\/>Institution: GA Tech Research Corporation - GA Institute of Technology<br\/>Title: Extremal Problems in Combinatorics and Their Applications<br\/><br\/>This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).<br\/><br\/>The proposed research aims to study several fundamental problems in extremal combinatorics, many of them motivated by problems in theoretical computer science. One area of investigations is the relation between local and global properties of graphs, an area in which the PI has been conducting a systematic study of several major open problems in the past few years, and where several open problems have been resolved in collaboration with several other researches. We describe several open problem of this flavor related both to dense and sparse graphs, an area with many intriguing open problems, like the size of the smallest non-planar subgraph in a graph that is far from being planar. A second area of research is the theory of quasi-random graphs, where the PI has recently resolved, jointly with R. Yuster (Haifa U.), several open problems. We intend to work on some central problems that may also have some algorithmic applications. A third area is the study of Szemeredi's regularity lemma of graph and hypergraphs where the PI hopes to prove tight bounds on the size of the smallest regular partition in hypergraphs. Another area of research is additive number theory, where the PI has recently resolved an open problem related to the removal properties of sets of linear equations, and where the PI intends to work on problems like characterizing the linear equations that have nearly linear sized subset of the first n integers with no solution. Finally, another topic of recent investigation is purely algorithmic problems like understanding the true difference between computing shortest paths in directed and undirected graphs.<br\/><br\/>The problems suggested in this project proposal are related to problems that are currently being investigated by many researches in several areas of discrete mathematics like graph theory, extremal combinatorics, additive number theory and theoretical computer science. Therefore, the PI expects that the results and techniques that will be developed as a result of this project will have applications in several mathematical areas. Furthermore, as is explained in the main body of this proposal, many of the suggested problems are motivated by questions in computer science and have many interesting applications. Several of the results of the PI, which were obtained in recent years, appeared in leading computer science conferences and the PI intends to present the results which will be obtained as a result of this project so that they will be broadly disseminated. We also plan on developing graduate and undergraduate courses that will present the links between discrete mathematics and computer science that will emerge from the results covered by this proposal","title":"Extremal Problems in Combinatorics and Their Applications","awardID":"0901355","effectiveDate":"2009-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["565106",399364],"PO":["565280"]},"146469":{"abstract":"CNS - 0845552 <br\/>Loo, Boon Thau <br\/>University of Pennsylvania<br\/>CAREER: Towards a Unified Declarative Platform for Composable<br\/>Verifiable Networks<br\/><br\/>This research project investigates a declarative, composable and verifiable network infrastructure -- one capable of bridging between existing networks, stacking them in layers, dynamically changing the layers or bridges, and allowing for rapid extensibility with new functionalities. The proposed infrastructure utilizes declarative networking, a declarative, database-inspired extensible infrastructure that uses query languages to specify behavior. This approach provides the benefits of compactness, safety, composability, and the potential for correctness checks.<br\/>Intellectual Merit. The first contribution of the proposed research explores mechanisms for network composition where distinct parts or elements of existing networks are combined via declarative specifications to create a new network with new functionalities. The second contribution leverages the dynamic composition capabilities provided by the declarative framework and infrastructure to enable adaptable hybrid protocols, i.e. protocols built from combining several existing protocols based on changing application needs and network conditions. The third contribution explores a formal methodology towards verifying the properties of declarative networks and their compositions. Three verification techniques will be explored: static analysis of database query languages, theorem proving techniques that leverages declarative networking's connection to logic programs, and runtime verification.<br\/>Broader Impact. The education goal of this proposal is an integrated research and teaching program that emphasizes data-centric and formal methods approaches towards networking. The intellectual merit of this proposal is the development of a unified declarative framework for specifying, composing, formally verifying, and implementing networks. The broader impact of this proposal lies in the ability to enable and create new functionalities from the network diversity that technologies such as virtualization and overlays make possible.","title":"CAREER: Towards a Unified Declarative Platform for Composable Verifiable Networks","awardID":"0845552","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["518109"],"PO":["565090"]},"146217":{"abstract":"Abstract:<br\/><br\/>\"This award is funded under the American Recovery and Reinvestment Act of 2009<br\/>(Public Law 111-5).\"<br\/><br\/>Digital communication technology is central to the establishment and enhancement of global on-line communities. Increasingly, data networks convey delay-sensitive streaming content for voice, video, control, and interactive applications; data with characteristics for which networks have not traditionally been optimized. This project aims to rethink the fundamental architectures of digital communications to improve delivery of streaming data. The long-term potential is improved service at reduced cost, and broadened availability.<br\/><br\/><br\/>The central technical question is how feedback should best be used to transmit delay-sensitive data in real-world systems that are faced with resource-constrained and noisy feedback. While a fundamental principle of robust system design, the use of feedback in ensuring reliable communication has been limited to higher layers of the OSI stack. This project explores the performance improvements made possible by taking advantage of feedback at the physical-layer. The principal investigator (PI) has demonstrated how to exploit noisy feedback by shifting to an error-and-erasures perspective, utilizing identification codes on the reverse link, and making novel use of unequal error protection. The result is a massive reduction in bit-error rate and delay. This project will address new scenarios (e.g., wireless fading, multiuser networks, interaction with queuing) to develop architectural insights, appropriate classes of error correcting codes, and improved network protocols.<br\/><br\/><br\/>This work will be incorporated into courses at UW Madison including coding theory, information theory, and the undergraduate course \"Introduction to Society?s Engineering Grand Challenges\". The PI and his research team are also involved in high-school STEM outreach through the UW Engineering Summer Program. Translation to practice will be hastened through the PI?s existing industrial collaborations.","title":"CAREER: Error-control for Streaming Media: Architecture, Code Design, and Noisy Feedback","awardID":"0844539","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7937","name":"NETWORK CODING AND INFO THEORY"}}],"PIcoPI":["517551"],"PO":["564924"]},"153851":{"abstract":"Quantum physics has been applied to study problems in computing complexity in recent years, which has become a new frontier in computer science. Computer hardware that is operated according to the laws of quantum mechanics can realize novel quantum protocols and bring enormous speed-up for certain computationally hard problems. The key issue in implementing such hardware is in achieving highly accurate and fast control on the quantum logic elements so that they can beat the hazardous effects from the environmental noise. For solid-state quantum processors, including superconducting systems and semiconductor systems, such control is usually achieved via adjustable local parameters, where careful designing of the circuit and the connections to external sources are required. In this project, a quantum global mode will be exploited to achieve efficient implementation of the quantum protocols. Here, the quantum global mode is the microwave photon mode in a nanoscale quantum resonator that has millimeter wavelength, can couple with multiple quantum logic elements simultaneously, and has demonstrated microsecond quantum coherence times. Meanwhile, the global mode will also be considered as a probe to measure quantum entanglement and quantum coherence effects in the solid-state quantum processors. Two questions will be studied in this project. First, solid-state quantum simulators that can emulate quantum many-body systems involving arrays of solid-state elements will be studied, where the global quantum mode will act as a control as well as a detector of the quantum phase transitions in the simulators. Second, a universal quantum computer of spurious two-level fluctuators in the superconducting system will be studied where the global mode can provide individual control, effective coupling, and readout of the fluctuator states. Both the hardware aspect and the software aspect will be investigated.","title":"SHF: Small: Global Manipulation in Solid-State Quantum Information Processing - Protocols and Implementation","awardID":"0916303","effectiveDate":"2009-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7948","name":"QUANTUM COMMUNICATION"}}],"PIcoPI":["433468"],"PO":["565157"]},"158804":{"abstract":"The International Symposium on Computer Architecture (ISCA) is a premier forum for presenting, discussing and debating new and innovative architectural ideas and techniques for advanced computing and communication systems. This symposium brings together researchers in fields related to processor architecture, compilers, chips and systems, for technical exchange on current areas of architectural challenge. This proposal aims to support this highly regarded conference by obtaining travel support for students in order to defray the costs of attending and participating in the ISCA conference in June, 2009 in Austin, TX. <br\/><br\/>The PIs propose to provide travel support in the approximate amount of $15,000 for around 40 U.S.-based student (at least $300 each). The vast majority of the awards will be granted to Ph.D. students. Priority will be granted to students who have authored papers accepted for presentation at the conference or its joint workshops, in particular those students without existing travel support.","title":"Support for the 36th International Symposium on Computer Architecture (ISCA), June 9, 2009, Austin, TX","awardID":"0937476","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["534424"],"PO":["565272"]},"157539":{"abstract":"Although Constraint Programming (CP) plays an increasingly important role in optimization and modeling, very few U.S. universities offer training in the field. In particular, there is limited awareness in the U.S. operations research (OR) community of the benefits of combining OR and CP, even though several commercial and non-commercial solvers now make it possible to do so. A tutorial is therefore designed for AI and particularly OR people who want to learn what CP is all about. It presupposes no background in CP. Top people in the field will serve as instructors. This grant provides financial support to PhD students who want to attend the tutorial, and provides modest support for instructor participation. The CP tutorial takes place on May 27-28, 2009 and precedes the main conference, CPAIOR on 29-31 May, 2009 at the Tepper School of Business, Carnegie Mellon University (http:\/\/web.tepper.cmu.edu\/CPAIOR09). The tutorial represents a valuable integration of research and education, and the tutorial and conference are likely to increase the visibility of constraint programming (CP) in the United States.","title":"Constraint Programming Tutorial","awardID":"0930158","effectiveDate":"2009-06-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["492978"],"PO":["460643"]},"150521":{"abstract":"Complex fluids are abundant in many industrial applications, e.g., emulsions and foams, and commonly found in biology, e.g., blood and synovial fluid. These materials exhibit rich dynamic macroscopic behavior that stems from the interplay between microstructure distortion by external forcing (flow) and microstructure relaxation by intrinsic mechanisms as in polymer recoiling or cell shape relaxation. Understanding the microscale physics remains a major open research problem. The non-equilibrium dynamics of soft- and bio-materials is arguably one of the biggest questions in biophysics. The international summer school 'Complex- and Bio-Fluids' will provide a forum for discussion about the challenges and approaches in modeling flows of soft materials. Moreover, it will foster interactions between different disciplines (physics, engineering, applied mathematics, computer science, biology and medical science) as well as different generations (expert senior scientists and students). This award will provide travel support for the future expert senior scientists.","title":"Proposal for travel support for students and young researchers to attend the Summer School on \"Complex- and Bio- Fluids\", June, 2009, Corsica, France.","awardID":"0903743","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7246","name":"PHYSICS OF LIVING SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}}],"PIcoPI":["523809"],"PO":["525323"]},"146617":{"abstract":"In order to cope with time-varying input characteristics and demand for upgradability in new-generation communication systems and multimedia applications, embedded systems are being driven to provide tremendous flexibility through extensive configurations. Hence, along with performance, power, and reliability requirements, embedded systems now require hardware reconfiguration and self-adaptive system methodologies. In order to provide an effective, affordable, and seamless (from the application layer) transition from one configuration to another, system synthesis plays a crucial role. To achieve this, there is a need for the right balance between static compilation and dynamic configuration management. This project develops adaptivity-driven system synthesis tools coupled with a dynamic configuration management layer for adaptive embedded system with hardware configuration support. The research focuses on design of novel algorithms and optimization methods for design tools supporting self-adaptive systems. This project 1) develops holistic task scheduling and resource management methods which are adaptive-aware and consider the reconfiguration overhead, 2)develops system level layout planning for resource upgradability and configuration sequence awareness, and 3)develops efficient dynamic design making methods for configuration management layer which evokes the right configuration based on the current system state. The broader impact of this research is that the developed design tools can be deployed in future self-adaptive systems for software-defined radio and multimedia applications where programmability and flexibility are as crucial as computation power. The PI plans to develop new courses, recruit under-represented groups into her research, and facilitate outreach to other researchers and industry by providing online access to the developed design tools.","title":"CAREER: System Synthesis for Self-adaptive Reconfigurable Embedded Systems","awardID":"0846129","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[390859],"PO":["561889"]},"163942":{"abstract":"CCF-0811518<br\/>Blended Static\/Dynamic Analysis for Performance Understanding and <br\/>Improved Security of Framework-intensive Applications<br\/>Barbara G. Ryder<br\/><br\/>Web applications built on numerous layers of frameworks are in wide usage by the commercial and research communities, and present a challenge to existing analysis techniques. Purely static analyses suffer problems of insufficient scalability and\/or insufficient precision for answering behavioral questions. Purely dynamic analyses introduce too much overhead in production systems, or are too limited in the information gathered. Further, while existing dynamic performance analyses focus on control flow, the main purpose of these web applications is to manipulate data. This proposal addresses these weaknesses by blending static and dynamic analyses in new ways that avoid these problems and support tools for framework-intensive applications. The intellectual challenge is to advance the state-of-the-art in program analysis by developing analyses of practical cost and of sufficient precision to scale up to industrial-strength framework-intensive software.<br\/><br\/>The research will address two specific sub goals: (i) the design of and experimentation with blended analyses that identify performance problems in framework-based applications, (e.g., excessive use of temporary data structures), and (ii) the development of a blended analysis to refine current access control analyses for framework-intensive software.","title":"CPA-SEL: Blended Static\/Dynamic Analyses for Performance Understanding and Improved Security of Framework-intensive Applications","awardID":"0964870","effectiveDate":"2009-06-10","expirationDate":"2014-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[438877],"PO":["564388"]},"161676":{"abstract":"Error-correcting codes, studied in a branch of science and engineering known as coding theory, safeguard data against the adverse effects of noise and enable reliable storage and communication of information. Such codes pervade our daily lives, with applications ranging from computer hard-disks and UPS bar-codes to cell phones and the Internet to deep space communication. One of the most fundamental questions in coding theory is the following: What is the largest possible fraction of errors that a code of information rate R can correct? Recent theoretical breakthroughs provide a complete answer to this question, namely that the ultimate error-correction radius of 1-R can be reached (by codes over sufficiently large alphabets). Moreover, it can be reached constructively with polynomial-time list decoding, via codes closely related to Reed-Solomon codes, which are ubiquitous in practice.<br\/><br\/>From a practical standpoint, this promises a factor of two improvement over classical error-correction algorithms that are in widespread use today. While this is extremely encouraging, numerous challenges must be overcome in order to bring the theoretical promise of the recent results to practice. This project, led by a multi-disciplinary team, involves an integrated collection of research activities targeted at progress towards the long term goal of attaining the fundamental limit of error-correction. At the theoretical end, the goals include improving the complexity of the decoding algorithms as one approaches the optimal error-correction radius of 1-R, and devising faster algorithms and heuristics for the key steps involved in algebraic list decoding. The project also studies methods to reap the practical benefits of combining the new codes with soft-decision decoding, putting to use the ample amount of probabilistic symbol reliability estimates often available to decoders. Furthermore, the research lays the groundwork for eventual implementation of such algorithms in high-speed\/low-power VLSI, thereby enabling the potential deployment of the new codes in a broad range of communication and storage systems. On the education front, the project provides a stimulating research environment for graduate students, encouraging team-work across university boundaries and collaboration across disciplines (computer science, communication theory, and VLSI design).","title":"Collaborative Research: CDI-Type I: Realizing the Ultimate Potential of List Error-Correction: Theory, Practice, and Applications","awardID":"0953155","effectiveDate":"2009-06-15","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7750","name":"CDI TYPE I"}}],"PIcoPI":["485293"],"PO":["565157"]},"153867":{"abstract":"Quantum computers offer the potential to exponentially speed up the solution of certain classically hard computational problems. It is already known, for example, that quantum computers can efficiently factor numbers (something modern computers cannot do), and this fact implies that quantum computers can break the majority of cryptographic systems which protect our nation's cyber-infrastructure. The quantum factoring algorithm is the main motivation behind current research into actually building a quantum computer. In this grant, the investigator proposes a new approach to efficiently solving a computational problem--the graph isomorphism problem--which might also admit an exponential speedup over the best classical algorithm for the problem. The graph isomorphism problem is to tell whether two given graphs (a collection of vertices with edges connecting them) can be made to look identical to each other by permuting the different vertices. The approach taken here is different from that taken by the majority of the quantum algorithms community and centers on a novel class of quantum random walks, those in which the walkers carry topological quantum numbers. This approach follows from a series of failed proposals to graph isomorphism based on random walks by hard-core bosons or fermions and is motivated by the form in which these proposals fail. Finding an efficient quantum algorithm for the graph isomorphism problem would be potentially transformative and would provide a major new justification for building a large quantum computer. The approach chosen by the PI also introduces a novel quantum algorithm technique--quantum random walks by anyons--which has the potential to be useful a primitive outside of the graph isomorphism problem. Finally, the award will be used to support the training of graduate students who work on the boundary between computer science and physics, and thus strengthen connections across this interdisciplinary divide.","title":"AF: Small: Graph Isomorphism and Quantum Random Walks by Anyons","awardID":"0916400","effectiveDate":"2009-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}}],"PIcoPI":["517581","483594","499728","499728"],"PO":["565157"]},"153758":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009<br\/>(Public Law 111-5).\"<br\/><br\/><br\/>Optical Diffusion Tomography, with Application to In Vivo Fluorescence Resonance Energy Transfer Imaging <br\/><br\/>Kevin Webb, Purdue University<br\/><br\/>Optical sensing and imaging will continue to become more important for in vivo medicine. In most cases, light can be modeled with a diffusion equation, and the reconstruction of images based on this model is the basis of optical diffusion tomography (ODT). Enhanced contrast can be achieved with targeting of a fluorophore to cancer cells, for example, and targeted anti-cancer drugs can be delivered. Another molecular imaging opportunity involves fluorescence resonance energy transfer (FRET) parameters. FRET has proved to be of immense value in the study of chemical transport into cells and the underlying cause of disease, and by coupling to ODT (FRET-ODT), there is the opportunity to transfer this knowledge to in vivo studies. While substantial progress has been made in various ODT modalities, the achievable resolution and the computational burden impede effective applications. More efficient imaging strategies are thus essential. <br\/><br\/>This research involves the development of a method for deep tissue imaging of FRET parameters (FRET-ODT) and fast, accurate and robust methods for optical diffusion tomography. The recent demonstration by the Webb group that it is possible to image FRET parameters using heavily scattered light is being expanded into a method for imaging FRET in vivo. This involves a solution for the intramolecular FRET parameters with both rigid and flexible linkers that are incorporated as unknown sources in a diffusion equation representation for the donor fluorescence. Multigrid algorithms are being developed and applied to fluorescence imaging and FRET-ODT. A model-based non-iterative image reconstruction method, that has proved to substantially reduce computation time in preliminary studies, is being applied to image FRET kinetic parameters.","title":"CIF: Small: Optical Diffusion Tomography, with Application to in Vivo Fluorescence Resonance Energy Transfer Imaging","awardID":"0915966","effectiveDate":"2009-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["518523"],"PO":["564898"]},"160237":{"abstract":"This research involves one of the key challenges in wireless networks: how <br\/>to take advantage of new advances at the physical layer to push for new <br\/>design at the upper layers. The approach used is hitchhiking-based cooperative <br\/>communication (CC) that takes advantage of the physical layer design that <br\/>facilitates the combining of partial information. A node can receive several <br\/>partial signals and combine these signals to retrieve the complete signal. <br\/>Through effective use of partial signals, a packet can be delivered with fewer <br\/>nodes and\/or less transmission power at each node. The investigator proposes <br\/>a new weighted graph model that can capture the nature of CC. One key concept <br\/>proposed is the new notion of ?link? and ?path? on which other graph <br\/>terminologies can be defined.<br\/><br\/>Based on this new graph model, the research focuses on two types of <br\/>power-efficient design under CC: (1) Power saving protocols that put wireless <br\/>nodes into periodical sleep states while maintaining global ?domination? of <br\/>active nodes. (2) Power control for transmission energy consumption by <br\/>adjusting transmission ranges while maintaining global ?connectivity?. <br\/>With these, this research presents a promising and unique way of applying this <br\/>graph model to energy-efficient design in wireless networks. This research also <br\/>involves the design of a general methodology of localized solutions and applies <br\/>it to address various energy-related optimization problems under CC. The central <br\/>theme of this research fits well with the objective of the SING program on <br\/>fundamental theoretical and algorithmic studies involving coordination and <br\/>communication. The insights and results of this research are expected to <br\/>provide guidelines for energy-efficiency for a wide range of wireless network <br\/>applications.","title":"TF-SING: Energy-Efficient Design in Wireless Networks Using Cooperative Communication","awardID":"0945245","effectiveDate":"2009-06-10","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["7594"],"PO":["564924"]},"163416":{"abstract":"Proposal Number: 0850898<br\/>PI: John Doyle <br\/>Institution: University of Pennsylvania<br\/><br\/>The top level goal of this project is to advance the developing relationship between \"network science\" and \"network design\" by contributing to the development of a cross-cutting research agenda in these areas. For this purpose workshops and tutorials will be organized. Critical issues, open questions, and research challenges in the topic areas of (i) the state of network science, (ii) the relationship between network science, other theories, and network design, and (iii) identifying and enabling new research methodologies and tools for the filed, will be carefully examined. The potential of this project is to not only connect diverse and previously fragmented mathematical and application domains but newly integrate both education and research based on the theoretical insights themselves, creating layered real and virtual organizations with greater scope and evolvability. The success of this project should be both immediate and long-lasting, from practical network architecture design in all areas of engineering, to providing a much-needed conceptual framework for systems and synthetic biology, to radically transforming and unifying the teaching of systems and complexity.","title":"Planning Future Research in Network Science and Engineering","awardID":"0962520","effectiveDate":"2009-06-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["490256"],"PO":["557315"]},"147819":{"abstract":"The proposed project approaches the problem of library development by a fundamentally different approach -- one in which the knowledge abstractions at an appropriate level are represented and then this knowledge is converted into implementations optimized for different target platforms and circumstances. The primary intellectual merit here is the automation of high quality numerical code generation.<br\/><br\/>The broader impact is that abstraction driven automation for library developers can significantly cut down the \"software gap\" -- delay between development of new architectures and new software that maximizes its use. The impact of this will be broad across all disciplines that use HPC.","title":"Collaborative Research: Mechanical Transformation of Knowledge to Libraries","awardID":"0850750","effectiveDate":"2009-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["556801","496821","501527"],"PO":["565255"]},"143903":{"abstract":"A six-week-long research workshop on Intelligent Information Systems (IIS) is being held at Johns Hopkins University on Machine Learning for Language Engineering. It strives for cross-fertilization with other areas of machine intelligence. The workshop has diverse teams of professionals and students engaged in an intensive effort to advance the state of science.<br\/>Language Engineering encompasses speech recognition, machine translation, information retrieval and extraction, etc., and shares fundamental Machine Learning techniques with other fields within IIS, most notably computer vision, medical- and bio-informatics and social network analysis.<br\/>The goal of the workshop is to advance machine learning for IIS and to attract students to the field and initiate them in research by working alongside senior scientists.<br\/>For projects to address relevant problems, an open call for proposals was issued to the IIS community. The (35) received proposals were evaluated at a planning meeting (attended by project proponents, government representatives, and experts from related fields) which chose the specific projects, their research leaders and many senior participants. The graduate students were selected according to their known performance, the undergraduates through a national search.<br\/>The workshop will disseminate its results and help incorporate them into research at geographically diverse institutions. The five past workshops resulted in 80 publications in premier journals and conferences. Some of the work was initiated in the workshops and completed after their conclusion. <br\/>Individuals from several institutions are conducting collaborative research in this workshop, discovering new techniques, creating and disseminating valuable tools and establishing long-lasting collaborations. Graduate as well as undergraduate students are being initiated into the IIS field.","title":"Cross-Cutting Research Workshops in Intelligent Information Systems","awardID":"0833652","effectiveDate":"2009-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J227","name":"National Security Agency"}}],"PIcoPI":["521190","531055","445172","445173","438772"],"PO":["565215"]},"148054":{"abstract":"This award provides funding for a new Research Experiences for Undergraduates site at the Center for Embedded Networked Sensing (CENS). CENS is a multidisciplinary research center focused on developing embedded networked sensing technology and applying the revolutionary technology to critical scientific and social applications. The Center provides a proven, thoughtful, and organized environment for 10 undergraduates to conduct authentic research and become members of a highly collaborative intellectual community. All of the projects are connected through the common theme of using sensing technology for sustainability. The research projects focus on developing the SensorKit resource for applications related to resource sustainability. The summer experience includes mentoring, professional development, social events, and a special summer ethics program funded by the Directorate for Social, Behavioral, and Economic Sciences.<br\/><br\/>The intellectual merit of this project lies in the strong research environment and research team. SensorKit related projects should engage the participating undergraduates in research focused on monitoring factors important in urban sustainability, such as electricity, water, waste, traffic, building and parking occupancy, and public transport usage patterns. In addition to increasing the students' skills, knowledge base, and preparation for future studies, the project has the potential to contribute to research breakthroughs with scientific, environmental, and social relevance.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly women and students from underrepresented groups. The participating faculty members are committed to including under-represented minority students in their research. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site at the Center for Embedded Networked Sensing: Sense and Sustainability","awardID":"0851698","effectiveDate":"2009-06-15","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7603","name":"SCIENCE, TECH & SOCIETY"}}],"PIcoPI":["539241","513807"],"PO":["564181"]},"159065":{"abstract":"This award funds a workshop for principal investigators (PIs) supported by NetSE-FIND grants to meet, present their work, and facilitate future collaboration by providing a workshop environment in which to identify important open problems for future research. The NetSE-FIND programmatic area is distinctive from many other NSF activities, both in its technical emphasis and its approach to research. NetSE-FIND seeks to involve the research community in a collective exploration of what the Internet of 15 years from now should be. This effort requires a long-range perspective, the invention of new concepts not fettered by the constraints of today?s networks, an understanding of the larger social, economic and legal issues that arise from the interplay between the Internet and society, and a willingness to collaborate on larger visions that build on the ideas developed in individual research grants. Because of the value that NetSE-FIND places on integration and collaboration, it is important that PIs working on the parts of the program have opportunities to meet and discuss objectives, approaches and opportunities. NetSE-FIND has held five prior meetings for NetSE-FIND PIs, as well as others associated with this effort.<br\/><br\/>Intellectual merit<br\/>The agenda of this workshop has been centered on exploring the work that has been done in the NetSE-FIND programmatic area and the identification and discussion of open questions?aspects of a future network that are not yet being explored elsewhere. Investigators will present their work, and a set of invited external observers will provide their impressions of the NetSE-FIND activities to NSF. Through this process the research agenda can be sharpened and focused on important issues.<br\/><br\/>Broader impact<br\/>The workshop will further the objectives of the NetSE-FIND activities, which is an important part of the NSF networking agenda. The workshop will also allow investigators to discover opportunities for collaboration and the incorporation of research results across different grants. The slides from the presentations will be posted to the public FIND web site www.nets-find.net, where present and potential NetSE-FIND participants can use them to further their understanding of the NetSE-FIND effort.","title":"Workshop: NSF FIND Workshop","awardID":"0939080","effectiveDate":"2009-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["565000"],"PO":["565090"]},"159340":{"abstract":"The ACM SIGMETRICS\/Performance 2009 Conference will be held in Seattle, WA, from June 15-19, 2009. Sigmetrics brings together 150 or more professionals from academic and industrial backgrounds in what has become a premier forum for discussing the development and application of state-of-the-art, broadly applicable analytic, simulation, and measurement-based performance evaluation techniques. There are several workshops and student activities also being organized along with Sigmetrics 2009 including:<br\/>? Student Thesis Panel that provides a live forum for students to promote and get feedback on their work, exchange research experiences, and interact with established researchers,<br\/>? Demo Competition to communicate research ideas in a live, interactive forum, and<br\/>? Industrial Information Session that would provide students a communication channel to interact with industrial researchers and learn more about their cutting-edge work. This proposal requests funding to support the conference registration and travel-related costs of 6 graduate students from the U.S. Participation in leading conferences is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work.<br\/>Intellectual Merit: The Sigmetrics conference emphasizes both innovative research and quantified or illuminating experience. Sigmetrics 2009 seeks to present innovative, exciting work related to all aspects of performance, including speed and scalability as well as reliability, availability, and<br\/>manageability of systems. Contributions containing highly original ideas, new approaches, and\/or groundbreaking results are particularly encouraged. There will also be a poster session for the presentation of promising preliminary work.<br\/>Broader Impact: The support requested in this proposal will make possible the participation of students who would otherwise be unable to attend. Particular attention will be paid to directing support towards under-represented minorities including women, African-Americans, Hispanics, Native Americans, and Native Pacific Islanders. The support will provide students who attend<br\/>with the opportunity to interact with mentors and peers of varying sex, ethnicity and background.","title":"Student Travel Support for SIGMETRICS 2009","awardID":"0940701","effectiveDate":"2009-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["543510"],"PO":["493916"]},"158076":{"abstract":"This proposal requests NSF support to assist students in attending the 2009<br\/>International Symposium on Code Generation and Optimization (CGO 2009). CGO<br\/>provides a premier venue to bring together researchers and practitioners working<br\/>on feedback directed optimization and backend compilation techniques. The<br\/>symposium covers compilation for parallelism, performance, power, and security.<br\/>This support will broaden participation in CGO by subsidizing the travel for participants who might not otherwise travel to attend CGO. The funds will be used solely to provide travel support for students from US universities.","title":"WORKSHOP: Code Generation and Optimization (CGO) 2009 Student Travel Support, March 22-25, 2009 in Seattle, WA","awardID":"0934024","effectiveDate":"2009-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["558848"],"PO":["565272"]},"158550":{"abstract":"A wireless summer school workshop is to be held on the campus of the University of Illinois at Urbana-Champaign (UIUC) for one week in August 2009. Wireless communications and networking has been a topic of intense research activity in recent years. There is a general consensus that cross-layer design of protocols would help improve wireless network performance. With the goal of facilitating cross-layer research, the topics of the lectures at the summer school workshop are chosen to provide the attendees exposure to developments in theory, practice, physical layer, and higher layers.<br\/><br\/>The summer school workshop will provide an opportunity for undergraduate and graduate students to gain a better understanding of a broad range of issues that affect the design of wireless systems. Attendance at the workshop by women and minority students will be encouraged. It is expected that the summer school workshop will improve the quality of future research output by the graduate students. Attendance at the summer school will also help the undergraduate<br\/>students gain a better understanding of the research challenges in the area of wireless systems and to motivate them for higher studies. The interactions between the attendees at the symposium may also lead to future collaborations between different attendees.","title":"Wireless Summer School Workshop","awardID":"0936055","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553537"],"PO":["564777"]},"157483":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for about 10-14 promising graduate students, along with a panel of 4-5 distinguished research faculty mentors, which will take place in conjunction with the 2009 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC 2009), to be held September 20-24, 2009, in Corvallis, Oregon, and sponsored by the IEEE Computer Society. The long-running VL\/HCC series occupies a unique niche among HCI and Programming Language conferences, in that it focuses specifically on how to help humans successfully develop and use software. The diversity and ubiquity of people's goals, interactions, and concerns with information systems is continually increasing. Not only does interactive computer software permeate many individuals' working lives, people commonly rely on computing and information systems for leisure and home activities as well. As a result, end users now expect considerable flexibility and control in their interactions with computer software. For many, it is no longer sufficient to consume the packaged software and scripted tasks developed by the professional software industry; they now must produce their own computational solutions to a wide variety of problems, including spreadsheet models, web sites, educational media and simulations, automated business procedures, and visualizations. To produce such software, even for domain-specific problems, end users must look beyond surface-level interaction with computers and acquire the conceptual models and skills of computational thinking. But current advances toward computational thinking by end users are not evenly distributed across all segments of the population. Thus, this year's VL\/HCC Doctoral Consortium, the seventh to be funded by NSF in this series, will focus on expanding the benefits of computational thinking to diverse populations. Ensuring that designers of computational languages and tools consider the needs of populations historically overlooked in information technology will increase the chance that these individuals\/groups are able to learn and use the more powerful tools that are fast becoming essential to information literacy. At the same time, such efforts may lead researchers to identify new software construction metaphors and techniques that increase the usability of their languages and environments more generally. The workshop's primary goal is to stimulate graduate students' and other researchers' thinking about how varying communication media, representations, and problem-solving support affect end users' willingness and ability to access, manipulate, and program solutions to their work or everyday problems. What are the special needs of disadvantaged populations? How can computational problem-solving tools and devices be designed to meet these needs? The workshop will bring together and build community among young researchers working on different aspects of these problems from the perspectives of diverse fields including computer science, the social sciences, and education. It will guide the work of these new researchers by providing an opportunity for experts in the research field (as well as their peers) to give them advice, in that student participants will make formal presentations of their work during the workshop and will receive feedback from a faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether the results are appropriately analyzed and presented. As in prior years the VL\/HCC 2009 Doctoral Consortium will be part of the regular conference program. A 2-page extended abstract of each participant's work will be published in the conference proceedings. <br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other. The PI and the members of the organizing committee will make special efforts to attract a diverse and interdisciplinary group of student participants, with special attention paid to recruitment of minorities and females. The PI expects that most of the students supported by this award will come from U.S. universities but as in past years, due to the highly international make-up of the research community, a few non-U.S. students may be invited to participate as well.","title":"WORKSHOP: VL\/HCC'09 Doctoral Consortium: Democratizing Access to Computational Tools","awardID":"0929989","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["548140"],"PO":["565227"]},"157296":{"abstract":"The purpose of this travel grant is to support 10-12 graduate students from the United States, particularly those from underrepresented groups and institutions that traditionally lack funding for such support, to attend the 10th IEEE International Symposium on World of Wireless, Mobile and Multimedia Networking (WoWMoM 2009) that will be held in Kos, Greece, from June 15 to June 18, 2009. Since its inception, WoWMoM has been a high quality conference and the premier technical forum dedicated to addressing both the theoretical and real-world challenges in wireless mobile multimedia networking. This grant provides an opportunity for the students to be exposed to the cutting research in the field of wireless multimedia networking, and to interact with peers and leading researchers from other institutions. The participation of deserving students in WoWMoM will not only help their future careers but also will positively affect the future of the research in wireless multimedia networks.<br\/><br\/>The student selection process will consider the following: 1) students from groups traditionally underrepresented; 2) students from universities that traditionally lack funding to support graduate student attendance at conferences; and 3) students who will present their papers during the conference. Priority will be given to the graduate students from underrepresented groups, such as women, African American, Hispanics, and Native American students, and from universities that lack financial resources.","title":"IEEE WoWMoM 2009 Student Travel Support","awardID":"0929124","effectiveDate":"2009-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7939","name":"WIRELESS COMM & SIGNAL PROCESS"}}],"PIcoPI":["431172"],"PO":["432103"]},"148144":{"abstract":"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5). <br\/><br\/>The security and economic well-being of our society rests upon the trustworthiness of a vast complex of networked information systems that provide communications, computing, and control to manage our nation?s critical infrastructure systems (power, transportation, aerospace, telecommunications, health care, emergency response, banking, finance, and e-commerce). These critical infrastructure systems face enormous threats to their operation not only from malicious attacks, but also from their very nature as extremely complex, interconnected, and interdependent systems. The proposed summer REU site, at the Information Trust Institute (ITI), University of Illinois at Urbana-Champaign, advances knowledge about techniques for analyzing and improving the security, reliability, and safety of networked information systems. <br\/><br\/>Intellectual Merit: This site has extensive computing resources and includes a team of senior investigators who have previous experience in collaborating with undergraduates in research projects. This effort is based upon projects in two prior highly successful summer undergraduate research internship programs that have resulted in co-authored publications. The topics of research are timely and address the important computing research problem of protecting networked information systems.<br\/><br\/>Broader Impacts. A diverse group of undergraduates is learning how to conduct research and is becoming prepared to pursue graduate studies. The research teams include women and underrepresented minorities. Domestic students in this program are interacting with otherwise supported international students through their research projects and through ethics sessions. Graduate student mentors are learning mentoring skills. The educational effectiveness of the summer program, the ethics sessions, and the mentoring experiences are being assessed. The results of the assessments will be presented at conferences on computer science education and on engineering education.","title":"REU Site: Summer Undergraduate Research Internship Program at the Information Trust Institute","awardID":"0851957","effectiveDate":"2009-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["497959","559650"],"PO":["564181"]},"154272":{"abstract":"This workshop will explore a range of issues related to new and emerging technologies for advanced research for imaging related to capturing, digitizing and analyzing historical objects. These include historical documents, visual images, and three-dimensional (3D) artifacts, many of which are to be found in widely-scattered collections and having restricted accessibility. By digitizing historical objects, critical attributes are both preserved and at the same time enable studies that are impossible with the traditional approaches. Such studies might have been impossible up to now either because a research question requires study of large quantities of data preserved in collections around the world or because the study wishes to examine details invisible to the human eye, such as the remains of erased texts preserved in palimpsests, miniature scripts on cylinder seals, etc. or patterns that are hard to compare objectively (e.g., patterns of quilt images). A team at the University of Illinois, Urbana-Champaign and the National Center for Supercomputing Applications organize and convene the event in collaboration and with support from the Humanities, Arts, Science, and Technology Advanced Collaboratory (HASTAC).","title":"Imaging and Image Analyses Applied to Historical Objects","awardID":"0917833","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["473994",410514],"PO":["433760"]},"158430":{"abstract":"The project supports graduate student participation in the 26th International Conference on Machine Learning (ICML 2009). Specifically, the project supports travel to the conference for those who might not otherwise be able to attend for financial reasons and organizes a student poster-presentation program that will facilitate one-on-one discussions and other mentoring with the world's leading researchers in machine learning. Students will be exposed to state-of-the-art work by other researchers and will have the opportunity to attend tutorials on material that is not taught at their home institutions. Participating students will receive feedback from senior researchers beyond their institutional and national boundaries. Furthermore, participation in the poster session and conference will help integrate these students into the research community and represents a natural integration of research and education.","title":"Student Poster Program and Travel Scholarships for International Conference on Machine Learning (ICML) 2009","awardID":"0935087","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518332"],"PO":["564316"]},"146231":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\"<br\/><br\/>The aging U.S. population is expected to place unprecedented strains on the country?s health care system. To mitigate this, there is growing industry interest towards home-centered approaches to health care. Leveraging technology advances is seen as one of the primary enablers of the home-care paradigm. To this end, this project is investigating the development of smart wheelchair technologies. There are three significant technical components. The first is<br\/>the use of large-scale, three-dimensional maps to support accurate wheelchair localization in outdoor, urban environments even in the absence of reliable GPS measurements. This is accomplished through automated synthesis of map models a priori to locate stable, robust landmark features that the wheelchair can use at runtime. The motivation is that by leveraging maps generated from high fidelity\/cost sensor systems, lower-cost service robots gain many of the benefits of these sensors but without the cost. This is critical for the technology to be commercially viable in the future. The second is an optimization-based framework for motion planning in crowds that will enable the smart wheelchair to maneuver safely in the presence of large numbers of pedestrians and static\/dynamic obstacles. This approach builds upon recent advances in convex optimization theory, and explicitly integrates higher-level models of wheelchair-pedestrian dynamics through interactive control functions to improve navigation performance. Finally, there is a significant development and test component planned through a collaboration with Good Shepherd Rehabilitation Hospital in Allentown, PA. This will provide critical service provider and end user input into system development.","title":"CAREER: Towards Autonomous Wheelchair Systems in Urban Environments","awardID":"0844585","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["475316"],"PO":["562760"]},"146594":{"abstract":"This award is funded under the American Recovery and Reinvestment Act of 2009<br\/>(Public Law 111-5).<br\/><br\/>As computers become more powerful, the limiting factor for building software systems is shifting away from the underlying computer's performance limitations to the software's inherent complexity. One way to cope with this complexity is to use software contracts to separate a large system into smaller chunks, thereby enabling programmers to focus their energy on just one small part of the system at a time. A key feature of this separation is the ability to assign blame; that is, when the software system fails, a contract checker can use the contracts to identify a single sub-system as faulty, automatically narrowing the search for the underlying cause of the failure to that one subsystem or possibly its contract; of course, fixing a bug in a contract may yet expose latent bugs in other subsystems but in each case the contract system will help the programmer identify the failure. Even better, software contracts are typically written in a language that is very close to the programming language, meaning that programmers only have to invest a little bit of their time and resources in order to start seeing the benefits of contracts.<br\/><br\/>This work promises to improve the state of the art in contract checking. Specifically, the PI will study the interaction between statically and dynamically verified portions of systems, in a manner similar to hybrid and gradual types. Building on this integration, the PI will also study how to integrate theorem provers into software systems in a way that the theorem prover's scope can be limited to just the most mission-critical parts of the system. The PI will also study how to add contracts to more sophisticated modularity mechanisms like traits and the ML module system, and explore how contracts can help generalize existing techniques for automatic test case and test oracle generation to support higher-order functions and unknown classes. All the while, the PI will ensure that these new techniques are practically viable by using them in a 500,000 line software system that the he maintains, as well as conducting detailed studies of how contracts are used in other settings, including JML and Eiffel.","title":"CAREER: Lightweight, Blame-aware Contract Checking","awardID":"0846012","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["518591"],"PO":["564388"]},"146243":{"abstract":"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).<br\/><br\/>Quantum computing is a scientific field that combines some of the deepest intellectual concerns of computer science and physics. Ultimately, we want to know: what is and is not feasibly computable in the physical universe? After fifteen years of effort, quantum computing theory seems to have reached a point where further progress will necessarily entail progress in classical computing theory. The proposed research embraces this with concrete ideas for advancing both fields and will deepen the connections between quantum computing and frontier topics in classical complexity theory.<br\/><br\/><br\/>This research tackles some of the hardest \"barrier problems\" about the power of classical and quantum computers. Examples of such problems include: how large is the class of problems that admit efficient quantum algorithms? Can we obtain evidence that this class lies outside the entire \"polynomial hierarchy\" of classical computation---which, loosely speaking, would imply that quantum computers could solve certain problems much faster than classical computers could even check the answers? Are there \"unstructured\" problems that quantum computers can solve exponentially faster than classical computers, in addition to \"structured\" problems such as finding the period of a periodic function (the heart of Shor's factoring algorithm)? Can we go beyond the idealized \"black-box model\" that encompasses almost everything complexity theorists currently know about the power of quantum computers, to obtain \"non-relativizing results\" that exploit the structure of quantum circuits? Can we better understand the obstacles to progress on P versus NP and related questions?","title":"CAREER: Efficient Computation in the Physical World","awardID":"0844626","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}}],"PIcoPI":["532609"],"PO":["565157"]},"149312":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\"<br\/><br\/>Computational creativity has been a goal of artificial intelligence since nearly its inception. But while many interesting models have been developed, and some of these have even produced interesting creative works, most have been built on foundations that either don't scale, or don't easily scope across different domains, or both. In this project the PI will explore an alternative in which creativity, and in particular humor, is modeled as a layered system of intelligent control, using case-based reasoning, of simple retrieval and filtering mechanisms. Specifically, this is an effort, in the realm of believable comedy agents, in which the issues of control and breadth are decoupled and handled by two very different sorts of systems. For control, the PI will use a variant of case-based planning to provide task-level guidance to content acquisition, evaluation, transformation, combination, and presentation; for breadth, he will employ lexical technologies from information retrieval that will be used to mine online resources spanning a wide variety of domains. The PI's goal is to provide a model of creativity and humor that works in much the same way that a professional comedy writer or improvisational performer does. These professionals \"mine\" their memories for experiences, but they do not merely \"free associate.\" Instead, they employ a set of conventions or techniques that can be applied and scoped across any domain to produce a specific comedic effect. Modeling human skill in this way will result in a robust and scalable system that is able to provide breadth of coverage (through well understood and scalable information retrieval techniques), without sacrificing the power of control provided by the reasoning system. In effect, it will be funny no matter what it is talking about. This research will improve our understanding of creative processes through an examination of machine-generated content, and the creation of new content and content forms derived from existing resources. It will also support the development of new technologies to support human creativity, in that the resulting models and systems will enable high-level authoring of new kinds of interactive \"information\" experiences.<br\/><br\/>Broader Impacts: The PI expects that at least two broad societal impacts will derive from this work. First, he will actually create intelligent comedic performance agents and deploy them both on- and off-line for the enjoyment and illumination of everyday citizens. Second, this research will attract, develop, and produce an equally new type of AI researcher whose vision of the mind scopes beyond the confines of a single machine. In particular, the goal is to attract a broader set of students (including the underrepresented group of women in engineering) from communications studies and theater, who want to do research on the machine as a device for communication and creative expression made possible and supported by the mediation of intelligent systems. The PI believes this is a crucial step in the development of AI as a field, drawing in a next generation of creative and innovative thinkers who will be able to bring new light into the world of semantics and inference while building artifacts with artistic power.","title":"Major: Computational Creativity: Building a Model of Machine Generated Humor","awardID":"0856058","effectiveDate":"2009-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["410052","410053"],"PO":["565227"]},"146310":{"abstract":"The Internet will shape the history of the 21st century. Governments around the world realize this, which is why, out of 40 countries studied by the Open Net Initiative, Internet censorship increased from 3 of 40 in 2002 to 26 of 40 in 2007. The U.S. must set effective policy regarding this, but the inherently computational issues lead to a great deal of uncertainty. We are studying the dynamics of modern Internet censorship implementations to understand how their low-level mechanisms (for example, at the level of individual Internet packets) affects the application-level behavior of censorship that web users actually experience.<br\/><br\/>Internet censorship implementations are inherently computational, thus whether or not content is available to a user can depend on key issues such as routing and protocol dynamics. Current characterizations of censorship are incomplete, not founded on quantitative measurements, and cite experiments that cannot be reproduced. We are addressing this by laying a solid computational foundation for Internet censorship research. Central to this effort is Internet measurement of existing censorship implementations to understand and compare their dynamics at the packet- and application-level. This will impact both policy development and the future design of computer networks to address Internet censorship, a critical issue that directly harms U.S. interests by hindering the ability of human rights organizations and U.S. government agencies to disseminate information. Understanding the connections between Internet censorship and computational issues will also enable the integration of this research throughout the computer science curriculum at UNM and other institutions.","title":"CAREER: Internet Measurement in the Cat's Cradle of Global Internet Censorship","awardID":"0844880","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["548106"],"PO":["565327"]},"146552":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009<br\/>(Public Law 111-5).\"<br\/><br\/>CAREER: Information Theory and Coding for Wireless Broadcast Networks<br\/><br\/>Broadcast is a fundamental nature of wireless communication. With appropriate coding architecture, the broadcast nature of wireless communication can be used to the advantage of simultaneously transmitting to several receivers at high rates. Most of the previous work focused on the following two scenarios: 1) to deliver the same message to each of the receivers; 2) to deliver completely different messages to different receivers. Between these two ?extreme? broadcast scenarios, there is a rich collection of ?intermediate? problems with message sets of interesting configuration and significant engineering appeal. Understanding the limits and the appropriate coding architectures of broadcast networks with general message set configurations is a relatively unexplored challenge that must be addressed to fully harness the broadcast advantage of wireless communication.<br\/><br\/>This research takes a fundamental information-theoretic view of broadcast networks to shed insight into what coding architectures are appropriate for different message set configurations. An important component of this study is the focus on concrete and physically motivated models of wireless network communication. Of particular interest is to understand the impact of multiple-input multiple-output (MIMO) communication. Specifically, this research studies: 1) the impact of message set configuration on the appropriate coding architecture of wireless broadcast networks; 2) secrecy communication under physically motivated models; and 3) the value of receiver message side information for broadcast network communication. The research program is complemented by an educational effort to train the next generation of engineers to become skilled in the design of wireless networks, which involves developing a new course on information theory for wireless systems and writing an accompanied textbook.","title":"CAREER: Information Theory and Coding for Wireless Broadcast Networks","awardID":"0845848","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7937","name":"NETWORK CODING AND INFO THEORY"}}],"PIcoPI":["297790"],"PO":["564924"]},"146343":{"abstract":"Proposal ID: 0844995, PI Name: Mohammad Tehranipoor, PI Institution: University of Connecticut, Title: CAREER: Novel Techniques for Detecting and Localizing Hardware Trojans in Integrated Circuits<br\/><br\/>Abstract: <br\/><br\/>Design and fabrication of integrated circuits (ICs) are becoming increasingly vulnerable to malicious activities and alterations with globalization. These vulnerabilities have raised serious concerns regarding possible threats to many critical applications. An adversary can introduce a Trojan designed to disable and\/or destroy a system at some future time or the Trojan may serve to leak confidential information covertly to the adversary. This research develops efficient procedures for detection of malicious alterations and subtle modifications in integrated circuits. Side-channel signal analysis methods as well on-chip measurement structures are developed to detect and localize the inserted Trojans in very deep submicron ICs. Novel design-for-hardware-trust techniques are developed in this project to increase the capabilities and effectiveness of the detection and isolation strategies. <br\/><br\/>The Intellectual Merit of the research is the development of techniques optimized to improve the level of confidence that an IC will carry out its intended function and nothing more. The broader impact is (i) the development of techniques for hardware authentication that would be of interests to US government, agencies and many fab-less semiconductor companies, (ii) the societal benefits that include trustworthy electronics for healthcare, defense weapons and dependable computing platforms for intelligence, weather forecasting, and transportation, (iii) the education of undergraduate and graduate students, (iv) the development of new courses, and (v) the dissemination of data and methodologies to researchers in academia and industry.","title":"CAREER: Novel Techniques for Detecting and Localizing Hardware Trojans in Integrated Circuits","awardID":"0844995","effectiveDate":"2009-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["560771"],"PO":["565264"]},"149687":{"abstract":"Proposal Number: 0900952<br\/>PI: David Evans<br\/>Institution: University of Virginia Main Campus<br\/>Lead<br\/><br\/><br\/><br\/>Title: Workshop on the Science of Security<br\/><br\/>As our Nation increasingly depends on computers and networks for national defense and for running its critical infrastructures, such as the Power Grid and the financial networks, adversaries have become interested in attacking our systems in order to achieve financial gain, to cause major disruption to services or to extract sensitive information. To cope with these serious threats, there has been much activity to improve the security or our Nation?s systems, much of it initiated in the research community but motivated by real and current security problems.<br\/><br\/>Because of the pressing need for solutions to immediate threats, the security research community has not focused enough on evolving security into a science. As a result, many of the solutions are ad hoc, address only particular threats, and, most important, are not amenable to evaluation. The comment complaint is that there is no theory (or experimental methodology or infrastructure) that supports the security evaluation of systems. <br\/><br\/>The purpose of this workshop is to explore approaches to create a science of security that will address the lack of principles that can help engineer secure systems and can lead to their evaluation. Such principles can relate to models of attacks and of attackers, the ability to reason about the resilience of a system, the ability to compare the security of systems, the ability to compose systems with known security characteristics to produce a system also with known security characteristics. <br\/><br\/>A workshop to engage the research community towards a science of security is proposed. A two-day workshop is planned, to be organized by an ad hoc committee composed of security experts from academia, experts from other fields where there is an established science in the expectation that the security community can learn from such successes, experts from research institutions, important industry leaders, and Government PMs.","title":"Workshop on the Science of Security","awardID":"0900952","effectiveDate":"2009-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"I160","name":"National Security Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"I231","name":"Central Intelligence Agency"}}],"PIcoPI":["483825"],"PO":["497499"]},"159125":{"abstract":"Computational sustainability is an emerging field, developing and applying computational methods, notably of articial intelligence, to difficult problems of long-term environmental and societal sustainability. This award supports the travel and subsistence of graduate students, postdoctoral fellows, and other junior researchers for participation at the 1st International Conference on Computational Sustainability (June 8-11, 2009, Ithaca, NY).","title":"Student and Junior Researcher Participation in CompSust09: 1st International Conference on Computational Sustainability","awardID":"0939505","effectiveDate":"2009-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["560670"],"PO":["564316"]}}