{"91439":{"abstract":"Although there have been significant advances in automatic speech recognition (ASR) over the last twenty years using a pattern-matching paradigm, the progress has begun to slow recently. Furthermore, the current state-of-the-art has yet to rival human speech recognition capability. One potential area for improvement is to find ways to evaluate and incorporate the vast knowledge sources developed outside the ASR community and establish open sharable infrastructures to facilitate collaborative ASR research. As speech recognition technology is critical to realize the promise of universal access to information for all people, it is timely to examine options the community can take up to bridge the performance gap.<br\/><br\/>This project is to organize a highly focused two-day symposium and invite top minds in US academia, industry and government to assess the capabilities and limitations of state-of-the-art ASR technologies, and discuss potential approaches to accelerating ASR advances. The symposium theme will be centered on integrating multi-disciplinary sources of knowledge, from acoustics, speech, linguistics, human computer interaction, cognitive science, signal processing, and computer science, into every stage of ASR component and system design. At the conclusion of the meeting, all the presentation materials will be collated into a report and disseminated to the research community and other stakeholders. <br\/><br\/>This research should inspire new directions in ASR, conceptualize new cyber-infrastructures for research and education in speech science and technology, and recommend ways to lower ASR entry barriers and increase the talent pool in human language and communication research by enabling a diverse community of researchers.","title":"2003 Symposium on Next Generation Automatic Speech Recognition (ASR)","awardID":"0352730","effectiveDate":"2003-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["335186"],"PO":["565215"]},"90905":{"abstract":"This is funding to partially support a research symposium that is expected to attract approximately 100-150 participants. The behavior of social insects is a growing source of inspiration for computer scientists, especially those investigating algorithms for multi-agent systems and robotics. The goal of the workshop, which will be the second in the series but the first to be held in the United States, is to bring computer scientists, biologists, robotics researchers, mathematicians and engineers together to share ideas: on how mathematical and algorithmic models of insect behavior might inspire solutions to problems in computing, planning and logistics; and on how methodologies and techniques from computing and engineering might be applied to the problem of understanding social insect behavior. The PI's hypothesis is that such collaborations among computer scientists, roboticists and biologists may well lead to a cascade of new science in all these disciplines. To this end, the PI intends to make special efforts to foster diversity among the participants, and to include a mixture of senior and junior researchers, practitioners, and students. In particular, because it is likely that there will be some graduate students who may find it hard to justify the cost of attending a non-mainstream workshop to their departments or advisors, or who simply do not have the funds to attend, a large chunk of the funds will be earmarked for supporting participation by bright, interdisciplinary students and members of under-represented groups, who might not otherwise attend but who may have a significant impact upon the delegates. The PI is soliciting funding from industry and from European agencies; the PI expects NSF funding will be used to support attendance by approximately 15 faculty and 20 students.<br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects in several disciplines, and will support timely cross-fertilization among them. In particular, the meeting will help expand the involvement of graduate students in this synergistic effort, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the various fields.","title":"Workshop on the Mathematics and Algorithms of Social Insects","awardID":"0350152","effectiveDate":"2003-11-15","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["436270"],"PO":["564456"]},"88141":{"abstract":"The proposed project carries out a theoretical investigation of a new, highly efficient and transparent optical networking paradigm, called OMM-Net, which avoids fast optical switching and buffering in the network core by scheduling fast tunable lasers, and admission control and buffering at the network edge. The boundary of the optical network is pushed closer to end users by combining time and wavelength division multiplexing for mesh networks through effective scheduling and global synchronization. OMM-Net views the network as a giant and geographically distributed generalized Birkhoff-von Neumann switch in which the network edge are its input\/output ports and the fabric consists of fibers and quasi-static wavelength-selective switches. End-to-end switching is emulated by scheduling ultrafast tunable lasers at the network edge, in effect providing sub-microsecond switching without requiring fast internal network node switching and optical buffering.","title":"NRT: Optical Multiplexed Mesh Networks (OMM-Net) for Thin-Layer, Multi-Service Transparent Optical Transport","awardID":"0335217","effectiveDate":"2003-11-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["483597","349921",231072],"PO":["7594"]},"86351":{"abstract":"The purpose of this project is to develop and implement a middleware that allows mining and analysis of distributed data. The research will address an increasing interest in the exploration and mining of the large volume of data that is generated by the business, scientific, engineering, academic and defense communities. <br\/><br\/>Novel techniques will be developed in the following areas:<br\/>Data and Policy Management Services: These services will provide organizational level access restriction capabilities for the owners of the data while allowing users to access a more efficient transport of data.<br\/>Data Mining and Exploration Services: This framework will include a library of data mining tools that will work effectively for example if: data is distributed on multiple sites, the user has varying privileges depending on what site they are accessing, a user wants to trade off computing time versus accuracy or a user wants to access the site remotely.<br\/>Scheduling and Replication Services: System administration will be based upon policies at the participating organizations and their established privileges for users. Computation and data will be scheduled jointly to optimize metrics.<br\/><br\/>This combination of distributed computing and data mining will be made widely available to students, researchers, and other interested groups in government, industry and education.","title":"ITR: Collaborative Research: A Data Mining and Exploration Middleware for Grid and Distributed Computing","awardID":"0325013","effectiveDate":"2003-11-01","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["533353"],"PO":["565272"]},"86396":{"abstract":"This project takes an innovative and multidisciplinary approach to characterizing how spoken language production and interpretation are coordinated in dialog. It examines how people adapt to both human and computer conversational partners, through variation in pronunciation (e.g, dialect), rhythm, word choice, sentence structure, and perspective. Adaptations include those that make processing easier for both partners, such as converging on the same wording; they also include adjustments made by one partner \"for\" the other. Findings from human dialog will be applied to systems that use speech recognition and generation, with the goals of (1) getting users to adapt utterances to forms the system can process more robustly, and (2) whenever feasible, adapting the system's vocabulary, dialect, and perspective to the user's' needs. <br\/><br\/>The project brings together methods and theoretical perspectives from computer science, linguistics and psychology to advance theories and improve applications. Methods include laboratory experiments, corpus studies, and simulation studies, integrated with prototyping and evaluation of spoken dialog systems. Three applications are planned: a picture matching game, a PDA-based calendar system, and a telephone-based course evaluation system for an undergraduate community. <br\/><br\/>The project will enhance training of young scientists in computer science, linguistics and psychology, and will include underrepresented groups in basic research and user-interface engineering. The broader impact will be a scientific foundation for developing flexible and robust spoken dialog systems that serve the needs of diverse users. Specific application opportunities include mobile computing, educational assessment, machine speech recognition of non-standard pronunciation, and tutoring systems for the hearing impaired or second-language learners.","title":"ITR: Adaptive Spoken Dialog with Human and Computer Partners","awardID":"0325188","effectiveDate":"2003-11-15","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["483394","369058","362801",225762,"491733"],"PO":["565215"]},"92261":{"abstract":"This project explores how a cognitive-representational approach to early reading can lead to new and efficient instruction that will impact learning across the curriculum. The research questions addressed are:<br\/><br\/>Which design principles are most important for a balanced approach to literacy instruction that uses multimedia environments for integrated, efficient instruction of decoding and word recognition skills?<br\/><br\/>Will design principles suggested by research help teachers better understand and integrate decoding skills into their classroom literacy environments?<br\/><br\/>Can a combination of video and print materials linked to multimedia environments be effective tools for improving children's home environments and parental support for early reading instruction?<br\/><br\/>The project will investigate these questions by developing an understanding of design principles for children's word recognition fluency and decoding skills using current cognitive theories of mental representations of language. Within-subject designs will be used to see how different variations of prototype software affect children's word recognition fluency and decoding skills. These initial studies will also include between-subject controls that use no software. At-home reading of both decodable text and rich, high-quality children's literature will be linked to the content and structure of the decoding and word recognition software. This at-home reading will be supported by video exemplars. The children with at-home access to these materials and the software in school will be compared with those children with just the software at school. Additionally, software based on recent cognitive theories will be compared to commercially available software designed to aid children in developing decoding skills by comparing the reading development of children using research software vs. commercially available software.","title":"Cognitively-Based, Multimedia Support for a Balanced Approach to the Development of Early Reading in School and Home Contexts","awardID":"0400457","effectiveDate":"2003-11-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["549148",241768],"PO":["564412"]},"87146":{"abstract":"Increasingly, users of information appliances -- cell phones, personal digital assistants, and the like -- are using them to communicate textual information, and finding them difficult to interact with. The properties that make the devices useful in the first place (size, mobility, embeddedness) are exactly the properties that make inputting text difficult. The principal investigator is developing ways to make use of the intrinsic redundancy of natural language to dramatically improve the efficiency with which natural language text can be entered into such devices. This redundancy accounts, for instance, for our ability to read compressed text such as \"Cn u rd ths?\". If information appliances could also read such highly abbreviated text with high reliability, abbreviated text could be used to speed up text input.<br\/><br\/>Developing systems to decode text compressed in such a \"human-centered\" manner requires advances in modeling of the compression method and in user interface techniques that allow interactive correction of any mistakes in the computer's understanding of the compressed text. This research addresses the required advances by exploiting statistical language modeling techniques to address the challenges involved in minimizing cognitive load on the user. Such an ability would dramatically simplify and expand the process of communicating with and through computer and telecommunications system using text, and expand the base of potential environments where text input could occur and users who could participate. Similarly, benefits would accrue to disabled users and others operating under degraded conditions.","title":"Human-Centered Compression for Collaborative Text Input","awardID":"0329089","effectiveDate":"2003-11-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["379957"],"PO":["565215"]},"86432":{"abstract":"The advent of large scale integrated (LSI) circuits in the 70s set the foundations for today's information technologies. Similarly, recent advances in the monolithic integration of biochemical fluid-based processing technologies is likely to lead to the development of tomorrow's advances in biotechnology and medicine. As with integrated circuits, such very large scale integrated biofluidic chips (VLSIBC) will need software tools to acquire design specifications, investigate the applicability of alternative design architectures, and then automatically design a target chip. Furthermore, tools for quantitatively predicting and optimizing the chip's performance will be needed.<br\/><br\/>This cross-disciplinary project involving investigators from four departments at Carnegie Mellon and one at the University of Illinois is developing algorithms, languages, models and methodologies for the design of biofluidic chips. The envisoned automated design and verification capabilities will be able to handle the tremendous growth in biofluidic design complexity arising from microfluidic integration and will shorten the current design-fabricate-test loop to reduce the lead time and make biofluidic processors commercially viable.","title":"ITR: Automated Design of Very Large Scale Integrated Biofluidic Chips","awardID":"0325344","effectiveDate":"2003-11-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["539633","396215",225880,"332333","426467"],"PO":["562984"]},"87797":{"abstract":"This proposal is for a joint workshop on the reconstruction of cultural landscapes through digital technologies.","title":"U.S. - Italian Joint Workshop; Rome, Italy","awardID":"0333059","effectiveDate":"2003-11-15","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["441922"],"PO":["564456"]},"87974":{"abstract":"The purpose of this project is to turn important recent research in TCP congestion control into a practical, validated, and deployable Internet technology. Recent and future changes in transmission technologies and user demands are challenging the fundamental assumptions of the Internet's design, especially the current TCP congestion control. Fiber deployment is soaring, increasing network capacity, and wireless and satellite channels are proliferating, driving up round trip times (RTT). Internet applications, including a variety of scientific and Grid networking applications, are suffering in performance. Need exists to send petabyte files in 15 minutes, i.e., at over 1 Gigabit per second. Technically, large bandwidth-delay product applications perform poorly even in un-congested networks because of TCP congestion control. Large RTT flows get unfair allocations of bandwidth when competing against short flows and TCP has been shown to be unstable when window size becomes very large, causing large bandwidth oscillations. TCP is being patched and tweaked, but a new approach to Internet resource management is needed.<br\/><br\/>The XCP congestion control mechanism that was recently developed by Dina Katabi [Katabi02] fills this need. XCP can exploit rapid changes in available Internet resources in a stable, scalable way, and it can separate link utilization control from bandwidth sharing policies. From these simple capabilities, XCP enables network-friendly data transfer at higher speeds with less jitter and almost no packet loss.The goal of this project is to make XCP real and demonstrate its capabilities and value. This will include full, rigorous design and specification of the protocol, developing a high-speed prototype implementation, testing and validating XCP in a series of increasingly real-life Internet environments, developing migration plans, and moving XCP towards community acceptance and standardization. The proposer will enlist several scientific networking communities to serve as test environments for initial XCP deployment.<br\/><br\/>Final XCP deployment will ultimately take many years. This project will include near-term deployment in research networks and will play a central role in getting this work started - - and in forming a collaborative, community effort for advancing XCP. In particular, the proposer work will both catalyze and leverage the efforts of many groups, including the research community, specific scientific network user communities, router vendors, and the IETF. It is this leverage and synergy, building on their own modest technical effort, that will bring about the generational change in Internet technology that is the central objective of our proposal.","title":"STI: XCP Development","awardID":"0334186","effectiveDate":"2003-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T448","name":"AIR FORCE-NETWORK ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T485","name":"AIR FORCE-NETWORK ARCH STUDIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V926","name":"AIR FORCE-NETWORK ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"V460","name":"AIR FORCE-NETWORK ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"V398","name":"AIR FORCE-NETWORK ARCH STUDIES"}}],"PIcoPI":[230642,"427568","336959"],"PO":["547712"]},"86435":{"abstract":"Since at least the early 1900s, the supply of information and communication has been growing faster than our ability to consume it. From the information producers' viewpoint, much information is wasted, in the sense that it doesn't reach those to whom it is relevant. For the consumer, the glut of information makes it increasingly difficult to find what is relevant, useful or enjoyable. This \"poverty of attention\" also occurs in the domain of interpersonal communication, where informal and spontaneous interaction, a hallmark of managerial and professional work, generates interruptions and overload. In this project, the PI and his team will develop, integrate and use principles from social psychology, computer science, economics, and interaction design to devise ways of economizing on attention in a communication rich environment. Specifically, they will develop, deploy and evaluate techniques to mediate among the often competing demands of responding to a barrage of communication requests that compete for attention when performing a primary task, such as driving a car or interviewing a client. To do so, the PI team will use sensing technology and machine learning techniques to identify a worker's current task and degree of interruptibility. They will display team members' availability to a subset of communication partners and use principles developed in economics and social psychology to balance the competing demands on the worker's attention. They will also use principles developed in interaction design to build lightweight, peripheral displays and context-aware interaction techniques that allow people to briefly and simply comprehend information without disrupting their primary task. Although the principles and techniques developed will be applicable across many domains, this project will make use of a specific context for development and testing, namely improving communication efficiency of mobile health care workers caring for the elderly. The PI team consists of a social psychologist, a computer scientist, and a designer, who have been working previously both individually and jointly on problems of human attention; part of this project will involve integrating results from research efforts already underway. <br\/><br\/>Broader Impacts: Issues of managing attention and information overload are pervasive in our increasingly connected and technological society. Development of principles and specific techniques for addressing these issues has the potential for large benefit and widespread impact beyond the eldercare domain. In addition, support for the project's target domain - mobile eldercare workers - offers the potential of direct social benefit to a rapidly aging population. The project will lead to better understanding of design principles for economizing on attention, to prototype development, and to lab and field testing of the models, all of which will help save on the most precious of human resources - our attention.","title":"ITR: Managing human attention","awardID":"0325351","effectiveDate":"2003-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["518043","560995","526576"],"PO":["565227"]},"86612":{"abstract":"STAPL (the Standard Template Adaptive Parallel Library) is a library of ISO Standard C++ components with interfaces similar to the (sequential) ISO C++ standard library, and encouraging results have been obtained with a shared memory prototype. This project will extend this library significantly in the range of systems it can support (notably systems without shared memory), the range of optimization performed, and the degree to which a program is automaticall y adapted to its run-time environment and workload. The project will extend the STAPL library, redesign the STAPL run-time system, and build a compiler to allow high-level (source-level) optimizations and to generate information and code needed by the run-time system for adaptive algorithms and lower-level optimizations. Thus, STAPL will be a framework for highly-optimizable, adaptable, and portable parallel computations. In addition to the usual vector-based operations, it will support parallel use of less regular structures (such as lists and sparse matrices) and ease the evolution of programs from a serial to a parallel environment. Importantly, this will be done in ways that take advantage of the huge investment in mainstream programming environments and tools and make STAPL's parallel computation facilities accessible to mainstream programmers.","title":"ITR\/NGS: A Software Infrastructure for Computational Biology and Physics","awardID":"0326350","effectiveDate":"2003-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":[226535,"561154","496841","501668"],"PO":["551712"]},"86546":{"abstract":"The purpose of this project is to develop and implement a middleware that allows mining and analysis of distributed data. The research will address an increasing interest in the exploration and mining of the large volume of data that is generated by the business, scientific, engineering, academic and defense communities. <br\/><br\/>Novel techniques will be developed in the following areas:<br\/>Data and Policy Management Services: These services will provide organizational level access restriction capabilities for the owners of the data while allowing users to access a more efficient transport of data.<br\/>Data Mining and Exploration Services: This framework will include a library of data mining tools that will work effectively for example if: data is distributed on multiple sites, the user has varying privileges depending on what site they are accessing, a user wants to trade off computing time versus accuracy or a user wants to access the site remotely.<br\/>Scheduling and Replication Services: System administration will be based upon policies at the participating organizations and their established privileges for users. Computation and data will be scheduled jointly to optimize metrics.<br\/><br\/>This combination of distributed computing and data mining will be made widely available to students, researchers, and other interested groups in government, industry and education.","title":"ITR: COLLABORATIVE RESEARCH: A Data Mining and Exploration Middleware for Grid and Distributed Computing","awardID":"0325949","effectiveDate":"2003-11-01","expirationDate":"2007-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["543508","563608"],"PO":["565272"]},"86458":{"abstract":"The purpose of this project is to develop and implement a middleware that allows mining and analysis of distributed data. The research will address an increasing interest in the exploration and mining of the large volume of data that is generated by the business, scientific, engineering, academic and defense communities. <br\/><br\/>Novel techniques will be developed in the following areas:<br\/>Data and Policy Management Services: These services will provide organizational level access restriction capabilities for the owners of the data while allowing users to access a more efficient transport of data.<br\/>Data Mining and Exploration Services: This framework will include a library of data mining tools that will work effectively for example if: data is distributed on multiple sites, the user has varying privileges depending on what site they are accessing, a user wants to trade off computing time versus accuracy or a user wants to access the site remotely.<br\/>Scheduling and Replication Services: System administration will be based upon policies at the participating organizations and their established privileges for users. Computation and data will be scheduled jointly to optimize metrics.<br\/><br\/>This combination of distributed computing and data mining will be made widely available to students, researchers, and other interested groups in government, industry and education.","title":"ITR: Collaborative Research: A Data Mining and Exploration Middleware for Grid and Distributed Computing","awardID":"0325459","effectiveDate":"2003-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["530024"],"PO":["565272"]},"89617":{"abstract":"Perceptive Animated Interfaces represent a new generation of human computer interaction, in which people interact with machines much like people interact with each other in specific task domains. These interfaces incorporate virtual humans-lifelike three dimensional animated computer characters that exhibit expert intelligence and behaviors in specific task domains, such as learning and training. Virtual humans orient to the user, provide real time feedback as the user is speaking (e.g., head nods, smiles, puzzled looks), interpret the user's auditory and visual behaviors to infer his or her intentions and cognitive state, and communicate with the user sensitively and effectively to achieve the goals of the task through natural face-to-face dialogues. <br\/><br\/>The goal of the Workshop on Perceptive Animated Interfaces and Virtual Humans is to bring together interested researchers from scientific disciplines to help conceptualize the challenges involved in developing perceptive animated interfaces incorporating virtual humans, to consider possible research agendas and the steps required to form a community that will work together to stimulate progress toward shared research goals. Participants include scientists from areas of human communication, human interface design, human language technology, computer vision, computer animation, cognitive science and other relevant fields of study. Workshop activities include assessing current theories and practice in relevant disciplines, defining research goals and objectives, evaluating system architectures, identifying task domains for which prototype systems can be developed as test beds for research, and identifying critical infrastructure necessary to conduct proposed work. <br\/><br\/>The development of perceptive animated interfaces is expected to revolutionize human computer interaction by providing more natural and effective communication experiences, and to improve dramatically opportunities for learning and training, and access to networked information. The workshop report will recommend concrete steps toward research and development of perceptive animated interfaces and virtual humans.","title":"Workshop on Perceptive Animated Interfaces and Virtual Humans","awardID":"0343395","effectiveDate":"2003-11-15","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["551122","463668","514860"],"PO":["565215"]},"86638":{"abstract":"The goal of this project is to create a speech interface that supports a user in interacting with multiple real-time devices at the same time, where the interaction with each device is a separate dialogue thread. The first aim is to show, using a human-computer study, that the simple way to implement a speech interface for managing multiple threads is not effective. The second aim is to run a human-human study to show that people can inherently manage multiple dialogue threads, and to determine what conventions they use. The third aim is to build a speech interface that implements the conventions that were found.<br\/><br\/>The main impact of this work is the development of a model that accounts for how people deal with multi-threaded dialogues. This model will be demonstrated in an implemented speech interface. This work will create a technology that will be useful in interacting with the pervasive electronic devices that we can expect to see in the future.","title":"ITR: Multi-Threaded Dialogues For Real-Time Applications","awardID":"0326496","effectiveDate":"2003-11-01","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["551154","526569",226634],"PO":["565215"]},"95803":{"abstract":"The general research goals will be to develop scheduling algorithms, to provide provable performance guarantees, and to explore lower bounds defining the limits of achievable performance. The performance of an algorithm on a given instance will be evaluated by comparing the algorithm's achieved benefit to the maximum possible benfit which could have been achieved on the same instance. The ratio between teh achievable benefit and the achieved benefit will be considered over an entire class of instances; the worst-case value of this ration is commonly called the competeitive ration of an algorithm.<br\/><br\/>The specific research goals will be two-fold. The first direction of research will be to develop additional parameterization which can be used to describe the competitiveness of schedulers with finer granularity. The second goal is to better understand how subtle changes in the underlying modelaffect the achievable performance.","title":"Maximizing Resource Utilization through Admission Control","awardID":"0417368","effectiveDate":"2003-11-14","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[251193],"PO":["499399"]},"91568":{"abstract":"This is funding to support a doctoral research symposium (workshop) of approximately 10 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2003 Conference on Universal Usability (CUU 2003), to be held November 10-11 in Vancouver, British Columbia, Canada, and sponsored by the Association for Computing Machinery's Special Interest Groups on Human Computer Interaction (SIGCHI) and Computers and the Physically Handicapped (SIGCAPH). Conceived a few years back by Ben Shneiderman, he CUU conference series represents an effort to build a new community of researchers that look at the broader, social issues of interface design. A key way to build this community is through its youth. The consortium's goal is to bring PhD students together from diverse backgrounds (computer science, biomedical engineering, human communication theory and economics), so that they can see the broader spectrum of research approaches to universal usability and also feel that there is a community for them in which they can pursue their research. The PIs recognize the pressures of conforming when students graduate and move into research disciplines defined by academic departments; they wish to counter these pressures by guiding the research of the attendees through contact with experts in the field, allowing these young researchers to attend the CUU 2003 conference, presenting potential career paths within academia and industry, and illustrating the interrelationship of different aspects of universal usability through interaction among students and faculty with diverse research interests. Student participants will make formal presentations of their work during the consortium, and will receive feedback from a faculty panel designed to help them understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The student participants will also present their work during the technical program of the CUU 2003 conference. Evaluation of the consortium will be conducted, and results of the evaluation will be available to the organizers of future consortia.<br\/><br\/>Broader Impacts: The consortium will help shape ongoing and future research projects aimed at questions of universal access and universal usability, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will give new these promising young researchers constructive feedback on their work and expose them to a larger community.","title":"Workshop: Universal Usability Doctoral Research Consortium; November 10-11, 2003; Vancouver, BC","awardID":"0353141","effectiveDate":"2003-11-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["360930",239831],"PO":["565227"]}}