{"135940":{"abstract":"Lead proposal<br\/>NUMBER: 0635008<br\/>INSTITUTION: Ohio State University Research Foundation<br\/>PRINCIPAL INVESTIGATORS: Dey, Tamal K. & Wenger, R. S.<br\/>Collaborative Proposal<br\/>NUMBER: 0635366<br\/>INSTITUTION: University of Illinois<br\/>PRINCIPAL INVESTIGATORS: Ramos, Edgar<br\/><br\/>PROJECT TITLE: Collaborative Research: Non-smoothness in Meshing and Reconstruction<br\/><br\/>The problems of meshing and reconstruction are pervasive in science and engineering where geometric domains need to be digitally represented, analyzed, inspected, or prototyped. Although the input forms to these two problems differ, both have a similar goal in producing a triangular representation of a geometry. Considerable theoretical advances have been recently made in designing and implementing provable algorithms for both. However, these algorithms assume some form of smoothness of the input domain. As a result, current solutions are not broad enough to handle many of the geometric domains which arise in scientific studies and engineering applications. Designing machine parts in automotive industry, creating virtual environments with buildings, simulating cracks and shocks in scientific studies are a few examples with non-smoothness as a basic impediment. This project studies the difficulty of non-smoothness in meshing and reconstruction by designing sound algorithms and by developing robust software based on these algorithms.<br\/><br\/>Meshing produces a triangulation of an explicitly specified geometric domain whereas reconstruction does the same with a point sample. Most of the provable reconstruction algorithms exploit the differential structure of a smooth surface whereas meshing algorithms, though allowing polyhedral domains, restrict the input angles not to be small. The result of these restrictions is that non-smooth domains such as piecewise smooth surfaces and non-manifolds cannot be handled with full generality. The goal of this project is to broaden the class of input geometry for which models can be computed with assurance of accuracy. The research in this project uses concepts from various mathematical disciplines such as differential geometry, differential topology, and non-smooth analysis and also tools from areas of theoretical computer science such as computational geometry, computational topology, and numerical optimization. Graduate students supported by the project develop skills in theoretical computer science, most notably in computational geometry and topology and also in writing robust, efficient and user-friendly software.","title":"Collaborative Research: Non-smoothness in Meshing and Reconstruction","awardID":"0753485","effectiveDate":"2007-12-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":[361140],"PO":["565157"]},"135885":{"abstract":"Support for the 40th Annual ACM\/IEEE International Symposium on Microarchitecture (MICRO) 2007<br\/><br\/>This symposium is a top-tier conference which brings together researchers from the microprocessor area of computer system architecture. A key emphasis of this conference is to bring about significant interaction between academic researchers and designers from industry to facilitate collaborations and technology transfer. This outreach activity supports travel for students and junior faculty to attend the symposium and have an outlet for exposure to economically transformative research of interest to industry.","title":"Support for the 40th Annual ACM\/IEEE International Symposium on Microarchitecture, 2007","awardID":"0753225","effectiveDate":"2007-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["409687","485831"],"PO":["550859"]},"135467":{"abstract":"The IEEE GLOBECOM 2007, sponsored by the IEEE Communication Society, will be held at the Hilton Washington Hotel in Washington DC from November 26-30, 2007. This is an IEEE Communications Society flagship conference on advanced communications technologies that brings 1500 to 2000 researchers and practitioners from around the world to present their most up-to-date results and achievements of the field. The organizers of this annual IEEE GLOBECOM conference have endeavored to provide professionals with a cutting-edge forum to exchange and publish their work and ideas. This year's GLOBECOM is a special occasion for the technical community because it is the 50th GLOBECOM conference since its inception in 1958. <br\/>The General Chair of the IEEE GLOBECOM 2007 conference is Mr. Jerome Gibbon, a well-respected leader of IEEE in the Greater Washington DC Area. The General Vice Chair is Mr. Karl Rauscher of Alcatel-Lucent Bell Laboratories. The Technical Program Chair is Professor Sherman Shen of Waterloo University, Canada. The Call for Papers and the remainder of the organizing committee information can be found at http:\/\/www.ieee-globecom.com\/2007. <br\/>Intellectual Merit <br\/>The NSF funding provides 10 to 12 US-based graduate students with the opportunity to attend a leading international conference in communications and networking research. Students will be exposed to state-of-the-art research in the field and will be able to discuss research topics of interest with leading researchers from all over the world. The IEEE GLOBECOM 2007 offers not only opportunities to present technical papers, but also a wide range of other educational events such as workshops, panels, tutorials, industry presentations, posters and keynote speeches. <br\/>Broader Impacts <br\/>The broader impact of this funding includes the creation of opportunities for graduate students conducting research in the field of advanced communications and networking to attend one of the major conferences in this field. The grant will enable the students to develop a deeper understanding of the research world and allow for opportunities to interact with their peers and fellow researchers from other institutions, to meet with leading researchers and to grasp the state-of-the-art advances in the communications and networking industry. There will be ample opportunities at the conference for the students to network with their peers and leaders of their respective sub-fields in a relaxed atmosphere.","title":"IEEE GLOBECOM 2007 Student Travel Grant","awardID":"0751371","effectiveDate":"2007-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":[359897],"PO":["565090"]},"136226":{"abstract":"This award provides funds for student and postdoc participation in the 2008 Gordon Research Conference on Mechanical Systems in the Quantum Regime. This will be the first conference on this topic sponsored by the Gordon Research Conferences. It is being held during the period February 17 ? February 22, 2008, in Ventura, CA. The conference will involve a broad program that touches upon one a rapidly expanding and potentially transformative field exploring experimental and theoretical advances in quantum aspects of mechanical systems . This is a new research area that has arisen in the past year from a diverse set of communities: quantum optics, gravitational physics, and nanoscale condensed matter physics.. The objective of the conference is to bring together internationally leading scientists as well as young researchers and students active or specially interested in the field of quantum control. The conference shall be a forum to present the newest research results and trends in this rapidly expanding field. The interdisciplinary character of the field will be emphasized.","title":"2008 Mechanical Systems in the Quantum Regime Gordon Research Conference","awardID":"0755108","effectiveDate":"2007-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1252","name":"LIGO RESEARCH SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1290","name":"OPTICAL PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["511869"],"PO":["384749"]},"137668":{"abstract":"The proposed project is to host a workshop for the upcoming 2007 NSF \"Cyber-<br\/>Enabled Discoveries and Innovations\" (CDI) Initiative. The workshop will be held at Sheraton Hotel, located in downtown Seattle, WA, on November 11, 2007, from 1 pm to 8 pm. The proposed workshop is held one day prior to 2007 American Society of Mechanical Engineers (ASME) International Mechanical Engineering Congress and Exhibition (IMECE). The workshop is open for researchers from all fields and has been advertised through a multitude of channels including NSF's calendar of events. The objective of the workshop is two-fold. First, the workshop is to introduce the CDI initiative to researchers in all disciplines via invited talks, breakout discussions, and a question-and-answer session. Through the interactive workshop, potential principal investigators will have a deeper understanding of the scope and spirits of CDI initiative. The second objective is to obtain feedback from workshop participants regarding how researchers can better respond to the CID initiative.<br\/><br\/>The workshop consists of 7 invited talks, a breakout discussion session, and an<br\/>NSF question-and-answer session. The invited speakers will be outside the traditional engineering disciplines. The number of participants is estimated to be 60 to 70. Discussions resulting from the breakout sessions will be recorded and published.<br\/><br\/>The workshop provides the participants with opportunities to interact with researchers of different backgrounds to foster future collaboration via the CDI initiative. The workshop will also allow participants to brainstorm and identify critical educational aspects and issues to be addressed in the CDI initiative. The workshop will invite, and make every effort to include, participation of young and underrepresented groups of researchers to enhance the diversity. Also, some seats will be reserved for students and post-doctoral associates to broaden participant's demography. Dissemination of workshop results will also enhance public awareness of CDI initiative.","title":"A Workshop for NSF Cyber-Enabled Discoveries and Innovations Initiative in Conjunction with 2007 ASME International Mechanical Engineering Congress & Exhibition; Seattle,WA.","awardID":"0803484","effectiveDate":"2007-12-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1633","name":"MATERIALS AND SURFACE ENG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1639","name":"SENSORS AND SENSING SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}}],"PIcoPI":["379184"],"PO":["564988"]},"140027":{"abstract":"Proposal Number: CCR-0133956<br\/><br\/>CAREER: A Two-Tier Approach for the Analysis and Evolution of High-Integrity <br\/>Software Product Lines<br\/><br\/>PI: Gerald C. Gannod<br\/><br\/>The objective of the research component of this project is to develop software <br\/>architecture analysis and software reverse engineering techniques that support <br\/>the evolution of existing software into software product lines with an emphasis <br\/>on high-integrity systems. To this end, this research will first involve the <br\/>development of an approach for analyzing software from both the architecture and <br\/>component views in order to support assessment along different quality attribute <br\/>dimensions. The approach will consist of models for static and dynamic analysis <br\/>as well as simulation to determine level of compliance with quality attribute <br\/>constraints. Second, this research will involve the development of a methodology <br\/>for modifying and evolving software at both the architecture and component levels <br\/>in order to ensure compliance with different quality attribute constraints and <br\/>goals. For the software architecture community, this research will address a <br\/>need for analysis approaches that allow software architects to assess the extent <br\/>to which a software architecture meets various quality concerns. In addition, <br\/>the results of this research will facilitate the long-term evolution of a software <br\/>architecture based on long-term product-line goals. For the software reverse <br\/>engineering and maintenance community, this research addresses the need for <br\/>approaches that allow a software maintainer to determine the extent of the <br\/>support for various quality attributes by individual components and provides <br\/>a technique that facilitates component modification in order to ensure compliance <br\/>to quality constraints.","title":"CAREER: A Two-Tier Approach for the Analysis and Evolution of High-Integrity Software Product Lines","awardID":"0813886","effectiveDate":"2007-12-17","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["425207"],"PO":["564388"]},"143713":{"abstract":"Proposal Number: NSF Collaborative Proposals CCR-0311808 and<br\/>CCR-0311686<br\/><br\/>Title: Automated and Adaptive Diversity for Improving Computer System<br\/>Security<br\/><br\/>PI: Dawn Song<br\/><br\/>Abstract: Diversity is an important source of robustness in biological systems. Because each individual has slightly different properties, it is unlikely that any single pathogen will eliminate or escape the entire population. By contrast, today's computer systems are largely homogeneous, being overwhelmingly dominated by one or two operating systems and a few common applications from a handful of software vendors. This fact is routinely exploited by attackers via Internet worms such as Code Red, which infected over 250,000 systems in just nine hours using a single buffer overflow vulnerability.<br\/><br\/>The project will develop methods for diversifying computer systems automatically and systematically -- exploring diversity at various levels of a system and for various purposes, e.g., to make a system more difficult to compromise, to make a system more difficult to damage even after a successful compromise, and to make it more difficult for a successful compromise to evade detection. In order to succeed, many of the mechanisms explored in this work must hide or disguise information about system specifics from an attacker, and this theme will underlie several of the projects.","title":"Collaborative Research: Automated and Adaptive Diversity for Improving Computer Systems Security","awardID":"0832943","effectiveDate":"2007-12-01","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}}],"PIcoPI":["526903"],"PO":["529429"]},"121929":{"abstract":"Harvard University is awarded a grant to develop a freely available, web-accessible system that makes comparative genomics data maximally available and accurately decoded into forms that facilitate further biological investigation at the scale of entire genomes. Specifically, the project will build the largest ortholog repository to date using an improved algorithm for identifying orthologs, based on appropriate evolutionary metrics of similarity. Whole-genome orthology data will be aggregated into matrices of phylogenetic profiles, enabling a series of meta-analyses including the reconstruction of genome phylogenies, and analysis of protein function and network organization. The project's specific tasks include (1) Development of an optimized algorithm to amass a database of orthologs and evolutionary distances for all available fully sequenced genomes that includes results from a maximally informative parameter space; (2) Development of a platform that allows a user to aggregate all of the above orthology data into matrices of phylogenetic profiles and, importantly, to use these matrices to study protein function, network organization and genomic evolution; and (3)Development of a graphical user interface to allow easy access to this resource by researchers world-wide from any web browser. The final product will be a tool to enable any research biologist, regardless of computational expertise, to conduct large-scale comparative genomics investigations that probe functional relationships among genes or phylogenetic relationships among genomes. Its value as a tool for training in comparative genomics and systems biology will be actively promoted through a four-part plan involving training workshops, virtual train materials on the project web page, tutorials associated with major biocomputing symposia, and new course offerings in the Department of Systems Biology at Harvard Medical School.","title":"Maximizing the Utility of Orthologs and Phylogenetic Profiles for Systems-Scale Comparative Genomics","awardID":"0640809","effectiveDate":"2007-12-01","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"6892","name":"CI REUSE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8010","name":"Computing in the Cloud"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":[324013],"PO":["561879"]},"138421":{"abstract":"This symposium aims to bring together researchers from computer system architecture and networking systems to promote cross-disciplinary research activities and outreach. The funds requested will be used to provide travel support for students, post-doctoral researchers, and junior faculty to attend the symposium and have an outlet for exposure and involvement in these activities.","title":"Support for the Symposium on Architectures for Networking and Communications Systems","awardID":"0807168","effectiveDate":"2007-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["522382"],"PO":["550859"]},"137464":{"abstract":"This workshop on Biosensing and Bioactuation will bring together 30-40 researchers from universities, government labs and industry who are experts in the diverse research topics of interest to those in the BIO, CISE, ENG and MPS researcher communities and who have a common interest in interdisciplinary research on biological systems and biologically inspired systems. Participants will be charged with formulating a vision for what might be possible through collaborations on the fundamental challenges pertaining to realizing revolutionary sensing and actuation capabilities that draw upon molecular biology, biochemical processes and both micro and macro biological systems for inspiration. This will be a two-day workshop, to be held at the University of Maryland on Nov. 27th and 28th, 2007. Prior to the workshop, participants will have posted a one-page vision statement that summarizes their individual perspectives of potential Grand Challenge Biosensing and Bioactuation research topics to the workshop web site. The participants, all leaders in their respective fields, will use the small group working sessions to be conducted at the workshop to assess potential opportunities for collaborations that could lead to new insights and discoveries, and with that as a foundation, to develop a document for broad distribution in which participants contribute to identification of the state-of-the-art of Biosensor and Bioactuator research, and provide a visionary look forward that, with the benefit of the larger group for concept development, reflects opportunities for major research program areas that will comprise Biosensor and Bioactuator Research Grand Challenges in the coming decade.","title":"Biosensing and Bioactuation Workshop","awardID":"0802647","effectiveDate":"2007-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7334","name":"MATHEMATICAL BIOLOGY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1712","name":"DMR SHORT TERM SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1972","name":"ELECTROCHEMISTRY & SURFACE CHE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"7643","name":"ENVIRONMENTAL SUSTAINABILITY"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1639","name":"SENSORS AND SENSING SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7478","name":"DYNAMICAL SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7479","name":"Biomechanics & Mechanobiology"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"7236","name":"BIOPHOTONICS, IMAGING &SENSING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1144","name":"Biomolecular Dynam,Struc,Func"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"7350","name":"NAT ECOLOGICAL OBSERVATORY NET"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1112","name":"Genetic Mechanisms"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1114","name":"Cellular Processes"}}],"PIcoPI":["564946"],"PO":["410447"]}}