{"56809":{"abstract":"Institution: University of Pennsylvania<br\/>Proposal Number: EIA 0089872<br\/>PI: Elaine L. Zanutto<br\/>Title: Collaborative Research: Statistical Methodology for Studying Women and Minorities in Information Technology Careers Using CPS and SESTAT Data<br\/><br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds to find a statistical methodology for dealing with the limitations of data sets with small sample sizes for special subgroups of interest. The data sets to be used for the study are the Current Population Survey (CPS) and the NSF's SESTAT database. The researchers propose to study, develop, and demonstrate methods of statistical inference that will provide improved inferential conclusions than currently appear in the literature. These methods will address questions of whether or not, after taking into account all the relevant background characteristics such as education and experience, there are disparities in salary, promotion rates, and job responsibilities among women and underrepresented minorities in IT. They will also attempt to identify unique characteristics of successful women and underrepresented minorities in IT careers. This project has the potential to provide improved methodology for researchers using the CPS and SESTAT data sets as well as insights about women and underrepresented minorities who pursue IT careers.","title":"ITW: Collaborative Research: Statistical Methodology for Studying Women and Minorities in Information Technology Careers Using CPS and SESTAT Data","awardID":"0089872","effectiveDate":"2001-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[146169],"PO":["564181"]},"56081":{"abstract":"The IEEE INFOCOM Conference on Computer Communications will be held in<br\/>Anchorage, Alaska, during April 22-26, 2001. This preeminent technical conference is<br\/>the primary venue for presenting new research results in the area of computer<br\/>communications, and is widely attended by researchers and practitioners in the field.<br\/>Attending conferences such as INFOCOM is of paramount importance for the<br\/>development of graduate students, post-doctoral researchers, and faculty members.<br\/> Participants have the opportunity to present their work, attend panel and keynote<br\/>sessions, and interact with hundreds of others performing leading-edge research in the<br\/>field. This proposal requests funding to aid approximate twelve graduate students, post-docs,<br\/>and junior faculty in the United States in attending this premiere conference.","title":"Travel Support for IEEE INFOCOM 2001 Conference; Anchorage, Alaska; April 22-26, 2001","awardID":"0087373","effectiveDate":"2001-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[143931],"PO":["194325"]},"69283":{"abstract":"","title":"High-Performance Switch Architectures for CC-NUMA Servers","awardID":"0196102","effectiveDate":"2001-01-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[179385,"516924"],"PO":["197478"]},"56042":{"abstract":"The San Diego Supercomputer Center (SDSC) and the National Laboratory for Applied Network Research (NLANR) will host a planning workshop that will bring together experts in the areas of networking and wireless - including satellite - communications, network administrators from the Experimental Program to Stimulate Competitive Research (EPSCoR) campuses, and field station researchers, in order to exchange and discuss information on the networking needs in the rural areas of the country. Rural areas across the nation include field stations and observatories for various scientific disciplines, as well<br\/>as remote schools, including tribal colleges. This workshop will be the starting point to exchange state-of-the-art with state-of-practice information, and to discuss the projected network communication needs of the researchers, as well as to develop a consensus of probable paths to solving these needs.","title":"Workshop: Ubiquitous Computing for Research and Education in Rural Areas - a Goal","awardID":"0087212","effectiveDate":"2001-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["554383"],"PO":["389815"]},"69463":{"abstract":"","title":"Visualization and Software Architectures for Volumetric Displays","awardID":"0196351","effectiveDate":"2001-01-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["499748"],"PO":["551992"]},"57550":{"abstract":"This research focuses on devising practical methods for high-level design validation of microprocessors and supporting CAD tools based on explicit design error modeling, design error simulation, model-directed test generation, and design error correction. Specifically, the research concentrates on the following issues: (a) the development of a high-level design error simulation method based on a new high-level critical path tracing approach; (b) the establishment of high-level controllability and observability measures that can be used to guide the test generation for design errors; (c) the development of high-level test generation algorithm(s) that generate instructions to detect modeled and actual high-level design errors in microprocessors; (d) the development of high-level design error location, diagnosis, and correction methods that pinpoint the error location and suggest ways to correct it; and (e) the formation of a set of guidelines that facilitate design for validation and post-silicon validation.","title":"CAREER: A Comprehensive High-Level Design Validation Approach for Microprocessors","awardID":"0092867","effectiveDate":"2001-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[148028],"PO":["562984"]},"69255":{"abstract":"","title":"Cache Coherence in Wormhole Networks","awardID":"0196074","effectiveDate":"2001-01-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["179385","516924","553537"],"PO":["321058"]},"57441":{"abstract":"This proposal addresses the applicability of high-speed communication networks to replace on-chip global and semi-global interconnects. Macrocells with the limited number of gates and wires are connected through the communication network. Limiting the number of gates per macrocell is shown experimentally to reduce the number of metal layers needed for circuit implementation. Additionally a basic research on 3-D interconnect standard cell design for predictability of interconnect related parameters is proposed. This is a combined educational and research effort. The goal is to overcome the limitations imposed by ultra-large scale integrated (ULSI) interconnects. Basic research is being conducted is in: (1) the applicability of high-speed on-chip communication networks to replace dedicated semi-global and global interconnects for use in microprocessor, ASIC, or SoC designs; (2) the incorporation of new 3-D interconnect standard cell design for capacitance and inductance predictability and hence timing, power, and area predictability; and (3) educational tools for grades 5-12 that promote student discovery in the problems and opportunities in present and future microprocessor design.","title":"CAREER: Interconnect Dominant ULSI Designs: A New Paradigm for 21st Century IC Design and Education","awardID":"0092450","effectiveDate":"2001-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["539892"],"PO":["562984"]},"62590":{"abstract":"","title":"Fall Panel Meeting Support (Task 29)","awardID":"0111437","effectiveDate":"2001-01-12","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["169508"],"PO":["565227"]},"56320":{"abstract":"0088071<br\/>Dickerson, Julie A.<br\/>Iowa State University<br\/><br\/>CRCD: Wireless Multimedia Communications for Virtual Environments<br\/><br\/>This project involves the transfer of research from several areas into an unusual curriculum that serves upper-level undergraduate and introductory-level graduate students at this university. The project integrates concepts from communications, radio frequency (RF) and very large scale integrated (VLSI) hardware and software design, with virtual environments into an interdisciplinary program that teaches students hardware\/software co-design. The curriculum (that includes three new courses) brings together teams of students and faculty who create solutions to complex problems that combine human factors, real-time systems, compact wearable computers, and highly sophisticated graphics. The three new classes cover software engineering for real-time software, the design of practical wireless devices, and the design of virtual environments. The curriculum developed in this project continually incorporates advanced research topics in virtual reality, sensor design, and wireless multimedia. By providing a venue for interdisciplinary work in communications, VLSI circuit design, and immersive environments, the curriculum offers coordinated experiences in complex system co-design and significantly broadens student skills in this area.","title":"CRCD: Wireless Multimedia Communications for Virtual Environments","awardID":"0088071","effectiveDate":"2001-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["462214","438098","496031","507725","188405"],"PO":["551712"]},"57673":{"abstract":"This research explores full-wave simulation techniques to facilitate the application of such tools to high-performance VLSI system design. It also investigates new design methodologies for system-level power delivery structures and on-chip interconnects for next-generation VLSI design. Computational work builds on an advanced full-wave simulation method: finite-difference time-domain (FDTD). The research focuses on 1) full-wave simulation algorithms to enable VLSI system-level full-wave simulation, 2) effective use of the full-wave simulation engine to investigate power fluctuation and signal integrity issues for VLSI interconnects, 3) exploration of time-of-flight effects, frequency-dependent behavior, and electrical and magnetic cross-coupling at the chip level, 4) investigation of power dip\/ground bounce for the purpose of identifying design blocks that are vulnerable to power fluctuations, 5) evaluation of the impact of decoupling capacitors on power delivery.","title":"CAREER: VLSI System-Level Full-Wave Simulation and Design Optimization","awardID":"0093309","effectiveDate":"2001-01-15","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["183505"],"PO":["562984"]},"69444":{"abstract":"","title":"Biocomplexity: Polynomial Complexity Computation, Representation Construction, and the Genetic Code","awardID":"0196327","effectiveDate":"2001-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["421169"],"PO":["491702"]},"56872":{"abstract":"Institution: University of California-Los Angeles<br\/>Proposal Number: EIA 0090043<br\/>PI: Jane Margolis<br\/>Title: Out of the Loop: Why Are So Few Underrepresented Minority High School Students Learning Computer Science<br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds to study why so few male and female African American and Hispanic students are studying computer science at the high school level. Specifically, the study will examine the decisions of college-bound African American and Hispanic students to take (or not take), persist (or not persist) in computer science courses beyond the introductory level. The research model considers the interplay between the high school educational environment and the psychological and cultural factors that affect male and female underrepresented minority students' interest in learning computer science. The sites of the investigation are schools within the Los Angeles Unified School District. This project has the potential to provide valuable insights about how to attract underrepresented minorities to IT classes in high school and college.","title":"ITW: Out of the Loop: Why Are So Few Underrepresented Minority High School Students Learning Computer Science?","awardID":"0090043","effectiveDate":"2001-01-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["324990","528136"],"PO":["289456"]},"55773":{"abstract":"EIA- 0086260<br\/>Cook, Diane J.<br\/>University of Texas at Arlington<br\/><br\/>CISE Educational Innovation: Integrating Intelligent Agent and Wireless Computing Research into the Undergraduate Curriculum<br\/><br\/>The research-base for this project is Artificial Intelligence (AI), in particular, rational agent development. The project provides undergraduate students with access to a large-scale distributed mobile agent laboratory containing both real and simulated agents. The focus of the project is new curriculum material for AI, mobile computing, multimedia, and robotics courses that allow students to test their knowledge in a real and virtual environment as well as new courses in human-computer interaction and wireless-multimedia computing. The PIs have demonstrated successful research and development of AI simulators that provide students with environments for testing agent design ideas in decision making, multi-agent cooperation, and learning. The PIs expanded agent environment includes real-world tasks involving distributed decision-making, cooperation with both human and computer agents, and wireless communication. The project increases students' interest and expertise in this area through hands-on experiences with physical and simulated collaborative environments. In particular, the project uses a wireless communication system, called Wireless Intelligent Simulator Environment (WISE), in this institution's Computer Science area that permits human, software, and robot agents to interact over a distributed environment. The WISE environment, in addition to supporting new features of this university's existing courses (in AI, Mobile Networking and Computing, Multimedia, Robotics, and Senior Capstone Design Courses), supports new courses in Human-Computer Interaction and Wireless Multimedia Computing.","title":"Educational Innovation: Integrating Intelligent Agent and Wireless Computing Research into the Undergraduate Curriculum","awardID":"0086260","effectiveDate":"2001-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["564777","547675","550149","172780","163585"],"PO":["551712"]},"69337":{"abstract":"","title":"Mobility Tolerant Adaptive Multicast Protocols for Ad Hoc Networks","awardID":"0196156","effectiveDate":"2001-01-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["436244","535238"],"PO":["565090"]},"60196":{"abstract":"This is funding in support of a doctoral research consortium (workshop) of promising graduate students and distinguished research faculty. The consortium will be held in conjunction with the ACM 2001 Conference on Human Factors in Computing Systems (CHI 2001), sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). The goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will also present their work during the technical program of the CHI 2001 conference. Extended abstracts of the students' work will be disseminated via publication in the CHI 2001 Extended Abstracts, which has wide print and electronic distribution. Evaluation of the consortium will be conducted by ACM SIGCHI's conference management committee, and results of the evaluation will be available to the organizers of future consortia.","title":"WORKSHOP: Human-Computer Interaction Doctoral Research Consortium","awardID":"0101295","effectiveDate":"2001-01-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[154611,"333704","466602"],"PO":["246649"]},"54784":{"abstract":"Current optical networks typically offer two degrees of service reliability: full (100%) protection (e.g., in presence of a single fault in the network) and no (0%) protection. This reflects the historical duality that has its roots in the once divided telephone and data environments, in which the circuit oriented service required protection, i.e., provisioning readily available spare resources to replace working resources in case of fault, while the datagram oriented service relied upon restoration, i.e., on dynamic search for and reallocation of affected resources via such actions as routing table updates. <br\/> The current trend, however, is gradually driving the design of networks towards a unified solution that will support, together with the traditional voice and data services, a variety of novel multimedia applications. Evidence of this trend over the last decade is the growing importance of concepts, such Quality of Service (QoS) and Differentiated Services to provide varying levels of service performance in the same network. According to the fact that today's competitive networks can no longer provide only pure voice and datagram services, the historical duality between fully protected and unprotected (100% and 0% reliability in case of a single fault) is rapidly becoming obsolete. Modern networks can no longer limit the options of reliability only to these two extreme degrees. On the other hand, while much work is being done on QoS and Differentiated Services, surprisingly little has been discussed about and proposed for developing differentiated network reliability to accommodate this change in the way networks are designed.<br\/> In this proposal, the researchers proposed to address the problem of designing cost effective multi-layer network architectures that are capable of providing various reliability degrees (as opposed to 0% and 100% only) as required by the applications. In the proposal, the concept of Differentiated Reliability (DiR) is for the first time formally introduced and applied to provide multiple reliability degrees (classes) in the same layer using a common protection mechanism, e.g., line switching or path switching. According to the DiR concept, each connection in the layer under consideration is assigned a minimum reliability degree, defined as the probability that the connection is available at any given time. The overall reliability degree chosen for a given connection is determined by the application requirements. In a multi-layer network, the lower layer can thus provide the above layers with the desired reliability degree, transparently from the actual network topology, constraints, device technology, etc. The cost of the connection depends on the chosen reliability degree, with a variety of options offered by DiR.<br\/> The proposed research explores the multifaceted aspects of DiR-based design of multi-layer optical networks, with specific emphasis on the IP\/WDM architecture. Optimally designing a DiR network is in general extremely complex and will require special techniques tailored to handle it with acceptable computational time. Therefore, along with research on the architecture and modeling of DiR-based networks the researchers propose a powerful novel discrete optimization paradigm to efficiently handle the difficult tasks. The optimization approach is based on adopting and adjusting the Fourier Transform technique for binary domains. This unique technique makes it possible to realize an efficient \"filtering\" of the complex design\/optimization problem, such that the solution becomes computationally feasible, while still preserving sufficient accuracy.","title":"Differentiated Reliability (DiR) in Multi-layer Optical Networks","awardID":"0082085","effectiveDate":"2001-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["564821","451890"],"PO":["250082"]},"57612":{"abstract":"The goal of this research is to provide a set of formal and semiformal techniques for system-level power\/performance analysis that can help the designer to select the right platform starting from a set of target applications. By platform we mean a family of heterogeneous architectures (which consist of both programmable and dedicated components) that satisfy a set of architectural constraints imposed to allow re-use of hardware and software components. Following the principle of orthogonalization of concerns during the design process, this methodology is based on the key idea of making a clear distinction between applications and architectures. Our approach to system-level analysis has three main objectives: 1) Application and platform modeling 2) Performance model evaluation 3) Performance model validation. Although the proposed methodology is completely general, our initial focus is on portable embedded multimedia systems (e.g., slim hosts like PDAs, network computers). For these systems, as opposed to the reactive embedded systems used in safety critical applications, the average behavior is far more important than the worst-case behavior. <br\/>The proposed methodology complements the existing techniques for extreme-case performance analysis by incorporating the environment characteristics into system performance evaluation. Being targeted at system-level, the results of this analysis are not confined to any particular hardware\/software implementation. Taken together, our proposed techniques will allow media systems designers to explore architectures more rapidly, estimate the impact of different design choices more robustly, and use large multimedia data benchmarks more effectively.","title":"CAREER: System-Level Power\/Performance Analysis for Embedded Systems Design","awardID":"0093104","effectiveDate":"2001-01-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["554461"],"PO":["562984"]},"69613":{"abstract":"","title":"Career: Prediction and Speculation in High-Performance Memory Systems","awardID":"0196504","effectiveDate":"2001-01-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["342332"],"PO":[180163]},"48845":{"abstract":"This work develops a framework for the replication of heterogeneous multimedia data for achieving high availability while maintaining low access cost. The framework encompasses various aspects of replication in distributed systems: users and policy, networks, and servers. The research develops the technical concept of quality quorum systems to enable efficient and robust multimedia replication. The results of the research is brought together in a Heterogeneous Multimedia Object Replication (HUMOR) system. The work has a significant impact on distributed server architecture design, multimedia databases, digital libraries, and distant learning environments.","title":"Replication of Heterogeneous Multimedia Data","awardID":"9988404","effectiveDate":"2001-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["393307","558560"],"PO":["309350"]},"48814":{"abstract":"The objective of this research is to investigate formal modeling and <br\/>analysis methods that are applicable to large-scale real-time distributed<br\/>systems, such as networked virtual environments. The research focuses on<br\/>the development of techniques and tools for performance analysis of<br\/>network protocols and Quality-of-Service requirements analysis of the<br\/>network connecting distributed real-time applications. <br\/>It is proposed to work on the following tasks:<br\/>1) Develop (extended fuzzy-timing Petri net) models for protocols in each<br\/>layer of network architecture;<br\/>2) Conduct network performance analysis and evaluate network effects on<br\/>several distributed real-time applications;<br\/>3) Focus on the development of new techniques to deal with the state <br\/>explosion problem; and<br\/>4) Maintain an open library of models for real-time distributed<br\/>applications.<br\/>The significance and impact of the research are: <br\/>1) Provide an integrated framework to conduct performance analysis for<br\/>large-scale real-time distributed systems with high efficiency; <br\/>2) Help designers of distributed real-time systems in testing, planning, <br\/>and improving their work; and<br\/>3) Help students learn formal modeling and analysis methods for <br\/>network-based software design via graphic interface and simulation.","title":"Performance Modeling and Analysis of Real-Time Distributed Systems","awardID":"9988326","effectiveDate":"2001-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[124950,124951],"PO":["309350"]},"48729":{"abstract":"The purpose of this research project is to study the main aspects of information visualization through graph drawing models. The basic approach is to model complex data (having a hierarchical structure and\/or temporal and spatial components) as graphs, and then formulate the visualization problem as a graph drawing problem. The quality of the resulting data representation is measured by an appropriate objective function that characterizes the quality of the fit. Efficient and robust algorithms will be developed for solving the underlying optimization problem. Furthermore, the effects of small perturbations of the data in their resulting graphical representation are assessed. The algorithms are tested on a wide variety of synthetic data and real data from the social, physical and life sciences. The methodology is implemented in GRAVIS, a proof-of-concept tool that will be freely available at http:\/\/www.stat.lsa.umich.edu\/~gmichail\/gravis. The ultimate goal of the project is to establish a solid methodological and mathematical foundation for the problem of information visualization.","title":"Information Visualization Through Graph Drawing: Modeling, Analysis and Optimization Issues","awardID":"9988095","effectiveDate":"2001-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["521130"],"PO":["563751"]},"56837":{"abstract":"Institution: University of Chicago<br\/>Proposal Number: EIA 0089930<br\/>PI: Michael D. Larsen<br\/>Title: Collaborative Research: Statistical Methodology for Studying Women and Minorities in Information Technology Careers Using CPS and SESTAT Data<br\/><br\/>This CISE Information Technology Workforce (ITW) proposal requests funds to find a statistical methodology for dealing with the limitations of data sets with small sample sizes for special subgroups of interest. The data sets to be used for the study are the Current Population Survey (CPS) and the NSF's SESTAT database. The researchers propose to study, develop, and demonstrate methods of statistical inference that will provide improved inferential conclusions than currently appear in the literature. These methods will address questions of whether or not, after taking into account all the relevant background characteristics such as education and experience, there are disparities in salary, promotion rates, and job responsibilities among women and underrepresented minorities in IT. They will also attempt to identify unique characteristics of successful women and underrepresented minorities in IT careers. This project has the potential to provide improved methodology for researchers using the CPS and SESTAT data sets as well as insights about women and underrepresented minorities who pursue IT careers.","title":"ITW: Collaborative Research: Statistical Methodology for Studying Women and Minorities in Information Technology Careers Using CPS and SESTAT Data","awardID":"0089930","effectiveDate":"2001-01-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["522819"],"PO":["564181"]},"61722":{"abstract":"The next generation integrated circuit (IC) chips will contain nano-scale high-density interconnects with thousands of I\/O pins. Due to the physical size of conventional needle probes, the existing probe method of characterizing and testing chips is no longer a viable technique as the number of I\/Os increases. This project proposes to investigate the feasibility of using micro-electro-mechanical systems (MEMS) technology to probe CMOS circuits on wafer level. This project focuses on (1) the development of high frequency electrical models of nano-scale on-chip interconnects and CMOS circuits, (2) the fabrication of a novel MEMS probe structure for testing high-density circuits, and (3) the demonstration of the MEMS probe structure to characterize circuits in nano-scale design.","title":"SGER: Design of MEMS Probe for Testing Nano-Scale Interconnects","awardID":"0107624","effectiveDate":"2001-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["335395"],"PO":["562984"]},"55904":{"abstract":"This research explores the interconnect problem in nanotechnology, which involves solving problems relating to design of high density of devices and high speed of transmission of within the circuit. The approach is to investigate a modified version of the traditional metallic interconnects. The modification consists in using the concept of parallel processing by providing two or more paths between the driver and the load stacked vertically isolated from one another by insulating layers between them. In addition to heating problems, this research also studies the parasitics associated with such a structure, the propagation delays expected in it and the potential problem of crosstalk among the various paths of the same interconnect and that among the neighboring interconnects. The model of the multipath interconnects includes the self and coupling parasitic capacitances and inductances in addition to the very high-frequency effects.","title":"SGER: On Solving the 'Interconnect Problem' for the Nanotechnology Circuit Design","awardID":"0086609","effectiveDate":"2001-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["539354"],"PO":["562984"]},"61735":{"abstract":"EIA-0107708<br\/>Kirstie Bellman<br\/>Aerospace Corporation<br\/><br\/>Title: NGS: Virtual Worlds and Simulation Conference (VWSIM'01)<br\/><br\/>Over the last several years,new advances have been made in creating collaborative virtual places, populated by both intelligent agents and human players. Unlike the usual homogenous simulation system, part of the strength of a Virtual World (VW) is its ability to become the common meeting ground for a variety of different types of computer-based processing capabilities. During January 7-11, the Society for Computer Simulation will hold its fourth Virtual Worlds and Simulation Conference (VWSim'01) in Phoenix, Arizona. Although this conference has always been noted for its diversity, this year we are making a special effort to bring in several users of distance education amd telemedicine. The requested funds will support researchers in the areas such as distance education and distance medical projects, teachers and healthcare practioners who will report on ongoing VW projects in The Navajo nation and in rural Alaska.","title":"NGS: Virtual Worlds and Simulation Conference (VWSIM '01)","awardID":"0107708","effectiveDate":"2001-01-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["173452"],"PO":["301532"]}}