{"28070":{"abstract":"9734102 Large software projects produce many documents of many different types that, together, describe the plans for, implementation of, and experience with the program. Ensuring that these documents do not have serious conflicts with each other is a critical task in any real software system, but requires a level of integration among the different types of software documents that is not possible with current development tools. This research project is working to identify the document representations, software tools, and user interface services that are required to integrate program source code and all other software documents into a seamless, interconnected whole. The project is producing a prototype development environment that allows arbitrary multimedia documentation and hyperlinks inside program source files and additional tools for managing and understanding the relationships between software documents. This research is significant because it is breaking down the barriers that currently exist between program source code and the natural language documents that motivate, evaluate, and explain it. The educational component of this CAREER project seeks to attract students from underrepresented groups to the study of computer science through outreach and a summer program curriculum and is also enhancing the department's software curriculum through new graduate course offerings. ***","title":"CAREER: Representations, Tools, and Services for the Complete Integration of Software Development Documents","awardID":"9734102","effectiveDate":"1998-04-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["367915"],"PO":["564388"]},"28061":{"abstract":"9734026 Reinhardt The boundary between hardware and software in computer system design constantly changes with advances in technology. This project includes both research and education at this boundary. Research will include new techniques for software cache management: cache hardware that permits additional software control, instruction pipeline enhancements that enable low-overhead execution of cache management software, and software implementations of new cache management policies. Education at the hardware\/software boundary will include introduction of field-programmable gate arrays (FPGA) in the undergraduate laboratories, involvement of undergraduates in research, and incorporation of recent research into the graduate curriculum. ***","title":"CAREER: Architectural Support for Software Cache Management","awardID":"9734026","effectiveDate":"1998-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["383899"],"PO":["197478"]},"26094":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for 24 months to connect an elementary school and a middle school to the Internet using microwave technology. The wireless link will connect to a high school, which has a fiber connection to the Internet.","title":"A village and School District Microwave Wide Area Network","awardID":"9727873","effectiveDate":"1998-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[65763,65764,65765,65766,65767],"PO":["121202"]},"27492":{"abstract":"*** 9732035 Dynes This grant will continue the support of an REU Site in the Department of Physics at the University of California, San Diego. Applications will be considered from students from colleges and universities nationwide. Students will participate in an individual research project supervised by a Physics Department faculty member. Students will be integrated into research groups of their supervisors, giving them a first-hand view of research in an academic setting. Student projects will include experimental, theoretical and computational research in high energy physics, condensed matter physics, biophysics, plasma physics, astrophysics, and nonlinear physics. The research projects will be designed to lead students from a dependent research status to one which will allow each student to become as independent as their research skills and abilities permit. This activity is supported jointly by the NSF Division of Physics and the Division of Materials Research. ***","title":"REU: Physics Research Experience for Undergraduates at the University of California, San Diego","awardID":"9732035","effectiveDate":"1998-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["303104","298301"],"PO":["125898"]},"32082":{"abstract":"9808271 Choset, Howard M. Carnegie Mellon University CISE PostDoc: Exact Topological Localization without Explicit Localization Localization is crucial to the realistic implementation of sensor based exploration, which is a task that enables a robot to explore and build a map of an unknown environment. The robot needs localization to determine if it is exploring new territory or re-encountering an already mapped region. First, the proposed work suggests a new map, termed the topological Voronoi graph, which only stores the nodes, adjacency relationships between the nodes, and the distance between nodes of the generalized Voronoi graph structure. Instead of using complicated sensor and encoder error models to determine the robot's location, the robot exploits the topology and geometry of the topological Voronoi graph to determine its location in this graph, and thus infer its location in the work space. This method is theoretically well founded and simpler to implement than conventional methods. Furthermore, the proposed method extends into any dimensioned space where conventional methods are computationally intractable. The proposed work will be demonstrated in a 10,000 square feet area. The Post-doctoral candidate, having mastered the Voronoi graph approach, will bring his vast experience in mobile robot programming.","title":"CISE Postdoc: Exact Topological Localization without Explicit Localization","awardID":"9808271","effectiveDate":"1998-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["553216"],"PO":["297837"]},"27980":{"abstract":"9733660 Heineman This research focuses on novel techniques for designing software components that provide a mechanism for adapting their behavior. Traditional approaches to component reuse are limited in that a component must exactly meet the needs of an application builder before it can be reused. This research proposes a new direction by suggesting that component-based software development will only occur when application builders can adapt software components to suit their needs. The first objective is to aid component designers in designing and implementing highly reusable components. The language-independent solution proposed by this research applies equally well to components written in C, C++, or Java. The second objective is to provide an architectural description language for specifying adaptations to individual components as needed for a target application. The third objective is to construct a design tool that helps users compose applications from adaptable components. A fourth objective is to define a reengineering methodology for retrofitting existing legacy code into adaptable components. A final objective is to train our students in designing highly reusable software components and building applications from software components. This research will greatly increase the ability to create large, complex systems from independently implemented software components. ***","title":"CAREER: A Model For Designing Adaptable Software Components","awardID":"9733660","effectiveDate":"1998-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["355586"],"PO":["564388"]},"49155":{"abstract":"","title":"Presidential Faculty Fellows","awardID":"9996133","effectiveDate":"1998-04-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["463055"],"PO":["250083"]},"28156":{"abstract":"New Traffic Models for Internet Connections and VBR Video Traffic This project examines new models for application and connec- tion level traffic on the Internet. The objective is to better understand the impact of this traffic on network congestion. Features of Internet traffic such as its non- Poisson statistics and long range dependence are a point of departure from typical traffic on circuit switched networks. As packet traffic progresses from the user application to its destination across a network, it undergoes a variety of transformations. These linear and\/or nonlinear transforma- tions give rise to structural features in an otherwise ran- dom traffic stream. The result is high variability in the network traffic mix. Identifying and controlling the source of these traffic features is important in real-time resource allocation and network traffic engineering. The work in this project uses measured network data to identify the feature space required to model Internet usage. Traffic generation from end users, network protocols and video-coders are con- sidered. Non-linear time-series models will be used to characterize connection and application level traffic. These models have the flexibility to address a range of traffic types from short-range dependent stochastic processes to those with self-similar and deterministic features. At the application level, particular attention is paid to the gen- eration of layered variable bit rate video and into the in- fluence of encoding parameters on traffic characteristics, model parameters and performance. The time-series modeling framework will be used to design optimal rate control algo- rithms with perceptual and network driven cost constraints. The traffic models obtained will allow one to assess and control end systems and provide network level control for problematic traffic sources. The results will also provide quantitative evaluation of what types of traffic can be su- perposed to yield suitable statistical multiplexing gains. In conjunction with the research effort, a graduate and un- dergraduate curriculum in the network performance area will be developed. The courses and projects will support the development of end-to-end problem solving skills. The aim is to integrate research and interdisciplinary ideas from engineering and physical sciences into the solution of telecommunications related problems. Ongoing activities under this project can be found at http:\/\/morse.uml.edu\/-kchandra\/career.","title":"CAREER: New Traffic Models for Internet Connections and VBR video Traffic","awardID":"9734585","effectiveDate":"1998-04-01","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["388427"],"PO":["234222"]},"31370":{"abstract":"9805823 Amato, Nancy M. Trinkle, Jeffrey, C. Texas A&M University CISE PostDoc: Real-Time Multibody Dynamics for Virtual Environment Training Systems with Haptic User Interfaces In USA today, about 5% of the industrial salary base is spent on training. Training systems based on virtual environments (VE) will enable workers to practice operating new equipment before it is installed, and perhaps more importantly, will allow the results of improper operation to be simulated without incurring the associated costs. The biggest deficiency in VE systems is their inability to animate the motions of bodies in contact. For example, a dropped wrench will usually either magically disappear from the virtual scene, or accelerate through all obstacles in its path. This project will develop fundamental technical results and algorithms needed to: (1) embed the physics of moving bodies into the underlying motion simulator, (2) allow two-way interaction between the user and the VE through a haptic device, (3) provide a system to help workers plan complex maintenance tasks, and (4) systematically analyze the effects of uncertainty in the parameters of the dynamic and geometric models of the VE. The postdoctoral researcher will participate in the high-level design of the VE training system, and will have primary responsibility for one or more of the system components. His\/her expertise will enable the project to produce a higher-quality, more robust system.","title":"CISE PostDoc: Real-Time Multibody Dynamics for Virtual Reality Training Systems with Haptic User Interface","awardID":"9805823","effectiveDate":"1998-04-15","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["534411","561154"],"PO":["564318"]},"33680":{"abstract":"Runtime systems are critical to the implementation of parallel programming languages and libraries. They provide the core functionality of a particular programming model and the glue between the model and the underlying hardware and operation system. As such, runtime systems have a large impact on the performance and portability of parallel programming systems. Despite the importance of runtime systems, there are few forums in which practitioners can exchange their ideas, and these are typically forums showcasing peripheral areas, such as languages, operating systems, and parallel computing. This Workshop on Runtime Systems for Parallel Programming (RTSPP) will provide a forum for bringing together runtime system designers from various backgrounds to discuss the state-of-the-art in designing and implementing runtime systems for parallel programming. Rather than focusing on languages or compilers, the focus of RTSPP is squarely on runtime system design and evaluation.","title":"RTSPP 98 Workshop Being Held March 30, 1998 in Orlando, Florida","awardID":"9812688","effectiveDate":"1998-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["179737"],"PO":["565272"]},"26740":{"abstract":"9729768 Rocke, David M. University of California - Davis CISE Research Instrumentation : Applications of Parallel Computing in Computer Science, Computer Engineering, and Analysis and Visualization of Massive Date Sets This research instrumentation enables research projects in: - Applications of Parallel Computation,- Compiler Optimization Using Integer Programming, - Synthesis of Pipelined Hardware\/Software Systems,- Analysis and Visualization of Massive Data Sets, and - Languages, Compilers and Systems. To support the aforementioned projects, the University of California, Davis will purchase a symmetric multiprocessor parallel computer. All of these projects either involve development of software for parallel computers or require the high-performance of such a system. The methods and software developed under this project will be available to researchers in computer science and engineering and in applications areas such as genetics and environmental science.","title":"CISE Research Instrumentation: Applications of Parallel Computing in Computer Science, Computer Engineering, and Analysis and Visualization of Massive Date Sets","awardID":"9729768","effectiveDate":"1998-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["375319",67347,"495182"],"PO":["301532"]},"32691":{"abstract":"This meeting is to bring together researchers who have applied methods for learning from delayed reward to real- world problems and to review progress along these lines. The invited speakers represent different theoretical paradigms, and the focus of the meeting on applied problems will encourage communication across traditional disciplinary boundaries. A review paper will be produced for distribution to the research community that summarizes the results of the workshop and should encourage further basic research in learning, in order to increase the breadth and effectiveness of applications.","title":"Research Planning Workshop on Applications of Reinforcement Learning","awardID":"9810208","effectiveDate":"1998-04-15","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["559662",82330],"PO":["565227"]},"33791":{"abstract":"Coping with the massive amounts of data produce by multi-teraflop or petaflop computers is a fundamental problem in scientific computing. This proposal provides support for two workshops, which are part of the continuing series of NSF\/DOE workshops on \"Visualization and Data Corridors.\" The first of these workshops, to be held in Bodega Bay, California, April 6-8, will survey the state of the art of manufacturers of graphics hardware and I\/O systems. The second, to be held in Duck, North Carolina May 19-21, is retreat to help organize the anticipated federal initiative in this area. Together these two workshops will develop a set of requirements for the planned \"visualization and data corridor\" and develop a technology roadmap leading to the development of such corridors.","title":"Planning Workshops for High-End Computing to be held April 6-8, 1998, in Bodega Bay, California, and May 19-21, 1998, in Duck, North Carolina","awardID":"9813025","effectiveDate":"1998-04-15","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"Y744","name":"ENERGY-DATA & VISUALIZATION CO"}}],"PIcoPI":["142322"],"PO":["179296"]},"29612":{"abstract":"When we design queue sizes, link bandwidths, and other network parameters, we assume that successive packets are statistically independent. We make this assumption because (1) we don't have a good way to specify such dependencies, (2) our useful underlying mathematical tools are based on this assumption, and (3) it has given us decent results. However, in broadband and\/or wide-area networks, it's no longer clear we're getting decent results. In this research project, the theory of Probabilistic Context-Free Grammars is proposed as a tool for specifying statistical dependence among successive packets in a network. We will try to extend the underlying mathematics, the N-Type Branching Process, so it can specify the queue sizes, link bandwidths, and other network parameters. Eventually, we will compare the specifications from the classical design and from this new design to real measurements. For the SGER component of this project, we will develop a convincing example. This example will show how a Probabilistic Context-Free Grammar can be used to specify statistical dependence among successive packets in a network. It will illustrate how the current state of the underlying mathematics (the N-Type Branching Process) can be used to specify network parameters (packet queues, link bandwidths, etc.) more realistically than does the classical design technique (that assumes packet independence). This illustrative example will be used in a follow-up proposal for an extended research project.","title":"Using Probabilistic Context-Free Languages and the BranchingProcess to Model Packet Dependence in Telecommunications Traffic Simulations and Calculations","awardID":"9800518","effectiveDate":"1998-04-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["544700"],"PO":["565090"]},"28017":{"abstract":"Interactive rendering is crucial to virtual design and prototyping of large engineering models. This research will produce techniques to significantly speed up the rendering of surface models on current graphics systems. The emphasis will be on novel algorithmic improvements in processing and rendering of large models. The effectiveness of using analytic surfaces and other higher order representations of large models will also be investigated. Such representations contain more information than polygonal representations, but take less space to store. Recent improvements in efficient tessellation and rendering of parametric surfaces have opened up new possibilities for speeding up the rendering of large surface models. This research will use and improve these results. In particular, it will result in the following: - Higher-order and hierarchical representations tessellated on- line into a small number of triangles, based on the user's position - Efficient visibility processing of surfaces - Interactive rendering of dynamically changing surfaces - Improved sampling of surfaces for the generation of textured polygonal approximations - Configurable system that adjusts rendering speed and quality without requiring user input - Algorithms that scale well with both available computing resources and model size - A unified framework that allows various techniques to inter-operate and results in combined improvement in the state of the art The project also includes design and installation of new computer graphics courses and laboratories in the computer science department at the Johns Hopkins University. Significant interactions between the classrooms and laboratories are planned. The usenet and the world wide web will be widely used to augment the classroom teaching. In addition, seminars and informal meetings will be organized to discuss research in computer graphics.","title":"CAREER: Integrated Environment for Interactive Rendering of Large-Scale Solid Models","awardID":"9733827","effectiveDate":"1998-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["218093"],"PO":["179846"]},"26852":{"abstract":"97-30028 Wang, Yao Guleryuz, Onur G. Polytechnic University CISE Research Instrumentation: Integrated Video Encoding and Networking This research instrumentation grant contributes to enable the following research projects: - Multiple Description Coding and Multiple Path Transport for Video Communication over Unreliable Networks, - Video Packet Transmissions with Renegotiated Service Parameters, - Traffic Control and Admission Control for Video Networks, - Dense Motion Field Estimation and Representation for Video Compression, and - Stereo Sequence Compression. The next generation Internet must support many applications with widely varying performance requirements. Among these, the transmission of delay-sensitive compressed video traffic poses a unique challenge. The main objective of this project is to show that the efficiency of a video network can be improved by increasing the integration of video coding and video networking. Solutions with practical impact can only be achieved if the concepts are shown to be practically feasible in an actual testbed. The requested instrumentation will be used to set up a Video Networking (VINE) testbed. This testbed will enable collaborative research in robust video encoding and transport, video-aware resource reservations, and traffic control and admission control of video services. The requested video equipment will also facilitate other video coding research.","title":"CISE Research Instrumentation: Integrated Video Encoding and Networking","awardID":"9730028","effectiveDate":"1998-04-15","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["525973","491898","263351","148214"],"PO":["301532"]},"31340":{"abstract":"9805721 Waxman, Ronald Association for Computing Machinery Special Project: U.S. Attendance at the 15th IFIP World Computer Congress (WCC '98) This award provides partial support for 15 representatives from the U.S. to attend the 15th IFIP World Computer Congress in Vienna, Austria, and Budapest, Hungary, August 31-September 4, 1998. The International Federation for Information Processing (IFIP) is a multinational federation of technical organizations concerned with information processing. The Federation on Computing in the U.S. (FOCUS), a joint activity of the ACM and the IEEE Computer Society, serves as the U.S. representative to IFIP and is administering this project. The participants in the project are selected on a competitive basis by a committee of reviewers, with emphasis given to young researchers doing outstanding work and to applicants who have been accepted to present papers or are otherwise significantly involved in the conference.","title":"Special Project: U.S. Attendance at the 15th IFIP World Computer Computer Congress (WCC'98)","awardID":"9805721","effectiveDate":"1998-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[79014],"PO":["289456"]},"31186":{"abstract":"9805216 Kavi, Krishna M. University of Alabama in Huntsville CISE Postdoctoral Experimental Research for the Evaluation of Multithreaded Architectures Recent trends in technology have resulted in a widening of the performance gap between memory and processors. Multithreading has been touted as the solution to minimize the loss of CPU cycles due to memory latency by executing several instruction streams simultaneously. Over the past several years, the PI has been investigating multithreaded architectures, both based on dataflow paradigm and hybrid dataflow-control flow paradigms. This research led to the introduction of cache memories for dataflow architectures, coherent I-structure cache memories, and staggered allocation of DOACROSS loops for multithreaded architectures. The post-doctoral researcher will extend the work on trace generation tools to generate sufficiently large instruction traces for dataflow and hybrid architectures. Whenever possible, traces for conventional architectures will be converted into traces for dataflow and multithreaded systems. This will aid the PI's research significantly in evaluating the applicability of the dataflow\/hybrid models and new architectural innovations such as scheduled dataflow, and speculatively preloading thread contexts for a wider range of programming models and applications. The successful completion of the research will have a broader impact on computer architecture research by facilitating the generation of large traces for innovative architectures without the need for compilers and runtime systems for experimentally evaluating the new architectures, and at the same time help to broaden the Postdoctoral Associate.","title":"Post-Doctoral Experimental Research for the Evaluation of Multithreaded Architectures","awardID":"9805216","effectiveDate":"1998-04-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["13545"],"PO":["564318"]},"26699":{"abstract":"Alaska Pacific University, located in Anchorage, Alaska is Alaska's only private, independent university. It serves a wide variety of undergraduate and graduate programs. This grant will help fund Internet access for the institution by supporting the acquisition of a T1 line to a local Internet Service Provider, along with connection equipment and service provider fees. The students and faculty of the Alaska Pacific University need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"APUNET- (Alaska Pacific University Intra\/Internet)","awardID":"9729686","effectiveDate":"1998-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67223,67224],"PO":["121202"]},"31286":{"abstract":"9805542 Launchbury, John Oregon Graduate Institute PostDoc: Verification of Microprocessor Microarchitectures Under the Post-Doctoral Research Associateship methods are being developed for verifying concurrent properties of microprocessor microarchitectures, such as liveness and sequential equivalence. Existing verification techniques are being adapted, integrated and evaluated in the context of the Hawk microarchitectural specification language. The objective of this research is to demonstrate that the use of design abstraction enables formal verification technology to be used to verify significant properties of complete microarchitectures. This work blends with parallel research on further developing the Hawk language implementation, and on using Hawk to specify realistic models of commercial microprocessors, with all their accidental complexity. The Hawk language provides abstractions that make explicit much of the information that is needed for this purpose, and the cleanliness and compactness of Hawk specifications provides powerful leverage on the verification problem. In particular, Hawk specifications avoid much of the detail of typical logic-level specifications. Further, Hawk's declarative nature provides it with great potential for formal manipulation. New, hybrid verification technology is being built by combining an appropriate temporal logic with model checking. The temporal logic is used to express the concurrent property of interest, and models are constructed automatically by abstract interpretation of Hawk specifications.","title":"CISE PostDoc: Verification of Microprocessor Microarchitecture","awardID":"9805542","effectiveDate":"1998-04-15","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["133791"],"PO":["297837"]},"28109":{"abstract":"9734265 Palsberg The goal of the project is to develop type inference algorithms for object-oriented software which are practically useful for tool developers and language designers. An example application is tool support for transforming a dynamically typed prototype application into a statically typed product. The currently known algorithms do not handle the combination of features found in commonly used languages, and none of the algorithms are known to scale well. The project will develop new type inference algorithms, it will perform large scale experiments with them, and it will investigate new language designs where type inference is smoothly integrated. Along with this, a hands-on course on programming languages is being developed, focusing on the similarities and differences between object oriented and functional programming. ***","title":"CAREER: Type Inference for Object-Oriented Software","awardID":"9734265","effectiveDate":"1998-04-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["558389"],"PO":["397849"]},"27911":{"abstract":"The research component of this Faculty Early Career Development (CAREER) Program Award is addressing the problem of real-time correction of image degradation in infrared and laser imaging systems used in satellite imaging, aerial surveillance and reconnaissance, astronomical imaging, and target recognition. The types of degradation considered are due to the non-ideal characteristics of array sensors and atmospheric turbulence. The most limiting degradation in the performance of array sensors arises from the spatial and temporal nonuniformities in the sensors' responses. This research employs a statistical real-time-correction approach that avoids the need for costly calibration-based correction techniques that require the camera to steer away from the target for the duration of the calibration. The model-based statistical approach undertaken for nonuniformity correction is adapted to restore images degraded by atmospheric turbulence. The fundamental question of determining the optimal exposure time (or number of frames) needed for a given system in the presence of quantum noise is also being addressed. The algorithms developed in this research will be implemented in real systems through the investigator's collaborative efforts with the government and industry. The educational component of this research includes activities designed to motivate and excite undergraduate engineering students and strengthen the structure of the Dayton Area Graduate Studies Institute (DAGSI) Program that is a vital component of the Dayton-Area higher education system. These educational activities include: (1) demonstrating the practical research findings to undergraduate and graduate students by improving certain existing engineering courses; (2) offering periodical seminars available to nine local higher- education institutions and the DAGSI program through an interactive video network; (3) enhancing the practical training of students through collaboration with the local industry an d government laboratory; and, (4) actively involving the research assistants in this research in undergraduate education.","title":"CAREER: Statistical modeling and real-time correction of nonuniformity in array sensors","awardID":"9733308","effectiveDate":"1998-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["417282"],"PO":["564898"]},"31312":{"abstract":"98-05604 Cleaveland, Walter R. North Carolina State University CISE PostDoc: Verification Tool for Net-based Programming This project is devoted to the development of effective automated techniques for modeling and reasoning about the correctness of network-based software. The motivation for the project arises from the exploding popularity of programming in net-based languages like Java coupled with the fact that an incorrectly functioning net-oriented program can inflict serious damage on a whole network and not just on a single site within the network. The methods to be used by the research effort are based on those used successfully in the analysis of finite-state systems such as communications protocols and in the rigorous modeling of programming language constructs. The PI has substantial experience in the former but very little with the latter; the addition of a postdoctoral research associate with a background in the latter is therefore essential for the project's anticipated results---a collection of techniques, and associated tools, for analyzing automatically the safety and fault-tolerance of mobile code---to be achieved.","title":"CISE PostDoc: Verification Tools for Net-Based Programming","awardID":"9805604","effectiveDate":"1998-04-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["417615",78952],"PO":["173164"]},"31335":{"abstract":"9805694 Hodgins, Jessica K. Georgia Institute of Technology CISE PostDoc: Animation of Human Motion with Experimentally Determined Parameters Despite significant recent progress, creating believable animations of human motion remains a difficult task. One potential solution to this problem is to use control systems coupled with dynamic simulations of the human body to generate motion. The proposed research seeks to increase the realism of simulations by adding stylistic components to such motions as running and gesturing. These components will be extracted from experimental motion capture data of human actors and used to drive physically realistic simulations of humans. The postdoctoral associate will also explore whether the introduction of noise into a simulation enhances the appearance of the resulting motion. Noise characteristics will be experimentally quantified by asking test subjects to view animated sequences. A theoretical analysis of the simulations should determine a priori bounds on the amount of variation that can be added to a simulation without causing instability. The postdoctoral associate brings a strong background in control as well as expertise in motion capture experiments to the project. The knowledge gained from analyzing human motions and the introduction of noise into the motion will increase our understanding of how people move and may lead to applications in physical rehabilitation and sports medicine.","title":"CISE PostDoc: Animation of Human Motion with ExperimentallyDetermined Parameters","awardID":"9805694","effectiveDate":"1998-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["438709"],"PO":["297837"]},"31754":{"abstract":"This award supports a two day workshop on April 1-2, 1998 to develop a plan to implement a Quality of Service infrastructure. The approximately 100 participants represent the following groups: Gigapop operators, universitites, appropriate corporate partners, invited researchers, and applications efforts. Results of this award include a specific plan for QoS testing, leading to an action plan for implementation. An initial report was posted on the Internet within one month of the conference, and a hard cover publication followed.","title":"First Internet2 Joint Applications\/Engineering Quality of Service (QoS) Workshop","awardID":"9807142","effectiveDate":"1998-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["427208","239096","121201",80018],"PO":["121202"]},"32612":{"abstract":"9810022 A series of two planning workshops are supported with the goals of establishing the state of the art in the three scientific communities of Computer Security, Fault Tolerance, and Software Assurance and to set the course for future research. The meetings, July 7-9, 1998 in York, UK and November 11-13, 1998 in the USA, focus on the practical needs of system development, where security, fault tolerance, and assurance requirements are increasing dramatically with the rapid spread of commercial enterprises into cyberspace. The workshops are designed to promote a true dialogue between the communities, as well as foster collaborations between researchers in the USA and abroad. The motivating idea for the workshops is that these three communities face many closely related problems, and consequently solutions from one community are likely to be relevant in all communities. Participants are asked to elaborate the fundamental challenges facing their community, map these challenges to related problems in the companion communities, and identify promising solution paths. A book is planned to capture the results of the workshop, including papers and supplementary reports from the meetings. ***","title":"Workshop for Computer Security, Fault Tolerance and Software Assurance: July 1998, York, UK; and November 1998, USA","awardID":"9810022","effectiveDate":"1998-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["540637"],"PO":["150697"]},"23416":{"abstract":"9713051 LEE The annual IEEE International Conference on Robotics and Automation (ICRA), sponsored by the IEEE Robotics and Automation Society, has become the largest annual conference in robotics and automation, and has served as a forum gathering international researchers together for the exchange of ideas on technical problems and their solutions. This proposal requests group travel funds from the NSF to assist approximately 40 US researchers to participate in the 1998 IEEE International Conference on Robotics and Automation, which will be held in Leuven, Belgium, May 16-21, 1998. ***","title":"Group Travel Grant to 1998 IEEE International Conference on Robotics and Automation in Leuven, Belgium, May 16-21 1998","awardID":"9713051","effectiveDate":"1998-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1445","name":"DYNAMICS & CONTROL"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1468","name":"Manufacturing Machines & Equip"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1472","name":"OCEAN ENGINEERING SYSTEMS"}}],"PIcoPI":["335186"],"PO":["564728"]},"22966":{"abstract":"The media, many businesses, and many academicians are proclaiming the information highway and the web as providing universal access to information and as providing the infrastructure in which a Oglobal villageO and Ovirtual organizationsO will emerge. Within this infrastructure, individuals are assumed to be able to freely interact and have their ideas compete in an open market. This assumption, however, neglects the fact that people continually form groups and that groups develop norms and procedures that restrict the flow of information and prevent non-group members from having the same benefits as group members. IndividualsO communication behavior is significantly affected by groups that emerge in on-line communities. This proposal is to investigate the evolution of electronic groups and to ascertain the factors affecting group formation and maintenance on this information highway. One of the outcomes of this work will be an empirically validated model of electronic group development. By investigating the development of naturally occurring electronic groups, this work is expected to contribute to the study of group dynamics and investigations of the impact and use of new telecommunication technologies.","title":"The Dynamics of Cyberspace: Examining and Modeling Electronic Group Development","awardID":"9711548","effectiveDate":"1998-04-15","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["268366"],"PO":["495796"]},"31337":{"abstract":"9805703 Wood, David H. University of Delaware CISE PostDoc: Broadening DNA Computing Research DNA as a computing medium gives unprecedented massive parallelism and storage. These capabilities are to be exploited in three research goals. (1) Develop new algorithms using moderate amounts of DNA, in contrast to current algorithms which require excessive quantities of DNA. (2) Design algorithms to use practical, realistic laboratory methods that will allow scaling up to the large problems of interest in computer science. (3) Apply DNA Computing to NP-hard problems. This Postdoctoral Research Associateship will advance the above goals by providing a broadening interdisciplinary experiences in (1) Seeking new algorithms for DNA Computing that can ultimately solve problems too difficult for conventional computers. (2) Interacting with molecular biochemists on the feasibility and demonstrating these algorithms. In the context of this DNA computing research, the Research Associate will help to advance the current state of DNA Computation. A new algorithm for the Directed Hamiltonian Path problem is to be implemented. The Research Associate will refine the algorithmic techniques to be used, specifically revising them to be feasible in laboratory demonstrations. The anticipated overall result of the research will demonstrate the feasibility of scaling up DNA computation to problems larger than those previously addressed.","title":"CISE PostDoc: Broadening DNA Computing Research","awardID":"9805703","effectiveDate":"1998-04-15","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["541916"],"PO":["565090"]},"25706":{"abstract":"9726724 Regan This award supports a three year collaborative research project between Professor Kenneth Regan of SUNY, Buffalo and Professor Osamu Watanabe of the Tokyo Institute of Technology in Japan. The researchers will undertake a study of complexity theory for strategic goals. The main objective is the development of more refined tools for analyzing the complexity of computations than are currently most commonly employed in the field. Particular areas to be investigated include: (1) linear and quasi-linear time reductions between problems, (2) low-level circuit-based classes and reductions, often with quasi-linear bounds on circuit size, (3) average-case complexity, including a determination of which of several competing polynomial-time formalisms is best suited for lower time bound analysis, and (4) a new theory of one- way functions that realize certain concrete polynomial complexity gaps, such as being quasilinear-time computable but not inevitable in less than quadratic time. This project brings together the efforts of scientists, in both countries, that have complementary expertise and research capabilities. The development of a more acute analysis of computational costs should help gauge its practical effectiveness now, and its strategic potential as a guide for future investigations. Extending theories of (quasi-)linear time and of low-level classes and reductions should provide a precise understanding of what facets of problems make them hard to solve and how these facets are related between problems. It is further expected that it will be possible to understand the relationship between average-case complexity and the nature-and-distribution of such hard instances. Through the exchange of ideas and technology, this project will broaden our base of basic knowledge and promote international understanding and cooperation. ***","title":"US-Japan Cooperative Science: Complexity Theory for Strategic Goals","awardID":"9726724","effectiveDate":"1998-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5983","name":"JAPAN AND KOREA PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["214271","517847","92292","434742"],"PO":["553038"]},"30987":{"abstract":"9804662 Mairson, Harry G. Brandeis University CISE PostDoc: Design and Analysis of Symmetric, Hybrid Procedure-Calling Protocols This research has the ultimate goal of increasing the effective functionality of programming languages without sacrificing practical efficiency concerns. To this effect, the PI and Postdoctoral Associate intend to design, analyze, and implement a novel prototype procedure-calling protocol for programming languages, integrating the components of correctness, optimality, and symmetry. A correct implementation never diverges on procedure inputs that are not used; an optimal implementation never ``duplicates work'' by copying unevaluated procedure calls. A symmetric implementation facilitates programming with values and continuations in an identical manner. The fundamental approach carries over to any language that has standard procedure-calling protocols. This hybrid protocol encompasses the best features of call-by-value and call-by-name, together with a facility by which values and control contexts can be manipulated in an entirely dual fashion. The technology that supports the implementation depends on basic ideas from graph reduction, as reinterpreted using very recent new ideas about optimal evaluation. We intend to implement a prototype version of this protocol on top of the Scheme language. Several technical and implementation questions remain to be resolved in order that we may bring this idea from concept to implementation.","title":"CISE-PostDoc: Design and Analysis of Symmetric, Hybrid Procedure-calling Protocols","awardID":"9804662","effectiveDate":"1998-04-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["370683"],"PO":["564318"]},"31848":{"abstract":"The agreement provides for the National Laboratory for Applied Networking Research (NLANR)s Measurement and Operations Analysis Team (MOAT), led by Principal Investigator Hans-Werner Braun, to continue the NLANR research activities that have been ongoing at UCSD since 1995. In addition to measuring and analyzing vBNS traffic data, NLANR\/MOAT will promote the continued development, testing and deployment of publicly-available measurement and analysis tools and techniques. NLANR\/MOAT will facilitate the early identification and analisis of performance (both network-centric and applications-centric) trends and problems (related to the VBNS and interconnected High Performance networks and institutions). This will be accomplished by deploying flow monitors and conducting performance measurements on HPC connections to the vBNS, on select vBNS partner nodes, and at other key sites (particularly vBNS aggregation points, such as GigaPOPs and NGIXen). Resulting data and analysis on Internet traffic performance and traffic flows will then be made available to the research community and the general public.","title":"National Laboratory for Applied Network Research (NLANR)","awardID":"9807479","effectiveDate":"1998-04-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["554383","521741","172773"],"PO":["198445"]},"30826":{"abstract":"9804014 Reynolds The main goal is the design of a purely functional programming language with a sufficiently refined type structure to give the programmer explicit control over storage allocation. The proposed starting point is Benton's logic LNL, which integrates the computational lambda calculus of Moggi with a language using linear types. It should be possible to implement a language based on LNL so that linear values do not need garbage collection or reference counts, and so that the user has explicit control over the choices between linear and nonlinear values, and between call by value and call by name. Further possibilities include the ability to \"freeze\" a linear structure temporarily (which would prohibit updating while permitting multiple references), the inclusion of types for specifying in-place algorithms, and an extension to permit concurrent processes whose interaction can yield nondeterminate results. Additional topics that may be pursued are: the unification and generalization of approaches to reasoning about side effects, aliasing, and interference, the modeling of polymorphic types by means of partial equivalence relations on Scott domains, and the investigation of the relationship between partial equivalence relations on domains and information systems. ***","title":"The Design, Definition, and Implementation of Programming Languages","awardID":"9804014","effectiveDate":"1998-04-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["511108"],"PO":["150697"]},"31816":{"abstract":"This workshop is on evaluating priorities for research within the VLSI testing field, with the intention that the results of the meeting aid in refocusing the field on research necessary to algorithms, techniques and methodologies for testing deep submicron VLSI chips. Future priorities for research and education are considered. Research areas that are already well-served by the test communities in academia and industry and are unlikely to require major new methods or technological breakthroughs are being examined. The workshop report includes: (1) a statement of the most pressing problems to solve within the next decade, (2) recommendations regarding the style and kind of research to be conducted and suggestions to the community as to how to implement these suggestions, and (3) viewpoints on increasing the impact of the VLSI test field on education in electrical and computer engineering.","title":"Workshop on Future Research Directions in Testing of Electronic Circuits and Systems, Santa Barbara, CA","awardID":"9807382","effectiveDate":"1998-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["287642"],"PO":["321058"]}}