{"28082":{"abstract":"Abstract On today's Internet, packets are delivered in a best-effort manner. The Internet Engineering Task Force (IETF) is standardizing support for realtime packet delivery on the Internet. The viability of relaxed, as opposed to hard guarantees, realtime services depends fundamentally on the ability of its measurement-based admission control algorithms to determine which connection can be admitted to the network without violating service specifications. Previous research has demonstrated the viability of measurement-based admission control algorithms and relaxed realtime services. However, two important questions remain. First, independent of any specific algorithm, what traffic characteristics can serve as primary indicators to guide the setting of an algorithm's parameters? Second, can global inefficiencies resulting from the local nature of independent admission decisions be minimized? This research proposes to use equivalent token-bucket filter of aggregate traffic to guide the setting of the admission control algorithm's parameters, and to apply a market-based approach to global resource allocation. While there is a sizeable body of literature in the application of market-based control to the allocation of computing resources, no previous work on distributed resource allocation that involves multiple resources and takes into account transaction costs, i.e.~the cost to negotiate and execute a transaction, has been reported. Further information on this project is available from http:\/\/irl.eecs.umich.edu\/jamin\/research\/CAREER.html.","title":"PECASE: An Empirical Investigation of the Dynamics of Measurement-based Admission Control Algorithms Within an Economic Framework","awardID":"9734145","effectiveDate":"1998-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["201028"],"PO":["234222"]},"28063":{"abstract":"Many scientific and engineering numerical optimization problems are both computationally expensive and difficult to solve for analytical reasons. Not surprisingly, for such problems there are also significant issues in the integration of the software that describes the system being optimized. These difficulties are often intertwined. The research that will be done will look at analytical and algorithmic issues that arise in the solution of such difficult numerical optimization problems. Specifically, the work will evolve along two complementary lines: the further development and analysis of pattern search methods for nonlinear optimization, and the design and analysis of techniques for using approximation models to optimize systems defined by computationally expensive functions. Both these lines of research include a strong effort in software development and experimentation. Practical experience working on numerical optimization problems from science and engineering reveals issues and techniques that are not covered well in the current computer science curriculum and yet would serve students well in any multidisciplinary computational setting. The course development will draw upon existing knowledge and software tools in computer science and computational mathematics to design new courses---practicums, in effect---that will teach students more about how to understand, maintain, enhance, and optimize existing scientific software. The emphasis will be on systematic analysis and testing with an eye toward performance programming. Fundamental to this approach is the belief that students should be taught how to experiment in a systematic, scientific fashion to analyze and reason about extant, complex computer programs.","title":"CAREER: Research in Nonlinear Numerical Optimization and Practicums for Computational Science","awardID":"9734044","effectiveDate":"1998-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["333016"],"PO":["321058"]},"28096":{"abstract":"New digital information resources necessitate the creation of new tools for resource discovery. Users must negotiate a large number of collections of information, such as new digital libraries and the collections of traditional libraries and museums. The distribution of resources into separate domains prevents optimal searching, and users must search multiple systems sequentially in order to perform exhaustive searches. The solution to this problem is to provide an integrated control of resources so users can locate information without regard to its location. The focus of this project is to investigate user behavior in the selection of diverse information resources from distributed collections using qualitative field work methods. A prototype system which integrates various types of metadata and forms networks of linkages is used to determine how users select resources. The educational component of this project is to develop a broad interdisciplinary program that integrates various theories in information retrieval. The curriculum is intended to provide students with a technological grounding and a theoretical framework for addressing significant problems relating to networked information resource discovery and retrieval. The results of this project will provide insight into the integration of digital and traditional collections, and the optimal retrieval of resources from them. The findings will also provide for the design of diverse types of information retrieval systems, including search agents that seek out resources among distributed collections, and present an integrated view for user consultation.","title":"PECASE: Providing a Coherent View of Diverse Distributed Information Resources","awardID":"9734191","effectiveDate":"1998-05-15","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[70733],"PO":["563751"]},"28086":{"abstract":"The focus of the research activity is developing new tools and techniques for attacking fundamental problems in computational complexity theory. One thrust is the search for adaptations of the probabilistic method of Paul Erdos to uniform complexity theory. A second thrust is the investigation of the connections between various questions in complexity theory and various structural and algorithmic questions concerning robust error-correcting codes, and related algebraic and geometric structures. In addition to contributions to complexity theory, this research has the potential for making contributions to the probabilistic method; derandomization and coding theory. The educational activities are centered around the broader goal of designing an undergraduate curriculum in theoretical computer science for the new millennium. The motivation stems from the growing importance of program correctness, and from the need to design theory curricula relevant to and reflecting the changing role of computer science. The educational activity integrates and unifies discrete mathematics, automata and formal language theory, program verification and correctness, and computational complexity theory. A highlight is a novel application of automata theory as an effective playground for teaching program correctness. The educational activities also include developing a curriculum in algorithm engineering, with a vision to integrate research, education, experimentation and training in algorithm design and implementation, and with specific goals to develop ultra-efficient implementations of fundamental algorithms for massive data sets.","title":"CAREER: Probabilistic and Algebraic Techniques for Computational Complexity Theory","awardID":"9734164","effectiveDate":"1998-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[70713],"PO":["565157"]},"27680":{"abstract":"This research is concerned with the creation of new methods of electronic circuit design which will allow realization of smaller size, longer battery life and lower cost in personal communication systems such as cellular telephones, cordless telephones and wireless computer networks. In addition, new transceiver architectures are being investigated which will allow multistandard operation which is transparent to the user. Thus, a single personal communication handset could be used anywhere in the world as it automatically adjusts to different local standards and frequencies. Current implementations of portable transceivers typically use a multi-chip, multi-technology approach with a number of precision external filters, resonators, and other components in order to meet the stringent performance requirement of the analog RF interface in such systems. These transitional approaches severely limit the achievable levels of power dissipation and form factor, and are not compatible with low- cost adaptive multistandard operation. This research is exploring new architectures and circuit techniques which will allow utilization of scaled CMOS VLSI technology to integrate the entire transceiver function with only a few external components. The challenge is to find new approaches that overcome the inherent limitations of integrated passive components such as low Q values in integrated inductors, capacitors and varactors, by utilization of the inherently high bandwidth capabilities of scaled integrated MOS transistors. The investigators expect to demonstrate at the end of this research project a single-chip multistandard RF transceiver incorporating synthesizers, transmit path, power amplifier, and receive path as well as providing interface to several different RF standards. This prototype will be implemented in 0.35 micron CMOS technology.","title":"Research in High-Frequency Analog Electronic Circuits for Communication Systems","awardID":"9732550","effectiveDate":"1998-05-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["261777","520911"],"PO":["564898"]},"27592":{"abstract":"Monte Carlo Arithmetic (MCA) is an extension of standard floating- point arithmetic that exploits randomness in basic floating-point operations. MCA uses randomization to implement random rounding --- which forces roundoff errors to be randomly distributed --- and random unrounding --- which randomly extends the inputs of arithmetic operations to arbitrary precision. MCA has potential theoretical and practical benefits. Random rounding can be used to produce roundoff errors that are truly random and uncorrelated, and that have zero expected bias, thereby avoiding some anomalies of floating-point arithmetic. Random unrounding detects catastrophic cancellation, which is the primary way that significant digits are lost in numerical computation. The primary practical benefit of MCA appears to be that it can give ordinary mortals an intuitive, empirical sense of the accuracy of their computed results. MCA transforms a floating- point computation into a Monte Carlo computation, and roundoff analysis into statistical analysis. By running a program multiple times, one directly measures sensitivity of particular outputs to random perturbations of particular inputs. Generally, it gives a different perspective on the study of error. The project will encompass two tasks: first, development of an MCA environment, a set of tools permitting numerical analysts to run existing programs with MCA instead of standard floating- point, and to analyze the results; second, study of several large- scale applications, numerically interesting models that try to establish, one way or the other, the usefulness of MCA in practice.","title":"Monte Carlo Arithmetic","awardID":"9732309","effectiveDate":"1998-05-15","expirationDate":"1999-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["140393"],"PO":["187585"]},"28153":{"abstract":"The project focuses on several crucial requirements of upcoming information management systems: integrated access to heterogeneous sources, data warehousing, and multimedia data. It also integrates education and research. As part of the educational component of this project, UCSD's database curriculum is being reshaped to provide students with hands-on experience, basic principles, and exposure to research challenges in the above areas. The research enhances the state of the art in two areas: the integration of very large numbers of Internet sources and the extraction and querying of semantic information from video data. In the area of data integration, query processing algorithms are developed and integrated into the TSIMMIS mediator system; they use knowledge of data replication to avoid retrieving redundant\/replicated data and enhance the availability and efficiency of the system. A new cost-based optimizer is developed for high performance in browsing of partial results. The optimizer is provided with probabilistic information on source data overlap and develops plans for efficient delivery of partial answers. In the area of video data, the COMIX system is developed. COMIX is customized by users with SQL-like actions and queries that assist COMIX in extracting semantic information orders of magnitude faster than by a brute-force approach. COMIX introduces novel query processing optimizations which exploit the sequentiality, fuzziness and continuity of the video data. In the upcoming era where the Web and the digital TV signal will enter every living room, the proposed version of the TSIMMIS mediator system will allow the user to search the vast volumes of Web data in a manner that exploits redundancy and replication of Web data, rather than being impeded by it (as is currently the case.) Then the COMIX system will be a step towards \"smart VCRs\", which will be screening the digital TV signal and extracting information of interest to the user. http:\/\/www-cse.ucsd.edu\/~yannis","title":"CAREER: Querying Heterogeneous and Multimedia Information Systems","awardID":"9734548","effectiveDate":"1998-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["525612"],"PO":["563751"]},"28088":{"abstract":"Traditionally, building knowledge-based systems has been a process involving professional knowledge engineers. While this process works for well-defined tasks in limited domains, it is too expensive for domains where the representation must change frequently and is not feasible for problems where experts' understanding of the domain and task changes during the course of problem solving. The alternative approach investigated in this project is one of \"incremental formalization.\" This approach allows users to initially enter their understanding of their domain, task, and solutions in less formal representations and provides computer support for the gradual formalization of this knowledge. The project includes: (1) designing knowledge representations and interfaces for capturing emergent understandings and enabling incremental formalization, (2) developing mechanisms for recognizing implicit structure within informally represented information, (3) investigating interfaces for suggesting formalizations, uses of automated formalization, and trade-offs between suggesting and automating formalization, (4) creating tools which aid the development of shared languages and support collaborative knowledge-building tasks, and (5) improving understanding of knowledge-building processes and the relative merits of prototypes through observations of individual and collaborative tasks requiring domain modeling. http:\/\/www.csdl.tamu.edu\/CKBE\/","title":"CAREER: Enabling and Supporting Collaborative Knowledge Building Through Incremental Formalization","awardID":"9734167","effectiveDate":"1998-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["467562"],"PO":["565227"]},"28103":{"abstract":"Mathematical constraints provide a flexible and uniform way to conceptually represent and manipulate diverse data capturing spatio-temporal behavior, complex modeling requirements, partial and incomplete information etc., and have been used in a wide variety of application realms. The CCUBE project deals with incorporation of successful constraint technology (involving arithmetic constraints over reals, interval constraint propagation, and combinatorial optimization over finite domains) with database technology, in the framework of Constraint Databases (CDBs) aimed especially at two broad application areas: (1) Spatial and temporal applications that require manipulation of complex objects in low (up to 5-6) dimensional space, movement of objects in 3D-space, transformations among various coordinate systems, and patterns of behavior in space over time. These applications include CAD\/CAM systems, GIS and environmental systems, and spatio-temporal data fusion and sensor management. (2) Applications requiring combinatorial optimization in presence of large amounts of data, in which database set-at-a-time processing, indexing, and the ability to store large intermediate results are being exploited for search. Applications here include manufacturing and warehouse support systems, financial systems such as electronic trade, and traditional mathematical programming problems involving large amounts of data. The technology being developed in the CCUBE project has the potential to provide an order-of-magnitude productivity gain in building software systems in the target domains. Furthermore, it is suitable to become an integral component of future database management systems, as well as optimization productivity tools. Finally, the CCUBE project is being utilized as an important educational device, being used by students in graduate-level courses for real-life applications, and stimulating their early involvement in research.","title":"CAREER: Constraint Databases: Space, Time and CombinatorialOptimization","awardID":"9734242","effectiveDate":"1998-05-15","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["521347"],"PO":["563751"]},"27862":{"abstract":"Our most successful Automatic Speech Recognition (ASR) systems remain too tied to specific domains (`air travel' or `business news') and to carefully pronounced, slow speech, because our statistical algorithms do not deal well with the extreme variation, in pronunciation, word-choice, and grammar, that characterizes natural, conversational, speech. The research goal of this CAREER project is to build better speech recognizers by taking human psychological results on lexical processing, giving them explicit probabilistic models, and integrating them into ASR algorithms. This project is incorporating part-of-speech and word frequency into probabilistic models of word pronunciation in ASR. This project is using distributional-vector models of word meaning in an ASR system to increase the probability of a word occurring near similar words, compiling probabilistic dictionaries of verb-argument structure to help ASR systems. The educational goal of this CAREER investigation is to incorporate computational, corpus-based, and probabilistic training into the undergraduate and graduate curriculum in phonetics, psycholinguistics, computational linguistics, and cognitive science. Through its research and educational facets, the CAREER project will help draw talented and knowledgeable linguists and psychologists into ASR and related fields, and produce research with a direct impact on ASR and its technical and commercial implications.","title":"CAREER: Spoken Lexical Processing in Humans and Machines","awardID":"9733067","effectiveDate":"1998-05-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["517444"],"PO":["246649"]},"27994":{"abstract":"This project aims at the effective integration of databases, multimedia and the Internet for digital library applications. The research establishes an underlying framework and develops techniques for ensuring consistent and robust retrieval, transmission and presentation of multimedia data. The research plan involves: (1) customized presentation: develop principles to support consistent multimedia presentations based on quality of service specifications; (2) transmission: develop adaptive end-to-end control techniques to support transmission of multimedia data over networks; (3) retrieval: formulate a resource allocation model for a database server to allocate its resources for data retrieval; and (4) implementation and experimentation of a distributed multimedia database prototype for educational digital libraries. The educational component of the project focuses on two objectives: (1) development of new courses in the area of multimedia databases and digital libraries, and (2) application of the research to the establishment of a computer-assisted learning environment for asynchronous distance learning. The new courses and accompanying curriculum standards are designed to reflect the changing needs of computer professionals. Through the above research and educational activities, the fundamental understanding and novel techniques can be provided to support system development. The developed framework can be readily used to facilitate student tutoring, medical training, human resource development, and asynchronous distance learning. On a broader level, the methods and experimental results arising from this research will also guide the development of distributed multimedia database systems in industrial applications.","title":"CAREER: Consistent and Robust Retrieval, Transmission and Presentation of Multimedia Data","awardID":"9733730","effectiveDate":"1998-05-01","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["518277"],"PO":["563751"]},"27444":{"abstract":"As new edge detection papers appear, convincing proof of real advantages over past techniques is critical to community recognition and acceptance. This requires establishment of methods to objectively and quantitatively demonstrate whether a new algorithm offers performance improvements. This research will result in a carefully developed and documented experimental framework for edge detector evaluation by adaptively sampling edge detector parameter space and generating ROC curves. The research includes documenting how well the results of the pixel-level evaluation agree with evaluations based on higher-level tasks such as perceptual grouping, structure from motion and human object recognition. The work will leave behind the artifacts (image sets, software, ) necessary for others to use, and to build upon, the research. In particular, a web site will be created that promotes the use of this framework as a standard technique. Beyond providing a solution for performance evaluation of edge detectors, the results may also serve as a model for the development of performance evaluation methods for other computer vision problems.","title":"Experimental Performance Characterization of Edge Detection in Computer Vision","awardID":"9731821","effectiveDate":"1998-05-15","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["173374"],"PO":["234178"]},"27973":{"abstract":"We witness an ever-increasing demand for servers that handle continuously accumulating volumes of data. As a result, there is a constant need to develop systems and techniques that effectively support such data. In this direction, Client\/Server Database Systems (C\/S DBSs) have helped considerably by exploiting transient caching and harnessing networked system resources. However, they have not been able to deliver highly scalable behavior. To this end, cooperative processing methods are investigated and options offered by emerging network technology are explored in order to achieve higher scalability. More specifically, this project examines: techniques that facilitate multi-client cooperation; the effects of high-speed and Gigabit networks on the design of C\/S DBSs; and access methods for spatial and multi-dimensional data in C\/S environments. The project results will include techniques for cooperative query processing and analysis of their tradeoffs, flexible transaction protocols in the presence of high-speed networks and experimental evaluation of their behavior, as well as indexing methods for C\/S environments. As organizations manage increasing volumes of data, such techniques will help ease the strain corporate data servers currently experience. In addition to student supervision, the educational plan includes: introduction of two new courses, participation in outreach programs, and further development of a newly established laboratory. http:\/\/naxos.poly.edu\/~ad","title":"CAREER: Cooperative Client\/Server Database Systems","awardID":"9733642","effectiveDate":"1998-05-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[70486],"PO":["563751"]},"32780":{"abstract":"Abstract ANIR-9810421 PI: Frank Miglorie College of St. Joseph Rutland, Vermont This project connects the College of St. Joseph to the Internet over a T1 line. Access to the Internet would establish a two-way information vehicle for the College that would connect its students, faculty and staff to resources (research data, mentors, career opportunities, distance learning) beyond its rural scope. The award provides partial support of the project for two years.","title":"College of St. Joseph Connection to the Internet","awardID":"9810421","effectiveDate":"1998-05-15","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[82576,82577,"555090"],"PO":["121202"]},"28139":{"abstract":"Distributed computing applications, such as groupware and manufacturing automation, have concurrently executing processes that access common shared data. The applications require maintaining the consistency of shared data and correctness of executions, and also, have demanding real-time performance requirements. This research examines, designs, and implements, a system based on time-constrained transaction-oriented distributed computations. Consistent executions are maintained using modified database concurrency control, and improvement of performance is addressed using techniques from real-time data management. Building on existing research results, the system incorporates several correctness and efficiency criteria, and is flexible to changes and scale-up. Learning from on-going large-scale efforts in the application areas, the approach is tested by implementation of substantial functionalities for the target domains. Real-time scheduling algorithms are incorporated into a main-memory data management system, and the primitives for distributed concurrency control using synchronization protocols are implemented across multiple instances of such systems. This approach is to be empirically compared in terms of functionality and performance against the systems already available. The complementary education plan includes fostering off-line group study and learning by doing hands-on work. Students, organized into self-study groups, examine facets of the research problems, and obtain broad guidelines from information technology tools. Also, the research problems are assigned as project work which fosters a hands-on approach to learning. In the long term, this research and educational dissemination will influence the design and development of large-scale real-time distributed applications using database and transaction technologies.","title":"CAREER: Maintaining Constraints in Real-Time Data Management Systems","awardID":"9734463","effectiveDate":"1998-05-15","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["337623"],"PO":["563751"]},"27975":{"abstract":"This project investigates two complementary ways of improving computer vision based robot control particularly in uncertain and changing environments. First, by developing motion planning techniques that account for properties of the visual data -- exploiting the available visual feedback and overcoming sensing limitations. This requires extending the notion of robot configuration space to include image feature space and using topology-preserving learning schemes to handle modeling uncertainties. Second, by developing active vision strategies for optimizing visual feedback in robot control -- systematically extending the range of robot operation beyond that possible by static cameras. Defining invariances under camera motion would allow the decoupling of active camera control from robot control. Both deterministic and stochastic strategies will be explored for exploiting the camera motion in cooperation with the robot motion plan. This research will be interleaved with supporting educational activities which include developing new graduate courses in robotics and human-computer interfaces, revising undergraduate courses in related areas, and developing two new educational tools. The first tool will be for collaborative group projects on the web especially for projects involving video images. The second tool will be for training and visualization using an augmented reality interface that allows interactive mixing of virtual and real objects.","title":"CAREER: Motion Planning and Active Vision Strategies for Optimizing Visual Feedback in Robot Control","awardID":"9733644","effectiveDate":"1998-05-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["254458"],"PO":["234178"]},"33597":{"abstract":"This award funds an NSF-US\/Europe Research Planning Workshop on Personal Robotics, to be held in Toulouse, France, May 14 and 15, 1998. The workshop will bring together leading researchers from the US and Europe to examine a new center of convergence in robotics research, centered on \"human in the loop\" problems. The meeting will undertake to identify the research needed to improve the connectivity of people and computers to the real physical world. This presents new challenges and opportunities for the emergence of robotics as a \"personal\" technology. Personal robotics applies to robots that can serve people directly in professional, domestic, human-assistance, and public-oriented use, and includes new and emerging concepts such as haptic interfaces, telepresence, wearable and interface robotics that enrich and support the connection of people to the world. The results and conclusions of the workshop will be presented at a panel session the following week at the IEEE International Conference on Robotics and Automation in Leuven, Belgium, and a report will later be posted on the World Wide Web.","title":"NSF-US\/Europe Workshop on Personal Robotics","awardID":"9812428","effectiveDate":"1998-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["409023"],"PO":["475621"]},"23885":{"abstract":"Around 1980, V. D. Goppa used the theory of algebraic curves to construct a new family of codes, now referred to as algebraic geometric (AG) codes. Code performance depended upon certain curve parameters. Shortly after, Tsfasman, Vladut and Zink showed the existence of curves such that the resulting AG codes had long lengths and performance exceeding that of the Gilbert-Varshamov (G-V) bound -- a feat that until then was widely considered unattainable. However, the Tsfasman-Vladut-Zink result does not provide an explicit description of the curves. Recently, Garcia and Stichtenoth exhibited two families of curves having an explicit and simple description, that also give rise to codes better than the G-V bound. An explicit description of the AG code is still lacking however, as this requires the determination of a basis for a certain vector space, consisting of functions defined on the curve. This remains an open problem and its solution using the theory of function fields is a principal goal of the research activity under this grant. Recent progress in decoding AG codes has also increased interest in this problem. Also under investigation are a second set of curves arising from the trace function over Galois rings and the intersection of hyperplanes in projective space. The latter have application to the study of codes and pseudonoise sequences.","title":"On The Construction of Long and Efficient Algebraic Geometric Codes","awardID":"9714626","effectiveDate":"1998-05-15","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["562301"],"PO":["188393"]},"26669":{"abstract":"ABSTRACT \"Connecting to the Future: Connecting Scranton Elementary to the World\" Jefferson-Scranton Community Schools PI: Tim Buenz NCR-9729612 This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for 24 months to connect an elementary school and a middle school to the Internet using wireless technology. . The connection enables both voice communication between the two calling areas and data connection to the Internet for the elementary school.","title":"Connecting to the Future: Connecting Scranton Elementary to the World","awardID":"9729612","effectiveDate":"1998-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[67144,67145],"PO":["121202"]},"23931":{"abstract":"9714755 Gries An international Working Conference on Programming Concepts and Methods (PROCOMET '98) is held in Long Island, New York, on 8-12 June 1998. The conference, organized by working groups WG2.2 (Formal Description of Programming Concepts) and WG2.3 (Programming Methodology) of IFIP (International Federation for Information Processing), serves to foster international interaction and cooperation on research topics such as specification and verification of sequential, object- oriented, and concurrent systems; logical and algebraic foundations of specification and verification; and software tools to support verification efforts. Up to 100 researchers from a number of countries are expected to attend. ***","title":"IFIP Workshop (PROCOMET'98): June 18-22, 1998, Long Island, NY","awardID":"9714755","effectiveDate":"1998-05-01","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["320597"],"PO":["150697"]},"32885":{"abstract":"The goal of this Small Grants Exploratory Research project is to find the optimal number of stages for the shuffle connected multistage interconnected network (MIN) to be rearrangeable. The approach is to use a new theoretical model which defines a necessary and sufficient condition for routing a permutation through the MIN.","title":"Routing with Minimal Number of Stages","awardID":"9810692","effectiveDate":"1998-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[82857],"PO":["187585"]},"31764":{"abstract":"There is a number of emerging scientific issues in electronic commerce that bear examination in the context of a workshop, to determine whether and how NSF should support near- and medium-term future research in the area. Some of these issues include the development of trust, potentially supported by new technologies, dynamic but limited-information assessments of quality; automated contracting, intermediation, tractable algorithms for electronic markets, and the links between electronic commerce and the building of relationships, including communities, organizations, etc. This workshop will survey and identify strategic, timely and pressing research areas in the application of information infrastructure to commerce; develop a set of research priorities; build consensus on how the various research components of electronic commerce can best be leveraged against one another and collaborations built; and disseminate the results widely.","title":"Workshop: Research Priorities in Electronic Commerce","awardID":"9807167","effectiveDate":"1998-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["521736"],"PO":["495796"]},"25714":{"abstract":"This award supports Drs. Patrice Simard, Vladimir Vapnik, Yann LeCun, and Leon Bottou to collaborate with Klaus-Robert M¼ller of GMD FIRST (Research Center for Information Technology) in Berlin. The collaboration will extend current knowledge about support vector machines (SVMs) which can represent functions in spaces with trillions of dimensions and are used for such applications as time-series prediction, image analysis, and optical character recognition. Specifically, the research will study methods for incorporating invariance properties into SVMs, methods for automatically choosing the parameters and kernels of SVMs, numerical techniques for computing support vectors, extending SVM beyond current uses, and improving pattern-recognition performance. One result of the research will be a numerical code for the computation of support vectors that will be available to the research community.","title":"U.S.-Germany Cooperative Research: Kernel-Based Classifiers and Regression Algorithms","awardID":"9726745","effectiveDate":"1998-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[64845,"409342","384401",64848],"PO":["290800"]},"32876":{"abstract":"9810675 Hook, James Oregon Graduate Institute of Science and Technology Special Project: Workshop on Foundational Methods in Computer Science This award partially supports students and travel to a workshop on Foundational Methods in Computer Science that will bring together researchers working in category theory and computer science to foster more development on the middle ground where theory meets practice. Hosted by the Pacific Software Research Center (PacSoft) at the Oregon Graduate Institute of Science and Technology, the workshop will be held on May 29-31, 1998 with emphasis on seeking out applications and making ``tools'' of categories more accessible to computer scientists. The workshop begins with a day of tutorials aimed at students, educators and newcomers to category theory, followed by a day and a half of research talks. In bringing together leaders in the field of category theory with leaders in the field of computer science, the workshop offers the possibility of disseminating advanced techniques at a much deeper level of understanding than could be achieved through the literature alone.","title":"Special Project: Workshop on Foundational Methods in Computer Science","awardID":"9810675","effectiveDate":"1998-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["341680"],"PO":["297837"]},"23669":{"abstract":"This project applies recent methods for large-scale nonlinear convex optimization, e.g., semidefinite programming (SDP), to VLSI design problems. The new techniques allow using more accurate models, better but more complex cost functions, new types of constraints, or simply improve the speed and capacity of existing tools. The research focus is on various problems of simultaneous delay optimization, transistor and wire sizing, and placement.","title":"Applications of Semidefinite Programming to Sizing and Placement Problems in VLSI Design","awardID":"9714002","effectiveDate":"1998-05-01","expirationDate":"2002-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["491111","474492"],"PO":["201974"]},"27619":{"abstract":"While spoken language systems are now used for many applications, language engineering technology is still not adequate for all important tasks. For instance, automatic recognition of natural conversational speech results in incorrect transcription of one- third of the words spoken. Parsing sentences from newspaper articles leads to faulty automatic analysis of half the sentences. The need to make progress in this important area is obvious. The number of available language engineering personnel is small and relatively few universities presently educate students capable of performing the required tasks. The Center for Language and Speech Processing at the Johns Hopkins University is organizing a six week workshop on Language Engineering from July 13 to August 24, 1998, in which teams of professionals and students will work together to advance the state of the art. Three topics will be addressed: (1) Dynamic Segmental Models of Speech Coarticulation; (2) Rapid Speech Recognizer Adaptation to New Speakers; (3) Core Natural Language Processing Technology Applicable to Multiple Languages. University professors, leading industrial and government researchers presently working in widely dispersed locations, graduate students, and six or more undergraduate students selected through a nationwide search will participate in this workshop. Significant technological innovations, training of students, cross-fertilization of ideas from various disciplines, initiation of collaborative research, and creation of valuable training and test corpora are expected to result from this endeavor.","title":"WORKSHOP: Language Engineering Workshop for Students and Professionals Integrating Research and Education (WS98)","awardID":"9732388","effectiveDate":"1998-05-01","expirationDate":"2000-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y495","name":"DEFENSE-CTR FOR LANGUATE & SPE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y537","name":"DARPA-SUMMER SPEECH WORKSHOP"}}],"PIcoPI":["445172"],"PO":["565227"]},"33735":{"abstract":"Networking and Telecommunications Task Force of Educom (NTTF) and FARNET The NSF vBNS program is nearing the end of its 5-year award. As is described in its 1997 midterm review, the vBNS is widely recognized for essential contributions to the development of U.S. capabilities for advanced networking for R&D. In its first three years of service, for example, the vBNS has: - accelerated the planning and implementation of the Partnerships for Advanced Computational Infrastructure, - enabled the interconnection of the Internet2 universities and partners, - served as the core national network for goal 2.1 of the Next Generation Internet project, - supported remote computing and collaborations for significant advances in the sciences and engineering, and - led to the design and improvement of high-performance network technology in the commercial sector. The vBNS expert review concluded with a very strong recommendation that NSF continue its support for advanced networking for research and development after the scheduled conclusion of the present vBNS award. It is now time, therefore, to examine developments in technology and the environment since the vBNS program was designed and to reach sound recommendations on how NSF might best support its goals for the continued development of advanced networking in the coming years. This project intends to organize and oversee a formal process that captures and summarizes the best creative thinking of both experts and generalists in the U.S. community for advanced networking. The result will be a final document and supporting material outlining the major issues and objectives to be addressed by NSF in its follow-on program to the vBNS.","title":"Planning the Next Stage of NSF Advanced Networking Research and Development","awardID":"9812826","effectiveDate":"1998-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[84879,"43608"],"PO":["121202"]},"32636":{"abstract":"Abstract ANIR-9810082 PI: Delmar Johnson South Dakota State University Brookings, South Dakota This proposal requests funding for the installation of a T1 line and related operating costs to connect the West River Nursing Center (WRNC) to statewide network resources and the Internet. The WRNC, SDSU College of Nursing, is one of only two such institutions in the state that provides a B.S. or M.S. degree in nursing education . It is located in the Black Hills area of South Dakota at the western edge of the state. Access to the Internet would allow faculty, staff and students to utilize remote library resources, collaborate with peers, and continue their research and professional development. The award provides partial support of the project for two years.","title":"West River Nursing Center Connection to the Internet","awardID":"9810082","effectiveDate":"1998-05-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["103818",82176],"PO":["198445"]},"30902":{"abstract":"The 1998 IEEE International Symposium on Information Theory will be held at MIT in Cambridge, MA on August 16-21, 1998. This Symposium is of particular interest since it marks the 50th anniversary of the Information Theory field. Because of this there will be a focus both on historical development and on future directions. Papers presented will address new results in the following areas: coded modulation, coding theory and practice, communication complexity, communication systems, cryptology, data compression, data networks, detection and estimation, history of information theory, multiuser detection, multiuser information theory, pattern recognition and learning, quantum information processing, Shannon theory, signal processing, and source coding. This symposium is a premiere meeting in the field of Information theory. Travel through this grant will provide travel support for U.S. participants, particularly graduate students and new faculty whose papers have been selected for presentation at the symposium, but who lack the travel funds to the conference site.","title":"1998 IEEE International Symposium on Information Theory","awardID":"9804344","effectiveDate":"1998-05-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[77969],"PO":["150411"]}}