{"168620":{"abstract":"This project focuses on learning parsimonious representations of complex high-dimensional data. In recent years, the PI has developed probabilistic latent variable models based on Gaussian processes that are able to capture complex interactions and perform state of the art prediction in diverse applications such as 3D human body tracking and collaborative filtering. However, in real-word applications such as the analysis of human motion or object recognition from images, the data is structured (e.g., the correlations in a video sequence can be captured with tensors), can come from different sources of information (e.g., video and audio), can be generated from a complex dynamical process or additional information might be available (e.g., labels). <br\/><br\/>To address these real world problems, this project investigates extensions of the aforementioned probabilistic latent variable models to learn parsimonious representations of this complex data, focusing on the development of efficient learning algorithms that are able to handle large and sparse datasets. This research is strongly tied to an empirical performance goal, consisting of improving the state-of-the-art in both pose estimation and object recognition applications through the modeling of such complex interactions. The proposed research has broad impact in several areas of computer vision in particular human body motion estimation and tracking.","title":"RI: Small: Probabilistic Latent Variable Models for Sparse Data","awardID":"1017626","effectiveDate":"2010-12-01","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["499806"],"PO":["564316"]},"175188":{"abstract":"CAREER: Detection and Estimation in Complex and Uncertain Environments<br\/><br\/>NSF Proposal #1053932<br\/>PI: Jill Nelson<br\/><br\/>Statistical signal processing plays a fundamental role in fields as diverse as personal communications, national security, and medical image processing. To support the continued advancement of these fields and many others, there is a need to develop efficient near-optimal solutions to increasingly challenging detection and estimation problems. The focus of this research is addressing detection and estimation challenges in environments that exhibit high degrees of complexity and high levels of model uncertainty. In such scenarios, optimal detection and estimation solutions are often computationally infeasible, if not impossible, to determine. This research explores the effectiveness of tree search techniques, originally developed for sequential decoding, to address these challenges. The intellectual merit of the work is in the development of approximate detection and estimation algorithms that achieve near-optimal performance with dramatically reduced computational complexity requirements.<br\/><br\/>There are two primary technical objectives of this research. The first is to characterize the detection\/estimation problem space for which tree search techniques provide competitive solutions through analysis of computational complexity as a function of system properties, and to frame conclusions in the context of existing results for competing approaches. The second objective is to develop and evaluate tree search approaches to three benchmark problems: channel estimation and data detection for broadly dispersive, rapidly varying channels; multiple transmitter location estimation for cognitive radio applications; and dynamic state estimation under model uncertainty or absence. The aims of the education component of this research are to design and implement elementary-level engineering curriculum centered around hands-on telecommunications activities, and to develop college-level problem-based learning curriculum that deepens students' understanding of probability and random processes by connecting abstract concepts to real-world problems with probabilistic models.","title":"CAREER: Detection and Estimation in Complex and Uncertain Environments","awardID":"1053932","effectiveDate":"2010-12-15","expirationDate":"2015-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["562149"],"PO":["564898"]},"183621":{"abstract":"Many scientists today face the unprecedented challenge of managing and analyzing a rapidly growing set of complex data. This international PIRE project aims to narrow the growing gap between the capability of modern scientific instruments to produce data and the ability of researchers to manage, analyze, and share those data in a reliable and timely manner. The emerging technology of cloud computing is a step forward from the current cyberinfrastructure. Cloud computing involves clusters (the \"clouds\") of distributed computers that provide potentially less expensive, more flexible, and more powerful on-demand resources and services over a network, usually the Internet, while providing the scale and the reliability of a data center. This PIRE team intends to help develop large-scale distributed computing capabilities - the Open Science Data Cloud (OSDC) - to provide long term persistent storage for scientific data and state-of-the-art services for integrating, analyzing, sharing and archiving scientific data. The group proposes to study and strengthen storage systems that integrate specialized network protocols and support data transport over wide-area, high-performance networks. As data grows in size, the only practical means to analyze it is to use parallel programming, but until recently it has been time consuming for a domain scientist to take advantage of parallel programming. Another research focus will be to develop new classes of cloud-based parallel programming frameworks and to integrate them into the cloud infrastructure so that this technology is more broadly available to scientists. In addition to the research dimensions of this project, another key aspect is the involvement, in workshops and in subsequent use of the cloud cyberinfrastructure, of many domain scientists and their students. These groups will be trained in the basics of cloud computing and then will work to ensure that the cloud computing research advances maximize the manageability and analytical power of the complex datasets unique to their disciplines. <br\/><br\/>This PIRE project embraces cloud computing as a global issue and so taps the cloud computing, high performance networking, domain science, e-Science, education and outreach expertise of its many collaborators in Europe, Asia and South America. Foreign partners also provide a natural mechanism to engage international scientific datasets and distributed networks, and accommodate different international standards to guarantee interoperability. The international collaborators can provide an entry into international collaborations for U.S. graduate students and early career scientists and can also serve as global ambassadors for this new cyberinfrastructure, helping to garner widespread support that will be critical to its future adoption.<br\/><br\/>The project will build a strong cadre of students with a global perspective on scientific data management in many research areas vital to U.S. and international scientific collaborations. The project will provide U.S. graduate students and early career scientists with international research and education experiences with leading scientists via research and training at foreign institutions and participation in annual workshops. As a group, the PIRE students will share an interest in data intensive computing but will be drawn from fields as diverse as computer science, physics, astronomy, geosciences, chemistry, engineering, and biology, lending an interdisciplinary vigor to their training. The PIRE team members will also develop 1-2 day and 1-2 week courses on data intensive computing, with hands-on exercises developed by U.S. and international faculty in computer science and the domain sciences.<br\/><br\/>This PIRE project is likely to have numerous impacts above the level of the individual collaborators. For the U.S. PIRE institutions, it will strengthen current linkages and collaborations in the global Cloud Computing community and engage more U.S. students in international interdisciplinary research teams for the service, support and analysis of large scientific datasets. The project will enhance internationalizing efforts both at the University of Illinois at Chicago and at Florida International University by providing opportunities for short term research abroad and other academic experiences to a diverse group of students. This project will increase the virtual international engagement of the U.S. institutions via distributed research collaborations, courses with transcontinental participation, global web discussions, and focused social networking forums. Increasing the number of scientists with expertise in managing and analyzing very large datasets is also vital to the future of our nation. Finally, since this transformative technology is broadly applicable to any scientific project struggling to manage and analyze the volume of data produced, the OSDC and its facilitative impacts are likely to persist long after the PIRE pr","title":"PIRE: Training and Workshops in Data Intensive Computing Using The Open Science Data Cloud","awardID":"1129076","effectiveDate":"2010-12-03","expirationDate":"2015-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7742","name":"PIRE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"L567","name":"Department of Defense Interlin"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1221","name":"ELEMENTARY PARTICLE ACCEL USER"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7793","name":"DATA-INTENSIVE COMPUTING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0700","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1217","name":"EXTRAGALACTIC ASTRON & COSMOLO"}}],"PIcoPI":["564025",492421,"533353"],"PO":["559975"]},"181685":{"abstract":"In this project, the PIs propose to construct and develop a shared infrastructure to support the collection and maintenance of realistic, large scale spam data sets, <br\/>referred as SPAM Commons.<br\/><br\/>Spam is a problem in many important communications media such as email and web. A sub-problem of spam, phishing (a form of online pretexting), caused an estimated $3.2B in damages in 2007. The broad impact of effective spam filtering methods can be estimated in billions of dollars in several communications media such as email and web.<br\/><br\/>Spam has also invaded other media, with concrete attack examples in social networks, blogosphere, Internet telephony (VoIP), instant messaging, and click fraud. <br\/><br\/>Unfortunately, spam research has been hampered by the lack of published real world data sets due to concerns with privacy and company intellectual property. This project team develops a shared infrastructure to support the collection and maintenance of realistic, large scale spam data sets, called Spam Processing, Archiving, and Monitoring Community Facility (SPAM Commons). <br\/><br\/>The main goals of SPAM Commons are: <br\/>(1) to facilitate remedial research that will stem the wastes and losses caused by spam, and <br\/>(2) enable revolutionary research that aim for stopping certain kinds of spam attacks altogether. <br\/><br\/>SPAM Commons is divided into a Public Partition and a Protected Partition.<br\/><br\/>The Public Partition is a direct analog of standard corpora for speech and image recognition research, consisting of a systematic and regular collection of both spam and legitimate data in the various communications media, starting from email and web spam, and expanding into other communications media as spam becomes a serious threat in each area and data become available. <br\/><br\/>The Protected Partition consists of a combined data and processing facility that makes private data or near real-time spam data available for experimental evaluation of spam defense mechanisms in a protected testbed. Access to such protected data will enable new spam research on real-time evolving spam and real world data sets that is infeasible today. <br\/><br\/>The intellectual challenges of the SPAM Commons project extend beyond the new research on various abovementioned spam areas enabled by the availability of data sets. The construction of both partitions of SPAM Commons includes significant intellectual challenges of their own. First, the isolation of Protected Partition addresses partially the concerns of privacy, which remains a general research problem. Second, useful spam and legitimate data sets require automated distinction of spam from legitimate documents with certainty, which remains an open research question in email, web, and other media. Third, the adversarial and mutual evolution of spam producers and defenders require continuous collection of fresh data for further study. Finally, the collection and streaming of near-real-time spam data represent research resources currently unavailable to spam researchers. Advances in these areas will spur the growth and evolution of SPAM Commons that will enable new research on the evolving and growing spam problem.<br\/><br\/>The impact of SPAM Commons data sets on experimental spam research may be similar to the impact of large corpora in disciplines such as speech\/image recognition and natural language processing, which achieved a level of scientific result reproducibility and comparativeness after the use of such corpora became standard requirements. The proposed data repository will be supported and used by 9 university partners (Clayton State, Emory, Georgia Tech, NC A&T, Northwestern, Texas A&M, UC Davis, U. Georgia, UNC Charlotte), and several industry partners (IBM, PureWire, Secure Computing).","title":"II-NEW: Collaborative Research: Spam Processing, Archiving, and Monitoring Community Facility (SPAM Commons)","awardID":"1118355","effectiveDate":"2010-12-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["542386"],"PO":["565255"]},"183611":{"abstract":"Underwater sensor networks have extensive applications ranging from natural ecosystem to security monitoring. The basic task of a sensor network is to facilitate collection of the sensed data. To this end, existing works assume a centralized strategy where the sensed data is immediately forwarded to a central sink from individual sensors. This strategy faces formidable challenges due to the intricacies of underwater acoustic channels. Based on qualitative analyses and quantitative calculations, we introduce the idea of distributed storage and collection for underwater sensor networks. In the ACOustic Underwater Sensor NETwork (ACOUSNET) project, we establish the transforming framework of distributed storage and collection of the sensed data. This transform entails multi-level adaptations to the unique underwater acoustic channels, physical limitations, desirable network features and network heterogeneity. Our foremost objective is to establish distributed data storage and collection mechanisms to optimize the ACOUSNET performance. Due to the very different properties of deep water and shallow water, we also put different emphasis and design requirements on them. The backbone of our ACOUSNET is a suite of physical and data link layer solutions for efficient data transmission. Compared with existing studies on these issues, our endeavor is unique by taking into account the battery nonlinearity and the network heterogeneity. Sea trials are essential for underwater networks since the ocean is very difficult to emulate due to its vast scale and complexity. The proposed research in this project will be significantly informed by the data collected in sea experiments under various conditions.","title":"CAREER: ACOustic Underwater Sensor NETwork (ACOUSNET) -- Multi-Level Adaptations","awardID":"1129043","effectiveDate":"2010-12-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560128"],"PO":["565303"]},"180344":{"abstract":"We propose a 1-day workshop designed to seed a cross-agency analysis of the infrastructure that is needed to bring research-developed learning technologies to broad use. While technology transfer programs exist within NSF and the Department of Education, we believe the challenges of bringing learning technologies to broad use go beyond what general-purpose technology transfer organizations are designed to provide.<br\/>The workshop will be held on December 14, 2010, in Washington, DC. It will bring together individuals who have successfully taken their research-developed learning technologies to broad use with representatives of organizations that have brought some of those technologies to market, that help researchers develop learning technologies with scale-up in mind, that provide infrastructure for transitioning technologies from research to use, and organizations that fund design and development of learning technologies and research on learning with technology (the National Science Foundation (NSF), the U.S. Department of Education (ED), and the Institute for Education Science (IES)).<br\/>Our objectives for this workshop are as follows: (1) Identify pathways for taking research-developed technology to broad use, (2) Identify phases in each of those pathways, and for each phase, identify the<br\/>challenges to successfully completing it, (3) Identify infrastructure that is available for addressing those challenges, (4) Identify gaps in that infrastructure, and (5) Provide an opportunity for a broad range of program officers at NSF, IES, and<br\/>ED to come together to consider this set of important issues.<br\/>The end product of the workshop will be a document that identifies pathways for transitioning learning technologies to broad use, phases along each pathway and the challenges to success at each phase, available infrastructure for enabling the processes and mitigating the challenges, and infrastructure that is missing. Our hope is that these lists will enable and empower appropriate communities to continue the discussion and plan toward the needed infrastructure.<br\/>Intellectual Merit: The workshop will build on the experiences and research of those who have worked towards bringing learning technologies to broad use and identify challenges and some of the ways of addressing those.<br\/>Broader Objectives: An infrastructure that can help researchers transition worthy learning technologies to broad use will enable rich and effective learning experiences for the entirety of the country?s school-age population and beyond.","title":"Workshop: Transitioning Research-Developed Learning Technologies into Broad Use Phases, Challenges, and Needed Infrastructure","awardID":"1110901","effectiveDate":"2010-12-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":["501314"],"PO":["565121"]},"174328":{"abstract":"This award supports a workshop to develop an intellectual and research agenda on the topics of citizen diplomacy and citizen networks. Citizen diplomacy and citizen networks are conceptualized as a technologically mediated form of soft-diplomacy. Citizen diplomacy raises intellectual scientific challenges for researchers that are by nature interdisciplinary: technical, economic and political, and social. Technical scientific research questions concern developing new capabilities for the mobile phone for use as a primary client, novel multimodal interaction environments, the reliability of a country?s infrastructure, and using technology to create incentives to participate. Political and economic research questions include studying government policy, Internet censorship, the cost of network use, and the instability of political climates. Social and cultural research questions include dealing with illiteracy, language differences, cultural awareness, finding others to participate, developing trust in others and in technology, managing system abuse and malicious behavior, and dealing with time zone differences. There is a critical need to develop a focused research agenda that outlines the scientific and technical challenges that effectively integrates these and other research topics to benefit from the socio-technical transformations of the world wide network.<br\/><br\/>The development of technologies to support citizen diplomacy will benefit citizens of the United States as well as those in developing countries. Creating citizen networks between the developing and developed worlds will help to break down cultural, social, and political barriers. Taking such a ?bottom-up? approach with citizens may influence policy at national levels. People in both developed and developing countries will gain by learning new ideas and cultural practices. Above all, we expect that citizen diplomacy can expose young people to alternative life paths, thus limiting the impacts of local extremist views.","title":"WORKSHOP: Designing Citizen Diplomacy","awardID":"1049369","effectiveDate":"2010-12-01","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["472187","518420"],"PO":["564456"]},"172823":{"abstract":"Since software is easier to configure, modify and re-use than hardware, an increasingly large portion of a medical device?s functionality is now being implemented in code. This presents considerable engineering challenges for both device regulators and manufacturers in terms of ensuring the safety and effectiveness of the deployed software. This NSF-FDA Scholar in Residence project focuses on the use of generic software architecture specifications for medical devices as a path to reducing the complexity of engineering medical device software. For manufacturers, generic device specifications can serve as a base artifact from which concrete implementations may be constructed. For regulators, they represent an artifact that can be modeled and used in evaluating implementations for adherence to a base set of safety requirements. The primary goals of this project are to explore a generic infusion pump architecture that can be extended to different infusion pump classes while preserving the requisite safety properties in a trustable, verifiable manner. The project explores challenges for developing usable generic device software architecture specifications and for applying them: producing concrete device instances, constructing extended subclasses from the generic architecture while verifying that properties are preserved, and supporting regulators and manufacturers as they evaluate device software conformance to safety architectures. The research employs model-checking, assertion-based verification, static analysis and reverse engineering to support assurance of safety-critical devices such as the Patient-Controlled Analgesia (PCA) infusion pump. The aim of the research is to provide an informative pilot study towards adoption of such techniques in device manufacturing workflows and regulatory regimes. One of the driving goals of this project is to create techniques and approaches that will benefit patients (by increasing device safety), device manufacturers (by helping them cut development costs) and regulators (by enabling them to automate and formalize their regulatory activities).","title":"Specification and Verification of Medical Device Software","awardID":"1041469","effectiveDate":"2010-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[463480],"PO":["561889"]},"180736":{"abstract":"The WiMAX technology (IEEE 802.16) can provide high-speed and long-range wireless communications for a large variety of applications. Smart antennas, such as Digital Adaptive Array (DAA) and Multiple Input and Multiple Output (MIMO) antennas, can offer a long transmission range and improve network capacity via interference suppression and spatial multiplexing. The objective of this project is to provide a comprehensive networking solution for a WiMAX mesh network with smart antennas by investigating the fundamental problems, including scheduling, routing and relay station placement. Specifically, their computational complexities will be investigated, and efficient and standard-compliant algorithms and protocols will be proposed to solve them. The PI will also develop a relay station model in the OPNET Modeler, and a DAA antenna based testbed to evaluate and validate the proposed solutions.<br\/><br\/>The algorithms and protocols proposed in this project can be applied in the WiMAX product development and are expected to impact the standardization activities in IEEE and IETF. The relay station model and the testbed can be used by other researchers for evaluation and validation. Moreover, the proposed research activities will complement and enrich the curriculum on wireless communications and networking.","title":"CAREER: Leveraging Smart Antennas for WiMAX-based Mesh Networking","awardID":"1113398","effectiveDate":"2010-12-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["445979"],"PO":["557315"]},"178693":{"abstract":"This is funding to support participation by faculty and graduate students from the United States in a jointly funded NSF-JST workshop on the topic of human interaction with remote presence robots, to be held November 30 and December 1, 2010, in Menlo Park, California at Willow Garage. In both the U.S. and Japan we are seeing the first successful commercial remote presence robots, but these efforts are rudimentary and primarily involve adding limited indoor mobility and the ability to direct a camera at a video conference screen. For the potential of the field to be realized, research is sorely needed to better understand complex issues such as the nature of remote social embodiment, how human-looking the robots should be, the psychological impacts of remote robot presence for the user as well as the interlocutor, what sorts of user interfaces mitigate cognitive load, and how to better support situational awareness. New directions in remote presence research could include other robot abilities such as outdoor mobility and dexterity. In addition, potential societal impacts and ethical considerations need to be addressed, especially when telepresence robot technologies are designed for applications targeting vulnerable populations (e.g., children and the elderly). Finally, telepresence robots have global implications, in that they will allow people from different cultures and different countries to interact both physically and socially. Someday, telepresence robots may even be endowed with knowledge of language, culture, and non-verbal communication cues from multiple cultures so that they can carry out multimodal, fully embodied translation. Thus, this joint Japanese-U.S. workshop is both timely and important. It will build upon two prior preliminary meetings on the topic, and bring together a diverse set of researchers who can speak to the issues from a technical, human, and global\/societal standpoint. Workshop participants will share their research experiences and findings, and identify a set of challenge problems that can guide ongoing research in this field. <br\/><br\/>Broader Impacts: Participation in the workshop will be by invitation. The Japanese delegation will consist of leading researchers in human-robot interaction from some of their top universities. U.S. participants have been carefully selected because they either have done research in tele-presence robots, have worked with social robots in the context of special populations (e.g., children, the elderly, the physically disabled, or people with learning disabilities), or can speak to societal or ethical considerations. The organizers have taken pains to promote diversity with respect to gender (half of the U.S. invitees are women) and ethnicity (two are Asian, one is of Hispanic background, and one is African American). About ten graduate students will also be included in order to foster new learning and training experiences for young researchers; again, the selection will be based on their interest in the workshop topic and also on diversity considerations. The primary workshop outcomes will be a white paper that summarizes the key ideas resulting from the meeting, including challenge problems that should define a research roadmap for the field. Presentation materials will be gathered and made available to participants, with the goal of fostering a community dialog that crosses international boarders and academic disciplines.","title":"WORKSHOP: Social Remote Presence Robots","awardID":"1103422","effectiveDate":"2010-12-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["497073"],"PO":["565227"]},"173040":{"abstract":"Spelman College will expand its work with women and underrepresented students in computer science and robotics nationally through the SpelBots robotics and computing program and the creation of the National SPELBOTS Club for K-12 students. The SpelBots are a team of female, African American students who conduct robotics research, compete worldwide in robotics and computer science competitions, and conduct K-12 outreach. The long-range vision of this project is to leverage the SpelBots activities to provide career role models in cutting-edge computer science and robotics from underrepresented communities. This project will bring attitude-changing computer science and robotics showcase presentations to underrepresented students and their teachers, and in conjunction with these showcases, promote the formation and mentoring of robotics and computer science clubs among K-12 students using social media as well as local workshops. Further, it will recruit, mentor and train undergraduate African American women students in computer science and robotics research, outreach, and competition projects. In addition, this project will provide advising for these activities for students at local historically black colleges and universities. The goals are to (1) investigate the effectiveness of the showcase approach to exposing, exciting, recruiting, and mentoring underrepresented middle and high school students in computing, (2) study the impact of our recruitment and retention activities in computer science among African American women, specifically, and underrepresented students, generally, in order to disseminate best practices, and (3) increase the amount of autonomous humanoid and mobile robotics research performed by African American undergraduate women.","title":"BPC-DP: SpelBots: African American Women Showcasing Robotics and Computer Science to Underrepresented K-12 Students Nationally","awardID":"1042454","effectiveDate":"2010-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464119,"502368",464121],"PO":["561855"]}}