{"93934":{"abstract":"Great strides have been made in computer animation and special effects. In some cases, synthetic or virtual actors have been integrated into live action films. This raises the need to accurately model and render clothing. In addition, increases in automation in the garment industry create a need for more sophisticated design and manufacturing techniques, which in turn require research in cloth modeling. This investigation will bring a more rigorous basis for cloth modeling to computer graphics, and will have the added benefit of being of interest to the garment industry.<br\/><br\/>This research will create a cohesive environment for designing fabrics for garments through a two-stage system. The first stage will determine the essential properties of cloth from its underlying structure and then the second stage will use a tailored model of the specific fabric to realistically simulate the dynamic behavior of a garment. The first stage, the micro-model, will simulate the deformation of the yarns in a small section of cloth and will analyze the results of subjecting the sample to various loading conditions. The relations describing the deformation behavior of cloth as a continuum will then be used in the second stage, the macro-model, to animate a full garment. The first stage micro-model will be more general than the specific setups currently used in textile research. In particular, the proposed model will consider yarns with arbitrary yarn paths that have twist and sliding contacts with friction. Empirical evidence and observation of woven fabrics have shown that the latter two features have a substantial role in the overall look and behavior of cloth, but neither has been considered in any previous work in textiles or computer graphics for modeling yarns in fabrics. A related issue is how to deal with the contacts, since the yarns will be in close proximity almost everywhere, contributing to traction forces. The second stage will simulate fabric using the revamped model based on the results of the first stage. The main focus will be on the constitutive equations and incorporating coupled nonlinear behavior. Features such as permanent wrinkles will be added in a later pass. Additional enhancements include local reflectance, transparency, and wind resistance as a function of the local strain. The actual relations would be derived during the first stage but then used during rendering or computation of external forces in this macro-model simulation.","title":"SGER: Combined Micro- and Macro-Model for Simulating Cloth by Deriving Mechanical Behavior from Underlying Fabric Structure","awardID":"0407963","effectiveDate":"2004-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["518667"],"PO":["532791"]},"99691":{"abstract":"This project explores employing distributed computational resources to combat the unreliability and highly variable performance inherent to wide-area systems. The goal of this work is to balance wide-area performance, security, and resource utilization by efficiently replicating and migrating computation using inexact information distributed across multiple administrative domains. To this end, this research addresses three areas important to scaling the global network infrastructure: i) dynamic placement and migration of computation for efficient utilization of global resources, ii) resource allocation among principals simultaneously utilizing resources in multiple administrative domains, and iii) a security infrastructure that enables the fine-grained transfer of rights for wide-area computation. The impact of this work will be increase fairness, scalability, and fault tolerance for distributed systems leveraging this infrastructure.","title":"CAREER: Balancing Performance, Security, and Resource Utilization in Wide-Area Distributed Systems","awardID":"0440455","effectiveDate":"2004-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["485593"],"PO":["309350"]},"98052":{"abstract":"Working memory is a human cognitive mechanism that is involved in solving problems and making decisions, which is known to have a limited capacity of 7 +\/- 2 units, where the complexity of each unit can vary from a single binary digit to a chunk that corresponds to a mental model. It has further been shown that people form better mental models in response to labeled images than they do in response to textual elements without accompanying images. The information age is the age of collecting. People collect web page bookmarks, articles, email, audio, and video. Digital libraries collect texts and multimedia. Search engines create collections dynamically. Collections are comprised of sets of records, and are typically presented in the form of lists of hyperlinks, in most cases lists of textual elements. Information dependent tasks, such as buying a car or writing a research paper require users to make conceptual connections between elements. We need to discover how to represent collections of information elements to account for the limitations of working memory, promote the formation of mental models, and support user tasks. Composition is a visual technique for forming chunks of conceptually related elements. In a navigational hypermedia composition, each visual information element functions as a navigational link to an information resource. The PIs' hypothesis is that presenting bookmark and result sets as compositions of labeled image elements will mitigate the demands placed upon the user's working memory. The PIs' long-term goal is to develop an understanding of the cognitive mechanisms of information seeking, so that they will be able to build tools that enable users to develop collections in forms that support the cognitive structures and processes involved in knowledge building. In this project, the PIs will gather preliminary data to establish that working memory function is extended by presenting bookmark and result set collections as visual compositions. Specifically, they will: evaluate bookmark and result set representations with divergent as well as convergent thinking tasks; support the formation of mental models by presenting collections with labeled images; and extend working memory capacity by presenting collections as compositions of visually blended labeled images. To these ends, they will take advantage of findings from cognitive science, and techniques from information retrieval, computer graphics, visual art, and design.<br\/><br\/>Broader Impacts: Current approaches to presenting bookmark and result sets as textual lists do not optimize our ability to form mental models, and maintain them in working memory. Information workers and students throughout academia, government, and industry often need to connect multiple idea sources, in the course of knowledge building activities such as problem solving, discovery, and writing. Because information workers spend so much time dealing with bookmark and result sets, the result is a waste of intellectual capacity across the knowledge economy. By presenting collections in forms that optimize use of mental model and working memory capabilities, the PIs expect to improve productivity and spur innovation for a broad population of internet users.","title":"SGER: Extending Working Memory Functions by Presenting Bookmark and Result Sets as Temporal Visual Compositions","awardID":"0429469","effectiveDate":"2004-05-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["557686","531380"],"PO":["565227"]},"97042":{"abstract":"This project will develop free, open-source software to support the workflow and administration of electronic research journals. Even though the Web has made is easy to disseminate scientific journals, there are still very significant barriers and costs to producing electronic scientific journals. These costs, which are primarily administrative, include managing the workflow involved in receiving articles, responding to authors, recruiting reviewers, etc. Currently there is a lack of free, open-source software to support these critical administrative tasks. This project aims to fill that void. The fresults of this project have the potential for significant broader impacts on science through its enabling the timely and frictionless dissemination of new scientific knowledge.","title":"SGER: Open Source System for Free Electronic Publishing of Scientific Journals","awardID":"0423197","effectiveDate":"2004-05-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["553754"],"PO":["491702"]},"89420":{"abstract":"The standardization of Message Passing Interface (MPI) has resulted in a <br\/>large number of applications being developed using MPI. The current MPI <br\/>standard hides network details and provides a simple interface for communication. While these features ease the task of parallel programming, <br\/>they limit communication optimization opportunities. Specifically,<br\/>with the current MPI, communication optimizations can be performed <br\/>either by the compiler or in the library implementation. In both cases,<br\/>optimizations are limited. Optimizations performed by the compiler <br\/>must be architecture independent since the library hides architectural <br\/>details from the compiler. Optimizations in the library implementation <br\/>are usually architecture dependent. However, such optimizations can <br\/>only be applied to each individual routine.<br\/><br\/>In this research, we propose to optimize MPI programs through compiled <br\/>communication. By simultaneously using the application communication <br\/>information and the system architecture information to perform <br\/>communication optimizations, compiled communication overcomes the<br\/>limitations in the traditional communication system. We will accomplish the <br\/>proposed work by developing systems that allow programmers <br\/>to write regular portable MPI programs and enjoy the high communication <br\/>performance achieved through compiled communication. The systems <br\/>can also be used to optimize existing MPI programs. We will concentrate <br\/>on two related parts of this research: extending the MPI standard by <br\/>adding new routines to support compiled communication, and developing a <br\/>restructuring compiler that analyzes an MPI program and transforms the <br\/>program into one that employs the compiled communication technique. <br\/>We will also develop techniques for applying compiled communication to <br\/>irregular problems and investigate the interaction between the library <br\/>and the compiler support for compiled communication.","title":"Optimizing MPI Programs through Compiled Communication","awardID":"0342540","effectiveDate":"2004-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["554071"],"PO":["565272"]},"98761":{"abstract":"This is funding to support this year's CSCW doctoral research consortium (workshop) of approximately 12 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2004 Conference on Computer Supported Cooperative Work (CSCW'04), to be held November 6-10 in Chicago, and jointly sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI) and the Special Interest Group on Groups (SIGGROUP). Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other CSCW research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on November 7, with follow up activities (including poster sessions open to all attendees) to be held during the technical program of the CSCW'04 conference on November 8-10. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results made available to the organizers of future consortia. The bi-annual CSCW doctoral consortia, which began in 1992, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading CSCW researchers participated as students in earlier consortia. These doctoral consortia traditionally bring together the best of the next generation of CSCW researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"WORKSHOP: Computer-Supported Cooperative Work Doctoral Research Colloquium; November 6-10, 2004; Chicago, IL","awardID":"0434211","effectiveDate":"2004-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["551829","430298"],"PO":["564456"]},"99762":{"abstract":"The power of the national information infrastructure has expanded<br\/>enormously over the last decade. Commercial Internet service and<br\/>government-sponsored advanced networks for research and education<br\/>support a range of national priorities. Unfortunately, rapid<br\/>development and deployment of robust, adaptive network software is<br\/>hampered by a fundamental obstacle: prototype systems are difficult to<br\/>evaluate due to scale and complexity of their host environment---the<br\/>Internet.<br\/><br\/>This proposal seeks to remove this obstacle by constructing a software<br\/>environment for evaluating prototype network software systems under<br\/>realistic, controlled, repeatable conditions through scalable Internet<br\/>emulation. The proposed system, ModelNet, emulates a wide-area<br\/>network on a high-speed cluster, enabling researchers to deploy<br\/>unmodified software prototypes in a configurable Internet-like<br\/>environment and subject them to faults and varying network conditions.<br\/><br\/>This research will first investigate techniques for scaling network<br\/>emulation to thousands of unmodified applications with aggregate<br\/>communication bandwidth of over 10 Gb\/s. Second, it will enable the<br\/>community to leverage large-scale network emulation as a primary<br\/>technique for rapidly developing and evaluating next-generation<br\/>Internet services and applications. Finally, the research will seek<br\/>fundamental improvements in network service robustness and performance<br\/>by providing a controlled environment for subjecting network services<br\/>to a range of realistic deployment scenarios.","title":"Evaluating Global-scale Distributed Systems using Scalable Network Emulation","awardID":"0440743","effectiveDate":"2004-05-01","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["485593"],"PO":["309350"]},"96980":{"abstract":"This award is to subsidize travel, conference, and housing expenses of students selected to participate in the HLT\/NAACL Student Research Workshop to be held on May 2, 2004 in conjunction with the second annual HLT\/NAACL, May 2-7, 2004 in Boston, MA. The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing and language engineering, with two regional organizations in Europe (EACL) and North America (NAACL). Starting in 2003, the annual conference of the NAACL has joined with the Human Language Technology (HLT) conference to provide a single venue for the presentation of cutting-edge research and applications related to computational linguistics in North America.<br\/><br\/>The workshop format allows students to present their research and receive feedback from a panel of established researchers in the field. It provides students with invaluable exposure to outside perspectives on their work at a critical time in their professional development through feedback from the panel and other student participants. Also, student participants will be able to see each other's presentations and feedback, which could lead to a general raising of standards and expectations, strengthening future student research. The Student Workshop is an inexpensive yet highly effective means of encouraging young and upcoming computational linguists. The intimate format encourages the student participants to begin building a rapport with established researchers. The workshop should contribute to the maintenance and development of a skilled and diverse natural language processing workforce, helping to produce a pool of researchers with the scientific and engineering knowledge required for future applications of natural language processing. It should help to foster international scientific exchange, providing merit-based opportunities for future leaders of the field to attend a conference that might otherwise be less geographically diverse than is desirable for the field. In addition, by building a supportive environment for these students, it is more likely that down the road, they will lend a supporting hand to other students who follow.<br\/><br\/>Computational linguistics is a multidisciplinary field of increasing importance to science, commerce, and society. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"Workshop: Student Research in Computational Linguistics, at the HLT\/NAACL 2004 Conference","awardID":"0422841","effectiveDate":"2004-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[255072,"369058","543555"],"PO":["565215"]},"97541":{"abstract":"This workshop will explore initial experiences in e-democracy in the US and in Europe. As well as experts in academic research aspects, attendees will include representativess of government agencies who have experimented with e-democracy on both sides of the Atlantic. Using a focus group methodology, the group will explore such questions as: <br\/><br\/>o What created the demand for the e-democracy projects which were undertaken?<br\/>o What were the principal barriers and facilitators encountered?<br\/>o What strategies were employed to overcome barriers?<br\/>o What changes in democratic practices, processes or structures have occured as a result of the projects?<br\/><br\/>A variety of new research questions will also be identified, and the workshop results will be disseminated on the Web and through scholarly journals.","title":"Leading Edge Electronic Democracy: A Focus Group; May 6-7-2004; Oxford, England","awardID":"0425766","effectiveDate":"2004-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":[256630],"PO":["371077"]},"89105":{"abstract":"CNS-0340813<br\/>Dee Weikle<br\/>Institution: University of Virginia<br\/><br\/>Title: Caches as Filters Benchmark Characterization and Demonstration<br\/><br\/>This ADVANCE Fellows award provides support to for a project to use the caches-as-filters framework to characterize benchmark suites, specifically for the purpose of cache design, and to demonstrate the use of the framework on the design of a small-scale caching system. The caches-as-filters framework addresses difficulties in using a benchmark methodology for memory hierarchy design. The demonstration of this framework could encourage the architecture community to use design methodologies that include more analysis resulting in a deeper understanding of design issue.<br\/><br\/>The intellectual merit of this project lies in the opportunity to provide a theoretic basis for a systematic approach to cache design. The characterizations of the benchmarks provide useful insight into the kinds of memory systems behavior found in real-world program and thus may contribute to the current understanding in the field of computer memory management. <br\/><br\/>The broader impacts include development of new tools that can be used by computer architecture research groups. This may include development of new ways in which researchers will frame problems and communicate about them as well as convey their ideas to students. The project includes both graduate and undergraduate students within a supportive environment. There is a strong commitment to dissemination, through a graduate course, web site and publications.","title":"ADVANCE Fellows Award: Caches As Filters Benchmark Characterization and Demonstration","awardID":"0340813","effectiveDate":"2004-05-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1681","name":"ADVANCE - FELLOWS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":[233677],"PO":["564181"]},"90440":{"abstract":"Demand for low-power, sophisticated information processing and control systems grows daily. Consumers seek hand-held devices delivering more computationally intensive capabilities in a smaller space with a longer battery life. Industry requires reduced operating costs by reducing the power consumed by installed systems. Military applications demand deployable smart sensors with greater mission longevity, and that sustain themselves on minimal resources. Such demands have driven recent research activity to reconsider analog embedded processing. Advances in analog floating-gate circuits enable complex algorithms to be realized in the analog domain in a manner that is both programmable and adaptive. With scalability similar to CMOS circuits, massively parallel analog processing becomes feasible.<br\/><br\/>The focus of this CAREER research in cooperative analog-digital signal processing (CADSP) is on freedom of movement of the partition between the analog and digital systems. By allowing more of the computation to be performed in low-power analog circuits, cooperative analog-digital signal processing enables advanced functionality in very low-power embedded systems and smart sensors. <br\/><br\/>This project pioneers the design and implementation of embedded signal processing and control systems that perform significant processing in analog as well as digital circuits. The analog circuits are extremely small and low power, making it possible to investigate entirely new methods of computing, exploiting large-scale parallelism and redundancy in a very small space. This entails a very high-density field-programmable analog array (FPAA) based on floating-gate analog circuits. The FPAA device operates in tandem with a traditional digital field-programmable gate array (FPGA). Significant impact is expected for signal processing and control applications, enabling low-power analog FPAA processing for computations previously viewed as feasible only in the digital domain.<br\/> <br\/>The integration of research and education provides new theoretical analyses, software tools, silicon chips, and education materials to aid both academics and industrial designers. Broader impact is sought through tools that are made freely available and on-line education materials, disseminated via university courses and short courses.","title":"CAREER: Ultra-Low Power Programmable Analog Signal Processing Systems","awardID":"0347792","effectiveDate":"2004-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V577","name":"CIA-ANTENNE ARRAY PROCESSING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["550108"],"PO":["561889"]},"90374":{"abstract":"Recent advances in information and micro-scale technologies are enabling a new generation of embedded systems that are pervading our daily lives, from automobiles and aircrafts to manufacturing plants. Such applications consist of tightly coupled physical and computational processes that dynamically interact with the environment in the presence of uncertainty and variability. This project aims at developing a stochastic hybrid system framework that provides the theories, computational methods, and software tools for analysis and design of such systems. Stochastic hybrid systems are approximated by locally consistent Markov decision processes that preserve local mean and covariance. The project addresses the following critical research challenges: (1) Formal analysis of system properties expressed using probabilistic temporal logics. Stochastic bisimulations are employed to provide equivalent minimal models of the approximating Markov processes and allow the development of scalable algorithms. (2) Design of embedded control systems with high degree of autonomy using stochastic optimal control. Efficient algorithms are designed by utilizing stochastic bisimulations that account for the available controls. Model-based software design is used for building a suite of supporting tools and experimental research is conducted to validate the results. The research advancements are integrated into the undergraduate and graduate curriculum using a series of realistic challenge problems. Technical results, software tools, and the education materials will be made available electronically using an open-source model as well as through publications and conference participation. The broader goal of the project is to establish solid theoretical foundations and computational methods that will impact embedded system design in applications such as mobile sensor networks for homeland security and environmental monitoring, intelligent transportation systems, and electromechanical systems and chemical processes in manufacturing.","title":"CAREER: Computational Methods for the Analysis and Design of Stochastic Hybrid Systems","awardID":"0347440","effectiveDate":"2004-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["533198"],"PO":["561889"]},"90320":{"abstract":"The overall objective of this CAREER award is the development of an Internet-scale, on-line predicate-evaluation. The first specific objective of the project is the validation of a partial synchrony model for the Internet. The second specific objective is the development of scalable monitoring and predicate-evaluation algorithms which exploit hierarchy by aggregating information, approximating to control of the tradeoff between fidelity and performance, distributing the evaluation of sub-predicates to local domains, within which partial synchrony assumptions will be exploited within. Symbolic model-checking and partial order methods enhance the performance of intra-domain monitoring. Finally, compositional reasoning techniques and data aggregation will be used to perform inter-domain monitoring. <br\/><br\/>The expected result of the proposed research is a set of robust and scalable algorithms to evaluate system state with correctness guarantees established with respect to validated synchrony assumptions. This research is expected to provide a fundamental ability to understand the behavior of a distributed system using techniques that are formally correct and practical, suitable for Grid computing, large-scale collaboration systems, and replicated servers. The educational objective is to increase in the retention and success of underrepresented students in computer science by explicitly teaching educational success skills through participation in research, through a broad-spectrum introduction to computer science, and through development of academic preparedness specifically relevant to computer science. These activities will take place within the context of the affinity group model. It is expected that such participation will lead to greater retention and success through the development of affinity and persistence.","title":"CAREER: Monitoring and Assertion-Checking for Internet-Scale Applications","awardID":"0347222","effectiveDate":"2004-05-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["425923"],"PO":["565090"]},"98814":{"abstract":"The proposed Second Symposium on Intelligence and Security Informatics (ISI-2004) aims to provide an intellectual forum for discussion among usually disparate communities: academic researchers in information technologies, computer science, public policy, and social sciences; local, state, and federal law enforcement and intelligence experts; and information technology industry consultants and practitioners. The speakers and attendees, including noted informatics, computer science, and policy researchers as well as progressive leaders in law enforcement and security communities will engage in productive dialogue and explore avenues of collaboration. The organizers of the meeting will solicit high-quality research papers of relevance to intelligence and security research, which will be evaluated by appropriate researchers and practitioners for presentation as well as publication. Active intelligence and security informatics research can and will improve knowledge discovery and dissemination, and enhance information sharing and collaboration across law enforcement communities; the Second ISI Symposium supports that outcome.","title":"Symposium on Intelligence and Security Informatics; June, 2004; Tucson, AZ","awardID":"0434512","effectiveDate":"2004-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V508","name":"HOMELAND SECURITY-ARS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V524","name":"CIA-KDD WORKING GROUP"}}],"PIcoPI":["548216","387279"],"PO":["565136"]},"90476":{"abstract":"This project aims to help data owners deal with the ever-increasing demand of publishing proprietary data on the Web as XML, in useful yet controlled ways. One major thrust is the development of tools allowing data publishers to check that the privacy of sensitive data is not inadvertently violated by what is exposed to the outside view (even in indirect ways). The publisher specifies the sensitive data via a secret query S against the proprietary schema and the tools check that attackers cannot compute the answer to S (exactly or approximately) from the published data. The research approach includes development of a hierarchy of privacy guarantees, qualified by the accuracy of the approximation and the attacker's computational resources. The second project goal is the delivery of tools for integrating web publishing with the limited query interfaces supported by current \"web services\" technologies. The focus is on web services, which implement large sets of parameterized XML queries. The project seeks solutions for (i) the query set specification using concise, intuitive visual paradigms and (ii) the rewriting of client queries to execution plans, which invoke only supported queries. The developed technologies will benefit all categories of data owners who publish on the Web, from commercial\/governmental\/academic institutions to private individuals. Some tools will serve as course materials for undergraduate and graduate database classes, but also for a compiler class at UCSD. Software and course materials will be freely distributed for non-commercial purposes. The project Web site http:\/\/www.db.ucsd.edu\/people\/alin\/nsf-career will be used for the results dissemination.","title":"CAREER: XML Middleware for Privacy-Preserving Database Publishing","awardID":"0347968","effectiveDate":"2004-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518657"],"PO":["565136"]},"90400":{"abstract":"PROPOSAL NO: 0347573<br\/>INSTITUTION: University of Maryland College Park<br\/>PRINCIPAL INVESTIGATOR: Horiuchi ,Timothy<br\/>TITLE: Adaptive Neuromorphic VLSI for Improving Accuracy and Precision:<br\/>Modeling Attention for Bat Echolocation<br\/><br\/><br\/>Abstract<br\/><br\/>Echoes are a major part of our daily auditory lives, yet very few of us are even aware that we use them constantly to understand the space around us. Echolocating bats have made these echoes their primary sense (i.e. sonar), demonstrating agile flight in complex forest environments and successful insect capture in flight; all in darkness. Because the brain represents a computational engine that far surpasses any single man-made computer in both capabilities and power consumption, we are interested to understand the principles of neural computation.<br\/><br\/>For a number of years we have been constructing custom analog integrated circuits that mimic the basic neural processing of bat echolocation in an effort to demonstrate these principles on a small flying vehicle, requiring real-time performance, miniaturization, and power efficiency.<br\/><br\/>The 'neuromorphic' very-large-scale-integration (VLSI) approach (which implements neural computations by mimicking its structural morphology), offers advantages in size and power, but often lacks needed precision and flexibility. This has been one of the main concerns about this research field's long-term viability. In this proposal we pursue three main goals: 1) to expand the use of learning and adaptation techniques at the circuit level to increase computational precision and accuracy at the system-level, 2) to explore the use of 'virtual' wiring to mimic large-scale wiring changes akin to neural development, and 3) to adapt existing neural models of spatial attention for use in sampled sensory systems (e.g., sonar) to guide this learning process. <br\/><br\/>Through this research and our educational plan we hope to raise awareness to the rich acoustic cues around us and how we as humans and the machines we build can learn to make use of them.","title":"CAREER: Adaptive Neuromorphic VLSI for Improving Accuracy and Precision: Modeling Attention for Bat Echolocation","awardID":"0347573","effectiveDate":"2004-05-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["531851"],"PO":["562984"]},"90401":{"abstract":"The goal of the project is to incorporate the three fundamental features of space, time, and uncertainty (STU) into the next generation of Geographical Information Systems (GIS). The STU incorporation greatly increases the expressive power of GIS and broadens the possible spectrum of future GIS applications. The STU project is devoted to the design, implementation, and database integration of new, computational, formal data models (type systems, algebras), query languages, application programming interfaces, and software tools for managing and querying space, space-time, space-uncertainty, and space-time-uncertainty objects. The goal is to create universal, application-neutral, and versatile tools serving as a basis for numerous GIS applications in which the inherent features of space, time, and uncertainty play an important role. These tools will be implemented as extension packages and embedded into extensible commercial database management systems (DBMS). The approach used in this project rests on several extensible algebras, which may cooperate with each other and make it possible to add new types and operations if necessary. The connection of the algebras to commercial DBMS will have a broad impact on the many domains that use large volumes of STU data by improving the processing methods for GIS-related applications. Different and large user groups get the chance to obtain full-fledged database support enhanced by one or several STU algebras. The educational component of this project includes creating and using GIS educational materials and involving students in research by providing students with an appropriate software and hardware environment for their research projects and further education. The project Web site http:\/\/www.cise.ufl.edu\/research\/SpaceTimeUncertainty\/STU.html will be used for dissemination of both research and educational material.","title":"CAREER: The STU Project: Database Integration of Space, Time, and Uncertainty as a Foundation for the Next Generation of GIS","awardID":"0347574","effectiveDate":"2004-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["409138"],"PO":["427499"]},"90885":{"abstract":"The Real-time and Embedded Technology and Application Symposium (RTAS) is an annual symposium partially sponsored by the IEEE Computer Society. The symposium traditionally brings together researchers in the broad field of embedded and real-time computing, control, and communication. The symposium takes place in Toronto, Canada, May 25th-28th, 2004, and in 2004 includes a separate track on Real-Time Control (including hybrid systems) and another separate track on Embedded Applications. To ensure a broader impact in disseminating the results of this symposium, and to interest young researchers in the field of embedded and hybrid systems, this award is for travel grants enabling student travel to attend RTAS 2004 and a pre-conference workshop on current challenges in embedded computing. The purpose is to encourage the attendance of students who otherwise would not have the opportunity to participate in such a conference.","title":"Symposium Travel Grants for Under-Represented Students; May 25-28, 2004, Toronto, Canada","awardID":"0350046","effectiveDate":"2004-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["553633"],"PO":["561889"]},"90368":{"abstract":"The project is concerned with investigating a promising approach to interactive, large-scale data analysis, called online aggregation (OLA). In OLA, the user is kept informed at all times of the current estimate of the answer to a query over the data, along with a statistical estimate of the accuracy of the answer. The advantage of OLA is that an approximate answer with satisfactory accuracy can often be computed very quickly and inexpensively, at which time the query can be terminated. <br\/><br\/>The project has two goals - technological and educational. The technological goal of the project is designing and implementing a software system for data analysis that is fundamentally based on OLA, as opposed to software that augments the traditional, batched processing architecture with some OLA capabilities. The project reconsiders data management issues such as indexing, query optimization, join algorithms, and user interface design in the context of OLA. Evaluation is via rigorous benchmarking of the software produced. The educational goal of the project is development of techniques the make use of direct faculty involvement to help ensure retention of beginning engineering students. The project will achieve broad impact by developing techniques with potential to bring about a fundamental change in the $3.5 billion segment of the software industry now devoted to analytic processing. Also, by investigating ways to ensure the retention and success of tomorrow's engineers, the project will achieve broad impact by helping to ensure the technological and scientific leadership of the nation. The project Web site http:\/\/www.cise.ufl.edu\/~cjermain\/OLA will be used for the results dissemination.","title":"CAREER: New Technologies for Online Aggregation","awardID":"0347408","effectiveDate":"2004-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["543599"],"PO":["563751"]}}