{"5467":{"abstract":"This research consists of four major objectives: (1) The development of powerful, rapid, hybrid acquisition schemes designed to operate in channels containing multiple-access interference, fading, and multipath. These schemes will be designed to acquire signals rapidly and reliably even under severe channel conditions. (2) The creation of a new class of sequential multihypothesis tests based on pipelining, a paradigm akin to a parallel server queueing system. (3) The development of acquisition schemes that exploit the presence of multipath. (4) A determination of the acquisition-based capacity of direct sequence CDMA communications and the acquisition-limited throughput of packet-data CDMA in third generation cellular communications systems. Significant advances in sequential decision theory are sought in the study, and the results will be applicable to systems ranging from multiple-resolution radar systems to PCS systems.","title":"New Sequential Techniques for Code Acquisition in Wireless CDMA Systems","awardID":"9523967","effectiveDate":"1997-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["223414"],"PO":["150411"]},"29282":{"abstract":"","title":"CAREER: Parallel Integer Programming for Architectural-LevelVLSI Design","awardID":"9796145","effectiveDate":"1997-01-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550681"],"PO":["179846"]},"29393":{"abstract":"","title":"General-Purpose Parallel Architectures and Routing Schemes","awardID":"9796259","effectiveDate":"1997-01-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["496796"],"PO":["74434"]},"13280":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for an OC-3 ATM connection to an existing OC-12 SONET ring which connects four sites in the Pittsburgh area to the Very High Performance Backbone Network Service (vBNS). The other sites are the Pittsburgh Supercomputer Center, Westinghouse Energy Center and Allegheny Hospital. Applications include Informedia: Digital Video Library and News on Demand; Automated Interactive Microscope; Earthquake Modelling; Virtualized Reality; National Medical Practice Knowledge Banks; and Networking Research. Collaborating institutions include University of Michigan, UC Santa Barbara, UC Berkeley, Stanford, University of Illinois, MIT, Cornell and University of Virginia.","title":"A vBNS Connection for Carnegie Mellon University","awardID":"9616932","effectiveDate":"1997-01-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["371226","463128","560044"],"PO":["121202"]},"29396":{"abstract":"","title":"RUI: Knowledge and Concurrency","awardID":"9796262","effectiveDate":"1997-01-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[74315],"PO":["150516"]},"13260":{"abstract":"Passaic County Community College requests support from NSF to connect it's campus to the Internet. The College is a publicly supported associate degree institution with a student body of 4000. The College intends to connect to the Internet through Bell Atlantic, a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connection of Passaic County Community College to the Internet","awardID":"9616906","effectiveDate":"1997-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33554,33555],"PO":["121202"]},"13140":{"abstract":"Valley Forge Christian College requests support from NSF to connect it's campus to the Internet. The College provides bible and religious education degrees with a student population 500 students with 19 full time and 11 part time faculty. The College intends to connect to the Internet through the Voicenet, a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connection to Voicenet\/Internet","awardID":"9616648","effectiveDate":"1997-01-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33275,33276,33277],"PO":["121202"]},"13482":{"abstract":"96-17426 Espy-Wilson, Carol Y. Boston University CISE Research Instrumentation: A Study of an Event Based and Feature Based Approach to Speech Recognition The aims of this study are to develop a speech recognition system based on phonetic features and to use the development of this system as a tool for understanding variability. Relative to cepstral parameters, broad-class recognition results show that a signal representation based on phonetic features is better able to target the linguistic information and it does so in a more speaker-independent manner. Furthermore, such a signal representation allows for a direct study of phonological processes. The proposed equipment will help extend this work. First, the drastic cut in computation time afforded by the Ultra 2- will speed up the development and optimization of acoustic parameters using the Fisher criterion and an automatic classifier, - make feasible experimentation with a full object-oriented lexicon,- allow experimentation with computationally expensive algorithms for the extraction of acoustic events and -allow faster computation of recognition results. Second, the extra disks will allow investigation of larger data sets and the storage of computed parameters on line. Third, the workstations will aid analysis by allowing users to listen to utterances and perform processing locally. Finally, the proposed PC and synthesizer will allow a study of variability through acoustic modeling and analysis-by-synthesis.","title":"CISE Research Instrumentation: A Study of an Event Based and Feature Based Approach to Speech Recognition","awardID":"9617426","effectiveDate":"1997-01-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["508500"],"PO":["557609"]},"13273":{"abstract":"Bradford College requests support from NSF to connect it's campus to the Internet. Bradford College in Bradford, MD has approximately 620 students and 35 full time faculty. The college intends to connect through SprintLink, an Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Accessing the Internet to advance teaching and learning at Bradford College","awardID":"9616923","effectiveDate":"1997-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33585,33586,33587],"PO":["43608"]},"12053":{"abstract":"Two groups, the Imaging Systems Laboratory (ISL) of the University of Colorado and the Laboratorio de Optica, (LO) in the Departamento de Fisica y Matematicas of the Universidad de Los Americas, are pursuing a joint research program to further develop and demonstrate tools for the design of integrated optical\/digital imaging systems. This program combines the capabilities of the two groups and focuses their efforts by concentrating on the reduction of the longitudinal region of focus of an imaging system. That is, an optical\/digital imaging system is to be designed that has a greatly reduced depth of field or, equivalently, a dramatically increased resolution along the longitudinal axis. Based on previous research by the two groups, it is believed that this goal can be achieved without adversely affecting the transverse resolution. Indeed, it appears likely that, with a combined optical\/digital system, the transverse resolution can also be increased somewhat. Such a system would be useful in microscopy, medical imaging, and in inspection devices for manufacturing. In addition to the scientific advances and potential new imaging systems, the interaction between the graduate students in each group and long-term (one month to one semester) visits to each others' institutions will greatly promote international cooperation in the field, and understanding between the two cultures.","title":"CONACyT: Research on Integrated Optical\/Digital Imaging Systems with Increased Longitudinal Resolution","awardID":"9613754","effectiveDate":"1997-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["151047"],"PO":["564898"]},"13440":{"abstract":"9617315 Das, Chita, R. Sivasubramaniam, Anand Pennsylvania State University CISE Research Instrumentation: A Network of Workstations for High Performance Computing This instrumentation grant funds the purchase of 8 UltraSPARC workstations and an 8-port Myrinet switch to set up a Network of Workstations (NOW) laboratory at the Department of Computer Science and Engineering at the Pennsylvania State University. The NOW laboratory is to be used as the experimental platform for several research projects, including in particular the following four: -Efficient Communication Support for a Network of Workstations -High Performance Geographical Information Systems -Index Caching on a Network of Stations -Communication Characterization of Parallel Applications The first project focuses on deriving efficient software mechanisms for providing low latency and high bandwidth communication for parallel applications. The second interdisciplinary research project plans to develop a High Performance Temporal Geographical information System (GIS) on the NOW platform. The third project proposes to examine database performance issues using a client-server architecture. The last project aims at characterizing the communication behavior of parallel algorithms by direct execution of different applications, simulating several network architectures, and developing a faster execution-driven simulation environment on the NOW platform.","title":"CISE Research Instrumentation: A Network of Workstations for High Performance Computing","awardID":"9617315","effectiveDate":"1997-01-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550859","542015"],"PO":["557609"]},"13462":{"abstract":"9617372 Fortes, Jose A. Eigenmann, Rudolf Purdue University CISE Research Instrumentation: Symmetric Multiprocessor for Research on Parallel Architecture, Compiler, Applications and On-demand Network-computing This research instrumentation grant enables collaboration between two universities in four areas of research:-Hierarchical Processor-and-Memory Architecture for-High Performance Computing - An Advanced Program Analysis and Compilation Infrastructure- Characterization of Large (Petaflop) Computational Applications - Metaprogramming and On-demand Metacomputing for Network-based Computational Hubs. The focus of this project is on advancing the state of the art in high-performance computing on the four fronts:- the design of high-performance computers capable of 100 trillion operations per second (i.e. 100 TOPS),- advanced tools for analysis and compilation of programs for execution on machines with multiple processors,- the characterization of applications that require computation rates of 100-1000 TOPS and- the design of a network-based software infrastructure that allows the use of linked computers and linked programs (i.e., metacomputers and metaprograms) through conventional network browsers. The main ideas currently under investigation are being validated through extensive computational experiments and computer simulations. The equipment acquired with the funds provided by this grant provides the computational speed, memory, storage and communication demands of the experimental component of this project which would otherwise not be possible or take unacceptably long times to perform. The experimentation made possible by the availability of a symmetric multiprocessor is essential to the validation of research ideas and results pursued in this project. This work is being carried collaboratively by researchers at Purdue University and Northwestern University.","title":"CISE Research Instrumentation: Symmetric Multiprocessor for Research on Parallel Architecture, Compiler, Applications and On-Demand Network-Computing","awardID":"9617372","effectiveDate":"1997-01-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["520672","540130","558595"],"PO":["557609"]},"13463":{"abstract":"9617375 Mohapatra, Prasant Sapatnekar, Sachin S. Iowa State University CISE Research Instrumentation: High Performance Computing and Application Laboratory This research instrumentation grant enables the Department of Electrical and Computer Engineering at Iowa State University to purchase equipment for developing a high-performance computing and applications laboratory dedicated to supporting research in computer and information science and engineering. The facility will be used for the following research projects funded by the CISE division of the NSF: - Integrated Processor Management Schemes for Parallel Computers, - Utilizing Idle\/Spare Capacity Efficiently on a Network of Workstations, - Hardware Multicast Routing Technique for Scalable Parallel Computers, - Design Optimizations for High-Performance Circuits, - Optimizing Synthesis for Periodic Real-Time Applications. The investigators propose to acquire eight workstations and integrate them with the four existing ones (purchased through prior NSF and other funding) to build a cluster of twelve workstations. These workstations will be connected through a high-speed ethernet backbone. The time-consuming simulations that are required for the listed projects can be parallelized and run efficiently on the workstation cluster. Currently, the Computer Engineering program at Iowa State University does not have a computing laboratory dedicated to support graduate research activities. The University and the Department are highly supportive of building such a facility and are committed to the development of the computer engineering research program.","title":"CISE Research Instrumentation: High Performance Computing and Application Laboratory","awardID":"9617375","effectiveDate":"1997-01-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550540",34117,34118,"508418"],"PO":["557609"]},"13364":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for an OC-3 ATM Boston metropolitan area network and an OC-3 connection from that network to the vBNS. Applications include: * Traffic Controller Module for RSVP * Providing End-to-end Quality of Service in an IP-over-ATM Network * Metacomputing and Distributed Visualization * Earthquake Physics * Algorithms for Global Optimization, Enhanced Sampling and Reaction Pathway Determination * Modelling Excited State Chemical Dynamics Collaborating institutions include the National Center for Supercomputing Applications, University of Illinois at Chicago, Cornell, University of California at San Diego, University of Colorado, Northeastern, MIT, Syracuse University and the California Institute of Technology.","title":"Creation of High-Bandwidth Regional Infrastructure with National Connectivity","awardID":"9617127","effectiveDate":"1997-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["292526","525906","425870","521813"],"PO":["121202"]},"13287":{"abstract":"The Philadelphia College of Pharmacy and Science requests support from NSF to connect it's campus to the Internet. The College provides health science education and research with a student population over 2,000 graduate and undergraduate students. The College intends to connect to the Internet through the Health Sciences Libraries Consortium, a local nonprofit Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connecting Philadelphia College Pharmacy and Science to the Internet","awardID":"9616948","effectiveDate":"1997-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33623,33624],"PO":["121202"]},"13067":{"abstract":"9616444 Resnick, Michael Massachusetts Institute of Technology CISE\/EHR\/ENG\/MPS Collaborative Research Learning Technologies: Beyond Black Boxes: Bringing Transparency and Aesthetics back to Scientific Instruments Massachusetts Institute of Technology has been awarded $880,658 over 3 years for a collaborative project between MIT, Wellesley College and the University of Colorado, to develop computational tools and project materials to allow children to create their own scientific instruments, engaging them in designing and building, as well as in observing, measuring and interpreting. It is hypothesized that more students, like scientists of old, will be motivated to participate in scientific activities, and in addition the design process will help them develop critical capacities for evaluation. The project promises to provide students with deeper understanding of the relationships between science and technology, and between science and the real world. The project will develop a family of tiny, fully programmable computational devices (crickets) that students can embed in everyday objects. Crickets can control motors and lights, receive information from sensors and communicate with one another via infrared light. The technologies will be evaluated in a range of settings, including work with teachers in classrooms and a vocational-technical school. In addition to testing their hypothesis, the PI's will evaluate theoretical learning issues of balance between physical and virtual objects, and between \"transparent\" and \"opaque\" objects.","title":"CISE\/EHR\/ENG\/MPS Collaborative Research on Learning Technologies: Beyond Black Boxes: Bring Transparency and Aesthetics Back to Scientific Instruments","awardID":"9616444","effectiveDate":"1997-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["497072","313140"],"PO":["173164"]},"13442":{"abstract":"9617321 Stockman, George C. Jain, Anil K. Michigan State University CISE Research Instrumentation: Equipment for Real-Time Interaction with Images This research instrumentation grant enables the purchase of equipment to be used in the following research projects: -Self Organization for Vision-Based Learning, Databases and Content-Based Retrieval, Modeling , Tracking, and Interpretation of Human Faces. Research is being performed in vision-guided robotics, visual learning, organizing and accessing databases of images and modeling and tracking human faces. Key elements of the research include - investigation of systematic methods for automatic learning over multiple tasks including navigation and object recognition, -organization of imagery for fast access using integrated features such as shape, texture, and color, and -modeling and storage of objects for fast recognition and real-time tracking. Advancement in the research projects depends critically on the new instrumentation which will provide the capability to interact in real-time with both sensed images from the environment and images stored in memory. A steerable camera system will be used for experiments in navigation, hand-eye coordination and tracking of hands and faces for gesture recognition. RAID disk memory connected to two powerful workstations will provide for large and fast storage for two simultaneous experiments which may be storing or searching video images or performing real-time model-based tracking. We anticipate that our research projects will yield several benefits, including improved man-machine interaction, better access to image databases, and better methods for learning automatic recognition procedures needed in many practical problems.","title":"CISE Research Instrumentation: Equipment for Real-Time Interaction with Images","awardID":"9617321","effectiveDate":"1997-01-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["334363",34049,"99531"],"PO":["301532"]},"12089":{"abstract":"This research explores a set of techniques for robust logic synthesis tools to support the design automation of high-performance and low-power sequential synchronous circuits. The approach is based on a new concept of logic timing, which combines retiming with logic optimization across register boundaries into a single efficient optimization technique. Also being explored is state encoding for sequential synthesis of circuits specified as finite state machines. The model is based on a controlled reencoding\/retiming of the symbolic representation of the state machine represented initially with one-hot code. This facilitates a reliable estimation of circuit cost, such as delay, power, and sequential testability, as a direct function of the encoding. The proposed work is being carried out in collaboration with Advanced Micro Devices, Inc. of Austin, TX.","title":"New Directions in Sequential Synthesis and Optimization","awardID":"9613864","effectiveDate":"1997-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550433"],"PO":["321058"]},"29239":{"abstract":"","title":"NYI: Improved Circuit Simulation Using Results from Circuit Theory","awardID":"9796102","effectiveDate":"1997-01-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["517175"],"PO":["564898"]},"13410":{"abstract":"The University of La Verne requests support from NSF to connect a branch campus and an off campus center to the Internet. The Woodland Hills Campus is located about 53 miles from the home campus with about 325 full time students, the Orange County Center is about 40 miles from the main campus and has about 415 full time students. These distributed sites need the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of these institutions as well as the community in general. The award provides partial support of the project for two years.","title":"Internet Access for Branch Campus and Centers Phase I (Woodland Hills and Orange County)","awardID":"9617239","effectiveDate":"1997-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["67219"],"PO":["121202"]},"13444":{"abstract":"9617333 McNeill, John A. Worcester Polytechnic Institution CISE Research Instrumentation: Protyping Equipment for Application Specific Architectures This research instrumentation grant enables two distinct research projects: - Integrated 622Mhz Synthesizer for Telecommunications - Methodology Extensions: Low Noise Integrated Circuit Design for Telecommunication Systems The equipment in this proposal is requested to support research into a design methodology for a class of low noise integrated oscillators. Stable, low noise oscillators are required as time and frequency references in applications such as wireless telecommunications, high speed microprocessors, disk drive read channels, and oversampled data conversion. The key insight of the oscillator design methodology is the linkage of system-level performance to fundamental limits imposed by circuit-level considerations such thermal noise. The methodology is being extended in the areas of higher speed (operating frequencies to 2.5GHz), lower power consumption, and more fabrication technologies (CMOS and BiCMOS). Testing of the design methodology is carried out through design, fabrication, and test of integrated circuits that implement a system-level function. The requested test equipment, which enables precise system- and circuit-level measurement in both the time and frequency domains, is essential to verify the theoretical predictions of the methodology. The requested equipment is also part of an ongoing program to establish a design and test environment for education of undergraduate and graduate students in the complete mixed-signal integrated circuit design process. The activities supported by this capability include interdisciplinary collaborative work and involvement of undergraduate students in research.","title":"CISE Research Instrumentation","awardID":"9617333","effectiveDate":"1997-01-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["523630"],"PO":["557609"]},"29306":{"abstract":"","title":"A Scalable Communication Integrated Optical Network (SCION) for Bandwidth Greedy Multimedia Applications","awardID":"9796169","effectiveDate":"1997-01-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["100445"],"PO":["234222"]},"13467":{"abstract":"Adve, Sarita V. Aazhang, Behnaam Rice University CISE Research Instrumentation: Design and Evaluation of Architectures, Programming Environments, and Applications for Shared-Memory Systems This research instrumentation grant facilitates acquiring a shared-memory multiprocessor to support the following research projects: -Design and Evaluation of ILP-Based Shared-Memory Multiprocessors -Parallelizing Compilers for Shared-Memory Systems- Interactive and Adaptive Techniques for Tuning the Performance of Shared-Memory Parallel Programs -Parallel Algorithms for Communications Systems -Signal and Image Processing. The following research is thus enabled:- Architectural techniques to exploit instruction-level-parallelism in shared-memory multiprocessors: Fast simulation methods are the key enabling technology for this research. The proposed multiprocessor enables the development and use of high-performance parallel simulators. - Compilation techniques for High Performance Fortran (HPF): The proposed multiprocessor is a cost-effective platform for HPF compiler development and an important target for evaluating the compiler-generated parallel code. - Runtime techniques to identify and remedy performance bottlenecks in shared-memory programs: The multiprocessor is the desired platform to develop and evaluate the techniques. - Algorithms for wireless and network communication systems: Most such algorithms must meet stringent real-time constraints. The multiprocessor enables the development of parallel algorithms to meet these constraints.- Algorithms for signal and image processing for applications including geophysics, radar, and medical imaging diagnostics: The multiprocessor is needed to test and develop parallel and resource-intensive sequential algorithms on real data sets. Overall, the proposed system enables the above research in three critical ways: enables parallelization of applications that cannot be run sequentially, provides a testbed for compiler and tools research, and provides cost-effective resources for sequential but resource-intensive tasks.","title":"CISE Research Instrumentation: Design and Evaluation of Architectures, Programming Environments, and Applications for Shared-Memory Systems","awardID":"9617383","effectiveDate":"1997-01-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["384485","542042","497441","551063","542046"],"PO":["557609"]},"29307":{"abstract":"","title":"A Generalized Approach to WDM Optical Switched Networks","awardID":"9796170","effectiveDate":"1997-01-15","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["100445"],"PO":["150490"]},"20299":{"abstract":"*** Building better speech recognizers requires augmenting n-gram grammars with sophisticated yet probabilistic linguistic knowledge. This project is building probabilistic models of two important pieces of syntactic\/semantic knowledge: verb-argument constraints and semantic text coherence.(1) Verbs place strong constraints on the syntax and semantics of their arguments. This project is computing probabilities for the different argument structures that can co-occur with different verbs, and using these probabilities to augment standard trigram language models.(2) Texts and discourses tend to be semantically coherent;in particular the words that occur in a text tend to be semantically related to each other. This project is applying a model of word meaning called Latent Semantic Analysis (LSA) to ASR LMs. In LSA, a word-similarity metric is defined by computing a large matrix of word co-occurrence probabilities, which are then smoothed via Singular Value Decomposition, resulting in a generalized measure of semantic word-similarity. Trigram models can then increase the probability that similar words will occur near each other. Building these two stochastic models of linguistic knowledge, besides possible application in speech recognition LMs, word-sense disambiguation, or parsing, also helps bridge the gap between the structural models used in linguistics and the statistical models of speech engineering.***","title":"SGER: Using Text Coherence and Verbal Valence in Long- Distance N-grams","awardID":"9704046","effectiveDate":"1997-01-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["517444"],"PO":["183208"]},"13304":{"abstract":"The North Central Technical College requests support from NSF to connect it's campus to the Internet. The North Central Technical College in Mansfield, OH has approximately 9,200 students and offers 52 degree and certificates in approximately 28 programs of study. The college intends to connect through OARnet, a local Internet service provider. The campus needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Connection to OARnet and Internet - North Central Technical College","awardID":"9616985","effectiveDate":"1997-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33676,33677],"PO":["121202"]},"13216":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the Very High Performance Backbone Network Service (vBNS). Applications include molecular dynamics simulations; computational fluid dynamics; earth systems science; astronomy and astrophysics, including real time control of the Hobby-Eberly telescope in West Texas; surface chemistry with ion beams and lasers; and high performance data sharing. Collaborating institutions include Cornell Theory Center, Pittsburgh Supercomputer Center, National Center for Atmospheric Research and Arecibo Observatory.","title":"High Performance Connections for Research and Education for the Pennsylvania State University","awardID":"9616794","effectiveDate":"1997-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33450,33451,33452,"124234"],"PO":["121202"]},"13513":{"abstract":"96-17530 Singh, Jaswinder Ostriker, Jeremiah P Princeton University CISE Research Instrumentation: Applications and Programming Environments for Cache-Coherent Distributed Memory Machines The instrumentation grant will fund a cache-coherent distributed shared memory multiprocessor. The equipment will be used for several research projects in computer science and engineering, including: Parallel Applications and Programming Environments for Computational Astrophysics. 2. Parallel Applications and Programming Environments for Protein Structure Determination.3. Parallel Workloads for System Evaluation, and Their Implications for Software and Hardware Systems. The first interdisciplinary project is focused on developing parallel algorithms and implementations for computational cosmology on this new, important class of architectures, and on developing integrated programming environments-with real user feedback-to facilitate their use. The environments include programming language extensions, run-time systems, and performance feedback tools. The second project, a collaboration with Professors Altman and Levitt at the Stanford University School of Medicine, has a similar focus in a different application domain. The last project includes broadening the SPLASH benchmark suites, the most widely used suite for such systems, into emerging application areas and server workloads. The method of work will be to develop applications and environments locally on this machine, and perform production simulations and scalibility studies on larger machines at NSF supercomputer centers. Local, dedicated access to the equipment is clearly critical to all aspects of the research.","title":"CISE Research Instrumentation: Three Projects in Applications and Programming Environments for Cache- Coherent Distributed Memory Machines","awardID":"9617530","effectiveDate":"1997-01-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["462746","462748"],"PO":["557609"]},"13449":{"abstract":"9617348 Taylor, Valerie E. Northwestern University CISE Research Instrumentation: Symmetric Multiprocessor for Research on Parallel Architecture, Compiler, Applications and On-demand Network-computing This research instrumentation grant enables collaboration between two universities in four areas of research:-Hierarchical Processor-and-Memory Architecture for- High Performance Computing - An Advanced Program Analysis and Compilation Infrastructure - Characterization of Large (Petaflop) Computational Applications - Metaprogramming and On-demand Metacomputing for Network-based Computational Hubs The focus of this project is on advancing the state of the art in high-performance computing on the four fronts:- the design of high-performance computers capable of 100 trillion operations per second (i.e. 100 TOPS),- advanced tools for analysis and compilation of programs for execution on machines with multiple processors,- the characterization of applications that require computation rates of 100-1000 TOPS and- the design of a network-based software infrastructure that allows the use of linked computers and linked programs (i.e.,metacomputers and metaprograms) through conventional network browsers. The main ideas currently under investigation are being validated through extensive computational experiments and computer simulations. The equipment acquired with the funds provided by this grant provides the computational speed, memory, storage and communication demands of the experimental component of this project which would otherwise not be possible or take unacceptably long times to perform. The experimentation made possible by the availability of a symmetric multiprocessor is essential to the validation of research ideas and results pursued in this project. This work is being carried collaboratively by researchers at Northwestern University and Purdue University.","title":"CISE Research Instrumentation: Symmetric Multiprocessor for Research on Parallel Architecture, Compiler, Applications and On-demand Network-Computing Research","awardID":"9617348","effectiveDate":"1997-01-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["541641"],"PO":["557609"]},"13515":{"abstract":"9617541 Farrell, Paul A Ruttan, Arden G Kent State University CISE Research Instrumentation: A High Performance Network for Distributed Computation and Visualization The instrumentation grant enables the purchase of a high bandwidth, low latency Fibre Channel network connecting high performance to be used in the following research projects: - Path Following, Visualization and Steering of Liquid Crystal Calculations - Distributed Operating Systems Research - Large Scalable Parallel Quantum Monte Carlo The equipment will support several research projects, involving work in distributed large scale scientific computation, computational steering and visualization, together with work on distributed operating systems. In addition to the research projects themselves, it is planned to compare the effectiveness of the algorithms and methods on Fibre Channel to that on an ATM network. The project on path following, visualization and steering of liquid crystal calculations involves the development of efficient algorithms to solve large scale liquid crystal problems in a distributed network environment and the tools to visualize and steer the resulting calculations. The project on large scalable parallel quantum Monte Carlo methods involves investigation of communication and load balancing in highly scalable implementations of electronic structure calculations. The algorithms and performance will be compared on high-bandwidth networks and parallel machines. The project on distributed operating systems is designed to enable the effective use of ensembles of workstations. This involves microkernel-based operating systems for networks of heterogeneous machines and heterogeneous distributed scheduling systems for WANs and LANs.","title":"CISE Research Instrumentation: A High-Performance Network for Distributed Computation and Visualization","awardID":"9617541","effectiveDate":"1997-01-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["375530","187937","375531","530675"],"PO":["301532"]},"20457":{"abstract":"*** 9704451 The increasing importance of an annual meeting of researchers funded by the Interactive Systems Program of the National Science Foundation is underscored by a national agenda that views improved interfaces as vital to our Nation's economic competitiveness, that proposes universal access to the NII by every citizen, and that hopes to place computers in every classroom with network access. Attendees of the First Grantees Workshop (in November 1995) reported uniformly positive experiences. Researchers were delighted to meet and interact with colleagues working in related fields, and to learn first- hand about the research and challenges in each others' areas. The proposed venue for the Second Grantee Workshop is in Oregon from August 16th through August 18th, dates which have been found to be in minimal conflict with other meetings and which allow for economical pricing of rooms. The proposed workshop agenda will be developed by a steering committee, with feedback from participants of the last Grantee's Workshop. The paramount goals will be to foster fruitful exchange of ideas and to stimulate interaction among colleagues. The workshop will also produce an HTML document, modeled on the previous effort, which summarizes the different projects supported by the Interactive Systems Program.***","title":"The Second Workshop in Interactive Systems","awardID":"9704451","effectiveDate":"1997-01-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551122"],"PO":["183208"]},"20418":{"abstract":"*** This project addresses the integration of speech recognition and natural language processing components in a speech understanding system. Most current speech recognizers use word-level hidden Markov models (HMMs)in conjunction with n-gram language models. Additional flexibility can be achieved by using phones as the basic recognition unit. This research proposes a new technique called a SOHMM Stochastic Observation Hidden Markov Model - for recognizing words from phone candidates. Most current spoken language systems use probabilistic language models to model syntactic and semantic patterns. This project will integrate a SOHMM- based speech recognizer with a Constraint-Dependency Grammar (CDG) parser, which supports the use of lexical, prosodic, syntactic, and semantic knowledge sources in a uniform modular framework, as well as the use of domain- specific constraints. This work will refine the model for the SOHMM-CDG spoken language processing system and address the problem of building and pruning word graphs, which act as the interface between the two components. An experiment will be conducted to demonstrate the effectiveness of the integrated system for recognizing and parsing utterances in the TIMIT and Resource Management corpora. Sentence accuracy should be significantly improved over what is possible using only statistical language models, especially when domain-specific constraints are used ***.","title":"SGER: Experiments on Integrating Speech Recognition and Natural Language Processing","awardID":"9704358","effectiveDate":"1997-01-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["526006","246649"],"PO":["183208"]},"12927":{"abstract":"","title":"Graduate Research Fellowship Program","awardID":"9616157","effectiveDate":"1997-01-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7175","name":"MINORITY GRADUATE FELLOWSHIPS"}}],"PIcoPI":["33380"],"PO":["89977"]},"11917":{"abstract":"This project is exploring the vector implementation of speech algorithms on the torrent processor, which was developed under previous NSF support. Torrent is specialized for the low-precision digital signal processing that arises in speech recognition; it combines multiple fixed-point datapaths, a high bandwidth memory system, and a high-speed RISC general-purpose controller. Algorithms for the computationally intensive tasks of speech recognition, including acoustic probability estimation, feature extraction, lexical search, and evaluation of grammatical probabilities, are being vectorized and implemented on Torrent processor. The system will be demonstrated using a 2000-word natural speech recognition task that will run using a free-standing microphone in a noisy environment.","title":"Robust Speech Recognition Using Vector Computing","awardID":"9612778","effectiveDate":"1997-01-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["550775"],"PO":["549626"]}}