{"196493":{"abstract":"This NSF Cyber-Physical Systems (CPS) Frontiers project \"Foundations Of Resilient CybEr-physical Systems (FORCES)\" focuses on the resilient design of large-scale networked CPS systems that directly interface with humans. FORCES aims to provide comprehensive tools that allow the CPS designers and operators to combine resilient control (RC) algorithms with economic incentive (EI) schemes.<br\/><br\/>Scientific Contributions<br\/>The project is developing RC tools to withstand a wide-range of attacks and faults; learning and control algorithms which integrate human actions with spatio-temporal and hybrid dynamics of networked CPS systems; and model-based design to assure semantically consistent representations across all branches of the project. Operations of networked CPS systems naturally depend on the systemic social institutions and the individual deployment choices of the humans who use and operate them. The presence of incomplete and asymmetric information among these actors leads to a gap between the individually and socially optimal equilibrium resiliency levels. The project is developing EI schemes to reduce this gap. The core contributions of the FORCES team, which includes experts in control systems, game theory, and mechanism design, are the foundations for the co-design of RC and EI schemes and technological tools for implementing them.<br\/><br\/>Expected Impacts<br\/>Resilient CPS infrastructure is a critical National Asset. FORCES is contributing to the development of new Science of CPS by being the first project that integrates networked control with game theoretic tools and the economic incentives of human decision makers for resilient CPS design and operation. The FORCES integrated co-design philosophy is being validated on two CPS domains: electric power distribution and consumption, and transportation networks. These design prototypes are being tested in real world scenarios. The team's research efforts are being complemented by educational offerings on resilient CPS targeted to a large and diverse audience.","title":"CPS: Frontiers: Collaborative Research: Foundations of Resilient CybEr-Physical Systems (FORCES)","awardID":"1239166","effectiveDate":"2013-04-15","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[526900,526901,526902,526903],"PO":["565274"]},"201025":{"abstract":"The Advances of MAchine Learning in THEory & Applications (AMALTHEA) REU Site aims to provide top quality educational experiences to a diverse community of undergraduate students through research participation in the area of Machine Learning (ML). The relevance and importance of ML is not limited to specialized technological innovations, as it was in the past. Nowadays, it also increasingly influences everyday life through its contributions to applications such as voice\/face recognition, credit fraud detection, intelligent recommendation systems and many others. Furthermore, ML is inherently multi-disciplinary as it draws from advances in disciplines such as computing, statistics, mathematics, physics, biology and engineering, to a name a few major ones. The project's thrust area is the theory of ML and how it can be integrated and applied to important real-life problems, thus exposing participants to both theory and applications. AMALTHEA involves 10 undergraduate students per year from a broad spectrum of disciplines for 10 weeks in the summer. These participants perform supervised research, whose results are going to impact the field of ML itself, as well as how ML is applied in other scientific disciplines. For this purpose, the faculty mentors have ample expertise in ML and past experience of effectively engaging undergraduate students into state-of-the-art research.<br\/><br\/>Over its lifespan, the project will directly impact a diverse group of 30 motivated students, the majority of which may not have access to such research participation opportunities otherwise. The participants will be exposed to cutting-edge ML research, as well as professional development activities, such as technical seminars and career-related workshops. Furthermore, AMALTHEA aims to involve overall 10 graduate students in undergraduate teaching and mentoring activities during the summer experiences. Finally, the project's research and education endeavors are supported by its advisory board, which consists of seasoned educators, ML industry practitioners and researchers. Research results will be published in interdisciplinary conferences, and, potentially, technical journals.<br\/><br\/>The REU Site web site (http:\/\/www.amalthea-reu.org) provides additional information for students as well as educators and researchers in machine learning.","title":"REU Site: Advances of Machine Learning in Theory and Applications (AMALTHEA)","awardID":"1263011","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[538958,538959],"PO":["563751"]},"202247":{"abstract":"Human society is faced with an increasing number of problems including<br\/>stubborn diseases and international security\/climate threats. The<br\/>computer simulations and advanced data management methods necessary to<br\/>solving these societal problems can only be realized through increased<br\/>use of parallel computing at all system scales, including desktops,<br\/>servers and the cloud. Efficient large-scale parallel computing<br\/>however requires advanced parallel programming methods. Such methods,<br\/>unfortunately, have a greater proclivity for software bugs that<br\/>increase cost through lost cycles on super-computers and these same<br\/>bugs undermine confidence in simulation results. This research<br\/>addresses the challenge of developing parallel computing software by<br\/>creating new scalable methods to support advanced parallel programming<br\/>models that provide rigorous guarantees on program correctness. The<br\/>societal impacts of this work stem from increasing reliability of<br\/>software powering the national infrastructure, advanced educational<br\/>methods to train future generations, and pedagogical material in the<br\/>form of course notes and software for broad dissemination. It also<br\/>helps maintain the United States in a leadership situation with<br\/>respect to the available talent pool in this area.<br\/><br\/>Providing rigorous guarantees on correctness of existing parallel<br\/>computing software requires that two classes of methods be developed,<br\/>evaluated, and taught widely: scalable code-level (static) checking<br\/>methods, and downstream detailed (dynamic) checking methods. This<br\/>project develops these novel and much-needed correctness checking<br\/>methods around the Habanero Java programming and compilation<br\/>system. The research is to augment the system with correctness<br\/>obligations emitted during compilation and checked at all later stages<br\/>of translation and deployment. A key highlight of the project's<br\/>approach is that it allows some of the correctness obligations to be<br\/>checked statically in the context of safe subsets of Habanero Java.<br\/>Obligations that are not able to be statically checked, especially for<br\/>larger subsets of the Habanero language, are marked for checking<br\/>dynamically through novel active-testing methods. An Operational<br\/>Semantics written in the Coq notation lends cohesion to the work by<br\/>ensuring that the division of correctness checking between static and<br\/>dynamic techniques is sound. In summary, this research helps advance<br\/>the science of parallel programming in terms of rigorous correctness<br\/>checking methods, while at the same time contributing to the broad<br\/>practice of programming at all scales from desktop to cloud<br\/>computing and high-end scientific simulations.","title":"CCF: SHF: Medium: Collaborative Research: A Static and Dynamic Verification Framework for Parallel Programming","awardID":"1302524","effectiveDate":"2013-04-15","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[542012],"PO":["565264"]},"206988":{"abstract":"Brookdale Community College (BCC) is designing, implementing, and evaluating an innovative pathway from cyber talent to cyber workforce. It includes a unique public-private partnership that leverages the agility of community colleges and the course material of the SANS Institute to develop a scalable, competition-driven, hands-on education model that has a potential to help with the nation's critical shortage of cybersecurity workforce. The project designs metrics to identify individuals with the appropriate aptitude and expose them to vital, in-depth, hands-on learning model focusing on defending computer systems and networks. The project utilizes a multiphase competition-based model and, at each stage, students compete to demonstrate their competence and to advance to the next phase of the program. Students who successfully complete all components of the program and demonstrate their mastery have the opportunity to apply for residency positions where they can hone their skills working with practicing security professionals on real-world projects. The proposed competition and residency based model for developing the cybersecurity technical talent has a real potential for dissemination and implementation in a large number of the 1,200 community colleges nationwide.","title":"Building a Pipeline of Cyber Warriors Through Education and Competition Offered Through Community Colleges","awardID":"1331170","effectiveDate":"2013-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1668","name":"FED CYBER SERV: SCHLAR FOR SER"}}],"PIcoPI":[554189,554190,554191],"PO":["564264"]},"199332":{"abstract":"A rapid acceleration in both volume and complexity of public domain and scientific data presents new and exciting challenges. This project aims to develop a theoretical framework for structured learning of distribution spaces and study tools for identifying and utilizing probabilistic structure in high-dimensional large volume data. This project lies within the intersection of multiple disciplines: signal processing, pattern recognition, machine learning, probability and statistics, and thus will foster collaboration among these disciplines. The application of the proposed framework to data-driven medical diagnosis and ecological research will further the impact of this project beyond the realm of computational data analysis. Additionally, this research sets a goal to enrich the quality of education for both undergraduate and graduate students, through exciting integration of research, application, and new curriculum.<br\/><br\/>The research framework consists of geometrically-constrained probabilistic modeling and efficient optimization approaches for inference of multiple instance data. The project sets forth the following tasks i) confidence-constrained joint estimation of multiple discrete probability models, ii) joint learning of multiple distribution based geometrically-constrained maximum-entropy models, and iii) direct application of the developed framework to the analysis of clinical flow cytometry data for medical diagnosis and in-situ bioacoustics data for ecological research.","title":"CAREER: Structured Learning of Distribution Spaces","awardID":"1254218","effectiveDate":"2013-04-01","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[534580],"PO":["564898"]},"199585":{"abstract":"This project seeks to investigate the effectiveness of adaptive power conditioning in averting failures and enhancing reliability of mixed-signal multi-core Systems-on-Chips (SoCs), while retaining power efficiency. The investigation aims to leverage the increasing integration of non-intrusive sensors for monitoring various operational parameters and cost-effective tuning knobs for calibrating circuit performance through online power condition adjustment. The project aims to develop a cross-layer intelligent system, which will continuously adjust the flow of the entire power distribution network based on the feedback provided by the sensors. Ultimately, the aspiration of this project is to demonstrate that a holistic approach to adaptive power conditioning can (i) ensure operational robustness while minimizing power consumption, and (ii) enhance reliability and prolong life expectancy of integrated circuits. The intellectual contribution of this work will be in the development of a practical, yet theoretically rooted and analytically supported intelligent system for capturing correlations between circuit performance, sensor readings, and calibration knob positions, and utilizing them to improve robustness and reliability. <br\/><br\/>The proposed research is complemented by educational and outreach activities demonstrating the principle investigators' (PIs') commitment to an integrated role as researchers, educators, and active community members. A new graduate-level course will be developed and offered by the PIs, who have proven track records of involving the students of various levels in their research activities, including women and other under-represented groups. Several opportunities for participation in interdisciplinary research spanning Electrical Engineering, Computer Science, and Applied Mathematics as well as internships with industrial partners are expected.","title":"Cross-Layer Intelligent System-Based Adaptive Power Conditioning for Robust and Reliable Mixed-Signal Multi-Core SoCs","awardID":"1255754","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["550120",535116],"PO":["562984"]},"199068":{"abstract":"Hypothesis testing on neuroimaging data traditionally has made use of classical statistical tests (on uni-variate response variables). This makes sub-optimal use of the structure of images, particularly problematic if the two groups being tested have weak differences to begin with. Failure to detect statistically significant differences may imply failure of the experiment itself. Acquiring more images is expensive but also occasionally infeasible. This project develops technologies to address these problems (particularly those dealing with differential analysis of brain images) via the lens of computer vision and machine learning. The algorithmic component of this project is (1) a suite of convex optimization based multi-modal learning schemes to seamlessly leverage a spectrum of brain imaging data, (2) new multi-resolution representations for inference with surface\/network based signals (data derived from structural\/functional brain images), and (3) using these mechanisms for boosting statistical power even in experiments with small sample sizes.<br\/><br\/>The project has broad scientific impact. Extending the operating range of statistical image analysis methods for neuroimaging will foster a new inter-disciplinary area at the interface of computer vision, biostatistics, and machine learning, which is highly intellectually stimulating. The research team brings real neuroimaging research data for undergraduate\/graduate students to explore and study. The project goals also include training and mentoring of students, increased involvement of under-represented groups, seminars, and an extensive set of outreach activities. In addition, the resultant software tools drive the analysis of neuroscience studies, which has clear broad societal impact.","title":"CAREER: Efficient Statistical Inference using Neuroimaging data for Sample Enrichment and Optimizing Power","awardID":"1252725","effectiveDate":"2013-04-15","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563992"],"PO":["564316"]},"199586":{"abstract":"As transistors shrink in size, they enable more functionality on the same area of silicon. However, small transistors are also more susceptible to intermittent errors due to alpha particles striking the silicon. Engineering systems to tolerate such errors is a problem that will become increasingly important over time. Evaluating fault tolerant designs has traditionally been almost impossible because (i) faults occur very infrequently, (ii) they require highly detailed (and thus time-consuming) simulations to determine whether they have any real effect, and (iii) millions or even billions of such simulations need to be performed to determine whether the design can actually tolerate particle strikes with different charateristics. <br\/><br\/>This project addresses the problem through a set of interlocking simulators, each at a different level of accuracy and simulation speed. The initial particle strike is modeled in extremely high detail for a short time until it can be modeled by a faster simulator with less detail, and so on. How to intelligently decide when the particle strikes, what it strikes, and when to transition between simulators are some of the core intellectual components of this project. Such a simulator could help develop techniques to build more efficient and effective reliable systems than are possible today.","title":"A Hardware-Accelerated Transistor-to-Application SEU Simulation Platform","awardID":"1255757","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535118,535119],"PO":["562984"]},"199289":{"abstract":"Intellectual Merit:<br\/>Recent developments in nanostructures manufacturing, sensing and wireless networking, will soon enable us to deploy Flow-based Cyber-Physical Systems equipped with sensing and actuation capabilities for a broad range of applications. Some of these applications will be safety critical, including water distribution monitoring (i.e., critical national infrastructure systems particularly vulnerable to a variety of attacks, including contamination with deadly agents) and interventional medicine (i.e., a medical branch that makes use of tiny devices introduced in a living body through small incisions, to detect and treat diseases). <br\/><br\/>The goal of this project is to advance our fundamental understanding, through a robust mathematical framework, of emerging field of Flow-based Cyber-Physical System. The project develops new architectures, models, metrics, algorithms and protocols for optimal sensing, communication and actuation in Flow-based Cyber-Physical System deployed on-demand (i.e., reactively, when sensing and actuation is needed) or proactively. <br\/><br\/>Flow-based Cyber Physical Systems consist of mobile sensor nodes and static nodes, aware of their location. For stringent requirements (e.g., form factor, cost, energy budget) nodes may or may not possess node-to-node communication capabilities. Due to the lack of localization infrastructure, mobile sensor nodes infer their location only by proximity to static nodes. Sensor nodes are moved by the flow in the network, detect events of interest and proximity to static nodes, communicate and actuate. This research will enable, for example, water distribution monitoring systems to accurately and timely detect events of interest in the infrastructure and to react to these events. It may enable doctors to detect diseases and deliver medication with microscopic precision.<br\/><br\/>Broader Impacts: <br\/>Ultimately, the outcomes of this research will have impact on CPS that operate in critical modes and environments and control critical infrastructures and medical applications. The results from this research may also foster new research directions in CPS applications. <br\/><br\/>The PI will integrate the research results in newly approved courses on CPS at Texas A&M and disseminate course materials online through the project website and Rice University Connections Consortium. <br\/><br\/>This project will also offer research opportunities to undergraduate students, underrepresented groups, and high school students participating in the Texas Science Olympiad and National Science Olympiad.","title":"CAREER: Foundations for Flow-based Cyber-Physical Systems","awardID":"1253968","effectiveDate":"2013-04-01","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["561708"],"PO":["551712"]},"201126":{"abstract":"The research objectives are to advance the state of the art in methods of wireless health. Projects span the range of end-to-end systems including robust inference using body networks of sensors, real-time and energy efficient analysis of sensor data using smartphones, development of effective interfaces and other feedback mechanisms, and construction of readily searchable large-scale databases of time series data. Collectively, the projects enable quantitative determination of patient state and compliance with therapy, and thus facilitate large-scale clinical studies that evaluate the effectiveness of particular therapies. Projects related to inference of human motion and provision of appropriate feedback also have application to sports training and the learning of other physical skills.<br\/><br\/>The broader impacts include training of undergraduate researchers by graduate mentors and their inspiration to pursue graduate studies. The summer research is designed to develop materials that refresh capstone design courses and produce hands-on activities that are added to lecture courses. The research of the graduate mentors, the summer research, and the capstone design activities are all closely related in a cycle that advances research and training in each phase.<br\/><br\/>Additional information is provided at the project web site (http:\/\/www.wirelesshealth.ucla.edu\/).","title":"REU Site: Wireless Health Research and Education","awardID":"1263390","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[539241,539242],"PO":["563751"]},"196463":{"abstract":"This CPS Frontiers project addresses highly dynamic Cyber-Physical Systems (CPSs), understood as systems where a computing delay of a few milliseconds or an incorrectly computed response to a disturbance can lead to catastrophic consequences. Such is the case of cars losing traction when cornering at high speed, unmanned air vehicles performing critical maneuvers such as landing, or disaster and rescue response bipedal robots rushing through the rubble to collect information or save human lives. The preceding examples currently share a common element: the design of their control software is made possible by extensive experience, laborious testing and fine tuning of parameters, and yet, the resulting closed-loop system has no formal guarantees of meeting specifications.<br\/><br\/>The vision of the project is to provide a methodology that allows for complex and dynamic CPSs to meet real-world requirements in an efficient and robust way through the formal synthesis of control software. The research is developing a formal framework for correct-by-construction control software synthesis for highly dynamic CPSs with broad applications to automotive safety systems, prostheses, exoskeletons, aerospace systems, manufacturing, and legged robotics. <br\/><br\/>The design methodology developed here will improve the competitiveness of segments of industry that require a tight integration between hardware and highly advanced control software such as: automotive (dynamic stability and control), aerospace (UAVs), medical (prosthetics, orthotics, and exoskeleton design) and robotics (legged locomotion). To enhance the impact of these efforts, the PIs are developing interdisciplinary teaching materials to be made freely available and disseminating their work to a broad audience.","title":"CPS: Frontier: Collaborative Research: Correct-by-Design Control Software Synthesis for Highly Dynamic Systems","awardID":"1239037","effectiveDate":"2013-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["560444",526827],"PO":["561889"]},"196474":{"abstract":"This CPS Frontiers project addresses highly dynamic Cyber-Physical Systems (CPSs), understood as systems where a computing delay of a few milliseconds or an incorrectly computed response to a disturbance can lead to catastrophic consequences. Such is the case of cars losing traction when cornering at high speed, unmanned air vehicles performing critical maneuvers such as landing, or disaster and rescue response bipedal robots rushing through the rubble to collect information or save human lives. The preceding examples currently share a common element: the design of their control software is made possible by extensive experience, laborious testing and fine tuning of parameters, and yet, the resulting closed-loop system has no formal guarantees of meeting specifications.<br\/><br\/>The vision of the project is to provide a methodology that allows for complex and dynamic CPSs to meet real-world requirements in an efficient and robust way through the formal synthesis of control software. The research is developing a formal framework for correct-by-construction control software synthesis for highly dynamic CPSs with broad applications to automotive safety systems, prostheses, exoskeletons, aerospace systems, manufacturing, and legged robotics. <br\/><br\/>The design methodology developed here will improve the competitiveness of segments of industry that require a tight integration between hardware and highly advanced control software such as: automotive (dynamic stability and control), aerospace (UAVs), medical (prosthetics, orthotics, and exoskeleton design) and robotics (legged locomotion). To enhance the impact of these efforts, the PIs are developing interdisciplinary teaching materials to be made freely available and disseminating their work to a broad audience.","title":"CPS: Frontier: Collaborative Research: Correct-by-Design Control Software Synthesis for Highly Dynamic Systems","awardID":"1239085","effectiveDate":"2013-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[526859],"PO":["561889"]},"199620":{"abstract":"Reliability has become a significant challenge for the current multi-core and emerging 3D microprocessor design. Many long-term failure mechanisms such as electromigration, stress migration, and thermal-cycling are very sensitive to temperature or to temperature changes. As a result, there is an urgent need for reliability awareness and optimization at the micro-architectural design stage. Since temperature has exponential impacts on many failure issues, it is crucial to have accurate and fast thermal estimation for reliability analysis and even optimization at the architecture and package levels. In this project, the principle investigator (PI) first plans to develop architecture-level full-chip reliability modeling and analysis techniques considering new structures of integration techniques and dominant hard failure mechanisms. Then the PI will develop reliability-aware dynamic thermal management techniques for multi-core and 3D stacking microprocessors. Finally, the PI will develop full-chip thermal estimation and prediction techniques considering realistic conditions such as limited physical thermal sensors and presence of errors in thermal and power models, for run time system-level reliability analysis and optimization. <br\/><br\/>The outcome of this research will add significantly to the core knowledge of system-level reliability optimization techniques, which will enable more efficient thermal optimization and design of multi-core and 3D microprocessors. The interdisciplinary nature of the project will enable undergraduate and graduate students to acquire unique skills valuable to their future endeavors in STEM fields. This grant will enable the PI to hire more female and underrepresented minority students to further contribute to diversity in the science and technology workforce.","title":"Thermal-Sensitive System-Level Reliability Analysis and Management for Multi-Core and 3D Microprocessors","awardID":"1255899","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535204],"PO":["562984"]},"199631":{"abstract":"Near-threshold voltage (NTV) operation has emerged as a promising strategy to improve energy-efficiency by reducing the supply voltage while exploiting parallelism to compensate for frequency loss. NTV processors combined with \"Turbo mode\" can also offer peak performance, thereby making them suitable for a range of dynamic workload behaviors. Despite the promise, applications of these systems have remained largely elusive due to many issues. This research, involving VLSI circuits, computer architecture, and software systems, for the first time, addresses the reliability challenges of NTV\/Turbo mode systems in the context of device aging and variability. Researchers will integrate distributed system monitors and controls to enable power-efficient fault resiliency for on-chip NTV\/Turbo-mode cores. The work will lay the foundations for a feedback-directed optimization system that tunes the hardware's execution to meet application requirements by balancing performance, reliability and energy consumption.<br\/><br\/><br\/>Our society's productivity and advancements are intimately tied to the predictable and sustainable operation of the world's computing infrastructure. Unfortunately, this trend is beginning to falter due to increasing computer energy consumption. Aggressive energy reductions are tightly coupled with destabilizing computer system performance and longevity. The research will uncover observations that are necessary to overcome the problem in near-threshold voltage systems that hold great promise for further advanced computing. Using an approach spanning both the hardware and software layers, researchers will investigate and develop novel techniques to overcome the energy problem. Such a holistic and joint effort across the layers is the key for ensuring our society's long-term success based on advanced computing.","title":"Collaborative Research: Feedback-Driven Resiliency for Near-Threshold Systems","awardID":"1255937","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["541006"],"PO":["562984"]},"199323":{"abstract":"Embedded systems currently rely on local and often insecure state retention for process control and subsequent forensic analysis. As critical embedded control systems (e.g., smart grids, SCADA) generate increasing amounts of data and become ever more connected to other systems, secure retention and management of that data is required. Attacks such as Stuxnet show that SCADA and other systems comprising critical infrastructure are vulnerable to the compromise of controllers and sensing devices, as well as falsification of data to circumvent anomaly detection mechanisms. <br\/><br\/>This project develops techniques and architectures for securely storing and monitoring embedded system state in critical infrastructure. We are examining vulnerabilities relating to generating and storing data in critical embedded systems, which are often resource-constrained environments. We propose the design and deployment of 'autonomously secure storage devices' that act as resilient storage for embedded devices. We are designing logging, audit, and management architectures for resiliently storing system data and provenance in the face of malicious and compromised devices. Additionally, we explore how this data may be disseminated to other systems and to environments such as the cloud and aim to protect data through privacy-preserving communication and querying interfaces, and attempt to make data-driven inferences about system operation to detect anomalous behavior. Through these active protections to generated data and metadata, we aim to provide a new baseline for producing and storing data generated within critical infrastructures.","title":"CAREER: Securing Critical Infrastructure with Autonomously Secure Storage","awardID":"1254198","effectiveDate":"2013-04-01","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["553388"],"PO":["565327"]},"200995":{"abstract":"The Intelligent and Interactive Media (IIM) REU Site at North Carolina State University immerses a diverse group of undergraduates in a vibrant research community working on cutting-edge interactive and intelligent media including serious games and game technologies, interfaces, visual experiences, and natural language dialogue. The IIM REU at NC State recruits broadly, but focuses on providing opportunities for students from underrepresented groups, and from colleges and universities with limited research opportunities, reaching students not typically exposed to research. The IIM REU engages faculty and graduate student mentors with undergraduates to create a supportive culture of collaboration while promoting individual contributions to research through just-in-time training for both mentors and students throughout the summer. REU students present their work at an undergraduate research competition, develop videos to convey their research to K-12 students, and are encouraged to submit their technical papers as peer reviewed publications.<br\/><br\/>The Site's explicit training in research skills and mentoring to support students with diverse backgrounds through the Affinity Research Groups model, and its engagement and integration with the STARS Alliance (http:\/\/starsalliance.org) to recruit students from underrepresented groups, creates great potential to inspire students to enroll in computing graduate programs. The project's focus on relevant cutting edge interactive technologies is a proven focus that can improve retention for minorities and women. REU students become part of the STARS Computing Corps, a computing leadership consortium dedicated to broadening participation in computing, providing REU students access to excellent mentoring and networking resources through STARS while also giving them the chance to extend their REU experiences into the academic year.<br\/><br\/>The Intelligent and Interactive Media REU website (http:\/\/research.csc.ncsu.edu\/iim-reu\/) provides additional information to students, educators and researchers.","title":"REU Site: Interactive and Intelligent Media","awardID":"1262899","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["561854"],"PO":["563751"]},"199599":{"abstract":"Despite the best efforts of the semiconductor industry, integrated electronic systems are not inherently robust because they are \"born\" (manufactured) with a unique \"personality\" that stems from the industry's inability to precisely fabricate their underlying circuits, and to write software that controls the resulting uncertainty. An integrated system personality is further shaped by its environment (e.g., temperature, noise, etc.) and usage (i.e., the frequency and type of applications executed), and since both can fluctuate over time, so can the system personality. Systems also \"grow old\" and degrade predictably due to various wear-out mechanisms but also unexpectedly due to early-life failure sources. These \"nature and nurture\" influences make it extremely difficult to design a robust integrated system that will operate optimally for all possible personalities. This research achieves integrated-system robustness by judiciously testing and diagnosing the system for any faults through the development of a generalized, scalable on-chip circuitry that tests and diagnoses any system without significant power and performance penalty. <br\/><br\/>Success of this research effort will help ensure that integrated-system manufacturers can produce robust systems, in the most cost-effective manner, despite the large number and variety of failure sources that negatively impact system reliability. Also, our need for continued development of STEM (science, technology, engineering and mathematics) education in under-represented groups will be aided by this effort via involvement of a diverse group of graduate and undergraduate researchers.","title":"On-Chip Diagnosis for Aging and Early-Life Failure Detection","awardID":"1255804","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["548338"],"PO":["562984"]},"202239":{"abstract":"Human society is faced with an increasing number of problems including<br\/>stubborn diseases and international security\/climate threats. The<br\/>computer simulations and advanced data management methods necessary to<br\/>solving these societal problems can only be realized through increased<br\/>use of parallel computing at all system scales, including desktops,<br\/>servers and the cloud. Efficient large-scale parallel computing<br\/>however requires advanced parallel programming methods. Such methods,<br\/>unfortunately, have a greater proclivity for software bugs that<br\/>increase cost through lost cycles on super-computers and these same<br\/>bugs undermine confidence in simulation results. This research<br\/>addresses the challenge of developing parallel computing software by<br\/>creating new scalable methods to support advanced parallel programming<br\/>models that provide rigorous guarantees on program correctness. The<br\/>societal impacts of this work stem from increasing reliability of<br\/>software powering the national infrastructure, advanced educational<br\/>methods to train future generations, and pedagogical material in the<br\/>form of course notes and software for broad dissemination. It also<br\/>helps maintain the United States in a leadership situation with<br\/>respect to the available talent pool in this area.<br\/><br\/>Providing rigorous guarantees on correctness of existing parallel<br\/>computing software requires that two classes of methods be developed,<br\/>evaluated, and taught widely: scalable code-level (static) checking<br\/>methods, and downstream detailed (dynamic) checking methods. This<br\/>project develops these novel and much-needed correctness checking<br\/>methods around the Habanero Java programming and compilation<br\/>system. The research is to augment the system with correctness<br\/>obligations emitted during compilation and checked at all later stages<br\/>of translation and deployment. A key highlight of the project's<br\/>approach is that it allows some of the correctness obligations to be<br\/>checked statically in the context of safe subsets of Habanero Java.<br\/>Obligations that are not able to be statically checked, especially for<br\/>larger subsets of the Habanero language, are marked for checking<br\/>dynamically through novel active-testing methods. An Operational<br\/>Semantics written in the Coq notation lends cohesion to the work by<br\/>ensuring that the division of correctness checking between static and<br\/>dynamic techniques is sound. In summary, this research helps advance<br\/>the science of parallel programming in terms of rigorous correctness<br\/>checking methods, while at the same time contributing to the broad<br\/>practice of programming at all scales from desktop to cloud<br\/>computing and high-end scientific simulations.","title":"CCF: SHF: Medium: Collaborative Research: A Static and Dynamic Verification Framework for Parallel Programming","awardID":"1302449","effectiveDate":"2013-04-15","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["561775"],"PO":["565264"]},"199611":{"abstract":"Designing robust and energy-efficient large-scale systems-on-chips (SOCs) with high design productivity is a challenge of great interest. However, lack of coordination among different design layers has caused designers to make worst-case assumptions at individual design layers, leading to substantially suboptimal designs with poor reliability\/energy\/performance co-optimization or tradeoffs. This project is the first major effort dedicated toward a unified failure-resistant system from high-level synthesis to physical design with tight integration. It will build reliability-centric physical-aware high-level synthesis and high-level-guided physical design to bridge the gap between these two distant layers. A novel cross-layer engineering change order (ECO) framework will also be developed to couple high-level ECO with stable physical-level ECO. New tools and methodologies will be studied and provided to the system and physical design community targeting reliability while increasing overall design productivity and quality. <br\/><br\/>Electronics have permeated modern society, which increasingly depends on reliable operations of these electronic systems. However, device-level scaling is heading in the opposite direction from system reliability. This project will transform existing SOC design methodologies through cross-layer integration. Research from this effort will be broadly disseminated through publications and presentations, active interaction with industrial collaborators, as well as infusion of new course material into classrooms and instructional laboratories. The principal investigators will continue their efforts in recruiting women and other underrepresented minorities into their research programs. They have previously reached out to K-12 students and will continue to do so in order to attract the best of them into the engineering profession.","title":"Collaborative Research: From High-level Synthesis to Layout: a Cross-layer Methodology for Large-scale Reliable IC Design","awardID":"1255846","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535183],"PO":["562984"]},"199633":{"abstract":"The drive for increased performance and functionality has pushed computer chips to their physical limits of power\/energy and reliability. Future computing systems are likely to suffer from high fault rates, undermining their programmability and usability. This research project will leverage existing techniques and invent new techniques to detect, isolate, and recover from faults and to ensure overall system resilience, with minimal impact on performance. The project taps into the rich body of past work on formal methods, which have been successful in finding logical errors in systems. Newly developed formal methods will focus on resilience enhancement. The project will also explore the inherent trade-offs between performance, power, and resilience. The project will develop an extensible platform for empirical evaluation of resilience methods. This platform will be comprised of programmable chips and accompanying software components.<br\/><br\/>This project will foster the development of new system design methods which take reliability into account. It will help fill a serious void in readily usable infrastructures for resiliency studies in the realm of parallel systems by developing and releasing tools for evaluating the methods. The project will also develop and release rigorously specified resilience-aware system interfaces. The project emphasizes student training, including student recruitment and introduction of new classes that are integrated with resilience research.","title":"Collaborative Research: Localized, Layered Formal Hardware\/Software Resilience Methods","awardID":"1255949","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535236],"PO":["562984"]},"199578":{"abstract":"The objective of this research is to create a new failure-resistant architecture for high-speed digital links to enable the next generation of high-performance communication and computing systems. The failure-resistant architecture is based on maximum a posteriori (MAP) detection and overcomes not only challenging channel impairments, but also deterministic impairments incurred in the interface and timing circuitry. The system-level protection given by MAP detection offers new opportunities in the design of power-efficient analog-to-digital converters (ADCs) and timing generation based on seas of digital gates that exploit the variations and errors in unreliable, deeply scaled devices. The MAP detector itself is enhanced using an iterative, soft message-passing algorithm to unleash its full throughput potential while providing tolerance against underlying circuit failures. <br\/><br\/>The new link techniques developed in this research will improve both the computing capability and the energy efficiency of large data centers needed for cloud computing. The techniques also impact personal and mobile computing by delivering more efficient serial links such as the next-generation universal serial bus (USB). The interdisciplinary nature of this project encourages a tight integration of mixed-signal circuits, digital circuits and signal processing research and provides excellent training to students through research and industry internships.","title":"Design of Reliable High-Speed Links with Unreliable Circuits","awardID":"1255702","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["550475","550682"],"PO":["562984"]},"199589":{"abstract":"As feature sizes in microprocessor devices continue to scale down, the devices' susceptibility to hardware faults is increasing. While resilient system design is less cost-critical in high-end business applications where redundant hardware is an acceptable solution, it is expected that inexpensive consumer electronics will largely need to be fault tolerant as well. Approaches that double or triple system costs by replicating hardware are likely too expensive for consumer electronics, such as phones, tablets, and laptops. This project will investigate a new way of modeling and supporting hardware fault tolerance that relies on software and hardware working together cooperatively. The key idea is the design of a System Vulnerability Model (SVM), which approximates the vulnerability of an application to a hardware error. Using the model, each layer of the system offers knobs which can be tuned to control overall system vulnerability. This allows the design of systems that inexpensively provide the right amount of fault tolerance for a given application. <br\/><br\/>The results of this project could impact how future computer systems provide fault tolerance. Ultimately, such impact benefits society by helping sustain the demand for reliable computing devices, a significant driver in the economy. In the immediate future, it will support the training of graduate students in this critical area, and it will support enhancement of the undergraduate and graduate curriculum to include topics in fault tolerance at North Carolina State University.","title":"Exploring Cross-Layer, Integrated Approaches for Improving The Reliability of Heterogeneous Multicore Processors","awardID":"1255762","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["550815"],"PO":["562984"]},"202515":{"abstract":"The 9th International Nanotechnology Conference on Communication and Cooperation (INC9) will bring together renowned and technologically advanced thinkers to exchange information and ideas with regards to nanotechnology. Specific topics that will be emphasized in INC9 are as follows:<br\/><br\/>1) Bridge to Medical Engineering: Bio-transistors, personal health and environmental monitoring<br\/>2) Flagship projects in Europe: Brain research, Graphene Center, Large multidisciplinary centers <br\/>3) Bridge to photonics: high density optical interconnects and integrated silicon photonics<br\/>4) Bridge to Energy Efficiency: low energy electronics and lightning in Japan, Europe and US<br\/>5) Panel on innovation in nanotechnology<br\/><br\/>The meeting will provide a unique opportunity for academics and industry leaders to interact on issues in nanotechnology. In order to further strengthen the dialogue, leaders and policy makers from a number of continents will join researchers from industry and academia to hold discussions on a variety of efforts in nanosciences, along with opportunities for collaboration. Young scientists will also be invited to present posters highlighting their work.","title":"Ninth International Nanotechnology Conference on Communication and Cooperation","awardID":"1303850","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0700","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7681","name":"ENG NNI SPECIAL STUDIES"}}],"PIcoPI":[542723],"PO":["562984"]},"201107":{"abstract":"This funding establishes a new CISE Research Experiences for Undergraduates site at the University of California-San Diego (UCSD). The focus of the multidisciplinary site is on cyber-physical systems research motivated by real world challenges in exploration and scientific discovery. The site expands the successful UCSD Engineers for Exploration program to include students from other universities. The program's aim is to give a unique experience for motivated students by providing an intimate mentored lab environment at UCSD, and a structured collaboration with scientists, explorers, and engineers at the UCSD partner organizations. These partner organizations include the National Geographic Society, Hubbs SeaWorld Research Institute, the research arm of the San Diego Zoo, NOAA, the Organization of Latin American Subacuatica (OLAS), the Waitt Institute, and the Canadian Department of Environment and Conservation. The program provides undergraduates with a unique opportunity to develop technology that will be deployed across the world; the projects involve scientific research that literally spans across every continent and into the far corners of the globe. <br\/><br\/>Intellectual Merit: The REU participants will be exposed to exciting research projects centered on exploration and scientific discovery while utilizing a vast array of engineering disciplines across a wide range of research topics. They will work with accomplished faculty and scientific mentors using state-of-the-art facilities to perform cutting-edge cyber-physical systems research. In addition, they will be exposed to extensive professional development activities through weekly research skills workshops, an undergraduate research conference, and a REU journal club. <br\/><br\/>Broader Impacts: The site will seek a range of participants from diverse backgrounds who may not otherwise have the opportunity to participate in research. The projects are aimed at creating technology for conservation, cultural heritage, and exploration, and ultimately deployed in the field by scientists and explorers around the world. The REU participants will work closely faculty, scientists, postdoctoral scholars and graduate students. Together with the planned community building activities, this will make the REU site a positive and memorable experience, encouraging REU participants to pursue further training. Finally, the program provides leadership training to the graduate student and postdoctoral mentors. This will benefit the countless others whom they will train throughout their careers.","title":"REU Site: Engineers for Exploration","awardID":"1263320","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["560817",539187],"PO":["564181"]},"201008":{"abstract":"This funding establishes a new CISE Research Experiences for Undergraduates (REU) site at East Carolina University. The focus of the site is on the foundations, tools, and applications of software testing. Software testing is widely used to ensure the quality of software systems. Improvements to the foundations, tools, and applications of software testing will help improve the quality of software systems and reduce the cost of software development. The site will provide undergraduate students with research experience in software testing and give them a solid research foundation by participating in activities, such as developing solutions and algorithms for fundamental issues in software testing, developing tools to improve testing effectiveness and performance, and testing complex real systems.<br\/><br\/>This site will provide the opportunity for 30 undergraduate students over three years to participate in a supportive environment that encourages them to pursue graduate studies in computer science. The REU project will also provide students an opportunity to collaborate with their faculty mentors and\/or student peers after the summer program.","title":"REU Site: Software Testing: Foundations, Tools and Applications","awardID":"1262933","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[538913,538914],"PO":["564588"]},"196466":{"abstract":"This NSF Cyber-Physical Systems (CPS) Frontiers project \"Foundations Of Resilient CybEr-physical Systems (FORCES)\" focuses on the resilient design of large-scale networked CPS systems that directly interface with humans. FORCES aims to pr ovide comprehensive tools that allow the CPS designers and operators to combine resilient control (RC) algorithms with economic incentive (EI) schemes.<br\/><br\/>Scientific Contributions<br\/>The project is developing RC tools to withstand a wide-range of attacks and faults; learning and control algorithms which integrate human actions with spatio-temporal and hybrid dynamics of networked CPS systems; and model-based design to assure semantically consistent representations across all branches of the project. Operations of networked CPS systems naturally depend on the systemic social institutions and the individual deployment choices of the humans who use and operate them. The presence of incomplete and asymmetric information among these actors leads to a gap between the individually and socially optimal equilibrium resiliency levels. The project is developing EI schemes to reduce this gap. The core contributions of the FORCES team, which includes experts in control systems, game theory, and mechanism design, are the foundations for the co-design of RC and EI schemes and technological tools for implementing them.<br\/><br\/>Expected Impacts<br\/>Resilient CPS infrastructure is a critical National Asset. FORCES is contributing to the development of new Science of CPS by being the first project that integrates networked control with game theoretic tools and the economic incentives of human decision makers for resilient CPS design and operation. The FORCES integrated co-design philosophy is being validated on two CPS domains: electric power distribution and consumption, and transportation networks. These design prototypes are being tested in real world scenarios. The team's research efforts are being complemented by educational offerings on resilient CPS targeted to a large and diverse audience.","title":"CPS: Frontiers: Collaborative Research: Foundations of Resilient CybEr-Physical Systems (FORCES)","awardID":"1239054","effectiveDate":"2013-04-15","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[526839,526840,526841],"PO":["561889"]},"199623":{"abstract":"A great challenge for future electronic systems is coping with process, voltage, temperature and aging variations. If left unchecked these variations require unacceptable design margins, can lead to transient and permanent faults, and significantly degrade the system reliability and resilience. This project is to consider the potentially transformative concept of regular periodic deep rejuvenation for electronic systems akin to the recovery during sleep for biological systems. Until now sleep for electronics just meant a period of inactivity; this proposal explores the idea of sleep becoming an active recovery period as essential for electronics as it is in biology. Such deep rejuvenation schemes will require cross-layer optimizations in order to balance the various tradeoffs. Promising preliminary experimental results show the potential benefits of the proposed activities. <br\/><br\/>The proposed research, if successful, could have a deep impact on the semiconductor industry, and society as a whole, by the way electronic systems are designed, used and operated. Due to the periodic rejuvenation such systems could be optimized to run faster, consume less power, have less area, cost less, and thus overall provide more value per dollar. The Principle Investigator plans to develop a textbook for application-specific integrated circuits or systems-on-chips that would take advantage of the interactive graphics made possible by the iBook format, and to \"flip\" the classroom with the help of the available on-line lectures.","title":"CLASH - Cross-Layer Accelerated Self-Healing: Circadian Rythms for Resilient Electronic Systems","awardID":"1255907","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["560683"],"PO":["562984"]},"199634":{"abstract":"In the era beyond Moore's law, it will be imperative to consider improving resistance of integrated circuits to failures due to fabrication defects and variations, soft errors, and wearout as first-order considerations, to ensure economic viability of the semiconductor industry and robust operation of digital systems. This research will develop and demonstrate the benefits of a new multi-layered approach - spanning circuit, micro-architecture, instruction-set architecture, system, and user layers - for improving resistance to failures caused by fabrication, soft errors, and wearout. An approach to characterize user-layer impact of failures within each module will be developed to dramatically reduce overdesign and overtesting in future failure resistant systems. This research will also develop the first infrastructure to support systematic development of multi-layered approaches for failure resistance, including the first comprehensive models of layers, the first systematic method to identify candidate approaches and characterize their performance and overheads, and to derive globally optimal designs. This approach will identify efficient designs that will achieve failure resistance at uniquely low overheads. <br\/><br\/>The utilitarian gains to society should be immediate and and are likely to be substantial. The methods and tools developed will provide significant improvements in yield, performance, robustness to soft errors, and system lifespan. This project will train students and industry experts in the science and art of of efficient failure resistance, and prepare them for the era beyond the end of Moore's law. The principle investigator will also distribute to the community of researchers and industry experts the models, framework, and tools to be developed as a result of this project.","title":"Theory, methods, and tools for cross-layered design of uniquely efficient failure-resistant systems","awardID":"1255951","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535238],"PO":["562984"]},"196467":{"abstract":"This CPS Frontiers project addresses highly dynamic Cyber-Physical Systems (CPSs), understood as systems where a computing delay of a few milliseconds or an incorrectly computed response to a disturbance can lead to catastrophic consequences. Such is the case of cars losing traction when cornering at high speed, unmanned air vehicles performing critical maneuvers such as landing, or disaster and rescue response bipedal robots rushing through the rubble to collect information or save human lives. The preceding examples currently share a common element: the design of their control software is made possible by extensive experience, laborious testing and fine tuning of parameters, and yet, the resulting closed-loop system has no formal guarantees of meeting specifications.<br\/><br\/>The vision of the project is to provide a methodology that allows for complex and dynamic CPSs to meet real-world requirements in an efficient and robust way through the formal synthesis of control software. The research is developing a formal framework for correct-by-construction control software synthesis for highly dynamic CPSs with broad applications to automotive safety systems, prostheses, exoskeletons, aerospace systems, manufacturing, and legged robotics. <br\/><br\/>The design methodology developed here will improve the competitiveness of segments of industry that require a tight integration between hardware and highly advanced control software such as: automotive (dynamic stability and control), aerospace (UAVs), medical (prosthetics, orthotics, and exoskeleton design) and robotics (legged locomotion). To enhance the impact of these efforts, the PIs are developing interdisciplinary teaching materials to be made freely available and disseminating their work to a broad audience.","title":"CPS: Frontier: Collaborative Research: Correct-by-Design Control Software Synthesis for Highly Dynamic Systems","awardID":"1239055","effectiveDate":"2013-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[526843],"PO":["561889"]},"196489":{"abstract":"This CPS Frontiers project addresses highly dynamic Cyber-Physical Systems (CPSs), understood as systems where a computing delay of a few milliseconds or an incorrectly computed response to a disturbance can lead to catastrophic consequences. Such is the case of cars losing traction when cornering at high speed, unmanned air vehicles performing critical maneuvers such as landing, or disaster and rescue response bipedal robots rushing through the rubble to collect information or save human lives. The preceding examples currently share a common element: the design of their control software is made possible by extensive experience, laborious testing and fine tuning of parameters, and yet, the resulting closed-loop system has no formal guarantees of meeting specifications.<br\/><br\/>The vision of the project is to provide a methodology that allows for complex and dynamic CPSs to meet real-world requirements in an efficient and robust way through the formal synthesis of control software. The research is developing a formal framework for correct-by-construction control software synthesis for highly dynamic CPSs with broad applications to automotive safety systems, prostheses, exoskeletons, aerospace systems, manufacturing, and legged robotics. <br\/><br\/>The design methodology developed here will improve the competitiveness of segments of industry that require a tight integration between hardware and highly advanced control software such as: automotive (dynamic stability and control), aerospace (UAVs), medical (prosthetics, orthotics, and exoskeleton design) and robotics (legged locomotion). To enhance the impact of these efforts, the PIs are developing interdisciplinary teaching materials to be made freely available and disseminating their work to a broad audience.","title":"CPS: Frontier: Collaborative Research: Correct-by-Design Control Software Synthesis for Highly Dynamic Systems","awardID":"1239143","effectiveDate":"2013-04-01","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[526892],"PO":["561889"]},"199614":{"abstract":"As transistors get smaller, they become increasingly susceptible to variations in their timing characteristics. One way to deal with possible variations is to assume worst-case characteristics during hardware design. Unfortunately, the power and performance costs of worst-case design are becoming prohibitive. Consequently, processor designers have sought more aggressive design styles that permit better-than-worst-case operation. One such approach uses \"canary circuits\" that indicate when a processor is on the verge of unsafe operation due to variations. This research investigates \"software canaries\" - software routines that exercise the most susceptible circuits of a processor to determine an aggressive safe operating point. Software canaries enable all the benefits of hardware canary circuits, without the corresponding hardware overhead. More importantly, they may provide additional benefits as they can track aging and temperature - variations that may be indistinguishable to hardware canary circuits. Furthermore, unlike hardware canary circuits, they allow identifying the most aggressive operating point on a per application basis. This research focuses on exploring the benefits of software canaries, developing use cases, developing techniques for building software canaries for different microarchitectures, and developing microarchitecture and system support needed to support software-canary-based execution.<br\/><br\/>The broader impact of the research lies in enabling computing systems with significantly lower energy consumption by selecting aggressive operating points. Other specific impacts include development of open source tools that may be used for further work by other research groups, and a greater discussion of variations and energy efficiency in graduate and undergraduate coursework.","title":"Collaborative Research: Software Canaries","awardID":"1255857","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535191],"PO":["562984"]},"199604":{"abstract":"Designing robust and energy-efficient large-scale systems-on-chips (SOCs) with high design productivity is a challenge of great interest. However, lack of coordination among different design layers has caused designers to make worst-case assumptions at individual design layers, leading to substantially suboptimal designs with poor reliability\/energy\/performance co-optimization or tradeoffs. This project is the first major effort dedicated toward a unified failure-resistant system from high-level synthesis to physical design with tight integration. It will build reliability-centric physical-aware high-level synthesis and high-level-guided physical design to bridge the gap between these two distant layers. A novel cross-layer engineering change order (ECO) framework will also be developed to couple high-level ECO with stable physical-level ECO. New tools and methodologies will be studied and provided to the system and physical design community targeting reliability while increasing overall design productivity and quality. <br\/><br\/>Electronics have permeated modern society, which increasingly depends on reliable operations of these electronic systems. However, device-level scaling is heading in the opposite direction from system reliability. This project will transform existing SOC design methodologies through cross-layer integration. Research from this effort will be broadly disseminated through publications and presentations, active interaction with industrial collaborators, as well as infusion of new course material into classrooms and instructional laboratories. The principal investigators will continue their efforts in recruiting women and other underrepresented minorities into their research programs. They have previously reached out to K-12 students and will continue to do so in order to attract the best of them into the engineering profession.","title":"Collaborative Research: From High-level Synthesis to Layout: a Cross-layer Methodology for Large-scale Reliable IC Design","awardID":"1255816","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535167],"PO":["562984"]},"199615":{"abstract":"As transistors get smaller, they become increasingly susceptible to variations in their timing characteristics. One way to deal with possible variations is to assume worst-case characteristics during hardware design. Unfortunately, the power and performance costs of worst-case design are becoming prohibitive. Consequently, processor designers have sought more aggressive design styles that permit better-than-worst-case operation. One such approach uses \"canary circuits\" that indicate when a processor is on the verge of unsafe operation due to variations. This research investigates \"software canaries\" - software routines that exercise the most susceptible circuits of a processor to determine an aggressive safe operating point. Software canaries enable all the benefits of hardware canary circuits, without the corresponding hardware overhead. More importantly, they may provide additional benefits as they can track aging and temperature - variations that may be indistinguishable to hardware canary circuits. Furthermore, unlike hardware canary circuits, they allow identifying the most aggressive operating point on a per application basis. This research focuses on exploring the benefits of software canaries, developing use cases, developing techniques for building software canaries for different microarchitectures, and developing microarchitecture and system support needed to support software-canary-based execution.<br\/><br\/>The broader impact of the research lies in enabling computing systems with significantly lower energy consumption by selecting aggressive operating points. Other specific impacts include development of open source tools that may be used for further work by other research groups, and a greater discussion of variations and energy efficiency in graduate and undergraduate coursework.","title":"Collaborative Research: Software Canaries","awardID":"1255861","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535193],"PO":["562984"]},"201903":{"abstract":"This award renews an exemplary Research Experiences for Teachers (RET) Site on Robotics Engineering for Better Life and Sustainable Future at Michigan State University. The renewed site will continue to develop a strong partnership between MSU and schools in the greater Lansing-Detroit-Grand Rapids area on advancing pre-college science and engineering education by training a cadre of leaders of middle and high school teachers in the areas of Science, Technology, Engineering, and Mathematics (STEM). The program will recruit teachers from schools in Mid- and Southeast Michigan with a focus on those serving socioeconomically challenged populations and students from groups traditionally underrepresented in science and engineering. RET participants will attend a 6-week summer institute, to participate in cutting-edge research on robotics engineering, with mentoring from engineering faculty who lead vibrant robotics related research programs. Working with PIs, faculty mentors, a curriculum development specialist and an editor of TeachEngineering.org, teachers will develop innovative, standards-compliant curriculum modules and participate in a number of professional development activities. Extensive follow-up activities are planned throughout the academic year to ensure the translation of lab experience into classroom practice, and to foster and strengthen long-term partnership between engineering faculty and teachers. A third-party professional program evaluator will track and evaluate the program and provide feedback for improvement. The evaluator will also conduct longitudinal studies on participants to assess the longer-term impact of the RET program.<br\/><br\/>Intellectual Merit. Under the coherent theme of Robotics Engineering for Better Life and Sustainable Future, the proposed RET Site will expose teachers to leading robotics research spanning biorobotics, evolutionary robotics, nanorobotics, brain-machine interface, biomechanics, and human-robot interaction, and to the profound changes robotic technologies will bring to personal care, medical procedures, environmental monitoring and exploration, and entertainment and gaming. The interdisciplinary nature of robotics engineering will provide a fertile ground for developing creative course modules in biology, physics, chemistry, and technology that align with state and national standards, which will excite pre-college students and liven up classroom learning. <br\/><br\/>Broader Impacts. The proposed RET Site project is expected to enrich the professional development of a number of future leaders in STEM education, about half being females with a similar ratio for minorities. It will also result in innovative curriculum for science and technology courses, and pique the interest of middle and high school students in scientific inquiry. Through the partnership with schools in Lansing, Detroit, and Grand Rapids, and the all-girls Regina High School, the proposed project will positively influence the learning and career paths of young students, especially students from underserved districts and underrepresented groups in Michigan and beyond for years to come, thus contributing to a technology-savvy workforce that is much needed by America.","title":"RET in Engineering and Computer Science Site: Robotics Engineering for Better Life and Sustainable Future","awardID":"1300794","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1359","name":"RES EXP FOR TEACHERS(RET)-SITE"}}],"PIcoPI":["560245",541140],"PO":["564181"]},"199605":{"abstract":"In the semiconductor industry, one way of measuring reliability is the expected lifetime of a product. As semiconductor manufacturing technologies continue to advance, ensuring reliability has become one of the major challenges in the industry. The ability to ensure reliability is essential for the success of a product line as well as the success of the industry. <br\/><br\/>This project proposes to develop a first cost-effective solution for screening unreliable parts before product shipment to the customer. The project proposes to develop software tools and methodologies for predicting the expected life time of a part. Further, the project proposes to develop a second cost-effective solution for continuously monitoring and improving reliability while a part is being used in the field. Additional software tools and methodologies will be developed for building models for such continuous monitoring. These monitoring models are then used for extending the life time of a part by automatic adjusting the operational parameters such as speed and voltage of the part based on its current health condition. <br\/><br\/>The research is integrated with educational activities to develop course and tutorial materials for broad impact, a state-of-the-art laboratory for education, and a research program to attract undergraduate and underrepresented students. The research strives to achieve a comprehensive understanding of state-of-the-art industrial practices and to accomplish multidisciplinary studies merging knowledge from reliability physics, semiconductor testing, and data mining. Knowledge discovered through this research will provide the industry with a clear direction on how to cope with the present and future reliability challenges.","title":"Cost-Effective Reliability Screening, Binning, and In-Field Adaptation","awardID":"1255818","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535169],"PO":["562984"]},"198758":{"abstract":"The project aims to leverage the massive corpus of online photos, text, and maps to create a semantic 3D labeled model of the world, e.g., detailed representations of the world's top cultural and historical sites. While breakthroughs in computer vision enable creating detailed 3D models from millions of online 2D images, the resulting models capture only geometry. Consequently, they lack semantics; they don't provide information about the contents of the scene. The vast treasure trove of online text such as Wikipedia meticulously catalogs the scenes that are captured in photos and models. Modern Natural Language Processing (NLP) techniques can now process such data, opening up the opportunity to extract knowledge from the online text corpus and use it to label 3D geometry. This project seeks to jointly analyze the massive corpus of online text, maps, and photos to create labeled 3D models of the world's sites. Achieving this goal will require fundamental research advances at the interface of natural language processing and computer vision that impact both the scientific research community and the world at large. <br\/><br\/>The project addresses two key technical challenges: (1) automatic scene labeling: mapping semantics onto geometry, and (2) solving the 3D jigsaw puzzle: mapping pieces of geometry into the world. Many clues to these mapping problems lie in the text and other online datasources such as floorplans. Other clues lie in the content of the photos. Decoding this mapping therefore involves an interplay between NLP and computer vision. The key research advances center around new ways to jointly leverage computer vision and NLP to solve problems to solve challenging problems in both fields, specifically, 1) recognizing objects through joint NLP and 3D visual analysis, 2) placing objects in the world by correlating geometry with spatial text in maps and webpages, and 3) using semantics to improve geometry by augmenting visual cues with textual spatial relations.<br\/><br\/>Broader Impacts: The primary research outcomes are: (1) technology for creating labeled 3D models at a massive scale, and (2) labeled models for many top tourist sites. Both the algorithms and models will be made freely available for the research community. These algorithms and models will provide the foundation for a range of exciting applications of major practical impact on the world at large. The resulting tools could make it possible for resources such as Wikipedia to link the text directly to 3D models and vice-versa, with attendant benefits to online learning and education. The same technology could enable automated labeling of 2D photographs. In the context of real-time applications (e.g., augmented reality), the technology could provide visual overlays and instant feedback on what you are currently looking at, and enable augmented reality-style guided tours. Other applications include using labeled geometry for navigation (walking directions), and converting images to text for the visually impaired. The research is tightly integrated into education and training of students at the University of Washington. Additional information about the project can be found at: http:\/\/grail.cs.washington.edu\/projects\/label3d\/","title":"BIGDATA: Small: DA: DCM: Labeling the World","awardID":"1250793","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[533242,"557091"],"PO":["565136"]},"196448":{"abstract":"This NSF Cyber-Physical Systems (CPS) Frontiers project \"Foundations Of Resilient CybEr-physical Systems (FORCES)\" focuses on the resilient design of large-scale networked CPS systems that directly interface with humans. FORCES aims to pr ovide comprehensive tools that allow the CPS designers and operators to combine resilient control (RC) algorithms with economic incentive (EI) schemes.<br\/><br\/>Scientific Contributions<br\/>The project is developing RC tools to withstand a wide-range of attacks and faults; learning and control algorithms which integrate human actions with spatio-temporal and hybrid dynamics of networked CPS systems; and model-based design to assure semantically consistent representations across all branches of the project. Operations of networked CPS systems naturally depend on the systemic social institutions and the individual deployment choices of the humans who use and operate them. The presence of incomplete and asymmetric information among these actors leads to a gap between the individually and socially optimal equilibrium resiliency levels. The project is developing EI schemes to reduce this gap. The core contributions of the FORCES team, which includes experts in control systems, game theory, and mechanism design, are the foundations for the co-design of RC and EI schemes and technological tools for implementing them.<br\/><br\/>Expected Impacts<br\/>Resilient CPS infrastructure is a critical National Asset. FORCES is contributing to the development of new Science of CPS by being the first project that integrates networked control with game theoretic tools and the economic incentives of human decision makers for resilient CPS design and operation. The FORCES integrated co-design philosophy is being validated on two CPS domains: electric power distribution and consumption, and transportation networks. These design prototypes are being tested in real world scenarios. The team's research efforts are being complemented by educational offerings on resilient CPS targeted to a large and diverse audience.","title":"CPS: Frontiers: Collaborative Research: Foundations of Resilient CybEr-Physical Systems (FORCES)","awardID":"1238959","effectiveDate":"2013-04-15","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["564429","553600","533198"],"PO":["561889"]},"199606":{"abstract":"Electronic systems are an indispensable part of everyday life. Malfunctions in these systems have consequences ranging from annoying computer crashes, loss of data and services, to financial and productivity losses, or even loss of human life. For coming generations of electronic systems manufactured using advanced silicon technologies, several hardware failure mechanisms, largely benign in the past, are becoming visible at the system-level. As a result, a vast majority of future electronic systems, handhelds and servers alike, will require resilience to hardware failures during their operation. Traditional redundancy techniques impose significant costs, and are clearly impractical for general usage. This proposal addresses this outstanding challenge: how to create systematic approaches to achieve the required level of resilience at minimal power, performance and area costs?<br\/><br\/><br\/>In addition to educating new generations of students and semiconductor industry professionals on the emerging resilience topics, this project will enable the broader research community to answer several key questions for which satisfactory answers don't exist today. Quantitative answers to these questions will enable the industry to create next generations of electronic systems with highly cost-effective resilience. As a side benefit, the results obtained from this project can help overcome challenges associated with post-silicon validation and debug of complex electronic systems of the future.","title":"Cross-Layer Resilience Exploration","awardID":"1255821","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["556787","559405"],"PO":["562984"]},"196449":{"abstract":"This NSF Cyber-Physical Systems (CPS) Frontiers project \"Foundations Of Resilient CybEr-physical Systems (FORCES)\" focuses on the resilient design of large-scale networked CPS systems that directly interface with humans. FORCES aims to pr ovide comprehensive tools that allow the CPS designers and operators to combine resilient control (RC) algorithms with economic incentive (EI) schemes.<br\/><br\/>Scientific Contributions<br\/>The project is developing RC tools to withstand a wide-range of attacks and faults; learning and control algorithms which integrate human actions with spatio-temporal and hybrid dynamics of networked CPS systems; and model-based design to assure semantically consistent representations across all branches of the project. Operations of networked CPS systems naturally depend on the systemic social institutions and the individual deployment choices of the humans who use and operate them. The presence of incomplete and asymmetric information among these actors leads to a gap between the individually and socially optimal equilibrium resiliency levels. The project is developing EI schemes to reduce this gap. The core contributions of the FORCES team, which includes experts in control systems, game theory, and mechanism design, are the foundations for the co-design of RC and EI schemes and technological tools for implementing them.<br\/><br\/>Expected Impacts<br\/>Resilient CPS infrastructure is a critical National Asset. FORCES is contributing to the development of new Science of CPS by being the first project that integrates networked control with game theoretic tools and the economic incentives of human decision makers for resilient CPS design and operation. The FORCES integrated co-design philosophy is being validated on two CPS domains: electric power distribution and consumption, and transportation networks. These design prototypes are being tested in real world scenarios. The team's research efforts are being complemented by educational offerings on resilient CPS targeted to a large and diverse audience.","title":"CPS: Frontiers: Collaborative Research: Foundations of Resilient CybEr-Physical Systems (FORCES)","awardID":"1238962","effectiveDate":"2013-04-15","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[526786,"544751"],"PO":["561889"]},"199607":{"abstract":"The need for failure-resistant circuit and system design is becoming critical as mobile devices continue to be constructed with enhanced computing and video processing capabilities using heterogeneous intellectual property blocks such as CPU, memory, sensors, and graphics\/image processing units. Furthermore, ever-increasing miniaturization of integrated fabrication processes (e.g., 40 nanometer CMOS or below) is creating challenging problems including higher rates of failure at the device level, reliability degradation, and severe process\/voltage\/temperature variation, resulting in unpredictable behaviors and temporary or permanent failure of circuits and systems. This project proposes a failure-resistant and variation-tolerant interconnect system that will enhance the reliability of the system at the circuit level. The project will also enhance the self-healing capability of mobile platforms by developing adaptive and automatic fault detection techniques as well as by developing reconfigurable data access capabilities. <br\/><br\/>Methodologies for developing failure-resistant computing and communication systems are critical for future semiconductor fabrication processes. An innovative failure-resistant and self-healing system could have significant impact on the industry and enhance national competitiveness. The microelectronic industry needs engineers trained in both analog\/mixed-signal and radio frequency\/microwave integrated circuit and system design. This project will thus contribute to the training of a competitive workforce.","title":"Failure-Resistant and Self-Healing Communication for Adaptive Mobile System","awardID":"1255822","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535174],"PO":["562984"]},"199618":{"abstract":"Near-threshold voltage (NTV) operation has emerged as a promising strategy to improve energy-efficiency by reducing the supply voltage while exploiting parallelism to compensate for frequency loss. NTV processors combined with \"Turbo mode\" can also offer peak performance, thereby making them suitable for a range of dynamic workload behaviors. Despite the promise, applications of these systems have remained largely elusive due to many issues. This research, involving VLSI circuits, computer architecture, and software systems, for the first time, addresses the reliability challenges of NTV\/Turbo mode systems in the context of device aging and variability. Researchers will integrate distributed system monitors and controls to enable power-efficient fault resiliency for on-chip NTV\/Turbo-mode cores. The work will lay the foundations for a feedback-directed optimization system that tunes the hardware's execution to meet application requirements by balancing performance, reliability and energy consumption.<br\/><br\/><br\/>Our society's productivity and advancements are intimately tied to the predictable and sustainable operation of the world's computing infrastructure. Unfortunately, this trend is beginning to falter due to increasing computer energy consumption. Aggressive energy reductions are tightly coupled with destabilizing computer system performance and longevity. The research will uncover observations that are necessary to overcome the problem in near-threshold voltage systems that hold great promise for further advanced computing. Using an approach spanning both the hardware and software layers, researchers will investigate and develop novel techniques to overcome the energy problem. Such a holistic and joint effort across the layers is the key for ensuring our society's long-term success based on advanced computing.","title":"Collaborative Research: Feedback-driven Resiliency for Near-Threshold Systems","awardID":"1255892","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":[535200],"PO":["562984"]},"199619":{"abstract":"Circuit reliability, process variations, and environmental variations have become major challenges to address in advanced integrated circuit designs, especially for parts deployed in critical-life applications such as automotive, medical devices, aerospace, etc. The goal of this project is to develop novel and efficient test infrastructures, multi-level test approaches, and methods to eliminate wasteful guardband for improving performance and reliability of the circuit throughout its lifetime operation under any workload. <br\/><br\/>The intellectual merits include (1) design of new test and measurement infrastructure while targeting aging, minimum available slack, noise, and timing uncertainties in the circuit, (2) generation of test patterns considering different noise\/workload conditions on target paths and selection of paths to be targeted for test and reliability analysis, (3) analyzing the measurement data at three different levels, namely manufacturing test and silicon validation, system bring up, and in-the-field test, and finally (4) analyzing data collected from a SOC design fabricated in an advanced technology node. <br\/><br\/>This project will lead to reduced design re-spin and shrinking gap between manufacturing test and system test, thereby lowering manufacturing cost. The results of this project will alleviate debugging and diagnosis problems. Resulting benefits for society include: (i) more reliable electronic systems for critical applications; (ii) cheaper and more dependable computing platforms; (iii) realization of the much sought-after goal of \"zero defects\" in the field for automotive, medical, and space applications. Students involved in this research will be prepared for the semiconductor industry workforce.","title":"A Multi-Level Test Approach for Improving Reliability and Performance of Nanometer Technology Designs","awardID":"1255898","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["560771"],"PO":["562984"]},"195608":{"abstract":"The Cyberlearning Resource Center (CRC) has responsibility for promoting integrative collaboration among cyberlearning grantees (across NSF programs); synthesis and national dissemination of cyberlearning findings, technologies, models, materials, and best practices; creating a national presence for Cyberlearning; helping the disparate Cyberlearning research and development communities coordinate efforts to build capacity; and providing infrastructure (technological and social) for supporting these efforts. Monitored through the Cyberlearning: Transforming Education program, the CRC serves as a resource for all NSF grantees and programs with cyberlearning components, helping to promote synergy and integrate projects across NSF's cyberlearning investments. <br\/><br\/>Among society's central challenges are amplifying, expanding, and transforming opportunities people have for learning and more effectively drawing in, motivating, and engaging young learners. Engaging actively as a citizen and productively in the workforce requires understanding a broad variety of concepts and possessing the ability to collaborate, learn, solve problems, and make decisions. Whether learning is facilitated in school or out of school, and whether learners are youngsters or adults, to develop such knowledge and capabilities, learners must be motivated to learn, actively engage over the long term in learning activities, and put forth sustained cognitive and social effort. Consistent with NSF's mission and strategic plan, a variety of programs at NSF invest in research aimed towards achieving these goals. In support of this important thematic thrust, the Cyberlearning Resource Center works with researchers and NSF program officers to identify and disseminate findings from across programs and projects; develop ways to broker productive partnerships and collaborations; convene meetings for purposes of envisioning the future, integrating findings, and building capacity,; and monitor the cyberlearning portfolio and its influences and impacts.","title":"CRC: Center for Innovative Research on Cyberlearning (CIRCL)","awardID":"1233722","effectiveDate":"2013-04-01","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7645","name":"DISCOVERY RESEARCH K-12"}}],"PIcoPI":[524324,524325,524326,"547070"],"PO":["562669"]},"207391":{"abstract":"Formal modeling and verification technology has made<br\/>significant advances in the last two decades. Techniques like model<br\/>checking and theorem proving are now used in both the hardware and<br\/>software industries. Formal techniques are also increasingly being<br\/>used in scientific modeling, as for example in systems biology and in<br\/>the engineering of complex cyber-physical systems. The biggest<br\/>challenge facing this technology is the lack of trained users and<br\/>developers of this technology. <br\/>To address this gap, we started the Summer School in Formal Techniques. <br\/>Two such schools have been organized, during the summers of 2011 and 2012, <br\/>at Menlo College in Atherton, California. These schools attracted around 80<br\/>participants with a diverse range of interests and backgrounds. The<br\/>lectures were supported by hands-on laboratories. Both schools have<br\/>been received enthusiastically by the participants. The 2013<br\/>Summer School on Formal Techniques continues the work of developing a<br\/>well-knit community of researchers who are interested in learning<br\/>cutting-edge techniques in formal modeling and verification.<br\/>Attendees at the school have the opportunity to present their own<br\/>research ideas and to interact closely with both the lecturers and<br\/>other students.","title":"CISE\/CCF: 2013 Summer School on Formal Techniques","awardID":"1333674","effectiveDate":"2013-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[555363],"PO":["565264"]},"208151":{"abstract":"The International Conference on Architectural Support for Programming Languages and Operating<br\/>Systems (ASPLOS) is a premier multi-disciplinary conference for research that spans the boundaries<br\/>of hardware, computer architecture, compilers, languages, operating systems, networking, and<br\/>applications. ASPLOS provides a high quality forum for scientists and engineers to present<br\/>their latest research findings in these rapidly changing fields. It has captured some of the<br\/>major computer systems innovations of the past two decades (e.g., RISC and VLIW processors,<br\/>small and large-scale multiprocessors, clusters and networks-of-workstations, optimizing compilers,<br\/>RAID, and network-storage system designs). This proposal aims to support this highly regarded<br\/>conference by obtaining travel funds to help students defray the costs of attending the conference<br\/>in March 2013 in Houston, Texas USA. Priority will be given to those students who will present their <br\/>research at ASPLOS or its joint workshops, and to women and other under-represented groups.<br\/><br\/>This proposal will have two primary direct benefits in terms of broader impact. First, the<br\/>ASPLOS conference will be strengthened as a result of the greater attendance that this travel<br\/>support will enable. Second, those students receiving travel support will personally benefit<br\/>from the opportunity to engage in the all-important technical, professional, and social exchanges<br\/>that ASPLOS fosters.<br\/><br\/>We also expect this proposal to have two additional indirect impacts. First, we plan to widely<br\/>advertise the available support in order to attract women and under-represented minority groups<br\/>in attendance. Second, by providing this support expressly to students, we expect to increase<br\/>student participation in the conference. We anticipate that the research results presented<br\/>at the conference -- as well as the emphasis on interaction between researchers in academia<br\/>and industry -- will be carried back by attendees to their home institutions, resulting in<br\/>heightened awareness and interests in multidisciplinary research in computer architectures,<br\/>programming languages, and operating systems.","title":"Travel Support for the Conference on Architectural Support for Programming Languages and Operating Systems","awardID":"1338429","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[557772],"PO":["366560"]},"208273":{"abstract":"This award provides student travel and subsistence for the 2013 Oregon Programming Languages Summer School (OPLSS). This summer school provides an important and valuable educational opportunity for students to study theoretical topics related to programming languages and methods\/verification. The students who attend are from a large number of countries. The NSF support ensures participation of US students while paying attention to underrepresented groups. The broader impacts are include building international community and cooperation in foundational research areas, and enhancing education of students with exposure to and interaction with leading-edge research and researchers.","title":"Conference Support for OREGON PROGRAMMING LANGUAGES SUMMER SCHOOL, 2013","awardID":"1338938","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["563479"],"PO":["564588"]},"208362":{"abstract":"IEEE International Symposium on Biomedical Imaging (ISBI): from Nano to Macro Student Travel Awards 2013, PI: Bahram Parvin, U.C. Riverside<br\/><br\/>The project provides NSF Student Travel Fellowships to graduate students and Ph.D. candidates in computational bioimaging or closely related areas to attend and participate in the 2013 ISBI conference organized jointly by the IEEE Signal Processing Society (SPS) and Engineering in Medicine and Biology (EMB) in San Francisco, California from April 7 to 11, 2013. ISBI emphasizes methodologies that have the potential to be applicable to multiple imaging modalities and to imaging at different scales. Topics include multi-scale physiological analysis and modeling of biological processes. The meeting aims to facilitate cross fertilization of computational techniques between different imaging modalities and scales, with applications ranging from the nano and molecular imaging, via electron and optical microscopy, to macroscopic imaging via small animal imagers and whole body clinical systems. Special efforts will be made to attract women and members of groups that are underrepresented within image-based modeling of biological systems and integrative biology. The NSF student travel award recipients will be able to attend the plenary and contributed talks, grand challenges and tutorials that are part of ISBI 2013 as well as interactions with leading researchers in the world. <br\/><br\/>Intellectual Merit: The International Symposium on Biomedical Imaging provides a forum where top-notch students interact with leaders in the field and engage in intellectual discussions with other superlative students in a wide array of bio-imaging and related disciplines. Students are able to view presentations on topics related to their own fields of academic study and to participate in didactic interactions. Without the NSF support, many students would be less likely to attend the conference, thus missing an introduction to the world of knowledge available at such professional meetings. In addition, the meeting provides a forum for recognizing the talents of women and minorities in the field of multi-scale image-based modeling and bioengineering. Ultimately, the forum provides the means for Graduate students and Ph.D. candidates to improve the quality of dissertation research and make better informed decisions for advancing their career objectives.<br\/><br\/>Broader Impact: The International Symposium on Biomedical Imaging promotes not only education within the image-based modeling and visualization of biological systems, but fosters the next generation engineers, modelers, and computer scientists by providing a unique opportunity for the students to meet and network with the leading scientists in the world. It also provides students an opportunity to participate in grand challenges and to learn about the state of art computational methods for solving complex problems in image-based modeling and analysis, and hypothesis generation from \"big data\", which are being generated through several national initiatives. For the first time, ISBI is enjoying a rapid growth in grand challenges, and this process will be an extraordinary exposure for students. Grand challenges set the bar for performance and elicit technological advancement and sophistication for the next generation researchers.","title":"III: Travel Grant: International Symposium on Biomedical Imaging","awardID":"1339492","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[558377],"PO":["563727"]},"208373":{"abstract":"","title":"Identifying the Best Approach to an Enhanced Reviewer and Review Management Capability","awardID":"1339547","effectiveDate":"2013-04-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0300","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0401","name":"Division of SBE Off of Multidisciplinary A","abbr":"SMA"},"pgm":{"id":"8022","name":"STAR Metrics"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7699","name":"ICER"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"8015","name":"BIO Innovation Activities"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7261","name":"PROGRAM EVALUATION"}}],"PIcoPI":[558407],"PO":[558408]},"207461":{"abstract":"The Workshop on Security and Human Behavior (SHB) was started in 2008 to facilitate a dialogue about behavioral aspects of safety and security that is developing between psychologists and security engineers. Related conferences include the Symposium on Usable Privacy and Security (SOUPS) which brings together security people and psychologists but is more narrowly focused on the usability of security products and systems. The Workshop on the Economics of Information Security (WEIS) has much broader scope but as its name suggests its focus is security and economics. The goal of SHB is to bring in a broader set of social scientists than those involved in SOUPS, WEIS, and similar conferences, with a 50\/50 mix between social scientists and computer scientists.<br\/><br\/>This grant provides financial support to cover travel, accommodation and registration for students and social science faculty members, allowing expansion of access to workshop scheduled to be held at University of Southern California's National Center for Risk and Economic Analysis of Terrorism Events (CREATE - www.usc.edu\/create) on June 3-4 2013. Past workshops have been hosted at MIT, Cambridge, MA (2008 and 2009), Cambridge, UK (2010), CMU, Pittsburgh, PA (2011), and Google HQ, New York (2012). The program committee of this year's workshop consists of (1) Bruce Schneier who is Chief Security Technology Officer of BT, (2) Professor Alessandro Acquisti of Carnegie Melon, and (3) Professor Ross Anderson of Cambridge.","title":"Security and Human Behavior Workshop","awardID":"1334236","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[555535],"PO":["565327"]},"208111":{"abstract":"This EAGER project supports foundational research toward the exploration of data quality (DQ) issues in the context of sensor networks. Speci&#64257;cally, this project will include three major research thrusts: (1) a multidimensional DQ model for sensor feeds that can accommodate a<br\/>diverse set of DQ attributes. The project will carry out a comprehensive study into various DQ dimensions which will include inventing metrics and mechanisms for accurately quantifying the DQ dimensions; (2) The project will create a service oriented architectural framework for federated sensor service clouds in which DQ awareness is pervasive at all levels and all aspects of the architecture. Our core idea is to virtualize all sensors and auxiliary services in a DQ-aware manner; and (3) The project will devise DQ-aware autonomic techniques for sensor service discovery, feed composition and adaptation towards environmental dynamics. Our techniques will enhance scalability by detecting feed processing tasks that are shared among multiple user requests, as well as by cloud topology-aware distribution of feed processing tasks.","title":"CSR: EAGER: Exploratory Research on Data Quality-Centric Cloud Infrastructure for Federated Sensor Services","awardID":"1338276","effectiveDate":"2013-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[557662],"PO":["565255"]},"207430":{"abstract":"This project funds approximately 10-12 US-based graduate students to attend the Tenth Symposium on Networked Systems Design and Implementation (NSDI?13) to be held April 3-5, 2013 in Lombard, IL. Participation in NSDI and similar conferences is a valuable and important part of the graduate school experience and will provides students with the opportunity to interact with more senior researchers in the &#64257;eld, and exposes students to leading edge work in the &#64257;eld. The conference focuses on the design principles of large-scale networks<br\/>and distributed systems.","title":"Student Travel Support for the Tenth Symposium on Networked Systems Design and Implementation (NSDI)","awardID":"1333988","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["560436"],"PO":["565255"]},"199491":{"abstract":"Variability is a grand challenge that hinders the progress of semiconductor technology. Adaptive design is considered a promising approach for addressing this challenge, especially under increasingly tight chip power constraints. However, its application in practice is limited, largely due to the lack of systematic techniques for managing its overhead, complexity, and integration with existing design flows. This research will develop a design automation framework that optimizes the use of adaptivity resources, maximizes their efficiency, and balances the tradeoff with conventional design objectives. The key of this research is capturing the uncertainty and dynamics of adaptive designs in a lightweight manner, yet with high fidelity. New variability and adaptivity models will be investigated in conjunction with robust optimization methods. In addition, a formal technique will be studied to handle the tradeoffs among competing design objectives. Parallel computing techniques will also be explored to cope with the enormous problem sizes of current and emerging applications. <br\/><br\/>This research will strengthen some weak links in adaptive circuit technology and help pave a path toward its wide applications. It will simultaneously address variability and power challenges faced by nanometer semiconductor technologies. The potential improvement of chip power-efficiency will facilitate green computing technology. Furthermore, the proposed techniques will be applicable to next-generation device technologies and will therefore benefit the future of the semiconductor industry. This research will also serve as a test-bed for training students to understand synergies among various aspects of modern chip design processes.","title":"Design Automation for Cost-Effective Implementation of Adaptive Integrated Circuits","awardID":"1255193","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["553623"],"PO":["562984"]},"202253":{"abstract":"Human society is faced with an increasing number of problems including<br\/>stubborn diseases and international security\/climate threats. The<br\/>computer simulations and advanced data management methods necessary to<br\/>solving these societal problems can only be realized through increased<br\/>use of parallel computing at all system scales, including desktops,<br\/>servers and the cloud. Efficient large-scale parallel computing<br\/>however requires advanced parallel programming methods. Such methods,<br\/>unfortunately, have a greater proclivity for software bugs that<br\/>increase cost through lost cycles on super-computers and these same<br\/>bugs undermine confidence in simulation results. This research<br\/>addresses the challenge of developing parallel computing software by<br\/>creating new scalable methods to support advanced parallel programming<br\/>models that provide rigorous guarantees on program correctness. The<br\/>societal impacts of this work stem from increasing reliability of<br\/>software powering the national infrastructure, advanced educational<br\/>methods to train future generations, and pedagogical material in the<br\/>form of course notes and software for broad dissemination. It also<br\/>helps maintain the United States in a leadership situation with<br\/>respect to the available talent pool in this area.<br\/><br\/>Providing rigorous guarantees on correctness of existing parallel<br\/>computing software requires that two classes of methods be developed,<br\/>evaluated, and taught widely: scalable code-level (static) checking<br\/>methods, and downstream detailed (dynamic) checking methods. This<br\/>project develops these novel and much-needed correctness checking<br\/>methods around the Habanero Java programming and compilation<br\/>system. The research is to augment the system with correctness<br\/>obligations emitted during compilation and checked at all later stages<br\/>of translation and deployment. A key highlight of the project's<br\/>approach is that it allows some of the correctness obligations to be<br\/>checked statically in the context of safe subsets of Habanero Java.<br\/>Obligations that are not able to be statically checked, especially for<br\/>larger subsets of the Habanero language, are marked for checking<br\/>dynamically through novel active-testing methods. An Operational<br\/>Semantics written in the Coq notation lends cohesion to the work by<br\/>ensuring that the division of correctness checking between static and<br\/>dynamic techniques is sound. In summary, this research helps advance<br\/>the science of parallel programming in terms of rigorous correctness<br\/>checking methods, while at the same time contributing to the broad<br\/>practice of programming at all scales from desktop to cloud<br\/>computing and high-end scientific simulations.","title":"CCF: SHF: Medium: Collaborative: A Static and Dynamic Verification Framework for Parallel Programming","awardID":"1302570","effectiveDate":"2013-04-15","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["557772"],"PO":["565264"]},"202188":{"abstract":"Phylogenies, or evolutionary histories, play a central role in biology as a framework within which to understand all of Life's diversity. In Charles Darwin's Origin of Species, the depiction of an evolutionary history of species took the shape of a tree. Ever since, trees have been the most commonly used structure to model evolutionary histories. However, while trees capture how, for example, one species splits into two that subsequently diversify and how genetic material is transmitted from ancestor to descendants, they fail to capture other evolutionary events. For example, some plant species arise due to hybridization between pairs of other species. In the microbial world, bacteria transmit genetic material horizontally by various means. In these cases, a tree gives an incomplete picture of the evolutionary history at best, and a very misleading one in the worst case. Indeed, a more appropriate model of evolutionary histories in these cases is a phylogenetic network, which extends the tree model by incorporating evolutionary events such as hybridization and horizontal gene transfer. Despite an increased research activity in the area of phylogenetic networks in recent years, their reconstruction and evaluation remain largely ad hoc processes and limited in their applicability to specific datasets. <br\/><br\/>To enable the development of methodologies for systematic reconstructing and evaluating phylogenetic networks, this project is aimed at developing (1) algorithms for evaluating the quality of phylogenetic networks using genomic data, and (2) algorithms for searching the phylogenetic network space to enable automatic inference of evolutionary histories. <br\/><br\/>The outcome of the proposed work will help significantly extend the applicability of phylogeny to groups of organisms for which trees are inappropriate, as well as to understand the phylogenetic network model, thus allowing for a more systematic development of methodologies for its accurate reconstruction. Further, the results will enable a more accurate reconstruction of the Tree of Life, help unravel microbial genome diversification, facilitate the reconstruction of hybridization scenarios in plants and other groups of organisms, and help understand the mechanisms by which microbes develop resistance to antibiotics. <br\/><br\/>The project provides outstanding opportunities for training graduate and undergraduate students in an interdisciplinary research area.","title":"AF: Medium: Algorithmic Foundations for Phylogenetic Networks","awardID":"1302179","effectiveDate":"2013-04-15","expirationDate":"2017-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1112","name":"Genetic Mechanisms"}}],"PIcoPI":[541859],"PO":["565223"]},"199592":{"abstract":"The drive for increased performance and functionality has pushed computer chips to their physical limits of power\/energy and reliability. Future computing systems are likely to suffer from high fault rates, undermining their programmability and usability. This research project will leverage existing techniques and invent new techniques to detect, isolate, and recover from faults and to ensure overall system resilience, with minimal impact on performance. The project taps into the rich body of past work on formal methods, which have been successful in finding logical errors in systems. Newly developed formal methods will focus on resilience enhancement. The project will also explore the inherent trade-offs between performance, power, and resilience. The project will develop an extensible platform for empirical evaluation of resilience methods. This platform will be comprised of programmable chips and accompanying software components.<br\/><br\/>This project will foster the development of new system design methods which take reliability into account. It will help fill a serious void in readily usable infrastructures for resiliency studies in the realm of parallel systems by developing and releasing tools for evaluating the methods. The project will also develop and release rigorously specified resilience-aware system interfaces. The project emphasizes student training, including student recruitment and introduction of new classes that are integrated with resilience research.","title":"Collaborative Research: Localized, Layered Formal Hardware\/Software Resilience Methods","awardID":"1255776","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["561774","561775"],"PO":["562984"]},"208106":{"abstract":"This proposal seeks support in the form of travel awards for U.S.-based graduate and undergraduate students to participate in the 14th IEEE MDM 2013 Conference, which will be held in Milan, Italy, June 3-6, 2013. The MDM series of conferences, annually organized by the IEEE society since 1999, has established itself as a prestigious forum for the exchange of innovative and significant research results in mobile data management. The conference provides unique opportunities for researchers, engineers, practitioners, developers, and users to explore new ideas, techniques, and tools, and to exchange experiences in mobile data management. Attendees will participate interactions via lively presentations of accepted technical papers, posters and demos, and invited talks given by leading academics and industry professionals of related fields. The participation of US based graduate and promising undergraduate students will result in the intellectual simulation of young minds to pursue advanced research and development activities in this area that has huge technical and societal impact, and helps U.S. keep the leading position in this vital field. To ensure a broader impact in disseminating the results of the conference, and to garner interest among young researchers in the fields of mobile data management, this award is for travel grants enabling student travel to attend IEEE MDM 2013 and the workshops to be held in conjunction with the MDM 2013. The purpose is to encourage the attendance of students who otherwise would not have the opportunity to participate in such a conference.<br\/><br\/>The allocation of the grants will be based on need and impact of the applicant?s attendance in increasing the diversity of conference participation. Minority students, students from underrepresented institutions, and students in financial need will be given higher priority.","title":"US-Based Students Support to Attend the IEEE International Conference on Mobile Data Management 2013 (IEEE MDM 2013)","awardID":"1338260","effectiveDate":"2013-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[557651],"PO":["565136"]},"201474":{"abstract":"The objective of this project is to investigate a number of challenging problems that play critical roles in enhancing the performance of social applications by taking advantage of the benefits brought by integrating cognitive radio networking (CRN) and mobile ad hoc networks (MANET). This research is motivated by the observations of (i) the lack of successful and practical applications of CRN and MANETs, though both have been extensively studied in recent years; and (ii) the benefits of integrating CRN and MANET to launch new and to enhance the performance of existing mobile social applications. In this project, graph theoretical approaches are employed to enable scalable HD video chat, to improve the performance of time-bounded information dissemination, and to enhance the privacy of information sharing among the CR-enabled devices. Moreover, network formation games are exploited to construct social-application-aware network topologies for capacity and performance enhancement; and statistical approaches are adopted to investigate the impact of topology control on social behaviors and vice version. <br\/><br\/>The expected results of this project include novel methodologies and theories to enhance the performance of existing and to enable new mobile social applications. The success of this project will have strong impact on both the theoretical and the practical aspects of social applications in the foreseen hybrid environment of CRN and MANETs. The research findings will be disseminated through high-quality publications as well as presentations in focused workshops and conferences. The project outcomes will provide guidance to and may be adopted by industry for enhancing service availability and integrity.","title":"EAGER: Supporting Social Applications in a Hybrid Architecture with CR-Enabled Devices","awardID":"1265311","effectiveDate":"2013-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560587","253923"],"PO":["565303"]},"199583":{"abstract":"A memory device may exhibit errors due to manufacturing defects, device aging, or particle strikes from cosmic-ray-induced neutrons. Memory errors are an important threat to computer system reliability as semiconductor technologies continue to scale. This project develops a new approach that protects against memory errors non-uniformly by exploiting unequal error susceptibility at different memory regions in a computer system. Collaboration with industry researchers facilitates the integration of developed techniques into real-world memory technologies. Results of this project will contribute to comprehensive computer system reliability that is critical to society and the health of the world's economy. Curriculum enhancement and student training in this project enable advanced human resource development that is necessary for today's and tomorrow's digital workforce.<br\/><br\/>Research and development efforts within this project include four synergistic components: First, this project introduces a new software approach that systematically uncovers important characteristics of memory error propagation and its consequences. Second, research develops new energy-efficient hardware support for flexible, dynamic adjustment of memory error protection on each memory area. Third, this project devises non-uniform memory error protection policies that optimize for reliability and efficiency based on software error susceptibility and hardware protection costs. Finally, the developed error susceptibility assessment and non-uniform protection techniques are evaluated using real application scenarios. Cross-layer (software\/hardware) technologies developed in this project enable wide utilization of advanced memory reliability mechanisms without significant loss of performance or energy efficiency.","title":"Software Susceptibility-Driven Non-Uniform Memory Error Protection","awardID":"1255729","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["550397","548271"],"PO":["562984"]},"199033":{"abstract":"Shrinking fabrication feature sizes and the increasing proliferation of mixed-signal and 3D integration are elevating rates of faults, variation, and aging related degradation in electronic integrated circuits, threatening the reliability of communication between processing cores in system-on-chip (SoC) architectures. The goal of this project is to realize system-level computer-aided design (CAD) automation techniques and tools to assist chip designers to trade off reliability with competing design constraints for on-chip interconnection networks within tight time-to-market constraints. This novel framework will exploit cross-layer insights about the software application, hardware intellectual property blocks, and circuits, as well as knowledge of key factors impacting susceptibility to runtime faults for network routers and interfaces. By achieving reliability goals and multi-objective design trade-offs for on-chip interconnection network fabrics with orders of magnitude lower time complexity and overhead than is possible today, this project will transform the design of multi-core SoCs that already permeate most facets of our daily lives. <br\/><br\/>The research will drive a tightly integrated education plan to inspire K-12 students toward STEM careers, ensure workforce continuity, and increase participation of veterans, undergraduates, and women via capstone projects and distance education initiatives. A new course on fault tolerant chip design will be created and existing courses on computer architecture and embedded systems will be enhanced with reliability-centric components. By exposing graduate students to diverse aspects of CAD algorithms, SoC architectures, and parallel applications, the educational component of this project will contribute to an agile high-tech workforce that will maintain continued US leadership in technological innovation.","title":"Cross-Layer Fault Resilience for Interconnection Networks in Multi-core SoCs","awardID":"1252500","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8081","name":"Failure Resistant Systems(FRS)"}}],"PIcoPI":["542087"],"PO":["562984"]},"199297":{"abstract":"Data from customers become central to many companies' business, and tomorrow's society's progress critically depends on scientists and public decision makers accessing citizens' data. But how to reconcile progress with privacy? This dilemma, everyday, is getting worse, because we lack an abstraction where analytics -- the science of identifying and exploiting individual types and trends -- are transparent to users and they can effectively own and trade their data. Today's analytics on proprietary data, and its highly debated need for regulation, seems a necessary evil for a lack of credible alternative. This project aims at unlocking this tussle by (1) building behavioral analytics that are compatible with distributed systems of personal data, (2) showing how context and social influence can be better leveraged, and (3) enabling incremental deployment along mutual benefits to make privacy economically efficient. <br\/><br\/>The principal investigator will explore a new abstraction -- Behavioral Networks -- and show its tractability using recent results in matrix factorization, algorithms exploiting social influence, and analysis of networked incentives. Banalytics will demonstrate its applicability to various analytics tasks, including data collection, behavioral targeting, content rating and recommendation. <br\/><br\/>Broader Impact:<br\/><br\/>The need to regulate proprietary access to personal data is heavily discussed towards a new Privacy Bill. Unfortunately, controlling personal data used behind closed doors is highly complex, making enforcement of top-down regulation either ineffective or potentially disastrous for the free and thriving life of the web. The Banalytics project explores and makes available alternative designs empowering users, to inform this important societal debate towards better self-regulation.<br\/><br\/>Not only are sound solutions to reconcile privacy and progress essential, but they need to be disseminated and understood broadly. Banalytics aims to impact the education of students at large -- not only future engineers but also the future journalists informing our citizens -- on the management of personal information and its technical, economic and societal aspects. Through close collaboration with the Columbia School of Journalism, the principal investigator will promote a unique interdisciplinary education program to allow all students and citizens, especially those who might not otherwise express interest in computer science, to be engaged in this effort.","title":"CAREER: Banalytics: Behavioral Network Analytics with Data Transparency","awardID":"1254035","effectiveDate":"2013-04-15","expirationDate":"2018-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["559442"],"PO":["565090"]},"201101":{"abstract":"The award establishes a new REU Site focused on the security of mobile devices at New York Institute of Technology (NYIT). Undergraduates will gain hands-on research experiences in simulating the spread of malware on mobile devices, implementing cryptographic algorithms and authentication schemes studying topology control of wireless networks, geolocating smartphones, detecting physical attacks on a network of mobile devices, and developing privacy protected sensing methods using mobile devices. Students will work during the summer with a team of experienced faculty in labs on the NYIT campus. The project includes professional development activities for students and engagement with industry. This project is co-funded by the Office of Cyberinfrastructure.<br\/><br\/>Intellectual Merit: The intellectual merit of the project is focused on the research topic which is timely and of national concern. The students will work with a team of experienced researchers in state-of-the art labs on topics that are current and relevant to the cyber trust research community. These research experiences are aimed at building a strong background for undergraduates to become researchers and motivate them to pursue graduate studies in computer science and engineering.<br\/><br\/>Broader Impacts: This project will provide hands-on research experiences in a high-demand science, technology, engineering, and mathematics (STEM) field. The project team is committed to recruiting women and underrepresented minority students for these research opportunities and to retaining them in academic and professional capacities related to STEM. Participants will collaborate with faculty, graduate students and fellow undergraduates in research teams comprised of individuals of diverse ethnic backgrounds. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Research on Security of Mobile Devices and Wireless Networks at New York Institute of Technology","awardID":"1263283","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8027","name":"Cyber Secur - Cyberinfrastruc"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[539172],"PO":["564181"]},"201123":{"abstract":"The Research Experience for Undergraduates (REU) Site project has the objectives to engage undergraduate students in interdisciplinary research that advances the state-of-the-art for creating interactive virtual experiences, with a particular focus in human-computer interaction, computer graphics, and virtual humans. Hosted by the University of Southern California Institute for Creative Technologies (ICT), students are immersed in a unique multidisciplinary community that combines academic researchers in computer science, psychology, communications, and medicine with the creative talents of Hollywood and the video game industry. The techniques and technologies advanced by ICT research projects drive the creation of compelling virtual reality environments and characters with immediate relevance to a broad range of application domains including training, education, rehabilitation, medicine, and entertainment. During the 10-week summer experience, students are also involved in weekly seminars to provide training in research methodology and the process of applying to graduate school, along with biweekly interactive workshops for team building and mentorship.<br\/><br\/>The undergraduate student cohorts are composed of a diverse palette of interdisciplinary backgrounds reflecting the multifaceted culture of the institute, with a particular emphasis on selecting individuals from underrepresented groups in computing and institutions with limited STEM research opportunities. By engaging these students in interdisciplinary research and better preparing them for graduate school, this project has the potential to broaden participation from underrepresented populations and increase enrollment and retention in graduate programs in computer science.<br\/><br\/>More information about this project can be found at the REU Site webpage (http:\/\/ict.usc.edu\/reu\/).","title":"REU Site: Research in Interactive Virtual Experiences","awardID":"1263386","effectiveDate":"2013-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":[539233,539234],"PO":["563751"]}}