{"59100":{"abstract":"This is funding to subsidize expenses of student participants in the Student Research Workshop organized in conjunction with the Association for Computational Linguistics Conference (ACL'2000), which was held October 3-6, 2000, in Hong Kong. The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing and language engineering, with two regional chapters, Europe (EACL) and North America (NAACL), of approximately equal size. The Association's annual conference, which rotates between North America and Europe, is the major international meeting in the field, and was held for the first time this year in a Pacific Rim country. The workshop format allows students sufficient time to present their research (25 minutes) and receive feedback from a panel of established researchers in the field (15 minutes). It will provide students with invaluable exposure to outside perspectives on their work at a critical time in their research, through feedback from the panel and other student participants. The ACL Student Workshop is an inexpensive yet highly effective means of encouraging young and upcoming computational linguists. The intimate format encourages the student participants to begin building a rapport with established researchers. This nurturing effort should pay dividends by more effectively guiding students in this rapidly changing research field. In addition, by building a supportive environment for these students, it is more likely that down the road they will in turn lend a supporting hand to other students who follow.","title":"Workshop: Student Research in Computational Linguistics, at the ACL'2000 Conference","awardID":"0097529","effectiveDate":"2000-11-15","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["514912"],"PO":["565227"]},"48860":{"abstract":"This project investigates the problem of simultaneous scheduling and HW\/SW mapping of the computational and communication processes in a generalized task flow graph so as to minimize the energy dissipation of the target system while satisfying a given deadline. This project also studies a number of problems related to power analysis and optimization at the behavioral and RT levels, including power modeling and characterization of Intellectual Property cores, and automatic clock gating. Finally, the project develops dynamic power management algorithms, which save power by shutting down idle devices or slowing down underutilized devices, and develops optimal policies for operating system (OS) directed power management and dynamic voltage and frequency scaling under a variety of system models","title":"System and Architectural Level Power Estimation, Optimization and Management","awardID":"9988441","effectiveDate":"2000-11-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["518663"],"PO":["562984"]},"48796":{"abstract":"This research concentrates on design of low-energy application-specific datapaths, low-energy schedules, and design tradeoffs with respect to number of datapaths, level of pipelining and scheduling approaches. Applications are to datapath design for low-energy implementation of digital signal processing and cryptography systems using programmable digital signal processors. A VLIW (very long instruction word) type programmable DSP (PDSP) is assumed. In such a PDSP, different datapaths can be independently activated through the VLIW instruction word. This research seeks modifications of datapaths in existing PDSP and design of new datapaths that do not exist in current PDSPs for low power implementations. The emphasis here is on simultaneous datapath and scheduling or software co-selection. It is important not only to design the best datapaths but also to design best scheduling approaches to reduce switching activity in the datapaths to reduce energy consumption. In the context of fixed and adaptive FIR digital filters and equalizers, the goal is to find datapaths which are best suited to transpose-form FIR filters, to use strength-reduced parallel structures to reduce the number of clock cycles and to perform scheduling by switching activity. In RLS adaptive filters for space-time adaptive processing and multi-user detection problems in wireless communications, a hierarchical scheduling approach is being explored. Here a globally parallel locally sequential partitioning approach is adopted where each partition is mapped to a distinct CORDIC datapath. Within each partition Givens' rotation operations are scheduled to reduce switching activity. In elliptic cryptosystem design, the goal is to reduce energy consumption by appropriate hardware-software codesign and parametric tradeoff analysis.","title":"Low-Energy Datapath Design for Programmable Digital Signal Processors","awardID":"9988262","effectiveDate":"2000-11-01","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550262"],"PO":["562984"]},"51194":{"abstract":"This is funding to subsidize expenses of student participants in a special poster session the PIs are organizing as part of the 18th annual International Conference on Machine Learning (ICML'2001), which will be held June 28-July 1 in Williamstown, MA (the PIs are the Program Co-Chairs of the conference). This is the premier conference for machine learning research. The PIs' goals are to integrate students into their research sub-communities and to give them a forum to talk to the leading researchers in the field about their PhD research. To this end, a poster session will be organized on one of the first nights of the conference where each sponsored student will have a poster. To ensure sufficient traffic, the PIs will require each program committee member to sign up ahead of time on the Web to see at least 5 posters that evening, on the basis of the students' abstracts. The students will also get a one page abstract submission to the conference proceedings. The PIs feel this plan has benefits over the more traditional PhD workshops organized by other conferences, as detailed in the proposal. The PIs will choose among the applicants for the scholarships, on the basis of a submitted abstract and vita plus a letter of recommendation from the student's advisor. They expect to make 30-40 awards of approximately $500 apiece. The mentoring work will be distributed among the members of the program committee. The poster session will provide students with invaluable exposure to outside perspectives on their work at a critical time in their research. This is an inexpensive yet highly effective means of encouraging young and upcoming researchers in machine learning.","title":"Workshop: Student Scholarship Program for the International Conference on Machine Learning (ICML 2001)","awardID":"0004495","effectiveDate":"2000-11-15","expirationDate":"2002-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["365889","145482"],"PO":["564456"]},"55045":{"abstract":"Conflicting trends in the requirements for system design and testing are leading to a crisis in existing design-for-test methodologies. The need for design cost reduction motivates design approaches which raise the design abstraction level, including high level core-based paradigms. While the design abstraction level rises, the currently accepted fault model is the single stuck-at model at the gate-level. Behavioral fault models are needed which enable both test and validation of complex systems. In addition, test approaches are needed target high-level fault models and achieve good validation and test coverage. This work examines how to use component-specific testability information to target pseudo-random resistant (PRR) faults. Since only a few pseudo-random resistant faults are typically the source of a disproportionately large fraction of test overhead, targeting these faults is a cost effective DFT approach.","title":"Behavioral Synthesis for Pseudo-Random Resistant Fault Detection","awardID":"0083302","effectiveDate":"2000-11-15","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["251935"],"PO":["564898"]},"55893":{"abstract":"The proposal is to request funding to support, in part, expenses incurred towards the organization and conduct of a symposium titled: Mutation 2000: Mutation Testing in the Twentieth and the Twenty First Century. This is the first symposium of its kind. Its twin objectives are: (a) To fuel research in the area of Mountain Testing in emerging software technologies. (b) To educate educators, researchers. and practitioners in the principles, technique, and use of Mutation Testing.","title":"Mutation 2000: Mutation Testing in the Twentieth and the Twenty First Century","awardID":"0086578","effectiveDate":"2000-11-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["364273"],"PO":["150697"]},"48789":{"abstract":"Asynchronous (or clockless) digital design is the focus of renewed interest, as designers face increasing challenges in future chip design. These circuits promise three important benefits: high performance, scalability and design reuse, and low power. This project is investigating two basic problems in asynchronous system design: (1) design of high-speed pipelines and pipelined datapath units (adders, multipliers, etc.), and (2) computer-aided design (CAD) algorithms and tools for the synthesis and optimization of distributed control. Multi-Giga Hertz asynchronous pipelines are being designed, where stages only communicate with their neighbors, and where timing optimizations are applied locally. Using this approach, a substantial pipelined datapath component (adder\/multiplier) is being designed, laid out and evaluated. CAD tools for asynchronous distributed control are also being developed, using new bottom-up (clustering) and top-down (partitioning) algorithms.","title":"Methodologies and CAD Tools for the Design of Asynchronous Systems","awardID":"9988241","effectiveDate":"2000-11-15","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["518562"],"PO":["562984"]},"51220":{"abstract":"The Impact Project: Determining the Impact of Software Engineering Research upon Practice <br\/><br\/>The goal of the Impact Project, an international collaboration among U.S. and European Union software engineers, is to study the impact that software engineering research has had upon software development practice. The reasons for doing this include: identifying contributions that have had substantial impact, determining research modalities that have been relatively more successful, and anticipating the directions that software engineering research might most effectively pursue, based upon its history and positioning. Impact Project research will be useful to the software engineering research and development communities, as well as to other academic disciplines, government funding agencies, and the public at large in helping with the objective assessment of the software engineering community's record of achievement. The project is to be carried out as a special initiative of ACM SIGSOFT, which will provide partial support. The research work is to be coordinated by steering committee, led by an Executive Committee. The work itself will have two organizational thrusts: 1) to seek on a technology-by-technology basis, the source of the ideas, designs, and working prototypes of widely used software technologies, and 2) to examine the ways in which software engineering research directions and areas have stimulated or been amalgamated into commonly used technologies. The output of the project will be series of documents and briefings targeted to different audiences.","title":"The Impact Project: Determining the Impact of Software Engineering Research upon Practice","awardID":"0010041","effectiveDate":"2000-11-15","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["290193"],"PO":["150697"]},"55840":{"abstract":"Abstract<br\/><br\/><br\/>Proposal: IIS-0086402<br\/>Institution: Columbia University<br\/>PI: Judith Klavans<br\/><br\/><br\/>This proposal is to fund travel for US participants to a US-Japan International workshop on digital libraries and transportation support. The planning workshop is being jointly organized by Columbia University and Kyoto University. Both institutions are leaders in digital libraries and related research. The workshop is largely by invitation and will include top researchers from the US, Japan and Europe. The goals of the workshop are to identify existing opportunities for joint research efforts, new promising research areas, and to stimulate cooperation between US and Japanese researchers and Institutions.","title":"US Participation in the Advances in Digital Libraries: Research and Practice Conference to be held in Kyoto, Japan on November 12-16, 2000","awardID":"0086402","effectiveDate":"2000-11-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["334101"],"PO":["564456"]},"55510":{"abstract":"0085344<br\/>Kalia<br\/>This award supports a Focused Research Group at Louisiana State University for research and education on computational materials. The grant is jointly supported by the Division of Materials Research and the Division for Advanced Computational Infrastructure and Research and is a blend of condensed matter physics, materials science and computer science. The objective of the research is to understand how the bonding between dissimilar materials at the atomic level determines structure and macroscopic properties such as adhesion, friction, stiffness, and fracture toughness. The research will focus on: (1) ceramic composites (SiC fibers coated with silica in a Si3N4 matrix and aluminum oxide matrix containing aluminum oxide fibers coated with LaPO4); (2) metal\/ceramic interfaces (Al\/SiC and Ti\/TiO2) and nanostructured composites of passivated metallic nanoparticles; and (3) oxidation, fracture and nanoindentation in these materials.<br\/><br\/>These applications require a methodology that can describe physical and mechanical processes over several decades of length scales. Quantum mechanical (QM) simulations based on the density functional theory will be preformed in regions where atomic bonds are formed or broken; molecular dynamics (MD) simulations will be carried out in nonlinear regions surrounding the QM region; and the finite-element (FE) approach with constitutive input from QM or MD calculations will be used in regions far away from the process zones. The QM, MD, and FE schemes will be integrated with an approach based on control theory. Algorithms will be designed to carry out these hybrid QM\/MD\/FE simulations in a metacomputing environment with multiple parallel machines, mass storage devices, and immersive and interactive virtual environments on a Grid with high-speed networks.<br\/><br\/>The Concurrent Computing Laboratory for Materials Simulation, where the research will be performed, has a record of innovative educational activities including a joint MS\/PhD program in computer science and physics. Efforts are underway for a joint masters degree in computer science and applied physics. In addition, a web-based computational physics course is being taught simultaneously at LSU and the Delft University of Technology in The Netherlands. As part of this grant, a workshop will be established to mentor and recruit minority students.<br\/>%%%<br\/>This award supports a Focused Research Group at Louisiana State University for research and education on computational materials. The grant is jointly supported by the Division of Materials Research and the Division for Advanced Computational Infrastructure and Research and is a blend of condensed matter physics, materials science and computer science. The objective of the research is to understand how the bonding between dissimilar materials at the atomic level determines structure and macroscopic properties such as adhesion, friction, stiffness, and fracture toughness. <br\/><br\/>The Concurrent Computing Laboratory for Materials Simulation, where the research will be performed, has a record of innovative educational activities including a joint MS\/PhD program in computer science and physics. Efforts are underway for a joint masters degree in computer science and applied physics. In addition, a web-based computational physics course is being taught simultaneously at LSU and the Delft University of Technology in The Netherlands. As part of this grant, a workshop will be established to mentor and recruit minority students.<br\/>***","title":"FRG: Multiscale Simulation of Atomistic Processes in Nanostructured Materials","awardID":"0085344","effectiveDate":"2000-11-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["490009","490010","490011"],"PO":["145396"]},"52676":{"abstract":"Embedded systems comprising many interconnected microprocessor-based controllers play an increasingly important role in daily life. They are typically systems-on-a-chip (SOCs), which are customized for complex applications, and are required to be inexpensive, available and safe. A key characteristic of SOCs is their extensive use and reuse of standard hardware and software modules referred to as intellectual property (IP). This project investigates the basic properties and design requirements of IP-based embedded systems that have stringent safety and availability goals. It focuses on the problems of low-cost monitoring of system operation in real time to ensure that prescribed design objectives are met.","title":"On-Line Monitoring of Safety-Critical Embedded Systems","awardID":"0073406","effectiveDate":"2000-11-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["549712"],"PO":["562984"]},"55924":{"abstract":"Abstract:<br\/>DMS-0086688 <br\/>PI: Fienberg, Stephen E<br\/><br\/>A special international conference, \"Foundation of Statistical Inference: Applications in the Medical and Social Sciences and in Industry and the Interface with Computer Science\", will be held in Israel at the conference center at Kiryat Anavim near Jerusalem, on December 17-21, 2000. This conference brings together leading experts in statistics and its applications to discuss both the issues in the foundations of inference and their relevance to the many and varied uses of statistics in the medical sciences, the social sciences, and in industry. A similar conference was held in December 1985. A special focus at this conference will be on the interface between statistics and computer science. Funding will provide travel support for approximately 20 U.S. primarily new researchers and members of underrepresented groups, and invited speakers and participants. The KCS Program in the CISE directorate and the MMS Program in SBE directorate is providing co-funding along with the Statistics Program in MPS.","title":"International Conference on the Foundation of Statistical Inference: Applications in the Medical and Social Sciences and in Industry and the Interface with Computer Science","awardID":"0086688","effectiveDate":"2000-11-15","expirationDate":"2003-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}}],"PIcoPI":["493252"],"PO":["544672"]},"87407":{"abstract":"Prediction and predictability of optimization heuristics are at the foundation of convergent, top-down system synthesis. Not knowing how a heuristic behaves on various types of relevant instances makes accurate modeling, and hence predictability, difficult. This project is exploring basic ideas that can lead to improved understanding of predictability of heuristic algorithm behavior within top-down physical design. The project first develops a new methodology and criteria for characterizing the operation of given (iterative, combinatorial) heuristic functions, and how the application context and use model define requirements for the design, implementation and evaluation of the heuristic. The project also explores principles for developing predictors of a given heuristic's output, based on understanding of the heuristic and its context. Finally, in the context of a multi-stage optimization (\"design flow\"), the project addresses means of abstracting objectives that can be effectively optimized from downstream parameters of the design state.","title":"Toward Predictors and Predictability: Closing the Loop-Down Physical Design","awardID":"0330867","effectiveDate":"2000-11-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["522496"],"PO":["562984"]}}