{"75927":{"abstract":"Abstract<br\/>The coming generation of tetherless communication technology promises a giant leap forward in information<br\/>accessibility. Advanced features of the so-called fourth-generation wireless systems and beyond, such as data rates compatible with multimedia applications, will enable many emerging applications not possible with current wireless systems. However, it is not at all clear how wireless receivers should be optimally designed to meet the technical challenges introduced by the wider bandwidths and higher data rates inherent in the future wireless systems. It is generally believed that the real niche for future wireless receivers lies in the development of adaptive systems to perform sophisticated signal processing functions. But, at this time there is a lack of concrete principles that can be used to design these futuristic receivers. It is important at this stage to acquire the insights and theoretical tools that may help spark revolutionary breakthroughs in this field.<br\/><br\/>Investigation of design methodologies of adaptive Bayesian receivers in single-user and multiuser fading channels is proposed. The approach is to formulate the problems of signal reception in unknown time-varying channels as multivariate Bayesian inference problems. Sequential Monte Carlo filtering methods, the relatively simple but extremely powerful numerical techniques recently developed in the field of statistics, will be employed to develop adaptive systems for computing the Bayesian estimates of the channels and data. An array of receiver design problems found in wireless communications, such as mitigation of various types of radio-frequency interference (including multiple-access interference, narrowband interference, impulsive noise), tracking of fading channels, resolving multipath channel dispersion, space-time processing by multiple antennas, exploiting coded signal structures, etc., will be treated under the unified framework of sequential Monte Carlo Bayesian estimation. The theoretical effort in this project is expected to culminate in the formulation of novel receiver design concepts applicable for future wireless systems.","title":"Adaptive Bayesian Receivers in Fading Channels: A Sequential Monte Carlo Filtering Design Paradigm","awardID":"0225826","effectiveDate":"2002-01-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["475040"],"PO":["223414"]},"62738":{"abstract":"This collaborative research project will examine how some of the techniques that have been used for English text recognition can be used with enhanced technologies for OCR of Indian language documents. The proposal will create data resources for testing and evaluating Devanagari recognition systems. Devanagari is the script used by a number of Indian spoken languages, prominent among which are Sanskrit, Hindi and Marathi. It is an alphabetic script, used by over 450 million people around the world. The research will be carried out by teams from the Center of Excellence for Document Analysis and Recognition at SUNY-Buffalo and the Indian Statistical Institute. The project is expected to result in new tools for Devanagari and to stimulate research in other areas of script recognition for NLP, document analysis and information retrieval.<br\/><br\/>--","title":"Creation of Devanagari Data Resources and OCR Technology Interchange","awardID":"0112059","effectiveDate":"2002-01-15","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["548306"],"PO":["433760"]},"75907":{"abstract":"There is at present a worldwide effort to develop next-generation wireless communication systems. It is envisioned that many of the future wireless systems will incorporate considerable signal processing intelligence in order to provide advanced services such as multimedia transmission. In general, wireless channels can be very hostile media through which to communicate, due to substantial physical impediments, primarily radio-frequency interference and the time-varying nature of the channel. The need to provide universal wireless access at high data rates (which is the aim of many emerging wireless applications) presents a major technical challenge, and meeting this challenge necessitates the development of advanced signal processing techniques for multiple-access communications in non-stationary interference-rich environments.<br\/><br\/><br\/>This research involves the development of adaptive signal processing algorithms and architectures for application in future wireless communications systems featuring high user mobility, high data rate and high quality of service. The primary emphases of this research are on advanced receiver signal processing techniques, and on advanced transmitter signal processing techniques for wireless systems. The first of these focuses on developing adaptive signal reception techniques for jointly combating various impairments in time-varying wireless channels, such as radio-frequency interference (narrowband interference, multiple-access interference, impulsive ambient noise), multipath fading, channel dispersion, etc. A particular approach that will be examined in depth is the exploitation of the redundancy introduced by channel coding at the receiver for interference mitigation and channel tracking. The second addresses adaptive signal transmission techniques in time-varying wireless channels for improving network capacity. Specifically, adaptive antenna array transmission techniques and adaptive frequency hopping techniques are being studied, with the focus on rapid adaptivity to dynamic channel environments. This research is expected to culminate in the formulation of novel signal processing techniques and system design concepts applicable to future wireless communication systems. It is also anticipated that this research will influence many current and next generation communication systems planners and designers, to bring the promise of many new research techniques into the arena of wireless communications.","title":"CAREER: Adaptive Signal Processing for Coded Time-Varying Wireless Multiple-Access Communications Channels","awardID":"0225721","effectiveDate":"2002-01-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["475040"],"PO":["564898"]},"67082":{"abstract":"EIA-0131835<br\/>Guach, Susan<br\/>University of Kansas Center for Research Inc.<br\/><br\/>BDEI: Biodiversity Information Organization using Taxonomy (BIOT)<br\/><br\/>Summary<br\/><br\/>Biological resources are the basis of much of this Nations prosperity. The wise<br\/>stewardship of these riches affects current and future generations and, therefore, must be<br\/>rooted in decisions based on the best information available. Because of the rapid growth<br\/>of all content on the Internet, there is a corresponding increase in online biological<br\/>information of all types. However, the sheer volume of data, and its widely varying<br\/>quality and physical distribution make it impossible for decision makers to make critical<br\/>decisions without the benefit of the existing body of information. This project aims to<br\/>investigate and develop intelligent knowledge management tools and deploy them in this<br\/>important domain. In particular, we will investigate the use of a taxonomy as a reference<br\/>ontology to provide a conceptual framework to allow intelligent agents to browse<br\/>biodiversity information in a variety of formats widely distributed on the World Wide<br\/>Web.<br\/><br\/>Our goals are four fold: 1) to investigate the use of a taxonomy as a reference ontology<br\/>for browsing biodiverity information; 2) to evaluate techniques to automatically classify<br\/>biodiversity information (web sites and individual web pages; 3) to personalize the<br\/>information presented to the users expertise and needs; and 4) lay the groundwork for<br\/>larger, multidisciplinary, efforts in intelligent search, visualization, and personalization of<br\/>biodiversity information.<br\/><br\/>This project proposes to build on existing work currently being done at the University of<br\/>Kansas related to information discovery, retrieval, and delivery, particularly the<br\/>OBIWAN project for ontology based search, browsing and visualization of Web<br\/>resources and the PEET project for preserving and extending biodiversity information. A<br\/>partnership has already been established between the University of Kansas and the<br\/>National Biological Information Infrastructure (NBII) to capitalize on the knowledge,<br\/>expertise, and tools that have grown out of the existing University of Kansas NSF<br\/>research agreement. As a result of this partnership, the first intelligent search agent for<br\/>biodiversity information, BioBot, has been developed.","title":"Biodiversity and Ecosystem Informatics (BDEI): Biodiversity Information Organization Using Taxonomy [BIOT]","awardID":"0131835","effectiveDate":"2002-01-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["265176","468587"],"PO":["371077"]},"69063":{"abstract":"EIA-0140304 -Salvatore Stolfo-Columbia University-SGER: Mitigating Access Risks of Browsing Government Data and Websites by Secure Private Portals<br\/><br\/>This proposal from a computer scientist and a social scientist will study the social and policy implications and citizen perceptions of government gathering of Personally Identifying Information through Federal web sites, and will explore the use of alternative privacy-enhancing technologies. These technologies will be evaluated and further developed. Initial discussions with several interested Federal Government agencies have already begun.","title":"SGER: Mitigating Access Risks of Browsing Government Date and Websites by Secure Private Portals","awardID":"0140304","effectiveDate":"2002-01-01","expirationDate":"2004-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["431190","377649"],"PO":["371077"]},"77280":{"abstract":"Abstract<br\/><br\/>Computational Complexity in Combinatorial and Algebraic Models<br\/><br\/>A fundamental goal of research in theory of computing is to understand the inherent computational complexity of specific problems. Progress in computational complexity is essential to establish limits to efficiency of algorithms, to understand the role of randomness in computation, and to build rigorous foundations for important areas such as cryptography and machine learning. This research program will study complexity questions in several combinatorial and algebraic models of computation. In particular, this research will develop lower bound techniques for these models based on linear algebra, communication complexity, and graph theory. Specific directions of research proposed are<br\/><br\/>1. Robustness Functions of Matrix Rank and their Applications: broad classes of functions that describe the robustness of the rank of a matrix have wide-ranging applications in computational complexity. In particular, several such functions can be used to attack lower bound problems on Boolean and algebraic circuits, decision trees, branching programs, and communication complexity. Known results by the PI and other researchers also indicate that spectral methods provide a unified approach to understanding rank robustness. This project proposes to extend these techniques and apply them to study combinatorial and algebraic complexity. Some alternative approaches that may overcome certain technical barriers faced by existing methods are also studied.<br\/><br\/>2. Multiparty Communication Complexity: This fundamental model has applications to the complexity theory of circuits, branching programs, and time-space trade-offs. Some weaker models of multiparty communication complexity have recently been investigated due to their continued relevance to circuit complexity and the apparent hope for stronger lower bounds. This project will study the relative strengths of the various multiparty models and their connections to complexity theory. General techniques such as discrepancy bounds and tensor rigidity will be explored to attack lower bound questions in these models. Recent discoveries of unexpected upper bounds in this area with critical consequences to some lower bound approaches motivate several new questions. <br\/><br\/>3. Graph Theoretic Approaches to Boolean Function Complexity: A combinatorial model that generalizes the models of both Boolean circuits and two-party communication complexity is obtained by considering computations on graphs. The research will explore the effectiveness of some graph-theoretic techniques to Boolean complexity using the framework of this model. In particular, various linear algebraic representations of graphs, with potential applications to other areas, will be studied to derive lower bounds on graph complexity that may have consequences to circuits. A unifying theme among these three topics is the use of communication complexity techniques to attack lower bound questions in computational complexity. Furthermore, each of these topics provides potential approaches to attack some long-standing open questions in computational complexity such as superlinear size lower bounds on log-depth circuits and ACC circuits. More generally, the research will advance the technology for lower bounds by targeting less restricted and\/or more abstract models than those for which strong lower bounds are currently known. Techniques developed in these topics give rise to mathematical problems that have wider interest to other branches of theoretical computer science such as algorithms and cryptography as well as to subjects like linear algebra, combinatorics, and graph theory.","title":"Computational Complexity in Combinatorial and Algebraic Models","awardID":"0232380","effectiveDate":"2002-01-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[201665],"PO":["499399"]},"67173":{"abstract":"This proposal will support two workshops between Chinese and US researchers in the digital library area, to work towards a major international collaboration in the creation of a very large digital book collection. The workshops will provide coordination in scanning technology, the choice of materials to be scanned, the organization of the delivery of the material to be scanned, and the disposition of the resulting digital content.","title":"Proposal for a Planning Workshop for the Proposed US-China Million Book Project","awardID":"0132183","effectiveDate":"2002-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["355022","461693"],"PO":["433760"]},"67174":{"abstract":"This is a proposal to fund two workshops to bring together computer science and digital library researchers from the US and India, to forward the work of the \"million book project\". It is important to maintain coordination between the countries so that the international collaboration is maintained and the work can proceed in a unified and most productive way. The topics discussed will include scanning technology, selection of materials, and related issues.","title":"Proposal for a Workshop to Coordinate the US-India Million Book Digitization Project","awardID":"0132184","effectiveDate":"2002-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["355022","461693"],"PO":["433760"]},"68376":{"abstract":"CCR-0137766 <br\/>Alexander Wolf <br\/>Association for Computing Machinery<br\/><br\/>The Impact Project will identify and document research contributions that have had substantial impact, determine the research modalities that have been successful, identify technology transition approaches that have worked best, and anticipate directions that software engineering research might most effectively pursue, based on its history and positioning. Funding will support travel costs for a series of meetings to plan, discuss, and execute the studies. As a special initiative partially funded by the ACM Special Interest Group in Software Engineering (SIGSOFT), the project seeks to be highly inclusive, involving a large number of members of the software engineering community, as well as others whose interests overlap with software engineering. The project's outputs will be a series of documents and briefings, including scholarly, reports. Project results should be useful to the software engineering research and practitioner communities, to other academic disciplines, to government funding agencies, and to the public by helping objectively assess the software engineering community's record of achievement.","title":"The Impact Project: Determining the Impact of Software Engineering Research Upon Practice","awardID":"0137766","effectiveDate":"2002-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["536737","290193"],"PO":["564388"]},"67452":{"abstract":"0133554<br\/>Guskov, Igor<br\/>U of MIchigan-Ann Arbor<br\/><br\/>Medical imaging systems and computational modeling of physical processes produce vast amounts of surface data for analysis and visualization purposes. Often such data are time-dependent and describe surfaces that evolve in time, for example, a developing interface between two fluids or moving walls of the heart ventricles. This project will develop processing tools for such dynamic surface data. In particular, massively redundant and noisy raw data coming from applications will be converted into compact form useful for extensive interactive manipulation, especially within remote collaboration environments. The developed technology will also be useful for applications in tele-presence and animation. This research effort will be integrated with educational initiatives via student involvement in research projects, development of new curriculum in Digital Geometry Processing, and collaboration with external researchers.<br\/><br\/>The focus of this project will be on converting raw application data into hierarchical surface representations that are temporally coherent and spatially (semi-)regular, and further processing and compression of the constructed data representations. Specifically, a sequence of irregular meshes produced by a frame-by-frame marching cubes extraction of isosurfaces from a time-dependent volumetric field is an example of geometric data that cannot be efficiently processed without first establishing temporal coherence and spatial regularity of the surface sampling. The development of a fully automated compression system for dynamic geometry in this scenario will include the following components: constrained parameterization method for establishing temporal coherence of surface sampling, patch layout generation and maintenance routine to deal with possible topology changes, efficient topological event detection procedure, predictive coding of dynamic geometry streams, geometric and topological denoising of raw application data, and possible integration of the regular mesh extraction into the simulation (or shape acquisition) environment. The developed technology will also be useful in the areas of scientific visualization and computer aided geometric design.","title":"CAREER: Signal Processing Tools for Dynamic Geometry","awardID":"0133554","effectiveDate":"2002-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[174832],"PO":["321058"]},"66374":{"abstract":"This Small Business Innovation Research Phase I project will develop software tools allowing educators, interpreters, and linguists skilled in American Sign Language (ASL), but not skilled in computer 3-D animation, to create fully grammatical synthesized ASL to provide access for Deaf and Hard of Hearing individuals to Internet web pages and CD-ROM based interactive media; and to create interactive courses for learning ASL. While this project will build upon Vcom3D's commercial SigningAvatar(TM) product, a signficant advance is proposed. The current SigningAvatar(TM)technology allows users to generate unique sentences in Signed English thus providing partial access to digital media. However, the absence of many elements of ASL grammar limits the use of SigningAvatar(TM) by the larger segment of the Deaf and Hard of Hearing population who require grammatical ASL for comprehension and for ASL courses.<br\/> This project addresses the numerous requests to provide fully grammatical ASL that Vcom3D has had from the Deaf community. The resulting ASL products will significantly reduce federal costs of public school education for Deaf children and will move toward improving universal access and equity of service goals, as mandated by the Americans with Disabilities Act; Section 508 of the Rehabilitation Act; and Section 255 of the Telecommunications Act.","title":"SBIR Phase I: Software Tools for Authoring American Sign Language","awardID":"0128372","effectiveDate":"2002-01-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1545","name":"RES IN DISABILITIES ED"}}],"PIcoPI":["233336"],"PO":["565053"]},"65033":{"abstract":"This international collaborative research project will create advanced digital library applications to adapt existing computational linguistic and data mining techniques for the special requirements associated with humanities content and build an international framework for issues such as the long-term preservation of data, metadata standards and interoperability. The results of the project will lower the barriers for researchers and students to reading classical Greek, Latin, and old Norse texts. The suite of applications envisioned include multi-lingual information retrieval capabilities, concept identification, vocabulary and syntactic parsing tools, text analysis and visualization tools, scholar-user text annotation and emendation, and related capabilities. Storage of resources and data will be in numerous locations and offer open access via the internet. This is a international collaborative effort involving multiple institutions in the US and European Union countries.","title":"Cultural Heritage Language Technologies","awardID":"0122491","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["467058","306548",168088,"412844"],"PO":["433760"]},"68564":{"abstract":"ABSTRACT<br\/>Proposal: CCR-0138554 <br\/>PI: Janos Sztipanovits (Adam Porter) <br\/>Institution: Vanderbilt University (U Md)<br\/>Title: Workshop, December 13-14, 2001, on New Visions for Software Design and Productivity<br\/><br\/>The project supports costs of travel and local arrangements for a workshop to define a future vision for Software Design and Productivity (SDP) research. The workshop is hosted by Vanderbilt University on December 13-14, 2001, bringing together 50 to 75 software researchers to discuss the directions for research over the next 10 years to improve software development productivity and quality. The participation is determined by a national call for white papers on SDP research and a review by a Program Committee established for that purpose. Successful applicants are invited to join Federal agency representatives and policy makers to identify research needs, capabilities, and shortfalls through open discussions. The final product of the project is a full report on the outcomes of the workshop that will be made available to Federal SDP R&D program managers and the community at large.","title":"Workshop on New Visions for Software Design and Productivity","awardID":"0138554","effectiveDate":"2002-01-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["564429","485900"],"PO":["564388"]},"64792":{"abstract":"The goal of this project is to research and develop high-quality, scalable, and reconfigurable acquisition<br\/>and display systems for digital library collections accessed via the Internet. We will acquire new digital<br\/>collections at the Museo de Arte de Puerto Rico and provide access to them through end-user displays<br\/>that are scalable and reconfigurable. These displays will cooperate with a remote model server to<br\/>provide the highest possible display fidelity under the current network conditions. In order to allow<br\/>the widespread acquisition and dissemination of digital collections, revolutionary advances in 3D model<br\/>acquistion, content delivery, and display are required. To thisend,we will focus on the following research<br\/>challenges:<br\/> Acquisition: we willprovide new acquisition strategies designed to produce high-quality layered,<br\/>image-based representations, 3-D shape descriptions, and multi-layerd data. These new strategies<br\/>will enable efficient access and high-resolution end-user display. hybrid representation of texture,<br\/>shape, and metadata.<br\/> Representation: we will encode the acquired collection in a way that moves toward the features<br\/>provided in the MPEG-4 multimedia standard. This encoding will preserve the richness and<br\/>fidelity of the data while achieving standardization for access, manipulation, and evolution of<br\/>collections over time.<br\/> Remote Access: we will develop new techniques supporting distributed access to digital col-<br\/>lections in a heterogeneous networked environment. These techniques will be designed to satisfy<br\/>access requirements across a spectrum that varies from very high quality local display and low-<br\/>latency interactive manipulation, to remote access over wide-area, potentially low bitrate links.<br\/> Display: we will develop new techniques for deploying scalable tiled projection displays for<br\/>institutions and users who do not have access to sophisticated and dedicated technical support and<br\/>high-cost hardware. These scalable display systems can be assembled from commodity hardware<br\/>and provide automatic, continuous calibration, and rapid reconfigurability.<br\/>The motivation for this work stems from the need for high-quality preservation, access, and display<br\/>techniques for digitized collections. Libraries, museums, and research scholars who want to acquire,<br\/>manipulate, and provide remote access to (and high-definition display of)digitized artifacts need cost<br\/>effective, non-intrusive, easily configurable methods for creating and viewing high-quality collections.<br\/>New techniques will be evaluated on real-world library collections with particular focus on the preser-<br\/>vation and dissemination of artifacts at our partner institution for this work, the Museo de Arte de<br\/>Puerto Rico . With the aid of expert consultants who will contribute significant effort towards this<br\/>project at our partner institution (see attached letter), we willdevelop and deploy a prototype system<br\/>for acqusition and display using the techniques developed as part of this project. The resulting digital<br\/>archive will be made accessible to patrons of the museum as well as a much larger audience around the<br\/>world via the Internet.<br\/>We believe that this research will have significant immediate, medium-term and long-term impact.<br\/>The immediate impact of the project will be the development of new acquisition, access, and display<br\/>methods that will be deployed and tested at the Museo de Arte de Puerto Rico, making parts of their<br\/>collections available in forms not previously possible. In the medium term, our new technical approaches<br\/>will be valuable not only to the digital library community, but also to other research, instructional, and<br\/>commercial areas where configurable large-scale display systems are needed (e.g., classroom, research<br\/>visualization centers, conference venues, etc). In the long term, we believe this proposed work has<br\/>the potential to substantially impact the way people view and interact with data, whether the data is<br\/>a collection of historical artifacts, a visual representation of a complex simulation, data\/illustrations<br\/>presenting in the classroom, etc. Moreover, the cost effectiveness of our approach means that it will be<br\/>affordable to a wide range of users.","title":"ITR\/SY+AP: Acquisition, Representation, and Remote Visualization of Digital Artifacts","awardID":"0121438","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["530999","483390","494196","359059"],"PO":["7594"]},"66772":{"abstract":"EIA-0130400<br\/>Robert Joynt<br\/>University of Wisconsin-Madison<br\/><br\/>Title: Connecting the Quantum Dots; Theory of Quantum Computing in a Solid-state Implementation<br\/><br\/>A program of theoretical research on quantum computation in quantum dot structures is underway. In this type of quantum computer, the qubits are the spins of electrons trapped in a silicon-germanium semiconductor heterostructure. The error distributions and decoherence properties of these electrons are being calculated, and it appears that correlated errors and mutual decoherence are important in this dot implementation. The impact of these phenomena on quantum algorithms and quantum error correction schemes is being investigated. This is done by examining their effect in two paradigmatic quantum processes. The first is the quantum random walk, a simple example of an algorithm that can be implemented on a one- or two-dimensional array of quantum dot qubits. The second is the computation of the majority function. A particularly attractive feature of both problems is that it is interesting and feasible to do them in cases that require relatively few qubits. More general questions are also being addressed. Certain types of quantum algorithms will be more susceptible to certain types of errors. This leads to the possibility of quantum error-resistant algorithms, and the feasibility of this generalization of the similar classical concept is being determined.","title":"Quantum -QuBIC: Connecting the Quantum Dots: Theory of Quantum Computing in a Solid-state Implementation","awardID":"0130400","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["505142","321051","366659","512529","565082"],"PO":["565223"]},"67487":{"abstract":"This project involves the research, development, and dissemination of techniques and tools necessary to perform rigorous, systematic processor design-space exploration. The key element is a framework in<br\/>which architectural simulators and targeted compilers are automatically derived from a common architectural description, providing architects, microarchitects, and compiler developers with a<br\/>dynamic, yet coherent, environment within which to design processor systems. Such a system would enhance productivity and design quality by tightening the loop between architectural decision-making and<br\/>realistic performance feedback and by allowing for more productive collaboration among the members of a prototyping team. The resulting reduction in design cycle times will counter increasingly restrictive<br\/>market pressures, safeguarding the practicality of designing both new general-purpose microprocessors and application-specific processors (ASIPs), such as those found in networking hardware, cellular<br\/>telephones, and next-generation digital devices. Additionally, this research will provide invaluable experiences for both undergraduate and graduate students in computer architecture and compilers. This<br\/>same system is an ideal mechanism by which students can interact with tangible examples of computer architecture and compiler concepts -- it will allow them to rapidly prototype systems, experiment with new ideas, and thereby build intuition about computer systems.","title":"CAREER: Systematic Design Space Exploration","awardID":"0133712","effectiveDate":"2002-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["511660"],"PO":["550859"]},"75870":{"abstract":"ABSTRACT<br\/>Proposal: 0073259<br\/>PI: Gyungho Lee<br\/>Title: High-Bandwidth Memory Pipeline for Wide-Issue Processors <br\/> <br\/>Technological and architectural innovations have enabled development of powerful microprocessors that can issue several instructions concurrently at a very high clock rate. In future processors with aggressive speculation techniques, an even larger number of instruction issues per cycle are expected. Efficient handling of memory references for data access is one of the keys to achieving high performance in future processors. This research addresses methods to provide sufficient bandwidth at fast latency for data access in wide-issue processors issuing tens of instructions per cycle. The methods are based on the concept of \"data decoupling\". Data decoupling divides the memory reference instructions into multiple independent streams before the actual addresses of the data they access are known. Partitioned memory reference instructions are then fed into a separate memory pipeline. This research investigates the issues in effective and efficient hardware and software support for multiple memory pipelines based on data decoupling. The data decoupling approach of providing multiple memory pipelines can provide two crucial advantages over a conventional design. First, the cost and the complexity of building a large cache with many ports are reduced. Second, partitioning memory references can facilitate more specialized handling of each partitioned stream.","title":"High-Bandwidth Memory Pipeline for Wide-Issue Processors","awardID":"0225561","effectiveDate":"2002-01-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["316670"],"PO":[197478]},"66795":{"abstract":"As we approach 100nm technology, the impact of interconnect on signal integrity is becoming one of the main concerns in testing gigahertz system-on-chips (SoCs). Voltage distortion (noise) and delay violations (skew) contribute to signal integrity loss and ultimately functional error, performance degradation, shorter life and reliability problems. This research investigates a methodology to model and test signal integrity in deep-submicron high-speed interconnects that bind the internal cores in a SoC. The following issues are being explored: a) the development of a unified integrity fault model, independent of technology, that includes various problems occurring on the SoC's high-speed interconnects such as crosstalk, overshoot, skew, etc.; b) the establishment of a test generation technique that finds test patterns to stimulate maximal (worst case) integrity loss on the interconnect network; c) the implementation of noise detector (ND) and skew detector (SD) cells, to detect noise and skew violations (integrity loss) over a period of operation; and d) the design of a cost- and time-efficient readout architecture to transfer the integrity information that ND and SD cells accumulate. As part of educational plan, we are: 1) developing a two course sequence on ASIC\/SoC design and test with emphasis on high-frequency issues; 2) involving undergraduate students in general, and minorities in particular, in VLSI\/ASIC\/SOC test research. 3) advocating for greater CAD tool use in early stage of CE\/EE curriculum.","title":"CAREER: Signal Integrity Fault Modeling and Testing in High-Speed SoCs","awardID":"0130513","effectiveDate":"2002-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["532154"],"PO":["562984"]},"65233":{"abstract":"Proposal #0123409<br\/>Adali, Tulay<br\/>U of Maryland-Baltimore County<br\/><br\/>Within the last fifteen years, the maximum data rate that a backbone communications line can handle has grown by five orders of magnitude. A key enabling technology for this impressive growth has been the<br\/>advent of commercial wavelength-division-multiplexed systems that has allowed systems designers to fill the available bandwidth far more efficiently than in the past. Recently, the physical impairments<br\/>in the optical fiber transmission lines have become the major factors limiting the obtainable data rates. The chromatic dispersion, fiber nonlinearities, polarization effects, and amplified spontaneous<br\/>emission noise from the amplifiers, all interact limiting the data rates and\/or transmission distances. Polarization mode dispersion (PMD), in particular, introduces intersymbol and intercarrier interference and is the primary limitation in increasing transmission rates and distances in installed terrestrial fiber systems. Though it has been noted that signal processing approaches hold great promise for mitigating PMD <br\/>and other impairments in optical communications systems, the area is still in its infancy, and the current activity in the area is limited to ``off-the-shelf'' techniques that do not take into account characteristics of the optical domain, thus unable to truly take advantage of the possibilities that signal processing offer.<br\/><br\/>By bringing in expertise from two complementary research areas: signal processing for communications and optical communications, this research develops effective electrical domain (post-detection) <br\/>approaches for optical communications by taking into account the physical properties of the optical transmission medium. The investigators introduce a new class of receiver structures for <br\/>optical communications that exploit polarization diversity and study their performance by accurate modeling of the physical phenomena and using efficient simulation techniques that they have developed.<br\/>The two research groups have expertise in both areas relevant to the proposed work: (1) theoretical and computational study and modeling of optical communication systems and (2) development of error<br\/>compensation\/mitigation techniques for communications. Their collaboration within the last couple of years has demonstrated the potential of solutions developed with this approach for significant <br\/>performance gains in optical communications systems. An important additional benefit of the project is establishing meaningful communication between the two research communities and the emphasis <br\/>on the importance of their full collaboration. The research also offers the potential for a more unified view of communications systems.","title":"Ultra-High-Capacity Optical Communications and Networking: Signal Processing for High-Data-Rate Optical Communications Systems","awardID":"0123409","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["529108","486076"],"PO":["564898"]},"67554":{"abstract":"Speculative execution has been widely used in computer architecture<br\/>research in the pursuit of higher levels of instruction level<br\/>parallelism. However, recent studies have shown that this technique<br\/>can significantly impact the scalability of the processor pipeline.<br\/>This research will investigate a number of speculative techniques<br\/>with respect to performance, scalability, energy efficiency, area<br\/>costs, and complexity; eventually leading to a novel, scalable<br\/>architecture to provide high performance at future technology sizes.<br\/>Such an architecture will minimize the amount of logic on the<br\/>critical timing path of the processor, relying on small speculative<br\/>structures to reduce the cycle time of the processor. Off the<br\/>critical path, a variety of larger speculative structures provide a<br\/>backing store to the critical path.<br\/><br\/>Some of the techniques to be examined in this research include<br\/>branch prediction, value and address prediction, data prefetching,<br\/>early register release and late register allocation, and multiple<br\/>clustered functional units. Many of these techniques require large<br\/>and often complex predictors that can impact the cycle time and power<br\/>density of a processor. This research investigates some techniques<br\/>to reduce the access time and size of these structures, while still<br\/>providing the accuracy to avoid costly speculative recovery<br\/>procedures.","title":"CAREER:The Evaluation and Design of a Scalable, High Performance and Energy Efficient Microprocessor Architecture","awardID":"0133997","effectiveDate":"2002-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["417551"],"PO":["550859"]},"66763":{"abstract":"EIA-0130383<br\/>Franco Nori<br\/>University of Michigan Ann Arbor <br\/><br\/>Title: Quantum Computing with Superconducting Qubits<br\/><br\/>This project is exploring quantum computing based on superconducting Josephson quantum bits (or qubits) coupled through microwave fields. More specifically, the quantum dynamics of a Cooper-pair box with a superconducting loop, as well as the flux-based qubit, in the presence of either classical or non-classical microwave fields are being investigated.<br\/><br\/>The control of quantum coherent Rabi oscillations in a superposition of two charge states, for both single-and multi-photon processes are being studied. Under this project very novel quantum computing schemes for Josephson qubits coupled through photons, including the implementation of quantum communications between qubits is being investigated. The local gate voltages and a microwave field can be used to control the device, which should be scalable to at least 10^8 qubits. Thus ways to implement scalable and well-controlled quantum computers, which are expected to be capable of performing certain tasks which no classical computers can do in practical time scales are being investigated. Indeed, the Cooper pair box is a viable candidate for the implementation of quantum gates since it is a macroscopic two-level system that can be coherently controlled. Finally, young researchers are being trained in the fast growing area of quantum computing.","title":"Quantum -QuBIC: \"Quantum Computing with Superconducting Qubits\"","awardID":"0130383","effectiveDate":"2002-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["346742"],"PO":["521045"]},"66896":{"abstract":"EIA 0130900-Michael Arbib-Biological Information Technology Systems-BITS: Neural Computing, Round 3 <br\/><br\/>There have been two main rounds of neural computing to date, the first focusing on adaptation and self-organization, the second on compartmental modeling of the neuron. This project will catalyze a third round of neural computing: Analyzing the architecture of the primate brain to extract neural information processing principles and translate them into biologically-inspired operating systems and computer architectures. This project will focus on analyzing and further developing computational neuroscience models concerned with grasping, recognizing and executing actions, and describing those actions with language, in terms of basic information processing principles. The intention is to create a new research effort, applying the latest advances in computational neurobiology to the design of a new generation of machines. In particular, the proposed research will catalyze research and development of unusually robust, versatile, and adaptive computer architectures, that can easily adapt, correct themselves, and blend diverse styles of processing.","title":"Biological Information Technology Systems - BITS: Neural Computing, Round 3","awardID":"0130900","effectiveDate":"2002-01-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["560350","549488",173452,173453],"PO":["565223"]},"77797":{"abstract":"This research investigates how changes in illumination, pose, and shape of an object produce changes in the observed images. The central idea is that the variability in the images of an object can be decomposed into component parts - illumination, pose, and shape - each of which, when analyzed separately, is well behaved. This paradigm, termed ``Image Variability Decomposition,'' differs substantially from the appearance-based paradigm in that by decomposing the variability, one is able to uncover generative structures to the set of images over each source of the variability. Thus, unlike appearance-based methods, it is not necessary to have seen the object under all of the seemingly infinite possible permutations of lighting conditions, pose, and shape. Instead, each component of the image variability is explicitly modeled. This research is applied to problems in which this variability plays an important role: face recognition, change detection, structure from motion, and visual tracking. The education component of this award focuses on laboratory and project intensive teaching. Students, both graduate and undergraduate, are not only taught about known unsolved problems, but are encouraged to consider posing new problems in computer vision, robotics, and pattern recognition. Students are also rewarded for finding new applications in new domains. The education activities will center around the construction of a computer vision laboratory within Yale University's newly formed Center for Computational Vision and Control, the design of laboratory intensive courses on both computer vision and pattern and object recognition, and the completion of a textbook on computer vision.","title":"CAREER: Image Variability Decomposition for Recognition, Reconstruction, and Tracking","awardID":"0234606","effectiveDate":"2002-01-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["519250"],"PO":["234178"]},"67556":{"abstract":"0134002<br\/>Papandreou-Suppappola, Antonia<br\/>Arixozona State University<br\/><br\/>CAREER: Time-Varying Signal Processing For Wideband <br\/> Wireless Communications<br\/><br\/>New and novel signal processing and communication algorithms are required to improve the performance of wireless communications systems, and to meet major challenges that arise from the escalating demand for new higher data rate wireless technologies. These challenges include methodologies to reduce channel impairments, higher data rate and higher bandwidth requirements to provide ubiquitous access, and schemes to improve multiple access transmission. As the nature of the wireless channel is time-varying, these challenges lead to many problems such as multiple access interference and fading due to time and frequency selectivity. Thus, the channel requires two-dimensional time-frequency processing methodologies especially designed to characterize spectral changes with time. Recently, the importance of time-frequency techniques in wireless communications has successfully been demonstrated for interference suppression and channel diversity.<br\/><br\/>This research involves the development of novel time-frequency methods to address problems that surface due to the time-varying nature of the wireless channel. Specifically, these methodologies develop time-varying modulation schemes for code division and orthogonal frequency division multiple access systems, and investigate the effect of the schemes on fading distortions and multiple access interference. In addition, they design time-frequency transforms to enhance detection performance for multiple access systems and detection techniques for the new modulation schemes. They also utilize time-lag and frequency-lag techniques to jointly estimate multipath and Doppler fading parameters needed to improve detection performance at the receiver. Furthermore, they characterize wideband channels and employ the model to reduce fading and multiple access interference for broadband systems such as underwater or satellite wireless communications and third generation wideband systems. These research contributions impact the role and significance of time-varying signal processing in advancing knowledge to meet the high demands for wireless technological advances.","title":"CAREER: Time-Varying Signal Processing For Wideband Wireless Communications","awardID":"0134002","effectiveDate":"2002-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["478524"],"PO":["564898"]},"62860":{"abstract":"Information security is an issue of critical importance in communication networks. We propose a novel approach for achieving integrity,authentication and privacy among the nodes of a network. The principal challenge that we address concerns the generation and establishment of secret keys in such a network for subsequent secure encrypted communication among the nodes. Our approach, which is based on information theory, provides new insights into the problem of secret key generation, and holds promise for the development of novel techniques and algorithms in the design of cryptosystems.<br\/><br\/> An important strength of our approach, which is based on recent theoretical developments, lies in its ability to assure an enhanced level of information security. It uses a stringent notion of information theoretic secrecy or security rather than the notions of computational security and complexity-theoretic security on which all currently used cryptosystems are based. The statistical notion of information theoretic secrecy guarantees that legitimate messages and secret keys are, in effect, concealed from an adversary who is assumed to possess wiretapping and eavesdropping capabilities, and is, furthermore, not limited in terms of computational resources. This is in contrast with the existing notion of security which relies on the difficulty currently faced in solving certain underlying computational problems; recent advances in factorization into primes and quantum computing point to the potential vulnerability of cryptosystems based on this notion of security. A second important strength of our approach is that it enables a systematic study of secret key generation, at the outset and in layers, with different layers of secret keys being assigned to different subsets of nodes in the network. This feature is particularly relevant for guaranteeing information security in networks with changing topologies, particularly when some nodes are either disabled or cease to be authorized and reliable. In such situations, the surviving or remaining authorized nodes can switch from one layer of secret keys to another so as to maintain information security among themselves.<br\/><br\/> The proposed program of research addresses several important issues associated with with the aforementioned generation of secret keys in a network. A prime objective is the establishment of secret keys by means of exchanges of \"correlated\" information over insecure public channels, and through the extraction of \"common randomness\" from noisy but secure channels; such keys must be concealed from an adversary who can eavesdrop on the public channels, and may possess additional wiretapping capabilities. Explicit \\lq\\lq rate constraints\" will be imposed on exchanges between the nodes, depicting bandwidth limitations associated with the use of shared public channels, e.g., in a wireless environment. An innovative feature, and a useful technical device, involves the introduction of a \\lq\\lq helper\" node (e.g., a centralized or trusted server in a key establishment protocol)which, when appropriate, can serve to facilitate secret key generation by the nodes by furnishing them additional correlated information or computational resources. In another significant departure from current practice, secret keys will be generated using randomization methods and drawing on techniques from the multi-user information theory of source coding and channel coding.<br\/><br\/> Our proposed research is expected to lead to several significant and innovative contributions. Firstly, our information theoretic framework will provide new and valuable theoretical insights into the problem of secret key generation in a network of nodes,while complementing the current approach based on computational complexity. Second, our use of techniques for data compression and channel coding in the<br\/>design of secret keys will lead to an exploration of novel practical techniques and algorithms for secret<br\/>key generation in layers. Third, our proposed framework will afford a means for a quantitative and comparative assessment of the extent of information theoretic security provided by existing secret key cryptosystems, thereby buttressing or weakening current claims of security. An important component of the proposed work is the development of new algorithms and accompanying software for the layered generation of secret keys in a network. Finally, the proposed work will lead to potential advances in information theory through the introduction of new models and techniques.","title":"ITR\/SI(SPIII): An Information Theoretic Approach to Secret Key Generation for Encrypted Communication in a Network","awardID":"0112560","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}}],"PIcoPI":["561385"],"PO":["7594"]},"72232":{"abstract":"Funding for computer scientists in quan um information processing has come from a variety of<br\/>programs a NSF. While a new QuBIC program has been announced in he EIA division of CISE,<br\/>there is arguably a need for a focused program on quantum information processing with a direct<br\/>focus on he computer science aspects of he research. The C-CR division of CISE would be the<br\/>natural location for such a program on \"Quantum Communications, Cryptography and Coding.\"<br\/>To gauge the need and plan what migh be the scientific coverage and research agenda for such<br\/>a potential program,we plan to bring several of he leading researchers together for a planning<br\/>workshop.This workshop will lead to a five-to ten-page report that will give a detailed assessment<br\/>of the need for a new C-CR program and give a descrip ion of he research areas ha such a program<br\/>should focus on. By having a C-CR program on \"Quantum Communications, Cryptography and<br\/>Coding,\" NSF would be able to focus its efforts on he computer science aspects of quanum<br\/>information processing and greatly enhance its ability o make sure he United States keeps its<br\/>leading role in his important area. This workshop and report will be the first important step in<br\/>planning such a program.","title":"Planning Workshop: Quantum Communications, Cryptography and Coding","awardID":"0209449","effectiveDate":"2002-01-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["264120"],"PO":["188393"]},"71044":{"abstract":"EIA-0205098 <br\/>Sohn, Lydia L<br\/>Princeton University<br\/><br\/>QuBIC: : NSF Information Technology Research\/QuBIC Principal Investigators' MeetingPrinciple Investigators Conference<br\/><br\/>This workshop is designed to foster communication between the grantees of the QuBIC program, the ITR Revolutionary Computer program, and the DARPA Bio-Comp program in the areas of DNA and biomolecular computing. This workshop will be the primary forum for the exchange of research ideas, and interaction between EIA and its grantees.","title":"QuBIC: NSF Information Technology Research\/QuBIC Principal Investigators' MeetingPrinciple Investigators Conference","awardID":"0205098","effectiveDate":"2002-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["329226"],"PO":["565223"]},"67403":{"abstract":"Increasingly, confidential information is placed on network-accessible<br\/>computers by organizations and individuals, yet neither the current<br\/>practice nor theories of computer security are adequate to ensure that<br\/>this information remains confidential. The lack of sound mechanisms<br\/>for protecting confidential information, especially in the presence of<br\/>malicious code or hosts, creates serious privacy, liability, and even<br\/>national security concerns.<br\/><br\/>This research explores new security mechanisms that provide stronger,<br\/>end-to-end assurance that data remains confidential. The focus is on<br\/>three important areas where existing models are inadequate and existing<br\/>enforcement methods are impractical. First, confidentiality must<br\/>be protected even in systems that include both mutually distrusting<br\/>principals and untrusted, possibly malicious hosts. Second, concurrent<br\/>and distributed systems create new challenges for information flow<br\/>control. Third, new techniques are needed for verifying that binary<br\/>code, including legacy code, protects confidential information.<br\/><br\/>The goal of this work is fast, practical, end-to-end assurance of<br\/>confidentiality for decentralized systems with mutual distrust. This<br\/>kind of assurance promises to significantly strengthen the security of<br\/>the emerging computing infrastructure.","title":"CAREER: Practical Language-Based End-to-End Security","awardID":"0133302","effectiveDate":"2002-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["555502"],"PO":["565272"]},"64268":{"abstract":"Abstract for NSF Proposal 0118670 \"Reliable Communication Near Capacity on Nonstandard Channels.\" <br\/><br\/>In 1948 the American mathematician Claude Shannon (1916-2001) ushered in the digital age with the publication of his classic paper \"A Mathematical Theory of Communication.\" Of the many seminal ideas in Shannon's paper, perhaps the most important is the notion of channel capacity. In brief, the capacity (often called the Shannon limit) of a communications channel, is the maximum possible rate at which information can be transmitted reliably over the channel. Shannon showed how to calculate the limit but did not explain how it could be achieved practically. Since 1948, however, generations of communications researchers have made steady progress towards the ultimate goal of building practical systems that operate near the Shannon limit. An historic milestone was reached in May of 1993 with the introduction of \"turbo codes\" by a group of French researchers led by Claude Berrou. Berrou showed that turbo codes attain practically near Shannon-limit performance on an important but restricted class of channels, the Gaussian channels, which are good models for satellite and deep-space communication. This research is concerned with using the underlying turbo code ideas to extend the range of channels for which near Shannon-limit communication can be attained. The channel models to be considered include channels for optical communication, mass storage of data, and the channels encountered in cellular phone and other multi-user systems. <br\/><br\/>2. The 1993 discovery of turbo codes by Berrou et al., which was closely followed by the<br\/>rediscovery of, and improvement on, Gallager's low-density parity-check codes, and the subsequent invention of repeat-accumulate codes, has revolutionized and energized the field of error-correcting codes. However, most of this extraordinary research has been restricted to a relatively small set of standard channel models, predominantly the binary erasure channel (BEC), the binary symmetric channel (BSC), and the additive white Gaussian noise (AWGN) channel. For these channels, Shannon's Problem, viz., the problem of communicating reliably and practically at rates close to channel capacity, has now been solved. But Shannon's theorem tells us that reliable communication at rates near capacity is possible on any channel, not just the BEC, the BSC, and the AWGN. From this viewpoint, Shannon's problem has barely been scratched. It is believed, however, that the \"turbolike'' codes mentioned above (together with the associated iterative decoding algorithms) can be used, after suitable modifications, to solve Shannon's Problem on virtually any channel. Thus the object of this research is to study the effectiveness of binary \"turbolike'' codes on a variety of nonstandard channel models, including nonbinary and nonsymmetric channels.","title":"Reliable communication near capacity on nonstandard channels","awardID":"0118670","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["279563"],"PO":["348215"]},"67304":{"abstract":"Embedded software is ubiquitous: it is present in a vast array of everyday products and appliances, and it accounts for an increasing share of the functionality and development cost of systems such as cars and aircrafts. Innovation in many fields, from transportation to military, from consumer products to manufacturing, is increasingly dependent on our ability to design ever more sophisticated embedded systems.<br\/>Yet, the sophistication and complexity of embedded software is fast approaching the limit of current design abilities. This project aims at developing a formal approach to embedded software design that copes with complexity through the exploitation of design structure, and in particular, of modularity (the ability to assemble a system from components) and hierarchy (the ability to implement a complex component as a collection of simpler components).<br\/><br\/>The project is articulated in three directions. The first project direction focuses on methods and tools<br\/>for ensuring that the components used in a design are compatible one with the other. This helps to avoid bugs stemming from the interaction of multiple components, which are often among the hardest to prevent and detect. The project develops theories of component interfaces that captures the protocol, timing, and performance aspects of the interaction among embedded software components. The resulting interface theories constitute an extended type system that encompasses not only the values passed as inputs and outputs, but<br\/>also the dynamic behavior of the components, enabling to check at design time whether the components interact in a compatible way. The second project direction investigates methods for deriving the performance and reliability of a system from that of its components. In parallel to this modular approach to analysis, this project direction will pursue a modular approach to debugging, in which the components are analyzed in isolation, and the results are used to guide the simulation of the entire system. Finally, as embedded systems are often used as controllers of a device or physical system, the third project direction proposes the use of<br\/>multi-modal stochastic systems, a model that supports in an integrated fashion system identification, controller design, and code generation. <br\/><br\/>In addition to direct student involvement in the proposed research, the educational component of this proposal consists in the development of two courses: Introduction to systems engineering, and real-time embedded software. The first course will introduce students to a structured, model-based approach to system design; the second will present the techniques and challenges of real-time embedded software development. These courses will be informed by the philosophy that structure, in terms of composition and hierarchy, is the key to the design of complex systems, and that models are the basis of reasoning about systems. This model-based, structure-oriented approach is an innovative element in the curriculum generally available in Computer Engineering and Computer Science departments. The courses will play a pivotal role in the planned growth of the Software Engineering discipline at UC Santa Cruz.","title":"CAREER: Structured Design of Embedded Software","awardID":"0132780","effectiveDate":"2002-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["384064"],"PO":["561889"]},"67469":{"abstract":"The goal of this research is to use control-theoretic techniques to develop new processor-architecture mechanisms for dynamically adaptable control of power and temperature. To accurately evaluate<br\/>the effectiveness of these new mechanisms, this project will also develop more detailed models for localized temperatures within a processor and for leakage current within on-chip, memory-like structures. These models will be constructed for computationally efficient use in cycle-accurate power\/performance processor simulation.","title":"CAREER: Control-Theoretic Techniques and Thermal\/Power Modeling for Dynamically Managing Temperature and Power in Microprocessors","awardID":"0133634","effectiveDate":"2002-01-15","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["489873"],"PO":["325495"]},"66843":{"abstract":"EIA-0130724 <br\/>Philip McKinley<br\/>Michigan State University<br\/><br\/>CISE Research Resources: A Proxy-Centric Testbed for Mobile Internet Research<br\/><br\/>The Department of Computer Science and Engineering at Michigan State University will construct a state-of-the-art testbed for research in protocols and services surrounding the mobile Internet. The testbed will comprise four major components: (1) a high-performance parallel proxy cluster interconnected by a gigabit Ethernet switch; (2) new generation 802.11a wireless network components with bit rates up to 54 Mbps; (3) a wireless network analyzer that enables detailed inspection and analysis of conditions and behavior of the wireless network; and (4) a set of mobile hosts for collecting experimental data. The primary mission of the testbed is to support three research projects related to mobile Internet environments: design of new network protocols to improve the observed performance of wireless channels in transporting multimedia data; study of adaptive middleware services to support collaboration among heterogeneous mobile hosts; and the use of formal analysis techniques to support automated development and testing of interactive distributed applications.","title":"CISE Research Resources: A Proxy-Centric Testbed for Mobile Internet Research","awardID":"0130724","effectiveDate":"2002-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["472159","543568","332348","553603",173277],"PO":["557609"]},"66865":{"abstract":"EIA-0130807 Peter A. Cariani Mass Eye & Ear Infirmary Collaborative Research: Processing of Temporally-Coded Auditory Representations for Sound Separation and Localization<br\/><br\/>The proposed work investigates the use of two temporally-coded representations and temporal processing strategies for the separation of auditory objects. Two temporal representations and temporal processing strategies for the separation of auditory objects will be used. Two temporal representations of input signals will be used. These are 1) phase-locked spike train responses in a simulated auditory nerve array (Auditory Temporal Images), and 2) an auditory-inspired signal representation based on adaptive demodulation (Adaptive Demodulation and Real-Zero Conversion) that converts bandpass signals into timings of certain zero crossings.<br\/><br\/>Temporal coding through phase locking is a very general strategy for representing sensory information through the relative timings of spikes. Temporal coding is found in many sensory systems: audition (periodicity and frequency discrimination, localization, echolocation), mechanoception (flutter-vibration, localization, movement), electroception (localization), and vision (fly motion detection). The unsurpassed capabilities of biological auditory systems to separate, analyze, and recognize multiple sounds may be due to the early use of temporal codes and computations, but thus far there have been relatively few attempts to effectively exploit these time domain strategies in artificial signal processing contexts. This collaborative project will combine understanding of the neural substrates of auditory perception (Cariani) with mathematical insights and expertise in signal processing (Kumaresan) to develop new biologically inspired time-domain approaches to auditory scene analysis.","title":"Collaborative Research: Processing of Temporally-Coded Auditory Representations for Sound Separation and Localization","awardID":"0130807","effectiveDate":"2002-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[173348],"PO":["565223"]},"67503":{"abstract":"Abstract:<br\/>With the virtual completion of the human DNA sequence<br\/> research attention has shifted to issues including the resolution of the<br\/> genetic composition, evolutionary history, and health impact of portions<br\/> of the human genome which have proven difficult<br\/> to sequence due to their duplicative and dynamic nature.<br\/>The proposed research aims to address these problems through<br\/> the development of algorithms and software tools for<br\/> discovery, resolution and evolutionary analysis of genomic<br\/> duplications and other genome-wide segmental<br\/> rearrangements.<br\/>The ultimate goal is to help understand mechanisms for<br\/> and the sources of genetic disposition to<br\/> genome-wide structural rearrangements.<br\/>Some of these structural rearrangements are known to cause dosage<br\/>imbalance<br\/> of developmentally important genes during recombination events; as a<br\/> result, genomic diseases, including several birth defects as well as<br\/> a number of adult diseases occur at a rate of $\\~1$ in every $1000$<br\/>births.<br\/>The premise of this research is that understanding the mechanisms<br\/> under such segmental rearrangements may help improve methods<br\/> for diagnosis, treatment and prevention of these genetic disorders.<br\/><br\/>The basic research components of the proposal<br\/> are (1) identification of all chromosomal segments that are<br\/> duplicated along the genome,<br\/> (2) understanding the complex evolutionary relationships between<br\/> these interesting segments through novel phylogenetic analysis<br\/> algorithms for a single genome sequence, and<br\/> (3) identification of the duplication<br\/> order via known or derived properties of duplication mechanisms, and<br\/> (4) development of similarity measures between genome sequences<br\/> that involve not only point mutations but structural rearrangements,<br\/> particularly duplications.<br\/>The short-term education goal of the proposal is to establish the<br\/> algorithmic and the fundamental software development component of<br\/> an interdisciplinary bioinformatics program at CWRU, that will provide<br\/>means<br\/> of awarding M.S. and Ph.D. degrees within existing departmental<br\/> degree-granting programs.<br\/>The long-term goal is to establish a free-standing<br\/> graduate program in computational genomics,<br\/> offering a wide-range of introductory and advanced level courses in<br\/> bioinformatics.<br\/>To this end the investigator has developed and taught a new<br\/> introductory graduate course on algorithmic issues in bioinformatics,<br\/> with the involvement of students from both the Computer Science<br\/> program and the School of Medicine at CWRU.<br\/>Funds from this proposal will be used to enhance this activity<br\/> through the development of a new advanced level graduate course<br\/> in computational genomics for in-depth training on<br\/> individualized research topics, as well as an intensive summer research<br\/> and training program for graduate and undergraduate students.","title":"CAREER: Algorithmic Methods for Large Scale Genome Analysis","awardID":"0133791","effectiveDate":"2002-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["186846"],"PO":["565223"]},"79119":{"abstract":"There has been a lot of research work on Wireless ATM in the past 5 years; most of the research works are geared towards mobility and connection management. The former is concerned with location and handoff management while the latter is concerned with signaling for call setup and teardown. What are remaining are still some very open issues that demand answers. In supporting QoS in Wireless ATM, the variation of QoS availability over space and time is different from one wireless cell to another. Mobile calls that are established at call setup may longer to able to maintain their QoS demands if the mobile host migrates from cell to cell, unless pre-allocation of network resources are made in advance (however, this is very inefficient). The trend so far has been towards an adaptive end-to-end Mobile QoS framework for Wireless ATM networks. Although this proposal addresses mobile QoS for Wireless ATM, it is not another duplication of existing efforts. Instead, we are investigating this area of work from another dimension - applying the know-how of control and network theory and protocols. It shall address challenging research issues at the network and transport layers and hence this proposal demands vertically integrated research.<br\/><br\/>Most end-to-end QoS adaptation framework attempts to ensure the QoS (normally the bandwidth and delay requirements) over both wired and wireless links are consistent after a handoff. However, such handoffs can occur on the two remote ends of the mobile-to-mobile connection. If the adaptation protocols are not well designed, the WATM can experience instability problems. The fact that a mobile host or the network triggers an adaptation is a sign of pro-active reaction. This is called sensitivity. A highly sensitive system can also cause substantial signaling overhead and result in network congestion and instability. The instability refers to a regenerative phenomenon where another adaptation process is triggered even before the current one is completed. The innovative approach is to apply control theory and to derive new network algorithms. We plan to introduce a set of damping procedures to control sensitivity and instability associated with continuous and transient oscillation in QoS adaptation. Our plan is to derive these adaptation damping procedures and to implement them on a WATM simulator\/testbed to evaluate the feasibility of the approach and the resultant stability and sensitivity of the system under different traffic load, degree of mobility and number of users. This area of this research proposal, therefore, enhances QoS support and more importantly, the reliability, availability and performance of future broadband wireless network systems. It views the understanding of underlying dynamics associated with QoS adaptation paramount to building high performance and reliable wireless broadband systems.<br\/><br\/>The second part of the research concerns with ABR and VBR flow control in WATM networks. While there has been much on-going research associated with ATM flow and congestion control, little is devoted to wireless flow and congestion control in WATM networks. This proposal reveals the impact of the dynamics associated with SS (Stability and Sensitivity) in QoS adaptation on ABR\/VBR flow control. This is a very genuine problem since current rate-based flow control relies on the use of feedback cells and these cells can be lost as a result of host mobility. The innovative approach has two components: (a) the separation of rate allocation and signaling in a vertically integrated design, (b) the optimization of flow control functions in both space and time. It intends to develop and validate a theory of protocols that enables max-min optimization, enhancing stability and minimizing sensitivity to an appropriate level. Protocols designed based on this theory will be amenable to rigorous analysis and proofs of behavior.","title":"Wireless Technology: Issues on QoS Stability, Sensitivity, Flow & Congestion Control in Wireless Broadband Networks","awardID":"0241006","effectiveDate":"2002-01-25","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[206019,206020],"PO":["557315"]},"75765":{"abstract":"This project focuses on the study of the eigenvalue problem in geometry, combinatorial optimization, and information organization. As part of this research, efficient algorithms will be developed for computing and approximating eigenvalues and eigenvectors of a large class of matrices that arise in graph theory, computational geometry, scientific computing, and Internet applications. The following topics will be investiagated. <br\/><br\/>Eigenvalues\/eigenvectors for graph partitioning: The main theoretical and algorithmic questions are: how to properly use eigenvalues\/eigenvectors to find the best possible partition in a graph, and what is a tight <br\/>upper bound on the eigenvalue for graphs such as meshes, planar graphs, bounded genus graphs and <br\/>N-body graphs. Constructive answers to these questions can be used to design efficient algorithms and software for graph partitioning.<br\/><br\/>Geometric methods for eigenvector approximation: The primary goal is to understand whether geometry methods can be developed and used to speed up the approximation of eigenvectors. Many graphs such as planar graphs, finite element meshes, and nearest neighborhood graphs come with a geometric characterization. One can use their geometric structures in the solution and approximation of the eigenvalue problem.<br\/><br\/>Applications of the eigenvalue problem to data clustering and information organization: The objective is to relate the work on spectral graph partitioning to the singular value decomposition based method for data clustering, such as the Latent Semantic Indexing (LSI). These spectral techniques for term-document matrices has enjoyed empirical success, but had heretofore been without rigorous mathematical explanation. The project is expected, by extending our techniques for spectral partitioning, to provide <br\/>a mathematically sound framework and efficient software for these important problems in information retrieval.","title":"The Eigenvalue Problem in Geometry and Combinatorial Optimization","awardID":"0224966","effectiveDate":"2002-01-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["483541"],"PO":["321058"]},"66866":{"abstract":"EIA-0130812 Andreas G. Andreou Johns Hopkins University A Comparative Study of Information Processing in Biological and Bio-inspired systems: Performance Criteria, Resources Tradeoffs and Fundamental Limits<br\/><br\/>We propose a research program towards a fundamental and quantitative understanding of the tradeoffs between system performance and resources such as size, reliability and energy requirements for biological and bio-inspired microsystems. We employ the mathematical tools of communication theory and model natural or synthetic physical structures as micro-scale communication networks, studying them under physical constraints at two different levels of abstraction. At the functional level we examine the operational and task specification, while at the implementation level we examine the physical specification and realization. Both levels of abstraction are characterized by Shannon's channel capacity, as determined by the channel bandwidth, the signal power; and the noise power. The link between the functional level and the physical level of abstraction is established through first principles and phenomenological otherwise, models for transformations on the signal, physical constraints on the system, and noise that degrades the signal.","title":"A Comparative Study of Information Processing in Biological and Bio-inspired Systems: Performance Criteria, Resources Tradeoffs and Fundamental Limits","awardID":"0130812","effectiveDate":"2002-01-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["561000"],"PO":["565223"]},"66877":{"abstract":"EIA-0130851<br\/>Rucci, Michele<br\/>Boston Univ.<br\/><br\/>BITS: Fixational eye movements in biological and artificial vision systems<br\/><br\/>Summary<br\/><br\/>The proposed research project has two goals: (1) to determine the specific contributions of small eye<br\/>movements to the representation of visual information in the brain, and (2) to export such mechanisms<br\/>to machine vision systems. To accomplish these goals, this project will integrate computer modeling of<br\/>neural populations, robotic experiments and psychophysical experiments with human subjects to analyze<br\/>the statistical structure of neural activity under natural viewing conditions. <br\/>The proposed research will first characterize the influences of eye movements on the spatial selectivity of thalamic and cortical cells during natural viewing conditions. Then, the activity dynamics of neuronal ensembles will be studied, both in terms of efficiency of visual representation and in relation to the results of psychophysical studies on the hierarchical structure of spatial visual processing. Finally, we will analyze the possible involvement of small eye movements in the recovery of distance information during binocular free-viewing of a 3D scene. Studies will be conducted with the dual purposes of providing new insights on the brain and considering possible applications to machine vision systems.","title":"Biological Information Technology & Systems - BITS: Fixational Eye Movements in Biological and Artificial Vision Systems","awardID":"0130851","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["491424"],"PO":["565223"]},"64457":{"abstract":"Information Technology Workforce (ITWF)<br\/><br\/><br\/>Proposal Id: EIA-0119880<br\/>Investigator: Ron Eglash<br\/>Institution: Rensselaer Polytechnic Institute<br\/>Title: Culturally Situated Tools<br\/><br\/>This award provides support for Rensselaer Polytechnic Institute (RPI) to develop culturally-situated design tools to motivate ethnic minority students to learn mathematics and to pursue careers in Information Technology. The tools will be integrated into standard curricula for use by approximately one thousand middle school students in Rensselaer Polytechnic Institute's local GEAR-UP program (the U.S. Department of Education's Gaining Early Awareness and Readiness for Undergraduate Program). The use of the design tools will be evaluated over a 3-year period and the results will be disseminated widely.","title":"ITWF: Culturally Situated Design Tools","awardID":"0119880","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["503742","429785"],"PO":["289456"]},"67416":{"abstract":"The goal of this research program is to explore tools, models, and design practices that shed light on the relationship between silicon technology and the direction of future EDA tools. The current education, research, and commercial semiconductor and EDA communities are set up in a way that virtually guarantees a knowledge gap between the cutting edge of CMOS technology and state-of-the-art design automation. The best current example of this knowledge gap is on-chip inductance. A large part of this project focuses on developing models, metrics, and design approaches to assess and ameliorate the impact of inductance on circuit performance. This includes a range of RLC-based models varying in accuracy and complexity that target different stages of the design flow ranging from standard cell characterization to late-mode full-chip timing. Other impending knowledge gaps being studied in this research program include: 1) standard cell interconnect libraries to leverage predictability and maintain performance, and 2) scalable global signaling alternatives to CMOS repeaters for nanometer design (feature sizes < 100 nm). The education component of this CAREER program has two broad aims: 1) introduce students to the role of on-chip interconnect on circuit performance early and often, and 2) transfer a diverse population of students to industry with relevant design experience via group design projects.","title":"CAREER: Improving Technology-EDA Integration Through Interconnect Design Tools for Nanometer Design","awardID":"0133401","effectiveDate":"2002-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["517834"],"PO":["562984"]},"67339":{"abstract":"0132970<br\/>Yu, Yizhou<br\/>U of Ill - Champaign<br\/><br\/>This project addresses the problem of recovering and synthetically generating realistic appearance details. Appearance details include color\/reflectance variations, small geometric features on 3D surfaces, and the change of these high-resolution geometric and physical properties at different times. We call these details 3D and temporal textures in contrast to 2D textures which only have color variations in a 2D space. <br\/><br\/>This project describes fundamental research in four classes of problems surrounding 3D and temporal textures:<br\/><br\/>(1) the development of a unified framework for texture modeling considering 3D spatially and temporally varying details;<br\/><br\/>(2) the development of novel algorithms that either recover high-quality appearance details from photographs and videos or generate them synthetically;<br\/><br\/>(3) the development of efficient synthesis algorithms that can generate novel instances of 3D and temporal textures from given examples;<br\/><br\/>(4) the investigation of efficient representation and compression schemes for 3D and temporal textures.<br\/><br\/>This project will result in significant advances in 3D and temporal appearance modeling and synthesis, and therefore lead to overall qualitative improvement of the synthetic imagery created by graphics approaches.<br\/><br\/>3D and temporal textures complement geometric modeling and physical simulation. Addressing the proposed problem will greatly benefit these and other related research directions. Recent advances in physics-based simulation made it possible to generate synthetic imagery from solving light transport and motion equations. While these simulation-based techniques are quite expensive, the results generated from these techniques are often found to be too clean and smooth to look realistic enough. Incorporating appearance details into these methods would be highly desirable. Meanwhile, recent geometric reconstruction techniques from images and laser range scans have made it possible to acquire high-quality geometric models. <br\/><br\/>Appearance modeling is becoming increasingly important in computer graphics applications where the efficient and realistic representation of details is essential. This work will be able to produce statistically correct, physically plausible appearance details in an efficient manner. In the film industry, high-quality hair models and skin surface details will dramatically shrink the gap between synthetic and real characters. In the game industry, real-time 3D and temporal textures will bring virtual environments a large step closer to reality. This holds true for a large number of applications including electronic commerce, TV and Web content production, human computer interaction, architectural and archeological walkthroughs.<br\/><br\/>Altogether, the expected outcome of the project will be the development of important new techniques and results that provide real-world applications with useful solutions, cross-fertilization between computer graphics and other related areas (such as image processing and computer vision), and curricular innovations.","title":"CAREER: Efficient and Realistic Spatial\/Temporal Appearance Details","awardID":"0132970","effectiveDate":"2002-01-15","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["408307"],"PO":["532791"]},"77757":{"abstract":"Most modern single processor architectures focus on exploiting instruction-level parallelism. However, despite continued performance improvements, there is increasing doubt that aggressive ILP architecture techniques would continue bringing the desired improvements and that there will come about a diminishing return in the performance of single-chip architectures.<br\/><br\/>Multithreaded execution models promise to exploit thread-level parallelism (TLP) beyond a pure ILP approach. Multithreading can be applied directly at the level of uniprocessor instruction-set architectures. For example, Simultaneous MultiThreading (SMT) is a promising approach, which is attracting the attention of a number of academic and industrial research groups. This technique allows the various pipelines of a \"superscalar\" processor to be efficiently utilized by scheduling from several \"coarse-grain\" threads of one (or several) program(s). Although exploiting both ILP and TLP is attractive, the following questions are investigated in the project:<br\/><br\/>- Can an architecture model, which integrates fine-grain multithreading support with a coarse-grain multithreaded architecture model such as SMT, be developed?<br\/><br\/>- What are the design trade-off when mapping these architecture features to single-chip implementations?<br\/><br\/>- What compiling methodology for the proposed architecture model would exploit thread-level parallelism at both coarse and fine-grain levels?","title":"Multithreading: A Viable Approach for High Performance Single Chip Architecture","awardID":"0234444","effectiveDate":"2002-01-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["475291"],"PO":[202799]},"66858":{"abstract":"EIA-0130793 Ramdas Kumaresan University of Rhode Island Collaborative Research: Processing of Temporally-Coded Auditory Representations for Sound Separation and Localization<br\/><br\/>The proposed work investigates the use of two temporally-coded representations and temporal processing strategies for the separation of auditory objects. Two temporal representations and temporal processing strategies for the separation of auditory objects will be used. Two temporal representations of input signals will be used. These are 1) phase-locked spike train responses in a simulated auditory nerve array (Auditory Temporal Images), and 2) an auditory-inspired signal representation based on adaptive demodulation (Adaptive Demodulation and Real-Zero Conversion) that converts bandpass signals into timings of certain zero crossings.<br\/><br\/>Temporal coding through phase locking is a very general strategy for representing sensory information through the relative timings of spikes. Temporal coding is found in many sensory systems: audition (periodicity and frequency discrimination, localization, echolocation), mechanoception (flutter-vibration, localization, movement), electroception (localization), and vision (fly motion detection). The unsurpassed capabilities of biological auditory systems to separate, analyze, and recognize multiple sounds may be due to the early use of temporal codes and computations, but thus far there have been relatively few attempts to effectively exploit these time domain strategies in artificial signal processing contexts. This collaborative project will combine understanding of the neural substrates of auditory perception (Cariani) with mathematical insights and expertise in signal processing (Kumaresan) to develop new biologically inspired time-domain approaches to auditory scene analysis.","title":"Collaborative Research: Processing of Temporally-Coded Auditory Representations for Sound Separation and Localization","awardID":"0130793","effectiveDate":"2002-01-15","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[173322],"PO":["565223"]},"67507":{"abstract":"Abstract:<br\/>Exposure-Resilient Cryptography concerns the important problem of key<br\/>exposure and general information leakage. Exposure of such<br\/>information poses one of the most serious and common threats to<br\/>employing cryptography in real life. For example, cryptographic<br\/>computations (decryption, signature generation, etc.) are often<br\/>performed on a relatively insecure device (e.g., a mobile device or an<br\/>Internet-connected host) which cannot be trusted to maintain secrecy<br\/>of the private key. Thus, the goal of Exposure-Resilient Cryptography<br\/>is to design solutions that will limit (or even completely eliminate)<br\/>the negative consequences of such an exposure in various cryptographic<br\/>scenarios. In particular, this research concentrates on the design of<br\/>various key evolving schemes and the problem of partial key exposure.<br\/><br\/>The paradigm of secret key evolution over time invloves updating one's<br\/>secret key such that key leakage at given period(s) compromises the<br\/>security of other periods to the minimal extent possible. The<br\/>investigators examine two such models. Forward-secure schemes update<br\/>secret key locally, and seek to protect the security of all the past<br\/>periods when the current key is exposed. In contrast,<br\/>bidirectionally-secure schemes use secure key updates, but protect<br\/>all non-exposed periods: both in the past and in the future. In<br\/>either model, the public information (e.g., public keys) are not<br\/>affected by the secret key evolution. The problem of partial key<br\/>exposure concerns the scenario where most but not all secret<br\/>information has been leaked. The main question studied in this setting<br\/>is how can valuable secret information be stored or represented in<br\/>such a way that almost complete exposure of its representation still<br\/>guarantees the secrecy of the actual, embedded secret?","title":"CAREER: Exposure-Resilient Cryptography","awardID":"0133806","effectiveDate":"2002-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550227"],"PO":["499399"]},"67518":{"abstract":"0133841<br\/>Tepedelenlioglu, Cihan<br\/>Arizona State University<br\/><br\/>In wireless broadband communications, the distortion that the communication medium (`the channel') causes on the transmitted signal, warrants accurate channel models in order to characterize and mitigate the distortion. These models need to take into account the mobility of the transmitter and receiver, the possible presence of a line-of-sight between the communicators, and the presence of noise and interference, all of which are parameters that quantify the channel quality, and affect the performance of the communication <br\/>system. It is, therefore, of interest to construct such models, and use these models to estimate these statistical channel quality measures. It is the goal of this research to construct and utilize a signal processing framework to estimate these channel quality measures, which is expected to aid in the design of broadband systems with improved performance. <br\/>More specifically, in the course of this research, the PI will construct optimal (maximum likelihood and minimum variance) as well as moment-based estimators for channel quality indicators such as the maximum Doppler spread, signal to interference plus noise ratio, and the Ricean factor for broadband systems such as OFDM. After characterizing the deleterious effects of the time-selective and frequency-selective channel on <br\/>general block transmission systems, for which OFDM is a special case, the PI will devise generalized OFDM transceivers that reduce the adverse effects of the inter-carrier interference. Hence, the research will <br\/>focus on the adverse effects of the randomly time-varying channel on broadband systems and propose novel, low-complexity remedies.","title":"CAREER: A Unifying Signal Processing Framework for Estimating Statistical Channel Quality Measures In Wireless Communications","awardID":"0133841","effectiveDate":"2002-01-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["544880"],"PO":["564898"]},"67408":{"abstract":"Designing Embedded Systems with Domain-Specific Languages<br\/>Stephen A. Edwards<br\/><br\/>This goal of this project is to provide tools to designers of embedded<br\/>systems that will allow them to more quickly create correct systems.<br\/>It proposes to do this by providing domain-specific languages and<br\/>compilers. Such succinct, abstract languages reduce development and<br\/>testing time by providing more formal, correct-by-construction<br\/>methodologies and by enabling automatic implementation techniques.<br\/>The result will enable the development of these systems to proceed<br\/>beyond the current ad hoc C-and-assembly approach.<br\/><br\/>The project addresses three issues in the design of many embedded<br\/>systems: real-time software, software for communication, and software<br\/>for communicating across the hardware\/software boundary.<br\/>These issues are addressed through the following specific investigations:<br\/><br\/>New Compilation Techniques for Synchronous Languages<br\/><br\/>Synchronous languages such as Esterel provide very predictable<br\/>real-time behavior but are challenging to compile. This project<br\/>includes developing new, more efficient compilation techniques for<br\/>large systems described in the Esterel language and its variants. <br\/><br\/>New Languages and Compilers for Communication Protocols<br\/><br\/>Network communication is becoming a crucial part of every embedded<br\/>system, but the growing complexity of the protocols and the need for<br\/>bandwidth (e.g., for video) makes this software difficult to develop.<br\/>This project includes the development of a new language for<br\/>describing such protocol software and a compiler for producing<br\/>efficient implementations.<br\/><br\/>New Languages and Compilers for Device Drivers<br\/><br\/>Writing software that communicates directly with hardware is currently<br\/>tedious and error-prone, and unfortunately even more important in<br\/>embedded systems since they tend to have application-specific<br\/>peripherals. This project aims to simplify this task by creating a<br\/>language and compiler for writing device drivers. The results of this <br\/>research will enable more diverse languages for communicating across <br\/>the hardware\/software boundary.<br\/><br\/>This project is also addressing the recurring complaint that academia<br\/>does not produce students who understand both hardware and software<br\/>well enough to be effective embedded systems designers by developing<br\/>new courses along these lines. At the undergraduate level, a new<br\/>embedded systems project course is being developed that will give<br\/>students the opportunity to learn about and use some of these new<br\/>techniques. At the graduate level, a more sophisticated course is<br\/>being developed that focuses on languages for describing embedded<br\/>systems and isses with their semantics and implementation. This will<br\/>give future designers more tools for developing embedded systems and<br\/>will prepare students for research in automating embedded system<br\/>design.<br\/><br\/>The results of this project are being disseminated in three ways:<br\/>through conference and journal papers, through the release of all<br\/>developed software to the public domain, and through the education of<br\/>students in the use of the languages and compilers developed. Just as<br\/>computer-aided design tools have enabled the rapid, correct design of<br\/>fantastically complex integrated circuits, this work is enabling the<br\/>quick, correct design of tomorrow's complex embedded systems.","title":"CAREER: Designing Embedded Systems with Domain-Specific Languages","awardID":"0133348","effectiveDate":"2002-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["530445"],"PO":["561889"]},"64308":{"abstract":"The topic of proposed work is development of robust algorithms for vision-based mobile robot navigation. A probabilistic framework is proposed for reliable navigation between landmarks in an unmodeled environment. In the considered strategy, the robot first explores its environment to learn the landmarks, and then uses the graph produced in the process for navigation.","title":"RUI: Landmark-Based Mobile Robot Navigation Using Expected Shortest Paths","awardID":"0118892","effectiveDate":"2002-01-15","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["531309"],"PO":["335186"]},"66818":{"abstract":"EIA-0130613<br\/>Arnold, Frances<br\/>California Institute of Technology<br\/><br\/>BITS: Biological Information Technology Systems - BITS: Self-Perfecting Genetic Circuits<br\/><br\/>We propose to develop efficient, evolutionary design strategies for constructing functional de novo genetic<br\/>circuits. We will apply methods of molecular evolution, which have proven highly successful for<br\/>engineering proteins with improved or altered properties, to complex genetic systems involving multiple<br\/>repressors, operators, and promoters. We believe that evolution will prove to be generally applicable for<br\/>optimizing individual devices as well as complex genetic circuits, and our goal will be to demonstrate<br\/>how evolutionary searches are best performed in order to build libraries of devices and assemble them<br\/>into functional circuits.<br\/><br\/>We anticipate that this research will establish a general strategy for de novo genetic circuit design<br\/>and provide new insight into the natural algorithms of information processing in biological systems and<br\/>biological complexity. This research exploits, in powerful combination, the strengths of classical<br\/>approaches in electrical circuit design (characterizing the device physics of gates, then composing<br\/>circuits from well understood components) with adaptation mechanisms (mutation and selection)that are<br\/>the hallmark of biological systems.","title":"Qubic: Biological Information Technology Systems: Self-Perfecting Genetic Circuits","awardID":"0130613","effectiveDate":"2002-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["401360"],"PO":["565223"]},"71724":{"abstract":"EIA-0204796<br\/>Varian, Hal<br\/>University of California - Berkeley<br\/><br\/>SGER- Mining the Deep Web for Economic Data<br\/><br\/>This Small Grant for Exploratory Research will support exploration of \"the deep web;\" that is, data which is held in web-accessible databases, but which is generally not available via the use of standard web-crawlers. Data held in web databases may be several hundred times larger than the web we routinely access, and which is held in html and other tagged text files. The domain to be explored is economic information, to see whether these new data can help in economic forecasting.","title":"SGER: Mining the Deep Web for Economic Data","awardID":"0207603","effectiveDate":"2002-01-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["229257","451018"],"PO":["371077"]}}