{"181624":{"abstract":"Hospital clinical laboratory tests are a major source of medical information used to diagnose, treat, and monitor patients. Such test errors lead to delays, additional clinical evaluation, additional expense, and sometimes to erroneous treatments that increase risk to patients. One recent study suggests that errors in measured total blood calcium concentration due to instrument mis-calibration alone cost from $60M to $199M annually in the US. However, the vast majority of clinical laboratory errors do not originate in instrument mis-calibration. Clinical laboratory errors affect about 0.5% of samples collected. Of those, approximately 75% of clinical laboratory test errors originate during sample collection, transport, and storage before samples reach the analysis instruments i.e., the pre-analytic phase. However the quality control measures standard in hospital clinical test labs only monitor instrument calibration and are therefore completely blind to sample faults introduced in the pre-analytic phase, where most errors originate. Data derived from patient samples, rather than instrumentation calibration checks, holds the key to detect faults introduced in the pre-analytic phase. Current methods are either so insensitive to errors that they do not detect sample faults reliably, or they routinely flag normal samples as being faulty.<br\/><br\/>This project brings together an interdisciplinary team of researchers from Oregon Health and Science University and Northeastern University with expertise in machine learning, signal processing, and laboratory medicine to develop and apply statistical machine learning technology to reliably detect errors in hospital clinical laboratory tests, using data derived from patient samples. The primary obstacle to developing reliable statistical detectors for lab errors is the cost of labeling samples combined with the low error rate. Developing and evaluating any automated error-detection algorithm requires a sufficient number of samples, both faulty and non-faulty. Determining which tests are faulty requires review of the tests and other patient data (e.g. charts) by a clinical lab expert - a time-consuming and economically unfeasible prospect given the low fault rate. The project addresses this challenge through active learning paradigms used to select, with emphasis on rare classes, subsets of the data for labeling by human experts. The project focuses on chronic kidney disease because of its medical importance and large data repository at Oregon Health and Science University. This research will provide algorithms for clinical lab error detection that will extend to tests used in other disease entities (for example diabetes and heart failure). <br\/><br\/>Ultimately, the error-detection algorithms developed from this research will make their way into clinical laboratory information systems and further into commercialization and thus deployment on a scale significant enough to have widespread positive impact on laboratory costs patient risk. The project provides cross-disciplinary training in statistical pattern recognition and clinical laboratory science for graduate and undergraduate students. Additional information about the project can be found at: http:\/\/www.bme.ogi.edu\/~tleen\/LabErrorDetect\/.","title":"SHB: Small: Robustly Detecting Clinical Laboratory Errors","awardID":"1118061","effectiveDate":"2011-12-15","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["506513",486606,"562760"],"PO":["565136"]},"189998":{"abstract":"US-French Collaboration in Computational Neuroscience, Paris, November 29-30, 2011<br\/><br\/>This award supports a US-French workshop, led by Aude Oliva and Alain Destexhe, on binational collaboration in computational neuroscience. The workshop builds on interests by NSF, Agence Nationale de la Recherche (ANR), and other agencies in collaborative research in this rapidly developing area of research. The workshop will explore the intellectual opportunities, educational and economically relevant impacts, and practical considerations needed for US-French collaboration to be successful. The workshop will be attended by US and French researchers, and representatives from US and French funding organizations. A report from the workshop will be made available at http:\/\/www.nsf.gov\/crcns.","title":"NSF-ANR Workshop: US-French Collaboration in Computational Neuroscience","awardID":"1201893","effectiveDate":"2011-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":[509344],"PO":["564318"]},"192320":{"abstract":"This is funding to support a Young Pioneers Workshop (doctoral consortium) of approximately 18 graduate students and 2 postdocs from diverse research communities (e.g., computer science and engineering, psychology, cognitive science, robotics, human factors, human-computer interaction design, and communications), along with distinguished research faculty. The event will take place on Monday, March 5, 2012, immediately preceding the Seventh Annual Human Robot Interaction Conference (HRI 2012) to be held March 6-8, 2012, in Boston, and which is jointly sponsored by ACM and IEEE. The theme of HRI 2012 is \"Robots in the Loop,' which highlights the importance of autonomously capable robots in enhancing the experiences of human users in everyday life and work activities; the conference will emphasize embodied robotic systems that operate, collaborate with, learn from, and meet the needs of human users in real-world environments. More information about the conference is available at http:\/\/hri2012.org\/.<br\/><br\/>The Young Pioneers Workshop is designed to complement the conference, by providing a forum for students and recent graduates in the field of HRI to share their current research with their peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference. During the workshop, participants will talk about the important upcoming research themes in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. To these ends, the workshop will include sessions in a variety of formats. Attendees will hear short talks from 3 selected student participants; those students not invited to give an oral presentation will participate in an interactive poster session. A panel of five senior researchers will share their expertise and insights on how to address the interdisciplinary challenge of HRI. The afternoon breakout session will involve small groups of 3-5 attendees with diverse backgrounds working to design an integrative HRI project, encouraging group participation and the cultivation of cross-disciplinary ideas. The presentation session afterward will allow 10-15 minutes for each breakout group to present a summary to the entire workshop; the organizers anticipate that the discussions will continue during dinner.<br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (including but not limited to computer science and engineering, psychology, robotics, human factors and ergonomics, and human-computer interaction). This is important for the field, because it has been recognized that transformative advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming years. Participants will also gain leadership and service experience, as the workshop is largely student organized and student led. The PI will act aggressively to recruit young researchers from minority and underrepresented groups in order to assure diversity of the participants across a variety of dimensions, so that the students' horizons are broadened to the future benefit of the field. The PI will conduct pre- and post-workshop surveys in order to validate the effectiveness of the 2012 Young Pioneers Workshop.","title":"WORKSHOP: The 2012 HRI Pioneers Workshop at the 2012 ACM\/IEEE International Conference on Human-Robot Interaction","awardID":"1212300","effectiveDate":"2011-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["565226"],"PO":["565227"]},"192920":{"abstract":"Maintaining the health and well-being of the aging US presents significant challenges. The workshop brings together leaders in geriatric and biomedical research, government, telecommunications, home monitoring companies, pharmaceutical companies, and non-profit advocacy groups to identify strategies that will support a national network of home-based monitoring and assessment capabilities. <br\/><br\/>Intellectual Merits: The workshop will identify research challenges and opportunities relating to identification, monitoring, and analysis of activities across multiple time scales, locations, specific actions, functional abilities and physiological changes. <br\/><br\/>The workshop will focus on research challenges in creating a scalable infrastructure and technology for large scale distributed longiitudinal studies that help answer many unanswered questions regarding aging and independent living through coordinated gathering and analysis of behavioral, social, biological, clinical, genetic, economic, and environmental data. The workshop is expected to produce a report, giving concrete examples of what is needed to progress, from a technical standpoint and from a funding perspective. <br\/><br\/>Broader Impacts: If successful, the workshop would help identify the research challenges and opportunities in creating the infrastructure and research networks needed to advance the understanding of aging and to develop technologies that better support the health and wellbeing of the aging population in the US.","title":"Workshop to Investigate Approaches for Large Scale Senior Independent Living Networks","awardID":"1215850","effectiveDate":"2011-12-15","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[516823,516824,516825],"PO":["560586"]},"188991":{"abstract":"This workshop explores the technical and policy issues in cybersecurity in the context of award activities in NSF's International Research Network Connections (IRNC) program. Those issues include not only operational network security, but the application of network security research and development innovations, the proper role of IRNC activities as part of a comprehensive and secure NSF cyberinfrastructure, and the potential of IRNC activities to contribute to network security research and development. Experts from research and industry are engaged for this event.<br\/><br\/>Intellectual merit is found in the workshop's exploration of a combined set of technical, policy, legal, and behavioral issues in cyber security applied to a diverse set of network infrastructure activities. Broader impact is reflected in the role of IRNC activities in serving international research and education activities across science and engineering domains.","title":"Security at the Cyber-Border","awardID":"1158796","effectiveDate":"2011-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["547713",506704,"524617"],"PO":["564246"]},"184645":{"abstract":"The objective of this research is to develop a comprehensive theoretical and experimental cyber-physical framework to enable intelligent human-environment interaction capabilities by a synergistic combination of computer vision and robotics. Specifically, the approach is applied to examine individualized remote rehabilitation with an intelligent, articulated, and adjustable lower limb orthotic brace to manage Knee Osteoarthritis, where a visual-sensing\/dynamical-systems perspective is adopted to: (1) track and record patient\/device interactions with internet-enabled commercial-off-the-shelf computer-vision-devices; (2) abstract the interactions into parametric and composable low-dimensional manifold representations; (3) link to quantitative biomechanical assessment of the individual patients; (4) facilitate development of individualized user models and exercise regimen; and (5) aid the progressive parametric refinement of exercises and adjustment of bracing devices. This research and its results will enable us to understand underlying human neuro-musculo-skeletal and locomotion principles by merging notions of quantitative data acquisition, and lower-order modeling coupled with individualized feedback. Beyond efficient representation, the quantitative visual models offer the potential to capture fundamental underlying physical, physiological, and behavioral mechanisms grounded on biomechanical assessments, and thereby afford insights into the generative hypotheses of human actions.<br\/><br\/>Knee osteoarthritis is an important public health issue, because of high costs associated with treatments. The ability to leverage a quantitative paradigm, both in terms of diagnosis and prescription, to improve mobility and reduce pain in patients would be a significant benefit. Moreover, the home-based rehabilitation setting offers not only immense flexibility, but also access to a significantly greater portion of the patient population. The project is also integrated with extensive educational and outreach activities to serve a variety of communities.","title":"CPS:Medium:Quantitative Visual Sensing of Dynamic Behaviors for Home-based Progressive Rehabilitation","awardID":"1135660","effectiveDate":"2011-12-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["550248",495222,"54165"],"PO":["565136"]},"182748":{"abstract":"1124480<br\/>Pfaendtner <br\/><br\/>This Pan-American Advanced Studies Institutes (PASI) award, jointly supported by the NSF and the Department of Energy (DOE), will take place September 1-14, 2012 at the Institute Pasteur in Montevideo, Uruguay. Organized by Dr. W. James Pfaendtner and Dr. Cameron F. Abrams from the Chemical Engineering Departments at the University of Washington in Seattle, Washington and Drexel University in Philadelphia, Pennsylvania respectively, the institute will address the subjects of molecular-based multi-scale modeling and simulation. More specifically, it will be structured into three broad areas that include enhanced sampling, coarse-grained modeling, and rare-events\/rate calculations. Overall, the PASI will give students simultaneous exposure to a) the theoretical underpinnings of new methods, b) the algorithmic details of their implementation, and c) hands-on practice using the above-mentioned methods.<br\/><br\/>Because multi-scale simulations can be used to study many systems at the atomic level, the methods taught in this PASI have applicability to a wide range of scientific and technological fields, including drug design, the biomedical sciences and energy science. Furthermore, the activity will also have a significant impact on the research choices of the 30 student participants by providing them with the guidance to use NSF Teragrid Resources to perform research-grade calculations after the PASI is over.","title":"PASI: Molecular-Based Multiscale Modeling and Simulation; Montevideo, Uruguay; September 1-14, 2012","awardID":"1124480","effectiveDate":"2011-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"KX13","name":"Department of Energy Chicago O"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"8049","name":"BIO PostDocs"}}],"PIcoPI":["553748","539702"],"PO":["531406"]},"186489":{"abstract":"1145718 <br\/><br\/>This project supports a cooperative research project by Dr. Howard Choset, Carnegie Mellon University, Pittsburgh, Pennsylvania in collaboration with Dr. Mohamed Abd El-Maguid, Supreme Council for Antiquities (SCA), Alexandria, Egypt. The project will establish a long-term collaboration between the two sides to use robots to inspect regions of archeological interest that are too dangerous for people to enter. The specific area of interest lies in the Mersa\/Wadi Gawasis region of Egypt which contains many man-made caves that were used to store pieces of ancient ships. This region has now gained considerable interest by Egyptologists. Dr. Kathryn Bard of Boston University and Rodolfo Fattovich of the University of Naples \"l'Orientale\" have been active in this area, and Dr. Abd El-Maguid has joined with them to assist in excavations and in determining historical significance. He is an expert in underwater archeology in Egypt. Drs. Bard and Fattovich have identified two specific caves that contain artifacts of great interest and are looking at another location for a man-made storage facility. All of these areas are not safe for people to enter. The PI has developed robots, called snake robots, because they articulate and maneuver through cluttered spaces, much in the same ways biological snakes do. <br\/><br\/>Intellectual merit: The research will explore the use snake robots to identify and perhaps retrieve items from these caves in collaboration with the Egyptian scientist. This grant would support an expedition to inspect the cave entrances with robots to locate artifacts of deep interest to the history of Egypt, its historical Naval capabilities, and its relationship with the city of Punt.<br\/><br\/>Broader Impact: The PI and his Egyptian collaborator believe that the use of robots in the Gawasis is just the beginning, and that this work will lead to new area of robotics called Robotic Archeology. In this new field of robotics, archaeologists can use robots as tools to explore and investigate important archaeological sites without disturbing the surrounding areas, which often happens when people enter such locations. While exploring such regions, the robot is able to construct a map of the site, which in turn can be viewed by others. This map will provide a three-dimensional view of the location, allowing anyone, both archaeologist and non-specialist alike, to remotely and virtually visit a location of great national interest. The proposed work will also contribute to education aiming at engendering science and engineering interest in middle school students. In particular, the PI will visit schools around Pittsburgh and talk about robotics, drawing on the application of archeology for subject matter. It is quite likely that archeology and the application of robotics to it will compel students of all ages and raise interest in history, science and engineering. The US PI will also develop lab modules for the undergraduate robotics with the theme of looking for concealed artifacts in difficult-to-negotiate environments.","title":"US-Egypt Cooperative Research: Robotic Exploration of the Mersa\/Wadi Gawasis","awardID":"1145718","effectiveDate":"2011-12-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[500416,"553216"],"PO":["561865"]}}