{"2563":{"abstract":"9508950 Spielman The Mathematical Sciences Postdoctoral Research Fellowships are awards to recent recipients of doctoral degrees in the mathematical sciences. These awards are a means of contributing to the future vitality of the scientific effort of the nation. As researchers in the mathematical sciences expand their interactions with other disciplines, and as the interplay increases between the various areas of mathematics itself, opportunities for postdoctoral research and training are becoming increasingly important. The Fellowships are designed to permit awardees to choose research environments that will have maximal impact on their future scientific development. The fellowship is designed to provide 24 months of support divided into 18 academic-year months and three periods of two summer months. The recipient may choose (1) the Research Fellowship option which allows for full time support for any 18 academic year months in a three year period, in intervals not shorter than 3 consecutive months or (2) the Research Instructorship option which allows the 18 months of academic year support to be taken as nine months of full time support and 18 months of half time support. Not more than two months of summer support from this Fellowship may be received in any calendar year. Daniel Spielman will receive his doctoral degree from the Massachusetts Institute of Technology and will pursue research under the guidance of Umesh Vazirani at the University of California, Berkeley. The research will be conducted in computational mathematics and computer science, specifically in the development and understanding of computationally efficient error-correcting codes for holographic proofs.","title":"Mathematical Sciences Postdoctoral Research Fellowships","awardID":"9508950","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["483530"],"PO":["313600"]},"1540":{"abstract":"Proposal: DMS 95- 05151 PI(s): Iain Johnstone - 1981, David Donoho - 1984 Institution: Stanford Title: Adaptive Estimation, New Tools, New Settings Abstract: The research develops fundamental tools in theoretical statistics to aid understanding of such adaptive procedures, and shows how to tune them so they are noise-cognizant and stable. Underlying the approach are a) the idea of oracles, which know perfectly well how to adapt representations ideally, b) the idea that the goal of adaptation in the presence of noisy data is to quantify how closely realizable procedures (which do not have privileged information about the object) can mimic an oracle, and c) the design of procedures coming as close as possible to the oracle. The project also develops methods for comparing different adaptation schemes by comparing oracles of different kinds, for example time-frequency oracles and time-scale oracles. This is an outgrowth of our earlier results on wavelets, where this approach was used to show that wavelets have a property of being nearly-ideally spatially adaptive. In addition a computational environment is being developed for implementing and systematically testing such approaches. As a further outgrowth of the proposers' earlier work on wavelets, the project studies a number of improvements and extensions of wavelet shrinkage, for example in the directions of classification, confidence bands, correlated data and selection of orthogonal bases. This research seeks to develop statistical theory and computational tools in the general area of adaptive methods of representing and analyzing signals, images and other objects. On the one hand, this project is prompted by the extremely high interest in adaptation on the part of people working in fields of signal processing, image processing, time-frequency analysis, speech processing analysis. New signal representations appear in these fields almost daily, along with new principles fo r selecting representations. Such representations are useful for data compression, which is not the main interest here; but they are also useful for noise removal and signal interpretation, which are important areas for statisticians to consider. On the other hand, this project is prompted by the goal of developing statistical theory which can give clear understanding of such adaptive schemes. Some of the most highly adaptive schemes being suggested in signal processing pose a real challenge to traditional statistical thinking. For example, some adaptation schemes search (either explicitly or implicitly) through thousands or millions of representations of a signal in order to arrive at their final result. A statistician, when thinking about applying such methods to a noisy signal, is by training forced to ask to what extent the result merely reflects the effects of snooping through noise, detecting pseudo-structure which actually due to noise, and due to the vigorous search. The research seeks to develop fundamental tools in theoretical statistics to aid understanding of such adaptive procedures, and shows how to tune them so they are noise-cognizant and stable. This project may have two spin-offs. First, some of the results may be stimulating and\/or useful to the community of ``inventors of adaptive procedures'' in signal, image, speech, and time\/frequency, and related communities. Second, the theoretical work may stimulate statisticians to take more interest in making further contributions in such directions.","title":"Mathematical Sciences: Adaptive Estimation: New Tools, New Settings","awardID":"9505151","effectiveDate":"1995-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["403485","403486"],"PO":["331535"]},"1233":{"abstract":"To achieve maximum benefit from tiling, compiler optimization must exercise more control over data movement and storage assignments than is commonly done. Hierarchical tiling takes responsibility for several phases of compilation and code improvements that are traditionally done separately, such as scalar replacement, register allocation, generating message passing calls, and storage mapping. It uses the mechanisms of explicitly naming and copying data to control the movement of data up and down the memory hierarchy and to exploit all levels of parallelism. Its effectiveness as a systematic framework for hand-crafting highly optimized code has been tested on scientific applications for IBM SP1 system. This project will extend the research in compiler optimizations by investigating the following: (1) Develop a parameterized machine model that captures the architectural information needed to guide hierarchical tiling. (2) Study interactions between tiling at various levels of granularity. (3) Incorporate hierarchical tiling into the SUIF toolset. (4) Extend the work to disk storage, explicit I\/O and implicit paging virtual memories. (5) Validate the approach using various programs on different parallel machines.","title":"Hierarchical Tiling: A Framework for Multi-level Parallelism and Locality","awardID":"9504150","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["481145","218864"],"PO":["150697"]},"1178":{"abstract":"9503963 Bodenchatz The objective of this proposal is to study numerical and analytically the microscopic equations describing certain experimental systems. This research will take three directions, it will make quantitative comparisons between simulations experiments, study lengthscale and order parameters in experimental systems, and examine the appearance and role of topological defects. A specific goal of this proposal is to use the powerful parallel computing facilities to explore new physical regimes which are described by the Boussinesq equations. Although the equations have been simulated before, the simulations have been limited to small systems, short integration times, limited fixed resolution, or particular boundary conditions. By comparing a code using spectral methods to one based on iterative methods, such as multigrid or conjugate-gradient-like methods, we will develop a general scalable Boussinesq solver optimized for parallel computers that will allow long integrations of large systems with aspect ratios greater than 100 and with adjustable resolution in all directions. This next generation convection code will allow this research to perform exhaustive explorations of spatiotemporal chaos in extended convection systems, and, hopefully, these explorations will constitute a significant step toward a formalism similar to equilibrium thermodynamics.","title":"Postdoc: Extensive Spatiotemporal Chaos in Extended Nonequillibrium Systems","awardID":"9503963","effectiveDate":"1995-07-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1245","name":"THEORETICAL PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["362485"],"PO":["224490"]},"3268":{"abstract":"9511637 Sejnowski Recently a new field of engineering has emerged, referred to as neuromorphic engineering, that is based on the design and fabrication of artificial neural systems, such as vision chips, head-eye systems, and roving robots, whose architecture and design principles are based on those of biological nervous systems. A two-week workshop on neuromorphic engineering will be held to bring together young investigators and more established researchers from academia with their counterparts in industry and national laboratories, working on both neurobiological as well as engineering aspects of sensory systems and sensory-motor integration. Formal lectures will be given, but the primary focus will be hands-on experience with research tools for all participants. The workshop will serve as a bridge between the engineering world of artificial neural systems and the neuroscience community. The workshop will provide an environment for intensive interactions between members of these two communities - merging engineering principles with experimental results from neuroscience. The interaction of these two disciplines should have significant impact both on the development of new technologies (new artificial neural systems) and on our understanding of how the nervous system is designed. ??","title":"Workshop on Neuromorphic Engineering; June 25, 1995 - July 8, 1995; Telluride, Colorado","awardID":"9511637","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1162","name":"COMPUTATIONAL NEUROSCIENCE"}}],"PIcoPI":["560905"],"PO":["98552"]},"1640":{"abstract":"This project applies parallel algorithm design theory problems arising from scientific problems governed by partial differential equations. Most of the effort is restricted to solving algorithmic problems including mesh generation and partitioning. This project develops algorithms and code for the solution of scientific problems that are highly unstructured and whose solution may be rapidly changing with time. Thus, the emphasis is on parallel mesh generation algorithms that will run on parallel machines in conjunction with the system solvers. The project also continues to improve the parallel efficiency of linear system solvers and will extend the work on combinatorial approaches to the construction of good preconditioners for linear system solvers. These are used to speedup the convergence rate of iterative methods. A central approach taken by this project for the design of new algorithms for problems such as mesh generation and preconditioner construction is to use the fact that the graphs for these problems have small separators that can be quickly found. Under prior projects partially supported by NSF, algorithms were discovered and developed to partition, for instance, finite element meshes into roughly two equal size pieces by removing a small number of elements. This work is referred to as the geometric approach to separators. The geometric approach quickly produces provably good partitions for finite element meshes. This project intends to show how the role of mesh generation methods and separator technology can be reversed. In particular, good mesh generation methods are being developed which use the separator technology. This technology will also be used in the construction of good iterative methods for solving these underlying systems. Further improvements are being made in the geometric separator algorithms via experimental and analytic methods. Relationships between the geometric method and other known algorithms and methods, such as spectral, are being investigated.","title":"Algorithm Design and Implementation for Parallel Scientific Computation","awardID":"9505472","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["475261"],"PO":["187585"]},"1541":{"abstract":"9505153 Martin Martin will work in set theory and descriptive set theory, especially determinacy hypotheses, and his first goal is to complete his long-awaited research monograph on proofs of determinacy from large cardinal axioms. Steel will also work generally in set theory and descriptive set theory, and more specifically on the construction and study of canonical, inner models of ZFC that satisfy specified large cardinal or determinacy assumptions. Moschovakis will work on fixpoint recursion and its applications to the theory of computation, including the mathematical modeling of recursive algorithms, the logic of recursive definitions, and the construction of canonical solutions for recursive equations in non-deterministic and concurrent settings. The Principal Investigators of this Grant have been among the key contributors to the reshaping of the classical, set-theoretic foundations of mathematics during the last twenty-five years, with the introduction and study of new hypotheses about sets that have made it possible to solve many long-standing, open problems about the real numbers. Martin and Steel will continue working on this fundamental program, seeking to extend it and to delineate its limitations. Moschovakis changed interests about ten years ago, and his current research program aims to provide a rigorous, mathematical foundation for computer science. One of the main, ultimate aims of his work is to construct a \"logic of programs\" that will be useful in the development and verification of computing systems. ***","title":"Mathematical Sciences: Recursion Theory and Set Theory","awardID":"9505153","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["481153","543735","397649"],"PO":["256494"]},"1531":{"abstract":"9505118 Blass The research project of Andreas Blass is in four areas: (1) Cardinal characteristics of the continuum, including both the general theory of such characteristics (involving Galois-Tukey connections) and the detailed study of particular characteristics, especially the recently introduced evasion and prediction numbers. (2) Applications of set theory, especially in the theory of abelian groups. (3) Semantics of linear logic, especially game semantics and its variants. (4) Logic of topoi, particularly the logical properties of geometric morphisms. The research project of Glen Whitney concerns interpreting general recursive definitions, especially in non-determinisitic and concurrent contexts. Specific questions include: (1) Finding a universal class of structures with a recursion operation, so that every structure will be contained in one from this class. (2) Comparing proposals for the semantics of concurrent programming languages. (3) Seeking connections with fixpoint logics used in finite model theory. (4) Extending the current theory to allow more detailed modelings of parameter and message passing between subprograms. Both the formal language of recursion FLR, which Whitney will study, and Girard's linear logic LL, one of Blass' research topics, can serve as mathematical models of certain aspects of computing. FLR models recursion, i.e., programs using subroutines identical to the programs themselves. Whitney's project is directed toward improved understanding of recursion in the context of parallel computing, i.e. computations done collaboratively by many machines operating simultaneously. LL models data types; its game semantics models the situation where accessing data involves more of an interaction (access protocol) between the provider and the user of the data than mere transmission of data. Both theories are currently at the stage of mathematical exploration, but it is hoped that the information obtained w ill be of use in the design of future programming languages and in the formal verification of correctness of programs. Cardinal characteristics of the continuum are a way to exhibit and clarify the combinatorial content of difficult problems from various areas of mathematics -- originally topology and analysis, more recently algebra as well. They provide connections between these different areas and thus allow progress on a problem in one area to be applied in another. In addition, they make these problems amenable to treatment by the methods of modern set theory. The final topic in Blass' proposed research, topos theory, also serves to connect apparently disparate areas, mostly within mathematical logic. The particular topic of geometric morphisms of topoi combines ideas from set theory, from information systems (introduced as a model of computation), from sheaf theory (a part of topology), and from constructive logic. ***","title":"Mathematical Sciences: Topics in Logic and Set Theory","awardID":"9505118","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["330436"],"PO":["256494"]},"2566":{"abstract":"9508963 Ron The Mathematical Sciences Postdoctoral Research Fellowships are awards to recent recipients of doctoral degrees in the mathematical sciences. These awards are a means of contributing to the future vitality of the scientific effort of the nation. As researchers in the mathematical sciences expand their interactions with other disciplines, and as the interplay increases between the various areas of mathematics itself, opportunities for postdoctoral research and training are becoming increasingly important. The Fellowships are designed to permit awardees to choose research environments that will have maximal impact on their future scientific development. The fellowship is designed to provide 24 months of support divided into 18 academic-year months and three periods of two summer months. The recipient may choose (1) the Research Fellowship option which allows for full time support for any 18 academic year months in a three year period, in intervals not shorter than 3 consecutive months or (2) the Research Instructorship option which allows the 18 months of academic year support to be taken as nine months of full time support and 18 months of half time support. Not more than two months of summer support from this Fellowship may be received in any calendar year. Dana Ron will receive her doctoral degree from the Hebrew University and will pursue research under the guidance of Ronald Rivest at the Massachusetts Institute of Technology. The research will be conducted in computational mathematics and computer science, specifically in the development and understanding of learning algorithms.","title":"Mathematical Sciences Postdoctoral Research Fellowships","awardID":"9508963","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[5983],"PO":["313600"]},"1477":{"abstract":"Date: Fri, 19 May 1995 10:19:42 -0400 (EDT) From: Tien-Yien Li <li@math.msu.edu> To: thaler@nsf.gov Subject: Re: Proposal DMS-9504953 Mime-Version: 1.0 Dear Dr. Thaler: Thank you for your message concerning the partial funding of my proposal DMS-9504953. Homotopy algorithms for solving sparse polynomial systems Recently, it has been proved that modeling the sparse structure of a polynomial system by its Newton polytopes leads to a major computational breakthrough in solving polynomial systems by homotopy methods. The PI?s \"random product homotopy\" approach proposed in the project intends to construct a start system for the homotopy in random product form with its Newton polytopes containing those of the target system. On the other hand, the \"polyhedral homotopy\" based on an elegant formula for computing the mixed volume can find all zeros of a polynomial system by following much fewer, in most occasions the exact amount of, homotopy curves. Polynomial Systems occur everywhere in Mathematics, Science and Technology. Very small systems are easily solved by hand, but larger systems cannot reliably be so solved, if at all. The project aims to implement a portable solver using the latest in polynomial system solving algorithms and capable of being incorporated into applications programs. Research will be carried out to advance the state of the art and our understanding of polynomial systems; additionally, various application areas will be studied, such as kinematics, control theory, geometric modelling, and biochemistry in which problems reducible to polynomial system solving arise.","title":"Mathematical Sciences: Homotopy Algorithms for Solving Sparse Polynomial Systems","awardID":"9504953","effectiveDate":"1995-07-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485329"],"PO":["256494"]},"1422":{"abstract":"Mathias The investigator studies the accuracy of parallel algorithms for finding the eigenvalues and eigenvectors of linear systems and develops efficient parallel algorithms for eigenvalue problems, especially the nonsymmetric case. The first part of the project focuses on analysing the accuracy of parallel algorithms -- in particular 1. parallel prefix type algorithms 2. Jacobi algorithms for the (possibly generalized) symmetric eigenvalue and singular value problems 3. implementations of the Hessenberg QR algorithm. The question of accuracy is important, though little work has been done on it, because some parallel algorithms can be much less accurate than the corresponding serial algorithm -- so much so that the results that they produce are meaningless. The second part of the project seeks efficient parallel algorithms for the nonsymmetric eigenvalue problem and to improve the efficiency of the parallel algorithms for the symmetric eigenvalue problem. The nonsymmetric case is especially important as there is no algorithm for this problem that can properly exploit the capabilities of a parallel computer. Parallel algorithms are widely used and studied because they allow one to solve a computational problem in much less time than if one were to use a serial algorithm. As parallel computing becomes increasing common it is important to have parallel algorithms that are both accurate and efficient. The goal of this project is to provide such algorithms for problems in numerical linear algebra. Eigenproblems arise naturally in every area of science and technology, so effective algorithms to solve them have broad impact.","title":"Mathematical Sciences: Numerical Linear Algebra - Accuracy and Parallelism","awardID":"9504795","effectiveDate":"1995-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["246220"],"PO":["562372"]},"1323":{"abstract":"Proposal: DMS 95-04414 PI(s): Jianqing Fan - 1989, Stephen Marron - 1982 Institution: U of NC Chapel Hill Title: Processing Massive Noisy Data with Hidden Structure Abstract: This research involves a few inter-related statistical problems ranging from processing images and finding informative structure from massive data, to analyzing survival data, evaluating the success of a business advertisement and understanding the home range of animals. In contrast with traditional approaches, the methods do not assume any restrictive form, and are flexible enough to detect fine structures. This project covers a wide array of statistics methodological developments and foundational research. The new developments enhance the availability of statistical tools, and can lead to significant improvements on existing methods for extracting information from noisy data. Specific objectives are develop new statistical methodologies and investigate their foundational properties for flexible statistical modeling in processing high-dimensional data, nonparametric confidence intervals, mode detection and signal processing. Many scientific disciplines depend in some way on extracting structural information from noisy data. Fields ranging from processing noisy images and evaluating business marketing, to analyzing survival data and forecasting economic climates, which are universes apart in their backgrounds, nevertheless have the common problem of drawing conclusions via processing noisy signals. Such problems may be abstracted as a statistical function estimation problem and can be analyzed by various techniques in this project. The objective of this research is to develop and evaluate flexible statistical modeling techniques. These techniques can be applied in the Federal Strategic Areas such as monitoring environmental and global changes via processing massive collected data where informative structures can hardly be detected by traditional approache s, and building statistical modeling for economic and business activities in the civil infrastructure. The investigators will take advantage of modern computing facilities, and use statistical knowledge to avoid unnecessary data mining and hence reduce significantly data processing time. Thus, the knowledge gained in this study will also be useful in high performance computing of a federal strategic area.","title":"Mathematical Sciences: Processing Massive Noisy Data with Hidden Structure","awardID":"9504414","effectiveDate":"1995-07-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["396709","512317"],"PO":["517169"]},"1599":{"abstract":"The aim of this research is to develop vision algorithms for analysis of non-rigid motion from medical imagery. We will continue our algorithm development in snake tracking and image velocity field computation for assessment of tissue deformations and analysis of fluid flow from MRI and X-ray imagery, and extend the techniques to 3D. MRI is unique in its ability to non-invasively and selectively alter tissue magnetization, and create tagged patterns within deforming tissue such as the heart muscle. The resulting pattern defines a time-varying curvilinear coordinate system on the underlying tissue, allowing for precise and quantitative measurement of tissue motion and deformation from a sequence of images. The motion of these visible tag lines is tracked with Dynamic Programming (DP) B-spline snakes, and interacting B-spline deformable grids. Warp algorithms have been developed which continuously map two tissue regions in the plane such that two embedded grids of curves are brought into registration. For fluid flow field analysis, a scalar function formulation for optical flow has been developed. The novel aspect of the new optical flow framework is that it automatically enforces incompressibility on the resulting velocity field. Applications of the techniques to various experimental conditions are planned.","title":"Vision Algorithms for Analysis of Tissue and Fluid Deformations from Medical Images","awardID":"9505370","effectiveDate":"1995-07-15","expirationDate":"1996-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["74197","74196","436917","348892","74194"],"PO":["125480"]},"5714":{"abstract":"Robotic devices move autonomously, apply forces to objects in their environment, react to forces applied to them to achieve desired velocities, positions or impedances. Conventional robots use motors (active power transduction devices) to achieve these ends. This research examines a passive alternative to provide forces to resist motion initiated by a human or other active agent for the purpose of haptic display of remote or virtual environments or for guidance of the agent's motion. Ultimate applications are for virtual reality displays, for teleoperation, for surgical assistance, for exercise and for rehabilitation. The advantages of a passive approach include the elimination of inherent dangers of an active device and the reduction of cost and complexity when a power supply must be provided. This research will utilize a recently constructed prototype passive arm known as PTER (Passive Trajectory Enhancing Robot) as a test case. PTER has two degrees of freedom, coupled via electromagnetic brakes so that energy can be diverted in a controlled manner from one axis to the other. The research will explore the theoretical and practical aspects of the control algorithms to accomplish this coupling for purposes of haptic display such as PTER. The limitations of the passive actuators provide the uniqueness and challenge of the control. The control algorithm will be tested to determine effectiveness of the controlled passive device against two alternatives: (1) a direct physical display (not programmable) and (2) an electrically powered virtual display on an available kinematically identical robot. The measures of performance be both quantitative and subjective. The accuracy of the trajectory followed and the accuracy of representation of an environment's impedance (force-velocity relationship) can be quantitatively evaluated. Human operators will be employed to provide a more subjective evaluation on the effectiveness of the passive display. Example task s will be to follow a virtual maze as guided by the feel imparted by the device.","title":"Exploratory Research on Controlled Passive Haptic Displays","awardID":"9526322","effectiveDate":"1995-07-15","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["167538"],"PO":["125480"]},"4889":{"abstract":"9521766 Scruggs The University of Southern Mississippi requests support from NSF for a connection to the Internet through the MISNET regional network. MISNET (MISsissippi Higher Education Research NETwork) is the midlevel network located in the state of Mississippi that will provide operations and network information services. It will provide the University of Southern Mississippi with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The university needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the University of Southern Mississippi.","title":"Connect Gulf Coast Research Laboratory to MISNET","awardID":"9521766","effectiveDate":"1995-07-15","expirationDate":"1996-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[11931,11932],"PO":["43608"]},"1414":{"abstract":"This project focuses on the problem of power dissipation, primarily on the fundamental issues of what are the real sources of power dissipation in CMOS microprocessors, and what can be done to minimize it at a more global level. The goal is development and demonstration of techniques that would support Power-efficient Instruction Set Architectures (PISA). For this, there are four major tasks: 1. Developing technology independent models and metrics for power dissipation in CMOS logic. 2. Analyzing current day designs to benchmark the state of the art and to identify processor subsystems that are potential power hogs. 3. Development of new techniques that will reduce these metrics. 4. Demonstration of these techniques in a prototype CMOS PISA CPU chip. These new techniques will include gate design level approaches, but will focus primarily on organizational and instruction set architectural approaches that inherently have a lower power requirement. The end goals of this research s to develop a deeper scientific understanding of the relationship between power and computation, and develop techniques that minimize the ratio of the two ways that can broadly impact the continuing evolution of VLSI Technology and its successful use in computing.","title":"Inherently Low Power Computer","awardID":"9504767","effectiveDate":"1995-07-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["494776"],"PO":[3266]},"1799":{"abstract":"This NSF-CONACyT Collaborative research project concentrates on analyzing wait-free synchronous distributed systems. In particular, techniques from the abstract mathematical area of simplicial algebraic topology are applied as a powerful combinatorial tool. Specifically, as modern parallel and distributed systems scale up, there is an increasing need for algorithms and data structures to tolerate delays and failures. A data object or algorithm is wait-free if it guarantees that any process can execute any operation within a fixed number of steps, independent of the level of contention and the execution speeds of the other processes. The goal of this project is to work toward a comprehensive theory of wait-free synchronization. In the past few years, a number of researchers have developed powerful new tools, based on classical algebraic topology, for analyzing wait-free algorithms and data structures in a variety of models. These new techniques are used in developing a comprehensive theory of multiprocessor synchronization. The need for such a theory has become compelling as tec hnological advances have made concurrent and distributed platforms readily available. The topological approach to these problems may represent a powerful new combinatorial tool for Computer Science, not just for distributed computing, as for any problem area that requires reasoning about uncertainty and partial information.","title":"CONACyT: Applications of Algebraic Topology to Concurrent Computation","awardID":"9505949","effectiveDate":"1995-07-15","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["554181"],"PO":["150516"]},"1205":{"abstract":"9504067 Serene The purpose of this project is to develop parallel algorithms for many-body calculations for model systems and materials. The first goal is to elucidate the behavior of phase transitions for these models in self-consistent perturbation theories. In the vicinity of a phase transition, fluctuations of arbitrarily large length scales contribute to macroscopic thermodynamic properties, so large system sizes are required to quantitatively determine the properties of the phase transitions. In addition, a quantitative description of a phase transition requires accurate evaluation of small differences between macroscopically-sized free energies, for which a more accurate algorithm for evaluating infinite frequency sums was recently developed. This parallel algorithm can be extended from models to real materials, however the inclusion of multiple bands and the long-range Coulomb interaction requires substantial algorithm development. The second goal is to make progress in this direction, starting with development of algorithms for density response in the Random Phase Approximation and aiming towards the evaluation of self-consistent GW self-energies.","title":"Postdoc: Develop Parallel Algorithms for Many-Body Calculations for Model Systems and Materials","awardID":"9504067","effectiveDate":"1995-07-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1765","name":"CONDENSED MATTER & MAT THEORY"}}],"PIcoPI":[2767],"PO":["565272"]},"1349":{"abstract":"Proposal: DMS 9504485 PI: Frits Ruymgaart Institution: Texas Tech Title: Inverse Estimation Problems Abstract: Inverse estimation is concerned with indirect curve estimation: the curve of interest is to be recovered from observations, subject to random blur, on a transformation of the curve. This class of problems is very broad and formally contains ordinary, direct, curve estimation as a special case. Many interesting examples come from physics, signal processing, statistics, and applied mathematics. The estimation problem can essentially be solved by inverting the transformation involved. Since this inverse is not in general continuous, the problem is typically ill-posed and regularization of the inverse is required. Two important questions are how restriction, due to limitations in time or space, of the transformation relate to the unrestricted transformation, and how recovery of irregular curves can be modified so as to avoid the Gibbs phenomenon. Along with a comprehensive study of deconvolution on locally compact Abelian groups, this research addresses these questions. Also, the study of some examples of practical interest are explored. Inverse estimation arises when an object, e.g., part of the human brain, can only be indirectly observed, and recovery of information about the object is required from the indirect measurements. Indirect measurement techniques, such as those used in medical imagery, are attractive because they are noninvasive. Perfect reconstruction of the image would, in principle, be possible if an unlimited number of uncorrupted measurements were available. In practice, however, one can only obtain finitely many data that, moreover, are corrupted by measurement errors. Here statistical considerations and techniques play a role in the image reconstruction process. Aspects addressed in this research include how the reconstruction depends on the specific way in which the indirect data are collected, and al so how it should be tuned to prior information about the object to be recovered.","title":"Mathematical Sciences: Inverse Estimation Problems","awardID":"9504485","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["303840"],"PO":["331535"]},"1789":{"abstract":"This project deals with register optimization techniques for modern computer architectures. In modern pipelined architectures code is carefully scheduled to avoid unnecessary delays. However, some delay slots may be unavoidable. This project will develop techniques to `glean` unfilled delay slots to perform work normally considered not worthwhile, such as splitting live ranges into shorter ranges. Shorter ranges induce fewer register conflicts, allowing registers to be used for other purposes. Normally,registers are not used across procedure boundaries. The project will develop techniques to optimally allocate registers at the interprocedural level. More specifically, the techniques will attempt to avoid unnecessary register spilling on caller\/callee boundaries. The project will also investigate the use of idle processors to perform a variety of program correctness analyses. This is achieved using a `shadow` process which executes only when a processor becomes idle.","title":"Advances in Register Allocation and Efficient Run-Time Program Analysis","awardID":"9505922","effectiveDate":"1995-07-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["186565"],"PO":["150697"]},"1735":{"abstract":"The project develops the theory and implementation of a practical spatial geometric constraint solver that integrates symbolic methods from constructive geometry with numerical methods from homotopy continuation theory. Geometric constraint solvers are a key component in modern Mechanical Computer-Aided Design systems, and offer a critical technology for increased productivity, rapid response manufacturing, and agile manufacturing. Effective solvers exist for planar constraints, but spatial problems of moderate size exceed the capabilities of many research solvers. The solver being developed will cover the broad class of problems specified by distance, angle, and incidence constraints among points, lines, and planes. It will solve small problems interactively and problems of moderate size in a few seconds. Using a constraint graph whose nodes represent elements and whose edges represent constraints, a constraint analysis will decompose the constraint problem into a series of small construction problems that can be solved efficiently using preprocessing. Elementary constructions will be carried out algebraically, more complex construction steps by homotopy continuation. The hybrid algorithm combines the robustness and completeness of symbolic methods with the uniformity and efficiency of numerical methods.","title":"Spatial Geometric Constraint Solving Using Constructive Geometry and Homotopy Continuation","awardID":"9505745","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["402028","425107"],"PO":["187585"]},"1625":{"abstract":"Descriptive complexity is an approach to complexity theory that measures the richness of a language or sentence needed to describe a given property. The language studied are variants of first-order logic and their targets are finite, ordered structures. In this setting, there is a non-trivial relationship between the traditional computational complexity of a problem and the descriptive complexity of the problem. Indeed, all major complexity classes have been shown to have natural descriptive characterizations. This project continues this research into descriptive complexity by concentrating on the following four research areas: (1) Order-independent languages; (2) First-order interpretations; (3) Applications to databases and dynamic complexity; (4) Trade-offs in descriptive complexity.","title":"Descriptive Complexity","awardID":"9505446","effectiveDate":"1995-07-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["485266"],"PO":["150516"]},"1978":{"abstract":"This objective of this research is to develop a computational framework for behavior modeling adapted to the problem of creating complex scenarios in large-scale virtual environments. The project will develop a modeling system based on hierarchical, concurrent state machines that supports the control of reactive behaviors and provides mechanisms for coordinating behaviors to create critical situations and events. A second research thrust is to create authoring tools to facilitate the design of virtual environments and the definition of scenarios in which computer generated agents play central roles. This technology has application in interactive, real-time simulation environments such as vehicle simulation for driver training, virtual prototyping, and experimental studies of driving safety that require dynamic situations and circumstances to be reproduced across trials without overly restricting subject's actions and while maintaining diversity, responsiveness, and spontaneity in agent behaviors.","title":"Behavior Modeling and Scenario Authoring for Virtual Environments","awardID":"9506624","effectiveDate":"1995-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["543444","543446"],"PO":["565227"]},"1626":{"abstract":"During the past decade, the quantitative analysis of random processes has led to dramatic advances in the design of efficient algorithms for fundamental computation problems. The PI is continuing research on the application of these ideas, as well as beginning to investigate new paradigms based on nonlinear and cooperative processes. Specifically, the project focuses on the following directions: (1) the analysis of mixing rates of Markov chains, with applications to efficient algorithms for problems in statistical physics and combinatorics; (2) the study of computational complexity of counting problems, and their classification with respect to efficient approximability; Algorithmic applications of nonlinear random processes, in particular quadratic dynamical systems; (3) the theoretical and experimental study of general randomized search heuristics in combinatorial optimization, including Metropolis algorithm, simulated annealing, and cooperative processes.","title":"A Proposal for Research on Random Processes and Algorithms","awardID":"9505448","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["450995"],"PO":["150516"]},"280":{"abstract":"This project continues investigation of the complexity of differential and integral equations. New problems to be studied include the following: (1) Problems with singular data. Special attention is paid to problems on domains having corner singularities, whose coefficient data has known singularities, and problems for which the forcing function has a singularity of a given type. (2) Exterior problems. The research concentrates on the Helmholtz problem on exterior domains, which arise in scattering theory. (3) Further work on mixed derivative spaces. The research concentrates on problems, as well as the possible optimality of finite element methods. (4) Stochastic differential equations. These problems arise in many areas, such as science, engineering, and finance. Nothing is known about their complexity. The complexity of optimal algorithms for such problems is being studied.","title":"Complexity of Differential and Integral Equations","awardID":"9500850","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["124456"],"PO":["187585"]},"2518":{"abstract":"This project is developing and evaluating new techniques for tool-assisted restructuring of large systems. The excessive cost of software evolution is due in large part to inappropriate structure of a system, relative to the changes taking place. Tool-assisted program restructuring is studied for changing a system's structure at lower cost and risk than making changes by hand. In this approach, a tool user selects transformations to apply to chosen program components. The tool checks to make sure that each transformation will preserve the functional behavior of the program. If so, it performs the transformation to the chosen component and updates any related components to preserve consistency. Tool-assisted restructuring has not been demonstrated to be practical in industrial-scale applications. For example, exhaustive interprocedural data flow analysis is required by some tools, but is costly to perform on large programs. Previous restructuring research has not addressed common complicating constructs such as pointer arithmetic, function pointers, comments, textual macros, and conditional compilation. To make the restructuring of large programs practical, this project is developing and adapting techniques to address these problems. Demand-driven data flow is being investigated to overcome many performance problems of exhaustive data flow analysis. Query prioritization and caching of replies are studied to minimize burdensome and potentially incorrect user queries. Testing and semantic differencing may also provide checks of correctness after restructuring. A case study is intended to evaluate the techniques developed and the benefits of large-scale restructuring.","title":"Practical Program Restructuring for Software Evolution","awardID":"9508745","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["564209"],"PO":["150697"]},"1749":{"abstract":"The project will focus on the specification, programming, and implementation of different kinds of distributed shared memories. Proof techniques and programming methodologies will be developed for dealing with the complexities in these definitions. Conditions will be developed under which programming with these weak memories has the same net effect as programming in the more familiar sequential domain. The developed methodologies will support both a posteriori as well as a priori approaches towards program design and verification. A testbed for distributed shared memories will be implemented. This testbed will function in a heterogeneous environment of a parallel machine and a high- performance local area network, and will be used for experimenting with protocols and applications from the scientific, database, and digital libraries domain. The testbed will also support distributed simulation of shared memories and architectures.","title":"Distributed Shared Memories: Specification, Programming and Implementation","awardID":"9505807","effectiveDate":"1995-07-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["536696","536697"],"PO":["250083"]},"2818":{"abstract":"The Ohio Supercomputer Center (OSC), under the direction of the PI's, will develop comprehensive documentation for MPI (Message- Passing Interface) cluster software called LAM. LAM is currently supported on networks of workstations. The documentation will enable other researchers in academia to utilize LAM for building parallel processing applications quickly. The project will also port the software to low-end UNIX platforms and high- end shared memory multiprocessors systems supporting Symmetric Multiprocessing (SMP) UNIX. Small business users will benefit from the availability of the software on low-end workstations. The project is supported under the Software Capitalization Grants program.","title":"Software Capitalization Funds for a Cluster Implementation of MPI","awardID":"9510016","effectiveDate":"1995-07-15","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["30778",6599],"PO":[6600]},"592":{"abstract":"Replication is key to achieving performance and fault tolerance in widely distributed systems. Conservative replica management schemes do not scale well, yet optimistic approaches depend in complex ways on workload, architecture, topology, and failure modes of the system. This research captures the design space for optimistically replicated systems in a flexible, object-oriented, simulation model, allowing alternative architectures to be evaluated on a `level playing field.` The object-oriented nature allows specialization of model components, permitting experimentation with alternative designs, communications bandwidths, failure distributions, workload models, etc. A flexible workload generation tool which can be tuned to produce synthetic traces matching the statistical properties of various anticipated environments is also produced. The simulation and synthetic trace generator are validated by comparison with analytical models and measurements of real systems. This reqearch will enable designers of a broad range of distributed database and filing systems to assess the impact of an optimistic app roach to achieving high performance and availability in large scale systems. The educational plan seeks to add a `hands-on`, experimental component to the operating systems curriculum. Synchronization, scheduling, and concurrency control simulation labs are constructed and piloted using the same object-oriented simulation methodology as in the research plan. This provides a balance to the current theoretical approach to teaching operating systems to both undergraduate and graduate students.","title":"Performance Evaluation of Optimistic Replicated File System Architectures","awardID":"9501812","effectiveDate":"1995-07-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["10385"],"PO":["563751"]},"791":{"abstract":"Efficient communication is central to parallel computing. Modern multiprocessors obtain high bandwidth, low latency user-level communication through special hardware support, often implemented as a dedicated communications co-processor. Future parallel machines, including high performance networks of workstations, will be built using communications co-processors. The goal of this research is to study how the presence of a dedicated co-processor affects the performance of interprocesor communication in modern parallel machines. In particular, the project focuses on two aspects. First, it studies the impact of communications co-processors on the performance of various communication primitives and determines the architectural requirements for implementing efficiently many-to-one communication such as active messages. Second, it studies how the communications so-processor can be captured by a theoretical performance model. The goal is to derive a performance model that is realistic enough to characterize machines and accurately predict performance, but still simple enough to be used in designing and analyzing parallel algorithms. To study these questions, the project takes a vertical approach, spanning theory, applications, languages, systems software, and architecture. The project constructs a complete system which allows taking an in-depth look at how efficient communication affects all of these layers. The project leverages off the work on active messages, the parallel languages Split-C, and the LogP performance model, developed at UC Berkeley. The main experimental platform is a 64-processor Meiko CS-2, which the UCSB Computer Science Department acquired through an NSF CISE infrastructure grant. The CS-2 reflects, a modern high- performance network of workstation enthronement equipped with communications co-pocessors, making it extremely well suited for the study. The principal investigator has already implemented active mess ages and Split-C on the CS-2. The project develops a realistic model for parallel computation which captures the capabilities of communication co-processors. To create a framework to characterize communication and measure its performance, the project implements a simulator based on this model as well as a Split-C profiler. This framework is used to fine-tune applications and for architectural studies. Besides answering these important research questions, the work also provides infrastructure which is used for teaching purposes as well as by other researchers. The principal investigator ismstriving for a well balanced career as a professor in computer science, combining teaching and research. His areas of interest are parallel computing, computer architecture, languages, and compilers. His educational objective is to teach students in these fields, to get them excited about computer science and engineering, and to prepare them for a successful professional career.","title":"CAREER: Efficient Communication Primatives and Realistic Models for Modern Multiprocessors","awardID":"9502661","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["194103"],"PO":["74434"]},"571":{"abstract":"9501723 Bayer This awards supports the research of Professor D. Bayer to work on methods for computing in both algebraic geometry and topology. In algebraic geometry he will focus on the connections between toric varieties and integer programming. In topology he will study methods to compute on 3-manifolds. He hopes to use the interplay between topology and algebraic geometry such as the interpretation of the Haken normal surface as a Hilbert basis for a polyhedral cone. Finally he proposes to develop virtual reality software for direct manipulation of 3-manifolds. The research starts out in algebraic geometry and then moves on to topology. Both are among the oldest parts of modern mathematics, but both have blossomed to the point where they have, in the past 10 years, solved problems that have stood for centuries. Originally, Algebraic Geometry treated figures defined in the plane by the simplest of equations, namely polynomials. Today, the field uses methods not only from algebra, but also from analysis and topology, and conversely it is extensively used in those fields, but it has applications to many areas of engineering as well. The research supported in the present proposal shows the importance of this once purely theoretical area for robotics and manufacturing. Topology studies the properties of objects that are invariant under transformations that do not tear the surface. It is extensively used in such areas as Physics and Chemistry where the shapes of objects are fundamental to determine their properties. ***","title":"Mathematical Sciences: Computational Methods in Algebraic Geometry and Topology","awardID":"9501723","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["527362"],"PO":["125589"]},"461":{"abstract":"Many emerging networked applications have the property that communication among nodes is asymmetric. Typically, servers can and\/or must send much more data to clients than clients send back to the servers. Examples include wireless networks with mobile clients, cable and direct satellite broadcast TV systems, information dispersal and information retrieval applications. Broadcast Disks technique exploits the characteristics of such environments, by treating a broadcast stream of data that are repeatedly and cyclicly transmitted as a storage device. The essence of this approach is to superimpose multiple broadcast programs (or `disks`) spinning at different speeds on a single broadcast channel; in effect, creating an arbitrarily fine-grained memory hierarchy. The technique also integrates the use of client storage resources for caching and prefetching data that is delivered over the broadcast. The Broadcast Disks approach provides improved performance for non-uniformly accessed data and increased availability of important data. The challenges being addressed in this project include: broadcast program generation, caching and prefetching strategies, and adapting to volatile data, changing client needs, and communication errors. The results of this research will be techniques, analyses, and prototype implementations of this novel approach, which has the potential to significantly improve the performance and availability of future distributed computing systems. The education portion of this project aims to develop new courses, software tools and laboratories that will provide students at all levels with more direct, hands-on experience in building database systems and applications.","title":"CAREER: Broadcast Disks: Technique for Data in Management in Asymmetric Communication Environments","awardID":"9501353","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["497162"],"PO":["563751"]},"1907":{"abstract":"This project exploits recent advances in the use of sophisticated mathematical methodologies to address related fundamental questions in the foundations of computation theory and programming language semantics. Many important questions arise out of a desire and need to capture in a semantic setting both minor and major variations in computational strategies. The significance in investigating such variations lies in the fact that they can both provide a means of interpreting increasingly sophisticated programming language constructs, and also isolate fundamental mathematical processes at work that help define and distinguish between different notions of computation. The main focus of the research entails the utilization of new approaches in the use of algebras, monads and comonads, categories, logic and sheaves to provide a systematic and conceptual approach to the interpretation and solution of these questions. Questions to be addressed include: finding an algebraically robust interpretation for partial data types and partial maps; generating an intrinsic characterization of fixed point constructions, including the generation of recursive data types, and isolating the special role of invariance in this process; defining a categorical foundation for semantics in general and describing a synthetic domain theory in particular; and identifying and utilizing in a semantic setting logical properties resident in sheaf-theoretic structures. General areas of investigation include partial data types and computation, fixed point semantics, monadic and comonadic computation, invariance and algebras, and partial sheaf semantics. Technical tools include functorial liftings on categories of algebras, refined partial map classifiers, algebraic uniformity, induction and coinduction principles, natural and dinatural transformations, monadic and comonadic strength, domain theory and extensional PERs.","title":"RUI: Categorical Methods in Computation and Semantics","awardID":"9506383","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[4422],"PO":["150697"]},"395":{"abstract":"This award supports the research of Professor Alexandre Barvinok on the construction of algorithms for computational problems in combinatorics and algebra. The main goal is to find non-trivial upper bounds for the computational complexity of these problems by exploring the underlying algebraic structure. Three specific topics are being investigated. The first topic includes the applications of exponential sums to a wide range of computational problems. The second deals with applications of the representation theory of the symmetric group to hard problems in combinatorial optimization. The third topic involves quantifier elimination in integer programming, a specific unresolved question concerning integral points in polyhedra. The algorithms developed have potential practical applications to real world problems that reduce to hard enumeration. This research is in the general area of Combinatorics. Combinatorics attempts to find efficient methods to study how discrete collections of objects can be arranged. The behavior of discrete systems is extremely important to modern communications. For example, the design of large networks, such as those occurring in telephone systems, and the design of algorithms in computer science deal with discrete sets of objects, and this makes use of combinatorial research.","title":"Mathematical Sciences: Algebraic Methods in Optimization","awardID":"9501129","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["398388"],"PO":["74010"]},"572":{"abstract":"There is an intimate relationship between the algorithms used in communication and magnetic storage systems, the integrated circuits (ICs) which implement the algorithms, and the system performance which results. As systems increase in complexity, trade-offs and innovations need to be made at all levels of a system design in order to drive system\/circuit performance to approach fundamental limits. This research is pursuing teaching and research plans which have the goal of developing students into engineers prepared to make significant and important technical contributions to the development of high performance communication and magnetic storage systems. On the side of teaching, the goal is to develop a curriculum which encourages students to make connections between both the theoretical and practical aspects of electrical engineering. The curriculum needs formal methods to bring out the synergy that exists between these two aspects of their field. On the side of research, the fundamental theme is to examine algorithms and architectures important in communications applications, identify performance or speed limitations of conventional implementations of the algorithms and architectures from an IC implementation perspective, develop ways in which modifications may result in implementation advantages, and prototype the new approaches in order to demonstrate its potential advantages. Proposed projects include the development of analog, digital, and mixed-signal ICs for wireless satellite and infra-red, wired LAN, and magnetic disk read channel applications.","title":"Research and Education in Integrated Circuit Design for Communication and Magnetic Storage Systems","awardID":"9501726","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["101335"],"PO":["564898"]},"462":{"abstract":"This CAREER award supports research and instruction in the empirical evaluation of software inspection methods. Software inspection is a widely used, but very expensive validation process. Initial research has demonstrated that many of the assumptions underlying this process are incorrect and, therefore, this research involves the following three families of experiments. (1) Comparing defect detection techniques. This experiment compares the cost-effectiveness of systematic inspection techniques with that of the standard Ad Hoc and Checklist approaches. Its hypothesis is that systematic inspection techniques are more effective that the nonsystematic ones currently being used. (2) Cost-benefit studies. This experiment is conducted on a live development project to compare the tradeoffs between minimum inspection interval and maximum effectiveness for several different inspection approaches. Its hypothesis is that several recently proposed methods significantly increase interval, but provide only a slight improvement in effectiveness. (3) Inspection entry criteria. This experiment attempts to establish whether or not an artifact's quality affects inspection effectiveness. Its hypothesis is that traditional inspections are not effective for artifacts with very high or very low defect density. This research is also producing materials that enhance both graduate and undergraduate teaching. This includes a 4-week teaching module in which students perform experiments, collect and analyze data, and test hypotheses as part of a graduate software engineering course. An undergraduate software development course is being developed in which all students work together to develop one large-scale application, for real customers with real needs.","title":"CAREER: Empirical Investigations of Software Inspections","awardID":"9501354","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["485900"],"PO":["150697"]},"771":{"abstract":"The thrust of this proposal is on backward recovery schemes for multicomputer and distributed systems. The proposed research is based on a two-level approach that uses a low overhead recovery scheme to tolerate more probable failures, while the less probable failures may be tolerated with a higher overhead. By minimizing the overhead for the more frequently occurring failure scenarios, the proposed two-level approach will achieve lower average performance overheads as compared to existing recovery schemes. Objectives of the proposed research are 1) the design of efficient two-level recovery schemes, 2) the development of optimization techniques for two-level recovery schemes to determine various parameters (e.g., checkpointing frequency) that willminimize the average performance overhead fo the recovery scheme, 3) the implementation of two level recovery schemes on a 64 processor nCUBE-2 multicomputer and on a network of workstations, and 4) the experimental evaluation of two-level recovery schemes to demonstrate their ability to achieve better performance than the existing recovery schemes. The goal of the proposed education activities is to incorporate the results of recent research into undergraduate and graduate curriculum. specific objectives fo the education plan are 1) the development of an undergraduate introductory course on fault tolerance and a graduate course on fault tolerance techniques for parallel and distrubuted systems, 2) the development of an associated undergraduate research effort, and 3) the development of a software toolkit to facilitate experimetns in the proposed courses.","title":"Two-Level Failure Recovery Schemes for Multicomputers and Distributed Systems","awardID":"9502563","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["553537"],"PO":[1727]},"199":{"abstract":"This award supports the research of Professor Doron Zeilberger in the areas of algebraic combinatorics, the theory of special functions, and computer algebra. One direction of this project is a continuation of his research program on the use of computer algebra for computerized proofs of identities in combinatorics and the theory of special functions. Other goals of this project include the development of a general theory of permutation statistics, the study of holonomic aspects of combinatorial statistical mechanics, and the extension of methods developed in the principal investigator's recent proof of the alternating sign matrix conjecture to other, still open, problems in this area. Because both special functions and combinatorics are so prevalent in the natural sciences, this research has many potential applications to both science and technology, as well as to pure mathematics. This research is in the general area of combinatorics. Combinatorics attempts to find efficient methods to study how discrete collections of objects can be arranged. The behavior of discrete systems is extremely important to modern communications. For example, the design of large networks, such as those occurring in telephone systems, and the design of algorithms in computer science deal with discrete sets of objects, and this makes use of combinatorial research.","title":"Combinatorics, Special Functions, and Computer Algebra","awardID":"9500646","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["399257"],"PO":["75677"]},"783":{"abstract":"NCR-9502615 Vojcic, Branimir An objective of this research is to assess the performance limits of communications systems employing multiuser detection and find receiver structures with practical complexity that achieve near optimum performance. Topics treated include: multiuser transmitter precoding for synchronous channels; combined multiuser detection and forward error correction; soft interference cancellation and optimization in multiuser detection; hybrid nonadaptive multiuser detection and adaptive interference cancellation; multiuser detection design for mismatched channels; limiting performance of multiuser detection and interference cancellation in terrestrial, satellite, and indoor communications. In the education component symbolic computation and visualization software will be used to improve the presentation and learning processes. Combined software\/hardware simulation tools will be used and developed, involving both undergraduate and graduate students.","title":"CAREER: Research in Multiuser Detection and Innovative Approaches in Teaching","awardID":"9502615","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["258107"],"PO":["150411"]},"684":{"abstract":"The demand for network services is growing at an exceptional rate. This growing demand requires that the necessary infrastructure be developed to facilitate rapid and easy access to vast, distributed information stores. The focus of this research is the essential base technologies required to make distributed information systems generally useful. Specifically, this research includes: high performance file system design and analysis, rotationally optimal disk scheduling, and distributed caching data. The research will result in a high-performance, distributed information server, utilizing new file system techniques, advanced disk scheduling algorithms, and caching based upon network topological location (geographical push-caching). The file system design borrows the essential characteristics of today's log-structured and journaling file systems, combining them with adaptive, rotationally optimized disk scheduling techniques. New caching techniques designed for scalability enhance the file system's feasibility by reducing user-perceived latency for distributed requests. The teaching component emphasizes curriculum development for both computer science concentrators and non-concentrators and training programs for undergraduate and graduate teaching assistants. For concentrators, the focus on undergraduate curriculum complements Harvard's commitment to the establishment of a strong computer systems research group. Undergraduate courses have been and will continue to be modified to incorporate the fundamental concepts in an area, the classic literature, and research activities. This combination of class activities is the cornerstone for producing undergraduates who can fully participate in ongoing research projects. For non-concentrators, the introductory computer science sequence has been modified to emphasize design and problem solving skills over programming mechanics. Future developments will extend this idea still further with the development of an introductory design course. The course is intended to serve both as a common ground for computer science and engineering concentrators as well as a broad introduction for non-concentrators. The focus of the graduate curriculum development is on the application of the scientific method to systems research. Students are asked to critique published work, design experimental evaluation platforms, analyze and critique data sets, and produce quality research. The last aspect of the teaching proposal is the development of teaching assistant training seminars. Professor Seltzer has been working closely with the Derek Bok Center for Teaching and Learning, participating in their workshops and presenting panels and seminars with her teaching assistants. The orientation procedure she has developed will be enhanced so that it will be suitable for teaching assistants in all compute science classes, and potentially other fields.","title":"CAREER: High Performance Storage Systems","awardID":"9502156","effectiveDate":"1995-07-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["541948"],"PO":["74434"]},"641":{"abstract":"The goal of this project is to develop reasonable complexity, source independent coding algorithms. Source independent algorithms are crucial to the design of robust systems for applications such as image coding and mobile communications. In applications of this type, the statistics of the source and channel in operation are typically unknown a priori, and the performance of the strategy employed is sensitive to those unknown statistics. The approach taken is the two-stage approach developed in the source coding literature. Given a space of possible sources and a particular coding strategy (e.g., VQ, DCT-based transform codes, etc.), for each source in the space there exists an optimal code. Designing a single code is equivalent to quantizing the space of possible codes to 0 bits; the entire space of optimal codes is approximated by a single code that does well on average across the data. The two-stage coding literature demonstrates that in general we should quantize the space of possible codes more finely. Some of the rate should be spent on describing which code, in a family of codes, should be used on the source in operation. Specific projects being completed in this research include the development of a universal DCT code compatible with existing JPEG and MPEG image and video coding standards, a universal KLT code, a universal wavelet packet code, and a universal channel code. The main objectives of the education plan are to develop and maintain an exciting atmosphere of active learning for undergraduate and graduate students. This objective is being accomplished through innovative programs geared at helping students to participate fully in their own education and by developing an atmosphere that encourages the maximum possible exchange between students, faculty, and members of local industry.","title":"Code Clustering for Universal Image Coding and Other Implications","awardID":"9501977","effectiveDate":"1995-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["551140"],"PO":["564898"]},"256":{"abstract":"DMS-9500792 Maier The proposed research will apply the tools of singular perturbation theory to the estimation, in various asymptotic limits, of the probability of unlikely events associated with drift-diffusion and other stochastic models. It is often the case that the leading asymptotics of such probabilities are rigorously specified by large deviations theory. Singular perturbation theory, in particular Maslov-WKB theory, permits the formal computation of subdominant asymptotics. Specific stochastic models to be studied include models arising in teletraffic engineering and chemical physics. Physical, chemical, or engineering systems often have a random element. As a consequence, it may be difficult to predict their long-time behavior, or the rate at which unlikely events (large departures from equilibrium, severe equipment malfunction, etc.) are likely to occur. It is important to be able to estimate the frequency of such events. The proposed research will develop and apply mathematical tools to this end.","title":"Applications of Semiclassical Asymptotics in Stochastic Modelling","awardID":"9500792","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["153343"],"PO":["209579"]},"972":{"abstract":"The goal of this research is to achieve robust parsing and disambiguation of purposeful, spoken dialogs, where ordinary phrase and sentence structure may be disrupted by acknowledgements, self- editing, correction and clarification subdialogs, etc. The primary means for achieving robustness and on-line disambiguation will be (1) an incremental `dialog chart parser` that fully integrates all levels of analysis from the level of words and prosody to the level of dialog segment structure; and (2) a `preference trade-off` technique for selecting preferred analyses on-line, using lexical, syntatic, semantic, and discourse structure preferences encoded as numerical potentials. Potentials will be statistically `tuned` using available text corpora and the TRAINS planning dialog corpus collected at the University of Rochester. The significance of the research lies in the fact that dealing simultaneously with phrase structure and dialog structure, and coping with rampant ambiguity, are two of the most important challenges still facing natural human-machine communication. The advent of robust, preference-seekin g dialog parsers will provide a basis for genuine, practical dialog understanding in a wide variety of intelligent agents offering interactive assistance in planning, problem solving, crisis management, and information retrieval","title":"Robust, Incremental Parsing and Disambiguation for a Dialog Agent","awardID":"9503312","effectiveDate":"1995-07-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["517044","409565","450916"],"PO":["183208"]},"774":{"abstract":"This research is developing a new approach to manufacturing test of VLSI chips. Digital signals are treated as analog waveforms, so that logic events at internal nodes can be understood. To do this, rise-fall and glitching characteristics of output signals are being studied using time and frequency domain analog signal analysis techniques. Using this approach: 1. failure methods are being determined; 2. test generation algorithms for stuck-at faults in combinational and sequential circuits are being investigated; 3. methods to detect marginal chips are being explored; 4. very rapid wave pipelined testing is being developed. A signal waveform analysis system is being designed.","title":"Testing of Digital Circuits by Signal Waveform Analysis","awardID":"9502575","effectiveDate":"1995-07-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550643"],"PO":["321058"]},"664":{"abstract":"This project is investigating the use of HyTime for the purpose of supporting content-based or semantic navigation in a networked information environment. HyTime is a standard (ISO\/IEC 10744:1992) for representing the structure of hypertext and multi-media documents. HyTime extends Standard Generalized Markup Language (SGML) with semantic extensions at the meta level. HyTime semantic links are roughly analogous to relationships that might appear in the schema of a conventional database. The investigation consists of four steps: (1) definition of HyTime links on real-world data, (2) assessment of the utility of HyTime links for content-based navigation, (3) construction of a simple prototype demonstration of HyTime on real-world data, and (4) initial consideration of the feasibility of integrating HyTime information with database data. The goal for this work is to provide semantic or content-based navigation for users of the National Information Infrastructure or similar networked-environment and to consider the potential for semantic links between the world of documents with the wmrld of database objects.","title":"SGER: Content-Based Connections for Navigating on the NII","awardID":"9502084","effectiveDate":"1995-07-15","expirationDate":"1996-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["483300","533018"],"PO":["530053"]},"785":{"abstract":"9502631 Hanrahan This award provides support for a high performance giga-flop compute server, a high performance 3D graphics server, a high performance image\/video\/data server, and a high bandwidth network to couple these machines together. The requested equipment will contribute to the computational infrastructure of a new computer graphics laboratory. Many national challenges such as health care, education, manufacturing, and crisis management, require graphics and imaging technologies. The investigators will be working in the areas of graphics systems and algorithms, involving research in efficient rendering algorithms, high-performance graphics architectures, and coupling compression and graphics; in scientific visualization with research in volume rendering for scientific and medical applications; in vision and graphics with research in the digitization of 3D models; and in imaging and video with a focus on the manipulation of image and video databases.","title":"CISE Research Infrastructure: High Performance Graphics and Imaging","awardID":"9502631","effectiveDate":"1995-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["483871","438512"],"PO":["557609"]},"697":{"abstract":"The objective of the research being done if to devise a set of techniques and tools that will allow improvement, simplification, and clustering of polygonal datasets within a unified framework. This is an important first step towards the long-term objective of formulating techniques to enable interactive visualization of complex virtual environments. The techniques being used to solve the above problems are al based on the notion of `rolling a sphere`, formalized by the concept of a-hulls. For improving the existing polygonal datasets that have cracks and small missing polygons the intuitive idea is to roll a sphere that will fill-up these minor holes.Such flaws are common in present-day datasets and no general techniques are currently known that will handle them in a unified manner. Simplification of polygonal objects will be achieved through simplifying the genus of the objects. This provides a natural extension to, and is orthogonal to, the existing techniques for creating topology-preserving multiresolution hierarchies. The research being done will remove topological features that are less than a user-specificable size. Clustering of polygonal datasets is of considerable use in devising efficient methods for solving global illumination and visibility preprocessing for interactive walkthroughs of synthetic environments. This research will accomplish clustering of polygons in a dataset by using sufficiently large rolling spheres. The goal of the educational activities being done is to expand the current entertainment-oriented view of virtual reality by presenting it as a useful tool for serious tasks in engineering, science, and medicine. The activities include attempts to reach out to the high-school students, undergraduates, and the community at large through slide-and-video shows and hands-on demonstrations of the scientific applications of virtual environments. The activities also include the creation and development of a new graduate-level course on virtual environments. The tools and techniques developed for the research component of this project will be used to impart a hands-on education to inculcate a feel for application-oriented research and development work in virtual environments.","title":"CAREER: Improvement, Simplification, and Clustering in Polygonal Datasets for Virtual Reality Applications","awardID":"9502239","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["543581"],"PO":["187585"]},"632":{"abstract":"This research focuses on a comprehensive approach to achieving individual and collaborative interactions for extremely complex simulation data. Such datasets would overwhelm existing systems. They often share many common attributes in their organization, data evolution and dependencies, and patterns of shared, coherent access by human or automated agents. These commonalties can be captured through a suitable set of abstractions, and exploited to achieve fundamental improvements in methods for manipulating, sharing, and understanding such broad collections of data. Specifically, the project is aimed at constructing a system for interactive visualization of extremely complex datasets, by developing techniques for: (1) query factoring, (2) predictive fetching, (3) detail degradation, (4) conservative algorithms, (5) hybrid cost metrics, and (6) an interactive tool infrastructure. The educational component addresses the potential for collaborative interactive techniques to improve pedagogy at the undergraduate, graduate, and professional levels, and performance evaluation at the undergraduate level.","title":"Interactive Simulation and Navigation for Collaborative Research and Pedagogy","awardID":"9501937","effectiveDate":"1995-07-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["279427"],"PO":["495796"]},"842":{"abstract":"Parallel computers are difficult to program. Often, users have to specify the parallel execution, i.e., to specify data distributions to different local memory modules (as in High Performance Fortran), data communications between processors, and processor synchronizations. The insufficient programming support limits the applicability and further development of parallel systems. The objectives of this research are (1) to search and find solutions (optimal or feasible) for those fundamental problems in programming parallel systems such as how to distribute\/replicate input data to different local memories in the system to minimize inter-processor communications, how to schedule and partition the computations to minimize the overall running time, how many processors should be used and how to choose the right message size for a message vector; (2) to develop new techniques for data alignment, scheduling partitioning and estimating the number of processors to be used for optimal execution of algorithms with nested loops; and (3) to implement these techniques and add them to some existing software tools such as PVM and MPI. Education: The education plans are as follows: (1) Undergraduate computer architecture lab at Santa Clara University has not been changed for six years and is obsolete. It is planned to update the lab and syllabi and redesign the students' projects to include recent advances in computer design, technology and debugging software to have students more motivated and prepared when they graduate. (2) Develop new parallel processing lab projects. One project is to have students run parallel programs in PVM environment so students can see and think those fundamental problems in parallel programming. (3) Be involved in mentoring women and underrepresented undergraduates and graduate students. (4) Do research projects with several senior undergraduate students, especially women engineering students to motivate them to pursue graduate studies in computer engineering at SCU","title":"CAREER: Fundamental Problems in Parallel Programming","awardID":"9502889","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["23927"],"PO":["74434"]},"578":{"abstract":"In software systems, tools such as compilers, testers, and debuggers require static semantic information, both to insure their correctness and to enhance performance. Incremental update algorithms, which only calculate data flow information affected by the program changes, avoiding total recalculation, efficiently provide consistent documentation for a large evolving software system. Previously, incremental techniques for Fortran-like languages and exhaustive analyses for C programs have been developed. When these analyses of C systems produce solutions, they are inexpensive and high quality; however, often the analyses exhaust available resources without yielding a complete solution, especially for larger programs (over 5,000-10,000 lines of code). This research aims at expanding the applicability of exhaustive techniques to handle a wider class of programs and developing incremental techniques for C systems. The work is performed by an academic and industrial team, focusing on the development of new analysis techniques and their testing on research industrial applications. Goals are to: (i) scale the existing prototype to handle programs with 10,000 to 100,000 lines of code, (ii) develop techniques for analyzing modules without analyzing the entire program (i.e., a separate compilation mode of analysis),(iii) develop incremental techniques for interesting interprocedural static analyses for languages with general purpose pointers, and (iv) enhance the theoretical infrastructure for semantic analysis of modern programming languages (i.e., C, C++, and Fortran 90). The research explores techniques for varying the precision of alias information by designing new, flow-insensitive methods, to augment our current flow-sensitive ones. Partitioning the program variables allows for an aliasing solution with varying degrees of precision for different sets of variables. Experiments are conducted varying the value of k for these different sets, using k-limiting to handle dereferencing in recursive structures. A hybrid incremental analysis algorithm is used as a basis for incrementalizing side effect analysis of C programs.","title":"Scalable Static Techniques for Exhaustive and Incremental Analyses of C Systems","awardID":"9501761","effectiveDate":"1995-07-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[1326,"438877"],"PO":["150697"]},"821":{"abstract":"9502791 Zwaenepoel This award provides support for the acquisition of a cluster of shared-memory multiprocessor nodes interconnected by a high-speed network to support research in parallel programming systems, and algorithms and applications from a wide variety of disciplines. The infrastructure will be used as a research vehicle for computer systems designers as well as computational scientists. Research projects to be supported include work on compiler and runtimes for multiprocessor clusters, high-performance I\/O, and performance visualization; and algorithms and applications in mixed integer programming, molecular dynamics, reservoir simulation, genetic linkage analysis, and seismic modeling. The infrastructure will also be used in new graduate and undergraduate courses in multidisciplinary design optimization, and parallel computing.","title":"CISE Research Infrastructure: Multi-processor Cluster Computing, (A Research Infrastructure Proposal)","awardID":"9502791","effectiveDate":"1995-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["24590","543597","489657","191820","565263"],"PO":["557609"]},"942":{"abstract":"9503247 Buss Buss will investigate axiomatics and conditional separations of bounded arithmetic theories; relative proof complexity of propositional proof systems including Frege, extended Frege, constant-depth Frege, Hilbert Nullstellensatz and cutting plane proof systems; problems in designing computerized theorem provers based on extensions of the sequent calculus; and various problems in low-level computational complexity. Buss' research concerns (i) formal systems of mathematical logic and the complexity of proofs in such systems and (ii) computational complexity and feasible complexity. A central goal for this research is to relate the strength of proof systems to the complexity or difficulty of computations. Buss' work centers on proof systems corresponding to functions which are feasibly computable, especially on proof systems for polynomial time computation. Buss will also investigate the relative effectiveness of various proof systems for propositional and first-order logic. This research is fundamental to understanding the power of computation in mathematics. ***","title":"Mathematical Sciences: Proof Theory and Computational Complexity","awardID":"9503247","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["515840"],"PO":["98400"]},"634":{"abstract":"This project is in the area of computational biology; specifically, problems which deal with how to construct evolutionary trees, or phylogeny, (i.e., models of the evolutionary history of various species). There are three standard criteria on which tree construction algorithms are based: distance methods, maximum likelihood, and parsimony. The first two methods are used by the biologists and are dealt with in the statistical literature. The traditional algorithms literature for tree construction is focused on the parsimony methods; notably the Perfect Phylogeny Problem. Although this problem has significant combinatorial appeal, there is a gap between the results for this algorithmic theory and the theory for distance based tree construction methods. The project focuses on problems in the distance based phylogeny, including: (1) Methods for computing distances from strings; (2) Methods for comparing different trees for consensus; (3) Methods for fitting distance data to metric models. The second part of the project involves developing empirical methods for testing the statistical robustness of heuristic methods currently in use. The Educational Component of this CAREER Grant includes: (a) Development and implementation of a post doctoral training program in computational molecular biology at DIMACS; (b) Modification of the graduate seminar in biocomputing; (c) Development and modification of the Rutgers University undergraduate program in biomathematics which focuses on combinatorics and molecular biology.","title":"Career: Distance Based Methods in Phylogeny Reconstruction: Trees and Strings","awardID":"9501942","effectiveDate":"1995-07-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["531670"],"PO":["150516"]},"5051":{"abstract":"NCR-95223 15 PI: Richard Pethia In response to computer security threats, the Advanced Research Projects Agency (ARPA) has established a Computer Emergency Response Team (CERT) to support users of the Internet. The Internet CERT coordination center is located at Carnegie Mellon University's Software Engineering Institute and has been active since November 18, 1988. CERT is chartered to work with the Internet community in detecting and resolving computer security incidents. Since its inception, CERT has responded to continuous stream of security incidents. The incident rate and impact on Internet sites has grown steadily as the Internet user population has grown. As the incident rate has grown, so has the sophistication of the intruders. Where intruders once focused on exploitation of weak passwords and widely known vulnerabilities, they have now progressed to examining source files for new security flaws, exploiting protocol flaws, and using tool kits to automate their attacks and increase their impact. CERT is expanding its program to increase its emphasis on incident prevention through a combination of technology improvement, security awareness and training, and security assessment activities. This expanded program includes two areas where CERT can provide special help that will facilitate the orderly, secure progression to the next stage in the Internet evolution: 1. Collaboration with router manufacturers 2. Collaboration with network service Providers","title":"CERT Network Service Provider and Infrastructure Initiative","awardID":"9522315","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[12361,12362],"PO":["121202"]},"811":{"abstract":"The classical theory of NP-completeness shows that many optimization problems of practical interest are hard to solve: i.e., NP-hard problems that have no polynomial-time algorithms (assuming P is not equal to NP). A popular method for dealing with such an NP-complete problem is to try to compute approximate solutions: i.e., solutions whose cost is within some multiplicative factor of the cost of the exact solution. The focus of this project is to demonstrate that computing approximate solutions for NP-hard problems is no easier than computing exact solutions. The underlying idea which is exploited, is that of a new probabilistic definition of the NP complexity class, a definition based on probabilistically checkable proofs (PCP's). Some of the major goals of the project include: (1) To better understand the approximability of NP-hard optimization problems (including cataloging the hardness of approximation of many problems, improving existing results about the hardness of approximation, and understanding the limitation of these techniques); (2) To develop further connections between the theory of PCP's and cryptography; (3) To improve existing ways of representing data by error-correcting codes; (4) To simplify the techniques used in the proof of this new definition of NP. The Educational Component of this CAREER Grant includes: (a) Development of CORE undergraduate computer science courses (including Theory of Computation and Applied Discrete Mathematics); (b) Development of a graduate computer science course and a corresponding text dealing with PCP's and (approximate) complexity theory.","title":"CAREER: Research into the Hardness of Approximation, Probabilistically Checkable Proofs, and Their Connection to Other Areas","awardID":"9502747","effectiveDate":"1995-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["549429"],"PO":["528421"]},"756":{"abstract":"While shared-memory multiprocessors simplify many aspects of programming, it is widely believed that naive shared- momory programs are not likely to result in high performance on most shared-memory systems. The broad objective is to develop and evaluate techniques for improving the performance of shared- memory systems while simultaneously enhancing programmability and portability. A key problem that inhibited performance in shared-memory systems is that, unlike message passing programs, the exact communication requirements of shared-memory programs are not obvious. Therefore, compilers, runtime systems, and hardware typically need to make conservative assumptions, resulting in excessive communication and synchronization primitives provided on a particular machine (e.g., locks and barriers), the intended sharing behavior is obscured by these details. Furthermore, the low-level primitives that must be used to obtain good performance vary from platform to platform, thus inhibiting program portability. This research takes an integrated approach to improving the performance, and portability of systems. The approach broadly is: (1) to identify common implementation-independent communication patterns along with primitive to express those patterns in a programming language, (2) to develop heuristics that can be used by the compiler, runtime systems, hardware or some combination thereof to map these high-level primitives to the appropriate low-level primitives supported by the particular target system, and (3) to evaluate the resulting performance benefits on the system. By exposing the intended sharing behavior, many instances of unnecessary communication should be avoided, thus achieving higher performance. Furthermore, despite the larger variety of synchronization patterns that a programmer must choose from his or her task is simplified because details of implementing the patterns are left to the programming support system (note tha t the sharing patterns themselves must be understood by the programmer anyway). Finally, in combination with other projects within the overall research program, this research should demonstrate that these common, high-level synchronization patterns can be efficiently supported on a variety of platforms, thus enhancing the portability of the program. This part of the research program is focused on investigating a specific kind of target system - a hardware distributed shared- memory multiprocessor that provides software control for protocols and efficient active message support (e.g., Stanford Flash and Wisconsin Typhoon)- using execution-driven simulation. Other projects in this research program are already exploring similar issues on other types of target systems. Education: The educational objectives fall within three broad areas: curriculm development, teaching methods, and education outside the classroom. The objectives of the curriculm development part are (1) to introduce a course in parallel computing involving computational scientists and engineers along with computer scientists (both in terms of students attending and faculty teaching the course), (2) to introduce hands-on parallel programming experience as part of currently existing undergraduate computer architecture course, (3) to impart a sound education on performance analysis techniques, and (4) to impart a research experience to undergraduates by having a modest research project as part of the senior level architecture course and by actively recruiting undergraduates in the proposed research program through the Rice senior honor's thesis program. The teaching methods part of the education plan address growth as an effective teacher by exposure to research in teaching methods. The final part seeks to (1) encourage women and other under- represented groups to pursue computer science by actively interacting with such groups informally and through formal workshops, and (2) encourage an ex change between industry and academia through tutorials and short courses.","title":"CAREER: An Integrated Approach for Improving the Performance, Programmability, and Portability of Shared Memory Multiprocessors","awardID":"9502500","effectiveDate":"1995-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["551063"],"PO":["150516"]},"668":{"abstract":"Advances in computer and telecommunication technologies enable network communication from any location and mobility that will lead to new collaborative database applications. This research focuses on data management demanded by these new mobile applications, that extends beyond the traditional distributed database management. Specifically, its goal is to develop appropriate protocols (1) for the management of mobile data replicated on both mobile and stationary hosts over low-bandwidth and tenuous wireless network connections, and (2) for the processing of transactions and activities that produce and access these mobile data. Given the inherent resource limitations on a mobile host and the fact that disconnections do not necessarily imply the failure of the disconnected machine, recovery and disconnection management are approached in an integrated manner. This research combines both theoretical investigation, building on the ACTA extended transaction framework, and empirical evaluation that will result in an experimental platform for mobile and wireless distributed computer systems. By considering t he pragmatic issues in developing protocols for mobile data management, this investigation will facilitate the development of such important applications as telemedicine that support remote diagnostics or surgical interventions. The experimental laboratory to be established will also provide hands-on experience for undergraduate students exposing them to the research process itself, thereby encouraging their development of mature scientific thinking.","title":"CAREER: Developing Pragmatic Mobile Data Management Systems","awardID":"9502091","effectiveDate":"1995-07-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["532922"],"PO":["563751"]},"789":{"abstract":"9502645 Truszczynski This award provides support for the acquisition of a high-performance distributed cluster-based computing system consisting of a number of high-performance multiprocessor workstations interconnected by a high-speed LAN. These LAN-connected clusters will themselves be interconnected by a high-speed ATM backbone network. The Computer Science department will thus build a distributed multicomputer based on a scalable, distributed shared memory paradigm which will facilitate the department s research efforts in distributed and parallel computing, distributed multimedia, vision and scientific computation, and distributed control for manufacturing.","title":"CISE Research Infrastructure: A Laboratory for Research in High Performance Distributed Computing","awardID":"9502645","effectiveDate":"1995-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["501232","407833",1774,"530999",1776],"PO":["557609"]},"922":{"abstract":"This research seeks a theoretical foundation for specifying and verifying object-oriented programs, and a practical foundation for the use of formal methods with the programming language, C++. The project is extending the model theory and proof theory of abstract data types to help characterize when one abstract data type is a behavioral subtype of another. Previous work has given sufficient conditions for behavioral subtyping among abstract data types with immutable objects. These conditions are based on type specifications, as reflected in algebraic models of these specifications. Behavioral subtyping allows modular specification and verification of programs, using static type information without using case analysis for each subtype. Separately, one proves that the subtype relationships satisfy the semantic conditions of behavioral subtyping. An important problem is to find necessary and sufficient conditions for behavioral subtyping for abstract types whose objects have time-varying state (i.e., that are mutable), since these types occur frequently in practice. Needed are ways to prove behavioral subtype relationships from type specifications. This research would extend the work on modular specification and verification to languages with mutation and non-determinism. The practical work is aimed at providing the fast-growing community of C++ programmers with a foundation for the use of formal methods with this language. Essential to systematic development of code, program verification, code reuse, and other formal development activities, is a formal specification language. This project advances Larch\/C++, and interface specification language tailored to specify C++ modules. Tools, including a type-checker for Larch\/C++, are being developed, as are a suite of teaching materials, and tutorial and larger worked examples.","title":"A Theoretical and Practical Basis for Applying Formal Methods to Object-Oriented Programming and C++","awardID":"9503168","effectiveDate":"1995-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["152128","521544"],"PO":["150697"]},"713":{"abstract":"The goal of this project are 1) determining the communication, synchronization, and architectural requirements for supporting DSM and 2) developing design guidelines to build efficient wormhole- routed networks for supporting the DSM models. The research is focused on four research directions: developing multicast algorithms for effective cache-coherency, mechanisms and algorithms for barrier synchronization, techniques to alleviate hop-spot problems, and determining the necessary architectural supports. Theoretical and probabilistic analysis together with simulation experiments are being used to develop and validate the results. The educational activities of this project include enhancing and strengthening the computer architecture curriculum (undergraduate, graduate core, and graduate research courses), formulating a capstone design course, undergraduate mentoring, and creating challenging and interactive environment for graduate learning.","title":"Communication and Architectural Supports for Implementing Distributed Shared Memory on Wormhole Networks","awardID":"9502294","effectiveDate":"1995-07-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["561947"],"PO":[1611]},"647":{"abstract":"This research is on design techniques for circuits with a power supply voltage of 0.5V. Innovations in technology, circuits, and architecture are being explored. Issues being pursued in the design of low-threshold devices are: when to shut down and efficient shutdown. Leakage currents are a major power drain in using low-threshold devices. Thus, techniques to efficiently detect and power down idling hardware are being devised. The potential of using adaptive supply voltages to exploit time-varying computational requirements is being investigated. Studies of the fundamental limits of reducing energy per computation are being developed into a general theory of DSP algorithms which can use dynamic power supply voltages. Such algorithms change computational complexity dynamically, thus saving power. Circuits which operate at supply voltages less than 0.5V are being fabricated.","title":"Methodologies, Tools, and System Design of Low-Power Wireless Multimedia Systems","awardID":"9501995","effectiveDate":"1995-07-01","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["560191"],"PO":["321058"]},"438":{"abstract":"This research investigates an integrated approach to the design of advanced visual information systems (VIS). The approach explores the maximum synergy among various important VIS design issues - visual data indexing, compression, manipulation, and storage. An integrated feature map combining multiple image features such as texture, color, and shape is used to detect and index image content, and provide useful methods for content-based image query. Compressed-domain techniques are explored for extracting low-level image features. A modified quad-tree data structure is proposed to be used in feature-based segmentation and heterogeneous feature integration. Based on the prior work, efficient image manipulation algorithms (e.g., image filtering and template matching) are also being developed directly in the compressed domain, in order to seek the minimum implementation complexity. Strategies for storing multi-resolution encoded visual data in real-time hierarchical storage systems are also studied. All research results will be incorporated into an large-scale integrated VIS testbed at the Advanced Imag e Lab of Columbia University. On the educational front, new courses and curriculum in the area of visual signal processing and multimedia technology are being developed. An advanced multimedia testbed is also being developed for supporting research and educational activities.","title":"CAREER: Research and Development of Advanced Visual Information Systems","awardID":"9501266","effectiveDate":"1995-07-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["563299"],"PO":["563751"]},"5031":{"abstract":"9522257 Sobel This project is to integrate a formal method into a software engineering curriculum. The formal method chosen captures the external behavior of a system component while supporting both the compositionality of component specifications and the hierarchical decomposition of a system specification. The method will be introduced by a sequence of courses, beginning in the sophomore year, after two semesters of programming and one semester of discrete math. The first course will address the basic skills needed to apply formal method techniques and will not be coupled to any implemented language. The next course will apply the method to a particular programming language and the third course will extend the concepts to the analysis and design phases of the software life cycle. The last course in the sequence will address concurrency in depth. Finally, students will test the efficacy of their modified curriculum through an existing project-oriented senior capstone sequence. The project will be managed, monitored, and assessed by an advisory council, which will include members of the project and external consultants. The curriculum format, the evaluations used, and the final results will be made available to the academic community through publications and presentations. ***","title":"CISE Educational Infrastructure: Integrating A Formal Method Into the Software Engineering Curriculum","awardID":"9522257","effectiveDate":"1995-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[12309,"519818","404185",12312],"PO":["289456"]},"5053":{"abstract":"9522319 Jain A laboratory-oriented hands-on curriculum for data communications and computer networking will be developed. This will enable students to experiment with various communications\/telecommunications and networking concepts using a workstation, a PC, or a network of workstations. They will be able to design new protocols, verify them using protocol engineering tools, implement them, and visually see the impact of their actions. Data message flows, packet losses, control\/routing message flows, virtual circuit setups, link failures, bit errors, etc. will be seen by the students at a slow (visible) speed. Multimedia and sound effects will be used to show abnormal conditions such as errors and losses. Various nodes of the simulated network will be programmable to run automatically or be under manual control of students. The manual control will allow the students to see the effect of unpredictable actions. The major features of this project include the following: 1) Hands-on laboratory-oriented curriculum requiring students to develop protocol modules and experiment with their designs. 2) Integration of traditional concepts. 3) Use of a distributed gaming\/simulation environment to allow experimenting with unpredictable behaviors. 4) Use of multimedia visual techniques to show the effects of various actions 5) Application of protocol engineering principles to protocol development. ***","title":"CISE Educational Infrastructure: Laboratories for Data Communications and Computer Networks","awardID":"9522319","effectiveDate":"1995-07-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["409563","532762"],"PO":["297837"]},"5064":{"abstract":"9522537 Arnow This project incorporates advances in distributed processing research into the entire undergraduate computer science (CS) curriculum, starting from CS 1. This involves constructing a vertical integration of this new programming methodology. As a result, (1) every student in CS will be acquainted with distributed processing; (2) students will have time to absorb key ideas introduced in elementary courses and these ideas will be reinforced in advanced courses; (3) the theory and techniques of distributed computing can be presented as the students' readiness permits and as appropriate applications are encountered in the curriculum. At the outset, short modules addressing distributed computing issues will be incorporated into the two beginning programming courses. Subsequently, additional modules will be included in the discrete mathematics course, the shell programming course, and the operating systems course. Advanced courses will integrate distributed computing as part of the student's standard CS toolkit. Special topics courses, oriented towards challenging applications, will be revised to exploit the students' training. In the third year of this effort, a faculty development workshop for CS faculty from around the country will be organized in order to disseminate the results of this effort. ***","title":"CISE Educational Infrastructure: Distributed Processing Across the Undergraduate Computer Science Curriculum","awardID":"9522537","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["114025",12394,"397066"],"PO":["297837"]},"945":{"abstract":"Probabilistic methods in Computer Science range from design of algorithms to analysis of typical behavior of algorithms to proving lower bounds in complexity theory. This research concentrates on a number of specific problems where application of the probabilistic method seems promising. The work includes: (1) graph algorithms (finding approximation algorithms for the coloring problem and the independent set size problem); (2) parallel sorting (in the so-called PRAM model); (3) algebraic questions (diameter of Cayley graphs); (4) problems in circuit complexity (non-linear lower bounds); and (5) complexity of on-line algorithms. Based on past experience, the asymptotic combinatorial tools are expected to be applicable more broadly.","title":"Probablistic Methods in Computer Science","awardID":"9503254","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["400088"],"PO":["150516"]},"505":{"abstract":"9501499 Vinnakota This research is on analog circuit observer block (ACOB), structures for testing analog and mixed-signal circuits. Design styles for analog and mixed-signal ICs and their influences on testing the products are being studied. ACOBs for circuits of practical importance, both discrete and continuous time, are being investigated. A second exploration is into fault models for analog circuits which quantitatively link defects to variations in the functional parameters, which are traditionally verified in analog circuit test. These models are being used to validate the effectiveness of defect-oriented testing and design-for-test techniques, including ACOBs. The algorithms are being verified on practical circuits. Software for analog and mixed-signal test is being developed.","title":"Testing Analog and Mixed Signal Integrated Circuits","awardID":"9501499","effectiveDate":"1995-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["100136","528634"],"PO":["321058"]},"1193":{"abstract":"ABSTRACT: Connection to the NSFNET and Internet\" \"National Science Foundation Proposal for Defiance College PI: William Brandt NCR-9504008: This project connects Defiance College to the Internet over a 56,000 bits per second line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for one year.","title":"National Science Foundation proposal for Connection to the NSFNet and Internet","awardID":"9504008","effectiveDate":"1995-07-15","expirationDate":"1996-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["482078",2739,2740,2741],"PO":["43608"]},"648":{"abstract":"The project is in the area of computational molecular biology; specifically it addresses problems in protein folding and the self-assembly of virus shells. The `grand challenge` problem associated with protein folding is to determine how a protein will fold in 3-dimensions when given only its amino acid sequence. An important first step in tackling the protein folding problem is a solution to the motif recognition problem (i.e., given a known 3D structure, or motif, determining whether this motif occurs in an unknown amino acid sequence). The goal of this effort is to develop new algorithms, based solely on the right pairwise correlation probabilities, which out perform existing motif recognition algorithms. An implementation of these algorithms, is being programmed. In fact, the package is aiding in the discovery of the coiled-coil motif in such viruses as Mollney murine leukemia, influenza hemagglutinin, and HIV. The coiled-coil motif is thought to be the mechanism by which proteins fuse with or bind to the cell membrane. This continuing research deals with recognizing motifs when less data is available, predicting inter-strand interactions in motifs, and finding new insights into the 3-dimensional structure of proteins. The second part of the project involves studying the self-assembly of virus shells. In particular, by computationally modeling how these shells are built, it is hopefully possible to suggest ways of interfering with the growth of these viruses and of causing their deformity. The Educational Component of this CAREER Grant includes: (a) Development of interdisciplinary (computer science, mathematics, and biology) undergraduate and graduate courses and curriculum in computational molecular biology, discrete mathematics and the theory of (biological) algorithms; (b) Development of both undergraduate and graduate seminars in computational molecular biology. Participation of undergraduate students in developing the extended system project and the Virus Shell Assembly project. (This is part of the Research Experiences for Undergraduates Program at NSF and Undergraduate Research Opportunities Program of MIT.)","title":"Career: Probabilistic Methods and Algorithms to Solve Protein Folding Problems","awardID":"9501997","effectiveDate":"1995-07-01","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["257844"],"PO":["150516"]},"1293":{"abstract":"This project explores the design of systematic techniques to adapt the internal interface and component structure of programs of moderate size or larger. Programming tools based on these techniques could have the effect of increasing the extent to which the internal interface structure of systems can be made more fluid, that is, evolvable and adaptable. One potential application is to reorganizing abstraction boundaries in programs: It is clear in practice that software structural architectures are rarely optimal, but the costs and risks of adapting them are high. Another potential application is to the tailoring of general purpose frameworks and components to specific constrained uses, improving performance. Four questions are addressed: (1) What semantics-based program manipulation techniques are needed to support manipulation of internal software interfaces represented, for example, as encapsulation boundaries in programs? (2) How can soundness and other properties of the program manipulation techniques be established? (3) What are the design considerations for the development of tools that can operate on programs of increasing complexity and size? (4) How can the utility of the techniques be assessed for development and re-engineering of internal software interfaces and associated components?","title":"Fluid Architecture","awardID":"9504339","effectiveDate":"1995-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["565238"],"PO":["150697"]},"869":{"abstract":"9502986 Bender The Ohio State University Research Foundation requests support from NSF for connection of the campus networks for Washington State Community College to OARnet and the Internet. OARnet is the midlevel network located in the state of Ohio that will provide operations and network information services. It will provide Washington State Community College a 56KB connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The College needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Washington State Community College.","title":"Connection of School to OARnet and NSFNET - Washington State Community College","awardID":"9502986","effectiveDate":"1995-07-01","expirationDate":"1996-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["30778"],"PO":["43608"]},"5033":{"abstract":"9522265 Maurer This project is to enhance the quality of undergraduate courses by incorporating new research in hardware design, and design automation software. Three new courses will be introduced, and a fourth is being planned. Three existing undergraduate hardware courses will be revised to included new information on the use of design tools, and design automation theory. The first objective is to teach students how to use design tools, while the second is to teach students how to actively participate in the development of new tools. The final products will be a set of course outlines with detailed guidelines and design-oriented exercises; a set of laboratory manuals providing exercises in creating complex designs and making modifications to existing designs; a set of complex designs to be used either as examples or as the basis for exercises in design modifications; a set of highly sophisticated and completely integrated design tools that will carry the student from the initial inception of an idea through to its implementation; and a set of new textbooks aimed at the problems of design and the use of design automation. Results will be made available through scholarly publications, Internet newsgroups and anonymous FTP, and through a series of summer workshops. ***","title":"CISE Educational Infrastructure: Incorporating Design and Design Automation into the Undergraduate Computer Science Curriculum","awardID":"9522265","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[12316,"297760","556800"],"PO":["297837"]},"1382":{"abstract":"Proposal: DMS 9504596 PI(s): Richard Davis, Murray Rosenblatt, Peter Brockwell Institution: Colorado State Title: Times Series Models and Extreme Value Theory Abstract: The research is concerned with problems of estimation and research for time series models whose theory is not yet fully understood. The standard linear Gaussian models for time series data are inadequate to describe many of the time series observed in practice so it is important to develop techniques for estimation and prediction based on more general models. Efficient estimation procedures and prediction techniques for non-causal and non-invertible ARMA processes are developed and a study made of the theory and application of continuous-time linear and non-linear ARMA processes. Extreme value theory for linear and non-linear models is also investigated. Existing methods of forecasting are based on assumptions which are frequently not satisfied by observed economic and scientific time series data. This research develops methods of analysis and forecasting for a more general class of time series models, leading to more accurate forecasting of series which do not meet the restrictive assumptions of the classical theory.","title":"Mathematical Sciences: Time Series Models and Extreme Value Theory","awardID":"9504596","effectiveDate":"1995-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[3188,"481114","481115"],"PO":["331535"]},"1151":{"abstract":"This RUI research project studies the issue of specification and verification of computer systems that are both delay-sensitive and distributed. The behaviors of such a system strongly depend upon the timing sequences of events, and failure to meet these timing requirements can either cause severe consequences or affect the correctness and\/or performance of the system. Due to the extra dimension of complexity introduced by the time components in these systems, specification and verification of delay-sensitive distributed systems have presented a unique challenge to software practitioners. This project studies a broad range of issues related to specifying and verifying delay-sensitive distributed systems. A new specification model, Time Communicating Finite State Machines (TCFSMs), is proposed. TCFSMs is based on the classical CFSMs model with capability added to express time constraints for specifying and verifying delay sensitive distributed systems. A token passing-based system is studied to demonstrate how to concisely specify and verify self-stabilizing systems with TCFSMs. This research examines a broad spectrum of problems related to TCFSMs: the semantics and alternative semantics of TCFSMs and their effects on applications and efficiencies; methodologies for synthesizing time constraints in TCFSMs; new verification techniques for TCFSMs extending symbolic timing verification techniques; methodologies for modeling self-stabilizing distributed systems with TCFSMs, suitable formalisms for self-stabilization and special classes of TCFSMs that can be efficiently self-stabilized; alternative extensions of TCFSMs related to other popular specification models; and TCFSMs-based tools for simulations and rapid prototyping. A component of this RUI project is th e comparison of TCFSMs with other specification models to identify and evaluate their strengths and weaknesses.","title":"RUI: Specifying and Verifying Delay-Sensitive Distributed Software\/Systems","awardID":"9503880","effectiveDate":"1995-07-01","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["498258"],"PO":["150697"]},"2020":{"abstract":"Performance index functions with integer parameters are important in the evaluation and analysis of computer systems, communication networks and general distributed and parallel processing systems. These functions are often difficult to evaluate for large integers. On the other hand, most of these performance functions have nice properties such as monotonicity, convexity, analyticity, as well as obtainable asymptotic behavior. This research uses such properties to extrapolate the performance functions based on their values at small integers. The objective of this research is to further establish the theoretical foundation and to develop guidelines, algorithms and their software implementations that will be applicable to a wide array of systems. The results of this research will make it possible to express the performance measure function in terms of the system size of dimension as a low-degree rational function for some general classes of systems. The successful completion of this research will provide a framework in which various difficult modeling, control and optimization issues can be attacked.","title":"Rational Approximation for Some Computationally Complex Performance Analysis Problems","awardID":"9506764","effectiveDate":"1995-07-15","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["526867"],"PO":["74434"]},"6398":{"abstract":"","title":"Coordination and Technical Assistance for \"Human Language Resources\", (CPO-9596088)","awardID":"9528447","effectiveDate":"1995-07-13","expirationDate":"1995-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1400","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"9170","name":"NSF PLANNING & EVALUATION"}}],"PIcoPI":["79100"],"PO":["565227"]},"1152":{"abstract":"For a model to be a workable component of a parallel processing system, it must be scalable. Researchers often design algorithms so that the assumed machine size for running the algorithm grows with the problem size. (This is particularly the case with algorithms for reconfigurable busbased models.) A physical machine size is, of course, fixed. For a scalable model, however, the arbitrary sized machine for running the algorithm can be mapped to the smaller physical machine that actually solves the problem without loss of efficiency. A compiler can perform this mapping, so algorithm designers and programmers can design algorithms for arbitrary size machines and need not design different algorithms or write programs for different sized problems. No reconfigurable bus-based model is known to be scalable, however, unless its computational power is significantly reduced. To better understand the extent to which these models are scalable, the investigator is less restrictive than traditional scalability. This research will investigate scalability of two main types of reconfigurable bus-based models, namely, the Reconfigurable Mesh (R-Mesh) and the Reconfigurable Multiple Bus Machine (RMBM). The RMBM comprises four versions: the B-RMBM, S-RMBM,F-RMBM, and E-RMBM. The investigators have previously established relative scalability results for the S-RMBM and for `separable` algorithms of the E-RMBM, the most powerful version. The research will seek to investigate scalability of general E- RMBM algorithms and study different scalability approaches for different ranges in the relationship of simulated to available machine sizes. Scalability questions for the R- Mesh will also be investigated. These will include relative scalability and scalability of certain classes of algorithms, topics not yet examined for the RMesh, and extensive attempts at complete scalability of the RMesh, a topic that has received only to narrow attention in the past. Scalability questions will also be studied for directional versions of the R-Mesh and RMBM, which have proven particularly useful for directed graph algorithms.","title":"Algorithmic Scalability in Reconfigurable Bus-Based Models","awardID":"9503882","effectiveDate":"1995-07-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["216914","216915"],"PO":["150516"]},"9732":{"abstract":"","title":"Resource Allocation Problems in Wireless Communication Networks","awardID":"9596245","effectiveDate":"1995-07-01","expirationDate":"1997-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["158256"],"PO":["409909"]},"5387":{"abstract":"One of the biggest roadblocks preventing people from using natural language to interact with computers is that understanding language perfectly is difficult, even for people. Recently, theories have been proposed explaining how interactors can behave appropriately---even if they differ about the meaning of some part of the discourse. This project aims to extend these ideas so that their effectiveness can be tested and their insights put to use. Extending earlier work comprises four tasks: elicitation and collection of examples; theoretical extensions; evaluation of the extended model within its logical framework; and the construction of applications supporting a user study. The planning activities are to include a review of the relevant literature; preliminary experimentation with candidate methods of data collection and validation; discussions with researchers whose expertise bears on these issues; and the construction of two prototype applications that discuss medical information with doctors and patients, respectively. Upon completion of these activities, a detailed plan for extending prior a pproaches to misunderstanding will be developed. If computers can be enabled to address misunderstanding, they will be better able to understand natural language reliably and robustly, which is essential if they are to help those who need them most, non-computer-experts.","title":"ROW: Addressing Misunderstandings in Dialogue","awardID":"9523646","effectiveDate":"1995-07-15","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["186932"],"PO":["183208"]},"1351":{"abstract":"Walkington The investigator studies physical problems involving phase changes and their numerical approximation. In general these problems exhibit one of two distinct traits; either the solutions take on the character of a free boundary problem where the unknown boundary separates the phases, or the phases are finely interspersed. The former are modeled by degenerate parabolic equations. While the theory for these equations is well developed, this is not the case with the discrete theory for their numerical approximation. For example, the investigator in collaboration with J. Rulla has only recently established optimal rates of convergence of the classical Stefan problem in a dual Sobolev space; however, rates of convergence of the energy in the space of integrable functions is still an open question. Even less is known about approximations of the mean curvature equation that arises, for example, when the interface between the phases has more structure. The investigator also studies the approximation of problems that exhibit fine phase mixtures. Because these problems involve structures that are much finer than any feasible mesh, the investigator utilizes the recent theory of Young measures to characterize the fine scale behavior. This theory shows that the fine scale behavior is far from random and in many cases can be characterized by a the (macroscopic) Young measure. The investigator studies and analyzes algorithms that approximate the Young measure. In this project, the investigator develops efficient ways to computationally model problems arising in the environmental and material sciences. One interesting feature of these problems is that they often exhibit interfaces where different materials meet. For example, when modeling the spread of pollutants, the single most important quantity is the location and motion of the interface between the pollutant and the clean environment. Problems in the material sciences often involve very fine scal e phenomena involving interfaces between different phases of the same material. This phenomenon is ubiquitous, being observable, for example, in most metals. However, the fine scales also present many obstacles when analyzing such materials. The investigator develops the computational tools to circumvent these problems, providing another step towards the automation of the design and development of modern (and traditional) materials.","title":"Mathematical Sciences: Construction and Analysis of Algorithms for Degenerate Variational and Parabolic Problems","awardID":"9504492","effectiveDate":"1995-07-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485154"],"PO":["562372"]},"718":{"abstract":".Robust automated natural language processing has the potential to revolutionize the way people interact with machines and the way machines process information. To date, the major bottleneck inhibiting the creation of robust and accurate natural language processing systems is the problem of linguistic knowledge acquisition, in particular how a machine can obtain the linguistic sophistication necessary for accurate processing of language. In this proposal, work is described which will help break this knowledge acquisition bottleneck. As an alternative to manually providing a machine with linguistic knowledge, methods will be explored for automatically learning linguistic knowledge from on-line text corpora. Methods of extending a recently developed corpus-based learning algorithm called transformation-based error-driven learning will be explored. Extending this algorithm and carefully studying the strengths and weaknesses of this and other approaches to corpus-based learning should lead to very powerful programs for automatically learning the linguistic information necessary for highly sophistic ated natural language processing systems to become a reality.","title":"CAREER: Automatically Learning Natural Language from On-Line Text","awardID":"9502312","effectiveDate":"1995-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["35295"],"PO":["565227"]},"4563":{"abstract":"The proposed research is suitable for an SGER, due to its interdisciplinary nature, involving applications of geometric modeling and scientific visualization to provide improved representation and display techniques for the cornea. The application has the potential of revolutionizing the field of optometry. Instead of the current trial-and-error method of fitting contact lenses a much faster and precise procedure can be developed. Furthermore, it will enable fitting contact lenses to people whose corneas have complex and\/or irregular shapes, something which is impossible with the current state of the art. A successful completion of the project may induce the manufacturers of contact lenses to embark on a development effort, but at present they don't have the financial incentive to take the risk. Thus the small investment in this project can have significant impact. The PI is highly qualified and is strongly motivated, due to a personal vision problem. I recommend funding.","title":"SGER: Developing New Geometric Modeling and Scientific Visualization Techniques for Curved Optical Surfaces","awardID":"9520703","effectiveDate":"1995-07-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["518667"],"PO":["150516"]},"4850":{"abstract":"9521681 Courter MCNC requests support from NSF for connection of seven North Carolina colleges to the Internet through the NC-REN regional network. NC-REN is the midlevel network located in the state of North Carolina that will provide operations and network information services. It will provide the seven colleges with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States The colleges need the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the seven North Carolina colleges.","title":"NC-REN NSFnet Connections Proposal \"VIKING\"","awardID":"9521681","effectiveDate":"1995-07-15","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["428707","11903","478564"],"PO":["121202"]},"1176":{"abstract":"This research project examines problems which demand a better understanding of and analysis of certain reversible and nonreversible Markov chains. In particular, applying Markov chain techniques to develop approximate algorithms which solve such problems as: (1) Counting Euler tours, using Monte Carlo methods; (2) Counting tournaments, using Markov chain techniques. Another aspect of the project is the step by step proof of a `conjectured` optimal bound for the expected time for n random walks on a graph to coalesce to a single walk. The final part of this project focuses on extensions of results on rapidly mixing reversible Markov chains to nonreversible chains.","title":"Markov Chain Problems with Applications","awardID":"9503952","effectiveDate":"1995-07-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565106"],"PO":["150516"]},"5598":{"abstract":"9526015 Brett The workshop will bring together leading regional and state user services groups to discuss the feasibility of leveraging their individual activities into a coherent national effort. The purpose of the Coalition would be to develop and provide systematic training and support for classroom personnel in using a suite of public domain applications and databases on the Internet as well as to serve a clearinghouse function to identify schools and teachers in different parts of the country (and the world) capable of and interested in participating in collaborative projects. The workshop involves planning of future NSF support for the development of a training infrastructure in this important are.","title":"Planning Meeting\/Workshop - National Coalition for Technical Training","awardID":"9526015","effectiveDate":"1995-07-15","expirationDate":"1995-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["264215","401102",13731],"PO":["395251"]},"54":{"abstract":"The research objectives are in two areas. The first is that of one-rule semi-Thue systems, which are of interest in the general topic of theorem proving by machine. The research problem is to determine a decision procedure that distinguishes whether or not a given system is uniformly terminating; that is, to tell whether or not every derivation in the given system terminates. The second area is that of infinite games; that is, games that are conceived of as being played by two players over an infinite amount of time. This area is of interest in the general topic of making assertions in formal logics about the running of programs, and, therefore, in the general topic of concurrency control. There are tow major research problems: (I) To develop the concept of the infinite game in the setting of a board and pieces (like many parlor games). The purpose is to make the game concept more applicable to computer science, by making it more intuitively intelligible; (ii) To develop a usable and justifiable method for declaring a winner of an infinite game after a finite amount of time.","title":"Research in One-Rule Semi-Thue Systems and Infinite Games","awardID":"9500182","effectiveDate":"1995-07-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[127],"PO":["150516"]}}