{"4126":{"abstract":"This award supports Professor Donald Loveland and Assistant Professor Owen Astrachan of Duke University to collaborate in computer science research with Professor Eike Jessen and others of the Computer Architecture Department of the Technical University of Munich (TUM), Germany. They are studying the Model Elimination proof procedure, a general-purpose theorem-proving technique of interest to both research groups. The procedure is derived from the logic programming language Prolog, and can use the sophisticated implementation architecture developed for Prolog. There is a significant amoung of research being performed on Model Elimination in Germany as part of a five year multi-university research program on deduction that is lead by the TUM group. A fundamental issue being studied by both the German and US groups is the intelligent use of lemmas that are automatically generated by the Model Elimination system for use in accelerating the subsequent proof finding. Significant theorems have been proven using this technique enhanced with the lemma device where no solutions would have been possible without the lemma device. Therefore the development of good lemma selection techniques would be particularly valuable in this area of computer science. The collaborating Duke and TUM research groups have experience respectively with global and local lemma techniques. These are quite different approaches, and combining them is expected to lead to enhancements of the lemma techniques which will expand the usefulness of the Model Elimination procedure for proving more complex theorems such as those in the `grand challenge` class. The U.S. group will also benefit from interactions with other participants in the German national program from the University of Koblenz and the Humboldt University in Berlin.","title":"U.S.-Germany Cooperative Research to Enhance the Performance of the Model Elimination Proof Procedure","awardID":"9514375","effectiveDate":"1996-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["38604","531300"],"PO":["290800"]},"7129":{"abstract":"Linear Filtering theory has been largely motivated by the characteristics of Gaussian random processes. In the same manner, research in myriad filtering theory is motivated by the statistical properties of alpha-stable processes which describe an important class of processes, impulsive in nature, that obey a Generalized Central Limit Theorem; thus these processes can arise in practice as a result of physical principles. The foundation of myriad filtering algorithms lies in the definition of the sample myriad as the location estimate of a class of alpha-stable distributions. The main goals of this research are: (1) To study the theoretical properties of the sample myriad and to exploit its geometrical structure for the development of efficient computational algorithms. (2) To solve the optimal \"weighted myriad\" filtering problem - the problem analogous to the design of the optimal FIR (Wiener) filter and the optimal weighted median filter. (3) To develop adaptive filtering algorithms for the simple design of weighted myriad filters for applications where the statistical characteristics of the underlying signals may be unknown or varying. (4) To extend the filter formulation to the case where the signals are complex or multivariate, providing us with the tools needed to develop robust CDMA multiple access detectors. This work can have a significant impact on applications requiring robust estimation and filtering. This is particularly the case in mobile and personal communication systems, to be deployed in the near future, where the underlying statistics of the noise and interferences closely follow the models used in this research rather that the traditional models used in practice today. The results of this research can also be applied to a wide range of problems including remote sensing imaging of the environment and non-destructive evaluation of materials.","title":"Weighted Myriad Filters and Their Applications in Communications","awardID":"9530923","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[17480,"409073"],"PO":["564898"]},"9935":{"abstract":"The interaction of positrons with molecules is investigated using crossed beams. The energies and masses of the dissociation fragments are measured using mass spectrometric and kinetic energy spectrometry in order to study the chemical stability of molecules containing positronium. Applications to solid state physics, medical physics, polymer research and astrophysics are anticipated.","title":"The Preparation and Characterization of Compounds Containing Antimatter","awardID":"9600416","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1241","name":"ATOMIC & MOLECULAR PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1242","name":"PLASMA PHYSICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1960","name":"STRUCTURE AND REACTIVITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["262369",24911],"PO":["525727"]},"8726":{"abstract":"9553841 Greenberg Image processing has been shown to be a powerful medium for engaging diverse learners, whose needs have not been met in the past, in the study of science and mathematics. The technique is an effective and engaging way to study the applications of science and mathematics to real-world situations as represented by digital imagery. It brings science research to the classroom; science is learned as science is done. Students and teachers are lead into exploration, inquiry and analysis using real data sets and state-of-the-art computer tools. These supplemental materials, useful in middle and high schools are based on successful materials developed in teacher enhancement programs and provide a context for changing traditional classroom structure to a learning community. Teachers are supported by on-line services and a network of professional development opportunities. Subject specific CDROMs are produced in physics, biology and Earth science. The standards-based activities are designed to meet specific learning goals and lead to creative student-generated products for performance-based assessment of student achievement. Students also learn about mathematical concepts that underlie image processing such as coordinate systems, slope and intercept, measurement and statistics.","title":"Image Processing Teaching: Curriculum Materials Development","awardID":"9553841","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7355","name":"INSTRUCTIONAL MATERIALS DEVELP"}}],"PIcoPI":["142284","532501",21979,"455191"],"PO":["564965"]},"19150":{"abstract":"","title":"Efficient Computer Algorithms for Symbolic Mathematics","awardID":"9696203","effectiveDate":"1996-07-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["485433"],"PO":["187585"]},"17490":{"abstract":"An adaptive computing system is one that evolves its behavior based on changes in the environment. For an adaptable system built on a distributed architecture where multiple machines are connected by a nework, such changes can range from site failures to updated application requirements. The evolutionary action taken when a change occurs can vary as well, ranging from dynamically reconfiguring the system software to maintain the same service guarantees under changed conditions, to negotiating new service guarantees with the application. The goal of this project is to develop fundamental new techniques for designing and implementing adaptive distributed computing systems. The specific focus is on providing a distribution support layer, a software layer implementing strong execution guarantees regarding the distributed state of the application, that can adapt to changes. The research concentrates on two lines of investigation: (1) the development of a conceptual model for systems of this type and (2) a new approach to implementing adaptive distributed systems based on fine-grain code modules called micro-protocols. The framework is being extended to support dynamic evolution of software, including reconfiguration, dynamic code linking, and runtime code generation. ***","title":"Designing and Implementing Adaptive Distributed Systems","awardID":"9633336","effectiveDate":"1996-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["118484"],"PO":["150697"]},"16170":{"abstract":"This is a career advancement award to apply theoretical methods from the study of interconnection networks to the study of all-optical broadcast networks. The goal of the research is to develop new scheduling algorithms to improve the performance of broadcast networks that use wavelength division multiplexing. The scheduling algorithms will take into account an arbitrary set of system parameters that change with technology. The research will provide insight into the user of multiple wavelengths and tunable devices in optical networks.","title":"WDM Broadcast Networks and Massively Parallel Computers","awardID":"9628468","effectiveDate":"1996-07-15","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["531651"],"PO":[40743]},"19195":{"abstract":"","title":"PYI: Low complexity source coding techniques for high quality digital image compression.","awardID":"9696248","effectiveDate":"1996-07-15","expirationDate":"1998-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["517054"],"PO":["150411"]},"29261":{"abstract":"","title":"Proposal for the Creation of a Distributed National Labortory for Applied Network Research (NLANR","awardID":"9796124","effectiveDate":"1996-07-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["554383"],"PO":["121202"]},"6926":{"abstract":"This is a one-year regular grant that investigates mathematical model-based methods for coordination in intelligent agent societies. The research addresses how to construct an general model of coordination that is based on a identification of a set of state variables that characterize relevant aspects of agent behavior in an agent society. Coordination is defined as the management of dependencies among activities, following a widely used definition of coordination. The problem of coordination is then the problem of exerting control over these dependencies. The research aims to discover logical orderings of state variables based on dependencies, and thus to develop mathematical models of coordination strategies. Once coordination and control relationships are known, coordination problems can be treated using constraint satisfaction, constraint-propagation, ad optimization approaches. The mathematical models will be further explored and validated through simulation.","title":"A State Space Framework for Coordination","awardID":"9530271","effectiveDate":"1996-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["121233","121234"],"PO":["495796"]},"17151":{"abstract":"The objective of this project is to develop an efficient nonlinear optimization method - NOVEL: Nonlinear Optimization Via External Lead - and the supporting hardware\/software to solve large-scale nonlinear optimization problems in operations research, digital signal processing, and neural-network learning. Such a method will allow many important application problems in these areas to be solved better as well as faster than existing methods. The method first transforms nonlinear constrained optimization problems using Lagrange multipliers into unconstrained optimization problems. This transformation allows both constrained and unconstrained problems to be solved in a unified framework. The key idea of the method is to use a user-defined trace to pull a search out of a local optimum (a local saddle point in constrained optimization and a local minimum in unconstrained optimization) without having to restart it from a new starting point. The proposed method has a good balance between global search and local search. In global search, NOVEL relies on two counteracting forces: local gradient information that drives the search to a local optimum, and a deterministic trace that leads the search out of a local optimum once it gets there. The effect of the trace on the search trajectory is expressed in terms of the distance between the current position of the trajectory and that of the trace. Good starting points identified in the global-search phase are then searched more extensively using pure local searches. The proposed research consists of four aspects: refinement of the NOVEL method, parallel processing, extension to mixed-nonlinear optimization problems, and applications of the methods developed to solve problems in operations research, digital signal processing, and neural-network learning.","title":"Global Optimization and Parallel Processing of Nonlinear Problems in Engineering Applications","awardID":"9632316","effectiveDate":"1996-07-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["388382"],"PO":[43108]},"29284":{"abstract":"","title":"RIA: Coupled State-Space Filtering with Applications","awardID":"9796147","effectiveDate":"1996-07-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["448637"],"PO":["564898"]},"15031":{"abstract":"NOTE: This CAREER award is a companion project to the CAREER award CCR-96-24439, ``Cryptography, Proof Checking and Approximation'', University of California, San Diego. This project focuses on the new area of provable security. Provable security is achieved for a problem, when one provides (i) a definition of security for the problem, (ii) a protocol, and (iii) a proof that the protocol meets its definition, assuming, for example, the intractability of factoring. Instead of just producing triples (definition, protocol, proof), the goal of the project is to utilize reductions as a technique for making precise statements about the security of concrete cryptographic schemes; for example, ``if you can break authentication protocol P with resources X, then you can break the Data Encryption Standard with resources Y''. In particular, applications of these techniques have already lead to a treatment of asymmetric encryption, message authentication, entity authentication, and key distribution. Protocols designed employing practice oriented provable security have resulted in protocols used in products of IBM and Microsoft, and in a proposed International Standard. The Integrated Educational Plan of this CAREER Grant includes developing (a) a new graduate course in modern cryptography; (b) undergraduate security projects which are difficult, open-ended, and design oriented; (c) course and course materials for a new undergraduate course in graphs, games and coloring.***","title":"CAREER: Practice-Oriented Provable Security","awardID":"9624560","effectiveDate":"1996-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["548342"],"PO":["528421"]},"15098":{"abstract":"9624828 Stein Algorithms and Biology: Theory and Practice Combinatorial optimization problems arise in fields as diverse as transportation,communication, large-scale computing, and biology. This project focuses on three fundamental areas in combinatorial optimization:(1) Scheduling, including good average-case scheduling algorithms and algorithms for scheduling a network of processors;(2) Flows and Cuts, including multicommodity flows, minimum cuts, and shortest paths;(3) Computational Biology, including problems that arise as part of the human genome project, algorithms for DNA folding, and techniques for studying evolution. The Integrated Educational Plan of this CAREER Grant includes curriculum reform, new course development, training of teachers in new technologies, and outreach to high school students. ***","title":"CAREER: Efficient Algorithms in Scheduling, Network Algorithms and Biology: Theory and Practice","awardID":"9624828","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["562721"],"PO":["528421"]},"15110":{"abstract":"System designers have long assumed that memory cannot reliably store permanent data because of memory's volatility and vulnerability to software corruption. Memory's unreliability slows system performance by forcing some applications to write data through to disk and hurts reliability for forcing applications that care about performance to throw away 30 seconds of data on a crash. The primary research goals of this CAREER plan are 1) to enable memory to reliably store permanent data even in the presence of operating system or database errors; and 2) to measure how often software faults corrupt memory, both with and without extra protection. The primary education technique of this CAREER plan is relation instruction: spending time and effort relating with students personally. This plan suggests several simple ways, such as group lunches, to do this effectively with large, undergraduate classes; prior experience attests to how caring for students in a personal manner motivates them to learn.","title":"Measuring and Improving Memory's Resistance to Software Corruption; Relational Instruction","awardID":"9624869","effectiveDate":"1996-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["556912"],"PO":["197478"]},"15484":{"abstract":"9626151 Beck ABSTRACT In this proposal the investigator outlines a new, probabilistic approach to positional games (i.e. board-games, or combinatorial games). The straightforward way to analyze a position is to examine all of its options and all the options of these options and all the options of the options of these options and all the.... The obvious difficulty is that this exhausting search through the game-tree takes an enormous amount of time even for very simple games (exponential running time in terms of the board-size). Note that the game-matrix approach, the set-up of traditional game theory, is much worse: usually requiring double exponential time. A desperate attempt to make up for the lack of time is to study the random walk on the game-tree. Now the basic idea of the probabilistic theory of the investigator is that the probabilistic analysis of the random walk (i.e. the random game) is often a tractable problem, and also what one has learned from this analysis can often be converted, via potential arguments (like resource counting with loss-probabilities), into deterministic optimal strategies. The probabilistic theory is basically a game-theoretic adaptation of the so-called Probabilistic Method in Combinatorics applied to hopelessly complicated games where algebraic and other exact methods fail to work. The surprising thing is that this desperate attempt turns out to be very successful for large, interesting classes of positional games. The main chapters of the proposal are: the foundations of positional games (a surprisingly non-trivial task), game-theoretic Ramsey theory, game-theoretic random graph theory, game-theoretic Lovasz Local Lemma, and applications in algorithms and complexity. Traditional game theory, i.e. von Neumann's theory, is basically the theory of games of incomplete information. It provides good insights to Economics, and many areas of social science (Management, Military Strategy, etc.). Similarly, one can expect many new applications from a successfu l theory of games of complete information (i.e. positional games). This is exactly what the investigator's proposal is all about. An extremely exciting aspect of studying positional games is that it might give a better understanding of how human intelligence works. It might have some impact on fundamental questions like whether human understanding is a computational or a non-computational process. Note that in Japan there are several \"perfect\" players who, when playing first, can consistently win Go-Moku (5-in-a-row on the 19 by 19 Go board), but nobody can turn these heuristics into precise arguments. Similarly, 6-in-a-row on a sufficiently large board between two reasonably good players is always a boring draw-game, but again we cannot precisely explain why. Or what is the reason that Go-playing computer programs are nowhere close to the best human players? These are just three of many examples where the human mind \"knows\" something beyond rigorous mathematics. One more thing: in contrast to Go, the best Chess-playing computer programs have now reached the level of human Grandmasters. But there is a basic difference. Computer programs examine millions of positions before deciding what to do next. On the other hand, even the best Grandmasters do not search more than 100 positions per move. In human Chess, pattern recognition plays a more important role than search. How to supply this human knowledge to a computer is a puzzle that no one has solved yet. Beside its theoretical importance, the investigator's project could be a crucial step toward the solution of these questions, too.","title":"A Probabilistic Theory of Positional Games","awardID":"9626151","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["331667"],"PO":["517169"]},"29344":{"abstract":"","title":"Vision Algorithms for Analysis of Tissue and Fluid Deformations from Medical Images","awardID":"9796207","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["436917",74194,"348892",74196,74197],"PO":["475621"]},"14880":{"abstract":"This project focuses on designing and analyzing fast approximation algorithms for NP-hard problems, with good performance guarantees. Despite the recent strong results on the hardness of approximations, the PI and his Ph.D. Student have been instrumental in introducing new methodologies for designing and analyzing approximation algorithms, and in improving the best known performance guarantees for a wide range of problems. In particular, the goals of this project include: (1) Development and refinement of methodologies to design and analyze approximation algorithms; (2) The deviation of approximation algorithms with improved performance guarantees for a variety of combinatorial problems;(3)The actual solution of important practical problems, arising in electrical engineering and computer science, in computational molecular biology, and in material science. The Integrated Educational Plan of this CAREER Grant includes: (1) Involvement of undergraduates in developing efficient software codes based on approximation algorithms; (2) Development of undergraduate and graduate course which address the changing job markets; (3) Development of a multimedia textbook on optimization algorithms.***","title":"Career: Approximation Algorithms: Methodology and Applications","awardID":"9623859","effectiveDate":"1996-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["485468"],"PO":["528421"]},"14781":{"abstract":"This project focuses on expanding the capabilities of the present (DNA) sequence analysis algorithms with respect to comparing sequences and detecting features. In particular, the project concentrates on:(1) developing methods for quantifying the relatedness of biological sequences under a broader model of mutational events, than the currently used substitution-indel model, and (2) improving methods for detecting tandem repeats in sequences. The Integrated Educational Plan of this CAREER Grant includes(a)developing a curriculum for graduate study in computational and mathematical biology, (b) developing courses and course materials, including lecture notes, exercises, programming projects and extensive bibliographies, that cover combinatorial and algorithmic topics in sequence alignment, DNA sequencing, DNA physical mapping, DNA physical mapping, and prediction of protein folding and RNA folding, and phylogenetic tree construction, (c) instituting a summer training course for new researchers in computational biology.***","title":"CAREER: Tandem Repeats: Sequence Comparison and Search Algorithms","awardID":"9623532","effectiveDate":"1996-07-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["451346"],"PO":["150516"]},"12174":{"abstract":"In 1993, Washington University, with funding from ARPA and NSF, began a research program to create networking technology and a gigabit testbed based on this technology. The Washington University is interested in making the technology available to the networking and HPCC research communities, to enable others to pursue more effectively their own research agendas in high performance computing and communications. This effort will fund a workshop that would serve three purposes. The first is to describe the proposed program and the gigabit ATM technology on which it is based in sufficient detail that the participants can determine its potential value to them in their research programs. The second purpose is to determine what level of interest there may be in such a program, to help representatives from NSF and possibly other agencies to decide if such a program would merit their support. The third purpose is to obtain input from the attendees as to how the program might be shaped to suit their particular needs. The workshop will be held July 10 11, 1996 on the Washington University campus.","title":"Workshop on Research Distribution of Gigabit Network Technology; July 10-11, 1996; St. Louis, MO","awardID":"9614081","effectiveDate":"1996-07-15","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["522381"],"PO":["409909"]},"15144":{"abstract":"This research investigates formalization and automation techniques for design of asynchronous systems. Techniques for design of asynchronous systems. Techniques for managing multiple, independently synchronized domains under a methodology in which timing and communication can be explicitly specified, synthesized, and verified are being explored. specific tools and techniques being developed for the design of mixed-timed systems include: a performance and power optimizing compiler; a synthesis tool to produce technology-independent circuits; a technology mapping tool that takes the implementation and maps it to high- performance gate libraries; and a timing verification tool. In addition, new design methods are being developed to produce: high-performance mixed-timed data paths, and an interface between synchronous and asynchronous modules. The PI's education plan includes: curriculum emphasis on communication skills through course project reports and presentations; development of new computer engineering courses; promoting interdisciplinary activities; incorporating research activities into the curriculum through class and summer projects; and fostering interaction with industry through student summer internships.","title":"Design Methods and Tools for Mixed-Timed Systems","awardID":"9625014","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["448038"],"PO":["564898"]},"19148":{"abstract":"","title":"Adaptive Code Division Multiple Access Systems","awardID":"9696201","effectiveDate":"1996-07-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["450625"],"PO":["150411"]},"15552":{"abstract":"The PI and his collaborators have been involved in: (a) some of the subfields of theory that have witnessed impressive recent advances (approximation algorithms, on-line algorithms), (b) a subfield that has been very successful and relevant, but is facing new challenges (database theory), and(c) ``exporting'' complexity-theoretic ideas to other disciplines (e.g., Game Theory, Economics, and Artificial Intelligence). The goals of this project include: (1) The deepening and broadening of recent advances in approximation algorithms and on-line algorithms, by attacking fundamental problems such as the Euclidean traveling salesman problem and the k-server conjecture; (2) The study of alternative models and metrics, for example, in relation to on-line algorithms for storage allocation, that are closer to reality and to computational practice; (3) The introduction of approximation and on-line problems that in a small way contribute to our understanding of the computational requirements of a global information environment; (4) The study of database-theoretic problems that are posed by novel media and heterogeneity; (5) The continuation of PI's research program that considers problems from other disciplines (such as, Game Theory, Genetics, and Artificial Intelligence) from a complexity-theoretic point of view.***","title":"Research in Algorithms Complexity and Database Theory","awardID":"9626361","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["558880"],"PO":["150516"]},"15387":{"abstract":"This project focuses on algorithms that work with limited information. This research investigates on-line algorithms in the context of various resource allocation problems in operating systems. This project is taking a twofold approach to each problem. The first approach is to perform a theoretical study using competitive analysis. The competitive measure is used to evaluate on-line algorithms by measuring their performance in relation to the optimal off-line algorithm which has available to it complete information about the problem instance at hand. This effort plans to perform empirical tests to evaluate the performance of various on-line algorithms in a realistic setting. The first two problems addressed in this project are related to memory management. The first of these addresses ways in which information about the access pattern of a program available at compile time can be used to guide page replacement and prefetching policies. The investigator will develop methods which can take a program and automatically generate appropriate memory management instructions to be inserted in the code. The second problem addresses allocating memory resources among users in a multiprocessing environment. This work addresses this problem for general multiprocessing environments as well as methods specifically designed for database systems. The third problem examines preemptive load balancing strategies over local area networks under a probabilistic model for process duration. The last problem is an investigation of disk scheduling strategies. This work is motivated by the fact that the availability of larger cheap memory has made it possible to have long queues of disk updates which means that more sophisticated scheduling policies can have a greater impact on disk utilization. ***","title":"Competitive Analysis of Problems in Resource Allocation","awardID":"9625844","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["409328"],"PO":["250083"]},"14980":{"abstract":"This research investigates the algorithmic and systems issues that arise in on-line and off-line distributed manipulation and organization tasks with cooperative teams of robots. The objective is to develop a framework in which it is easy to synthesize and reason about complex strategies for manipulating and organizing objects in structured and unstructured environments, with teams of robots. Distributed manipulation systems can be used for tasks that require reorganizing large objects in an environments, for example waste cleanup, mine sweeping, and furniture moving. Manipulation and organization can be formulated as placement problems. In a distributed placement problem multiple robots combine their skills cooperatively to move objects so as to satisfy a desired global property of the environment (for example, all the movable objects are placed in a designated area.) The research agenda is to develop (1) models for the information requirements of robot tasks; (2) algorithms for single robot manipulation strategies that relay on given information requirements; (3) a method of analyzing the structure and power of such algorithms; (4) a method for composing reliable single robot manipulation algorithms to obtain fault-tolerant cooperative manipulation protocols with performance guarantees; (5) a method for establishing trade-offs between sensing, communication, planning, and learning in distributed systems of robots; and (6) to implement, design, and test distributed manipulation systems that use (1-5)","title":"Distributed Manipulation: On-Line and Off-Line Algorithms and Systems","awardID":"9624286","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["527733"],"PO":["179262"]},"15520":{"abstract":"9626254 Cooper Carlow College requests support from NSF for a connection to PREPNet. This grant will be used to help the institution get access to the Internet. PREPnet, a midlevel network in Pennsylvania, will provide operations management and information services and it provides access to the Internet, a collection of interoperable networks connecting most research and education organizations in the United States. The Pennsylvania college need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of Carlow College as well as the community in general.","title":"Internet Connection","awardID":"9626254","effectiveDate":"1996-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[39169,39170],"PO":["121202"]},"15069":{"abstract":"This research plan pursues the development of a unifying framework for reasoning about execution, compilation, and optimization of programs. The goal is to provide the programmer, compiler writer, and implementor with an abstract laboratory in which to investigate the interplay among various techniques and to reason about their correctness and efficiency with respect to both time and space. Specifically, the aim is to formalize an evaluator, a compiler, an optimizer, and a parser as a rewriting process. This requires enhancing current rewriting technology with the ability to deal with graph structures, including cyclic and disconnected graphs. This is important since graphs are ubiquitous in a program development system. They occur at the source level, after parsing, in the intermediate program representation and during program execution. A rigorous study of graphs is thus fundamental for reasoning about both run-time and compile-time issues. The rewriting technology will be enhanced further by associating priorities and conditions to the rules. This will allow us to directly analyze the impact of different application schemes on efficiency. Both strict and nonstrict languages will be considered, and also their extensions to handle state. The development of the abstract framework addressed in this CAREER research project is also important for educational purposes, since it provides a simple yet rigorous, basis for introducing students to concepts, practical issues and, at the same time, to formal reasoning about properties of programs without having to introduce complex mathematical machinery. A strong, formal background is important regardless of whether a student is seeking higher degrees or immediate employment. The proposed research will allow an integration across the undergraduate language-compilation implementation sequence, establishing a connection between abstraction and application. Exposure of students to research is planned through collaborat ions with other institutions and student exchanges, which can serve to encourage students to consider advanced education and research careers. This study constitutes a first step towards providing automatically generated tools, such as optimizing compilers. Moreover, through use of the results of the proposed research in the classroom, their value as a tool for introducing and reasoning about language issues can better be evaluated. ***","title":"CAREER: A Comprehensive Rewriting Framework for Compilation, Optimization, and Run-Time Environments","awardID":"9624711","effectiveDate":"1996-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["489107"],"PO":["397849"]},"19216":{"abstract":"","title":"Scalable Direct Drive Robots","awardID":"9696269","effectiveDate":"1996-07-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["415014"],"PO":["475621"]},"14894":{"abstract":"The research addresses object recognition from controlled industrial environments to less restricted domains. This will require object representation that can encode the prototypical shape of an object without requiring its exact geometry. Furthermore, object recognition is not a single isolated task, but rather a complex interaction of a set of closely-related behaviors, including both bottom-up and top down recognition, localization, active recognition, quantitative shape recovery, and object tracking. Not only must these individual problems be solved, they must be integrated within a common representational framework, since a complex recognition task may involve rapid transitions from one behavior to another. Earlier research in the PI's laboratory began with the introduction of a novel object representation integrating object-centered and viewercentered models, this representation, a probabilistic partbased aspect hierarchy, has formed the foundation for novel approaches to each of the above recognition problems. The new research will extend the work along each of these behaviors, supporting their application to more complex domains, including that of visual aids for the disabled as well as content-based image retrieval. In addition, this research will address the task of determining, for a given set of 3-D objects, the decomposition of the objects into parts which is optimal in terms of recognition performance.","title":"CAREER: Generic Object Recognition in a Dynamic Environment","awardID":"9623913","effectiveDate":"1996-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["140208"],"PO":["179262"]},"15137":{"abstract":"The emerging field of resource-bounded reasoning is concerned with the development, composition, and meta-level control of flexible computational methods that allow small quantities of resources, such as time, memory, or information, to be traded for gains in the value of computed results. A better understanding of these techniques is essential for the construction of useful intelligent systems for automated planning, diagnosis, decision making, and control. There are two primary components to this research project. One is the development of resource-bounded techniques for automated information gathering from a network of heterogeneous, dynamic information sources. The approach extends the classical theory of information value by formalizing the effect of such factors as information reliability, retrieval costs, real-time operation, and uncertainty. A second and closely related activity improves current planning technology by constructing planning systems that can operate in real-time under uncertainty and under variable computational constraints.","title":"Resource-Bounded Reasoning in Intelligent Systems: New Directions & Opportunities","awardID":"9624992","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["485994"],"PO":["565227"]},"15159":{"abstract":"This research is a study of fundamental issues arising in multi-user communications in environments subject to severe interference and\/or noise conditions. Important applications include mobile, indoor, and PCS wireless systems and two-way hybrid-fiber coax (HFC) networks for broadband services to the home. The research addresses three broad topics: (i) optimum and near-optimum demodulation of multiple-access signals, (ii) the influence of interference and communications techniques (e.g., modulation, demodulation, coding, power control) on system capacity, and (iii) robust multi-user detection and interference suppression. These topics address important challenges to practical realization of high-performance multi-user communications in wireless, HFC and other environments.","title":"CAREER: Robust and Resource-Efficient Multiuser Communications for Emerging Digital Networks","awardID":"9625085","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["230556"],"PO":["150411"]},"14457":{"abstract":"9622633 Gong The purpose of the proposed workshop is to bring together researchers working on the systems and control issues in communication networks. The specific objectives are (a) the exchange of research ideas, cross fertilization betweens communication network and control system researchers, and leveraging of complementary research efforts, (b) technology transfer to industry and the initiation of new dialogues between academic researchers and industrial practitioners, (c) promotion of educational goals through the participation of graduate students, and (d) Promotion of international collaboration in this rapidly developing area. ***","title":"Workshop on Systems and Control Issues in Communication Networks. To be Held at the Airlie Center, Airlie, VirginiaAugust 9-10, l996.","awardID":"9622633","effectiveDate":"1996-07-15","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["545655","526867"],"PO":["564728"]},"15007":{"abstract":"NOTE: This CAREER award is a companion project to the CAREER award CCR-96-24560, ``Practice-Oriented Provable Security'', University of California, Davis. This project focuses on the areas of (1) provable security and probabilistic proof checking with orientation towards developing practical, but proven secure protocols and (2) probabilistic proof checking (PCP) with application to the derivation of nonapproximability results for NP-hard optimization problems. The problems examined cannot be solved by some kind of ``technology transfer'' from theory to practice; rather the theoretical principles have to be used to develop new models and solve new problems. Applications of the techniques of practice-oriented provable security are applied to such problems as: session key distribution, use of block cyphers to provably achieve basic cryptographic goals, and balancing between individual privacy and law enforcement, via key escrow or other means. In the area of PCP, the problems studied include determining tight results for the approximability of Max Clique, and improved results for Max SNP problem. The Integrated Educational Plan of this CAREER grant includes developing: (a) new undergraduate and graduate courses in principles of sound protocol design, with joint university\/industrial training projects; and (b) an undergraduate algorithm design course in which proof checking tehniques for determining good approximate solutions are taught and applied to NP-hard optimization problems.***","title":"Career: Cryptography, Proof Checking and Approximation","awardID":"9624439","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["521666"],"PO":["150516"]},"29219":{"abstract":"","title":"A Distributed Testbed for National Information Provisioning","awardID":"9796082","effectiveDate":"1996-07-01","expirationDate":"1999-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["554383","542513","521741",73917],"PO":["121202"]},"16845":{"abstract":"Multimedia presentation refers to the concurrent presentation of multimedia data using monitors for text, video or still images, and speakers for audio. Each presentation contains multimedia segments retrieved from a database and is constructed and played out by a presentation manager software. For novice users of multimedia databases, general-purpose techniques and methodologies are developed for automated assembly of semantically coherent presentations from multimedia databases. These techniques are extended into automated assembly of presentations from electronic books and electronic classroom lectures and notes. For intermediate users, a graphical interface is developed for constructing concurrent presentations. Such an interface (i) provides control on the number and contents of concurrent presentation streams, (ii) has the ability to specify dynamic (i.e., playout-time) changes in a presentation order, and (iii) allows playout-time communication and synchronization among multiple concurrent presentation streams. For advanced users, graph-based query and update languages for advanced users, tailored specifically for retrieving and manipulating presentation objects, are developed. A multimedia database system is developed, populated, and experimentally evaluated. The system has an Automated-Presentation-Assembler, a graphical interface for presentation manipulation, and a presentation query and manipulation language. The system will contribute to our understanding of software tools for using digital libraries.","title":"Constructing and Manipulating Presentations in Multmedia Databases","awardID":"9631214","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["448583","393279"],"PO":["563751"]},"17318":{"abstract":"Advances in network and processor technology are greatly changing the communication and computational power of local-area clusters of workstations and personal computers. In particular, the replacement of Ethernets by newer switched network technologies, which provide both higher throughput and lower latency, presents an opportunity for operating systems to better use network resources. This research seeks to improve the performance of applications through distributed (cluster-wide) resource management. The project will develop algorithms that permit the effective sharing of all network resources: processors, network, memory, and disk storage. For example, programs on heavily- loaded nodes can use available memory on idle nodes for both file system and virtual memory backing store, rather than disk, thereby reducing the data latency on access to that data. As another example, applications may migrate to nodes that provide either a better processing environment or a better memory environment for their execution. A key issue in developing algorithms for such closely-coupled system is finding the right balance in order to optimize system-wide performance while minimizing any degradation of performance on individual systems as a result of network-wide resource sharing. ***","title":"Distributed Resource Management in Workstation and PC Clusters","awardID":"9632769","effectiveDate":"1996-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["450764","450784"],"PO":["250083"]},"17329":{"abstract":"9632801 Koditschek This proposal describes an approach to the control of xerographic printing that, if successful, promises to advance the state of the art in the industry, help lead Xerox Corporation into a $80B new market, and considerably enlarge the academic community's experience with application of robust, nonlinear, and intelligent controls techniques in competitive, fast moving consumer markets. The chief technical objective is a dramatic improvement in the process stability of dry powder color xerography. The long term goal is to demonstrate this level of stability in all relevant environmental zones (temperature, relative humidity), a variety of paper types and colors, and over a number of machines. A second contribution will be the development of a new controls oriented design support methodology. The approach to this problem will be driven by a \"problem solving\" focus (rather than a \"theory driven focus\") to creatively combine the strengths of the researchers at the Wilson Research Center with the academic researchers at the University of Michigan. Preliminary discussions suggest a hierarchical controller whose lower level specifies process parameters using robust (nonadaptive) nonlinear controller techniques with a higher level specification of the product parameters using model driven adaptive or possibly learning techniques. The control algorithms and architectures developed in this project will be assessed for product-worthiness with respect to the standard Xerox Field Readiness Determination Testing procedures. ***","title":"GOALI: Modeling, Sensing and Algorithm Design for Color Xerographic Process Control","awardID":"9632801","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1504","name":"GRANT OPP FOR ACAD LIA W\/INDUS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["526958","527916","468179",43564],"PO":["564728"]},"15811":{"abstract":"A fundamental problem in parallel computing is to design high-level, architecture independent, algorithms that execute efficiently on general purpose parallel machines. The purpose of this project is to advance our understanding of the main factors required for designing practical parallel algorithms and to develop techniques and data sets for experimentally validating the results. As a byproduct, portable parallel programs and data sets for a number of specific important problems arising in combinatorial computing and image processing will be developed and made available to other researchers through the PI's Web page. There are currently two factors that make this fundamental problem more tractable. The first is the convergence of parallel architectures toward a unifying model and the second is the emergence of standards such as the message passing standard MPI. The technical approach to be followed is based on (1) a simple computation model that incorporates communication costs into the complexity of the algorithms, and (2) a SPMD programming model that makes effective use of communication primitives. ***","title":"Research on Designing Practical Algorithms for Computing and Image Processing","awardID":"9627210","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["501013"],"PO":[39873]},"14986":{"abstract":"The vast majority of serious software design flaws are due to incomplete, inconsistent, or obscure requirements documents. It is in the very first stages of software development, the requirements specification phase, that the fewest formal procedures exist to aid the analyst. Techniques to capture, verify, and validate requirements specifications for embedded systems are of demonstrable importance. This project focuses on validation of requirements specifications, specifically on executable specifications. An integrated framework is being constructed for the development, analysis, and execution of high-level requirements specifications for embedded systems. The framework is intended to support (1) execution and simulation of embedded system requirements (hardware-in- the loop simulation), and (2) requirements reuse and requirements synthesis based on the structure and design of the physical system. This environment will enable an executable high-level requirements specification to interact with: (1) models of the assumed behavior of the environment, (2) software simulations of the environment, or (3) the actual physical components in the environment. The approach taken is to extend an existing formal specification language, RSML, with the capability to define system-level inter-component communication in an embedded system. The educational component of this CAREER project seeks to increase industrial involvement in undergraduate and graduate education through case studies and industrial projects. A remotely-accessible embedded systems laboratory is being established, where students can gain realistic hands-on experience with software development for real-time systems. ***","title":"CAREER: Requirements Specification for Embedded Systems: An Integrated Framework","awardID":"9624324","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["421080"],"PO":["150697"]},"15207":{"abstract":"This project focuses on the design of approximation algorithms for NP-hard problems arising in two important application areas: (1) design of networks and (2) computational molecular biology. The work involves the development of general techniques to solve classes of problems in both areas, applying and extending tools from the area of approximation algorithms, such as the primal- dual schema, bicriteria formulations and approximations, and using graph-theoretic arguments in the proof of performance guarantee. In particular, the issues addressed in the area of network design include improved algorithm for minimum-cost survivable network design by extending the primal-dual method, and a generalization of the Steiner tree problem with covering requirements. In the area of computational molecular biology, the areas of investigation include the application of bicriteria approximation methods to the physical map assembly problem, and fundamental questions in multiple sequence alignments -- local, global and tree based. The Integrated Educational Plan of this CAREER Grant includes (a) participating as Resident Scientist in the DIMACS High School Teacher Education Program in Computational Biology, (b) developing a``more modern'' undergraduate cross-disciplinary computational biology at CMU, (c) establishing and running a graduate research seminar for doctoral students in the Algorithms, Combinatorics and Optimization Doctoral Program at CMU, and (d) developing new graduate courses in network design and approximation algorithms.***","title":"CAREER: Approximation algorithms for NP-hard problems in networks and biology","awardID":"9625297","effectiveDate":"1996-07-15","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["561985"],"PO":["150516"]},"16538":{"abstract":"Professor John Pople is supported by a grant from The Theoretical and Computational Chemistry Program to continue his research in the application of molecular orbital theory to a range of chemically important problems. Molecular orbital theory, as applied by Professor Pople has become an integral part of chemistry used not only by theoreticians, but also by a wide range of experimental chemists. His methods have proved to be an invaluable complimentary tool to much of experimental chemistry. Pople plans to continue his algorithm development and research in the following three areas: 1) Research will continue on the foundations of density functional theory. These include further investigations into density functional theory, where the two-electron density will be investigated. The aim of this work is to find improved exchange-correlation functionals. 2)The second area is concerned with extensions of theoretical thermochemistry. The aim here is to improve on the current model used to predict energies of small systems. Several areas which form the basis of the model will be examined and improved. 3) The third involves the use of Object Oriented Classes in scientific programming. This is a continuation of work begun in the previous grant period whose aim is to provide a more general implementation of post-Hartree-Fock correlation theories.","title":"Theoretical Chemical Models","awardID":"9629964","effectiveDate":"1996-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1954","name":"QUANTUM CALCULATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[41625],"PO":["563091"]},"15604":{"abstract":"Dietterich Understanding and Scaling-Up Machine Learning Algorithms Several machine learning algorithms have become very popular and widely used -- particularly the top-down partitioning algorithms for decision trees and the backpropagation algorithm for feed-forward neural networks. This research seeks to deepen our understanding of these algorithms, to explain why various boosting and voting techniques improve their accuracy, and to determine the best procedures for applying them in practice. A second goal of the research is to find ways of scaling up these algorithms (and their associated boosting techniques) to handle problems with billions of training examples and thousands of output classes. Based on our experience with voting algorithms, we will develop methods for reducing the cost of voting, scaling up the number of output classes, handling continuous output values, and handling large numbers of training examples. Existing learning algorithms have been designed for conditions where data is very expensive and computer time is relatively cheap. Emerging applications in data mining exhibit the opposite conditions: data is voluminous and users want interactive speeds. This research will result in new algorithms that are essential to supporting emerging applications in large-scale data mining.","title":"Understanding and Scaling-Up Machine Learning Algorithms","awardID":"9626584","effectiveDate":"1996-07-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["554550"],"PO":["565227"]},"10413":{"abstract":"9601919 Kak This award supports the participation of 20 senior U.S. graduate students in a U.S.-Japan Graduate Student Forum entitled \"Robotics of Today and Tomorrow for Advanced Automation and Other Societal Applications\" to be held at Senri Life Science Center, Osaka, Japan, November 8 and 9, 1996. The co-organizers are Professor Avi Kak of Purdue University and Professor Yoshiaki Shirai of Osaka University. An equal number of superior graduate students will be selected from the Japanese universities; participation of the Japanese students will be supported by separate funds raised in Japan. The specific aims of the Forum are to: (1) foster collaborative links between the promising graduate students -- the future leaders in research and development -- in robotics and automation in the two countries; (2) review the current state-of-the-art in robotics and automation; (3) discuss the disparities that exist between the experiments that can be carried out in the best university laboratories and the somewhat lagging state- of-the-art of the best robotic practices in industry in the two countries; (4) discuss future directions for research and development and how projects carried out jointly between the two countries can help with the realization of the future. ***","title":"US-Japan Graduate Student Forum for Exchange of Ideas and Expertise in Robotics and Advanced Automation; Tsukuba City, Japan; November 1996","awardID":"9601919","effectiveDate":"1996-07-01","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5983","name":"JAPAN AND KOREA PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["320780"],"PO":["63117"]},"14956":{"abstract":"The research plan is to develop shape representations for image and video ulderstanding. The approach is to encode shape and motion in terms of nonrigid deformations from prototypical or extremal views. This research builds on previous work in modal matching, an orthogonal shape decomposition for matching, describing, and comparing shapes despite sensor variations and nonrigid deformations. Shape and motion coefficients are expressed in terms of the eigenmodes of deformable shape models. The project extends this modal matching framework in four main directions; comparison metrics, prototype-based shape representations, including intensity information, and encoding motion and shape. Primary system evaluation is on synthetic data sets specifically designed to characterize algorithm limits with respect to noise and deformation. System performance is to be evaluated using a large database of images collected by a world wide web crawler. Towards this end, a web robot is being built. The educational plan addresses course development and teaching in multimedia computing, active engagement of undergraduates in research, and outreach for recruiting a greater number of students from traditionally underrepresented groups in computer science.","title":"REU\/ CAREER: Deformable Shape Models for Image Understanding","awardID":"9624168","effectiveDate":"1996-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["472054"],"PO":["179262"]},"14967":{"abstract":"This research addresses two related problems in the design and management in integrated high-speed communication networks. The first problem is to analyze and develop the tools required to support and operate hierarchical source routing algorithms currently under consideration for private and future public ATM networks. This approach to routing aims to simplify the operation of large-scale networks by introducing hierarchical structure and attempts to ensure Quality of Service (QoS), prior to transmitting connection requests, via source routing. Using a combination of stochastic modeling and optimization techniques the principle investigator will study various approaches to estimating, and periodically advertising available capacity, as well as to hierarchically aggregating state information. The second problem to be investigated concerns the design of performance oriented embedded (virtual) networks on an ATM backbone. For specific types of services, such as interactive video, the PI will explore various architectures and complementary management schemes which meet overall performance requirements and maximize throughput\/revenue. This work will be extended to address, services requiring heterogeneous resource bundles such as on-line services, distributed computing, and database applications requiring consistent high-levels of performance and for which the use of a dedicated virtual network is justified.","title":"CAREER: Analysis and Design of Hierarchical Source Routing & Embedded ATM Networks","awardID":"9624230","effectiveDate":"1996-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["560221"],"PO":["194325"]},"17729":{"abstract":"OSCAR is a computer-based architecture for an artificial rational agent, based upon a general-purpose automated reasoner. The objective of this project is to develop a decision-theoretic planning system within the OSCAR architecture. Existing automated planning systems tend to make unrealistic assumptions about the planning environment, the most serious being (1) that the planner has a fixed knowledge base that does not change over time, and (2) that it is known with certainty what the result will be of taking any relevant action in any describable situation. This project is aimed at relaxing these assumptions by making use of innovative features of the OSCAR architecture. The automated reasoner upon which OSCAR is based is capable of more sophisticated reasoning than has been available in the past to automated planners. This will culminate in an automated planning system capable of operating in richer environments than has been possible in the past, and will be useful for diverse tasks ranging from automating manufacturing to launching a space shuttle.","title":"Realistic Planning in OSCAR","awardID":"9634106","effectiveDate":"1996-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["248906"],"PO":["565227"]},"14924":{"abstract":"Real-time analysis of large-scale data sets is becoming increasingly important in a variety of relativity new fields, including computational oceanography, geotechnics (earthquake engineering), metal forming (car and aerospace industry), elasticity (analysis of plates and beams), casting, aeroelasticity, impact analysis (crash simulation), and biomedical engineering (protheses and artificial teeth). This project will develop techniques and prototype software systems for the representation and visualization of two-and three-dimensional, time-varying scientific data sets (including scalar, vector, and tensor fields) resulting from computational field simulations or physical measurements. The research issues being addressed are data reduction, multiresolution methods, spline representations, and visualization techniques or multiresolution representations based on triangular and tetrahedral grids. This research will impact the design of next-generation scientific visualization systems supporting real-time rendering of large-scale time varying data sets represented on triangulated domains","title":"Career: A Proposal Regarding the Unification of Data Reduction and Multiresolution Methods for Use in Scientific Visualization and the Education in Scientific Visualization","awardID":"9624034","effectiveDate":"1996-07-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["495182"],"PO":["565272"]},"14957":{"abstract":"Research Component Photorealistic image synthesis is an important problem for such diverse fields as architecture, lighting and industrial design, scientific visualization, simulation systems, entertainment, and advertising. An important component that has been missing from image synthesis is the effect of weathering. Existing models of materials in computer graphics assume that the materials are in pristine condition. This research program will focus on the development of computer graphics techniques for modeling and rendering weathered materials. The research will proceed along four lines. The first part of the program involves the development of comprehensive material models; and emphasis will be placed on models that can capture the changing appearance of a given material over time. The second part of the program will entail the development of new high-level representations for complex surfaces. The third aspect of the program includes creation of techniques simulating the effects of the environment in both batch and interactive modes. The final stage involves developing techniques to render weathered materials. Educational Component The pursuit of an integrated collection of educational initiatives is an important goal. The education plan proposes the development of interactive pedagogical aids to augment traditional classroom teaching, adaptive hypertext environments for on-line student assistance, and interactive challenge- response tools for student evaluation and certification. Advanced courses in computer graphics are being developed using these tools. Mentoring and training of new researchers will integrate the research and educational activities. The principal investigator's track record of interdisciplinary work, combining expertise in architecture and computer science, will facilitate the work. ***","title":"CAREER: Computer Graphics Techniques for Modeling and Rendering Weathered Materials","awardID":"9624172","effectiveDate":"1996-07-01","expirationDate":"2001-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["548698"],"PO":["179846"]},"14968":{"abstract":"This research is on design reuse and design process assessment. Design reuse can be in any part of the design cycle from initial phases (capture, processing, and organization of design information), to final phases (matching, retrieval and actual reuse of design information). Mechanisms for supporting this activity are being explored. Attention is being paid to maximizing opportunities for reuse, and assessing the impact on productivity of the reuse infrastructure. Issues being addressed include the characterization and representation of design objects and design processes, automatic capture, indexing, retrieval and reuse of design information. The second investigation is developing a framework, including risk assessment and planning tools, for design process assessment. Metrics or measuring management objectives and parameters of the design process are being identified and characterized. Results of the research are being tested and validated in the design of large embedded systems.","title":"CAREER: Design Assessment and Reuse","awardID":"9624231","effectiveDate":"1996-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["293070"],"PO":["564898"]},"16718":{"abstract":"This project is concerned with problems inherent in the informal specification of design. Its task is to develop a domain independent, generic knowledge-based requirement elicitation tool for design, called DDSC (Dynamic Design Specification with Chunking). Capturing design requirements is usually the task of knowledge engineers and is often done by post hoc knowledge acquisition, which in general is inadequate and difficult. In this approach however, design specification is a dynamic process evolving interactively. The elicitation process is based on the structure of human cognition through the use of recognized cognitive categories. DDSC takes as input an initial, informal requirement specification for a design object, as well as an extended generic ontology of the design process, and generates a complete, unambiguous, consistent, and implementable requirement specification of the desired design object. It does so by ewalkingn the Designer and the User Agents through the design process. During this ewalk-through,n requirements are chunked down with the help of Chunking Agents into implementable bits. DDSC is a participatory design tool which differs from any existing generic tool. Its application will greatly contribute to minimizing the huge gap which exists between informal specification and design implementation.","title":"Career Advancement Award: Dynamic Design Specification with Chunking","awardID":"9630699","effectiveDate":"1996-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["256830"],"PO":["565227"]},"4393":{"abstract":"INT 9515504 De Long The primary objective of this U.S.-Czech research project between Dr. Lance De Long of the University of Kentucky and Dr. Vladimir Sechovsky of Charles University, Prague, is to examine the effects of high pressure and magnetic field on electronic structure, magnetic anisotropy and electrical transport in Uranium containing compounds. Contributions to the work will emphasize high-pressure measurements on the U.S. side involving special vibrating reed and torque techniques and, on the Czech side, high quality single crystal sample preparation and structural characterization. Results are expected to improve our ability to study such intermetallic materials across the localization boundary. In the course of this work, the researchers also intend to construct a refined high field vibrating magnetometer located at the National High Magnetic Field Laboratory in Tallahassee, Florida. This joint research project in condensed matter physics fulfills the program objective of advancing scientific knowledge by enabling leading experts in the United States and Eastern Europe to combine complementary talents and pool resources in areas of strong mutual interest and competence. ??","title":"U.S.-Czech Materials Research on Magnetism and Transport Properties of 5f Intermetallics under High Pressure","awardID":"9515504","effectiveDate":"1996-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["490363"],"PO":["561352"]},"6010":{"abstract":"This project goal is to investigate applications of stream- based functional programming methodology to the implementation of multiprocessor based real-time systems, and specifically to signal processing applications. The work is based on the Sisal programming language. It will use Sisal's stream data types, static analysis methods, and automatic mapping to map parallel computations on processors in distributed computer systems. The Paradigm compiler will be redesigned and extended to perform static analysis and mapping of continuous stream processing computations. A related objective of this effort is to develop analytical methods for performance modeling of stream-based computations on multiprocessor systems. ***","title":"Implementation of Stream-Based Functional Programming for Real-Time Applications","awardID":"9527253","effectiveDate":"1996-07-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["517820"],"PO":["150697"]},"14848":{"abstract":"A flow analysis is an automatic tool that collects information about programs. Flow information is crucial, for without it the correctness of sophisticated program transformations cannot be verified. Such transformations are important, because they can transform a program written to solve a problem cleanly into a new program that, for example, is more efficient and fault tolerant. Ultimately, flow analysis-justified transformations can boost software reliability and programmer productivity. Despite their utility, however, existing flow analyses for mostly-functional languages are impractical for use in production-quality environments. They have high algorithmic complexity, they can only process language subsets, and they are accurate only when programs are written in a certain style. This CAREER project has three goals to address these problems and incorporate advanced analysis techniques into the undergraduate curriculum. The first goal is to use a practical flow analysis in a production Scheme compiler to justify optimizations. The second goal is to use the flow analysis and the experience gained from its application to develop a program transformation toolkit for building automatic, flow analysis-based program transformers. The third goal is to incorporate the results into the undergraduate curriculum so that students understand what a flow analysis is, how it works, and how it can be profitably applied. Achieving these goals advances both research and education. Besides solving the above problems, the research aspect of this project pursues contributions in the areas of language implementation and semantics-based program manipulation. In particular, optimizations are being implemented that can improve the performance of dynamic languages, program transformation techniques are being developed that allow more realistic programs to be manipulated. The transformation toolkit developed is expected to provide the research community with needed infrastructure for experimenting with transformations. The educational aspect of this CAREER investigation seeks to improve the undergraduate programming languages curriculum by addressing the distinction between static and dynamic properties of programs and how static information can be used to optimize programs. Such an understanding is essential to undergraduate education as programming languages are playing an increasingly prominent role in customizable software. ***","title":"CAREER: Employing Flow Analyses in Practical Program Transformation Environments for Mostly-Functional Languages","awardID":"9623753","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[37641],"PO":["150697"]},"7034":{"abstract":"A new feature space trajectory (FST) description of 3-D distorted versions of an object or object part is considered in which different distorted object views are different vertices on the FST. Adjacent vertices are connected by straight lines. Different objects or object parts have different FSTs. For input data (an object or an object part), the FST closest to the input data denotes the class of the object and the closest line segment on that FST denotes the pose of the object or part. A neural net processor performs all needed distance calculations. Fundamental issues associated with this new representation of distorted objects are addressed. Processing a time sequence of input data and its pose estimation ability will be used in active vision systems. Its good generalization and performance on small training sets will be studied. Its ability to reject false (non object) inputs and to learn new inputs will be studied.","title":"Feature Space Trajectory Image Processor","awardID":"9530657","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[17246],"PO":["475621"]},"5440":{"abstract":"9523815 Camp Flush communication channels generalize the more conventional asynchronous one-to-one communication paradigms. A flush channel offers the implementor of a distributed application the flexibility of specifying a message delivery order apropos of the demands of the application. This stands in marked contrast to the rigid FIFO (first-in-first-out) delivery order of communication specified by a virtual circuit in TCP\/IP or specified by a virtual channel in ATM communication. The more restrictive the delivery order, the less concurrency possible to exploit in message transmissions over a multi-path system. Flush channels allow the user to define the delivery of a message to be after the delivery of all messages previously transmitted, or before the delivery of all messages subsequently transmitted, or both. The delivery order between the sending site and the destination site, created by the user, is a partial order. The results from previous work are encouraging. Flush communication channels can reduce the mean delivery time of messages substantially, regardless of the underlying physical structure of the network. That is, an implementor of a distributed application that uses an F-channel can reduce communication costs whether the communication occurs on routes established for virtual circuit or datagram in TCP\/IP or UDP\/IP or on routes established for the connectionless service class D provided by the ATM Adaptation Layer. This possible reduction in mean delivery time of messages may be critical in meeting real-time requirements of the application. However, all previous results only consider interprocess communication (IPC) for one-to-one communication. The goal of this research is to investigate the implications of implementation and performance when we extend F-channel communication to many-to-many communication. ***","title":"Implementation of Fast Data Transfer with Global Flush Broadcasts","awardID":"9523815","effectiveDate":"1996-07-15","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["546219"],"PO":["409909"]},"11814":{"abstract":"For manufacturing industries to remain competitive, considerations such as the ease of assembly, graspability, and ease of feeding must be taken into account when products are designed. This grant provides an extended opportunity to attack exciting new research topics that fall within the same general research area as the original grant: combining sensors and actuators with few degrees of freedom to grasp and orient parts. Remaining open problems related to the parallel-jaw gripper include a fast algorithm for estimating 2 point frictional grasps of a given polyhedral part and finding grasps that will permit the part to be pivoted into the desired final pose under an active pivot servo. We will also investigate how parts can be oriented and sorted as they move on a conveyor belt against a passive sequence of fences and a method for systematically feeding parts with controlled vibrations on a metal plate. Sony uses a variant on this idea in their APOS system but they do not have a science base for programming it. The aim of this new research is to develop such a science base.","title":"Reduced Complexity Manipulation with the Parallel-Jaw Gripper: 2-Year Plan for Extended Research","awardID":"9612491","effectiveDate":"1996-07-01","expirationDate":"1998-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["520937"],"PO":["475621"]},"5430":{"abstract":"This research consists of four major objectives: (1) The development of powerful, rapid, hybrid acquisition schemes designed to operate in channels containing multiple-access interference, fading, and multipath. These schemes will be designed to acquire signals rapidly and reliably even under severe channel conditions. (2) The creation of a new class of sequential multihypothesis tests based on pipelining, a paradigm akin to a parallel server queueing system. (3) The development of acquisition schemes that exploit the presence of multipath. (4) A determination of the acquisition-based capacity of direct sequence CDMA communications and the acquisition-limited throughput of packet-data CDMA in third generation cellular communications systems. Significant advances in sequential decision theory are sought in the study, and the results will be applicable to systems ranging from multiple-resolution radar systems to PCS systems.","title":"New Sequential Procedures for Code Acquisition in Wireless CDMA Systems","awardID":"9523788","effectiveDate":"1996-07-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[13282],"PO":["150411"]},"6530":{"abstract":"At present there are large computer programs capable of representing mathematical proofs (such as NuPrl) and large computer programs capable of symbolic computation (such as Macsyma), and many theorem-proving programs that try to find proofs. But these three capabilities are nowhere present in the same system. In this project, a single system smoothly integrating symbolic computation and representation of mathematical proofs will be built, and supplemented with proof-finding algorithms. A prototype version has already been able to generate automatically an epsilon-delta proof of the continuity of f(x) = x^3. The system to be built will be able to generate many other epsilon-delta proofs and other more complicated proofs in analysis. ***","title":"RUI: Logic and Computation: Automating Proofs in Calculus and Analysis in Teacher Preparation","awardID":"9528913","effectiveDate":"1996-07-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["183415"],"PO":["187585"]},"4198":{"abstract":"Very large information systems embody invisible values, embedded in layers of infrastructure, that impact on people's lives yet are often inaccessible to public debate. This project analyzes two such infrastructural tools, seeking to understand their politics, values, and how they tie together infrastructure, work and knowledge. In order to understand how and where values are embedded into these systems, the investigators will conduct systematic comparisons. Primarily, they will examine the design, development and use of two classification systems, the International Classification of Diseases (ICD) and the Nursing Interventions Classification (NIC). The first is about one hundred years old, while the second originated only 20 some years ago. For comparative purposes and depth of analysis, the team will look at similar developments in library and racial classification schemes. Routine, even boring aspects of information encoding may have important public and scientific consequences that can only be identified by careful attention to these procedures and their outcomes. The investigators draw empirical material from several sources. They have collected archival material on the ICD from WHO and UN archives and secondary material from WHO and USPHS documents. For NIC, they have been conducting an ongoing ethnographic investigation with its designers and developers, nursing researchers at the University of Iowa. They have collected and archived interview and fieldnote transcripts and electronic bulletin board material. This research will allow them to conplete data collection and analysis and conduct systematic comparisons. Results will include a monograph as well as articles and presentations to audiences in science studies, library and information science, nursing and informatics.","title":"The Quiet Politics of Voice: A Comparative Study of Classification and Information Infrastructure","awardID":"9514744","effectiveDate":"1996-07-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["379691","532090"],"PO":["288903"]},"11816":{"abstract":"This award provided travel support for a workshop on the topic of synergy between software engineering and programming language research. The workshop was held June 12- 13 in Boston, MA, in juxtaposition with a Computing Research Association and ACM symposium on strategic directions in computing, June 14-15, in the same location. The software engineering and programming language workshop also received partial funding from ARO. ***","title":"Software Engineering and Programming Languages Workshop; June 12-13, 1996, Boston, MA","awardID":"9612496","effectiveDate":"1996-07-15","expirationDate":"1996-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["381805"],"PO":["150697"]},"11827":{"abstract":"9612513 Vasquez, Ramon Lewis, Forbes D University of Puerto Rico, Mayaguez Special Project: A Proposal for Assistance in Attending: ADMI '96-Building for the Future: The Symposium on Computing at Minority Institutions This grant provided travel assistance for faculty and students from minority institutions to participate in the 1996 ADMI Symposium. The 1996 Symposium incorporated major new themes: 1) to enable minority faculty to present papers on strategies for increasing the number of CISE-discipline students from underrepresented populations and to share these topics with representatives from major research universities, and 2) to provide for inclusion of student participants, giving them valuable experience in presenting research papers and providing for their participation in graduate study workshops. Participants were chosen by a selection committee following submission of their papers. A Conference Proceedings is being published containing all of the papers presented at the conference.","title":"Special Project: ADMI '96 - Building for the Future: The Symposium on Computing at Minority Institutions","awardID":"9612513","effectiveDate":"1996-07-15","expirationDate":"1997-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["116621"],"PO":["329035"]}}