{"80803":{"abstract":"This proposal seeks support for the invited speakers, graduate students, and junior faculty members to attend the International Workshop on Information Processing and Sensor Networks meeting. IPSN'03 provides a forum for presenting the latest advances in information processing techniques and applications for sensor networks and for discussing the practical challenges encountered and the solutions adopted. A special mission of IPSN'03 is to foster discussion of cross-layer issues in signal processing, networking, database and information management, and circuits and systems communities.<br\/><br\/>Sensor networking and distributed signal processing is a very important area in emerging technology space. It poses challenging problems in both networking technology and applications domain. The meeting is also very timely as NSF is launching a cross-directorate initiative in sensors and sensor networking.","title":"Travel Grant for Graduate Students\/Junior Faculty to Attend the 2nd. International Workshop on Information Processing in Sensor Networks (IPSN'03)","awardID":"0301167","effectiveDate":"2002-12-15","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["544506","342042"],"PO":["250082"]},"70705":{"abstract":"EIA - 0203912 Hodgins, Jessica Carnegie Mellon University<br\/>TITLE: CISE Postdoctoral Associates in Experimental Computer Science: Programming Entertainment Robots<br\/><br\/>To make humanoid robots a viable alternative for small scale entertainment applications, easier ways of programming them are needed. They must have a natural and entertaining style of motion and often require substantial motion databases to ensure a sufficient variety of behaviors. One potential solution to this problem is to use human motion data as the source of joint trajectories. Automatic techniques for human motion data use would provide the variety of motion that is required for compelling robotic performances. The postdoctoral associate will develop techniques that will allow human motion data to be used to control a wide variety of humanoid and entertainment robots and simulations. This project will involve significant experimentation both in the development of optimization techniques and in the construction and control of physical robots. The research will combine the expertise of the postdoctoral associate in dynamics, planning and motion filtering with the principal investigator's experience in simulation, control systems for human motion, and processing motion capture data.","title":"Programming Entertainment Robots","awardID":"0203912","effectiveDate":"2002-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["438709"],"PO":["564318"]},"83939":{"abstract":"","title":"Collaborative Proposal: Protocols for Mobile Ad Hoc Networks","awardID":"0314167","effectiveDate":"2002-12-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["563568"],"PO":["234222"]},"79045":{"abstract":"This two-day workshop will define particular opportunities in the field of cognitive neuroscience. It is unique in its intent to explicitly identify particular linkages to promote among cognition, computation and biology. The three organizers are highly regarded leaders in their fields, and the speakers include a diverse group with many well-recognized names. Topics include how to define cognitive neuroscience and how to use biological, behavioral and computational approaches to study cognition, and the format provides adequate time to discuss the several topics proposed.<br\/> Results from the workshop will include a set of recommendations to NSF for programmatic and cross-directorate activity mechanisms to encourage productive new approaches to cognitive neuroscience.","title":"Workshop on Integrative Cognitive Science to be held in Arlington Virginia on March 20-21, 2003","awardID":"0240720","effectiveDate":"2002-12-15","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1699","name":"COGNEURO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"1666","name":"RESEARCH ON LEARNING & EDUCATI"}}],"PIcoPI":["417028",205838,205839,"523294"],"PO":["565284"]},"87571":{"abstract":"New technology for capturing shape data from the real world<br\/>requires new algorithms to interpret and use it. Building on<br\/>new ideas about reconstructing a surface from a set of<br\/>points in three-dimensional space, we consider algorithms<br\/>for computing different shape representations, and for<br\/>aligning point sets to each other. We look for simple,<br\/>effective yet provably correct algorithms, using tools from<br\/>computational geometry but drawing on the huge body of<br\/>previous work in computer vision and graphics. This work<br\/>complements our teaching in graphics and algorithms, and<br\/>helps us train graduate students in research.","title":"CAREER: Geometry Algorithms for Sensor Data and Shape Representation","awardID":"0331736","effectiveDate":"2002-12-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["538707"],"PO":["565157"]},"87585":{"abstract":"ABSTRACT<br\/><br\/>Title: Understanding and Improving Memory System Performance via a New Approach to Cache Analysis and Access ordering<br\/>PI: Sally McKee, University of Utah<br\/><br\/>Microprocessor speed is increasing much faster than memory system speed: both speed-growth curves are exponential, but they represent diverging exponentials. This proposed research strives to develop a comprehensive approach to bridging the processor\/memory performance gap by developing better measures of performance, better tools for observing memory system behavior and understanding memory usage patterns, and combined compiler and architectural schemes to exploit these patterns.<br\/><br\/>The first component of this research investigates methods and tools by which to better measure and interpret complex system behavior in the cache and memory hierarchy. The PI and others are developing a new framework for the analysis of caching systems; this new \"caches as filters\" framework focuses on properties of a memory trace rather than artifacts of a particular memory organization. This research will support the development of the tools and technology necessary to apply the new framework to real problems and systems.<br\/><br\/>The second component of this research investigates combined compiler and architectural approaches to improving memory system performance in modern microprocessors via smarter scheduling of memory activity and hardware support for streaming.","title":"Understanding and Improving Memory System Performance via a New Approach to Cache Analysis and Access Ordering","awardID":"0331767","effectiveDate":"2002-12-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["359520"],"PO":["248088"]},"75166":{"abstract":"This IGERT award will support the establishment of a multidisciplinary graduate training program of education and research at UCSB in the broad field of interactive digital multimedia. The objective of the program is to train students in a truly interdisciplinary approach to digital multimedia, while preparing them for careers in industry, research, and education. The convergence of digital media, computing, and communication has created new and exciting opportunities in science, engineering, and the arts. The goal of this program is to integrate multiple, diverse approaches to the creation, analysis, deployment, and utilization of digital media within a coherent educational framework of training and research. This multidisciplinary endeavor necessitates collaboration between students and faculty from a broad spectrum of backgrounds and perspectives, including computer science, electrical and computer engineering, psychology, geography, design, composition, and art. Through innovative and interdepartmental courses and seminars, opportunities for internships in industry, and guidance by faculty from several departments, students will gain a unique perspective on interactive multimedia, including the creation, encoding, and distribution of multimedia content, as well as applications of multimedia systems in education, communication, and arts and entertainment. Areas of focus for research and education include image, video, and audio processing, networking, human-computer interaction, graphics and visualization, visual arts, interactive media, and computer music. The graduate training program will emphasize a broad background in several of these areas, while research projects, interactive installations and artistic performances will bring together small, interdisciplinary teams of researchers with diverse expertise. The IGERT-supported program will leverage existing strengths at UCSB in related areas and will involve the participation of several departments. The program will complement the UCSB Media Arts and Technology Program, a masters-level graduate program, by enabling doctoral students from several departments to build upon the current foundation it provides.<br\/><br\/>IGERT is an NSF-wide program intended to meet the challenges of educating U.S. Ph.D. scientists and engineers with the multidisciplinary backgrounds and the technical, professional, and personal skills needed for the career demands of the future. The program is intended to catalyze a cultural change in graduate education by establishing innovative new models for graduate education and training in a fertile environment for collaborative research that transcends traditional disciplinary boundaries. In the fifth year of the program, awards are being made to twenty-one institutions for programs that collectively span the areas of science and engineering supported by NSF.","title":"IGERT: Graduate Training Program in Interactive Digital Multimedia","awardID":"0221713","effectiveDate":"2002-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"1335","name":"IGERT FULL PROPOSALS"}}],"PIcoPI":["550914","426604","558448","459199","528224"],"PO":["434633"]},"81030":{"abstract":"This NSF Workshop, being held on Oct. 21-22, 2002, will serve the dual purpose of: (a) reviewing the research accomplishments of the first year of the NSF 01-65 Program, and (b) identifying future research needs and opportunities that may serve as the basis for a follow-on Initiative on this topic in FY 2003. A portion of the invited presentations will specifically draw in new communities to the Workshop that may be represented in a subsequent new Program Initiative.<br\/><br\/>The first day of the Workshop will consist of: (1) a plenary presentation that will set the tone of the developing research area, (2) 19 grantee presentations (15 min. each) that will review the research results of the first year of the program and will discuss broad issues that may not relate to their own research interests, (3) approximately 5 invited presentations (30 min. each) that come from NSF Directorates other than ECS and that will deal with new challenges and opportunities in this important area, and (4) a dinner speaker on industrial technology roadmaps. The second day will be dedicated to approximately four breakout discussion sessions, details of writing the final report, and issues related to a subsequent NSF Program Initiative that will be a follow-on to NSF 01-65. The Workshop will allow time to address important new research challenges and breakthrough technologies, especially those not fully addressed in the first program announcement.<br\/><br\/>The location for the workshop will be the Hyatt Regency Crystal City in Arlington, VA. We expect to have approximately 80 participants, with 65 coming from academia and industry and the remainder coming from government. Specifically, this proposal addresses: (1) a description and rationale for the workshop, (2) a list of potential speakers to be considered, (3) a list of the NSF 01-65 grantees, (4) a tentative agenda, (5) a proposed Workshop budget, (6) website material from the 2000 Workshop, and (6) the actual NSF 01-65 Program Solicitation.<br\/><br\/>The Workshop will explore research opportunities in critical enabling technologies, with the goal of assuring continued bandwidth and capacity growth in optical communication systems and networks throughout the next 10 years. The Workshop will address forward-looking and high-impact research. Moreover, the workshop will explore how the NSF can play a strategic role in alleviating the workforce issues in a troubled optical communications industry. The final report prepared by the Workshop participants will detail important challenges, both fundamental and technological, that are likely to be at the forefront of this field for many years to come.","title":"Grantees Meeting and General Workshop on Ultra-High Capacity Optical Communications and Networking: Challenges in Broadband Optical Access, Materials Processing, and Manufacturing","awardID":"0302235","effectiveDate":"2002-12-01","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1406","name":"THERMAL TRANSPORT PROCESSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1788","name":"NANOMANUFACTURING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0708","name":"Division of EMERGING ENGINEERING TECHNOLOG","abbr":"EET"},"pgm":{"id":"1414","name":"INTERFAC PROCESSES & THERMODYN"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0708","name":"Division of EMERGING ENGINEERING TECHNOLOG","abbr":"EET"},"pgm":{"id":"1467","name":"MATERIALS PROCESSING AND MANFG"}}],"PIcoPI":["560689"],"PO":["219912"]},"76971":{"abstract":"STI-XTend augments the X-Bone automated Internet overlay deployment and management tool to provide a secure environment for local and distributed network experiments, to support advanced research and classroom use. The X-Bone applies a Virtual Internet architecture to support secure, concurrent overlay networks (VPNs) using existing Unix operating systems, standard Internet protocols (IPsec, SSL, dynamic routing), and applications. It currently lacks some advanced facilities requested by a number of network researchers and faculty. STI-Xtend augments the X-Bone to support revisitation, dynamic topology control, ports it to additional platforms, and augments its API for integration with networked applications. The tool will be further packaged with additional support materials (examples, scripted demonstrations, and instructions) to enhance its use by the research and educational community. The extensions are:<br\/><br\/>Support large-scale network emulation: STI-XTend allows overlays to revisit network components, allowing a small set of devices to emulate a large network using real protocols and applications. <br\/><br\/>Dynamic topology control: STI-XTend allows overlay topologies to be modified by adding or deleting nodes or links, and to specify subset of responding nodes used (vs. arbitrary selection). This provides precise control of the participants and topology, allowing repeatable deployments.<br\/><br\/>Support additional platforms: The X-Bone supports Unix hosts and host-based routers; STIXTend provides ports for other platforms (MacOS, Solaris) and adds IPv6, multicast, and a single-board system for modest installations and control of closed platforms.<br\/><br\/>Augment user interfaces, API, and components: STI-XTend augments the X-Bone's GUI and updates its modular components and capabilities, e.g., dynamic routing (currently using defunct GateD and MRTd). <br\/><br\/>The X-Bone is based on the abstract Virtual Internet (VI) architecture, which describes concurrent parallel and hierarchical overlays. The VI model inspired two-layer encapsulation to uniquely integrate IPsec with dynamic routing, and is being used to unify web search, DNS lookup, IP forwarding, and ARP (media-layer address resolution) as instances of a single, generic service. STI-XTend augments the VI architecture to include revisitation and dynamic topology control (especially difficult with IPsec, IPv6, and dynamic routing), as well as ensuring the correctness of the X-Bone API.<br\/><br\/>Over the past 3 1\/2 years, there have been 4 public code releases and 18 public demonstrations of the X-Bone software. It is part of the FreeBSD ports collection and available as a Linux RPM.","title":"STI: Extending the X-Bone Overlay Deployment Tool for Research and Classroom Use","awardID":"0230789","effectiveDate":"2002-12-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["560690"],"PO":["564246"]},"75167":{"abstract":"This IGERT program is structured to provide a unique Ph.D. program in interdisciplinary research and education in Computational Science and Engineering (CSE). The vision is to educate students for whom working in interdisciplinary teams is the norm, and who have the ability to acquire knowledge, ways of thinking, and perspectives from other disciplines. The proposed IGERT PhD experience is different from one in a traditional discipline, and possibly unique among CSE programs in the USA. The IGERT PhD theses will be jointly supervised, and those students with a particular disciplinary orientation will share resources, knowledge, and approaches with IGERT students with other orientations. While a typical IGERT PhD thesis will still have a strong focus in a discipline, it will contain major elements of independent creative work in other disciplines relevant to the general problem area under study. IGERT students and faculty will work together in three Focus Groups: Microscale Engineering, Complex Fluids, and Computational Materials Science, to solve a wide range of important and timely problems that depend deeply on integration of information from the smaller scales to the larger scales. These multiscale problems require a strong foundation in both engineering and the mathematical and computational sciences. The curriculum ensures depth in one area and a significant exposure to high level courses in one or more ancillary areas. It includes new courses in atomic-scale computer simulation, and computing for high performance, to specifically address the multiscale nature of the Focus Group problems and their computational requirements. An internship is required to broaden and reinforce the interdisciplinary research experience, and a required series of workshops and seminars will give IGERT students a significant exposure to important aspects of career development and ethics.<br\/><br\/>IGERT is an NSF-wide program intended to meet the challenges of educating U.S. Ph.D. scientists and engineers with the multidisciplinary backgrounds and the technical, professional, and personal skills needed for the career demands of the future. The program is intended to catalyze a cultural change in graduate education by establishing innovative new models for graduate education and training in a fertile environment for collaborative research that transcends traditional disciplinary boundaries. In the fifth year of the program, awards are being made to twenty-one institutions for programs that collectively span the areas of science and engineering supported by NSF.","title":"IGERT: Graduate Education Program in Computational Science and Engineering with Emphasis on Multiscale Problems in Fluids and Materials","awardID":"0221715","effectiveDate":"2002-12-15","expirationDate":"2013-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"1335","name":"IGERT FULL PROPOSALS"}}],"PIcoPI":["239349","309499","555820","524314","459180"],"PO":["536701"]},"75158":{"abstract":"The objective of this IGERT proposal is to develop a fellowship program in the multidisciplinary area of Sensory Knowledge-based INterface Science (SKINS). This program investigates the dynamic, information-rich molecular structure of the ultimate smart interface - human skin - by coupling advances in biomedical engineering, microsystems, and information technology. The interdisciplinary approach that is required to understand the signal processing, chemical synthesis and microfluidics of this unique biological interface forms the innovative theme of this proposal. Another compelling aspect of this program is to investigate the technology transfer\/development cycle through collaboration with USF's College of Business Administration, industrial internships and international exchange. Research outcomes of this proposal would facilitate the understanding and optimizing of the science and technology of MEMS, nanotechnology and information processing for cells and tissue studies, and contribute towards the goal of transitioning the clinical laboratory into the point-of-care. The program will also facilitate the transformation of six traditionally strong research programs (from Colleges of Engineering, Medicine, Arts and Sciences, Business and Marine Science at USF and the Colleges of Engineering and Arts and Sciences at UCF) into a strong multi-disciplinary research program with a thematic focus that leverages the advances in bio, micro, nano, info and medical technologies. <br\/><br\/>IGERT is an NSF-wide program intended to meet the challenges of educating U.S. Ph.D. scientists and engineers with the multidisciplinary backgrounds and the technical, professional, and personal skills needed for the career demands of the future. The program is intended to catalyze a cultural change in graduate education by establishing innovative new models for graduate education and training in a fertile environment for collaborative research that transcends traditional disciplinary boundaries. In the fifth year of the program, awards are being made to twenty-one institutions for programs that collectively span the areas of science and engineering supported by NSF.","title":"IGERT: Sensory Knowledge-based Interface Science (SKINS)","awardID":"0221681","effectiveDate":"2002-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"1335","name":"IGERT FULL PROPOSALS"}}],"PIcoPI":["297760","523672","347336",195408,"541786"],"PO":["434633"]},"70870":{"abstract":"EIA-0204398<br\/>Lambert,Katherine<br\/>Songer,Tim<br\/>Institution: Girl Scouts Hornets' Nest Council<br\/><br\/>Title: Girls Are IT!<br\/><br\/>The Girl Scouts, Hornets' Nest Council has been extremely active in <br\/>the lives of adolescent girls in the Charlotte regional community for <br\/>over 65 years. In the 21st century, this involves reaching out to <br\/>widely diverse populations including recent immigrants from Asia, <br\/>Latin America, Africa and Eastern Europe. The success of these <br\/>outreach programs depends on understanding the language and culture <br\/>of the families in these communities and providing activities, <br\/>support, and education that is deemed appropriate and relevant for <br\/>all of the girls and adults involved.<br\/><br\/>Girls all over the country are faced with a range of opportunities <br\/>that were not available to previous generations. Part of the Girl <br\/>Scout mission is to help \"girls gain insight into coping with <br\/>contemporary moral and social dilemmas.\" Through a series of <br\/>Girl-Scout-sponsored series of innovative and engaging programs, <br\/>girls learn about preventing teen pregnancy, avoiding substance <br\/>abuse, and understanding the influence of popular culture on creating <br\/>faulty self-images regarding one's body and mind.<br\/><br\/>With support from ITWF, the Hornets' Nest Council will deliver this <br\/>content in a new and innovative way - through a custom <br\/>technology-based simulation entitled, \"Making Choices.\" \"Making <br\/>Choices\" will use a variety of technologies including wireless <br\/>networked laptop computers, Personal Digital Assistants (PDAs), <br\/>printers, scanner and digital cameras to deliver a series of <br\/>simulation activities (totaling 3-5 hours of instructions). A <br\/>research evaluation study will assess attitudes of girls and women <br\/>volunteers who participate in the standard programs versus the <br\/>technology-based programs.","title":"ITWF: Girls are IT!","awardID":"0204398","effectiveDate":"2002-12-15","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":[183444,183445],"PO":["289456"]},"80375":{"abstract":"This symposium will bring together about thirty leading thinkers and policy makers in several related areas of cyberinfrastructure for science, including scientific collaboratories, grid computing, and e-science environments. The goal is to bring together international representatives of these movements and communities to better create mutual awareness and understanding and to accelerate research, development, and deployment of these new environments to support science. A related objective is to articulate both the technical and social\/organizational prerequisites for success in these endeavors. This nascent movement has profound implications for science education, for education and research in the humanities and for the future of the entire higher education enterprise.","title":"Scientific Knowledge Environment Symposium","awardID":"0245585","effectiveDate":"2002-12-15","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["551829",209323],"PO":["565227"]},"74534":{"abstract":"EIA-0219196<br\/>Eva Toth<br\/>Allegheny-Singer Research Institute<br\/><br\/>Title: \"ITR: Co-constucting scientific understanding by integrating the social and the cognitive mechanisms of learning through shared, active representatives in interdisciplinary context.\"<br\/><br\/> This project involves the development and testing of an effective instructional methodology for software-supported, shared, active knowledge construction that is portable to a variety of science courses at different levels of student experience. The research focuses on the interface of cognition, collaboration and representational guidance and draws attention to issues that are universal in all interdisciplinary, scientific inquiry settings centered on enhancing understandingof technologically and methodologically sound ways to reach underrepresented groups and perform cross-cultural, collaborative problem solving activities over distances. Using software tools developed under separate funding, the project involves a rigorous experimental study of the mechanisms of cognitive change that are embedded in the social circumstances of learning. With the participation of high school teachers, college students and high school students, the project will contribute to understanding of (a)the function of peer audience to foster learning, (b)the most effective methods of technological support for communication between local and distal peers and (c) congnitively-guided pedagogies that are effective in enriching the learning experiences of students in various technological and instructional setting and in underrepresented regions and cultures. The project is geographically located in an urban setting with a large minority and under-represented population and involves college students, high school teachers, high school students and international collaboration. The outcome of the project will be a practical approach for effective pedagogies to elicit active learning in complex, interdisciplinary and technology driven environments that are expected to prevail in the 21st century.","title":"ITR: Co-constructing Scientific Understanding by Integrating the Social and Cognitive Mechanisms of Learning Through Shared, Active Representations in Interdisciplinary Context","awardID":"0219196","effectiveDate":"2002-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}}],"PIcoPI":[193578],"PO":["564318"]},"76977":{"abstract":"A casual observer of the current trend in computing devices today will see an increasing tendency towards more mobile and compact computing devices, even in not so obvious places such as the family car. Unlike in the past, these devices tend to perform specialized tasks and are limited in functionality, but posses a great deal of potential if used together as a single unit. The starting premise of this proposal is that future communication environments will be characterized by multi-device, deeply networked physical spaces, and that users want access anywhere, anytime.<br\/><br\/>The objective of this proposal is to develop a platform where different technologies may be integrated and bridged across to add value to services provided to users. The goal is to develop a network-based middleware MuDRA (Multi Device Rendezvous Architecture) which will empower the network infrastructure to enable multi-device, multi-modal communication for mobile users. The approach is to adopt a multi-device user scenario, where multiple devices may be used simultaneously for content delivery and communication. The solution will work with open standards, making the work interoperable with other third party services and approaches as they are developed. The proposal is an evolutionary development of existing technologies.<br\/><br\/>The results of the work will have a broad impact on a number of fields including Ubiquitous Computing, Wearable Computers, Computer Aided Collaborative Work, and so forth. The results of the work will also be available for use in other application scenarios such as distance education and delivery of content to people with disabilities.","title":"Multi-Device Rendezvous Architecture (MuDRA): An Architecture for Mobile and Heterogeneous Multi-Device Information Access","awardID":"0230812","effectiveDate":"2002-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}}],"PIcoPI":["443993"],"PO":["7594"]},"83626":{"abstract":"ABSTRACT<br\/>0205625,0205118, 0205429, 0205627 <br\/><br\/>TITLE: Collaborative Research: ITR: Acquiring Accurate Dynamic Field Data Using Lightweight Instrumentation<br\/><br\/>Dynamic analyses, such as testing and profiling, play a key role in state-of-art approaches to software quality assurance (QA). With rare exception, these analyses are performed in-house, on developer<br\/>platforms, using developer-provided input workloads. Shortcomings of this approach include that the results simply cannot be trusted to tell us how the software actually performs in the field.<br\/><br\/>The project goal is to give developers unprecedented insight into the actual runtime behavior of their software, allowing developers (and ultimately the software itself) to change, optimize, and adapt the software based on highly accurate field data. Lightweight, collaborative dynamic analyses conducted around-the-world and around-the-clock form the new platform: (1) lightly instrument fielded software (i.e., each program copy performs a small part of the analysis) (2) collect the partial data from many instances of the software, fusing it to conduct the complete analysis, (3) change the running program instances based on the findings and (4) repeat the process.<br\/><br\/>Seven critical research challenges form the core of the project: <br\/>1. Lightweight instrumentation--Develop instrumentation that is virtually transparent to individual users. 2. Compositional analysis techniques--Develop distributed analysis techniques that decompose<br\/>traditional analyses into smaller steps, distribute the steps among multiple users, and then fuse each user's results into an accurate solution to the original problem. 3. Scalability--Develop storage<br\/>and analysis techniques to deal with the high data volumes we expect to encounter. 4. Anomaly Detection--Define data-driven techniques to automatically identify anomalous behaviors of deployed<br\/>software. 5. Privacy and Security--Incorporate privacy and security safeguards into our data collection and analysis approaches. 6. Dynamic updating mechanisms--Develop techniques to make runtime changes to the location and function of instrumentation, and to parts of the software itself. 7. Validate approach on industrial<br\/>software.","title":"Collaborative Research: ITR: Acquiring Accurate Dynamic Field Data Using Lightweight Instrumentation","awardID":"0312859","effectiveDate":"2002-12-31","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["534923"],"PO":["564388"]}}