{"43320":{"abstract":"This project involves the development of new fault models and on-chip test methods for large embedded memories in systems-on-chip environments. The fault models are being developed using multidimensional device modeling and simulation tools that provide dimensional control over individual process layers. These fault models are validated with physical experimentation. The on-chip test methods include combining the dynamic power supply current, iDDT, with traditional deterministic BIST to reduce defect escapes. High-speed iDDT testing circuits are being developed to catch frequency-dependent faults. This project is being developed in collaboration with Intel Corporation.","title":"Test Solutions for Next-Generation Embedded Memories","awardID":"9912412","effectiveDate":"2000-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["207128","478308","318568"],"PO":["562984"]},"48835":{"abstract":"This project is on fast and accurate computational techniques for the design of 3D embedded RF components. The numerical method to be investigated is based on a full-wave Mixed Potential Integral Equation formulation that has the capability of providing accurate modeling of 3-D interactions and handling arbitrary multi-layered media with different dielectric constants. Critical mathematical and algorithmic breakthroughs will be explored in the areas of fast calculation of multi-layered dyadic Green's functions over substrate, fast matrix solution of impedance matrices, high order basis functions, and fast frequency sweep techniques. Promising results from our initial investigations indicate that special numerical techniques superior to the techniques used in present software tools can be developed for 3D RF components in multi-layered media, and may lead to significant impact to the design of wireless systems. This project will also provide an opportunity for close interactions among the university team members and National Semiconductor Corporation - the industrial partner. Such an effort will strengthen the graduate education in both engineering and applied mathematics at participating universities, while industry will be benefited by potential fundamental breakthroughs of innovative and exploring research at universities.","title":"Development of Efficient and Accurate Numerical Techniques for the Design of Embedded Three Dimensional RF Components","awardID":"9988375","effectiveDate":"2000-12-15","expirationDate":"2003-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[125002,"542982"],"PO":["562984"]},"59023":{"abstract":"This award is for NSF co-sponsorship of a workshop to develop a multi-author, advanced-level textbook for human-computer interaction (HCI) in the area of theories, models, and frameworks. Human-computer interaction is a broad and interdisciplinary area concerned with interactions among computational, behavioral, cognitive, social and organizational factors in the design and use of information technology. This area has rich scientific foundations, but they are not addressed in graduate curricula and are under-utilized in research and development. The approach proposed is to form a committee of leading experts who can represent each of about a dozen important scientific areas and theoretical positions: human perception, motor behavior, information processing, notational systems, interaction languages, problem-solving and exploration, distributed cognition, common ground and grounding in dyadic interactions, small group analysis, ethnographic workplace studies, organizational science and design rationale. A face-to-face workshop will integrate and synthesize first-draft materials and develop a plan for revising chapters into a coherent book. The objective is to raise the quality and legitimacy of human-computer interaction research with respect to underlying theoretical issues.","title":"Workshop in Models, Theories, and Frameworks for Human-Computer Interaction on November 2-4, 2000 in Blacksburg, Virginia","awardID":"0097342","effectiveDate":"2000-12-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["549541"],"PO":["495796"]},"69509":{"abstract":"","title":"KDI: Automated Learning in Network Traffic Control","awardID":"0196397","effectiveDate":"2000-12-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1320","name":"ECONOMICS"}}],"PIcoPI":[179914,"417590"],"PO":["297837"]},"69530":{"abstract":"","title":"Integrated Multicast for Ad Hoc Networks (IMAHN-NSF)","awardID":"0196418","effectiveDate":"2000-12-31","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["551159","515757"],"PO":["234222"]},"56853":{"abstract":"This CISE Information Technology Workforce (ITW) proposal requests funds to study the underrepresentation of females and minorities in IT careers. The study will use a theoretical framework based on expectancies, values, and achievement behaviors. It was developed to study why females are underrepresented in mathematics, physics, and engineering. For the past 17 years, this framework has been used to study educational and occupational choices among children, adolescents, and young adults, using longitudinal survey designs that include multiple indicators from children, their parents, teachers, and school records. As a result, there are three longitudinal data sets that will be used in the study. In addition, the necessary supplementary IT-related data will be collected and added to the Michigan Study of Adolescent Life Transitions (MSALT) data set. Part of this data will be collected via surveys and the rest via interviews. This project has the potential to provide valuable insights into the underrepresentation of women and minorities IT careers.","title":"ITW: Women, Minorities, and Technology","awardID":"0089972","effectiveDate":"2000-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1397","name":"CROSS-DIRECTORATE  ACTIV PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["523378","562540"],"PO":["289456"]}}