{"119966":{"abstract":"While advances in information technology (IT) change our lives, drive our economy and transform the conduct of science, it takes 15-20 years for research in IT to be transformed into industrial production. In a few decades, we will depend upon research begun tomorrow or next year to provide the transforming ideas for the future. When this is coupled with the declining enrollments in computing programs, the problem becomes starkly drawn. This series of vignettes will highlight different problems for which IT research can help offer solutions. The problems range from enabling a general improvement in life across the planet, to the design of a new Internet. Approximately a dozen vignettes will be illustrated with high impact graphics. The vignettes will provide examples of possible transformations that are accessible to the non-specialist. Additional links will also be provided, if the reader chooses to gain a deeper understanding. One anticipated result is the generation of more interest in computing science as a discipline in colleges and universities, as well as enhanced public understanding of the role of research in developing new ideas and a strong economy.","title":"SGER: Vignettes: The Promise of Information Technology","awardID":"0630803","effectiveDate":"2006-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["209556"],"PO":["565136"]},"110572":{"abstract":"Background<br\/><br\/>Modern high-performance systems are chronically underutilized not because their job queues<br\/>are short, but because each task uses just a small fraction of the power available on each node.<br\/>Compiled code simply does not achieve a reasonable fraction of the available performance, despite<br\/>years of work in academia and in research labs that aimed to improve the situation. Some of the<br\/>performance gap is due to architecture and design; however, a portion of it is directly attributable<br\/>to the design of optimizing compilers. Standard optimization techniques fail to discover and fix such problems, in part because they operate at a procedure-level granularity and in part because the remedy requires the compiler to change its approach to optimizing that part of the code to use another order or another transformation scheme. <br\/><br\/>Intellectual Merit <br\/><br\/>In this project, the PI will develop a feedback-driven adaptive compilation harness<br\/>that specifically targets improvements in small regions of underperformance. To make the regional<br\/>scheme work, his team will enhance and reformulate two powerful optimizations, rematerialization and<br\/>reassociation, and re-scope others so that they operate on a regional rather than a global scope.<br\/><br\/>Broader Impact<br\/><br\/>This project will directly support graduate education at Rice. The positive research<br\/>results will be taught in a Rice graduate course on the subject; the material will reach a broad<br\/>audience because the teaching materials for the course are used at other institutions. The work in<br\/>this project will add to the code base for the Rice University research compiler, which is distributed free of<br\/>charge in source-code form to others in both academia and industry. The PI will use a combination of<br\/>local funds and directed research projects to include undergraduates directly in this work.","title":"ST-CRTS: A Coordinated Performance-Directed Attack on Underperformance","awardID":"0541165","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["309293","309294"],"PO":["565272"]},"110583":{"abstract":"CCF-0541206 <br\/>PI: Friedman, Eby G. <br\/>Institution: University of Rochester <br\/>Title: Design Methodologies and Algorithms for Three-Dimensional Integrated Systems <br\/><br\/><br\/>Abstract<br\/>The introduction of the integrated circuit (IC) has led the electronics market to unprecented growth over the past several decades. This rate of growth has to date been leveraged by the semiconductor industry scaling the size of the transistors of the circuits. This scaling has delivered systems with higher performance and greater functional capabilities. The increase in integration density however cannot continue due to several limitations, both physical and technological. The focus of research in the IC design community has, therefore, been dedicated to the development of design methodologies that will provide effective solutions to predicted challenges in the design of future integrated circuits.<br\/>An emerging design paradigm is that of three-dimensional integration, where the third dimension is utilized for additional circuitry. With the third dimension, the distance between neighboring circuits is greatly reduced, improving the performance as well as the density of the system. A straightforward analogy from our daily lives can be described; the walking distance between two neighboring building is almost always longer than the distance between two neighboring floors in a high rise building.<br\/>In this research project, important design issues related to 3-D systems are investigated in order to advance and proliferate the knowledge in this promising technology. This project emphasizes three critical issues for the reliable design of integrated circuits:<br\/>Developing design methodologies to synchronize the operation of circuits across each layer and among the layers making up the 3-D structure.<br\/>Providing design strategies to efficiently deliver the required power for the robust operation of the circuits on each layer of the 3-D system.<br\/>The development of techniques that support the undistorted propagation of signals throughout the 3-D system. This task has become particularly challenging due to device scaling, since the closer the devices are to each other, the greater the interference between the signals.<br\/>These methodologies will be applied to various circuits, and prototypes will be fabricated to demonstrate the efficacy and limitations of the proposed design techniques and methodologies.","title":"Design Methodologies and Algorithms for Three-Dimensional Integrated Systems","awardID":"0541206","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["553419"],"PO":["562984"]},"111441":{"abstract":"CAREER: Physical Design Automation for Fast and Reliable 3D Circuits<br\/>PI: Sung Kyu Lim, Georgia Institute of Technology<br\/><br\/>The 3D integrated circuit is an emergent technology that vertically stacks multiple die with a die-to-die interconnect. The die-to-die via pitch is very small and provides the possibility of arranging digital functional blocks across multiple die at a very fine level of granularity. This results in a decrease in the overall wire length, which translates into less wire delay and less power. Advances in 3D integration and packaging are undoubtedly gaining momentum and have become of critical interest to the semiconductor community. These 3D integrated circuit and package manufacturing technologies are rapidly being adopted by several leading companies for commercial applications. In spite of the rapid advancement in 3D fabrication and packaging technologies, the design automation community has seen very little progress on the development of computer-aided design tools for 3D integration. The goal of this research is to develop physical design algorithms for 3D integrated circuits. We perform placement and routing at two levels of design abstraction: microarchitecture and circuit level. Our objective is to optimize performance, power, and size while addressing several important reliability issues such as thermal hot-spot, leakage power, and power-supply noise.<br\/><br\/>The intellectual merit of the research is to conduct the first detailed hierarchical study on how 3D technology impacts the organization of processor microarchitectures and their circuit implementation. First, 3D-aware design decisions as early as in the microarchitectural floorplanning stage are crucial in addressing the opportunities and challenges for using 3D technology. Second, a proper management of the thermal-via, through-the-silicon-via, and decoupling capacitor is a highly effective means of alleviating the ever-worsening thermal, leakage, and power-supply noise problems in 3D integrated circuits. Third, retiming is a powerful tool to reduce both dynamic and leakage power under performance constraints while considering the statistical behavior of the gate and interconnect delay caused by process variations. Finally, we are investigating a number of interesting topology styles for the 3D clock network and demonstrate how to consider clock skew variation under thermal and voltage variations. The broader impact of the research is to call for a very strong collaboration between researchers from the microarchitecture and EDA\/physical design areas that will bridge the disciplines to deliver better processor technologies. Similarly, students working on the research are gaining multi-disciplinary and cross-cutting experience from low-level areas such as circuit design, physical design, thermal modeling, and noise modeling, to high-level topics, including microarchitecture design and multi-objective\/multi-constraint optimization algorithms.","title":"CAREER: Physical Design Automation for Fast and Reliable 3D Circuits","awardID":"0546382","effectiveDate":"2006-06-15","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["422053"],"PO":["562984"]},"111375":{"abstract":"Cristina Nita-Rotaru<br\/>Purdue<br\/>0545949<br\/><br\/>Abstract<br\/>Wireless mesh networks are emerging as a promising robust low-cost<br\/>network architecture able to provide increased coverage and larger<br\/>bandwidth, resulting in higher quality of service and information<br\/>availability.<br\/>Many distributed applications provided on wireless mesh networks enable<br\/>collaborations and sharing of information. Such applications benefit<br\/>from scalable, robust and secure group services such as<br\/>one-to-many or many-to-many multicast and distributed data access.<br\/>Group services, in turn, require support from infrastructure protocols<br\/>such as routing, or security mechanisms such as authentication, access<br\/>control and key management.<br\/><br\/>The goal of this project is to advance state-of-the-art group-oriented<br\/>services in the context of wireless mesh networks. The project presents<br\/>new formulations of distributed problems capturing the particularities of<br\/>wireless mesh networks and the interactions between security, availability<br\/>and scalability. It also studies the viability and limitations of cross-layer<br\/>design as a new paradigm of building secure network services. Innovative<br\/>results consist of scalable one-to-many and many-to-many wireless<br\/>multicast protocols that provide support for efficient group communication, scalable<br\/>data sharing algorithms that are robust to malicious behavior,<br\/>high-throughput, robust and secure routing that assist applications to achieve<br\/>high-performance, scalable key management protocols and authentication<br\/>mechanisms enabling decentralized infrastructure access services.<br\/>This project contributes to the education of the next generation of secure<br\/>systems designers, generating interactions between the distributed<br\/>systems, security and wireless networks research areas.","title":"CAREER: Scalable, Robust and Secure Group-Oriented Services for Wireless Mesh Networks","awardID":"0545949","effectiveDate":"2006-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["519699"],"PO":["497499"]},"115742":{"abstract":"There is a pressing requirement for compact, reliable, ultra-sensitive and cost-effective chemical sensors for emergency response and threat detection. A major problem in persistent sensors has been the size and power consumption requirements. The technology proposed answers this problem with a proposed network of nano-wires that will be used as selective point sensors, utilizing a combination of electronic and optical responses. Detection of an adsorbed chemical on individual wires will use both current voltage curves and surface-enhancde Raman scattering spectra. Nano-wires are grown and assembled into networks using surface tension and magnetic forces. Making the junctions of the networks reproducible and coupling with electronic sensors will enable design of a multi-modal sensor. This will enable low cost sensors for detection of biological and chemical agents to be built. The group has engaged with local high schools in an active mentoring and internship program, as well as outreach to teachers. An additional university-level laboratory course will be enhanced to deal with the new nano-fabrication requirements of nano-wire networks. The development of the sensors will have a broad impact in medicine and environmental monitoring, as well as national security.","title":"Selective Nanowire Sensors for Chemical Agent Detection, JHAPL_FY06_022","awardID":"0610171","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I435","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T885","name":"DIA-MASINT"}}],"PIcoPI":[306532,"539603"],"PO":["565136"]},"116567":{"abstract":"Title:<br\/>Collaborative Research: CSR---AES: A Framework for Optimizing Scientific Applications<br\/><br\/>The Design Optimizer for Scientific Applications (DOSA) framework<br\/>allows the programmer or compiler writer to explore alternative<br\/>designs and optimize for speed (or power) at design-time and use its<br\/>run-time optimizer as an automatic application composition system<br\/>(ACS) that constructs an efficient application that dynamically adapts<br\/>to changes in the underlying execution environment based on the kernel<br\/>model, architecture, system features, available resources, and<br\/>performance feedback. DOSA allows design-time exploration and<br\/>automatic run-time optimizations using continuous performance<br\/>optimizations (CPO) so that application programmers and compiler<br\/>writers are relieved from the challenging task of optimizing the<br\/>computation in order to achieve high performance. As an illustration<br\/>of the DOSA framework, one complex, full application is optimized for<br\/>IBM Cell. The innovative performance optimization techniques for the<br\/>memory hierarchy use new techniques for reducing I\/O complexity, data<br\/>layout, data remapping, and in-memory processing, and are supported by<br\/>DOSA, the semi-automatic design framework and dynamic run-time<br\/>system. This framework allows rapid, high-level performance estimation<br\/>and detailed low-level simulation by incorporating high-level<br\/>performance models into the model-integrated computing framework. The<br\/>run-time system dynamically improves application performance using the<br\/>component library, the models, and the run-time optimizer. The<br\/>application studies are chosen for their broad impact to traditional<br\/>and emerging scientific areas such as bioinformatics, computational<br\/>biology, and medical applications, as well as for national security.<br\/>The project especially encourages the participation by women,<br\/>minorities, and underrepresented groups.","title":"Collaborative Research: CSR---AES: A Framework for Optimizing Scientific Applications","awardID":"0613376","effectiveDate":"2006-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563658"],"PO":["493916"]},"109429":{"abstract":"Digital audio is widely used for research in areas from biology field studies to video games, yet software platforms to support such research are largely incompatible, often poorly designed, and rarely portable. Software bugs and unimplemented features discourage new users, and researchers waste vast resources duplicating efforts. In this project the PI will create a suite of coordinated and interoperable software libraries and applications, giving researchers easy access to audio data. Low-level audio interfaces will fill an important need for well-designed, cross-platform, open-source libraries that provide direct access to audio data. Libraries will be developed for audio input and output, access to audio sound files, MIDI input and output, and access to standard MIDI files. This effort will not create new hardware or device drivers, rather it will add a thin abstraction layer above existing operating system audio APIs that hides the ugly details and operating system dependencies, making audio access simpler. A high-level application will support users who need a general-purpose tool for audio visualization that provides instruments for audio analysis and annotation that do not currently exist. Audio visualization capabilities will include waveforms, spectrograms, other 1D and 2D functions of time, text and graphical annotations, and piano-roll displays of music data. The annotation facility will allow users to sketch on displays, edit graphical overlays, and save annotation data in simple text-based representations for exchange with other software. Analysis software will include an integration of the Marsyas project, which is widely used in audio classification research; indeed, the PI will build upon existing software wherever possible, both to reduce the total effort and to increase the impact by tapping into established communities and loyalties. <br\/><br\/>Broader Impacts: This work will establish de-facto standards and benefit diverse research areas including not only music and audio technology but also human-computer interfaces, assistive technologies, acoustics, human perception, surveillance and security, and patient monitoring and care, and education, to name but a few. Project outcomes will both facilitate the incorporation of audio in applications, and reduce duplicated effort by allowing audio software to be shared across platforms, thereby making it easier, for example, for teachers to incorporate \"hands-on\" audio processing into their curricula, and supporting innovative efforts relating to universal access and collaborative systems.","title":"Digital Audio Computing Infrastructure","awardID":"0534370","effectiveDate":"2006-06-15","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["397882"],"PO":["565227"]},"112982":{"abstract":"This IRES project will provide U.S. graduate students from select institutions with the opportunity to gain international research experience through summer internships at INRIA, the French National Institute for Research in Computer Science and Control. INRIA is currently funding 14 Associated Teams of French and U.S. researchers, with partners located throughout the U.S. and France. Generally, the Associated Teams emphasize collaborations between established researchers. However, the importance of graduate student participation in the collaborative research of the Associated Teams has been recognized in terms of both their contribution to the research effort and of the educational value to the students. In order to increase participation of graduate students in the Associated Teams, INRIA has allocated funding for three-month summer internships by 20 U.S. graduate students per year for three years from the Associated Teams at the labs of their INRIA counterparts. This NSF award provides the needed travel funds for these students, covering airfare to and from France, and support for activities related to their stays. This award is co-funded by the Office of International Science and Engineering and the Directorate for Computer and Information Science and Engineering.<br\/><br\/>Intellectual Merit<br\/>The 14 INRIA-U.S. Associated Teams participating in the proposal cover a variety of areas in computer science and include world-class researchers on both sides of the Atlantic. The research areas involved are timely and state-of-the art and the partnerships are true intellectual collaborations.<br\/><br\/>Broader Impacts<br\/>Support is provided for 60 U.S. graduate students to conduct research in France, thus providing a large group of U.S. students with international research experiences that will prepare them to operate successfully in a global environment. The linkages created by their visits will support lasting international collaboration. In addition, the students will come from labs distributed throughout the U.S., and in meeting each other during the orientation and concluding portions of the program, will expand their own scientific networks.","title":"IRES: International Research Experiences for U.S. Students at INRIA","awardID":"0553462","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["409520"],"PO":["564152"]},"112520":{"abstract":"Abstract<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Wireless Open-Access Research Platform (WARP) - A Scalable and Extensible Testbed for High Performance Wireless Systems<br\/>Proposal: CNS 0551692<br\/>PI: Sabharwal, Ashutosh<br\/>Institution: Rice University<br\/><br\/>The principal investigators at Rice University will develop the Wireless Open-Access Research Platform (WARP) that promotes a holistic and rapid approach to wireless network design. WARP will be a scalable and extensible platform with three component layers: custom hardware with scalable processing and extensible I\/O, platform support packages that provide seamless integration across different hardware components, and an application design environment. They will develop an open-access repository with WWW access that allows WARP users to construct wireless networks, share experiments over the Internet, and implement their networks on their own WARP hardware kits; lastly the investigators will develop a wireless development kit and make it available to other researchers and educators, conduct workshops on use of the WARP system, and host a student exchange program.","title":"CRI: Wireless Open-Access Research Platform (WARP) - A Scalable and Extensible Testbed for High Performance Wireless Systems","awardID":"0551692","effectiveDate":"2006-06-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"024F","name":"GENI CONCEPT\/DEVELOPMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["542042","50058","548310","548311","312197"],"PO":["493916"]},"111453":{"abstract":"Abstract:<br\/>IIS-0546443<br\/><br\/>This project addresses the practical need to develop more advanced personalization and recommendation technologies. Although recommender systems represent the most researched and developed personalization technologies applicable in a variety of applications, most current-generation recommender systems focus on recommending items to users and represent user preferences for an item with a single rating, and therefore are not sufficient to capture the intricacies of some of the more complex settings. This project develops several enhancements necessary for the next generation of recommender systems, such as context awareness, multi-criteria ratings, rating aggregation, flexibility of recommendations, and non-intrusiveness. In particular, the proposed approach explores the synergies between the recommendation process and the multidimensional\/OLAP data model and extends the traditional recommendation framework to incorporate the advanced capabilities in a systematic manner. Overall, this research project will make contributions to both theory and practice by developing new frameworks, models, algorithms, and implementations that provide effective ways to deal with information overload and promote access to relevant information. Technologies resulting from this research can bring a broad range of benefits in many areas, including business and electronic commerce, social settings, and education. In addition, research results will be incorporated in the undergraduate and graduate courses on Business Intelligence and Information Technologies at the University of Minnesota. The results will also be made available to scientific community through publications in refereed journals and conferences. In addition, the project website (http:\/\/ids.csom.umn.edu\/faculty\/gedas\/NSFcareer\/) will be used to disseminate the publications, datasets, software, and course materials that result from this project.","title":"CAREER: Next Generation Personalization Technologies","awardID":"0546443","effectiveDate":"2006-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["454578"],"PO":["563751"]},"111343":{"abstract":"The computers used today function according to the laws of Newtonian mechanics. These laws govern macroscopic objects. A quantum computer, when one is built, will functions according to the laws of quantum mechanics. These laws govern objects which are very small in size such as individual atoms. The laws of quantum mechanics can be quite different from those of our ordinary experience and have given rise to very curious, but experimentally verifiable, physical phenomena. Since the laws are different, the processes involved in computing with quantum systems are different and in some cases give rise to advantages over the computers of today. This makes the results of quantum mechanical calculations not just curious, but useful. <br\/> The unit of information storage on the computers of today is called a bit and can take two values, zero and one. The quantum computer envisaged by the pioneers of quantum computing would use quantum states which have two available states, also denoted with a zero and a one. However, whereas it has been shown that systems using more classical states cannot provide an advantage over the bit, advantages exist for quantum systems which use more than two states for quantum information processing. A key resource for quantum computers is a set of highly correlated quantum states called entangled states. Quantum states with more than two states can have a higher degree of correlation and share a larger fraction of that correlation with other states in the quantum system. In spite of these advantages, little work has been done to understand the ways quantum systems with many states may be used in quantum information processing. <br\/> At this time we still have no prototypical quantum information processing device. This is due to errors in quantum devices. There are several proposed methods to remedy such errors. These quantum error prevention strategies can be put into three categories, quantum error correcting codes, decoherence-free or noiseless subspaces and dynamical decoupling controls. These methods, and combinations of them, have been applied to the quantum bit (quantum two-state) model of quantum computing. The goal of the proposed project is to develop a model of computation based on higher-dimensional quantum systems, i.e., those with more than two states, and also develop associated quantum error prevention protocols which combine the known methods of error protection. Key components of this project are the educational components which aim to promote discussions as to the best methods of error prevention and to disseminate that knowledge braodly. This will be done in a class and a workshop both of which focus on preventing errors in proposed quantum information processing devices. The class notes and results of the workshop will be published on a web site devoted to quantum error prevention methods. The goal of the research is to overcome the obstacles presented by noisy experiments in order to help develop a prototypical quantum computing device. <br\/> The impact on science and society could be far-reaching since a quantum computer could solve several important problems more efficiently. In addition to problems in Computer Science, they could simulate quantum mechanical systems far more efficiently than the computers being used today. Such problems are found in Engineering, Chemistry, Biology and Physics. This could lead to better materials, nano-scale devices, pharmaceuticals and better ways in which to extract energy from nuclei.","title":"Career: Practical Quantum Error Prevention Protocols Involving Quantum Systems With More Than Two Orthogonal States","awardID":"0545798","effectiveDate":"2006-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["397084"],"PO":["565157"]},"112443":{"abstract":"Review Analysis<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI A MASSIV Cluster for Designing Chip Multiprocessors <br\/>Proposal: CNS 0551401<br\/>PI: Hill, Mark D.<br\/>Institution: University of Wisconsin-Madison<br\/><br\/> <br\/>Researchers at the University of Wisconsin, Madison will acquire a computing cluster infrastructure, distinguished by large memory and storage capacity, that will facilitate research on designs for multiple processors on a single. The compute cluster will enable the group to research innovative new designs through simulation and evaluation of designs that are tested against large, future workloads. Research will look at innovations such as log-based transactional memory to ease multithreaded programming, using hardware to aid multithreaded debugging, leveraging token coherence for aggressive CMP memory hierarchies, using compression to enlarge on-CMP caches and reduce off-CMP bandwidth requirements, exploiting on-CMP transmission lines for novel cache architectures, facilitating speculative parallelization and multithreading, handling increasing memory latencies, parallelizing the execution of system-intensive workloads on novel CMP micro-architectures, minimizing the performance impacts of robust, reliable software, and exploring new ways such as coherence decoupling to address cache coherence. Broader impacts of this project include training, industry partnerships, and sharing the evaluation infrastructure and simulated workloads with other research groups.","title":"CRI: A MASSIV Cluster for Designing Chip Multiprocessors","awardID":"0551401","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["541915","438221","541916"],"PO":["550859"]},"121166":{"abstract":"Modern experimental techniques in many fields of neuroscience can produce large quantities of data that can be processed and modeled in many ways, often providing the opportunity to answer questions beyond the original experimental motivation. Additionally, more and more sophisticated algorithms are being developed to analyze large neural data sets. An infrastructure that allows for routine sharing of data and algorithms will help advance the field while facilitating the validation of published results. Data sharing is now commonplace in other fields such as genomics and astrophysics and in these fields has accelerated the pace of research. There are numerous challenges (technical and social) involved in setting up and maintaining an infrastructure for sharing data and tools. The purpose of this meeting is to bring together a core group of experimentalists and modelers to examine ways in which such a system could be structured so as to best benefit the scientific community as well as the individual investigator.","title":"Planning Workshop: Corpora for Computational Neuroscience","awardID":"0636838","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":["483816",321988,"498150"],"PO":["564318"]},"116513":{"abstract":"Ever-increasing power densities and cooling costs have led to the consideration of the power<br\/>and thermal impact of chip multiprocessor (CMP) designs during early design stages. The aim of this project is to perform thermal modeling and simulation of CMPs, develop dynamic thermal management (DTM) techniques and perform thermal characterization of such designs. Thermal models being developed can accurately capture the thermal characteristics of the processors, on-chip network and packaging. The DTM techniques target the processors and network synergistically. A large suite of applications are being thermally characterized on both<br\/>fine-grain and coarse-grain CMPs. Broader impacts will include making the tools available on the web to help other researchers, inclusion of material in a graduate-level course, involvement of undergraduates in research and outreach to female and minority students.","title":"CSR---SMA: Thermal Modeling, Management, and Characterization of Chip Multiprocessors","awardID":"0613074","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550002"],"PO":["493916"]},"117306":{"abstract":"The objective of this SGER proposal is to explore high availability storage services through a forefront research on distributed symmetric active-active metadata management. This SGER proposal investigates and provides a proof of concept of three key problems: global state identification and consistency, group communication overhead, and metadata server membership management.","title":"SGER: Distributed Symmetric Active\/Active Metadata Management","awardID":"0617528","effectiveDate":"2006-06-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550809"],"PO":["543507"]},"111421":{"abstract":"With ever-increasing miniaturization of computers and advances in communication technology, effective energy management in battery-operated embedded systems has gained an unprecedented importance. On the other hand, applications with stringent timing and quality-of-service constraints pose a serious computational burden on these systems. The research community has recently invested significant effort into the investigation of energy management techniques for real-time embedded systems. Nevertheless, most of these studies focus on a single component (e.g. the processor or memory) and a specific power management technique (e.g. reducing the clock frequency or turning off a component). This CAREER research is developing a comprehensive framework for system-wide energy management in real-time embedded systems. The framework includes new formal models, algorithms and tools to reduce overall system energy, across multiple components and through multiple techniques. Another focus of the project is on the lifetime-aware schemes that adjust the performance in terms of the data quality or timeliness, to sustain the system for a given operation (or, mission) time with a fixed energy budget. This research will have a substantial impact on the next-generation of real-time embedded systems by extending their lifetime significantly, and by enabling them to deliver high-quality performance with limited resources.","title":"CAREER: A Holistic Energy Management Framework for Real-time Embedded Systems","awardID":"0546244","effectiveDate":"2006-06-01","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["485622"],"PO":["561889"]},"110354":{"abstract":"CMS-0540132, PI: Yu Ding, Texas A&M University<br\/>CMS-0540278, PI: Jiong Tang, University of Connecticut<br\/><br\/>Abstract<br\/>This collaborative research (0540132, PI: Yu Ding, Texas A&M University; and 0540278, PI: Jiong Tang, University of Connecticut) will provide a dynamic data-driven framework for wind turbine diagnosis. This new methodology is fundamentally different from the current practice whose performance is limited due to the non-dynamic and non-robust nature in the modeling approaches and in the data collection and processing strategies. This framework consists of two robust data pre-processing modules for highlighting fault features and removing sensor anomaly, three interrelated, multi-level models that describe different details of the system behaviors, and one dynamic strategy for the robust local interrogation that allows for measurements to be adaptively taken according to specific physical conditions and the associated risk level. It incorporates both historical data and on-line signals into the system modeling, and enables the ability to adaptively alter data collection procedures to best capture the critical system features. Collectively, these components lead to a robust and sensitive diagnosis system for wind turbines. This research is strengthened by a close collaboration with industry that will provide abundant historical sensor data and detailed system characterization, and also offer in-field implementation opportunities. <br\/>The proposed research will have strategic importance on the utilization of wind energy that is currently the most viable clean energy alternative. Today, in the vast areas that have low wind speed, wind energy cannot compete with traditional energy sources as it has a higher cost, mainly owing to its high maintenance costs and low confidence in the diagnosis technology. This dynamic and data-driven fault diagnosis will play a key role in enabling a cost-effective generation of wind electricity. Progress in the fault diagnosis of blades and gearboxes will also benefit the power generation, automobile, aerospace, and engine industries. Meanwhile, the collaborative nature of this research will provide students with a multidisciplinary training and will bring industrial perspective to the universities. This project will have a long-term impact on education through the curriculum development and will promote the public awareness of clean energy concept through outreaches to high schools.","title":"DDDAS - SMRP: A Framework For the Dynamic Data-Driven Fault Diagnosis of Wind Turbine Systems","awardID":"0540132","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["467092"],"PO":["564651"]},"123796":{"abstract":"This research addresses the problem of dimensionality reduction, discovering low dimensional structure hidden in high dimensional data. It arises in many fields of information processing, and poses a particular challenge to researchers attempting to build machines that emulate feats of human perception, such as recognizing faces and understanding speech. It also plays an increasingly prominent role in many applications of statistical and scientific computing. With the advent of widespread information technologies, it has become possible to collect and manipulate ever-increasing amounts of experimental data. Thus, scientists interested in the exploratory analysis and visualization of large multivariate data sets face similar challenges in information processing as our perceptual systems.<br\/><br\/>This research focuses on two recently proposed algorithms for dimensionality reduction. The two algorithms address the \"curse of dimensionality\" as it arises in two different settings of machine learning: (1) unsupervised learning, where the dimensionality reduction is performed without any feedback from the learning environment, and (2) supervised learning, where the dimensionality reduction is performed with the benefit of labeled examples.<br\/><br\/>The first algorithm to be studied is Locally Linear Embedding (LLE), an unsupervised learning algorithm that computes low dimensional, neighborhood preserving embeddings of high dimensional data. The data, assumed to lie on a nonlinear manifold, is mapped into a single global coordinate system of lower dimensionality. The mapping is derived from the symmetries of locally linear reconstructions, and the actual computation of the embedding reduces to a sparse eigenvalue problem. Notably, the optimizations in LLE (though capable of generating highly nonlinear embeddings) are simple to implement, and they do not involve local minima. LLE has applications to exploratory data analysis, scientific visualization, and computer vision.<br\/><br\/>The second algorithm is Multiplicative Margin Maximization (M3), a supervised learning algorithm for nonnegative quadratic programming in support vector machines (SVMs). Support vector machines currently provide state-of-the-art solutions to many problems in machine learning, particularly those involving data sets of high dimensionality. Solving the quadratic programming problem in SVMs, however, remains a significant bottleneck in their implementation. The M3 algorithm is designed to alleviate this bottleneck. Its update rules have a simple closed form, and they converge monotonically to the solution of the maximum margin hyperplane. Moreover, they do not involve any heuristics such as choosing a learning rate or deciding which variables to update at each iteration. They optimize the traditionally proposed objective function for SVMs and can be applied to problems in classification, regression, and novelty detection.<br\/><br\/>The algorithms to be studied in this research are easy to implement, but the problems they solve are quite complex. Compared to previous approaches, they are distinguished not only by their novel simplicity and well-behaved optimizations, but also by the unexpected connections they make to other areas in mathematics, computer science, and statistics. The work will not only develop the theoretical foundations of these algorithms, but also attempt to scale them up to increasingly large problems in machine learning.<br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. The research is expected to have a broad impact across many areas of science and engineering, by overcoming the challenges posed by data sets of extremely high dimensionality. Software toolkits will be published, so that researchers everywhere will have access to state-of-the-art methods for dimensionality reduction. The educational innovations will include new undergraduate and graduate courses in artificial intelligence, machine learning, statistical computing, and sensory processing.","title":"CAREER: Statistical Methods for Dimensionality Reduction in Machine Learning","awardID":"0650074","effectiveDate":"2006-06-30","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7704","name":"Science of Learning Activities"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["525662"],"PO":["460643"]},"111498":{"abstract":"Abstract for Proposal # 0546709<br\/><br\/><br\/>This proposal aims to perform fundamental research on planning, perception and probabilistic reasoning in the context of a deceptively simple challenge task: A robot is given a crude description of a relatively easily recognizable object to find, and sent into a new environment to find this object. The robot is expected to return with a map showing the location of the object. The following can be said about this task: 1) It is a prerequisite or enabling technology for many other tasks of economic and practical importance; 2) It ought to be possible given existing hardware and computing power; 3) It is not adequately addressed by existing techniques; and 4) It reveals fundamental shortcomings in our understanding of core AI problems. This proposal aims to address these challenges directly with novel approaches to acquiring, representing, and planning with sense data.","title":"CAREER: Observing to Plan - Planning to Observe","awardID":"0546709","effectiveDate":"2006-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518533"],"PO":["491702"]},"112466":{"abstract":"Abstract<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Computational Biology Facility for Western Massachusetts<br\/>Proposal: CNS 0551401<br\/>PI: Brock, Oliver<br\/>Institution: University of Massachusetts Amherst<br\/><br\/><br\/>Researchers at the University of Massachusetts-Amherst will acquire a computer cluster for research in bioinformatics and computational biology research supporting researchers in Western Massachusetts. Research will focus on five research areas that seek to understand protein function determination based on genetic sequence information. The projects bridge computer science and molecular biology to find computational methods to discover the mappings to functions. The project will make these resources available on campus and encourage use in the Five Colleges of Western Massachusetts building on a regional Computational Biology Special Interest Group established in 2005. The researchers will actively recruit students from underrepresented groups through the Northeast Alliance for Graduate Education and the Professoriate and collaborations with minority serving and womens colleges and universities.","title":"CRI: Computational Biology Facility for Western Massachusetts","awardID":"0551500","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[297657,"376899","315938"],"PO":["565136"]},"110531":{"abstract":"The Utah Hardware Ray Tracing group is designing special purpose hardware that uses ray tracing to generate computer graphic images. Ray tracing creates much higher quality and more realistic images than existing commercial graphics chips, all of which use a z-buffer based algorithm, and is more efficient when the scene object database is extremely large or where the primitive objects are not simple triangles. However, ray tracing is considered too slow to work interactively on commodity computers. The end goal of this research is to develop technology to enable commodity ray trace chips that can replace today's graphics processing units and enable higher quality and more realistic graphics capabilities for future computers. <br\/><br\/>This research casts the ray tracing algorithm domain into a specialized processor that includes multiple ray tracing pipelines. Ray tracing is a naturally parallel application that can take advantage of parallel hardware, and specialization of the processor hardware enables vastly increased performance over software running on a generic CPU. Their design strategy is based on previous work in designing domain specific processors that includes run-time configuration of the datapath. This allows the device to operate at very close to the speed of a fully custom pipeline, but with enough programmability so that variations in algorithm can be accommodated after fabrication. <br\/><br\/>While special purpose hardware and ray tracing are active research areas, little is known about the design of special purpose ray tracing hardware. This project includes a VLSI researcher, a memory architect, and two ray tracing specialists, precisely the areas needed for this project. The project will produce knowledge about a rich set of intellectual issues related to computer graphics and the design of special purpose memory systems and computational pipelines. The results of this project have the potential to help move high-end computer graphics capabilities onto every PC. The group's end goal is to bring a graphics capability that is currently only available to the computing elite into everyday use.","title":"Hardware Support for Interactive Ray Tracing","awardID":"0541009","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["542053",292838,"451272","342952"],"PO":["559883"]},"120211":{"abstract":"This is funding to support attendance by approximately 15 graduate students in a doctoral consortium (workshop) to be held in conjunction with the Eighth International Conference on Multimodal Interfaces (ICMI'06), to be held November 2-4, 2006 in Banff, Canada, and sponsored by the Association for Computing Machinery (ACM). ICMI is the foremost conference representing the growing interest in next-generation perceptive, adaptive and multimodal user interfaces, systems, and applications, which are especially well-suited for interpreting natural communication and activity patterns in real-world environments; their emergence represents a radical departure from previous computing, and is rapidly transforming the nature of human-computer interaction by creating more natural, expressively powerful, flexible and robust means of interacting with computers. The 3-day conference will bring together researchers from academia and industry from around the world to present and discuss the latest multi-disciplinary work in the field. The theme of this year's conference is multimodal collaboration through different platforms and applications; the conference will focus on major trends and challenges in this area, including distilling a roadmap for future research and commercial success. Participants in the doctoral consortium will receive feedback from an invited committee of half a dozen senior personnel to posters which reflect work-in-progress not mature enough for a full paper at ICMI; they will also get to present their work orally to the conference as a whole during a doctoral spotlight session highlighting top student research <br\/><br\/>Broader Impacts: The doctoral consortium will give students exposure to their new research community, both by presenting their own work and by observing and interacting with established professionals in the field. It will encourage students at this critical time in their careers to begin building a social support network of peers and mentors. Participants will be selected with the goal of increasing the conference's breadth and diversity; the organizers will make an effort to recruit members of traditionally under-represented groups including women, minorities, and people with disabilities, as well as from less well-funded institutions where adequate support for student conference attendance may be otherwise unavailable.","title":"Student participant support for ICMI 2006","awardID":"0631995","effectiveDate":"2006-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["515704"],"PO":["565227"]},"116900":{"abstract":"Abstract:<br\/><br\/>This collaborative project studies dynamical systems characterized by a combination of hybrid and probabilistic behavior. Hybrid behavior is characterized by discrete switching between system modes and continuous evolution within a mode. Such systems frequently arise in a wide range of applications, from power electronics and communication networks to economics and biology. In this research, a new modeling framework for such systems is developed, which supports external variables, compositional reasoning, and nondeterministic as well as probabilistic transitions. New stability criteria for such probabilistic hybrid systems are obtained. In contrast with existing results, they are formulated in terms of two independent components: a family of Lyapunov functions (one for each continuous mode) and a slow-switching condition of an average-dwell-time type. This modularity has the benefit of decoupling the search for Lyapunov functions from the verification of the desired properties of the discrete dynamics. The latter task is the focus of the project, and is treated using two complementary methods: one based on proving an invariant property, and another based on solving an optimization problem. These theoretical results are supported by development of new software tools.","title":"CSR--EHS: Collaborative Research: ASPIRE: Antipodal Staged Processing in Role-adaptive Embedded Systems","awardID":"0615226","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["399674"],"PO":["561889"]},"110388":{"abstract":"CMS-0540132, PI: Yu Ding, Texas A&M University<br\/>CMS-0540278, PI: Jiong Tang, University of Connecticut<br\/><br\/>Abstract<br\/>This collaborative research (0540132, PI: Yu Ding, Texas A&M University; and 0540278, PI: Jiong Tang, University of Connecticut) will provide a dynamic data-driven framework for wind turbine diagnosis. This new methodology is fundamentally different from the current practice whose performance is limited due to the non-dynamic and non-robust nature in the modeling approaches and in the data collection and processing strategies. This framework consists of two robust data pre-processing modules for highlighting fault features and removing sensor anomaly, three interrelated, multi-level models that describe different details of the system behaviors, and one dynamic strategy for the robust local interrogation that allows for measurements to be adaptively taken according to specific physical conditions and the associated risk level. It incorporates both historical data and on-line signals into the system modeling, and enables the ability to adaptively alter data collection procedures to best capture the critical system features. Collectively, these components lead to a robust and sensitive diagnosis system for wind turbines. This research is strengthened by a close collaboration with industry that will provide abundant historical sensor data and detailed system characterization, and also offer in-field implementation opportunities. <br\/>The proposed research will have strategic importance on the utilization of wind energy that is currently the most viable clean energy alternative. Today, in the vast areas that have low wind speed, wind energy cannot compete with traditional energy sources as it has a higher cost, mainly owing to its high maintenance costs and low confidence in the diagnosis technology. This dynamic and data-driven fault diagnosis will play a key role in enabling a cost-effective generation of wind electricity. Progress in the fault diagnosis of blades and gearboxes will also benefit the power generation, automobile, aerospace, and engine industries. Meanwhile, the collaborative nature of this research will provide students with a multidisciplinary training and will bring industrial perspective to the universities. This project will have a long-term impact on education through the curriculum development and will promote the public awareness of clean energy concept through outreaches to high schools.","title":"DDDAS - SMRP: A Framework For the Dynamic Data-Driven Fault Diagnosis of Wind Turbine Systems","awardID":"0540278","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1639","name":"SENSORS AND SENSING SYSTEMS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"7641","name":"INT'L RES & EDU IN ENGINEERING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["540944"],"PO":["564651"]},"112467":{"abstract":"Abstract<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Experimental Research in High-Performance Computing and Wireless Networking <br\/>Proposal: CNS 0551650<br\/>PI: Raju, G. V. S.<br\/>Institution: University of Texas at San Antonio<br\/><br\/>The University of Texas at San Antonio, a leader in higher education for Hispanic students and a rapidly growing research university, will establish a strong interdisciplinary research effort in wireless networks and security, high-speed networking, parallel and distributed computing, and image processing. Research includes progress on mathematical software libraries for cluster computers, 3D image reconstruction for tomography, persistent wireless networks, and energy-efficient and secure ad hoc and sensor networks. This award will support faculty and graduate student participants. Broader impacts of this project include increasing institutional capacity for research, increasing minority participation in graduate training, and enhancing the workforce for South Texas.","title":"CRI: Experimental Research in High-Performance Computing and Wireless Networking","awardID":"0551501","effectiveDate":"2006-06-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[297661,297662,297663,297664,297665],"PO":["557315"]},"111423":{"abstract":"CAREER: Categorization and Identification of Visual Scenes<br\/>PI: Aude Oliva<br\/><br\/>One remarkable aspect of visual recognition is that humans are able to recognize the meaning (or \"gist\") of complex visual scenes within 1\/20 of a second, independently of the quantity of objects in the scene. This rapid understanding phenomenon can be experienced while looking at rapid sequences in television advertisements and quick cuts in modern movie trailers. How is this remarkable feat accomplished? Research over the last decade has made substantial progress toward understanding the mechanisms underlying single object recognition, but less progress has been made toward understanding scene recognition. For example, computer systems fall well short of human performance in tasks that require recognizing the gist of a scene. Dr. Aude Oliva has undertaken a novel approach to this challenging question by studying mechanisms of analysis that are global in nature, focusing on statistically robust features describing the spatial layout of the scene (e.g. its volume, its perspective, its level of clutter) and not merely its components (e.g., the objects in a scene). With National Science Foundation support, Dr. Aude Oliva will conduct a five-year CAREER award study to examine how a global approach to image analysis can explain humans remarkable ability to recognize scenes and objects. Moreover she will use this approach to define operational strategies for machine vision systems. This program of research will combine a number of methodologies, including behavioral experiments (psychophysics, eye tracking), cognitive neuroscience methods (event-related potentials), and computational modeling. Applications of this work might include scene and space recognition systems to assist drivers, automatic systems that could provide semantic descriptions of the contents of large image databases, and computer assisted systems to aid the visually-impaired in navigating through visual space. The educational mission proposed by Dr. Oliva includes laboratory training of graduate and undergraduate students in the cognitive and computational methods of scene understanding, as well as a new course on computational visual cognition, and a winter tutorial together with an annual symposium both on scene understanding.","title":"CAREER: Categorization and Identification of Visual Scenes","awardID":"0546262","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["509344"],"PO":["564318"]},"110455":{"abstract":"The Computing Research Association's Committee on the Status of Women in Computing Research (CRA-W) has been awarded a Broadening Participation in Computing grant to build an alliance with the Coalition to Diversify Computing (CDC). The alliance will be implementing and evaluating programs to increase the participation of women and minorities in computing research. <br\/><br\/>Projects that will be made possible by this award include:<br\/><br\/> Discipline-specific Mentoring Tracks to provide appropriate mentoring and to build communities of researchers from under-represented groups within the context of specific research areas, <br\/><br\/> Coordinated Research Mentoring Programs to provide the most effective research experiences for undergraduates to encourage them to apply and enhance their chances of admission to graduate school in Computer Science and Engineering (CS&E), <br\/><br\/> A new Extended Mentoring Program to help continue and foster some of the mentoring relationships initiated by these and other programs offered by CRA-W and CDC, and <br\/><br\/> A new Traveling Lectureship Symposium to bring outstanding women and minority speakers to institutions without a large number of visiting researchers or women or minority faculty.","title":"BPC-A: Widening the Research Pipeline","awardID":"0540631","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":["536735","353750","209556","318770","495323",292630],"PO":["564181"]},"112523":{"abstract":"Abstract<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Undergraduate Education: Tools for Teaching Network Infrastructure <br\/>Proposal: CNS-0551703<br\/>PI: McKeown, Nick<br\/>Institution: Stanford University <br\/> <br\/>Investigators at Stanford University will conduct research leading to new tools to support teaching and research in networking software and hardware. The Virtual Network System (VNS) is a software tool that runs on commodity personal computers with which students can develop network elements such as routers and protocols. It allows users to develop new services and protocols, while assuring that each is independent of the network. Students can run multiple instances of routers or other elements while insulating other students and the Internet from mistakes. The NetFPGA tool uses programmable FPGAs in a custom design supported with commercial design and programming tools. Students can create router hardware and explore projects such as hardware\/software designs.","title":"CRI: Undergraduate Education: Tools for Teaching Network Infrastructure","awardID":"0551703","effectiveDate":"2006-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"024F","name":"GENI CONCEPT\/DEVELOPMENT"}}],"PIcoPI":["560546"],"PO":["550859"]},"110598":{"abstract":"Proposal no: 0541278.<br\/>Luca Carloni<br\/>Kenneth Shepard (co-PI)<br\/>Columbia University<br\/><br\/>Title: CMOS VLSI Design of Low-Power Scalable Heterogeneous Networks for Multi-Core Systems-on-Chip.<br\/><br\/>During the past decade, interconnects have replaced transistors as the dominant determiner of integrated circuit performance by imposing primary limits on latency, energy dissipation, signal integrity and design productivity for giga-scale integration. Low-latency, low-energy circuits for communications will require regular, structured interconnect to engineer wires and tune circuits to those wires. On-chip networks (OCN)<br\/>provide such a structured fabric in which communication is obtained by routing packets through a general-purpose interconnect structure rather than using a design-specific ad hoc global wiring network routed by CAD tools. The PIs will investigate the design of scalable OCNs for multi-core systems-on-chip by combining a new low-latency, low-energy, current-mode signalling approach based on damping <br\/>compensation with the design of latency-insensitive communication protocols extended to support fault-tolerant communication as well as dynamic voltage and frequency scaling and power-down for the cores.","title":"CMOS VLSI Design of Low Power Scalable Heterogeneous Networks for Multi-Core Systems-on-Chip","awardID":"0541278","effectiveDate":"2006-06-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["529662","518555"],"PO":["562984"]},"115757":{"abstract":"The preparative work for producing biological threat agents is often disguised using a variety of methods, from heat, to treatment with bleach, to flooding the area with a common nonpathogenic organism. Detection has focused on the presence of native materials, such as DNA or proteins. A variety of agents will be subjected to reagents and new methods used to stabilize cells to preserve potential macromolecular analytes for identification. The antibody recognition results of toxins that have been heat-modified will be characterized and generalized. A related problem is seen from environmental samples, where agents such as heat, sunlight or high salinity may have the same effect. A further study on selective agents and the recovery of specific signatures will enable the development of new forensic assays. In many instances, consideration of the exact mechanism of modification can give clues for the maintenance of detectable levels of macromolecules of interest. The broad applicability and utility of the research in environmental science and threat assessment is noted.","title":"Detection of Decomposing Threat Agents","awardID":"0610221","effectiveDate":"2006-06-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}}],"PIcoPI":[306568,"490938"],"PO":["565136"]},"120202":{"abstract":"SGER: Constructivist Learning using ASyMTRe in Multi-Robot Teams<br\/><br\/><br\/>Constructivist learning is the process of actively learning new skills based on previous experience. This research project extends the state of the art for constructivist learning in multi-robot teams by developing new, computationally efficient techniques that allow robot team members to continually improve their skills over time. Current approaches to constructivist learning in robotics find correlations between existing low-level robot actions and a desired behavior. However, because these existing approaches begin with such a low level of action abstraction, they are extremely computationally intensive. Our new constructivist learning approach begins at a higher level of abstraction - the sensori-motor schema - which should enable much more computationally efficient learning. Our approach builds upon our prior work, called ASyMTRe, that forms multi-robot coalitions by automatically combining sensori-motor schema building blocks to solve the task at hand. This proposed work adds an important learning component allowing robot team members to continually improve their skills by \"chunking\" existing low-level schema building blocks into efficient higher-level task solutions. This new approach will provide important new lifelong learning capabilities to multi-robot teams, thus significantly facilitating their use in real-world applications, such as search and rescue, security, mining, hazardous waste cleanup, industrial and household maintenance, automated manufacturing, and construction. We also intend to show that the proposed techniques are applicable to other types of robotic systems, including humanoid and service robots, and thus have a broader impact on the robotics field as a whole.","title":"SGER: Constructivist Learning using ASyMTRe in Multi-Robot Teams","awardID":"0631958","effectiveDate":"2006-06-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["521959"],"PO":["403839"]},"119817":{"abstract":"0630161<br\/>Hunziker<br\/>This award partially supports a series of three national and international Frontiers of Engineering (FoE) Symposia by the National Academy of Engineering. They are: German-American, May 4-6, 2006 in Murray Hill, NJ; U.S., September 21-23, 2006 at Ford Motor Company, Dearborn, MI; and Japan-American, November 9-11, 2006 in Tsukuba, Japan.<br\/><br\/>Many important and timely topics at the frontiers of engineering research and innovation will be covered, such as managing technology risks, cybersecurity and privacy issues related to computing and information technology, energy resources, nano\/bio technology, intelligent software, biomechatronics, systems biology, etc.<br\/><br\/>Between 60 and 100 outstanding young engineers will be involved in each Symposium. The meetings will create the opportunities for sharing of research insights and techniques that may spur collaboration and serve as a reference point for many of the emerging frontiers work in the U.S.","title":"2006 Frontiers of Engineering Symposia (U.S., Japan-America, and German-American); Murray Hill, NJ; Dearborn, MI; Tsukuba, Japan","awardID":"0630161","effectiveDate":"2006-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1414","name":"INTERFAC PROCESSES & THERMODYN"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1491","name":"BIOTECH, BIOCHEM & BIOMASS ENG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}}],"PIcoPI":["543859"],"PO":["319455"]},"116815":{"abstract":"Abstract:<br\/><br\/>This collaborative project studies dynamical systems characterized by a combination of hybrid and probabilistic behavior. Hybrid behavior is characterized by discrete switching between system modes and continuous evolution within a mode. Such systems frequently arise in a wide range of applications, from power electronics and communication networks to economics and biology. In this research, a new modeling framework for such systems is developed, which supports external variables, compositional reasoning, and nondeterministic as well as probabilistic transitions. New stability criteria for such probabilistic hybrid systems are obtained. In contrast with existing results, they are formulated in terms of two independent components: a family of Lyapunov functions (one for each continuous mode) and a slow-switching condition of an average-dwell-time type. This modularity has the benefit of decoupling the search for Lyapunov functions from the verification of the desired properties of the discrete dynamics. The latter task is the focus of the project, and is treated using two complementary methods: one based on proving an invariant property, and another based on solving an optimization problem. These theoretical results are supported by development of new software tools.","title":"CSR--EHS: Collaborative Research: ASPIRE: Antipodal Staged Processing In Role-adaptive Embedded-systems","awardID":"0614853","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["515835"],"PO":["561889"]},"115748":{"abstract":"Biomimetics involves taking a biological structure or system and mimicking it in a constructed physical system. The proposed work takes the structure of the Ornia ochracea fly and develops it into a miniature microphone system. The fly employs a unique coupled mechanical bar system to extract the direction of sound. Although the fly has ears separated by only about 500 micrometers, it has remarkable sensitivity to the direction of sound, sensitivity that would not be possible using techniques in larger animals, such as the difference in arrival time or the amplitude of the sound. The proposed micro-electromechanical system is based on an initial finite element simulation that indicates that the design will replicate the directional response. <br\/><br\/>Combining advances in Microsystems with biological system functionality will lead to a novel sound sensor. In addition to understanding how the hearing system of the fly achieves sensitivity, the sensors can be used to pinpoint sounds in the absence of people, such as at monitoring facility. The research will engage both advanced researchers and high school students. The system being designed could lead to the development of ultra-sensitive, small microphones and detectors that can be incorporated into a next-generation hearing aid for humans.","title":"MEMS-based Miniature Microphone for Directional Sound Sensing [NPS_FY06_018]","awardID":"0610185","effectiveDate":"2006-06-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I153","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}}],"PIcoPI":["328783","328784"],"PO":["565136"]},"110612":{"abstract":"Background<br\/><br\/>Writing portable parallel programs in high-level languages on modern computing engines is heavily constrained by locality of reference; they can only run fast if they reuse data already close to the processor, and if they can compute much more than they must communicate.<br\/><br\/>Intellectual Merit<br\/><br\/>The proposed research addresses this problem with a new style of programming that organizes computation<br\/>so that it is addressed implicitly. \"Divide-and-conquer\" applies at once to recursive control, to data<br\/>sharing, to broad communication, and to machine organization. Programmers will again be able to solve important problems without much knowledge about the memory hierarchy or network communication. It will deliver high-performance computing to ordinary scientists, and allow generations of students to learn it as part of their first programming language. Success will advance computing, and all sciences and engineering that depend upon it.<br\/><br\/>Broader Impacts <br\/><br\/>Products include a new programming style, new efficiencies for parallel and Grid computing,<br\/>tools to carry old codes into this environment, tools to support the new generation of programs,<br\/>support for teaching a new generation of programmers, and new algorithms that can only be inspired by this<br\/>high-level perspective on programming.<br\/><br\/>The project offers huge payoffs, both in the future growth of useful applications of parallel computing<br\/>and in delivering access to this technology to many more students and future scientists and engineers.<br\/>The results of this research can simplify the teaching and learning of large-scale computing.<br\/>Results will be disseminated via the usual channels of conference and journal papers, and programming<br\/>tools will be delivered over the net.","title":"A Paradigm of Parallel Programming for Morton-Ordered Matrices","awardID":"0541364","effectiveDate":"2006-06-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["430172"],"PO":["565272"]},"111503":{"abstract":"The goal of this research is to automate two core management functionalities for wireless networks - performance management and fault management. These functionalities are critical to providing high-quality and reliable wireless communications. To achieve this goal, this research develops a systematic framework, called M3, which measures, models, and manages wireless networks. M3 uses measurement data to drive model construction. In this way, the model can more closely reflect a given network than a generic network model. In the meantime, the simplicity of the network model permits efficient analysis and control.<br\/><br\/>To realize the framework, the research develops novel methodology for measuring and inferring wireless interference and traffic demands in a scalable and accurate fashion. Based on the measurement data, network embedding is used to construct simple and flexible models to facilitate network analysis and control. The research further develops robust optimization, stochastic programming, and outlier detection techniques for network optimization, troubleshooting, and recovery. To demonstrate the practical values of the approaches, this work will develop a complete toolkit for wireless network measurement, modeling, and management, and apply them to managing wireless networks at home, on campus, in enterprises, and at medical clinics. The techniques and toolkit developed can significantly improve current wireless network operations and facilitate new wireless network development. Finally, the research results of the project will be integrated into undergraduate and graduate curriculum.","title":"CAREER: Towards Self-Managing Wireless Networks Using M3","awardID":"0546755","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560223"],"PO":["557315"]},"111514":{"abstract":"Intellectual Merit: The generalized view of multiuser communication with side information resulting from the proposed activity will be a significant contribution to network information theory. It will set in place powerful tools and techniques that will be pivotal in estimating the capacity limits of complex wireless networks. Genie based capacity bounds will establish fundamental limits of how useful side information can be in a wireless network. The proposed activity brings together diverse areas like networking, optimization theory, and numerical algorithms. The PI has a successful record of previous research characterizing single and multiuser capacity with partial channel knowledge.<br\/>Broader Impact: Understanding the capabilities of wireless networks is essential for the industry, the academia,the government agencies and the society in general to have realistic expectations from the wireless networks of the future. The results of this research will be disseminated broadly through traditional scholarly venues to the entire research community, the government and the industry. The research will help government agencies direct their resources into enabling the applications that are shown to be within the capacity limits of wireless networks. The guidelines for designing wireless networks will be useful for the industry. Society as a whole will benefit from the increased array of applications of wireless networks driven by the optimal design principles. The results of the proposed activity will be integrated into coursework and educational research initiatives. The fundamental nature of these contributions will allow simple abstractions that can be readily understood by undergraduates, inspiring them to seek careers in research and education. As a minority institution, UC Irvine allows many opportunities for the vision of future wireless networks emerging out of this research to be presented to minorities, women and disadvantaged sections of society.","title":"CAREER: Capacity of Wireless Networks with Side Information - Theory and Applications","awardID":"0546860","effectiveDate":"2006-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["550258"],"PO":["564924"]},"112537":{"abstract":"Abstract<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Acquisition of Research Instrumentation Infrastructure for Next-Generation Broadband Communication Systems <br\/>Proposal: CNS 0551735<br\/>PI: Heydari, Payam<br\/>Institution: University of California-Irvine<br\/><br\/> <br\/>Researchers at the University of California-Irvine will acquire test and measurement equipment for integrated research and education focused on the design and implementation of novel nano-scale circuits for next generation, wireless and wireline, broadband communication systems. Specific research to be conducted is in three areas: (1) Methodologies will be introduced for the design of high performance front-end circuits in scaled silicon technologies such as 100GHz silicon based integrated radio. This effort will be extended to the design and implementation of the entire high data rate wireless transceiver (including both ultra-wideband (UWB) and multiple-input multiple output wireless systems) in a close collaboration among the PIs. (2) In the area of broadband wireline system design, the group will conduct research on silicon-based implementations of circuits\/systems, operating at 40Gb\/s and higher, while addressing the impact of environmental noise sources (e.g., crosstalk, power\/ground noise, substrate noise) on the performance of these circuits. (3) Finally, high-frequency measurement (particularly jitter and phase noise measurements) will be an area for research. Research and training in measurement, collaborations with industry and other groups in the universitys College of Engineering, and research at system design, circuits, antennas, and semiconductors will create a strong interdisciplinary activity. Broader impacts of the project include providing an experimental facility supporting training and research in circuits and systems, promoting knowledge transfer to industry in the Irvine area, and supporting the Broadband Multimedia Access activities of Calit2.","title":"CRI: Acquisition of Research Instrumentation Infrastructure for Next-Generation Broadband Communication Systems","awardID":"0551735","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["517175","561612","544662"],"PO":["564778"]},"116915":{"abstract":"Abstract:<br\/><br\/>This project develops energy management techniques for large-scale,<br\/>multi-tier data-centers, using formal optimization methods that do not<br\/>compromise performance requirements. High-performance Internet<br\/>services are often functionally decomposed into a pipeline of<br\/>multiple, semi-independent tiers spanning multiple machines. These in<br\/>turn might consist of a heterogeneous mix of system generations, due<br\/>to phased upgrades. Power delivery and cooling costs constitute a<br\/>significant part of total cost of ownership.<br\/><br\/>The expected workload of such a system is aperiodic, with highly<br\/>varying execution demand and possibly significant I\/O activity. This<br\/>represents an opportunity for major energy savings, but only if<br\/>performance guarantees can be maintained. Scalability also requires<br\/>that local power management decisions must yield globally optimal<br\/>energy consumption. Although effective power management policies have<br\/>been devised for simpler architectures, no straightforward extensions<br\/>exist to make them applicable to multi-tier clusters while preserving<br\/>response-time guarantees.<br\/><br\/>Results will be disseminated at leading conferences and the software<br\/>will also be publicly available on the Internet for use by the<br\/>research community in further research, or by the industry as a basis<br\/>for possible product development. Moreover, from a global societal<br\/>perspective, successful energy management helps save natural<br\/>resources, while reduced service-provider costs foster economic growth<br\/>and IT innovation. Finally, this research will help train graduate<br\/>and undergraduate students.","title":"Collaborative Research: CSR--AES: Energy Management in Real-time, Multi-tier Internet Services","awardID":"0615277","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["489873"],"PO":["493916"]},"121679":{"abstract":"The focus of this proposal is on extremely high performance (very high speed, but also energy efficient) digital IC design. The proposed research has three tasks: 1) high performance digital logic techniques, 2) CAD tool development to aid rapid deployment of the high performance logic techniques, and 3) applications of the high performance logic techniques; in particular, the design of circuit blocks that demonstrate unprecedented speed, while still having reasonable energy efficiency<br\/><br\/>Task 1: Research on High Performance Digital Logic Techniques: <br\/>Focus is on maximizing the performance of the output prediction logic (OPL) technique, and developing yet faster and\/or more energy efficient logic techniques.<br\/><br\/>Task 2: CAD for Rapid Implementation of High Performance Digital Logic:<br\/>Techniques<br\/>Two CAD tools will be developed to ease design and verification of OPL circuits under this proposal: 1) A static timing analysis tool for OPL circuits, and 2) an automatic transistor\/gate sizing tool for OPL circuits that minimizes energy consumption subject to delay goals. <br\/><br\/>Also a powerful convex-optimization-based tool for automatic transistor and gate sizing for OPL circuits is being investigated. The tool will minimize energy consumption while achieving a specified delay target.<br\/><br\/>Task 3: Research on Applications of High Performance Digital Logic<br\/>Techniques:<br\/>Applications include: 1) a new 64b adder architecture having a simulated worst-case<br\/>delay (under severe process, voltage and temperature variations) of 3.3<br\/>fanout-of-four inverter delays. 2) a very fast floating-point divider with the possibility of a latency of 6ns for a 0.20-micron TSMC process. This divider will run at a frequency of at least 3 GHz in this 0.20-micron process, enabling the use of division for the very first time in signal processing and communications circuits. 3) a new FPGA architecture, called OPL-FPGA, which suggests an FPGA could approach the circuit speeds obtained by standard cell ASICs. Mapping common datapath circuits to this architecture further suggests that speedups of at least 3.3X over state-of-the-art commercial FPGAs are attainable.","title":"Ultra High Performance Digital Circuit Design and Synthesis","awardID":"0639341","effectiveDate":"2006-06-22","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[323356],"PO":["562984"]},"110569":{"abstract":"Slow simulation speed and a vast number of user-configurable processor and compiler parameters preclude a detailed exploration of the design space. Although architects have proposed solutions such as reduced input sets and sampling to minimize the effect of slow simulation speed, what has not been proposed are systematic statistically-based approaches to pare the design space. <br\/>Moreover, when evaluating the efficacy of a new processor feature or when comparing the performance of two processors, architects typically look at high-level single metrics or the behavior of a specific processor component in isolation. While these metrics and techniques can give the architect insight into the processor?s behavior, in addition to not being statistically-based, they are potentially limited by being too abstract or narrowly focused. The fundamental problem with both cases is that they do not systematically analyze the processor?s performance. <br\/><br\/>To address the dual problems of poor simulation speed ? especially as it pertains to design space reduction ? and haphazard performance analysis, the goal of this project is to develop a suite of statistically-based simulation and performance analysis tools. Some of the key tools of this suite include a tool for identifying a processor?s performance bottlenecks (and their relative ordering); a tool for evaluating the effect of a new processor feature, and a tool for improving level of accuracy of simulation sampling techniques by finding an ideal sampling frequency using signal-processing and statistical concepts. <br\/><br\/>Since MicroStAT will be publicly available at the end of this project, academic researchers and industry will be able to improve the statistical-rigor of their simulation methodology and, thus, the quality of their simulation results. Furthermore, this project will make substantial contributions to educational development. It will support the dissertation research of Ph.D. students in electrical and computer engineering and computer science, along with several master?s projects and research opportunities for several undergraduate students.","title":"MicroStAT: A Microarchitect's Statistically-based Analytical Toolkit","awardID":"0541162","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["528635","486295"],"PO":["559883"]},"113517":{"abstract":"This experimental research program is directed toward producing nonclassical (e.g., squeezed and entangled) light by using radiation pressure effects in an optical cavity. Specifically, the investigators will use the optical nonlinearity of a Fabry Perot cavity in which one mirror is integrated into a micromechanical cantilever. For this nonlinearity to produce nonclassical light, the cantilever must respond not just to the quasi-static radiation pressure, but also to the radiation pressure shot noise. This will be achieved by using microfabrication techniques (developed in the investigators earlier work) to produce ultrasensitive cantilevers specifically designed for this purpose. Estimates based on the theoretical literature suggest that cavities incorporating these cantilevers should be capable of generating squeezed and entangled light with a performance comparable to, and for some applications superior to, currently available sources. The broader impact of the program involves education of students as well as overlap with a wide range of fields. <br\/><br\/>This project is jointly supported by the Optical Physics program in the Physics Division and the Condensed Matter Physics program in the Division of Materials Research of the Mathematical and Physical Sciences Directorate.","title":"Cavity Quantum Optics with Radiation Pressure","awardID":"0555824","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1290","name":"OPTICAL PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["511869"],"PO":["461829"]},"116828":{"abstract":"Title:<br\/>Collaborative Research: CSR---AES: A Framework for Optimizing Scientific Applications<br\/><br\/>The Design Optimizer for Scientific Applications (DOSA) framework<br\/>allows the programmer or compiler writer to explore alternative<br\/>designs and optimize for speed (or power) at design-time and use its<br\/>run-time optimizer as an automatic application composition system<br\/>(ACS) that constructs an efficient application that dynamically adapts<br\/>to changes in the underlying execution environment based on the kernel<br\/>model, architecture, system features, available resources, and<br\/>performance feedback. DOSA allows design-time exploration and<br\/>automatic run-time optimizations using continuous performance<br\/>optimizations (CPO) so that application programmers and compiler<br\/>writers are relieved from the challenging task of optimizing the<br\/>computation in order to achieve high performance. As an illustration<br\/>of the DOSA framework, one complex, full application is optimized for<br\/>IBM Cell. The innovative performance optimization techniques for the<br\/>memory hierarchy use new techniques for reducing I\/O complexity, data<br\/>layout, data remapping, and in-memory processing, and are supported by<br\/>DOSA, the semi-automatic design framework and dynamic run-time<br\/>system. This framework allows rapid, high-level performance estimation<br\/>and detailed low-level simulation by incorporating high-level<br\/>performance models into the model-integrated computing framework. The<br\/>run-time system dynamically improves application performance using the<br\/>component library, the models, and the run-time optimizer. The<br\/>application studies are chosen for their broad impact to traditional<br\/>and emerging scientific areas such as bioinformatics, computational<br\/>biology, and medical applications, as well as for national security.<br\/>The project especially encourages the participation by women,<br\/>minorities, and underrepresented groups.","title":"Collaborative Research: CSR---AES: A Framework for Optimizing Scientific Applications","awardID":"0614915","effectiveDate":"2006-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["558497"],"PO":["493916"]},"110636":{"abstract":"0541465<br\/>Banerjee, Kaustav<br\/>U of Cal Santa Barbara<br\/><br\/>A CAD Framework for Multiscale Electrothermal Modeling and Simulation of Non-Classical CMOS Devices<br\/><br\/>As scaling of CMOS devices continues unabated beyond the 90 nm node, a number of critical challenges including severe short-channel effects, increasing leakage currents and power dissipation are accelerating the introduction of new materials and device structures to extend the lifetime of CMOS down to, and perhaps beyond the 22 nm node. These devices are classified as non-classical CMOS and include strained-Si, ultra-thin body Silicon-on-Insulator (UTB-SOI), double-gate (such as FinFETs) and multi-gate devices. While these device structures seek to address the above mentioned scaling challenges, thermal management in these ultra scaled devices is an increasing concern made worse by the introduction of materials with poorer thermal conductivity (SOI, SiGe) and the physical confinement of the device geometries. Moreover, for device geometries where the mean free path of the phonons are comparable to (or larger than) the device size (channel length), classical drift-diffusion theory fails to accurately predict the temperature profile in the channel region of the transistors. At present, CAD tools that are widely used for device level electrothermal simulations, use drift-diffusion or hydrodynamic models and energy-balance equations assuming local thermodynamic equilibrium and therefore do not account for these effects, thereby compromising the performance and reliability of integrated circuits based on these devices. Moreover, there is no well defined methodology that combines electrothermal models at different length scales (as needed for a CMOS transistor) and subsequently generates accurate compact models to allow fast electrothermal simulations. Additionally, lack of thermal management in these emerging CMOS devices can also lead to significant increase in reliability problems such as electrostatic discharge (ESD), which is known to be the largest single cause of all IC failures in the semiconductor industry. Hence, there is an imminent need for developing suitable CAD framework for accurate multi-scale electrothermal modeling and simulation, in order to understand the impact of thermal effects on the electrical characteristics of these non-classical devices and subsequently on their circuit performance and reliability. The framework is also critical for optimizing the design of these devices and to understand various electrical-thermal tradeoffs.<br\/>The PI plans to develop the necessary CAD framework to enable multi-scale electrothermal modeling and simulation capabilities for ultra-scaled non-classical CMOS devices. The research involves a unique approach that combines a small-scale sub-continuum electrothermal simulation methodology involving the electron-phonon Boltzmann Transport Equations (BTE) with a macro-scale heat-diffusion based methodology. The small-scale simulations are necessary to account for the non-locality of phonon transport near the high electric field (drain) region of the transistor and involve self-consistent solutions of the electron-BTE and the phonon-BTE to generate accurate heat flux and thermal profile along the channel of the device. Next, by coupling together the results of these simulations with the ones from classical heat-diffusion approach (for other areas of the transistors) the PI will develop accurate physical as well as compact models for various electrothermal quantities including thermal resistance, thermal capacitance and thermal time constant as a function of device materials, process and bias conditions, and device geometry. These compact models will then be used to carry out fast steady-state and transient electrothermal simulations using SPICE and thereby analyze and optimize various transistor architectures. Most importantly, since performance and power dissipation are critically dependent on the thermal profile, the electrothermal CAD framework will be used to design thermally-aware circuits so that maximum benefit can be derived from them and various electrical-thermal tradeoffs can be carried out. Additionally, the PI will study implications for ESD protection circuitsunderstand electrothermal behavior under high-current conditions and optimize device design for improving ESD reliability. The overall program also ties research to education at all levels (K-12, undergraduate, graduate, continuing-ed) partly via participation in programs designed by education professionals. As an affiliated faculty of the California NanoSystems Institute (CNSI), the PI plans to participate in various outreach activities sponsored by the CNSI as well as those offered by the Materials Research Lab (MRL) and the Nanotech (NNIN) at UCSB including the student and teacher research training internship programs. Additionally, the project provides a substantial focus on recruitment and retention of underrepresen","title":"A CAD Framework for Multiscale Electrothermal Modeling and Simulation of Non-Classical CMOS Devices","awardID":"0541465","effectiveDate":"2006-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["508555"],"PO":["562984"]},"119909":{"abstract":"The bulk of computing today, measured by CPUs, operations, or dollars, is embedded and deals with processing of real-world or ?media? data. Today, most compute-intensive embedded media processing is performed by hard-wired, fixed-function chips (application-specific integrated circuits or ASICs), not by programmable processors. Cell phone modems, WiFi, WiMax, and UWB modems, video codecs, digital television de-interlacers and scalers, for example, are all implemented as hard-wired fixed-function blocks. Designers choose ASICs to implement these functions today for efficiency. The power efficiency (Ops\/W) and the area efficiency (Ops\/mm2 ) of an ASIC is one to two orders of magnitude more efficient than the most efficient programmable processors available today. However, developing such ASICs is expensive and time consuming. The lack of an efficient, programmable, embedded processor inhibits the development of many embedded applications and slows the evolution of others. <br\/><br\/>This project plans to develop a an efficient, programmable, embedded processor that equals or exceeds the efficiency (Ops\/W or Ops\/mm2) of a conventional ASIC and is one to two orders of magnitude more efficient than conventional programmable processors. If successful, our research will also reduce the development cost and improve the efficiency of ASICs. To achieve this goal, the project will first identify the major sources of inefficiency in conventional architectures and then systematically develop new microarchitecture techniques to improve efficiency. Particular attention will be given to instruction sequencing and data movement which account for much of the inefficiency of conventional processors. Novel instruction sequencing schemes that capture critical loops in a small number of instruction registers and efficient data storage organizations based on distributed and indexable register files will be investigated. The project will also investigate compilation methods to target these novel architecture elements. <br\/><br\/>The development of an efficient, programmable architecture will open the door to rapid development, evaluation, and deployment of a wide variety of embedded applications with performance levels not previously possible. Research on algorithms for modems, data compression, beamforming, image understanding, and sensor networks, for example will be transformed by the availability of a programmable platform orders of magnitude more efficient than conventional processors. The availablility of this architecture will also make highly-efficient embedded systems available for niche applications (e.g, scientific instrumentation) that could not previously justify the high non-recurring costs of ASICs.","title":"CSA -- SGER: Efficient, Programmable, Embedded Computing","awardID":"0630543","effectiveDate":"2006-06-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["400637"],"PO":["325495"]},"110604":{"abstract":"ABSTRACT<br\/>0541319<br\/>Saman P. Amarasinghe<br\/>MIT<br\/><br\/>Collaborative Research: Programmable Microfluidics: A Universal Substrate for Biological Computing<br\/><br\/>As fundamental technological limits are beginning to limit the progress of traditional silicon-based computers, biology offers exciting possibilities for building the next generation of computers using the molecular machinery of life to perform computations. While scientists have demonstrated that DNA and cellular processes can be leveraged to perform computations, all experiments to date have been done by hand at a laboratory bench. For biological computing to come into the mainstream, there needs to be a standalone device that can automatically execute the biological protocols and provide a traditional interface to computer programmers and end users.<br\/><br\/>In this research, an inter-disciplinary team from the Massachusetts Institute of Technology and Harvard University will collaborate to produce the first programmable chip that can support biological computing. The chip will rely on microfluidics: a technology for manipulating picoliter-quantities of fluids throughout the stages of a biological protocol. In addition to advancing the state-of-the-art in automated fluid transport and manipulation, this \"lab-on-a-chip\" system will include a new programming language and software system to allow everyday programmers to easily utilize the device. As a demonstration, the microfluidic chip will be applied in a novel study on the response of mammalian cells to complex input signals.<br\/><br\/>Beyond biological computing, a self-contained lab-on-a-chip system can have many ground-breaking applications such as multi-purpose home diagnostic machines and fast drug discovery using automated protocols. The Primary Investigators in this research are Prof. Saman Amarasinghe (MIT Department of Electrical Engineering and Computer Science), Prof. Todd Thorsen (MIT Department of Mechanical Engineering), and Prof. Jeremy Gunawardena (Department of Systems Biology, Harvard University).","title":"Collaborative Research: Programmable Microfluidics: A Universal Substrate for Biological Computing","awardID":"0541319","effectiveDate":"2006-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["382922","554714"],"PO":["562984"]},"120306":{"abstract":"Proposal 0632428<br\/>\"Proposal for Student Poster Program and Travel Scholarships 23rd International Conference on Machine Learning (ICML 2006)\"<br\/>PI: Rich A. Caruana<br\/>Cornell University<br\/><br\/>This award provides funds to help subsidize travel and registration costs for selected students to attend and participate in the 23rd International Conference on Machine Learning (ICML 2006) to be held June 25-29, 2006 at Carnegie Mellon University, Pittsburgh, Pennsylvania. Students will be selected through an application process. Selected students will present results on their research projects in poster sessions that are integrated in the conference program. These sessions are designed to provide the students with feedback from senior researchers from the international machine learning community. Students will also have the opportunity to attend tutorials, especially on material not taught to them at their home institutions, and to hear invited talks and presentations on state-of-the-art research on machine learning. These activities will provide students with invaluable exposure to outside perspectives on their work at a critical time in their research and will contribute to the professional development of young scientists in the important field of machine learning.","title":"Proposal for Student Poster Program and Travel Scholarships 23rd International Conference on Machine Learning (ICML 2006)","awardID":"0632428","effectiveDate":"2006-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["342321"],"PO":["387198"]},"116918":{"abstract":"Abstract:<br\/><br\/>This project develops energy management techniques for large-scale,<br\/>multi-tier data-centers, using formal optimization methods that do not<br\/>compromise performance requirements. High-performance Internet<br\/>services are often functionally decomposed into a pipeline of<br\/>multiple, semi-independent tiers spanning multiple machines. These in<br\/>turn might consist of a heterogeneous mix of system generations, due<br\/>to phased upgrades. Power delivery and cooling costs constitute a<br\/>significant part of total cost of ownership.<br\/><br\/>The expected workload of such a system is aperiodic, with highly<br\/>varying execution demand and possibly significant I\/O activity. This<br\/>represents an opportunity for major energy savings, but only if<br\/>performance guarantees can be maintained. Scalability also requires<br\/>that local power management decisions must yield globally optimal<br\/>energy consumption. Although effective power management policies have<br\/>been devised for simpler architectures, no straightforward extensions<br\/>exist to make them applicable to multi-tier clusters while preserving<br\/>response-time guarantees.<br\/><br\/>Results will be disseminated at leading conferences and the software<br\/>will also be publicly available on the Internet for use by the<br\/>research community in further research, or by the industry as a basis<br\/>for possible product development. Moreover, from a global societal<br\/>perspective, successful energy management helps save natural<br\/>resources, while reduced service-provider costs foster economic growth<br\/>and IT innovation. Finally, this research will help train graduate<br\/>and undergraduate students.","title":"Collaborative Research: CSR--AES: Energy Management in Real-time, Multi-tier Internet Services","awardID":"0615301","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553633"],"PO":["493916"]},"116919":{"abstract":"Abstract<br\/><br\/>This project is developing the scientific and engineering foundations to enable automated support of user-centered activities where a computing infrastructure, which is largely transparent to the user, is used to enhance a users ability to carry out every-day tasks. Focusing on non-computer centric environments such as home environments, the project builds on the notion of task-driven computing to design, implement, and evaluate a general platform on which many activity-based applications can be easily built and integrated. Specifically, it is creating new principles, algorithms, and design frameworks to enable flexible integration, adaptation and configuration of emerging pervasive computing devices and services; new techniques for ensuring the robustness of heterogeneous, dynamically-changing configurations of pervasive services in unpredictable environments; and new ways to think about and implement systems in which computing augments and complements ordinary human activities, rather than requiring humans to map their needs into computer-centric applications.<br\/><br\/>This research has the potential for three significant broad impacts. (1) It will extend the reach of integrated computer support for activities that critically affect non-computer users in environments where computing support has not been broadly accessible (such as in the home); (2) It will help decrease the gap between what ordinary users need from computing systems to improve their daily lives, and what is now provided by current computer-centric technology; (3) It will reduce the complexity of deploying and using emerging pervasive computing technology, while at the same time improving its predictability and robustness.","title":"Activity-Oriented Pervasive Computing","awardID":"0615305","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["485947","463128"],"PO":["493916"]},"119390":{"abstract":"The construction of reliable software poses one of the most significant scientific and<br\/>engineering challenges of the 21st century. Professor Tony Hoare has proposed the<br\/>creation of a program verifier as a grand challenge for computer science. He has<br\/>outlined an international program of research combining many disciplines such as<br\/>the theory and implementation of programming languages, formal methods, program<br\/>analysis, and automated theorem proving. In order to take on Hoares grand<br\/>challenge, an IFIP Working Conference was held over five days during Fall 2005<br\/>in Zurich, Switzerland. The focus of the conference was on identifying practical<br\/>steps toward the realization of a successful program verifier. Topics discussed at<br\/>the working conference included advances in program specification, verification and<br\/>refinement tools and techniques, program analysis, tool integration, metrics, milestones,<br\/>and benchmark suites. Following the working conference, panels were formed to draw up a detailed road map for research in the area of verified software.<br\/>This award, supported by the NITRD High Confidence Software and Systems interagency coordinating group, enables a series of mini-workshops to expedite the activities of these panels in drafting a comprehensive road map.","title":"Mini Workshop on Verified Software","awardID":"0627284","effectiveDate":"2006-06-15","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"T366","name":"NSA-SOFTWARE VERIFICATION & HI"}}],"PIcoPI":["555363"],"PO":["561889"]},"109480":{"abstract":"This small planning grant will examine, through simulation modeling, the optimum parameters (and relationships among those parameters) in the area of \"context aware computing\" for disaster responses. In particular, the following parameters would be examined:<br\/><br\/>computing context,<br\/>time and disaster lifecycle, and<br\/>location contexts. <br\/><br\/>Research in this area could improve the timeliness and effectiveness of field-based triage in a disaster, minimizing the resultant number and severity of injuries as well as the number of deaths.","title":"Context Aware Applications for Disaster Response (CAADR)","awardID":"0534726","effectiveDate":"2006-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["543613",289841,"504299",289843],"PO":["371077"]},"119492":{"abstract":"The need to have a repository to store traces of file system data was deemed exceptionally important by the community. This proposal is an important community need for researcher in operating systems, storage systems, and distributed systems and will augment the industry efforts from the research community who can manage and maintain the repository.","title":"CSR PDOS\/SGER: File System Trace Repository","awardID":"0627856","effectiveDate":"2006-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["543573"],"PO":["402055"]},"116492":{"abstract":"The Workshop on Computing Clusters and Computational Grids for Scientific Computing that we propose aims to address this unprecedented situation by providing a forum for creative dialogue between leading edge researchers in the field in order to produce the kind of coordinated and penetrating analysis that can help translate momentous developments into momentous benefits for the scientific community.","title":"Computing Clusters and Computational Grids for Scientific Computing","awardID":"0613003","effectiveDate":"2006-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["558550"],"PO":["551712"]},"119155":{"abstract":"Title: Collaborative Research: Hierarchical Models of Time-Varying Natural Images<br\/><br\/>PIs: Bruno Olshausen and David Warland<br\/><br\/>The long-term goal of this research is to develop a computational model of visual perception that achieves the same degree of robust intelligence exhibited in biological vision systems. The proposed research will advance the state of the art in the analysis of time-varying images by building models that capture the robust <br\/>intelligence of the mammalian visual system. These models will allow the invariant structure (form, shape) to be modeled independently of its variations (position, size, rotation) and will be composed of multiple layers that capture progressively more complex forms of scene structure in addition to modeling its transformations. Mathematically, these multi-layer models have a powerful bilinear form and their detailed structure is learned from natural time-varying images using the principles of sparse and efficient coding.<br\/><br\/>The early measurements and models of natural image structure have had a profound impact on a wide variety of disciplines including visual neuroscience (e.g. predictions of receptive field properties of retinal ganglion cells and cortical simple cells in visual cortex) and image processing (e.g. wavelets, multi-scale representations, image denoising). The approach taken by this project extends this interdisciplinary work by learning higher-order scene structure from sequences of natural time-varying images. Given the evolutionary pressures on the visual cortex to process time-varying images efficiently, it is plausible that the computations performed by the cortex can be understood in part from the constraints imposed by efficient representation. Modeling the higher order structure will also advance the development of practical image processing algorithms by finding good representations of the scene for the image-processing task at hand. Completion of the specific goals of this project will provide new generative models of time-varying image formation and tools with which to analyze the statistics of natural scenes.<br\/><br\/>Most image processing problems are greatly simplified by finding a good representation of the data. As a result, this research has practical applications for deriving improved means for representing, indexing, and accessing digital content such as 2D images, and video. the models developed as part of this project are also broadly applicable to advancing image processing algorithms such as denoising of movies, movie compression, and scene analysis and classification. In addition, these models have a mathematical form that makes them generally applicable to research areas other than vision such as analysis of auditory signals, dynamic routing of network signals, and general data mining of complex data sets.","title":"SGER Collaborative Research: Hierarchical Models of Time-Varying Natural Images","awardID":"0625717","effectiveDate":"2006-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["483816"],"PO":["317663"]},"119078":{"abstract":"Title: Collaborative Research: Hierarchical Models of Time-Varying Natural Images<br\/><br\/>PIs: Bruno Olshausen and David Warland<br\/><br\/>The long-term goal of this research is to develop a computational model of visual perception that achieves the same degree of robust intelligence exhibited in biological vision systems. The proposed research will advance the state of the art in the analysis of time-varying images by building models that capture the robust intelligence of the mammalian visual system. These models will allow the invariant structure (form, shape) to be modeled independently of its variations (position, size, rotation) and will be composed of multiple layers that capture progressively more complex forms of scene structure in addition to modeling its transformations. Mathematically, these multi-layer models have a powerful bilinear form and their detailed structure is learned from natural time-varying images using the principles of sparse and efficient coding.<br\/><br\/>The early measurements and models of natural image structure have had a profound impact on a wide variety of disciplines including visual neuroscience (e.g. predictions of receptive field properties of retinal ganglion cells and cortical simple cells in visual cortex) and image processing (e.g. wavelets, multi-scale representations, image denoising). The approach taken by this project extends this interdisciplinary work by learning higher-order scene structure from sequences of natural time-varying images. Given the evolutionary pressures on the visual cortex to process time-varying images efficiently, it is plausible that the computations performed by the cortex can be understood in part from the constraints imposed by efficient representation. Modeling the higher order structure will also advance the development of practical image processing algorithms by finding good representations of the scene for the image-processing task at hand. Completion of the specific goals of this project will provide new generative models of time-varying image formation and tools with which to analyze the statistics of natural scenes.<br\/><br\/>Most image processing problems are greatly simplified by finding a good representation of the data. As a result, this research has practical applications for deriving improved means for representing, indexing, and accessing digital content such as 2D images, and video. the models developed as part of this project are also broadly applicable to advancing image processing algorithms such as denoising of movies, movie compression, and scene analysis and classification. In addition, these models have a mathematical form that makes them generally applicable to research areas other than vision such as analysis of auditory signals, dynamic routing of network signals, and general data mining of complex data sets.","title":"SGER Collaborative Research: Hierarchical Models of Time-Varying Natural Images","awardID":"0625223","effectiveDate":"2006-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["333910"],"PO":["317663"]},"114392":{"abstract":"ABSTRACT<br\/>0603630<br\/>Gunawardena, Jeremy<br\/>Harvard University<br\/><br\/>Collaborative Research: Programmable Microfluidics: A Universal Substrate for Biological Computing<br\/><br\/>As fundamental technological limits are beginning to limit the progress of traditional silicon-based computers, biology offers exciting possibilities for building the next generation of computers using the molecular machinery of life to perform computations. While scientists have demonstrated that DNA and cellular processes can be leveraged to perform computations, all experiments to date have been done by hand at a laboratory bench. For biological computing to come into the mainstream, there needs to be a standalone device that can automatically execute the biological protocols and provide a traditional interface to computer programmers and end users.<br\/><br\/>In this research, an inter-disciplinary team from the Massachusetts Institute of Technology and Harvard University will collaborate to produce the first programmable chip that can support biological computing. The chip will rely on microfluidics: a technology for manipulating picoliter-quantities of fluids throughout the stages of a biological protocol. In addition to advancing the state-of-the-art in automated fluid transport and manipulation, this \"lab-on-a-chip\" system will include a new programming language and software system to allow everyday programmers to easily utilize the device. As a demonstration, the microfluidic chip will be applied in a novel study on the response of mammalian cells to complex input signals.<br\/><br\/>Beyond biological computing, a self-contained lab-on-a-chip system can have many ground-breaking applications such as multi-purpose home diagnostic machines and fast drug discovery using automated protocols. The Primary Investigators in this research are Prof. Saman Amarasinghe (MIT Department of Electrical Engineering and Computer Science), Prof. Todd Thorsen (MIT Department of Mechanical Engineering), and Prof. Jeremy Gunawardena (Department of Systems Biology, Harvard University).","title":"Programmable Microfluidics: A Universal Substrate for Biological Computing","awardID":"0603630","effectiveDate":"2006-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["433685"],"PO":["562984"]},"119673":{"abstract":"Proposal 0628941<br\/>\"SGER: Comparison and Explanation in Learning and Development\"<br\/>PI: Kenneth D. Forbus<br\/>Northwestern University<br\/><br\/><br\/>ABSTRACT<br\/><br\/>This project will investigate the roles of comparison and explanation in conceptual change, in both children and adults. Comparison seems to play a major role in human learning: People compare multiple situations to help construct models, compare models with data to see how well they explain it, and compare models to each other to determine what data might distinguish between them. A key problem is deciding when to accept, revise, or abandon a model, based on the successes and failures of its explanations. This problem will be investigated by a combination of theoretical work, computer simulation, and psychological experimentation. The computer simulation will focus on how comparison processes are used in the construction, challenging, and testing of causal models, and on how learners should abandon, revise, or continue with its current models as a consequence. The phenomena modeled will be drawn both from the developmental literature (e.g., learning what kinds of things can float, and what quantities remain constant under physical transformations (i.e., conservation phenomena)) and from new studies of adults learning causal models. By adding to the science base needed to create software systems that can learn more like people do, this project will have Broader Impacts through improvement of intelligent tutoring systems, learning environments, and decision-support systems, and in general on the way intelligent systems are built.","title":"SGER: Comparison and Explanation in Learning and Development","awardID":"0628941","effectiveDate":"2006-06-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["463605",317434],"PO":["387198"]},"119652":{"abstract":"Map-matching and routing algorithms are essential technical components for Traffic Estimation and Prediction Systems (TREPS). GPS tracking data is used to assess traffic condition, however noise and errors require sophisticated map-matching algorithms to identify corresponding routes in the road network. Current map-matching algorithms are too slow and inaccurate for real-time tracking, and are not quality-tested. Current routing algorithms are based on databases which store static travel-time weights per road segment, although continuous and rapid changes in traffic conditions demand the incorporation of dynamically changing weights. This project (i) follows unconventional approaches for the design of faster and more accurate map-matching algorithms, including novel ideas to evaluate their quality, and (ii) initiates research of reactive routing algorithms that adapt their solution to a dynamically changing weight database, including research of supportive novel database techniques.<br\/><br\/>This research involves localizing high-quality global map-matching algorithms in a provably correct manner, and introduces quality evaluation based on artificial GPS data. Research into reactive routing algorithms will be initiated, which requires novel data warehousing techniques for the joint management of historic and current spatiotemporal data. This research will greatly enhance the knowledge base for TREPS and for both database and algorithms research communities. The area of personal routing and navigation solutions is quickly on the rise since every mobile phone can potentially be turned into a navigational aid. Results of this project have a high potential for utilization in this booming area and in areas such as traffic assessment and prediction, tasks that are performed by traffic management authorities such as municipalities and ministries. This research involves an exploratory international collaboration between Greece and the US.<br\/><br\/>This grant is jointly funded by OISE, Europe and Eurasia, and CCF\/TF Cluster.","title":"SGER: Map-Matching and Reactive Routing Algorithms for Traffic Estimation and Prediction Systems","awardID":"0628809","effectiveDate":"2006-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["558984"],"PO":["321058"]},"119894":{"abstract":"This is funding to support this year's student design competition (SDC), which will be part of the 2006 annual RESNA conference to be held June 22-26 in Atlanta, Georgia. RESNA is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. Comprised of over 1,000 individual and 200 institutional members - researchers, manufacturers, clinicians, suppliers, professionals and end-users of technology devices and equipment - the organization has as its purpose to improve the health and participation of people with disabilities in mainstream society. To this end, RESNA supports those individuals engaged in research, development, education, advocacy and the provision of technology through a number of programs and activities, which in addition to the annual conference include a credentialing program for assistive technology practitioners, suppliers and rehabilitation engineering technologists, as well as sponsored projects. RESNA serves as the ANSI-designated national body for development of voluntary standards for products used by persons with disabilities. The first Student Design Competition (SDC) was held in 1980 as part of the inaugural RESNA conference. Since then, a total of over 120 designs have been identified as winning entries, chosen from more than 500 submissions by students from over 100 different universities. SDC entries must represent the work of STUDENTS ONLY, including the documentation of the design, but both undergraduate and graduate students are eligible to submit entries. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Partial support for past SDC has been provided by nationally recognized disability organizations such as Easter Seals and Paralyzed Veterans of America, as well as by a subsidiary of the Johnson & Johnson Company. NSF funding will enable this year's competition to be significantly expanded and enhanced, to include more entries and support for more design teams, including those from minorities, women, and individuals with disabilities. A call for participation will be posted on the conference website, and also sent out to major colleges and universities with engineering and design schools, including Historically Black Colleges and Universities. A team of 5 judges will pre-select entries with the final selections made at the RESNA Conference. Fifteen teams will be invited to attend the conference with 5 teams ultimately selected as the final winners. A half-day session will be held in which the 15 teams will make presentations before the judges and public audience at the conference. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. Judges will make final decisions based on criteria using numeric scoring. After the judging contest, students will have an opportunity to exhibit and talk about their projects at the Exhibit Hall opening. More information is available online at http:\/\/www.resna.org\/Conference\/Conference.php. <br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a unique forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. In its new and expanded format thanks to NSF support for the second year now, the SDC is even better positioned to foster innovation and creativity, with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. Unique in its primary focus on undergraduates, the event will provide participants with experience and skills that assist them to be successful in their engineering and design careers, and will further encourage, support and mentor students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields.","title":"Student Design Competition","awardID":"0630495","effectiveDate":"2006-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["559082"],"PO":["565227"]},"109521":{"abstract":"This proposal explores the use of recommender systems technology for guiding<br\/>individuals to parts of a large collection as a tool to help library users and librarians alike. The<br\/>proposed research is built upon research showing that recommenders can be effective for helping<br\/>researchers with the specific task of finding additional citations germane to an existing document.<br\/>Applications will be studied in the context of three key sets of research questions about the design<br\/>of new library services: (1) Questions about article metadata the valuable information about authors,<br\/>citations, venues, and other related information and how metadata can be mined to better guide library<br\/>users. (2) Questions about recommender algorithms for a diverse set of information needs, with particular<br\/>interest in algorithms that cross metadata types (e.g., finding people from citations or finding citations<br\/>from taxonomy data) and on the design of a modular toolkit of algorithms that can be used by librarians<br\/>and other power users to synthesize new recommendation types. (3) Questions about the user interfaces<br\/>needed to make such tools accessible to and effective for a variety of different users, from students to<br\/>experienced librarians. In the end, the research will make novel contributions to the field of digital<br\/>libraries and the research areas of recommender systems and human-computer interaction.","title":"Enhanced Digital Libraries Through Recommendation: Exploring the Use of Citations, Personal Bibliographies, and Metadata to Synthesize Library Services for Individuals","awardID":"0534939","effectiveDate":"2006-06-15","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["483488","550380","438120"],"PO":["563751"]},"119642":{"abstract":"The purpose of this grant is to provide support for US-based graduate student travel to Pisa, Italy to attend ACM SIGCOMM 2006 conference. The SIGCOMM conference on Communications, Protocols, and Applications is the premier technical meeting that examines the state-of-the-art in computer networks and communications. It features a large percentage of high-quality papers that have tremendous impact on the field of computer networking. This grant offers support to graduate students since they constitute one of the important segments of the research community and they often have limited resources of funds to travel to conferences, especially when they are not paper authors. With the support of this grant, the travel award program of SIGCOMM 2006 conference will be able to extend its support to a much larger number of students, providing an opportunity for a broader student body to interact with world-class scientists in their fields. Considering the potential of motivating students to do high-quality research through the SIGCOMM 2006 conference participation, this travel support has strong impact on educating the next generation researchers in computer networks and communications.","title":"Student Travel Support for ACM SIGCOMM 2006 Conference","awardID":"0628754","effectiveDate":"2006-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["520246"],"PO":["565090"]},"119774":{"abstract":"The purpose of this grant is to provide support for United States-based graduate student travel to the Forth ACM SenSys conference. The ACM SenSys conference is an emerging one covering all aspects of wireless sensor networking, with participants from the USA, Europe, and Asia. This grant offers support to graduate students since they are an important part of the research community and they often have limited resources of funds to travel to conferences. It intends to help increase the representation and participation of US-based graduate students in ACM SenSys. This conference travel support insures that deserving graduate students will be able to participate in the conference, thereby nurturing the next generation of researchers.","title":"Travel Grant for Students to Attend SenSys Conference in Boulder, Colorado","awardID":"0629659","effectiveDate":"2006-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[317717],"PO":["565090"]},"111381":{"abstract":"As the microprocessor industry moves toward multicore solutions (several processor cores on a single chip), performance growth on these inherently power-constrained platforms will increasingly rely upon their ability to support thread-level parallelism efficiently. The goal of the research project in this CAREER proposal is to develop the necessary insights for the successful design of mechanisms that can address the unique power-performance opportunities and challenges of running parallel applications on multicore chip architectures. We explore power-aware control of parallelism in such architectures by combining information about the application's parallel behavior, the operating constraints, and the chip's support for voltage\/frequency scaling and other mechanisms for power management. Integral to this CAREER proposal is a broad educational plan with specific goals at several education levels. We also provide concrete initiatives to promote engineering among high-school girls and underrepresented minorities, and to mentor them throughout their college years.","title":"CAREER: Power-Performance Considerations of Thread-level Parallelism in On-chip Multicore Architectures","awardID":"0545995","effectiveDate":"2006-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["499395"],"PO":["366560"]},"116771":{"abstract":"Abstract<br\/>Due to the ever increasing system complexity, reliability modeling and analysis are becoming increasingly essential components in the design and tuning of fault-tolerant hierarchical computer systems. Tremendous research efforts have been expended in this area, but two practical issues, modular imperfect coverage (MIPC) resulted from imperfect recovery mechanisms and common-cause failures (CCF) arising from a shared root cause, have generally been missed or not been fully considered in existing computer system reliability models. Failure to model either of them accurately results in over\/understated system reliability, which makes reliability analysis less effective in the design and tuning of computer systems. The primary goals of this project are to develop novel reliability models for fully describing MIPC and CCF, and to explore efficient model evaluation methods leading to more accurate analysis of hierarchical computer system reliability. This project involves three phases: model development, model evaluation, and the development of a reliability analysis software tool that applies the concepts and methods developed through this research. The new models and evaluation methods developed through this work are fundamental contributions to the body of knowledge on the computer system reliability. Research results from this project will support the design of reliable computer systems subject to MIPC and CCF. The PI will disseminate information and knowledge to the academic community and the industry through seminars, classroom materials, conference\/journal publications, and an Internet website for the project.","title":"CSR --- SMA: Reliability Modeling and Evaluation of Fault-Tolerant Hierarchical Computer Systems","awardID":"0614652","effectiveDate":"2006-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["484154"],"PO":["551712"]},"112460":{"abstract":"The University of Louisiana at Lafayette will acquire equipment needed for CMOS-MEMS fabrication and characterization; the equipment includes a stereoscopic microscope with camera, a profilometer, a lock-in amplifier, a low distortion function generator, an oscilloscope, a spectrum analyzer, and a logic analyzer. The VLSI research group at the University's Center for Advanced Computer Studies will conduct research on Systems-on-a-chip (SOC) viewed as integrated heterogeneous technologies where the technologies range over mixed signal CMOS, CMOS-MEMS and optical devices such asVCSELs etc. on a single die or package. Applications of fabricated devices include sensors and robotics. The infrastructure will be used in research, research training and education at the University. The investigators will partner with existing programs, including McNair Scholars and the Louis Stokes Louisiana Alliance for Minority Participation to increase the participation of under-represented students in related degree programs.","title":"CRI: MEMS Integration Infrastructure","awardID":"0551478","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["479398","476050","344948",297642],"PO":["565272"]},"112482":{"abstract":"This project, enabling infrastructure to capture speech, motion, expressions, and gaze, supports research in collaboration and Human Computer Interaction (HCI). Current interests in Computer Supported Cooperative Work (CSCW) include understanding how people collaborate across multiple tasks with multiple partners, designing systems that interrupt users intelligently, supporting gestures and other types of nonverbal behavior in remote collaborations, and creating tools that can interpret meetings and other social behavior. The work contributes to the observation and analysis of fine details of human behavior, uses data for understanding human collaboration, especially the mechanics of face-to-face interaction in co-located and remote CSCW. A focus of fine details of human behavior, including facial expressions, body positions, gestures, and movements, is common to these projects, motivated by the belief that in depth analysis of behavior is necessary to move CSWC research and development into the future. CSWS is necessary for understanding the mechanics of face-to-face interaction, for identifying those aspects of face-to-face interaction that are most important to provide remote collaboration, and for programming intelligent collaborative systems. The infrastructure for a multimedia laboratory for research on computer-mediated collaborative behavior consists of the following four elements:<br\/><br\/>-Motion capture system, Mobile eye-tracking,<br\/>-Multichannel video and audio recording.<br\/><br\/>The components, used independently or in combination, contribute to investigate a wide range of topics in human behavior. Examples include: large-scale collaboration in medical setting, interruptibility, tools for remote gestural communication, and multiple task performance. The enabled research should lead to an improved understanding of fundamental dimensions of interpersonal interaction, including the dynamics of group behavior, interruptibility and awareness, and interrelationships among gaze, gesture, speech, and actions. HCI, computer supported cooperative work, communication theory, social psychology, and organizational behavior might benefit from this work.<br\/><br\/>Broader Impact: The general public is expected to benefit by the creation of new tools to enhance collaboration in fields such as medicine and security. Additionally, the infrastructure contributes in the training of students and enhancing education in pertinent areas.","title":"CRI: Multimedia Laboratory for Research on Computer-Mediated Collaborative Behavior","awardID":"0551554","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["550147","519226","560995","519226","564316"],"PO":["564456"]},"116860":{"abstract":"The CoGenT project aims to make it much easier to sketch new<br\/> architectural ideas at the instruction set architecture and<br\/> micro-architecture (\"block diagram\") levels. We have designed languages<br\/> for expressing instruction set semantics and encoding (CISL, the CoGenT<br\/> Instruction Set Language), and for describing micro-architecture<br\/> components, connections, and timing (CASL, the CoGenT Architecture<br\/> Specification Language). CoGenT is now completing the language<br\/> processors and run-time environments so that we can generate, from CISL<br\/> and CASL machine descriptions, functional and timing simulators, and<br\/> competent (but not automatically innovative) compilers. Among other<br\/> things we are solving the problem of generating provably correct code<br\/> generators and register allocators automatically, for the compiler side,<br\/> and generating similarly correct simulators automatically on the<br\/> simulator side. (Of course correctness is relative to correctness of the<br\/> CISL and CASL descriptions.) CoGenT also aims to provide a capable<br\/> simulator environment and tools for setting up and running simulation<br\/> experiments. Our hope is to revolutionize architecture design<br\/> exploration and simulation, with research, industrial, and teaching<br\/> impact. We are focusing on getting the maximum functionality implemented<br\/> under this award.","title":"CSR-SMA: CoGenT: Co-Generating Tools for Modeling Next Generation Systems","awardID":"0615074","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550864","517880"],"PO":["493916"]},"111294":{"abstract":"ABSTRACT<br\/>0545514<br\/>Samuel Burer<br\/>University of Iowa<br\/><br\/>This project focuses on computation, theory, and applications in the field of optimization, a scientific discipline that plays an important role in the applied sciences, having a broad impact in numerous diverse<br\/>areas of society, including defense, business, and health care. An important goal of the project is to communicate the relevance of optimization, and more generally, computer science and information<br\/>technology, to students of all ages and backgrounds, as well as the society at large.<br\/><br\/>The research plan includes the study of:<br\/> (i) nonconvex quadratic programs, which, though very difficult to solve, encompass many problems arising, for example, in production and logistics, facility layout, circuit design, image partitioning,<br\/> frequency assignment in networks, protein structure identification, and combinatorial optimization;<br\/> (ii) linear programs over convex cones, which are one of the main tools to solve nonconvex quadratic programs, while being applicable to many situations in their own right (for example, in stock analysis,<br\/> inventory theory, control theory, matrix analysis, truss topology design, and quantum chemistry).<br\/>Because applications in these areas typically give rise to large-scale optimization problems that challenge today's algorithms and methodologies, this project develops new approaches (e.g., through<br\/>advanced computational techniques and algorithmic development) for solving problems either exactly or approximately and applies them to specific applications.<br\/><br\/>Educational activities of the project include:<br\/> (i) outreach efforts to strengthen K-12 education, engage the community, and encourage the participation of underrepresented groups in computer science and information technology; (ii) course development activities that provide modern, high-quality instruction in optimization and related disciplines for undergraduate, graduate, and professional students. Efforts are appropriately targeted to the experience and background of the intended audience and are aligned with the goals of larger university, state, and federal institutions.","title":"CAREER: Computation, Theory, and Applications for Nonconvex Quadratic and Conic Optimization","awardID":"0545514","effectiveDate":"2006-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[294786],"PO":["564924"]},"115551":{"abstract":"Oregon State University and the H.J. Andrews Experimental Forest will host a 10 week NIBIB-NSF Bioengineering and Bioinformatics Summer Institutes (BBSI) Program in EcoInformatics under the direction of Dr. Desiree D. Tullos. This Institute will support a total of 60 undergraduate and graduate students, 15 per year, for a total of four years.<br\/><br\/>EcoInformatics is the integrated application of mathematical sciences, computer science and engineering to the study ahd management of ecoystems. The objective of this Summer Institute in EcoInformatics is to provide early undergraduate and early-stage graduate students majoring in the biological sciences, computer sciences, engineering, mathematical sciences, and physcial sciences with carefully planned interdisciplinary ecosystem informatics research and education experiences in order to increase the number of individual pursuing ecoysystem informatics at the graduate level and beyond. Building on the interdisciplinary Long-Term Ecological Research (LTER) program at the H.J. Andrews Forest and its information management program this Summer Institute will 1) train and promote discovery in young scientists who will make basic contributions to ecosystem science, computer science, and mathematics through team -based research and education: 2) promote the pursuit and success of a diverse group of students seeking higher education and research experience in EcoInformatics; and 3) provide graduates to work in interdisciplinary settings on natural resources management and policy.<br\/><br\/>The Summer Institute will target the recruitment of underserved student populations of Native Americans, Hispanics, and women, and will provide career development activities illustrating career options in academia, agencies, and the private sector. Through this integrated research and education, effective mentoring, and hands-on experience, participants will gain the foundation and opportunities to develop and seek support for their own graduate program, including a peer reviewed research proposal, as well as the training to become outstanding interdisciplinary scientists and effective contributors to EcoInformatics science.<br\/><br\/>This project is being co-funded by the Directorate for Biological Sciences (BIO)\/ Division of Biological Infrastructure (DBI)\/Biological Databases and Informatics (BDI) Program ; the National Institutes of Health (NIH)\/National Institute of Biomedical Imaging and Bioengineering (NIBIB), and the Directorate for Computer and Information Science and Engineering (CISE)\/Division of Information and Intelligent Systems (IIS).","title":"Summer Institute in EcoInformatics","awardID":"0609356","effectiveDate":"2006-06-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"H185","name":"National Institute of Biomedic"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"T343","name":"NIH-BIOENG & BIOINF SUMMER RES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"T816","name":"NH-BIO SUMMER RESEARCH&TRAININ"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["538112","554550","488778","380583","538113"],"PO":["560483"]},"120172":{"abstract":"Abstract<br\/><br\/>Proposal: CNS 0631673<br\/>PI: Bernat, Andrew<br\/>Institution: Computing Research Association<br\/>Title: CISE ANNUAL WORKSHOP FOR PRINCIPAL INVESTIGATORS OF MINORITY INSTITUTIONS INFRASTRUCTURE AND RESEARCH INFRASTRUCTURE AWARDS 2006<br\/><br\/> <br\/>The Computing Research Association will provide logistical and travel support for the annual CISE Computing Research Infrastructure (CRI) programs principal investigators workshop. This will be complemented by the work of one of the PIs who is arranging the program of presentations. The PI meeting brings together awardees of the CRI program and predecessor programs: CISE Research Infrastructure and CISE Minority Institutions Infrastructure. The meeting promotes collaboration among diverse institutions, shares information about research, infrastructure, institutional support, and other topics that promote stronger experimental research in CISE fields. The meeting is also an opportunity for the investigators to discuss their changing needs with the NSF.","title":"CRI: CISE Annual Workshop For Principal Investigators of Minority Institutions Infrastructure and Research Infrastructure Awards 2006","awardID":"0631673","effectiveDate":"2006-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["209556"],"PO":["361119"]},"116861":{"abstract":"Abstract:<br\/><br\/>This collaborative project studies dynamical systems characterized by a combination of hybrid and probabilistic behavior. Hybrid behavior is characterized by discrete switching between system modes and continuous evolution within a mode. Such systems frequently arise in a wide range of applications, from power electronics and communication networks to economics and biology. In this research, a new modeling framework for such systems is developed, which supports external variables, compositional reasoning, and nondeterministic as well as probabilistic transitions. New stability criteria for such probabilistic hybrid systems are obtained. In contrast with existing results, they are formulated in terms of two independent components: a family of Lyapunov functions (one for each continuous mode) and a slow-switching condition of an average-dwell-time type. This modularity has the benefit of decoupling the search for Lyapunov functions from the verification of the desired properties of the discrete dynamics. The latter task is the focus of the project, and is treated using two complementary methods: one based on proving an invariant property, and another based on solving an optimization problem. These theoretical results are supported by development of new software tools.","title":"CSR--EHS: Collaborative Research: ASPIRE: Antipodal Staged Processing In Role-adaptive Embedded-systems","awardID":"0615075","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[309222,"526997","558563"],"PO":["561889"]},"125122":{"abstract":"This proposal focuses the neural systems involved in emotions and biases and their role in human decision-making. Neural systems that subserve human biases and emotions have evolved for survival purposes. The automatic biases and emotions triggered by a given situation help the normal decision-making process by narrowing down the options for action, either by discarding those that are dangerous or endorsing those that are advantageous. Biases and emotions serve an adaptive role speeding up the decision-making process. However, there are circumstances in which a naturally occurring bias or emotional response must be inhibited, so that a deliberate and potentially wiser decision can be made. Although recent research in neuroscience and psychology has highlighted the positive roles played by biases and emotions in decision-making, there are many instances where there is a negative side to biases and emotions in decision-making. Depending on the circumstances, biases, moods, and emotions can play useful as well as disruptive roles in the process of making advantageous decisions. Thus it is not a simple issue of trusting biases and emotions as the necessary arbiter of good and bad decisions. It is a matter of discovering the circumstances in which biases and emotions can be useful or disruptive, and using the reasoned coupling of circumstances and biases and emotions as a guide to human behavior. <br\/> <br\/>This project will: <br\/> (1) Explore some of the circumstances in which biases and emotions influence decisions one way or another, and examine whether there are some personality and\/or cognitive characteristics that render an individual more or less susceptible to a specific form of bias. <br\/>(2) Examine the functional organization of the CEO of the brain, the prefrontal cortex, and understand how this structure manages complex information, assign values to information, and ultimately execute decisions. <br\/>(3) Test a model of human intelligence that is based on how the CEO of the brain is functionally organized. The idea is that one individual will assume the function of one group of cells or sub-region of the prefrontal cortex, instead of the whole region. A group of individuals, with each one processing a separate stream of information in parallel, will then merge together, thus simulating the function of the prefrontal cortex of a human brain.","title":"Brain Process Model of Intelligence","awardID":"0702050","effectiveDate":"2006-06-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V577","name":"CIA-ANTENNE ARRAY PROCESSING"}}],"PIcoPI":[332021],"PO":["564318"]},"116224":{"abstract":"The purpose of this travel grant is to seek funds to help increase representation and participation of US-based graduate students in the IEEE SECON 2006 meeting. Since its first endeavor in the year 2002, this IEEE Communications Society sponsored annual conference on sensor and ad hoc communications and networks has established itself as one of the premier conferences serving the rapidly growing research community. This grant offers travel support to graduate students who might otherwise be unable to attend SECON 2006. It provides a chance for the students to be exposed to the state-of-the-art in their research, and to interact with leading researchers and fellow students from other institutions. The participation of deserving students in technical conferences such as SECON has the potential to shape the future of the research in ad hoc and sensor networks.","title":"IEEE SECON Conference 2006: Student Travel Awards","awardID":"0611898","effectiveDate":"2006-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["534041"],"PO":["565090"]},"110592":{"abstract":"Proposal Number: CCF-0541245 <br\/>PI : Edmund M. Clarke<br\/>Carnegie Mellon University<br\/><br\/>Title: The Component Substitution Problem for Software Systems<br\/><br\/>Component technologies are gaining acceptance in the software systems engineering community as effective tools for quickly assembling complex software systems. Verification during initial deployment and, more importantly, after each \"component substitution\" is crucial. <br\/><br\/>Component-based software systems naturally allow scope for applying compositional formal verification techniques, e.g., assume-guarantee reasoning (AGR). The prime bottleneck in applying AGR to industrial systems is the difficulty of manually generating these assumptions. The research will focus on developing a new model checking-based framework that allows designers to replace components on-demand and locally re-verify the correctness of the new assembly. This framework will automatically generate assumptions for AGR and efficiently reuse the verification results from the previous assembly. AGR techniques will be developed to handle components interacting via general modes of communication like message-passing and shared memory. Industrial benchmarks will be used to evaluate our research accomplishments. By <br\/>exploiting the compositionality of the proposed method, the verification techniques will be able to scale to larger component-based designs. <br\/><br\/>Broader impacts of our research include improvement in dependability of component-based software via efficient verification methods and dissemination of research results in academic courses and publications and publicly available tools.","title":"The Component Substitution Problem for Software Systems","awardID":"0541245","effectiveDate":"2006-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["553671"],"PO":["564388"]},"116950":{"abstract":"Proposal Title: Balanced Overlay Network (BON): Decentralized Load Balancing And Resource Discovery via Self-Organized Random Networks<br\/><br\/>PI: Vwani Roychowdhury<br\/>Institution: UCLA<br\/><br\/>Abstract:<br\/>The convergence of advanced P2P systems and grid computing is creating the possibility of decentralized enterprise-grade computing platforms. However, a key missing technology concerns the development of tools for distributed resource discovery, and balanced utilizations of such heterogeneous sets of resources, especially in the limit of very large-scale systems, where centralized approaches will prove to be inadequate. In this proposal we introduce a novel network-based dynamic resource discovery and utilization paradigm, Balanced Overlay Networks (BON), which can (i) Provide almost-optimal balanced utilization of resources, (ii) Scale to support networks with millions of nodes, (iii) Provide resource-offering nodes\/agents the flexibility to dynamically vary and set the amount of shareable free resources, (iv) Evolve and form its structure based on local and self-organization rules, and without any central coordination and monitoring, (v) Provide protection against any disruption of the networks due to large-scale failures of participating nodes or attacks, and (vi) be readily incorporated into existing grid computing and web server platforms, such as the Condor project and the Apache web servers. BON utilizes a completely new approach, where the level of free resources of every resource server is encoded as its degree in a P2P overlay network. Nodes with high levels of free resources are found by performing short random walks on this overlay network. The network maintenance protocols guarantee that the underlying structure corresponds to that of random graphs, and short random walks will be sufficient to find servers that have the most resources to offer at any time.","title":"Balanced Overlay Network (BON): Decentralized Load Balancing And Resource Discovery via Self-Organized Random Networks","awardID":"0615458","effectiveDate":"2006-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["455118"],"PO":["551712"]},"117643":{"abstract":"ABSTRACT<br\/><br\/>Proposal Number: CTS-0618921<br\/>Principal Investigator: Hrenya, Christine, M.<br\/>Affiliation: Gordon Research Conferences<br\/><br\/>This proposal requests partial travel support for US Academics attending the Gordon Research Conference on Granular and Granular Fluid Flow to be held in Oxford, UK, July 23 -28, 2006.<br\/><br\/>Intellectual Merit<br\/><br\/>The purpose of this conference is to bring together experts from all over the world to exchange experiences, disseminate up-to-date information and to explore new opportunities in the field. The Gordon Conferences provide a unique forum for the exchange of fresh ideas in an atmosphere of unhampered discussion among participants in disciplines that do not normally intersect.<br\/><br\/>Broader Impact<br\/><br\/>The participation of young US students and faculty in this International Conference will provide an opportunity to interact with international experts and become familiar with the current state of the art of this field. The organizers plan to actively encourage under-represented minorities, women, and junior faculty to actively participate with a special presentation by an invited young scholar each day as well as poster sessions.","title":"2006 \"Granular and Granular-Fluid Flow\" Gordon Conference","awardID":"0618921","effectiveDate":"2006-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}}],"PIcoPI":["525273"],"PO":["426130"]},"116433":{"abstract":"Recent years have witnessed significant improvements in automatic<br\/>machine translation systems. An enabling factor for this short<br\/>turnaround time is the adoption of automatic evaluation metrics, which<br\/>serve to guide developers to improve translation systems. However,<br\/>current metrics are a coarse approximation of human judgments for<br\/>system outputs. This SGER project is exploring ways of improving<br\/>current metrics. It does so on three fronts. First, judgments of<br\/>syntactic similarities between system outputs and human references are<br\/>being incorporated into the metric in addition to phrasal<br\/>similarities. Second, machine learning techniques are being applied<br\/>to find characteristics that are correlated to human judgments of<br\/>quality. Third, the project is determining more fine-grained analyses<br\/>of what is wrong as well as what is right with system outputs based on<br\/>syntactic as well as lexical characteristics of the system outputs.<br\/>In developing a learnable, syntax-aware metric, discriminative methods<br\/>will be generalized for complex, structured problems. A more<br\/>informative automatic evaluation metric will lead to more rapid<br\/>improvements in machine translation technology, enabling access to<br\/>archives from centuries past and documents from around the world. All<br\/>relevant software and non-proprietary data will be distributed widely.<br\/>Written reports of experimental results and findings will be<br\/>disseminated through academic publications.","title":"SGER: Learning Syntax-based Evaluation Metrics for Machine Translation","awardID":"0612791","effectiveDate":"2006-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["357107"],"PO":["565215"]},"109405":{"abstract":"This is a project to advance synthetic character technology as a novel platform for assessing adolescents' decision making and social competency skills. Virtual vignettes will present the adolescent with full-body animated, conversant characters with whom the adolescent interacts via natural language and who exhibit emotional, gestural, cognitive, and social intelligence. Because inputs and responses to the synthetic characters are natural, the vignettes assess adolescents' situation-specific behavior rather than test their understanding of how they think they should behave.<br\/><br\/>This research builds on a recently completed study that provided preliminary evidence that virtual vignettes can yield performance measures with construct and criterion validity. It will investigate how to improve the fidelity of the synthetic characters in developing more appropriate language, gesture, cognitive, and social models to drive their behavior. These activities will require novel approaches to linguistic, emotional, gestural, cognitive, and social modeling. In-depth experimental analyses (usability and accessibility studies, acceptance, and performance measuring) will compare adolescents who exhibit conduct disorder with matched normal adolescents using the application, focusing on how the different groups attend differently to virtual stimuli, to determine what causes differences in behavior such as acquiescing in risky behavior. The research will also explore how well the technology might extend towards assessment of behavior of different participant groups. <br\/><br\/>This research addresses the need to empower a traditionally underserved group with new combinations of computer interfaces, including virtual reality, natural language, and emotive synthetic characters. The work will advance the knowledge and understanding of both synthetic character technology and the needs of at-risk children, and particularly how researchers should go about developing collaborative, adaptive systems that address adolescents' needs. Ultimately, tools based on synthetic character technology could assess poor social skills and offer educational experiences within the classroom, clinical settings, and juvenile correctional institutions. In the long term, the techniques may be adapted as early interventional measures for younger children who may have cognitive dysfunctions but who have not yet developed inappropriate behaviors.","title":"Collaborative Systems Involving Synthetic Characters and High-risk Adolescents","awardID":"0534211","effectiveDate":"2006-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[289631],"PO":["564456"]},"109559":{"abstract":"This research will develop a general framework for mathematical analysis of collective behavior of adaptive multi-agent systems. Adaptation is an essential requirement for autonomous multi-agent systems functioning in uncertain dynamic environments, for example, distributed robot teams, modules in an embedded system, nodes in a sensor network, or software agents. Adaptation allows agents to change their behavior in response to changes in the environment or actions of other agents. Mathematical analysis of adaptive systems will enable researchers to design more robust systems, and to predict, control and understand their behavior. <br\/><br\/>The research will study agents that make decisions autonomously based on local information, which comes either from interactions with other agents or from the local environment. In particular, this project will examine different classes of adaptive behavior, such as adaptation through reinforcement and adaptation through communication via spatially extended fields. Reinforcement learning is a powerful framework where an agent learns optimal actions through a trial and error exploration of the environment and by receiving rewards for good actions. Collective adaptation can also take place in systems in which agents are coupled through external fields, for example, through markers they deposit in the environment. <br\/><br\/>Although adaptation and learning have long been the focus of the artificial intelligence community, there is relatively little work examining how a group of adaptive agents will act. The difficulty arises from the fact that agents adapt in the presence of other adaptive agents. Often it is not a priori clear how the system will act or even if adaptation will achieve the desired goals. In addition, the designer has very little guidance about what individual agent characteristics are required to guarantee the desired collective behavior. The lack of a formal understanding of these problems has prevented researchers from taking full advantage of this powerful design paradigm. The mathematical analysis to be performed in this research will help answer these questions. <br\/><br\/>There is a critical need for better foundations and tools for analyzing multi-agent behavior and verifying control mechanisms for multi-agent systems. The lack of such tools stands in the way of wider deployment of such systems, especially robots and embedded systems. Experiments and simulations that are necessary to validate control algorithms are time consuming and costly. Quantitative understanding provided by the mathematical models to be developed in this project will lead to more robust and efficient control algorithms and greater deployment of such systems in the field.","title":"Formal Framework for Analysis of Adaptation in Multi-Agent Systems (ADAPT2)","awardID":"0535182","effectiveDate":"2006-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["517887"],"PO":["564456"]},"120097":{"abstract":"ABSTRACT<br\/>0631266<br\/>Betty H. Cheng<br\/>Michigan State University<br\/><br\/>Travel Grant for Attending Doctoral Symposium for RE06<br\/><br\/>This proposal is a request for $10,000 to support travel and accommodation costs for U.S. students selected to attend the 2006 International Requirements Engineering Conference on (RE 06) Doctoral Symposium to be held in September 2006 in Minneapolis, Minnesota. We propose to provide up to $1000 of funding each for approximately 10 eligible students who are selected for support based on their needs.<br\/>The Doctoral Symposium at RE06 provides a venue for young researchers to access world-wide expertise in requirements engineering. The Symposium is a one-day closed event held as part of RE06 that provides a forum for Ph.D. students to publicly discuss their research goals, methods, and results at an early stage in their research.","title":"Travel Grant for Attending Doctoral Symposium for RE06","awardID":"0631266","effectiveDate":"2006-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["543568"],"PO":["564388"]},"115521":{"abstract":"Oakland University will host a ten week NIBIB-NSF Bioengineering and Bioinformatics Summer Institutes (BBSI) Program in Bioengineering and Health Informatics under the direction of Dr. Fatma Mili. This Institute will support a total of 60 undergraduate and graduate students, 15 per year for a total of four years. <br\/><br\/>The primary object of this Institute is to promote graduate studies and careers in bioengineering and bioinformatics to bright and talent students pursuing degrees in Computer, Natural, Health Sciences, and other related majors with a focus on enhancing career opportunities for African American and other minority students in the fields of bioengineering and health informatics. The students will be immersed in a comprehensive learning and research environment and will receive a two-week focused training session followed by eight weeks of full time research. Research will be conducted within a multidisciplinary team and encompasses the full life-cycle from defining the research problem, exploring multiple solutions, discussing progress with peers and wider audiences, and formulating findings and making conclusions. <br\/><br\/>This project is being co-funded by the Directorate for Mathematical and Physical Sciences (MPS)\/Division of Mathematical Sciences (DMS), the MPS\/Office of Multidisciplinary Activities (OMA), the Directorate for Computer and Information Science and Engineering (CISE)\/Division of Information and Intelligent Systems (IIS), and the National Institutes of Health (NIH)\/National Institute of Biomedical Imaging and Bioengineering (NIBIB).","title":"BBSI: Summer Institute in Bioengineering and Health Informatics","awardID":"0609152","effectiveDate":"2006-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1335","name":"IGERT FULL PROPOSALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1758","name":"BIOENGINEERING & BIOINFORMATIC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"H185","name":"National Institute of Biomedic"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"I226","name":"National Institute of Biomedic"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"T343","name":"NIH-BIOENG & BIOINF SUMMER RES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"T816","name":"NH-BIO SUMMER RESEARCH&TRAININ"}}],"PIcoPI":["481137",305902,305903,"322011","467200",305906,"339882"],"PO":["560483"]},"116885":{"abstract":"Parallel and distributed computing systems, consisting of a heterogeneous set of machines, software, and networks, frequently operate in environments where their performance degrades due to circumstances that change unpredictably, such as sudden machine failures or inaccuracies in the estimation of system parameters. An important question then arises: what extent of departure from the assumed circumstances will cause the performance to degrade to the point where the system cannot meet the specified requirements i.e., how robust is the system? The focus of this work is the design of methodologies for generating robustness metrics and using them in resource management. <br\/><br\/>A resource allocation is defined to be robust if degradation in system performance remains within specified limits when certain perturbations in specified system parameters occur. Furthermore, a resource allocations degree of robustness must be mathematically quantified e.g., how many machines can fail, how inaccurate can estimates in system parameters be before a performance requirement violation occurs? Specifically, this research addresses the design of:<br\/><br\/> mathematically precise and widely applicable techniques for modeling and quantifying the robustness of a resource allocation against multiple perturbations in system components and environmental conditions.<br\/><br\/> resource allocation algorithms that continually plan and develop strategies for responding to potential faults, resource degradation, and other changes in system environment. <br\/><br\/>This work represents a partnership between university and industry\/government laboratories that are committed to developing high availability computing systems for industry and defense applications. Its results will be widely disseminated through presentations, publications, interdisciplinary workshops, and technology transfer.","title":"Robust Parallel and Distributed Computing Systems","awardID":"0615170","effectiveDate":"2006-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["542086","542088"],"PO":["493916"]}}