{"102389":{"abstract":"This is funding to support attendance by approximately 40 participants from the United States in the 2005 IEEE International Conference on Robotics and Automation (ICRA'05), which will be held in Barcelona, Spain, on April 18-22, 2005. This annual IEEE event, sponsored by the IEEE Robotics and Automation Society, has become the largest annual conference in robotics and automation worldwide, and serves as the premier forum for gathering international researchers together for the exchange of ideas on technical problems and their solutions, and on emerging technologies. NSF funds will help ensure a high U.S. presence at ICRA'05, by providing partial airfare reimbursement to selected U.S. researchers who have had papers accepted but who due to financial hardship would otherwise be unable to attend the conference to present their work. <br\/><br\/>Broader Impacts: The PI has established a 4-member Selection Committee to choose the beneficiaries from the NSF funds. The committee will pay special attention to enabling participation by student (co)authors and by members of traditionally under-represented groups and institutions. This funding will expose participants to the latest research results while also enabling them to build and\/or enhance their social network of peers and mentors within the research community, which will in the future benefit them and the country as a whole.","title":"Group Travel Grant to 2005 IEEE International Conference on Robotics and Automation","awardID":"0455312","effectiveDate":"2004-12-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["558935"],"PO":["565227"]},"94918":{"abstract":"The objective of this project is to build a general purpose database of commonsense facts about actions expressed in the language of the Causal Calculator (CCalc). CCalc is a system for automated reasoning about actions and for plan generation. Its language has been used to formalize many small action domains, such as the blocks world and the Missionaries and Cannibals puzzle, and also several medium-size domains, such as Sandewall's Zoo World. Building a general purpose database of knowledge about actions will be a step towards solving the problem of generality in knowledge representation.<br\/><br\/>Building on past efforts, this project will isolate the concepts and principles that these and similar individual domains have in common, and build a database of such principles stated in a general form. The creation of such a data base will make it possible to obtain formalizations of many individual action domains, including those studied in the past, by adding domain-specific facts. The database will include general assumptions about the effects, both direct and indirect, of actions of various kinds, about the executability of actions, and about agents that execute them. Some of these facts have to do with objects and change in their locations and internal states. For instance, one useful assumption is that normally an agent can execute an action affecting the location or state of an object only if the agent is located next to the object. Another is that an object is typically supported by something--by horizontal surfaces of some kind, or by other objects supported by such a surface--and that moving the object indirectly affects the locations of the things that are supported by that object. The database will also contain commonsense facts about creating and destroying objects, about animals and humans, about buying and selling, about actions related to knowledge and memory, etc.","title":"General Purpose Database of Knowledge about Actions","awardID":"0412907","effectiveDate":"2004-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["337516"],"PO":["387198"]},"103626":{"abstract":"Three-dimensional visualizations that make extensive use of state-of-the-art computer graphic techniques and a variety of representations of data in space are prevalent in diverse fields such as medicine, product design, manufacturing, weather predictions, simulations, and engineering. However, little is known about the cognitive processes involved in the comprehension of these visualizations. Now that 3D visualizations are also being used to aid in Web exploration, document search, and education, it is essential to target a wider range of users with very different cognitive skills. In this exploratory project, the PI will study spatial ability and its relationship to comprehension of current scientific and information visualizations, under the assumption that we can improve human performance by finding out what visualization features are best understood by a wide range of users and how these relate to different user spatial abilities, and then setting up explicit training programs to improve these spatial abilities. In particular, women tend to score lower in most spatial ability tests than men. The PI will run a series of experiments in an effort to better understand this phenomenon, and to determine how it may affect women's comprehension of various visualizations. The PI expects to improve on prior work in the field, where studies often were insufficiently controlled for multiple competing factors that may affect the tasks and lacked standardized tests of spatial abilities.<br\/><br\/>Broader Impacts: This research will offer a new perspective in the understanding of 3D visualization, and will provide useful information for designers about what kinds of tools demand more developed spatial skills from users. The results will indicate ways to design system interfaces whose data representation are independent of users' spatial abilities, and to improve existing visualization tools in current systems where the spatial abilities requirements are high, thereby promoting participation by groups with lower spatial skills, and reducing the learning curve for new users.","title":"SGER: Measuring the Influence of Spatial Ability in Data Visualization Comprehension","awardID":"0503680","effectiveDate":"2004-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["524497","360930"],"PO":["565227"]},"102528":{"abstract":"0456070 <br\/>Khokhar<br\/><br\/>Description: This award supports the Second International Workshop on Research and Development in Information Technology to be held in Islamabad, Pakistan, in December 2004. The organizers are Dr. Ashfaq Khokhar, Department of Electrical Engineering and Computer Science at the University of Illinois at Chicago, Dr. Arif Ghafoor, Professor, School of Electrical and Computer Engineering, Purdue University, West Lafayette, Indiana and Dr. S.M. Junaid Zaidi, Rector of the COMSATS (Commission on Science and Technology for Sustainable Development in the South) Institute of Information Technology in Islamabad, Pakistan. The purpose of the workshop is to exchange information between the US and Pakistani sides on advances in information technology and to discuss R&D needs that may be met through cooperative research projects. The key areas chosen for this workshop include: information and network security, communication and networking technology, IT-based applications, and embedded systems and pervasive computing. Several parallel sessions will be organized to make use of the expertise of expatriate and other US-based leading researchers. The workshop will include plenary sessions to introduce cutting edge research in each of the four identified areas, and two panel sessions to discuss future research trends in IT. The workshop will provide a platform for fostering research collaborations among the researchers from US and Pakistan and initiate research and development projects related to key IT research areas. <br\/><br\/>Scope: This project supports US scientists to participate in the second US-Pakistan workshop to discuss an area of great importance to both countries, and to identify potential collaborative research where the two sides can complement each other's capabilities. Drs. Khokhar and Ghafoor are experienced researchers with strong records of NSF-funded projects. They are also familiar with the science scene in Pakistan. Dr. Zaidi is also an experienced scientist who leads a major specialized institute for IT in Pakistan and who will have the backing of that country's Ministry of Science and Technology. The project will increase collaboration in science and technology with Pakistan in an area of great importance to both countries. This project is being supported by the Office of International Science and Engineering and the Division of Computer Network Systems.","title":"US-Pakistan 2nd International Workshop on Research and Development in Information Technology","awardID":"0456070","effectiveDate":"2004-12-15","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["438744","532978"],"PO":["540599"]},"98181":{"abstract":"Proposal Number: 0430338<br\/><br\/>Title: Collaborative Research: Using Generative Models to Evaluate and Strengthen Biometrically Enhanced Systems<br\/><br\/>PI: Fabian Monrose<br\/><br\/>Abstract:<br\/><br\/>This research investigates a new form of attack which poses a potential threat to biometrically-enhanced security mechanisms. Such attacks are \"generative\" in nature: the attacker works from a model for mimicking an aspect of human behavior and, through direct or indirect knowledge of the targeted user's biometrics, adapts the model to generate attempted reproductions of the user's input. In this context, two types of security mechanisms are studied: biometric authentication, where the user's biometric features are measured by a nonbypassable reference monitor and compared to a stored template; and password hardening, where the user's password and biometric features measured during the entry of the password are combined into a secret key (the \"hardened\" password) that should be irreproducible even to an attacker with full access to the device and software which create the key. Generative models for handwriting serve as an enabling input to evaluate schemes for performing handwritten password verification and for creating hardened passwords from handwriting. The size of the attacker's search space is quantified assuming that various categories of information have been gleaned (or captured) from the targeted user, as well as employing demographic statistics. Speech synthesis for targeting a specific user's voice is also studied in these same contexts. To the extent possible, techniques are identified for improving password hardening to withstand such attacks.","title":"Collaborative Research: Using Generative Models to Evaluate and Strengthen Biometrically Enhanced Systems","awardID":"0430338","effectiveDate":"2004-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["565326"],"PO":["521752"]},"98260":{"abstract":"Title: \"Models and Methods for Robust and Conic Optimization\"<br\/><br\/>Abstract:<br\/>Uncertainty is an inevitable feature of many decision making <br\/>environments. On a regular basis, engineers, economists, investment<br\/>professionals, and others need to make decisions to optimize a system<br\/>with incomplete information and considerable uncertainty. <br\/>Understanding, quantifying, and managing uncertainty is critical<br\/>to the success and effectiveness of their decisions. <br\/>Robust optimization refers to the modeling of optimization problems<br\/>with data uncertainty with the objective of <br\/>obtaining a solution that is guaranteed to <br\/>perform well under all possible realizations of the uncertain parameters.<br\/><br\/>This project will introduce novel approaches<br\/>for the characterization of robustness in uncertain systems<br\/>and develop efficient and reliable optimization algorithms for <br\/>identification of robust solutions. <br\/>In particular, the project will focus on (i) developing methods to <br\/>identify solutions that are ``relative robust'', i.e., solutions that <br\/>are good in each scenario, where the quality of the<br\/>solution is measured relative to the best solution of <br\/>each scenario; (ii) developing new models and methods for<br\/>``adjustable robust optimization'', i.e., for problems with <br\/>uncertainty where a subset of the decision variables can be<br\/>adjusted after some of the uncertain variables are<br\/>observed. <br\/><br\/>In many cases, robust optimization formulations are expressed<br\/>as the problem of optimizing a linear function over a set defined <br\/>by linear equalities and cone membership constraints, a so-called<br\/>conic optimization problem. Implementation efforts will <br\/>include the development of structure-exploiting algorithms <br\/>for the solution of large-scale conic optimization problems. <br\/>In particular, problems with fixed variables, cone intersection <br\/>constraints, and quadratic objectives will be studied. <br\/>The resulting algorithms will be carefully implemented and <br\/>the software will be freely distributed. <br\/><br\/>Robust and conic optimization formulations are used to model <br\/>a wide array of applications in many diverse fields. <br\/>For example, robust optimization problems arise when some <br\/>of the input parameters of a given optimization problem <br\/>are unknown or uncertain, which is <br\/>common in finance, economics, and engineering models. <br\/>Conic optimization problems are encountered in truss design, <br\/>control and system theory, statistics, eigenvalue optimization, <br\/>antenna array weight design, and mathematical finance.<br\/>Given their wide applicability, the progress achieved through this<br\/>project in solving these problem classes more efficiently<br\/>and effectively, will benefit activities in many of the<br\/>disciplines listed above. In addition, the project work<br\/>will be integrated into the PI's ongoing teaching, training,<br\/>and outreach activities through <br\/>(i) the CMU Summer Institute, (ii) the teaching of a <br\/>project-based course that benefits local industries and organizations, <br\/>(iii) \"NEC: Give a Day, Make a Difference\" program.","title":"Models and Methods for Robust and Conic Optimization","awardID":"0430868","effectiveDate":"2004-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":[258749],"PO":["564924"]},"98062":{"abstract":"Intellectual Merit: <br\/><br\/>The project builds on a recently completed NSF project, in which the PI developed a prototype of a dynamically adaptive compilation system. This system has demonstrated significant gains in overall program performance in science and engineering applications.<br\/>There is tremendous potential in moving compiler optimization decisions to runtime, where complete information is available. For example, knowing the input to a code section would allow the compiler to directly produce this code's output, delivering the program response instantly. The new concepts and implementations will (i) enable a new generation of applications that improve as they age and adapt to changes unforeseen by their developers, (ii) provide solutions to key open issues in the design of current compilers, such as where and when to apply what optimization techniques, (iii) address new problems arising in tomorrow's increasingly dynamic, mobile, and unreliable execution environments.<br\/><br\/>Broader Impact: <br\/><br\/>While the narrow view of the project goals is to develop advanced compiler techniques for high<br\/>performance computer applications, the successful completion of the proposed work will have a broader impact. These techniques will be distributed to publicly available compiler infrastructures using the Polaris and Cetus compilers. The PI has been distributing the Polaris compiler to other researchers for many years, and it is one of the most advanced and widely known HPC compiler research infrastructures.<br\/>These infrastructures have been used in courses among Students using the newest compiler technology. Using this basis, we will make a concerted effort to combine the proposed research with educational activities at the undergraduate and graduate level. Furthermore, the proposed effort addresses what is Believed to be the most severe limitation of the current generation of compilers, which is the compilers' conservative assumptions, due to the lack of runtime knowledge. Dynamically adaptive techniques have the potential to increase the power of compiler optimizations very significantly and hence contribute to improved programmability of high-performance computing applications in general.<br\/>Finally, while our goal is to advance those application areas where performance is the most critical value -high-performance computing applications -our techniques are generic in nature and will thus benefit all classes of software.","title":"Compiler and Runtime Support for Dynamically Adaptive Computation","awardID":"0429535","effectiveDate":"2004-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":["558595","550995"],"PO":["565272"]},"97283":{"abstract":"CNS-0424539<br\/>MII Planning Proposal: Center for perceptual robotics at the City College of New York.<br\/><br\/>This project is planning for the establishment of the Perceptual Robotics Center at the City College of New York. The aims are to make CCNY a center of excellence in cutting-edge research and a national urban model for minority education in the fields of robotics and computer vision. The planning tasks include: 1) fostering collaborative research in perceptual robotics among faculty members; 2) introducing new courses and outreach activities to attract and retain minority undergraduates and to prepare them for graduate education; 3) studying methods to enhance faculty involvement in mentoring activities; 4) developing an evaluation plan with research achievement metrics and educational effectiveness metrics; and 5) organizing an advisory committee. The project includes cooperation with the NYC-LSAMP (Louis Stokes Alliance for Minority Participation) program and New York Academy of Sciences Summer Research Training Program (SRTP). In particular, the center will serve as a research-training site for high school interns in the SRTP program and will provide mentored research experiences to LSAMP scholars. The planning project supports visits to leading research institutions as well as institutions with successful MII implementation models. Other planning activities include the launch of a robotics and computer vision lecture series at CCNY, the reform of senior capstone design courses, the initiation of a student robotics club, and the participation of students in international robotics design competitions.","title":"MII Planning Proposal: Center for Perceptual Robotics at the City College of New York","awardID":"0424539","effectiveDate":"2004-12-01","expirationDate":"2005-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7399","name":"CISE MINOR INST INFRA (MII) PR"}}],"PIcoPI":[255925,"553167","554596","554596"],"PO":["297837"]},"98097":{"abstract":"The PI proposes a novel approach for software pipelining multi-dimensional loops, called SSP<br\/>(Single-dimensional Software Pipelining). SSP provides a unique framework where software pipelining can<br\/>be applied at any desirable loop level. <br\/><br\/>Intellectual Merit. <br\/>This research builds on the established collaboration and combined expertise of the<br\/>PIs in software pipelining, register allocation, compiler optimization, architecture design, and experimental<br\/>evaluation. The foreseen contribution to the society is a novel compiler framework for achieving the available<br\/>parallelism in loop nests as well as for providing opportunities for exploring other objectives in compilation.<br\/>The main contributions of this research will be the following:<br\/>* Development of the initial SSP methodology into a comprehensive framework for optimizing multi-<br\/>dimensional loops able to effectively handle general forms of loop nests.<br\/>* Development of register allocation techniques for multidimensional loops that are integrated with SSP.<br\/>* Implementation and experimental evaluation of SSP, the register allocator, and modified loop trans-<br\/>formation phases with experimental evaluation of such properties as performance, code size, and<br\/>compilation time.<br\/>* Investigation of SSP and its relation to and interaction with high-level loop transformations, as well as<br\/>comparison with approaches that combine loop nest transformation and traditional software pipelining.<br\/><br\/>Broader Impact.<br\/>*The developed framework provides opportunities for exploring other optimization<br\/>objectives and implementation issues, targeted to specific architectures <br\/>* Basis for exploring SSP for architectures such as multithreading cellular architectures, and streaming applications.<br\/>* The PIs plan to organize an annual combined CIS and ECE undergraduate poster forum which will include the participating undergraduates and contain a strong mentoring component.<br\/>*Small experimental study components of this research will be developed to be used as research projects in<br\/>graduate compiler courses in both CIS and ECE. <br\/>*Since a robust, open source infrastructure is being used in trhis work, the resulting compiler with our techniques is highly available and easily disseminated to large groups.","title":"COMPILERS: A Novel Approach for Software Pipelining of Multi-Dimensional Loops","awardID":"0429781","effectiveDate":"2004-12-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":["527984","475422"],"PO":["565272"]},"98110":{"abstract":"A key component of their performance is automatic memory management (garbage collection) which frees programmers from explicit memory management, easing the programming burden and eliminating a source of many errors.The growing need for high performance collectors has sparked a resurgence in garbage collection research.<br\/>Garbage collection provides a number of software engineering benefits such as preventing two<br\/>common programmer errors which are among the most difficult to diagnose and fix: (1) prematurely <br\/>freeing memory that the program later references, and (2) systematically never freeing which can cause<br\/>memory consumption to grow without bound.<br\/><br\/>Intellectual Merit<br\/>This project will explore (1) dynamic optimizations and policy tuning applicable to a variety of collectors;<br\/>(2) new basic mechanisms for attaining locality and flexible heap organizations, and (3) adaptive algorithms<br\/>to match applications to policies.<br\/><br\/>Broader Impact. The research impact from this project will be high performance garbage collectors that play to the strengths of modern architectures and that adapt to the phases of modern applications. High performance will in turn enable higher productivity programming, i.e., programmers will be able to solve new, more difficult, and larger problems. The publicly available research artifacts, MMTk and architecture simulators, will add to the national research infrastructure for exploring memory management algorithms and performance, and the influences on total application performance for modern languages. The educational impact will include training graduate and undergraduate students in this key language system component. Outreach to under-represented groups will include summer research experiences for undergraduate women.","title":"COMPILERS: Next Generation Garbage Collection","awardID":"0429859","effectiveDate":"2004-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["519591"],"PO":["565272"]},"97781":{"abstract":"Project Abstract<br\/><br\/>This study is directed towards developing flexible, general-purpose Visual Search systems capable of Searching for objects in real, cluttered environments. The research will include extensive psychophysical and physiological experiments on humans and primates that will prototype artificial systems that mimic this behavior. The goals of the study can be conveniently divided into four Aims:<br\/>Aim 1: Develop and prototype a revolutionary camera gaze control device dubbed Remote High-Speed Active Visual Environment, or RHAVEN. RHAVEN will allow telepresent control of the gaze of a remote camera using eye movements as rapidly and naturally as if viewing the scene directly.<br\/>Aim 2: Develop optimal statistical bounds on Visual Search, by casting it as a Bayesian problem, yielding a maximum a posteriori (MAP) solutions for firstly, finding a target in a visual scene using a smallest number of fixations, and secondly, for next-fixation selection given a current fixation.<br\/>Aim 3: Construct models for Visual Search based on Natural Scene Statistics at the point of gaze. Visually important image structures can be inferred by analyzing the statistics of natural scenes sampled by eye movements and fixations.<br\/>Aim 4: Conduct neurophysiological studies on awake, behaving primates during Visual Search tasks. Measure and analyze search performance in awake, behaving monkeys, while measuring the responses of neural populations in the brain's frontal eye fields (FEF) which help control saccadic eye movements.<br\/>Broader Impact: The results of this research should significantly impact numerous National Priorities: Searching Large Visual Databases, Robotic Navigation, Security Imaging, Biomedical Search, Visual Neuroscience, and many others. It is easy to envision scenarios that would benefit by a fundamental theory of Visual Search. For example: searching for suspect faces in airport security systems; examining internet streams for questionable material; semi-automatic search for lesions in mammograms; steering robotic vehicles around obstacles in hostile environs; navigating huge visual data libraries, etc.","title":"ITR: Foundations of Visual Search","awardID":"0427372","effectiveDate":"2004-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7314","name":"ITR FOR NATIONAL PRIORITIES"}}],"PIcoPI":["483563","485855","409994",257337],"PO":["564316"]},"99431":{"abstract":"ABSTRACT<br\/>0438929<br\/>Mary Shaw, Ashish Arora, Shawn Butler<br\/>CMU<br\/><br\/>Early Predictive Design Evaluation for Software<br\/><br\/>This research seeks to establish a scientific basis for analyzing designs of software-intensive systems when the code implementing the designs is unavailable. This is the situation early in system design, when decisions that profoundly affect the implementation must be made; these decisions are much easier and cheaper to change during early design than after implementation has yielded running code. By substantially improving the ability of software designers to predict properties of an implementation without actually inspecting the code, this work enables designers to understand better the consequences of early design decisions and facilitates comparison of design alternatives to a degree not currently possible.<br\/>The common thread of the analysis techniques developed through this research is prediction of properties an implementation, to determine the value of the design to a client with a particular set of preferences. The techniques draw on models from economics to account for the uncertainties associated with prediction and future user needs. Predictive analysis techniques for two specific tasks are being developed: dynamic reconfiguration of mobile device application suites to satisfy changing user needs and defect profile prediction for future releases of multi-release systems. Further, the research explores a unified framework for predictive evaluations of this type","title":"SoD: Early Predictive Design Evaluation for Software","awardID":"0438929","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":[262258,"381263","504468"],"PO":["564388"]},"98199":{"abstract":"Nonlinear programming (the minimization of a smooth nonlinear function subject to smooth<br\/>(possibly) nonlinear constraints) is a touchstone problem in optimization. The problem continues<br\/>to excite strong interest among optimization researchers for many reasons, among them new<br\/>developments in algorithms and software (especially of the interior-point variety), the study of<br\/>mathematical programs with equilibrium constraints (MPEC), and the discovery of new application<br\/>areas.<br\/>The broad scope of the nonlinear programming paradigm admits a great many pathologies in<br\/>the geometric nature of the problem and in its algebraic speci.cation. It is impossible to design<br\/>algorithms that converge reliably in all circumstances. Local convergence theory for most algorithms<br\/>depends on regularity and strict complementarity assumptions, and problems for which<br\/>these assumptions are not satis.ed (degenerate problems) are the cause of undesirable and awkward<br\/>behavior in most algorithms and codes.<br\/>This project will investigate some approaches to nonlinear programming, related to approaches<br\/>currently in use, that have the potential for improved performance on degenerate and large-scale<br\/>problems. These techniques will be theoretically rigorous and practical, in that the marginal<br\/>computational cost of handling degeneracy will not be too great and in that they will behave well<br\/>even when implemented in .oating-point arithmetic. Particular attention will be given to MPECs,<br\/>which exhibit degeneracy of a speci.c type. Extensions to degenerate complementary problems<br\/>and variational inequalities will also be investigated. Special attention will be paid to the numerical<br\/>aspects of implementing these algorithms, an important issue because of the ill conditioning that<br\/>may be present in the subproblems at each iteration. All this research will be carried out in a<br\/>coordinated manner, coupling theoretical advances with computational experiments using both<br\/>prototype software and modi.cations to production software.<br\/>Work on applications of nonlinear programming, performed in collaboration with domain scientists<br\/>and engineers, will be the second key contribution of the proposal. Interdisciplinary research of<br\/>this type plays a key role in any research program in algorithmic optimization. The PI has ongoing<br\/>collaborations in such areas as engineering control, statistics, and cancer treatment planning.<br\/>The intellectual merit of the proposed work lies in improvements to our understanding of<br\/>nonlinear programs and of the algorithms that solve these problems, in the construction of better<br\/>algorithms and software that are robust in the face of degeneracy, and in the impact of these<br\/>advances on many application areas including those described in the proposal.<br\/>The work will have a wider impact on users of optimization technology, ultimately bene.ting<br\/>many of those who use optimization software packages to solve problems in an extremely wide<br\/>range of applications. Domain scientists and engineers in the areas highlighted in the proposal will<br\/>bene.t especially.","title":"Nonlinear Optimization: Algorithms, Software, Applications","awardID":"0430504","effectiveDate":"2004-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":["517079"],"PO":["432103"]},"99432":{"abstract":"ABSTRACT<br\/>0438931<br\/>Barry W. Boehm<br\/>U of Southern California<br\/><br\/>Title: Value-Based Science of Design<br\/><br\/>The grant's research objectives are to develop the foundations for a science of value-based design of software-intensive systems. It is based on the PI's stakeholder win-win Theory W, which emphasizes that \"value\" includes not only monetary factors, but also any non-monetary factors that strongly motivate or demotivate a project or organization's success-critical stakeholders.<br\/><br\/>Phase I of the research will use value considerations to parse and better understand the design space. It will focus on two areas, COTS-based design and design to achieve quality attributes. Phase I will also consider other areas such as transformational design, modular and agile design, and cost\/schedule constrained design.<br\/><br\/>Phase II will test the hypotheses formulated in Phase I by experimentally applying, evaluating, and iterating value-based design capabilities in two areas -- COTS-based design and design to achieve quality attributes -- using both small and large project testbeds.<br\/><br\/>Phase III will develop working abstractions and composability relations based on Phase II results. The abstractions will include composable process patterns for value-based software design, tested for composability across the focus areas.<br\/><br\/>Research benefits will include a tested framework with principles, processes, methods, and tools for better performing value-based software design.","title":"SoD: Value-Based Science of Design","awardID":"0438931","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":[262262,"551145",262264],"PO":["564388"]},"97287":{"abstract":"This project is planning the creation of a Performance Education and Research Laboratory (PEARL) in the Computer Science Department of New Jersey City University (NJCU), a federally-designated Predominantly Minority and Hispanic Serving Institution. The project promotes undergraduate research participations in order to expand the number of minority students attracted to and retained in Computer Science. Research partnerships are being established between NJCU, Brookhaven National Laboratory, and New Jersey Nanotechnology in Bell Labs. Joint research teams are being formed with NJCU faculty, undergraduate student researchers, and scientists from national labs. The goals are to expand research experiences for undergraduate minorities and to enhance the faculty research environment. A proposal for a five-year continuing grant is being developed. The project has the potential to become a model for development of programs for minority success at similar urban universities.","title":"MII: Performance Education and Research Laboratory","awardID":"0424557","effectiveDate":"2004-12-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7399","name":"CISE MINOR INST INFRA (MII) PR"}}],"PIcoPI":[255942,255943,"423075"],"PO":["539087"]},"95341":{"abstract":"This award supports the development of a system for computation of syntactic structure in spoken language conversations with a specific emphasis on parent-child conversations. The new system, called GRASP (Grammatical Relations Analysis for Spontaneous Protocols), replaces the traditional computation of full parse trees with the computation of grammatical relations linked through a dependency structure. GRASP is being applied to all the English language corpora in the CHILDES (Child Language Data Exchange System) database. It replaces tedious hand calculation of commonly used child language profiles such as IPSyn, DSS, and LARSP with a more reliable automatic method. GRASP is able to achieve significantly greater parsing accuracy, since it can concentrate on the computation of syntactic structures that are most relevant to these profiles. To validate accuracy, results from GRASP are compared with hand-coded results contributed by 8 laboratories. Deviations between GRASP and hand-coded results are analyzed in detail to diagnose ways to increase system accuracy. The current parser relies primarily on a simple statistical parser for grammatical relations trained on maternal utterances in the Eve and Sachs corpora in CHILDES. Analyses have shown that training on the grammatical relations in the maternal input is superior to training on inputs that include children's utterances, even when the target utterances are child utterances. Additional modules in construction emphasize rule-based grammatical relation construction and robustness rules.<br\/><br\/>Automation of these scoring profiles benefits academics and clinical professionals working with bilingual and minority populations, delayed talkers, and children with hearing problems. In addition, the grammatical relation dependency structures being computed are at the core of the language acquisition theory, such as thematic role structure, binding, relativization, complementation, and movement. The specific identity of the grammatical relations being encoded was determined by paying close attention to structures of traditional importance in the literature and by an open solicitation of additional suggested relations posted to the child language bulletin board. After consolidating these new parsing methods and automating the relevant child language measurement instruments, the project will extend the results to language development in other languages, as well as to adult spoken language corpora. The final system will be disseminated by facilitating web-based analyses of online corpora and by packaging into a simple desktop application.","title":"GRASP: Parsing of Grammatical Relations for Databases of Spoken Language Interactions","awardID":"0414630","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["420371","502549"],"PO":["565215"]},"99412":{"abstract":"0438786<br\/>Don Batory<br\/>U of Texas Austin<br\/><br\/>A Generative Model of Feature Interactions<br\/><br\/>This research extends work in the area of Generative Programming, which explains how programs in a domain are designed from features. A generative programming model is both constructive and predictive because it tells us how to synthesize programs in a domain with particular properties. A program's design can be specified as a base program plus a set of features, which are units of program functionality. Programs consisting of features can be formalized mathematically as an algebra with suitable composition operators. Research in generative programming shows that evaluation of algebraic expressions synthesizes the target program, and expression optimization optimizes the program's design. <br\/><br\/>Feature interaction occurs when one or more features modify or influence another feature. We focus on interactions that are static and structural: how a feature influences (or changes) the source code of another feature. Our research contributes to a Science of Design by showing how feature interactions obey algebraic laws that lead to highly structured programs that are amenable to synthesis, optimization, and evolution. We will demonstrate practical applications of our work: (1) refactoring Java legacy applications into feature-based designs (so that features can be more easily added and removed), and (2) realizing a form of on-demand modularization, where a query specifies a particular concern and our theory tells us how to extract software that satisfies that query.","title":"SoD: A Generative Model of Feature Interactions","awardID":"0438786","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["515656"],"PO":["564388"]},"99434":{"abstract":"Abstract<br\/>0438948<br\/>Paul, JoAnn M. <br\/>CMU<br\/><br\/>SoD: Enabling Design Strategies for Single Chip Heterogeneous Multiprocessors<br\/><br\/>Within the next ten years, it will be possible to provide enough transistors on a single chip for on the order of a hundred 32-bit RISC processors. The design of these emergent, software-intensive single chip heterogeneous multiprocessor (SCHM) computer systems precludes the possibility of seat-of-the-pants analysis or specify-and-synthesize methodologies. No science of design has been developed for mixed hardware\/software single chip multiprocessing systems. Strategic computer system organization - requires a creative proces that can not be automateds,and thus this designer creativity must be facilitated at the system level. The full vision of this research is to develop the science needed to enable future design systems to break away from the specify-and-synthesize mind set of current CAD tools to become a characterize-and-invent paradigm that still has ties into the current lower level integrated circuit design methodology flows. Another major theme behind our research is that computer system designers start from trend analyses, looking for future cross-over points between anticipated changes in the major features of applications sets and the physical capabilities of the major architectural features of the systems that carry them out. From these, design strategies are invented which can become basic organizing themes for entire classes of programmable systems.","title":"SoD: Enabling Design Strategies for Single Chip Heterogeneous Multiprocessors","awardID":"0438948","effectiveDate":"2004-12-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["507772","464680"],"PO":["564388"]},"98137":{"abstract":"Networked embedded systems such as wireless sensor networks (WSNs) have the potential for revolutionizing data collection and analysis in physical sciences and other fields by allowing intelligent dense monitoring of the environment. State-of-the-art research in WSNs treats the problem of designing sensor network applications primarily as one of manual customization of low-level network protocols. The design complexity and required expertise make this approach insufficient for increasingly complex, compute-intensive distributed sensor systems.<br\/><br\/>There is a clear need for a new top-down methodology that automates a bulk of the low-level implementation aspects of design and allows the end user to focus on high level algorithm design and optimization.<br\/><br\/>Intellectual Merit:<br\/> * Development of models and methodologies for design automation of compute-intensive sensor networks, with a focus on two WSN applications: (i) networked structural health monitoring (SHM) where a large-scale network of thousands of sensor and actuator devices embedded into a building or bridge is deployed to continuously monitor the structure, trigger alarms that identify the onset of damage, precisely pinpoint the location of damage and also provide a long-term history of ambient stresses imposed on the building, (ii) networked micro-climate monitoring (MCM) where a network of multi-modal sensors is deployed to provide information about climatic variables such as temperature, light, humidity, etc., in the operational environment (e.g. a wildlife reserve). <br\/>*Application representation: A suitable model of computation (MoC), will be defined to capture the structure of computation and communication in the algorithms. <br\/>*Virtual architectures: The virtual architecture (abstract machine model) for the target sensor networks will include a network model, a set of computation and communication primitives, cost functions, and middleware services. <br\/>*Algorithms for design automation: Algorithms will be developed and middleware services used for in-network processing, such that the desired performance is achieved..<br\/>*Demonstration: The design automation methodology will be validated and demonstrated for the two target applications through simulation.<br\/><br\/>Broader Impacts:<br\/>*The target applications are of great benefit to society: SHM networks will improve the safety of our civil infrastructure including roads, bridges and buildings; while the MCM networks will advance our scientific knowledge of the complex ecological interactions between organisms<br\/> and their environment. <br\/>*More broadly, the proposed methodology will facilitate the rapid design and synthesis for a<br\/> wide range of compute-intensive sensor network applications. <br\/>*The results of the proposed work will be disseminated<br\/> on a timely basis to the research community and to industrial partners.<br\/>*This project will build on their existing collaboration which includes co-advising of PhD<br\/> students, and joint publications.<br\/>*The proposed research will also provide educational material for an advanced graduate<br\/> course on sensor networks at USC.","title":"Design Automation of Compute-Intensive Networked Embedded Systems","awardID":"0430061","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":["563658","531832"],"PO":["565272"]},"98159":{"abstract":"Proposal Number: 0430178<br\/><br\/>Title: Collaborative Research: Using Generative Models to Evaluate and Strengthen Biometrically Enhanced Systems<br\/><br\/>PI: Daniel Lopresti<br\/><br\/>Abstract:<br\/><br\/>This research investigates a new form of attack which poses a potential threat to biometrically-enhanced security mechanisms. Such attacks are \"generative\" in nature: the attacker works from a model for mimicking an aspect of human behavior and, through direct or indirect knowledge of the targeted user's biometrics, adapts the model to generate attempted reproductions of the user's input. In this context, two types of security mechanisms are studied: biometric authentication, where the user's biometric features are measured by a nonbypassable reference monitor and compared to a stored template; and password hardening, where the user's password and biometric features measured during the entry of the password are combined into a secret key (the \"hardened\" password) that should be irreproducible even to an attacker with full access to the device and software which create the key. Generative models for handwriting serve as an enabling input to evaluate schemes for performing handwritten password verification and for creating hardened passwords from handwriting. The size of the attacker's search space is quantified assuming that various categories of information have been gleaned (or captured) from the targeted user, as well as employing demographic statistics. Speech synthesis for targeting a specific user's voice is also studied in these same contexts. To the extent possible, techniques are identified for improving password hardening to withstand such attacks.","title":"Collaborative Research: Using Generative Models to Evaluate and Strengthen Biometrically Enhanced Systems","awardID":"0430178","effectiveDate":"2004-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["371100"],"PO":["521752"]},"94882":{"abstract":"Bad weather can severely limit the usefulness of computer vision in<br\/>the outdoors. The algorithms (segmentation, tracking, recognition,<br\/>etc.) used in today's vision systems are not equipped to handle the<br\/>adverse effects of weather. For outdoor vision systems to perform well<br\/>in all conditions, they must explicitly account for the diverse<br\/>effects of weather. The visual effects produced by different weather<br\/>conditions can be broadly classified into two categories: steady (fog,<br\/>mist and haze) and dynamic (rain, hail and snow). This research<br\/>project is devoted to the modeling and analysis of dynamic weather<br\/>effects. The first stage of the study is to develop compact and yet<br\/>descriptive photometric and geometric models of raindrops and<br\/>snowflakes. These models will be used to develop advanced models for<br\/>the dynamical and statistical properties of rain and snow. Using<br\/>these models, efficient and robust algorithms will be developed for<br\/>detecting and removing rain and snow from videos. The proposed models<br\/>will also be used to develop algorithms for fast and realistic<br\/>rendering of rain and snow. In addition, the developed models will be<br\/>used to design and implement real-time rain and snow gauges based on<br\/>video cameras. Such gauges will be very inexpensive compared to ones<br\/>currently used in meteorological sciences, and yet will provide high<br\/>accuracy in the estimation of weather parameters.<br\/><br\/>The results of the proposed research are anticipated to have a broad<br\/>and tangible impact on both research and education. From the<br\/>perspective of research, the results are expected to impact the<br\/>robustness of outdoor vision systems and the realism that computer<br\/>graphics can achieve. The models, algorithms and databases developed<br\/>during the project will be broadly disseminated in a timely<br\/>fashion. With regards to education, the PI is currently developing a<br\/>course titled ``Computer Vision through the Atmosphere,'' and the<br\/>results of this investigation will contribute significantly to the<br\/>content of the course.","title":"Vision Through Rain and Snow","awardID":"0412759","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["438618"],"PO":["564316"]},"98216":{"abstract":"Tools for the Development of Memory-Efficient Sparse Linear Solvers<br\/><br\/>Recent advances in both hardware and algorithm development have increased<br\/>the effect of memory access on the runtime of large scale linear algebra<br\/>applications. The PI proposes to create tools that will provide the code<br\/>developer with information about memory costs of codes in preparation<br\/>as well as with software building blocks designed to lessen those costs.<br\/>First, a framework for memory-efficient implementation of the sequences of<br\/>sparse Basic Linear Algebra Subprograms that typically constitute a sparse<br\/>linear solver will be provided. Second, a collection of metrics for the<br\/>prediction of memory usage of linear algebra software will be developed.<br\/>Working from those metrics, a tool to automate the prediction process<br\/>will be built. Finally, keeping in mind that the performance of a code<br\/>ultimately depends on how it compiles, a comprehensive study of compilers<br\/>and the performance of the executables they produce will be carried out.","title":"Tools for the Development of Memory-Efficient Sparse Linear Solvers","awardID":"0430646","effectiveDate":"2004-12-15","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":["518600"],"PO":["381214"]},"97876":{"abstract":"The enormous potential of sketch-based interfaces for conceptual engineering design is widely recognized and has been broadly pursued, but the practical application of these systems has remained limited because they are two-dimensional and do not embody functionality. The PI has previously demonstrated algorithms based on statistical machine learning that allow reconstruction of a 3D object from a 2D freehand drawing directly. By extending and combining this work with recent mass-market pen-based hardware, the PI will in this project create the basis of new conceptual design tools for rapid visualization, simulation and learning for geometry-intensive domains. A new form of freehand sketching will be explored, in which the sketch itself is spatially reconstructed in interactive time and then can be physically simulated, a process the PI calls \"live sketching.\" The PI's system will enable users to construct complex 3D models quickly and intuitively, to analyze them, to change viewpoints while sketching, and to communicate and collaborate on spatial concepts with other designers more easily. To this end, the PI will first extend his reconstruction algorithms through context sensitivity and temporal scene segmentation so they can handle more complex geometries than is currently possible, including curved surfaces. This effort will then be combined with existing simulation and analysis codes of various disciplines and will be integrated into a prototypical platform allowing construction of 3D models by successive piece-wise sketching, reconstruction, and interactive simulation. The resulting tools will fundamentally alter the way engineers interact with design systems, bringing together traditional computer-aided engineering and simulation tools so they can play a role much earlier in the critical preliminary design stages. <br\/><br\/>Broader Impacts: The outcomes of this project will positively impact any design domain where it is necessary to predict the behavior of spatial geometries, including many application areas of mechanical, civil, MEMS, and architectural CAD. Live sketching will also make engineering tools for modeling and simulation much more accessible to non-engineering designers, students and teachers, by removing interface barriers. The PI will in addition develop and make available online a live sketch application for teaching structure and kinematics, which will allow students and teachers to explore and demonstrate kinematics and structural analysis of trusses and solid structures by sketching structures, applying loads, and seeing the resulting mechanism trajectories, exaggerated deformations, and colored stress concentration for various shapes, in real time while sketching. This project will be made available on-line in open-source format, so that additional types of simulation can be integrated into it by others as required.","title":"ITR\/ASE: 3D Sketching for Conceptual Visualization, Simulation, and Learning","awardID":"0428133","effectiveDate":"2004-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7314","name":"ITR FOR NATIONAL PRIORITIES"}}],"PIcoPI":["458140"],"PO":["565227"]},"99439":{"abstract":"Abstract<br\/>0439017<br\/>Walid M. Taha<br\/>William Marsh Rice University<br\/><br\/>SoD: Synthiszizing Device Drivers<br\/><br\/>The goal of this project is develop a framework for designing software-intensive systems based on recent work on multi-stage programming languages. Our thesis is that the concept of staging, originally developed to support program optimization, is a fundamental technique in the emerging science of design of software-intensive systems. We believe that many software-intensive systems can be designed more effectively using a linguistic framework that reflects the staging distinctions separating high-level software designs from their implementations on particular platforms.<br\/><br\/>In earlier work, we helped develop the conceptual foundations of multi-stage programming including the construction of core calculi and type systems that support staging and the development of a realistic language incorporating staging called MetaOCaml. In this project, we intend to show how staging can be used to improve the process of designing software in industry where the phase distinction between program designs and deployed implementations is acute. We will focus on the design of device drivers because the deployed code for controlling a device varies greatly depending on the vagaries of the device interface and the hardware platform to which it is attached. In this context, we must extend staging techniques to handle event-driven computation, concurrency, and strict limitations on resources.","title":"SoD: Synthesizing Device Drivers","awardID":"0439017","effectiveDate":"2004-12-15","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7652","name":"SCIENCE OF DESIGN"}}],"PIcoPI":["495364","495364","495365","495365"],"PO":["564388"]},"94973":{"abstract":"This project investigates the development and use of 2D and 3D shape and image representations for category-level recognition, as organized in four closely related streams. First, low-distortion embeddings of the shape space that capture both its local topology and its high order structure will be investigated for efficient and practical indexing in a database of several tens of thousands of shapes. Query search will then be guided in the embedding space via hierarchically structured categories motivated by cognitive science notions. Second, a novel free-form deformable template will be developed by constructing a parametric space for generating shapes constrained to have a given shock-graph topology and by sampling this space with a low-dimensional dense and complete approximation. This will lead to a formal complete language for describing shape via symmetry representations and has fundamental implications in a number of areas including segmentation, shape averaging, and !<br\/><br\/>shape design. Third, viewing symmetry-based representations primarily as the joint representation of the spatial configuration of pairs of features, a formal and complete symmetry-based representation of images will be developed based on a partitioning of the image into patches called \"visual fragments\". The proposed advantage of the visual fragments is that they allow for perceptual grouping based on both boundary and regional attributes, and also for top-down feedback from partially recognized portions of the grouping. Fourth, in a track parallel to investigations of 2D shape representations, the local form and transitions of the graph-structured shock scaffold as a representation of 3D shape will be explored. Two graph matching techniques, graduated assignment and edit distance, will be investigated for indexing into 3D shape models and applied to a large database of 3D shapes.<br\/><br\/>The broader impact of this research activity spans a number of areas, such as tracking and recognition of vehicles for surveillance, homeland security, and defense applications, generation of computational atlases and registration of datasets in medical imaging, fragment assembly and integration of multiple range datasets in archaeology, virtual sculpting in visual arts, signature and fingerprint recognition in biometric identification, indexing into large databases by shape content, key frame animation for entertainment applications, among others. The concepts developed here are also of interest for both modeling shape perception and cortical activity as related to shape recognition.","title":"Symmetry-based Representation of 2D and 3D shapes and images for category-level recognition","awardID":"0413215","effectiveDate":"2004-12-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["550631"],"PO":["564316"]},"105255":{"abstract":"This research is intended to develop technology that will allow motor-impaired disabled people to communicate with a computer most effectively, especially giving them access to the web. An important part of the work will be development of a tool that can model users with severe motor impairments and automatically make the adjustment necessary to provide access to the web. For example, a web page may be modified to show preview information about a selected link to user to avoid the cost of following a wrong link and then backing out again. Preliminary work has identified seven requirements for such a tool, ranging from navigation support to dealing with forms. These requirements will be augmented and refined as the work progresses. Two complementary systems will be built that meet these requirements. One is a dynamic browser interface and leaves the actual HTML unchanged. The other is a proxy server that modifies HTML to be more accessible. Neither requires the authors of web pages to make changes. The first approach will allow finer control over modifications and provide a platform for experimentation with different mappings between input signals and action based on errors and fatigue. The modified browser will be able to track errors and adjust its interface accordingly. It will also allow experimentation with different approaches to avoiding errors such as confirmation dialogs. The second approach will be platform independent, and available to any user without requiring that any special software be installed. It will allow the testing of modifications on a much wider scale. These automatic approaches are necessary because it is unrealistic to expect that web designers will handcode the necessary modifications into their websites.<br\/><br\/>Additionally, the research will explore the feasibility of automatically generating user interface modifications based on a user model, something applicable to other common and important applications such as email and word processing. Both the web accessibility work and this larger goal have applications outside of assistive technology. For instance, they may be used to increase accessibility of the web to other users with limited input capabilities, for example, to mobile phone users with limited (9-key) keyboards.<br\/>These systems will be developed and tested first with abled and then motor-impaired users. They will be deployed publicly, and their impact will be studied over time. Finally, the research will impact accessibility guidelines, so that more web pages and other applications can support low bandwidth accessibility. <br\/><br\/>The contribution of this work will be a set of techniques for making the web more accessible in conditions where input is extremely limited and errors are likely. This system will be useful to people with motor disabilities, or any user with access to limited input devices, such as a wearable computer user.","title":"Web Accessibility for Low-Bandwidth Input","awardID":"0511895","effectiveDate":"2004-12-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["518044"],"PO":["565227"]},"109119":{"abstract":"The most prevalent modeling methodology for computational systems employed today,<br\/>hand-writing monolithic simulators in sequential programming languages, yields simulators that are<br\/>difficult to retarget or integrate with one another. The proposed solution, the Liberty Simulation Environment (LSE), automatically constructs simulators<br\/>from machine descriptions that closely resemble the structure of hardware. This structural resemblance<br\/>to the hardware provides confidence in the model and frees systems researchers to think about systems, not<br\/>simulator coding concerns. LSE's strict but general component communication contract enables the creation<br\/>of highly reusable component libraries and eases the task of rapidly exploring ever more exotic designs. LSE<br\/>components and descriptions can be hierarchically composed of other components and can exist at any level<br\/>of abstraction (statistical to gate-level). This choice of abstraction level combined with partial specification<br\/>support allow models to be iteratively refined; descriptions generate fully functional simulators from the<br\/>very start, allowing users to specify and validate precise models incrementally. Through observing current<br\/>and future users of LSE, we will continually refine the framework to arrive at the most effective design of<br\/>these features in practice.","title":"NGS:Collaborative Research: Structural and Composable Performance Simulation of Complex Systems","awardID":"0532452","effectiveDate":"2004-12-16","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["517389"],"PO":["551712"]}}