{"9956":{"abstract":"This award supports the participation of ten U.S. graduate students and recent PhD's in an Trans-Atlantic mathematics workshop to be held in Pontresina, Switzerland, in June 1996. The workshop is co-organized by Professor Diane O'Leary of the University of Maryland and local host organizers Walter Gander and Martin Gutknecht of the Swiss Federal Institute of Technology in Zurich, with the assistance of a program committee comprised of several other European, US and Canadian experts. The topic of the meeting is recent advances in numerical algebra, with particular attention to applications in signal processing and control, parallel computation, image processing and various industrial problems. The purpose of the meeting is to bring together some of the world's most active researchers in the theoretical as well as applied aspects of numerical algebra, together with promising newcomers, in order to foster close personal interaction and exchange of ideas at the leading edge of the field. Graduate students will be included among those invited to talk about their work. Meeting organizers emphasize the creation of an informal atmosphere in an isolated location in order to facilitate small group and personal discussions among the participants. Ensuring the participation of promising junior US researchers in this dynamic field through this NSF award will enable them to establish personal contact with leading minds in the field outside of the US, and gain international contacts that should prove to be professionally valuable in their careers.","title":"U.S.-European Symposium on Numerical Algebra; June, 1996; Pontresina, Switzerland","awardID":"9600471","effectiveDate":"1996-06-01","expirationDate":"1996-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["450658"],"PO":["290800"]},"6359":{"abstract":"Psarris 9528330 In the past decade much progress has been made in developing high performance large scale parallel architectures. The development of fast restructuring compilers for the automatic parallelization of sequential programs requires efficient data dependence analysis techniques in order to obtain exact data dependence information. The proposed techniques in data dependence analysis fall into two categories, either efficient and approximate tests or exact and exponential. The proposed research will attempt to show, though, that exact data dependence information can be computed efficiently in practice. The GCD test and the Banerjee inequality are the two tests most widely used to detect data dependencies between pairs of array references inside loop nests. These tests are approximate in the sense that they are necessary but not sufficient conditions for data dependence and, therefore, they may introduce artificial dependences which limit parallelization. Their major advantages is their low computation cost. A recent study provided necessary and sufficient conditions for the accuracy of the GCD and Banerjee tests. This study has also led to the development of the I (Interval) test, an improved dependence analysis test. The I Test is more accurate than a combination of the GCD and Banerjee tests and is able to provide exact data dependence information in practice, unlike the classic tests, at no additional computation cost. The original work considered only the case of loops with constant loop limits. In scientific applications though, inner loop limits may be linear functions of the outer loop iteration variables (these iteration spaces are termed trapezoidal regions). This project develops an efficient and accurate dependence analyzer. The research has four objectives. The first objective is to derive conditions for the accuracy of the GCD and Banerjee tests in general trapezoidal regions and perform an empi rical study of how often these conditions occur in practice. The second objective is to extend the I test to the general trapezoidal regions and to assess its performance benefits on a suite of benchmark codes. The third objective is an analytical and empirical comparison of the I test with all the other tests, such as the Omega test, Power test, etc. An analytical and experimental evaluation of all the data dependence analysis test's is essential to determining which tests should be performed in practice. The fourth and principal objective is to integrate the above research work and develop an improved dependence analyzer as a part of the Paraphrase-2 parallelizing compiler. It is expected that the completion of the proposed research will improve the understanding of data dependence analysis, demonstrate the effectiveness and practical importance of the proposed techniques, and significantly improve the state of the art in parallelizing compilers. By providing efficient and exact dependence analysis techniques a number of compiler optimizations for high performance computer architectures can be performed in practice. ***","title":"RUI: A Novel Dependence Analyzer for Parallelizing Compilers","awardID":"9528330","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["525789"],"PO":[15612]},"6823":{"abstract":"Current fractal tools lack the level of control necessary to model specific natural structures. For example, many fractal models of trees have been constructed, but given a particular tree, it would be difficult to represent the tree's specific shape using current models of fractal modeling. The recurrent modeling project identifies three aspects to this problem, and attempts to solve each with several new fractal modeling tools. Objective I: Recurrent Model Representation. Recurrent modeling strives to elevate fractal representation to the level of sophistication that smooth surfaces enjoy in computer-aided geometric design by translating their classical self-referential representation into standard implicit and parametric forms. Recurrent modeling also attempts \"procedural geometric instancing,\" and enhancement of the classic object instancing paradigm that enables it to more efficiently represent the development fractal models currently specified by L-systems. Objective II: Interactive Recurrent Modeling. Recurrent modeling extends the tools of computer-aided geometric design to fractal geometry. A direct manipulation interface provides real time feedback in the fractal modeling process. The implicit formulation from the previous objective allows the application of standard blending formulations specifically designed for natural modeling. Extending constructive solid geometry to include fractal models supports the construction of complex shapes from primitives. Objective III: Automatic Recurrent Modeling. Recurrent modeling attacks the inverse problem of fractal geometry: \"find the parameters of a fractal model that approximates a given shape\" from the domain of model-based computer vision. The second PI is an NSF-supported model-based computer vision researcher. His unique perspective on this problem resulted in a new solution, called \"similarity hashing\". Similarity hashing successfully detects self-similarity and returns the paramete rs of the selfsimilar model in initial tests. Recurrent modeling continues this research to develop an automated system for discovering selfaffinity in natural structures. The new tools recurrent modeling proposes would impact the fields of computer graphics and forest science. The new tools would represent highly detailed geometrics, such as a forest and crops. Such models would have applications in image synthesis, particularly in animation, virtual environments, physically- based modeling and remote sensing. As the smooth representations of computer-aided geometric design aid manufacturers, the efficient representations of detail proposed by recurrent modeling representations would aid the study of the environment. ***","title":"Recurrent Modeling","awardID":"9529809","effectiveDate":"1996-06-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["313372","517378"],"PO":[16739]},"6614":{"abstract":"The key objective of this research project is to discover principles that underlie and enable the semantic interoperation of heterogeneous information systems. Such systems comprise widely diverse and locally autonomous components with potentially intricate mutual constraints. A major technical challenge is to design activities that may execute over a number of components, but nevertheless preserve the global semantic requirements, i.e., the integrity of the information at large. This research project addresses the above challenge by (a) innovating representations that capture the semantics of data and activities in a unified mathematical framework; (b) developing techniques for reasoning about the above semantics to derive the maximally relaxed semantic constraints on data; (c) formulating design rules through which complex activities can be systematically specified; and (d) implementing the design rules in a prototype automated reasoning tool to assist in capturing and validating specifications of heterogeneous activities. A centerpiece of this project is the evaluation and iterative refinement of the developed techniques with respect to a taxonomy of problems. Continuous evaluation, greatly facilitated by the automated reasoning tool, is essential for discovering the lasting scientific principles of semantic interoperation.","title":"Principles of Semantic Interoperation","awardID":"9529179","effectiveDate":"1996-06-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["565158"],"PO":["563751"]},"6317":{"abstract":"Geometric drawings give rise to many interesting and important problems which are the extensions, generalizations, or the dual forms of the well known planar crossing problem. A k-crossing in a geometric drawing is defined to be a set of k edges which pairwise cross in the drawing. An interesting problem here is to generate geometric drawings with small number of k-crossings, for a given graph and a given k>1. Another important problem is the crossing clique problem, in which the objective is to generate geometric drawings so that the largest clique of crossings (the largest k so that the drawing has a k-crossing) is small. This problem is closely related to the page number problem and has nice applications to the theory of VLSI. The dual concept to a k- crossing is a k-disjoint set: Given a geometric drawing of the G, a k-disjoint set is a set of k edges which are pairwise non- crossing in the drawing. The concept of k-disjoint sets gives rise to problems which are similar to those of k-crossings, in a dual setting. It is the goal of this investigation to study k- crossings, k-disjoint sets, and the crossing clique problem. The aim is to develop algorithms which can generate solutions whose quality can be guaranteed and\/or to develop general structural results in a form which could be applicable to a broad class of graphs. ***","title":"Crossing Number Problems in Geometric Drawings of Graphs","awardID":"9528228","effectiveDate":"1996-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["354802"],"PO":["187585"]},"16051":{"abstract":"Numerous applications in sciences and engineering, as well as in computational, applied and pure mathematics give rise to problems involving matrices with Toeplitz, Hankel, Toeplitz-plus-Hankel, Vandermonde structures, controllability, observability, Cauchy, Loewner, Pick, Schur-Cohn, Routh-Hurwitz matrices, Bezoutians, along with many other patterns of structure. standard mathematical software tools (e.g., MATLAB, MathCad, Maple V, NAG library, LAPACK), are based on standard (structure-ignoring) methods, and therefore their use is often not appropriate for obtaining a satisfactory solution. Here are two major reasons. First, ignoring the structure artificially squares the size of the data, which requires unnecessary storage and an extremely large amount of CPU time. Secondly, many structured matrices, e.g. Hankel, Pick, Hilbert, Vandermonde, are extremely ill- conditioned, which means that all available standard methods often fail to produce even one correct digit in the computed solution. The theme of this project is the study of several theoretical and computational problems related to Cauchy and Cauchy-like matrices, which arise in many applied areas, including signal processing, system Theory H-infinity control. Use of the concept of displacement structure suggests that algorithms for Cauchy-like matrices can be used to design efficient practical algorithms for many other important kinds of structured matrices, such as Toeplitz, Hankel, Toeplitz-plus- Hankel, Vandermonde, Chebyshev-Vandermonde matrices, etc. In fact, all these matrices can be transformed into Cauchy-like matrices just by applying a few fast Fourier, cosine of sine transforms. It is planned to extend the results to develop fast and numerically accurate algorithms for new classes of structured matrices. ***","title":"Fast and Numerically Accurate Algorithms for Matrices with Displacement Structure","awardID":"9628117","effectiveDate":"1996-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["126952"],"PO":["187585"]},"19143":{"abstract":"","title":"NSF Young Investigator: Toolkit Development for the Design of Floating-Point Arithmetic Hardware and Software","awardID":"9696196","effectiveDate":"1996-06-01","expirationDate":"1998-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["557274"],"PO":["150516"]},"15052":{"abstract":"Graphical probabilistic models, such as Bayesian belief networks and influence diagrams, offer an attractive knowledge representation tool for reasoning in knowledge-based systems. As many practical systems tend to be large, the main problem faced by this approach is the complexity of probabilistic reasoning, shown to be worst-case NP-hard both for exact and approximate inference. Since the complexity proofs are for the worst case, it is important to study the properties of real models and subsequently to develop algorithms that will explore these properties. The purpose of this research is to develop efficient algorithms for approximate belief updating and decision making in very large probabilistic models. These algorithms explore asymmetries in joint probability distributions over model variables and search for the most likely states of the model. Very often a small set of states covers the bulk of the probability space. The project includes theoretical studies of methods for prediction of convergence speed and error bounds in search-based algorithms and empirical verification of the theoretical predictions on practical models. The algorithms developed in the course of the project are implemented and empirically evaluated in very large knowledge-based systems. As the complexity of probabilistic inference in belief networks is one of the main obstacles to wide application of probabilistic methods in knowledge-based systems, the theoretical results and the algorithms developed in this project can be expected to have a major impact on the field.","title":"Towards Efficient Search-Based Algorithms for Belief Updating, Decision Making, and Explanation in Bayesian Belief Networks","awardID":"9624629","effectiveDate":"1996-06-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[38098],"PO":["565227"]},"14690":{"abstract":"A methodology is to be developed which allows designers to do reliability prediction and reliability budgeting using a high-level functional description of the design. Prediction models at the gate and function level will be developed and verified using observed data. Under reliability budgeting a specified failure rate, or mean-time-to-failure, for the whole chip may be partitioned to provide reliability targets for smaller pieces and thus lower levels of abstraction. The work leads to the development of a new course in \"Reliability Engineering for Integrated Circuits\", which will provide a software environment where ICs may be subjected to stress test experiments in virtual environment at various design stages using observational data.","title":"Reliability Engineering for Integrated Circuits","awardID":"9623237","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["116761"],"PO":["549626"]},"15130":{"abstract":"This project establishes an active research effort in microelectronic systems architecture that enhances the undergraduate curriculum in Computer Engineering, Computer Science and Electrical Engineering, and introduces students to new computer architectures, new technology and microelectronic systems. The ideas developed will be incorporated into the microprocessor and computer architecture curriculum along with new cooperative learning techniques. The focus of the research component is to devise and test Instruction Level Parallelism (ILP) techniques and mechanisms. Programmable Logic Devises, such as FPGAs, are used to implement rapid system prototyping of custom computer designs and are also used to implement custom components in reconfigurable architectures. Engineers and computer Science students are taught with highly participatory \"active learning\" methods such as cooperative learning which stimulate student interest and learning. By introducing students to teamwork in the engineering classroom, learning is enhanced, fruitful networking relationships are developed and students are able to adapt easily into other team environments. The rapid- prototyping platform developed for this effort is used for several upper division computer architecture and microprocessor courses and the cooperative learning pedagogy serves a national model.","title":"Microelectronic Systems Architecture Education and Research","awardID":"9624967","effectiveDate":"1996-06-15","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[38263],"PO":["321058"]},"15152":{"abstract":"Constraint databases are a recent generalization of relational databases. Constraint databases have greater flexibility and expressive power than relational databases because they allow complete information (unambiguous data) to be described implicitly. The project addresses the development and implementation of new methods for the (1) representation and querying of incomplete information (ambiguous data) in constraint databases, (2) updating and revising single constraint databases, and (3) combining and in case of conflict arbitrating between or among several constraint databases. Approaches for representing incomplete information will be analyzed for time and space efficiency, while update, revision, and arbitration operators will be tested for the least change property as expressed by the Katsuno-Mendelzon and related axioms. A constraint database query and transformation language allowing both representation of incomplete information and update, revision, and arbitration operators will be implemented and tested on applications in spatial databases, telecommunications, and refinement-based modeling of objects. This project will greatly increase the real-life applicability of constraint databases.","title":"CAREER: Incomplete Information in Constraint Databases","awardID":"9625055","effectiveDate":"1996-06-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["147262"],"PO":["563751"]},"14581":{"abstract":"9622944 Grosch, Herbert R. Individual Award Special Project: Completion of Computing History Memoir This project provides partial support for the PI to develop an historical memoir of his work and observations during the latter part of an unusual career in computing, centering on the years 1959-1987, during which time he was contributing in a major way to work in Europe and Japan and representing the US on various international Committees. It is expected that the material will provide context for current and future work in computing and be of benefit to the community. ***","title":"Special Project: Completion of Computing History Memoir","awardID":"9622944","effectiveDate":"1996-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["175531"],"PO":[37068]},"3938":{"abstract":"9532041 DeBra Thermal control and temperature gradients in machine tools and metrology instruments are fundamental limitations to precision engineering. A way to minimize these limitations is using hydraulic actuation and sensing, because of its high and efficient transfer of energy. This approach is also compatible with oil showering, one of the ways thermal control is achieved in ultra-precision manufacturing. This project will develop an ultra precision machine tool based on laminar flow motors and linear actuators, and oil differential gages for straightness and yaw compensation. These components were developed at Stanford University, in part with NSF Strategic Manufacturing Initiative support, to eliminated control of hydraulic actuators by throttling which leads to turbulence, noise and vibration. The major research efforts will be on development of compatible hydraulic sensors and integpation of the quite actuators in an ultra precision, quiet hydraulic diamond turning machine. The impact of this research is primarily on the infrastructure for precision engineering and ultra precision machine tools. It promises better thermal control at lower cost than is possible with existing ultra precision machines and equipment.","title":"Partial Support of the Board on Physics and Astronomy","awardID":"9513610","effectiveDate":"1996-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["529598"],"PO":["125898"]},"15077":{"abstract":"Image Compression reduces the number of bits required to represent an image, and thereby allows image and video information to be stored more efficiently, or to be transmitted much faster from one place to another. Some compression methods degrade the quality of the image. This research involves designing compression methods which examine the content of an image in order to control or eliminate the degradation for some portions of the image. The intent is to increase the visual quality or scientific utility of the images. This work also involves the design of multiresolution methods for region-based image and video compression, and the development of novel methods for quality evaluation for such codes. Dividing an image into regions can allow a compression algorithm to employ different encoding strategies in different portions of the image, and can allow some regions to be represented at higher quality or finer resolution than others. Methods for segmentation, bit allocation, and code selection at different levels of resolution will be examined in the course of our investigations. The main objects of the education plan are to promote interactive and hands-on learning, to be highly accessible and supportive to students whom I advise, and to facilitate interdisciplinary as well as academic\/industrial discourse.","title":"Multiresolution Region-Based Image Compression","awardID":"9624729","effectiveDate":"1996-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["507609"],"PO":["564898"]},"15430":{"abstract":"This effort is funded as a Research Planning Grant (RPG). The availability of shared-memory, multiprocessor workstation clusters offers the opportunity for the simultaneous application of shared memory and distributed memory parallel processing techniques to a single problem. However, software systems that facilitate this dual-level parallel processing paradigm and allow the programmer, compiler, and run-time system to make the best use of the computational power offered by this platform are not yet available. The long-term goal of this research is threefold: (1) to provide a software system that furnishes advice regarding the partitioning methods and cluster configuration expected to yield the best performance, (2) to develop a communication library that handles both shared and distributed memory communications with a single syntax, and (3) to incorporate both the advisory system and the communication library into a data-parallel compiler that transparently handles interprocessor communication. During the research planning phase, which is being supported by this grant award, four initial steps toward the long-term research goals will be accomplished. (a) The computation and communication characteristics of the multiprocessor cluster will be characterized. (b) Mathematical models of performance of applications that exhibit stencil data dependencies will be developed. (c) The advisory system will be designed and implemented with the initial mathematical models. (d) The current body of research on shared memory and distributed memory communication libraries and data-parallel compilers will be surveyed to determine the best approach for developing the dual-level communication library and incorporating the library into existing compilers. ***","title":"A Software Support System for Parallel Processing in Multiprocessor Clusters","awardID":"9625959","effectiveDate":"1996-06-15","expirationDate":"1997-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[38970],"PO":[38971]},"15573":{"abstract":"9626425 Watson The University of South Carolina requests support from NSF for connection to SURANET. This grant will be used to help three campuses get access to the Internet. The three sites are USC Lancaster, USC Salkehatchie and USC Union. SURANET, a midlevel network in South Carolina, will provide operations management and information services and it provides access to the Internet, a collection of interoperable networks connecting most research and education organizations in the United States. The University of South Carolina campuses need the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the University of South Carolina system as well as the community in general.","title":"Connection of USC Lancaster, USC Salkehatchie and USC Union to SURANET and NSFNET","awardID":"9626425","effectiveDate":"1996-06-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["141762",39296],"PO":["121202"]},"15287":{"abstract":"9625557 Kuh This project will study learning models in noisy and changing environments. The environments are generally unknown and are learned through observation examples presented at discrete times. Previous research has modeled and analyzed how supervised learning algorithms (algorithms where inputs receive labels) behave when confronted with slowly changing environments. This research will continue to analyze the behavior of supervised learning algorithms, but will focus on more complex reinforcement learning algorithms. The primary objectives are to obtain a better understanding of reinforcement learning methods to problems in signal processing and communications. Two applications areas that are well suited to reinforcement learning approaches are sequential detection problems and networking problems. ***","title":"Interactive Learning in Noisy and Changing Environments","awardID":"9625557","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":["564726"],"PO":["563109"]},"15541":{"abstract":"9626327 Slattery The investigator and colleagues organize the Second Magma Conference on Computational Algebra. In the past few years a number of significant advances have taken place in several different branches of computational algebra and number theory. Because of the growing interdependence between the different branches, an algorithmic advance in one area often has a major impact on the performance of algorithms in other areas. Consequently, the meeting brings together workers from some of the key areas, including researchers working on software development as well as those using these tools. The conference is intended to inform algorithm designers and users of recent developments in cognate areas of computational algebra, number theory, and geometry and inform key theoretical mathematicians of the possibilities offered by the computational algebra tools that are now becoming available. It is also expected to identify desirable algorithm and software developments that would result in significant new applications in the near future. The conference promotes the use of the techniques of computational algebra in application areas such as digital signal processing, complex system design, network design, cryptography, coding theory and applied combinatorics. Algebra studies basic questions about discrete structure and symmetry in the world. Theoretical results from this branch of mathematics help chemists understand the spectra of organic molecules, physicists organize families of elementary particles, and engineers solve systems of equations. Algebraic invariants are used to answer biochemists' questions about knotting in DNA and anthropologists have even used algebraic classifications to organize native artifacts in the southwestern U.S. For many years mathematicians have studied algebra with little more than their imaginations and a pencil and paper. But now, computers allow researchers to work with larger and more complicated situations tha n were possible in the past. Computational algebra is the general title given to these research efforts. However, to use a computer in mathematical research requires the development of specialized software -- a task that can be time-consuming for the typical researcher. One way to address this need is through systems such as Magma which provide easy access to state-of-the-art algorithms in a number of fields of study. Another important process is to encourage researchers to share their experiences (and even software) through conferences such as this; the interaction at a conference often leads to adaptation of ideas and development of new directions. These tools enable theoretical researchers to explore more complicated situations, to gain insight in unfamiliar settings, and to compute answers to larger problems. Computer-based work on primality testing and factoring of large numbers is showing direct application to cryptography and security. Work in finite geometries and designs are providing improved techniques for error-detection and data compression. These have a large impact on everyone's use of computers and communications.","title":"Mathematical Sciences: Second Magma Conference on Computational Algebra; May 12-16, 1996; Milwaukee, WI","awardID":"9626327","effectiveDate":"1996-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[39222],"PO":["562372"]},"15288":{"abstract":"This project is exploring the cluster approach to symmetric multiprocessing, in which bus-based multiprocessors are interconnected using a more scalable network. Using the Tempest parallel programming substrate, the project is building clusters that extend the shared memory model with fast references to recently used locations across a cluster. The key issue is achieving good performance without resorting to extensive custom hardware. The project encompasses design and some implementation of a high-speed Tempest system that can: provide shared memory across a cluster; use cacheable control registers and queues for communication among processors and I\/O devices; and provide hardware acceleration of protocols. The project includes the development of programming tools and compilers that facilitate specification and verification of custom protocols, and use these protocols to hide latency.","title":"Tornado: Fine-Grain Distributed Shared Memory for SMP Clusters","awardID":"9625558","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["541915","541916",38619,"94533"],"PO":["179487"]},"15201":{"abstract":"This investigation builds new statistical artificial intelligence and reinforcement learning techniques for large-scale manufacturing operations. The primary scientific question it attacks is: How can machine learning be used to automate the decisions that a process engineer makes in monitoring, optimizing, and fine tuning processes? The products of the research are new algorithms for memory-based learning. Innovations include Bayesian locally weighted regression, Fast real-time learning response by means of multiresolution memory- base structures, novel model-selection search algorithms, and experiment design methodologies for memory-based approximators. In parallel with their development, these algorithms are being tested and deployed through several joint projects between the principal investigator's research group at CMU and two large US manufacturing companies. The economic impact of this research will be processes and factories that analyse their own datastreams in real time, develop increasingly improved models of themselves, and exploit those models.","title":"CAREER: Machine Learning for Autonomous Process Management","awardID":"9625255","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["473316"],"PO":["565227"]},"15377":{"abstract":"9625816 Farin, Gerald E Arizona State University CISE Postdoctoral Research Associate: Approximation of Complex Geometries and Data Reduction with NURBS This award supports associate Anshuman Razdan. At a high level, this research aims to develop a methodology for the computer representation of complex objects such as bone surfaces. Anthropologists and bio-medical engineers are restricted for lack of mathematical structure of data that can be analyzed, an example being the surfaces of bones. Computer Aided Geometric Design (CAGD) techniques will be applied to convert this unstructured data into a structured form. Dense point cloud data will be used to describe the discretized surfaces as a smooth parametric NURB (Non Uniform Rational B Spline) surface(s). Data reduction techniques will be developed to reduce the amount of data required to describe the surface(s). 3D tools will be developed to facilitate interrogation and analysis of these surfaces, to quantify measures such as curvature. The research will collaborate with a physical anthropologist at the new inter-disciplinary facility on campus, called PRISM. The surface models will also generate the STL (stereolithography format) files for 3D hard copy outputs on rapid prototyping machines. These can be used as tactile models for research into human morphology and the teaching of comparative anatomy and bio-engineering courses.","title":"CISE Postdoctoral Research Associate: Approximation of Complex Geometries and Data Reduction with NURBS; ES Postdoctoral Associate Anshuman Razdan","awardID":"9625816","effectiveDate":"1996-06-15","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["279394"],"PO":["297837"]},"15147":{"abstract":"This research explores systematic design methodologies to handle timing and communication in mixed synchronous - asynchronous designs. Formal and automated techniques for managing the design process multiple, independently synchronized domains on a VLSI chip are being developed. Specific research focuses on: mixed- timing design methodologies and components; specification formalism for mixed- timing interfaces, performance driven synthesis and technology mapping techniques for mixed-timing circuits; hierarchical timing verification techniques that check the validity of assumptions used for synthesis and technology mapping, and techniques to estimate and analyze system performance. The PIs research plan is coupled with an education plan. It provides: an environment to nurture students; open-ended problem solving skills; incorporated research activities for undergraduates; opens research opportunities to underrepresented groups; and develops industrial internships in the graduate research program.","title":"Design Methodologies and Tools for 1 GHz and Beyond","awardID":"9625034","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[38297],"PO":["321058"]},"15158":{"abstract":"This award supports a unified program of research and education in parallel input-output systems for high-performance computing. Research activities will include development of tools for I\/o performance evaluation, applying the tools to characterize I\/O performance of scientific codes, and provision of compiler support for parallel I\/O. Educational activities span the needs of graduate and undergraduate students, and include outreach to K-12 and the community. These include development of a graduate course, augmentation of undergraduate curricula, and workshops for participants outside the university.","title":"Performance Tools and Compiler Support for Parallel I\/O Systems","awardID":"9625083","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["554882"],"PO":["297837"]},"15279":{"abstract":"The goal of this project is to develop compilation techniques to support efficient machine-independent programming of high-performance multiprocessors through implementation of COSMIC, the \"Communication-Optimizing, Shared-Memory Integrated Compiler.\" To achieve high performance, COSMIC will apply optimizations for locality, synchronization, communication, and memory system effects. COSMIC follows two basic guidelines. First, it uses compilation techniques for message-passing machines to retain most of the benefits of explicit messages. Second, it exploits architectural and operating system support available on shared-memory multiprocessors to improve flexibility and performance. A novel characteristic of COSMIC will be its ability to take advantage of the multiple coherence protocols and hybrid message-passing support found in software Distributed -Shared-Memory (DSM) systems and Flexible-Shared-Memory system (FSM) machines. To evaluate the impact on the performance of scientific applications, COSMIC will be tested on programs from benchmark suites such as Perfect, NAS, SPEC, and SADIE, as well as representative applications (e.g., CHARMM, MOLDYN, DSMC, EULER, NRL Flame) from fields such as computational chemistry, computational fluid dynamics, and computational combustion.","title":"Career: Efficient Machine-Independent Programming of High- Performance Multiprocessors","awardID":"9625531","effectiveDate":"1996-06-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["157565"],"PO":["179296"]},"870":{"abstract":"This is the 1st-year of a 3-year continuing award. The objective of this research is to widen the currently narrow `information pipeline` between humans and machine learners; instead of solely providing labeled training examples to the learner as is typically done, the algorithms being designed also allow humans to provide broadly applicable advice regarding the task at hand. The human advice-giver does not have to understand the machine learner's internal representations and algorithms, nor does the provided advice have to be completely correct or fully explicit. The algorithms being developed use techniques from connectionist reinforcement learning to (slowly) learn from the feedback provided by the learner's environment. The advice-giver observes the machine learner's decision making and occasionally makes suggestions, expressed as instructions in a simple programming language. Based on techniques from the field of knowledge-based neural networks, the advice is inserted directly into the agent's knowledge base. Importantly, the learner can subsequently refine the assimilated advice both by neural training based on further experience and additional advice from the human advisor. This work promises to simplify the interaction between humans and machine learners, and may lead to flexible, adaptive software that tunes itself to specific users via this project's flexible advice-giving framework.","title":"Learning from Instruction and Experience","awardID":"9502990","effectiveDate":"1996-06-01","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["284903"],"PO":["54008"]},"17876":{"abstract":"The objective of this work is to provide a capability of obtaining a significantly increased resolution for abnormal foci (tumors and knots) in cellular biological tissues by ultrasonic detection. An ultrasonic transducer array with special electroding is to be designed, tested and its operation evaluated. This work will look at the electrode patterns and the measurement of the actual beam characteristics using a biological phantom. Electronic circuitry will be developed for increased sensitivity in data acquisition and detection.","title":"Detection of Differential Sonic Energy Reflection by Soft Tissues","awardID":"9634543","effectiveDate":"1996-06-15","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["210648"],"PO":["564898"]},"15104":{"abstract":"For many years, the poor design of interactive systems has been attributed to insufficient communication between developers and end users. Usability practices from the field of human-computer interaction are not currently integrated into the theory and practice of software engineering. This research project pursues three objectives: 1) developing a model of software development as a process of on-going communication; 2) providing support for this model through active mechanisms in software tools; and 3) improving the accessibility and acceptance of usability methods by software practitioners. In general, the objectives reflect a process and philosophy of human-centered software development. Active support is being investigated through a mechanism called expectation agents. Expectation agents are software mechanisms that monitor the usage of prototype systems and detect mismatches between actual usage and developers' design assumptions or expectations. Such breakdowns are opportunities for communication which make explicit the expectations of both developers and end users. Expectation agents serve as a test vehicle for supporting on-going communication in software development, for adapting usability practices to software practice, and for reinforcing developers' understanding of human-computer interaction. This research proceeds along three dimensions: theoretical, technical, and empirical. The research is developing a model of ongoing communication in software development, refining models of the software processes involved in developing interactive systems, and improving understanding of usability methods for workplace settings. In the technical dimension, the research provides new algorithms and representations for capturing and communicating design intent and active mechanisms such as expectation agents to operate over design intent. These mechanisms involve both formal and semi-formal representations. The empirical component includes a critical analysi s of the approach as a means of gathering usability information and supporting communication in systems development. This CAREER research project also addresses the software engineering curriculum. First, the work seeks to improve the curricula for educating software engineers in the methods of human-computer interaction. Second, adoption of systematic practice is aided by tools and methods. The research project seeks to meet this need by adapting and, where possible, automating usability methods for software engineering. ***","title":"CAREER: Improving the Design of Interactive Software","awardID":"9624846","effectiveDate":"1996-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["483634"],"PO":["150697"]},"7091":{"abstract":"This research explores methods for increasing the autonomy and reliability of spacecraft and space robotic systems by using a new class of adaptive, dynamically structured, neural networks. Similar to strategies observed in human adaptive motor control, the networks are used to develop flexible, compact models of the robot, its payload, and the environment in which they interact; these adaptive models are then used to modify the low level motion control program so as to ensure efficient, high performance operation. There are three main objectives to the proposed research. The first is to extend neural control designs for fixed-base robots to dynamically more complex space robotic systems. The second is to systematically investigate methods for dynamically varying the amount of computation performed by the network, attempting to simultaneously achieve high performance with minimum complexity. By combining techniques from wavelet analysis and nonparametric estimation with nonlinear dynamical stability theory, it is hoped to develop a general methodology for designing network structure adaptation mechanisms which achieve a prespecified complexity\/performance tradeoff. The final goal is to implement the resulting controllers on prototype space robots operating in neutral buoyancy simulation, and to evaluate their performance on baseline mission operations.","title":"Real-Time Learning Controllers for Enhanced Autonomy and Reliability of Space Robots","awardID":"9530808","effectiveDate":"1996-06-15","expirationDate":"1998-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":[17394],"PO":["335186"]},"14730":{"abstract":"This research project is to investigate adaptive and nonlinear methods for the solution of certain large and often ill-posed inverse problems, where the solution may not depend continuously on the data. The particular applications addressed concern large scale adaptive filtering computations, such as in active noise control, and nonlinear and adaptive image enhancement computations. The project is using a 400 node IBM SP2 at the Maui High Performance Computing Center. This particular facility specializes in image and signal processing applications. The project includes the following topics: - Fast and stable adaptive algorithms for estimation and filtering, along with sensitivity analysis, with applications in signal processing. - Nonlinear and adaptive image enhancement methods, including Total Variation minimization involving partial differential equations, adaptive multi-level segmentation-based methods, and a combination of these two approaches. - Coupling numeric and symbolic computations. - Parallelization of the algorithms. The project has strong educational and REU research components, and includes participation by underrepresented minorities.","title":"Adaptive and Nonlinear Methods in Signals and Imaging","awardID":"9623356","effectiveDate":"1996-06-15","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"9171","name":"SCIENCE AND TECHNOLOGY CENTERS"}}],"PIcoPI":["69381","86249"],"PO":["187585"]},"14972":{"abstract":"This project focuses on the uses of randomization, with particular emphasis on graph algorithms. In particular, the problems to be ``tackled''(but not necessarily exactly solved) by the PI's randomized graphical optimization techniques include: (1) The maximum flow and minimum cut problems can be solved exactly, with the major objective being the design of faster, simpler and more practical algorithms for arriving at a correct answer; (2) Graph coloring and bisection, analysis of network reliability, and construction of low-cost high-connectivity networks, are extremely hard to solve exactly, with the major objective being to find efficient algorithms that give answers as close as possible to the elusive optimum. Implementation and testing of the algorithmic solutions is an integrated component of this project. The Integrated Educational Plan of this CAREER Grant includes the teaching, improvement and development of theoretical computer science courses, including: (1) Undergraduate algorithms course; (2) Undergraduate discrete mathematics course; (3) Graduate randomized algorithms course; (4) Undergraduate information retrieval and text databases.","title":"CAREER: Randomization in Graph Optimization Problems","awardID":"9624239","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["486265"],"PO":["150516"]},"15105":{"abstract":"The research component of this program has two major thrusts: 1) an investigation of the mathematical and computational aspects of the multiframe, bilinear image- recovery problem; and 2) the development and application of solutions for problems in the areas of high-resolution transmission electron microscopy, and ground- and space-based astronomy. Theoretical advances in this program are providing a unified approach to many imaging problems in which intensity data are recorded, including those for which satisfactory solutions have not been previously discovered. Collaborations with materials scientists on problems such as the study of atomic scale processes in solid batteries are providing exciting applications for which new methods developed in this program are being used to enhance the resolving and information-gathering powers of electron microscopes. Through the teaching component, an educational program is being established with emphasis on 1) the development of a multidisciplinary laboratory in which faculty and students from many departments jointly explore problems in remote sensing and imaging; 2) the development of multidisciplinary courses in remote sensing and imaging in which students from many departments are included, and the educations goals for each student - ranging from theoretical foundations to specific applications - are tailored to his or her individual needs; and 3) the use of a strong research-teaching exchange in which cutting-edge technology is used in the classroom and laboratory as a tool to excite, motivate, and retain enthusiasm in the students","title":"Integration of Image Processing Education and Research","awardID":"9624849","effectiveDate":"1996-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["201638"],"PO":["564898"]},"11794":{"abstract":"9612387 Chung This award provides partial support for speakers and participants in \"A Combinatorics and Graph Theory Conference on the Occasion of Herb Wilf's 65th Birthday,'' to be held at the University of Pennsylvania on June 12-15, 1996. Topics will include combinatorial identities and enumeration, combinatorial structures, and graph theory, with roughly one day devoted to each topic. This conference is in the general area of Combinatorics. One of the goals of Combinatorics is to find efficient methods of studying how discrete collections of objects can be arranged. The behavior of discrete systems is extremely important to modern communications. For example, the design of large networks,such as those occurring in telephone systems, and the design of algorithms in computer science deal with discrete sets of objects, and this makes use of combinatorial research.","title":"Mathematical Sciences: A Conference in Combinatorics and Graph Theory; June 12-15, 1996; Philadelphia, PA","awardID":"9612387","effectiveDate":"1996-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[30002,30003,"452845"],"PO":["125624"]},"14962":{"abstract":"Heterogeneous parallel systems incorporate diverse models of parallelism within a single machine or across machines. These systems provide high performance for large, diverse applications. Heterogeneity unfortunately complicates software development. Users currently hand parallelize each task for each architecture. These programs are not portable and must be recoded if changes occur (e.g., machines are added or removed). The user is also burdened with performing the appropriate optimizations to achieve high performance. A compiler can solve these problems. The most important advantages of a compiler based approach are: (1) Portability and Ease of Use: Users program the appropriate model of parallelism for their algorithms. The compiler automatically maps them on to the specifics of the available architectures. (2) High Performance: The compiler optimizes with aggressive, target specific optimizations and coordinates diverse hardware to achieve excellent performance. To manage heterogeneity the compiler must: target diverse architectures, adjust optimization strategies to suit targets, exploit run-time changes in machine availability, and allow languages to evolve. The objective of this research is to investigate a compilation system to support these requirements. The system will use an innovative compiler organization and representations in order to provide the flexibility that heterogeneity requires. This project concentrates on the design and implementation of this compiler infrastructure. The system will be used to investigate automatic parallelization and partitioning strategies for a heterogeneous target. It will address issues such as how to map programmer models of parallelism on to the corresponding machine and how to further optimize it for total system performance. This compiler-based approach will provide an infrastructure capable of performing the advanced dynamic and static optimizations that heterogeneous systems demand for high performa nce. ***","title":"CAREER: Compiling for Heterogeneous Systems","awardID":"9624209","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["519591"],"PO":["250083"]},"14984":{"abstract":"This project is building a high-performance distributed storage system using communication switches and workstations. Data to be stored will be distributed across the workstations and will be retrieved using the communication network between the workstations. Research issues to be addressed include identification of hardware and software bottlenecks, limits to system scaling, scheduling of multimedia I\/O in a distributed system, and the implications of I\/O on switch architecture. Education is a part of this project; plans include a graduate course on I\/O systems, an undergraduate laboratory in computer architecture, and use of the machine developed during the research as a testbed for the graduate course.","title":"Scalable Storage Server for Multimedia and Scientific Applications","awardID":"9624310","effectiveDate":"1996-06-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["550709"],"PO":["549626"]},"14842":{"abstract":"The research objective is to develop methodologies for the design of giga-scale CMOS systems. A focus is high bit rate digital communications. The approach transcends boundaries between algorithmic, architectural, logic, circuit and technological aspects of the VLSI design methodology. The research has two parts. The first is an investigation of fundamental limits on power area speed and reliability in giga-scale computation. Activities include: (a) establishing non-empirical and achievable bounds on the power dissipation, area, speed and reliability for any given algorithm and implementation technology' and (b) exploring methods to achieve these fundamental bounds. In the second part, algorithms, architectures, and systems for design of high-bit rate communications systems are being investigated. Activities include: (a) developing power, area, and speed-optimal VLSI algorithms and architectures for high-bit rate digital communications and signal processing applications; and (b) building communications and signal processing applications; and (b) building practical systems for 155.52 Mb\/s transmission over twisted-pair wiring for ATM and IMTV, and wireless spread-spectrum systems.","title":"Design of Giga-Scale CMOS Communications Systems: An Integrated Approach","awardID":"9623737","effectiveDate":"1996-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["348133"],"PO":["564898"]},"17835":{"abstract":"","title":"Conference on Experimental Research in Computer Science, June 20-21, 1996, Arlington, Virginia","awardID":"9634389","effectiveDate":"1996-06-01","expirationDate":"1996-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["346688"],"PO":["549626"]},"15019":{"abstract":"The project investigates issues in memory hierarchy design and proposes solutions to bridge the increasing performance gap between the processor and memory. By observing the unequal time needed to perform cache tag access\/comparison and to access cache data, this path imbalance can be exploited to achieve a more performance optimal cache design. The basic idea is to use an additional tag array record the status and location of the recently used lines in the cache data array. By recording the cache line locations in this subset of the tag array, the data access is decoupled from the tag access\/comparison path for a shorter overall cache access time. In a multiprocessor system, cache coherence activities incur extra traffic to the heavily-loaded snooping bus and impose additional latency in accessing the data. By observing that references to the same memory location are often ordered at the software level, frequently rendering cache coherence activities are unnecessary and can be deferred until at the proper synchronization point. The infrastructure required, including a multiprocessor tracing facility, multiple-issue out-of-order execution processor models, and various memory hierarchy models, will be developed in this project. These tools will be enhanced with graphical user interfaces and used for instructional purposes to provide students with hands-on experience in evaluating difference architectural design tradeoffs.","title":"Decoupling and Reforming Tag and Data Arrays for High-Performance Memory Hierarchy Systems","awardID":"9624498","effectiveDate":"1996-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["485309"],"PO":["197478"]},"16549":{"abstract":"9629998 Schorr This Award covers international travel for one year for the User Services Area Director of the Internet Engineering Task Force (IETF). The User Services Area provides an international forum fro people interested in all levels of user services to identify and initiate projects designed to improve the quality of information available to meetings, to Budapest for the Joint European Networking Conference, and to Bled, Slovenia to participate in the TERENA Information Services and User Support meeting and attend the Network Services Conference. Trip reports are published in the Internet Monthly Report.","title":"International User Services Area","awardID":"9629998","effectiveDate":"1996-06-01","expirationDate":"1997-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["427568"],"PO":["57343"]},"14965":{"abstract":"The area of transaction processing in multilevel secure (MLS) database management systems (DBMSs) has substantially progressed in the past few years. Despite this activity, research in this area has been limited to traditional transaction concepts. Moreover, even for traditional transaction models, existing solutions for secure transaction processing are not completely satisfactory. This research (1) investigates the impact of multilevel security constraints on transaction processing in advanced database applications, and (2) examines whether the properties of the advanced transaction models, in particular nested transaction models, can be utilized to solve the secure concurrency control problems in traditional databases. It develops multilevel secure workflow and multilevel secure long duration transaction models, and the necessary extensions to the nested model required by MLS DBMSs. The results of this project enable incorporating multilevel security in advanced database applications such as process modeling, engineering design and long-running activities, and provide efficient secure transaction processing protocols for conventional database applications. Besides MLS databases, the results of this work are directly useful in other non-secure database environments such as hierarchically decomposed databases. The education plan includes development of three new courses at undergraduate and graduate level and student involvement in this research.","title":"CAREER: Supporting Workflow, Long Duration and Nested Transaction Models in a Multilevel Secure Database Environment","awardID":"9624222","effectiveDate":"1996-06-01","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["543481"],"PO":["563751"]},"14878":{"abstract":"A user-callable geometry library in C++ will be developed. The software package will include documented C++ libraries, a user manual, sample drivers, and sample data sets. It will be distributed on the Internet and diskette and announced through conferences and publications. Implementation in C++ will make the software accessible to the computational geometry community and to an increasing number of programmers in scientific computing. The library can advance science and engineering by reducing software development time for its users. The library is small enough to be completed quickly, yet provide a basis for future expansion. The project will encompass the four layers identified for geometry libraries, namely, geometric primitives, algorithms, support environment, and applications. The support environment will include sample drivers, sample data, and an interface to Geomview, the visualization software from the Geometry Center at the University of Minnesota. ***","title":"A Prototype Object-Oriented Geometry Software Library","awardID":"9623854","effectiveDate":"1996-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["255231"],"PO":["187585"]},"17727":{"abstract":"The traditional approach to building and maintaining a system is to build an initial system and then deploy it. Over time, end users identify certain performance `inadequacies` or `inconveniences` in the initial system. These problems are reported back to the system designer, who collects them, regularly rebuilding the system with `improved` performance. A problem is that the design of the system never exactly fits the task environment. The reason for this is in large part due to the pragmatic relations between system, data, and user. In the standard adapted system, information is being gathered about the user which is used to modify the interface. The goal of this research is to develop a methodology for building systems that evolve based on the particulars of a specific data set. A method of system adaptation will be explored that is based on the history of usage of the system for a given task. With each transaction, the system acquires information about the interaction between the user and the system that is subsequently used to adjust the problem-solving behavior of the user\/system as it applies to that particular data set. These ideas will be developed as they apply to the construction and evolution of an online manual system. The results of the study will be incorporated into a methodology for building systems that automatically evolve to the specifics of their task environment after they are deployed.","title":"The Pragmatics of Using an Online Manual","awardID":"9634102","effectiveDate":"1996-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["140100"],"PO":["183208"]},"14538":{"abstract":"The overall objective of the research is the investigation of architectural features for cost-effective, mainstream computing based on multithreading. In this vein, this research will focus in two directions; investigation of multithreaded dataflow paradigm, and the adaptation of the results to hybrid dataflow-von Neumann architecture. The dataflow model is ideally suited for multithreaded architecture since it facilitates instruction level context switching and fine-grained parallelism. A clear understanding of the issues in supporting multiple threads in dataflow environment will permit us to adapt them to hybrid dataflow\/control flow architectures. Hybrid systems present the most interesting opportunities in the area of multiprocessing - they directly address problems that will be faced by future superscalar processors, such as long memory latencies, context switching overheads, multiple active instruction streams, fast and efficient support for task synchronization. Initially, this project will investigate the use of cache memories for multihreaded dataflow architecture, and compiler techniques for improving the performance of such machines. This project will then study architectural support for multithreading including support for thread management, thread scheduling, communication and synchronization among threads. Simultaneous multithreading in the context of dataflow and hybrid architectures will then be investigated. Finally, this project will explore the suitability of the most significant architectural features for use with convectional RISC technology.","title":"Research in Multithreaded Dataflow and Hybrid Architectures","awardID":"9622836","effectiveDate":"1996-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["383676"],"PO":["197478"]},"6030":{"abstract":"This three-year award will support U.S.-France cooperative research in parallel computing between research teams at the University of Tennessee and at INRIA's Rhone\/Alps campus (French National Institute for Research in Computer Science and Applied Mathematics). The teams include Jack Dongarra on the U.S. side and Jean-Pierre Verjus, Yves Robert and Bernard Tourancheau in France. The objective of their research is to provide a software environment for the development of portable parallel programs on multicomputers and heterogeneous networks. They propose to develop efficient algorithms for library routines on distributed-memory multicomputers. This effort will involve implementation and experiment of codes and tools, and complexity analysis. The project takes advantage of U.S. and French complementary expertise and will benefit from French advances in software for parallel processing. The project may result in a set of tools for the development of portable data parallel programs.","title":"U.S.-France (INRIA) Cooperative Research: Tools for Port- able and Efficient Parallel Scientific Software","awardID":"9527339","effectiveDate":"1996-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["558550"],"PO":["323582"]},"7141":{"abstract":"This award supports the development of a computationally explicit theory of operant conditioning, in which animals determine the effects of their actions and adjust their behavior to maximize reward. The Rescorla-Wagner model of classical conditioning and its various descendants have yielded considerable insight into how associations between sensory stimuli andreflex actions may be acquired. But operant conditioning evokes more complex and deliberate behavior patterns, for which there is no comparable computational model. The theory being developed includes four types of learning: (i) on-line learning of reward predictors based on observed reinforcement contingencies, (ii) acquiring secondary reinforcers, such as the sound of a food dispenser being activated, (iii) generating new actions by selecting and shaping innate behaviors, and (iv) refining perception to focus on task-relevant signal discriminations. In addition to testing the theory with computer simulations of classic animal learning experiments such as the Delayed Match to Sample task, the theory is being embodied in an RWI B21 mobile robot. This research promises a new class of learning robots that can interact with people in much the same way that animals interact with their human trainers","title":"A Computational Theory of Operant Conditioning with Application to Trainable Robots","awardID":"9530975","effectiveDate":"1996-06-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["502937"],"PO":["565227"]},"4392":{"abstract":"This award supports the travel of 12 Americans to a U.S.-Western Europe workshop on iterative methods at CERFACS in Toulouse, France, June 11-14, 1996. This is one of four workshops associated with the International Linear Algebra Year. The organizers are Gene H. Golub of Stanford University and Iain Spencer Duff of the CERFACS Parallel Algorithm Group and Rutherford Appleton Laboratory. The workshop brings together scientists from academe (including graduate students and postdoctoral researchers), government and industry. They will collaborate on practical and theoretical problems on key topics in linear algebra. The workshop on iterative methods will emphasize Krylov methods for unsymmetric problems, domain decomposition methods, multigrid methods and parallel computing. The objective is to develop faster and more robust iterative solvers for large-scale computer simulations.","title":"U.S.-Western Europe Workshop: Iterative Methods, June 11- 14, 1996, Toulouse, France","awardID":"9515499","effectiveDate":"1996-06-15","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}}],"PIcoPI":["320271"],"PO":["323582"]},"7010":{"abstract":"Generic problems of image understanding in the context of reconstructing the 3D visual environment with uncalibrated cameras are to be investigated using tools of modern statistics. These generic problems also raise challenging questions in statistics requiring analysis of real data of uncommon types not ordinarily found in the statistical literature. Introduction of robust estimators into computer vision led to a significant performance improvement. The currently popular estimators, however, are not optimal for image data since they tend not to be simultaneously efficient locally and with high breakdown points. Realistic models of noisy data should take into account the distributions arising from the image formation process, as well as the presence of errors in all the feature coordinates not only in the measurements. Redefining image understanding tasks as statistical problems, offers additional insight which can be converted into new algorithms with superior performance. The goal of this research is to exploit recent progress in statistics for the advance of computer vision, and to use the real problems of image understanding as a testing ground and catalyst for novel statistical methods.","title":"Statistical Problems in 3D Structure Recovery","awardID":"9530546","effectiveDate":"1996-06-15","expirationDate":"1999-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["415854","317592","124371"],"PO":["475621"]},"6274":{"abstract":"IRI-9528115 Tilbury, Dawn University of Michigan $18,000 - 12 mos Intelligent Controll of an Autonomous Flying Vehicle Intelligent Control of an Autonomous Flying Vehicle This award funds a one-year research planning grant. The goal of this research project is to explore research problems in intelligent contrml and robotics. For this purpose, a completely autonomous flying robot will ultimately be built which can carry out simple tasks within its environment. The issues under investigation include developing a theoretical framework for the interface between the two levels of controllers, incorporating a learning algorithm within the task planner to improve its performance as it becomes more experienced in its environment, and integrating the sensor data with the different controllers to achieve automatic obstacle avoidance while insuring that the goal is reached. The extra degrees of freedom of a flying robot both increase its maneuverability and make it more difficult to control. In contrast to a terrestrial-based robot, a helicopter must always be under automatic control. It can never stop in place, evaluate its current surroundings, compute a new path, and then continue its mission. It is not statically stable, and the dynamic stabilization problem is known to be hard. If these difficulties can be overcome through intelligent control, the result will be a highly-flexible, extremely maneuverable autonomous system.","title":"Intelligent Controll of an Autonomous Flying Vehicle","awardID":"9528115","effectiveDate":"1996-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["502459"],"PO":["475621"]},"11912":{"abstract":"The Information Theory Workshop will be held in Haifa, Israel June 8-13, 1996. Papers will present new results in the following areas: source coding, Shannon theory, cryptography and security, detection and estimation, statistics and information theory, coded modulation, convolutional and block codes, network information theory, communication techniques and models. The Information Theory Workshops constitute a longstanding series of distinguished meetings, tracking and furthering progress in the field of Information Theory. 55 regular papers are scheduled for presentation. There will also be a recent-results session. A plenary address will be given by Prof. Jacob Ziv, foreign member of the U.S. National Academy of Engineering, and president of the Israeli Academy of Sciences. Travel support for up to seven U.S. participants is requested. Highest priority will be given to young researchers who are presenting papers and invited speakers, all from US institutions. The travel reimbursement will be arranged through the IEEE.","title":"1996 IEEE Information Theory Workshop; June 8-13, 1996; Haifa, Israel","awardID":"9612763","effectiveDate":"1996-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":[30278],"PO":["40607"]},"15949":{"abstract":"9627760 Wilson David B. Wilson will receive his doctoral degree from the Massachusetts Institute of Technology and will pursue research under the guidance of Alistair J. Sinclair at the University of California at Berkeley. The research is on the development and analysis of algorithms which use the theory of Markov chains to produce random samples from large, finite sets. %%% The Mathematical Sciences Postdoctoral Research Fellowships are awards to recent recipients of doctoral degrees in the mathematical sciences. These awards are a means of contributing to the future vitality of the scientific effort of the nation. As researchers in the mathematical sciences expand their interactions with other disciplines, and as the interplay increases between the various areas of mathematics itself, opportunities for postdoctoral research and training are becoming increasingly important. The Fellowships are designed to permit awardees to choose research environments that will have maximal impact on their future scientific development. The fellowship is designed to provide 24 months of support divided into 18 academic-year months and three periods of two summer months. The recipient may choose (1) the Research Fellowship option which allows for full time support for any 18 academic year months in a three year period, in intervals not shorter than 3 consecutive months or (2) the Research Instructorship option which allows the 18 months of academic year support to be taken as nine months of full time support and 18 months of half time support. Not more than two months of summer support from this Fellowship may be received in any calendar year. ***","title":"Mathematical Sciences Postdoctoral Research Fellowships","awardID":"9627760","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["373254"],"PO":["313600"]},"6760":{"abstract":"This research is developing a metapattern-based discovery loop for integrated data mining. Metapatterns (also known as metaqueries) are second-order, declarative expressions that specify the types of patterns to be discovered and assist humans in focusing on more fruitful search directions. The discovery loop is a search engine that integrates deduction, induction, and external guidance from humans, as well as internal guidance of inter-component dependencies. Given a completely new database, the system first generates an initial set of the most general metapatterns based on the meta-information of the database, and then executes these metapatterns against the database to discover actual patterns. Based on the results, new metapatterns are dynamically generated by adding more constraints to the more plausible metapatterns. In this iterative process, human discovers can analyze, create, select, and execute metapatterns, or instruct the system to pursue metapatterns on its own. This ability not only makes the process of data mining more efficient and productive (the more expert users can use the system for inspiration of better metapatterns, and the less expert users can learn how to perform data mining in a particular domain by observation), but also provides a new method for unsupervised learning of probabilistic, relation-based patterns.","title":"A Metapattern-Based Automated Discovery Loop for Integrated Data Mining","awardID":"9529615","effectiveDate":"1996-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["202092"],"PO":["563751"]},"6331":{"abstract":"This research explores the relationships between models used to refine the system design, to assess the real-time behavior of the system, and to assess the fault tolerance. these relationships are being combined to develop tools for system- level modeling with dependability analysis of the design. The approach builds on two recently developed tools, ADEPT (Advanced Design Environment Prototype Tool) and DREDD (Dependability and Risk Evaluation using Decision Diagrams). Advanced techniques for dependability analysis of embedded computer systems are being put into the ADEPT design environment. There, a dynamic fault tree model is automatically generated from the ADEPT system design model. The fault tree models uses a combination of Markov techniques, combinatorial approaches and binary decision diagrams. It can model permanent and transient hardware faults, unrelated and related software, automatic recovery and reconfiguration management, sequence dependencies and other dynamic behavior.","title":"Innovative Dependability Analysis Techniques in an Advanced Design Environment","awardID":"9528258","effectiveDate":"1996-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["229722","385690"],"PO":["321058"]},"5044":{"abstract":"9522301 Cypher MIMD (Multiple-Instruction-Stream, Multiple-Data-Stream) parallel computers are naturally asychronous. Many MIMD computers use a separate clock for each processor in order to avoid clock skew problems. Furthermore, even if all the processors use a common clock, the timing of commulication events is not known in advance due to factors such as data dependent processing times, processor interrupts and variable network congestion. This asynchrony has a major impact on the design of the machine's communication sub- system the semantics of the programming model, and the creation of parallel algorithms. This research studies principles for the design and use of asynchronous parallel computers. Specifically, three key areas of asynchronous parallel computing are studied. 1. specifying the semantics of message-passing, shared memory, and other, novel, programming models. 2. Creating efficient communication protocols that implement the above programming models, and 3. evaluating metrics and models for the design of algorithms for asynchronous parallel computers. This research will result in more efficient communication in MIMD machines, novel techniques for reasoning about and using asynchronous parallel computers, and a better understanding of how the theoretical community's body of knowledge in parallel algorithms can be applied to real machines. ***","title":"Principles and Mechanisms for Asynchronous Parallel Computing","awardID":"9522301","effectiveDate":"1996-06-01","expirationDate":"1997-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["13627"],"PO":["74434"]},"7079":{"abstract":"This research is primarily aimed at robustly locating deformable structures\/objects of approximately known shape from natural images. The problem of locating and recognizing underlying object structures in an image is of importance in many image analysis and computer vision applications including robot vision, pattern recognition and biomedical image processing. Algorithms that can reliably perform these basis tasks are at the core of a variety of systems that will permit humans to more effectively interact with pictorial data for the purposes of visualization, analysis, control or, as in the case of image database systems, retrieval of task-specific information within these applications areas. The robust identification and measurement of such structure is not always achievable using a single analysis technique that depends on a single image derived source of information. This is especially true when one is dealing with a wide range of images obtained under different conditions having different image content. The approach in this research project utilizes two different sources of image-derived information: 1.) gray-level gradients and ii.) homogeneity of intensity or texture elements, etc., as well as model-based information (i.e approximate object shape). Furthermore, two different processing methods are combined in this approach, in order to integrate the above-mentioned information sources: a) regionbased methods, which are primarily based on homogeneity properties and b.) boundary methods which capitalize on both gradient (imagederived) and shape (model based) properties. A game theoretic framework will be used, where, unlike the global objective approach which is widely used as an integration method in computer vision, the modularity of the underlying objectives are retained. The integration problem is then framed as a family of coupled and coex isting objectives whereby the output of one module depends upon the previous outputs of the other modules. This effort will build on initial work which has been able to locate structure in two dimensional images. It will also extend the concept to analyzing three dimensional image data. Both theoretical and experimental investigations will be carried out regarding the applicability and the limits of the approach.","title":"An Integrated Method for Simultaneous Recognition and Segmentation of Deformable Objects","awardID":"9530768","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["436917",17359],"PO":["475621"]},"7421":{"abstract":"This project will develop new methods for numerically modelling incompressible fluid flows of the type that appear in global environmental modelling problems. The proposed models are hyperbolic and dispersive vertically-averaged models of stratified incompressible flow which are derived from the Navier-Stokes equations. These models reduce three-dimensional models to a system of complex two-dimensional models, which promise greater numerical efficiency. However, the averaged models are not well posed for some interesting ranges of their parameters. Consequently, their instability and regularization must be investigated. This analysis, along with the discretization of the continuum equations, the accuracy and stability analysis of the discrete problems, and the coding of the discrete equations are all algebraically complex, so the use of computer algebra will play a critical role in this project. The results of the project can be used for the global modelling of the ocean, the atmosphere, and other complex environments. The current codes implementing detailed models of such environments require computational resources that tax even the largest computers. The goal of this project is to produce new models and numerical methods for their solution which would represent a significant improvement in efficiency and accuracy over existing models for some important applications. ***","title":"Symbolic Computing and Dimensionally Reduced Models of Fluid Flow","awardID":"9531828","effectiveDate":"1996-06-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485507"],"PO":["187585"]},"9896":{"abstract":"9600328, PI-Schlichting: This award supports the collaboration of Dr. Richard D. Schlichtilg of the Department of Computer Science at the University or Arizona, and Dr. Sigeo Ihara of the Intelligent Systems Department at Hitachi Ltd.'s Central Research Laboratory (CRL). Funding from the project will allow Dr. Schlichting to spend one year in Japan in residence at CRL collaborating with Dr. Ihara on issues in heterogeneous high performance computing. Dr. Schlichting will contribute a computer science perspective to the project based on his long-standing research effort to develop software support for heterogeneous high performance applications. Dr. Ihara will contribute an application perspective, a demonstrated need for interconnecting heterogeneous scientific simulations, and a prototype middleware system for interconnecting such simulations. The combined expertise will facilitate improvement in the techniques and the underlying software support needed to allow computational scientists to deal with heterogeneity in high-performance computations. This proposal brings together research scientists working in the area of high-performance computing. The U.S. scientist will have the opportunity to become familiar with application requirements, research techniques, and high-performance computing equipment at CRL, while contributing to their efforts in heterogeneous computing. Therefore, this proposal fulfills the objectives of the Program in using international collaboration to facilitate the exchange of scientific knowledge.","title":"NSF-CGP Fellowship: Issues in Heterogeneous High Performance Computing","awardID":"9600328","effectiveDate":"1996-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"8270","name":"JAPAN-U.S. FELLOWSHIPS PROG-RE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["118484"],"PO":["500946"]},"6300":{"abstract":"This is a research planning grant developing modeling and simulation aigorithms to assess system performance and to recreate events so as to interpret cause- effect relationships. The research planning activities focus on investigating the potential for developing accurate, general purpose modeling techniques that include compressing multiple experiments (variations of effects on the model) while allowing internal observation to expose the perturbations that caused the outcome. The grant resources are being used to contact other researchers involved in related efforts; and to investigate issures involved in expanding existing concurrent algorithms to areas beyond digital logic modeling and experimentation.","title":"Compression and Interaction Algorithms for Modeling and Simulation Environments","awardID":"9528194","effectiveDate":"1996-06-15","expirationDate":"1997-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["461118"],"PO":["321058"]},"5596":{"abstract":"This research focuses on developing the scientific foundation and implementing practical tools for optimizing and synthesizing rule-based expert systems to meet specified response time constraints. Real-time rule-based expert systems are embedded artificial intelligence systems increasingly used in safety-critical applications such as airplane avionics, medical monitoring instruments, smart robots, and space vehicles. In addition to functional correctness, these systems must also satisfy stringent timing constraints. The result of missing a deadline in these systems may be catastrophic. If a given rule-based system cannot deliver an adequate performance in bounded time, then it has to be optimized or resynthesized. The first part of the project investigates several approaches (state-space-based and semantics-based) for optimizing the rule base of expert systems. The second part of the project investigates the optimization of the match phase, which has a highly unpredictable runtime. The development of a systematic methodology to tackle the optimization problem opens up new avenues to further enhance the runtime performance of rule-based systems in time-critical environments. This technology will play a key role in tomorrow's complex information and computing systems such as multimedia tools, virtual reality systems, smart robots, and high-bandwidth networks, where an intelligent interface is essential and time becomes an increasingly critical resource.","title":"Optimization of Real-Time Rule-Based Expert Systems","awardID":"9526004","effectiveDate":"1996-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["518598"],"PO":["563751"]},"7147":{"abstract":"The goal of this research is to develop appearance-based representations of three-dimensional scenes that permit images corresponding to a continuous range of views of the scene to be synthesized by adaptively combining a set of basis images. These steerable appearance models analytically model the effects of a moving camera on scene appearance. The approach is based on decomposing scene appearance into three separate components: epipolar motion, visibility, and photometric properties, which together determine how the scene will appear from arbitrary viewpoints. Each component is represented and steered independently before being combined to produce views of the scene. The components are directly computable from the basis images under certain conditions, avoiding traditional difficulties caused by ill-posed problems and complex 3-D scene recovery tasks. The research centers around the dual problems of measurability and steerability, which provide a formal basis for designing and evaluating the proposed models. Measurability defines the conditions under which it is possible to recover a representation from a set of basis images. Steerability specifies the range of views that may be reconstructed as well as the mechanism for producing them. Results should provide a better theoretical understanding of the dynamic effects of viewpoint on scene appearance. Potential applications of steerable appearance models will be investigated, such as three dimensional object recognition based on viewpoint-dependent grayscale appearance, and visual map construction of unknown three-dimensional environments by active exploration.","title":"Steerable Appearance Modeling of Three-Dimensional Scenes","awardID":"9530985","effectiveDate":"1996-06-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["501477"],"PO":["475621"]},"7379":{"abstract":"This project is concerned with two performance enhancing techniques of VLSI systems that have developed from wave pipelining: delay vernier architectures and non-zero skew design methodologies. Many high performance applications require extremely fine timing resolution or very high data sampling rates. Examples include high speed network transceivers, A\/D converters, phase-locked and delay- locked and delay-locked loops, and ATE pin electronics. Normally, expensive circuit technologies and very high frequency clock signals are used to satisfy these performance requirements. However, the proposed delay vernier structures are capable of achieving a very high time resolution using CMOS technologies and relatively slow clock signals. This research will focus on refining and extending delay vernier architectures and design techniques so that their usefulness is maximized. The effectiveness of the architecture in a number of applications will be evaluated. Also, some real-world factors, such as process variation and noise, will be investigated. The non-zero skew design approach allows the VLSI systems designer to take advantage of intentional skew to optimize clock distribution for a particular set of propagation delays, and thereby greatly improve system throughput. A critical necessity for these systems in the ability to create precise clock skews. This research will focus very strongly on the delay vernier technique, since it can provide this required ability. Finally, prototypes systems will be built for several promising applications.","title":"VLSI Delay Vernier Architectures and Applications","awardID":"9531729","effectiveDate":"1996-06-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["210031"],"PO":[18113]},"14908":{"abstract":"The general objective of the research is to develop a new approach for recognition of moving objects or parts as well as extracting and classifying their trajectories. A prospective application of this research is recognition of human gestures and motion of body parts, such as limbs, fingers, etc. The approach is based on iconic recognition of image patches that correspond to object surfaces that are roughly planar. Each surface is recognized separately invariant to its 3D pose, employing affine invariant spectral signatures (AISS) and multi-dimensional indexing in the frequency domain. The AISS are based on novel Gaussian kernels with 2-dimensional modulation which are organized in subsets of distinct orientations. A 2-level hierarchical indexing scheme is used for pose-invariant recognition of flexible objects. The indexing scheme provides pose information of each recognized object\/part. Thus, full 3D motion (including rotations) is directly available from processed image sequences. A novel method is planned for motion recognition using multi-dimensional indexing of the 3D trajectories of objects\/parts. The 3D trajectories of body parts are segmented into motion vectors and then a set of sequential indices is constructed using ordered subsets of these motion vectors. These ordered subsets are then used to vote for model","title":"Motion Recognition by Parts Using Affine-Invariant Spectral Signatures","awardID":"9623966","effectiveDate":"1996-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["402665"],"PO":["475621"]}}