{"135333":{"abstract":"This project will provide researchers in the fields of information theory, communication theory, and fundamentals of wireless networking with a grid-powered web service via a web portal interface. The web service will enable rapid execution of computationally demanding computer simulations that support the research of those working in the field. It is necessary because compute-intensive simulations are essential to progress in the field, yet the associated computational requirements often exceed the available resources of all but the largest institutions. The extant grid supplying power to the initiative leverages the idle capacity of participating computers. Rather than deploying a dedicated infrastructure, it uses existing computers in the libraries, student labs, and staff offices of the participating institution and other participating institutions that choose to donate idle resources.<br\/><br\/>The software to be run on the grid leverages an extensive free Matlab-based library developed by the Principal Investigator and used by an existing base of over 400 scientists and engineers. To simplify the user experience and obviate the need for users to purchase Matlab licenses, a web portal interface will be developed. Researchers from other institutions will be given access to the service and will be encouraged to donate their own idle computer capacity to the initiative.<br\/><br\/>Intellectual Merit: Research in the fields which this grid will serve highly mathematical. The underlying mathematics often involves multidimensional integrals that can only be solved via Monte Carlo integration or simulation. Examples include the design of efficient error correction codes, the calculation of channel capacity under modulation constraints, and the design and analysis of wireless ad hoc networking protocols. The grid-based infrastructure that lies behind the proposed web service will allow rapid parallel execution of Monte Carlo simulations. The consequence is that researchers will obtain results faster (by orders of magnitude) than could be obtained when running on a single processor. Their results will also benefit from dedicated tools for their work and the collaborations hosted by the infrastructure.<br\/><br\/>Broader Impacts: There are both research and educational broader impacts. The research impact is that the proposed web-based simulation service and underlying grid-based infrastructure will provide world-class computing power to groups that might not otherwise have access. The proposed account creation and management policies will allow for underrepresented or disadvantaged groups or institutions to have a larger share of computing resources. Two notable forms of dissemination will be accomplished by continuing to publish the underlying software under an open source license and by presenting tutorials on the software and the infrastructure at conferences.","title":"CRI: CRD: A Web-Accessible Grid-Computing Resource for the Telecommunications Research Community","awardID":"0750821","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["554636"],"PO":["564181"]},"143232":{"abstract":"We propose to organize a two-day workshop on Visual Navigation with invited speakers covering a broad spectrum of scientific disciplines with emphasis on visual navigation. The goal of the workshop would be to assess the state-of-the art in this field and to critically examine future trends. Through presentations and panel discussions, our goal would be to identify a number of new research questions surrounding Visual Navigation that have intellectual merit and whose answers have the potential for broad impact. New ideas have the potential to come from a number of new developments. <br\/><br\/>One such development is the discovery of mirror neurons. This opened new avenues because it means that the motor system of the agent is an important space that is directly related to perception. Visual navigation involves movement of the agent. When an agent A observes another agent B perform a task, then agent A \"understands\" what agent B is doing because he transfers the movement to his own motor system. In other words, agents possess representations of their own actions at an abstract level. Since this abstract level is related to language, it is possible to envision navigating systems of the future that provide language descriptions of their environment. Another important development is what is broadly known in some circles as \"Hyper-empiricism\". The availability of gargantuan amounts of data facilitates the \"learning\" of a number of functions related to navigation. Lots of interesting questions arise about what to learn and how, as existing computational learning techniques are inadequate. Other developments we hope will show up at the meeting.","title":"Future Directions in Visual Navigation","awardID":"0830525","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["460460"],"PO":["403839"]},"134553":{"abstract":"Modern computer system designers must consider many more factors than just raw performance. Thermal output, power consumption, reliability, testing, and security are quickly becoming first-order concerns. Despite various motivating factors, research efforts in optimizing computer systems have historically targeted a single logical layer in the system stack, whether it has been application code, operating systems, virtual machines, microarchitecture, or circuits. Solutions targeting a single layer in isolation are losing momentum, however, given the ever-increasing complexity of modern system and application interaction. An effective way to mitigate this complexity is to employ a holistic solution that considers multiple layers of hardware and software in conjunction, allowing software to adapt and react to changing system conditions at run time.<br\/><br\/>In this project, we are exploring the symbiotic relationship between the various hardware and software design layers, and the corresponding opportunity to provide cohesive solutions to performance, power, reliability, and temperature problems. We are focusing on adding lightweight, well-defined feedback channels to existing hardware and software. Meanwhile, we use a virtual execution environment (VEE) to collate information from various layers and to orchestrate adaptive solutions by modifying the application or OS behavior as necessary. The project provides the ability to re-factor the OS and other system layers to remove complex hardware idiosyncrasies. It also provides virtualization benefits to the underlying hardware. Above all, it directly addresses the pressing need for scalable yet simple solutions to modern and emerging computing challenges","title":"CAREER: An Evolutionary Approach to Hardware\/Software Collaborative Design","awardID":"0747273","effectiveDate":"2008-05-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["438733"],"PO":["565303"]},"138832":{"abstract":"ABSTRACT<br\/>The analysis of large high-dimensional data sets and graphs is motivated by many important applications, such as the study of databases of images and documents, and the modeling of complex dynamical systems (e.g. transaction data, weather patterns, molecular dynamics). This research involves the development of novel mathematical techniques for extracting and visualizing information from large data sets. The data layout, visualization, and human interaction are centered around multi-scale representations, which make it possible to access the data, the derived information and the inference processes associated with it at multiple levels of resolution. The human interaction affects both the geometry and the inference processes on the data, depending on the task at hand. The successful development of these techniques will have substantial impact on any application data which lends itself to a graph representation, such as citation networks, social networks, transaction data correlations, and many aspects of biological systems like gene expression and metabolic pathways. It will also reveal new and interesting multiscale geometric structures of high-dimensional data sets and graphs, and lead to a better understanding of how to extract information from them.<br\/>This research develops novel multiscale embedding techniques and algorithms for graphs and data sets, based on diffusion processes on graphs. Such processes are used to generate multiscale embeddings of a graph, at different scales, as well as to perform learning tasks, with and without human interaction. These multiscale embeddings have strong quantitative guarantees in terms of metric distortion. At the same time, multiscale bases are constructed which have provable capabilities of sparsely representing functions on the graph, making them very well suited for both visualization and learning. We demonstrate the above on data sets ranging from gene networks to document corpora.","title":"Mathematical Foundations of Multiscale Graph Representations and Interactive Learning","awardID":"0808847","effectiveDate":"2008-05-15","expirationDate":"2013-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7454","name":"MSPA-INTERDISCIPLINARY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7703","name":"FOUNDATIONS VISUAL ANALYTICS"}}],"PIcoPI":["464050","550949"],"PO":["532791"]},"134377":{"abstract":"Due to advances in embedded systems and communication technologies, there is an increasing interest in networked embedded hybrid system applications such as transportation systems, networked robotics, sensor networks, and biological systems. In the above applications, the typical system consists of a group of subsystems. Each subsystem also has an embedded computer and possesses unique properties such as interacting physical and logical dynamics and decentralized decision making. Inherent to the networked embedded hybrid system is the presence of heterogeneous uncertainty. Thus, a networked embedded hybrid system is much more complex than a continuous dynamic system, on which most current control theory is based. The complexity of a networked embedded hybrid system presents major challenges in the areas of real-time information inference, control, and safety verification. Since the complex behavior of such systems with uncertainties could be modeled as a stochastic hybrid system, the objective of this NSF CAREER research is to develop theory, computationally efficient numerical algorithms, and experimental testbeds for stochastic hybrid systems, with application to mobile networked embedded systems (emphasizing air traffic control). To achieve the objective, this project is focusing on the following topics: real-time hybrid estimation and information inference algorithms and analysis methods for stochastic hybrid systems. For computational efficiency, algorithms are based on analytical formulation instead of widely-used sample-based estimation algorithms; computationally efficient numerical algorithms based on Differential Transformation are being developed for optimal control of hybrid systems, and for reachable set computation. The developed algorithms are being validated on experimental test platforms, including autonomous air vehicles.","title":"CAREER: Hybrid Estimation and Real-Time Computational Algorithms for Networked Embedded Hybrid Systems","awardID":"0746299","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["555801"],"PO":["561889"]},"140373":{"abstract":"Message Passing Interface (MPI) is de-facto standard for communications software used by scientific parallel applications community well over last 10 years. The current standard has a core of routines used for point-to-point and one-sided data exchange, blocking collective communications routines, remote parallel file access and dynamic process control. In addition, it provides support for features such as derived data types, communications contexts, process groups, and virtual process topologies. However, arrival of multicore- and heterogeneous chips pose a significant challenge for scientific community as they are porting and optimizing existing applications on new computational platforms.<br\/>The proposed Message Passing Interface Forum addresses the continuation of activity focused on enhancing the MPI for passing data between processes in a MIMD computing system, for parallel remote file operations and for dynamic process control of such parallel application programs. The work of this forum will produce a communications standard suitable for addressing the needs of applications on the next generation computing facilities at the Peta-Scale level and beyond","title":"Message Passing Interface Forum","awardID":"0816909","effectiveDate":"2008-05-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["558550"],"PO":["565272"]},"143585":{"abstract":"This 1-day workshop will bring together key members of the FAA, NSF, DHS, and other agencies and invited leaders of the national science community in order to: i) identify new basic research directions for unmanned aerial systems (UAS) in areas such as artificial intelligence, computer vision, and human-robot interaction and catalog computational issues such as software verification and secure wireless communications that will allow safe operations in the NAS, ii) identify requirements for safe operations of UAS in the NAS and translate those needs into basic research objectives for academic research, and iii) clarify and identify new mechanisms to facilitate timely academic research, especially in small UAS. The workshop will involve the larger computational sciences into the UAS community and generate a statement of research needs for UAS operations specifically for the NAS. The close interaction of the FAA with the academic research community is expected to lead to safe operation of UAS in the NAS. A list of mechanisms or programs by which researchers can apply their research to UAS or FAA problems will be created and a statement of clarification of regulations and procedures for university researchers will be prepared.","title":"UAS Research Directions for the National Air Space","awardID":"0832347","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["507817","565226"],"PO":["403839"]},"143497":{"abstract":"This CISE special project award provides funding to the Computer Science and Telecommunications Board of the National Academy of Sciences to hold two workshops to explore the nature of computational thinking and its cognitive and educational dimensions. The first workshop focuses on the nature of computational thinking. The second workshop focuses on the cognitive and educational dimensions of computational thinking, particularly for K-12 students and teachers. A report for each workshop is to be developed to summarize and synthesize discussions, compare and contrast the views of the invited expert participants, and identify common ground and areas for moving forward. The reports are to be disseminated widely in both computing and educational communities.<br\/><br\/>The intellectual merit lies in the importance of the topic of computational thinking to the computing and education communities and the potential to advance discovery and transformative research based on the outcomes of the meeting. The National Academy of Sciences has an outstanding track record in promoting this kind of national dialogue and engaging individuals with significant expertise to address and move forward issues and concepts critical to the scientific community. The project develops a clear understanding of the central elements of computational thinking as well as the cognitive aspects, thus forming the basis for new research in an area critical to computing and education.<br\/><br\/>The broader impacts lie in sound development of a fundamental analytical skill that is ultimately relevant to everyone. Progress toward incorporating computational thinking into K-12 education could impact not only on the future development of K-12 education but also on the skill set of future members of the workforce, both in the sciences and more broadly.","title":"Computational Thinking For Everyone: A Workshop Series","awardID":"0831827","effectiveDate":"2008-05-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["560890"],"PO":["564181"]},"134444":{"abstract":"The objective of this research is to model the effect of community structure on information diffusion through the analysis of online interactions. As our lives are increasingly conducted in the digital domain, these online activities represent a growing proportion of our interactions - from the way we acquire and share information, to the way we communicate, socialize, and organize. Such activities leave digital traces, ranging from citation patterns among millions of blogs to avatar interactions in online virtual worlds such as Second Life. <br\/><br\/>Empirical studies of these traces will address the following information diffusion and social network phenomena on an unprecedented scale and with great accuracy: 1) the interplay between social network structure, community affiliation and interaction; 2) the effect of social network structure and community boundaries on information diffusion and change; 3) the range of influence of individuals, related to the structure of their social network and community affiliation; 4) the dynamics of opinion formation in networks of overlapping communities. <br\/><br\/>The topic of information diffusion, having both theoretical and practical significance, has received sustained attention across several scientific disciplines for some time. However, past empirical studies have lacked the size and accuracy needed to differentiate between different theoretical models. To address this problem, this project will assemble three very large scale, high resolution network data sources: one encompassing the interactions of millions of users of the online virtual world Second Life, the second comprising millions of blogs, and the third mapping exact traces with a novel information and opinion sharing application that will be developed. Together, these three contexts will serve as a testbed for modeling the dynamics of information diffusion. Beyond testing existing models, this project will incorporate network community boundaries and overlap into new descriptive and predictive models of information diffusion and opinion formation. <br\/><br\/>Understanding how information diffuses and how opinions are formed in today's highly connected and community-focused online environments has important implications not just for public policy and marketing, but also for the dissemination of innovations. Knowing how to traverse community boundaries, or conversely, to target different communities separately, can also facilitate the spread and adoption of educational and community outreach efforts, including those initiated by several educational institutions in Second Life. The research will directly feed into network and data analysis courses taught by the principal investigator as part of two new social computing and information retrieval Masters of Information Science specializations. It will add to a collection of online data sets, analysis tools, and tutorials already shared by the principal investigator for educational and research purposes. Some of the online tutorials will be adapted as interactive exhibits in Second Life. To educate an even younger audience, one or more Discovery Carts on the topic of social networks will be developed in collaboration with the Ann Arbor Hands-on Museum, which will become part of the museum's outreach.","title":"CAREER: Social Dynamics of Information in Virtual Spaces","awardID":"0746646","effectiveDate":"2008-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["430297"],"PO":["564456"]},"135423":{"abstract":"This grant supports the acquisition of a high performance cluster and storage system to build the departmental computing infrastructure required for information technology research. This infrastructure will enable the PIs to conduct state-of-the-art research in six areas: (1) dynamic virtual environments for cyberspace, (2) design and implementation of scalable information systems, (3) push-based I\/O servers, (4) management of wireless networks, (5) adaptive fault resilience for high end computing, and (6) scalable parallel numerical algorithms and simulations. Each of these projects requires significant computational resources, and some of them also require super-user privilege for individual system configuration and testing. A dedicated computing infrastructure is essential to the success of these projects. In addition, this infrastructure will offer a platform for students to learn and experiment with state-of-the-art computing technologies. In the context on on-going course enhancement activities, it will provide an environment for reforming the curriculum in the areas of parallel processing, distributed systems, computer networking, information retrieval, data mining, computer simulation, scientific computing, etc. Women are clearly underrepresented in computer science. Three of the five PIs are female faculty. They are actively recruiting female students and other underrepresented minorities. This CRI facility will enable scientific advances that would not otherwise be possible, and will substantially impact on the research and educational activities at the Illinois Institute of Technology. More information about this project can be found at the project Web site (http:\/\/meta.cs.iit.edu\/~scf\/).","title":"CRI: IAD: Acquisition of a Computing Cluster and Storage for Information Technology Research","awardID":"0751200","effectiveDate":"2008-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["494506","517717","557489","560175","550730"],"PO":["469867"]},"141672":{"abstract":"This workshop will honor Dick Lipton?s fundamental insights, in complexity theory in particular and computer science in general, via a set of plenary lectures given by some of the most accomplished computer scientists. The symposium will be held April 27-28, 2008 at Georgia Tech and will be open to the public. It will primarily consist of invited talks by well-known computer scientists but will also have a session for contributed talks. We will ask speakers to submit written surveys related to these talks and compile them into a single volume. Abstracts, slides, and video will be made available to the general community via the world wide web. Several eminent computer scientists have readily agreed to serve on the program committee and come to Atlanta for the symposium.","title":"Lipton Theory Symposium: A Workshop in Honor of Richard Lipton's 60th Birthday","awardID":"0822860","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565103"],"PO":["499399"]},"135853":{"abstract":"The investigator will use the funds from this grant to support the travel of students to the 2008 SIAM Data Mining (SDM 2008) Conference on Data Mining. This conference will be held in Atlanta, USA from April 24th to April 26th, 2008 (http:\/\/www.siam.org\/meetings\/sdm08\/).<br\/>Jointly organized by computer scientists and statisticians, this technical conference is a premiere venue for presenting new research results in the area of data mining, and is widely attended by researchers and practitioners in the field. Selection of award recipients will be done on the basis of quality of their research progress, as well as the potential to benefit from attending this meeting. Special emphasis will be given to graduate students, and in particular women and under-represented minority students, since attending conferences is an important part of their educational experience, and they often have limited travel funds.<br\/><br\/>Attending conferences such as SDM is of paramount importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field.<br\/>Such experiences help students in a number of ways ways. First, it enables them to get exposure to a wide range of cutting edge ideas in their field, beyond what they are likely to be exposed to in their home institutions and research groups. Second, it provides them an opportunity to meet established researchers, which can potentially lead to long term interactions and mentoring relationships. Third, in case they are presenting a paper, it provides an opportunity for early feedback on their thesis research and presentation skills from a broad audience. All of these benefits are invaluable in ensuring the development of research excellence, leading to a productive career in innovative research. Given that cutting edge innovation is critical to the United States' economic preeminence in the world, and a future workforce trained to be innovative is critical for it, the proposed project is well aligned with the national agenda.","title":"SM: Student Travel Grant for SIAM Data Mining Conference 2008","awardID":"0753106","effectiveDate":"2008-05-15","expirationDate":"2009-10-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["532009"],"PO":["565211"]},"135413":{"abstract":"The increasing interaction between computing technology and the physical world requires that systems be able to adapt to changing conditions, compensate for hardware and software failures, fend off attacks, and optimize performance, all with minimal human intervention. Robust operation is especially important among collections of small devices, such as micro-robots and sensors that need to perform complex distributed tasks despite adverse operating conditions. Digital evolution offers a means to produce robust computational behaviors and customize them for target hardware and environments. In digital evolution, populations of self-replicating computer programs are subject to random mutations in dynamic environments, leading to evolution by natural selection.<br\/><br\/>This infrastructure project will construct a testbed to support digital evolution of complex distributed behaviors and their evaluation on heterogeneous computing systems. The testbed will include terrestrial mobile robots, custom-built robotic fish, and stationary sensors, as well as a rack-mounted parallel processor for on-line software evolution. The testbed will support research projects addressing energy-efficient mobility control for swarms of mobile devices; adaptive communication protocols; and self-adaptive and self-healing software. To maximize its impact, the testbed will be integrated with existing facilities, creating a rich computing and communication fabric for experimental research.","title":"CRI: IAD - A Testbed for Evolving Adaptive and Cooperative Behavior Among Autonomous Systems","awardID":"0751155","effectiveDate":"2008-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["472159","543568","425363","425364","560245"],"PO":["565090"]},"135424":{"abstract":"Treebanks are corpora of naturally occurring text that have been annotated with morphological and syntactic (structural) information. <br\/>In the last 15 years they have led to significant advances in natural language processing (NLP) results by providing training data for supervised machine learning algorithms. These algorithms can now automatically perform useful part-of-speech tagging, parsing and semantic interpretation. This project is creating a new-generation, multi-representational Treebank. The languages being annotated are Hindi (400K words) and Urdu (200K words). The texts are being annotated in dependency structure (trees in which all nodes are labeled with words of the sentence), enriched with additional semantic role labels. The dependency representation is also being automatically mapped to a phrase-structure representation (in which the words are at the leaves of the tree and internal nodes are labeled with phrase markers). After applying standard quality-control both versions will be released to the public, providing an immediate boost to the performance of Hindi\/Urdu NLP. A tool will also be released that will allow a researcher to produce alternative formatting of the phrase structure representation. This supports a view of the treebank as a more general, abstract representation of the morphology and syntax of the language rather than merely as data for a particular style of machine learning experiment. Research into parsing and other NLP tasks has recently recognized the benefits of reformatting syntactic representations in order to improve the machine learning process; this treebank will make that step much easier for all NLP researchers interested in Hindi or Urdu in particular and in language in general. OISE is co-funding the University of Colorado student exchange with the IIIT in Hyderabad, India where 400K words of Hindi and 200K words of Urdu will be annotated with dependency parses. This will enable an international research experience for U.S.students.","title":"Collaborative Research: CRI: CRD: A Multi-Representational and Multi-Layered Treebank for Hindi\/Urdu","awardID":"0751202","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"L526","name":"National Security Agency"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["511542","406300"],"PO":["565215"]},"134467":{"abstract":"The objective of this research is to advance our understanding of prosodic relationships and their synchronizations between verbal and nonverbal communication modes. Prosody and kinesics such as hand gestures, head nods, facial expressions, and posture, play a crucial role in everyday communication by adding expressiveness, as well as by structuring information. Although there are different types and various levels of synchronization across these modalities, their exact mapping remains unclear. Whereas cross-modal synchronization between verbal and nonverbal modalities has been explored mostly at the semantic and discourse levels to date, in this work the PI will focus on the interplay between them at various levels of granularity. In particular, co-analyses of speech, using language and discourse models, with kinesics will be used to uncover prosodic correspondences which, in turn, will be used to develop novel algorithms for modeling dialog acts, emotions and other kinesics. The two primary goals of the project are to develop computational methods and software tools to iteratively uncover prosodic relationships between nonverbal and verbal behaviors, and to use derived prosodic relationships and their synchronizations to develop novel computational methods and software tools for the robust recognition of gestures, facial expressions, emotions, head nods, and dialog acts. The PI hopes to thereby lay the foundation for a framework for co-analysis of multimodal articulations to obtain a deeper understanding of (a) how the nucleus of an utterance and visual prosody interact to render the intent of the utterance, and (b) how synchronization with other modalities affects the production of multimodal co-articulation. To further improve the robustness and recognition accuracies, a set of classifiers will be designed and fused by taking into account the diversity among them. Systematic methods will be developed to evaluate the classifiers using various performance metrics (i.e., precision, recall, F-measures), graphical analyses and measure functions. The outcomes of the research, together with the PI's prior work, will ultimately enable the development of a perceptual interface for AutoTutor (an artificially intelligent web-based tutoring system), providing a natural means to interact with multimedia contents for instruction.<br\/><br\/>Broader Impact: The results of this research will have profound impact on the understanding and tracking of multimodal communications in humans and agents. The interplay between the complementary modalities and prosodic manifestations of their synchronization will also broaden the understanding of multi-channel communications in cognitive science, discourse processing, linguistics, and human-machine interaction, which will enable the development of innovative applications such as collaborative environments for agents and humans, and assistive technologies for the elderly and disabled. The long-term vision of the proposed research is to develop a perceptual interface for web-based tutoring systems such as AutoTutor. Use of an enhanced artificially intelligent web-based tutor offers significant opportunities for improving the math and science preparation of incoming engineering and science undergraduates of the Memphis City Schools and other regional or national clients. The PI will also create an online collaborative learning environment, using newer frameworks such as Web 2.0, to organize a massive amount of digital contents in such a way that communities of learners can effectively share and co-manage the information. The software and databases developed as part of this project will be made available to other researchers through the project website.","title":"CAREER: Co-analysis of Signal and Sense for Understanding Non-verbal Communications and their Applications","awardID":"0746790","effectiveDate":"2008-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["446710"],"PO":["565227"]},"134489":{"abstract":"Today, more and more high-performance embedded applications such as avionics and flight control, space shuttle systems, vehicles, and instrumentation in medical and emergency facilities, demand greatly increased computation capabilities from processors. Meanwhile, semiconductor manufacturing technologies keep scaling processors to smaller feature sizes. As a result, power density in processors becomes increasingly high. Due to the high power density, processors are prone to overheating, which affects not only reliability but also performance, power and cost of embedded systems. As such, thermal management becomes a prominent issue in system design. On the other hand, high-performance embedded applications demand increasingly stringent need for timing guarantees. As high-performance embedded systems become more and more thermally-constrained, the issue of how to provide timing guarantees under the constraints of thermal behavior and thermal control mechanisms must be addressed.<br\/><br\/>The objective of this NSF CAREER research project is to provide timing-guaranteed services for real-time applications while maintaining safe temperature levels for processors in high-performance embedded systems. This project focuses on development of timing-aware dynamic thermal management methodology, algorithms design analysis and system implementation in a variety of problem domains. The project seeks to significantly advance real-time system design by furthering understanding of the fundamental thermally-constrained and timing-constrained problems in high-performance embedded systems. Furthermore, this research provides an important foundation for addressing external environmental effects (such as thermal environments) on real-time systems. The impacts of this project also extend to academia through graduate and undergraduate research, curriculum development, and industrial collaboration and community outreaching.","title":"CAREER: Timing-Aware Dynamic Thermal Management in High-Performance Embedded Systems","awardID":"0746906","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[357536],"PO":["561889"]},"139989":{"abstract":"The purpose of the workshop is two fold: first to deliver an invigorating<br\/>educational program and second is to provide an outstanding<br\/>opportunity to bring together women students from different departments,<br\/>across the country (and possibly internationally), so as to foster a<br\/>sense of kinship and camaraderie. And to provide access to the role<br\/>models in this area by having senior and junior faculty present.<br\/>Further enhancing this initial relationship with a long time mentoring<br\/>program which will be organized by Anne Condon. Our long term goal is<br\/>that these efforts will help widen the pipeline of women doing theory.<br\/><br\/>While there are groups for \"Women in Computer Science\" and \"Women in<br\/>Engineering\" at both the university and national level, our objective in<br\/>creating a \"Women in Theory\" workshop is to enable meaningful technical<br\/>interactions among the participants. There will be significant overlap<br\/>in research interests in this group to facilitate a technical program<br\/>that is interesting to everyone.<br\/><br\/>List of confirmed technical speakers:<br\/>Dorit Aharonov, Hebrew University, Shuchi Chawla, University of Wisconsin,<br\/>Madison, Julia Chuzhoy, TTI,<br\/>Irit Dinur, Weizmann Institute, Cynthia Dwork, Microsoft Research, Joan<br\/>Feigenbaum, Yale,<br\/>Shafi Goldwasser, MIT and Weizmann Institute, Tal Malkin, Columbia<br\/>University, Eva Tardos, Cornell,<br\/>Lisa Zhang, Bell-Labs<br\/><br\/>We will also have talks by the participating students and sessions<br\/>devoted to discussions on issues that are especially relevant to<br\/>female scientists such as finding a job and salary negotiations,<br\/>communicating with your advisor, and work-life balance, etc.","title":"Women In Theory Workshop","awardID":"0813748","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["382705"],"PO":["499399"]},"142696":{"abstract":"This is funding to support a doctoral consortium (workshop) for about 10 promising graduate students, along with a panel of distinguished research faculty, which will take place in conjunction with the 2008 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC 08), to be held September 16-20 in Herrsching am Ammersee, Germany, and sponsored by the IEEE Computer Society. Over the past decade, the diversity and ubiquity of people?s goals, interactions, and concerns with information systems have increased dramatically. Interactive computer software now permeates many individuals? working lives, and people are increasingly relying on computing and information systems for leisure and home activities as well. As a result, end users now expect considerable flexibility and control in their interactions with computer software. For many, it is no longer sufficient to consume the packaged software and scripted tasks developed by the professional software industry; they now must produce their own computational solutions to a wide variety of problems, including spreadsheet models, web sites, educational media and simulations, automated business procedures, and scientific visualizations. To produce such software, even for domain-specific problems, end users must look beyond surface-level interaction with computers and acquire the conceptual models and skills of computational thinking. But current advances toward computational thinking by end users are not evenly distributed across all segments of the population. Thus, this year?s VL\/HCC doctoral consortium, the sixth to be funded by NSF in this series, will focus on expanding the benefits of computational thinking to diverse populations. Participants will explore how varying communication media, representations, and problem-solving support affect end users? willingness and ability to access, manipulate, and program solutions to their work or everyday problems. What are the special needs of disadvantaged populations? How can computational problem-solving tools and devices be designed to meet these needs? The workshop will bring together and build community among young researchers working on different aspects of these problems from the perspectives of diverse fields including computer science, the social sciences, and education. It will guide the work of these new researchers by providing an opportunity for experts in the research field (as well as their peers) to give them advice, in that student participants will make formal presentations of their work during the workshop and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. A 2-page extended abstract of each participant's work will be published in the conference proceedings. The PI expects that most of the students supported by this award will come from U.S. universities, but as in past years, due to the highly international make-up of the research community, a few non-U.S. students may be invited to participate as well. <br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other. Members of the organizing committee will engage in a personal recruitment process through academic connections, in an effort to encourage participation by students in non-technology departments as well as from minority institutions.","title":"VL\/HCC'08 Doctoral Consortium","awardID":"0827799","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["503162"],"PO":["565227"]},"143721":{"abstract":"This is funding to support this year's Student Design Competition (SDC), which will be part of the 2008 annual RESNA conference to be held June 26-30 in Washington DC. RESNA is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. Comprised of over 1,000 individual and 200 institutional members - researchers, manufacturers, clinicians, suppliers, professionals and end-users of technology devices and equipment - the organization has as its purpose to improve the health and participation of people with disabilities in mainstream society. To this end, RESNA supports those individuals engaged in research, development, education, advocacy and the provision of technology through a number of programs and activities, which in addition to the annual conference include a credentialing program for assistive technology practitioners, suppliers and rehabilitation engineering technologists, as well as sponsored projects. RESNA serves as the ANSI-designated national body for development of voluntary standards for products used by persons with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference. Since then, over 200 designs have been identified as winning entries, chosen from more than 600 submissions by students from over 110 different universities. SDC entries must represent the work of STUDENTS ONLY, including the documentation of the design, but both undergraduate and graduate students are eligible to submit entries. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Support for past SDCs has been provided by nationally recognized disability organizations such as Easter Seals and Paralyzed Veterans of America, as well as by a subsidiary of the Johnson & Johnson Company. NSF has been a supporter since 2005, and this year's funding will enable the SDC to be further expanded and enhanced so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also sent out to major colleges and universities with engineering and design schools, including Historically Black Colleges and Universities. A team of 5 judges will pre-select entries from up to 10 teams, who will be invited to attend the conference. During a half-day session in which the teams will make presentations before the judges and public audience at the conference, 5 teams will ultimately be selected as the final winners. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. A platform session will be held in which the 5 finalists will make presentations to the general conference attendees. All SDC teams invited to the conference will have an opportunity to present their projects in a poster session during the general conference time. More information is available online at http:\/\/www.resna.org\/Conference\/Conference.php. <br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. Unique in its primary focus on undergraduates, the event will provide participants with experience and skills that assist them to be successful in their engineering and design careers, and will further encourage, support and mentor students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields. In an effort to help communicate and disseminate information about this important opportunity to impact the lives of individuals with disabilities, and to increase participant diversity even further both with respect to individuals and universities, NSF funding will be used in part this year to podcast the SDC for the first time.","title":"Podcasting the 2008 RESNA Student Design Competition","awardID":"0832963","effectiveDate":"2008-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559082"],"PO":["565227"]},"143017":{"abstract":"It is said that the next ten years of advances in computer science could be far more significant, and far more interesting, than the past ten. To achieve this significant progress, there needs to be a concerted effort to attract a new generation of students, especially those willing to obtain a Ph.D. The purpose of this mentoring workshop is to attract and encourage women and underrepresented minority (URM) computer science undergraduate students (specifically those in their sophomore and junior years) and graduate students enrolled in M.S. programs to obtain a Ph.D. in computer science.<br\/><br\/>The workshop will bring together researchers (including women and URM<br\/>leaders) from academia and industry to give talks on the kind of research typically performed after obtaining a Ph.D. The workshop will engage women and URM students specifically interested in systems research in a process of imagining how they might make significant contributions to the world through systems research. Researchers from several areas of systems research will review past research and the current state-of-art, and will present a number of future problems that we should be prepared to tackle in the coming decade.","title":"Systems Research Mentoring Workshop","awardID":"0829760","effectiveDate":"2008-05-01","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["527984","558848","554979"],"PO":["565272"]},"135416":{"abstract":"The collaborative project focuses on the deployment of a complete, scalable, multi-tiered and integrated wireless mobile infrastructure at urban scale that addresses: 1. at-scale design and evaluation of network protocols; and 2. the compilation and analysis of medical health data collected via the integration of medical health sensors into the wireless network. This collaborative project team will develop, deploy, and operate an information technology infrastructure that serves as a platform for research and societal change. The key innovations of this project and platform are: <br\/>1. A multi-tier wireless access network with fully programmable and observable nodes that serves 4,000 users over 4 km2 (an at-scale density surpassing existing deployments), <br\/>2. A fully instrumented and deployed mobile computing platform that enables joint assessment of user behavior and end system performance, providing energy-efficient and user-friendly access to the network, and <br\/>3. A deployed wireless health-sensing platform that monitors and processes physiological data and seamlessly interconnects it with the mobile-computing and wireless network platforms to enable radically new low-cost treatments for chronic diseases. <br\/><br\/>The research infrastructure will be deployed in an under-resourced area, Pecan Park, a community in the heart of Southeast Houston with 4,760 residents per km2, a density that is unprecedented for research and has not been reached even by commercial mesh deployments. This scale provides a replicable and sustainable template of what is possible in similar communities world-wide. The infrastructure serves as both a platform for societal change and a platform for research innovation and proof-of-concept system design.","title":"Collaborative Research: CRI\/IAD: Programmable and At-Scale Infrastructure for Wireless Access, Mobile Computing, and Health Sensing","awardID":"0751165","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["533458"],"PO":["564778"]},"135427":{"abstract":"Treebanks are corpora of naturally occurring text that have been annotated with morphological and syntactic (structural) information. <br\/>In the last 15 years they have led to significant advances in natural language processing (NLP) results by providing training data for supervised machine learning algorithms. These algorithms can now automatically perform useful part-of-speech tagging, parsing and semantic interpretation. This project is creating a new-generation, multi-representational Treebank. The languages being annotated are Hindi (400K words) and Urdu (200K words). The texts are being annotated in dependency structure (trees in which all nodes are labeled with words of the sentence), enriched with additional semantic role labels. The dependency representation is also being automatically mapped to a phrase-structure representation (in which the words are at the leaves of the tree and internal nodes are labeled with phrase markers). After applying standard quality-control both versions will be released to the public, providing an immediate boost to the performance of Hindi\/Urdu NLP. A tool will also be released that will allow a researcher to produce alternative formatting of the phrase structure representation. This supports a view of the treebank as a more general, abstract representation of the morphology and syntax of the language rather than merely as data for a particular style of machine learning experiment. Research into parsing and other NLP tasks has recently recognized the benefits of reformatting syntactic representations in order to improve the machine learning process; this treebank will make that step much easier for all NLP researchers interested in Hindi or Urdu in particular and in language in general.","title":"Collaborative Research: CRI: CRD: A Multi-Representational and Multi-Layered Treebank for Hindi\/Urdu","awardID":"0751213","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["507284"],"PO":["565215"]},"144316":{"abstract":"The success of advancing technologies critical to designing future-generation high-performance global networks and reliable distributed applications hinges on the available tools that can effectively prototype test, and analyze new ideas. The project will enable advances in the area of high-performance modeling and simulation of large-scale networks. The research includes an investigation of the fundamental technologies that enable real-time large-scale network simulations<br\/>and the development of a real-time immersive network simulation environment. Real-time network simulation combines the advantages of both simulation and emulation by running simulation models that interact with the physical world. Immersive large-scale network simulation requires that the simulation not only capture important characteristics of the target global network, but also support seamless interactions with distributed applications in real time. The project is divided into three research thrusts: imprecise simulation, GPU co-simulation, and the development of the immersive network simulation environment. Imprecise simulation, extended from the imprecise computation technique originally designed for real-time systems, aims to achieve real-time performance of large-scale network simulations, by allowing the simulation to choose among models with different modeling representations and with variable computing requirements during run-time. GPU co-simulation exploits the computing resource of graphics processors, which are almost omnipresent on todays desktop computers and become more powerful than CPUs; certain numerical computations, such as the network background traffic calculation, can be offloaded to the graphics hardware, so that the CPUs can concentrate on more critical tasks for real-time simulation. An immersive network simulation environment will be developed based on the imprecise simulation and GPU co-simulation techniques, and will also include models of network protocols of alternative designs of the layered network structures.","title":"CAREER: Immersive Large-Scale Network Simulations","awardID":"0836408","effectiveDate":"2008-05-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["424669"],"PO":["535244"]},"135417":{"abstract":"Treebanks are corpora of naturally occurring text that have been annotated with morphological and syntactic (structural) information. <br\/>In the last 15 years they have led to significant advances in natural language processing (NLP) results by providing training data for supervised machine learning algorithms. These algorithms can now automatically perform useful part-of-speech tagging, parsing and semantic interpretation. This project is creating a new-generation, multi-representational Treebank. The languages being annotated are Hindi (400K words) and Urdu (200K words). The texts are being annotated in dependency structure (trees in which all nodes are labeled with words of the sentence), enriched with additional semantic role labels. The dependency representation is also being automatically mapped to a phrase-structure representation (in which the words are at the leaves of the tree and internal nodes are labeled with phrase markers). After applying standard quality-control both versions will be released to the public, providing an immediate boost to the performance of Hindi\/Urdu NLP. A tool will also be released that will allow a researcher to produce alternative formatting of the phrase structure representation. This supports a view of the treebank as a more general, abstract representation of the morphology and syntax of the language rather than merely as data for a particular style of machine learning experiment. Research into parsing and other NLP tasks has recently recognized the benefits of reformatting syntactic representations in order to improve the machine learning process; this treebank will make that step much easier for all NLP researchers interested in Hindi or Urdu in particular and in language in general.","title":"Collaborative Research: CRI: CRD: A Multi-Representational and Multi-Layered Treebank for Hindi\/Urdu","awardID":"0751171","effectiveDate":"2008-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[359754],"PO":["565215"]},"134406":{"abstract":"The objective of this career development plan is to investigate new<br\/>probabilistic methods for simultaneous localization and mapping (SLAM)<br\/>that will improve the precision and scale of robotic mapping in ocean<br\/>science. The proposed methodology will scale to multiple<br\/>heterogeneous vehicles, allow for extended exploration over long time<br\/>durations and over multiple spatial scales, and be robust to the<br\/>challenging limitations of the underwater environment. Many land\/air<br\/>SLAM methods are largely inapplicable underwater because of (a) a lack<br\/>of point features of unstructured seafloor, and (b) the rapid<br\/>attenuation of electromagnetic, optical, and acoustic radiation in<br\/>comparison to land, air, and space. The proposed multi-vehicle<br\/>multi-scalar SLAM navigation framework overcomes these challenges by<br\/>fusing information from three disparate technologies: 1) real-time<br\/>vision-based seafloor navigation, 2) inertial navigation systems, and<br\/>3) acoustic modem-based communication, to create a flexible navigation<br\/>framework that allows for inter-nodal ranging and data sharing among<br\/>heterogeneous nodes. By leveraging the perception and localization<br\/>capability of neighboring vehicles via a (low-bandwidth) distributed<br\/>estimation framework, the proposed methodology will provide a<br\/>cooperative navigation framework that will yield improved precision<br\/>and scale in underwater robotic mapping for ocean science.","title":"CAREER: Toward Robust Multi-Vehicle Multi-Scalar Underwater Robotic Navigation - A Career Development Plan","awardID":"0746455","effectiveDate":"2008-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["438616"],"PO":["491702"]},"135418":{"abstract":"The collaborative project focuses on the deployment of a complete, scalable, multi-tiered and integrated wireless mobile infrastructure at urban scale that addresses: 1. at-scale design and evaluation of network protocols; and 2. the compilation and analysis of medical health data collected via the integration of medical health sensors into the wireless network. This collaborative project team will develop, deploy, and operate an information technology infrastructure that serves as a platform for research and societal change. The key innovations of this project and platform are: <br\/>1. A multi-tier wireless access network with fully programmable and observable nodes that serves 4,000 users over 4 km2 (an at-scale density surpassing existing deployments), <br\/>2. A fully instrumented and deployed mobile computing platform that enables joint assessment of user behavior and end system performance, providing energy-efficient and user-friendly access to the network, and<br\/>3. A deployed wireless health-sensing platform that monitors and processes physiological data and seamlessly interconnects it with the mobile-computing and wireless network platforms to enable radically new low-cost treatments for chronic diseases.<br\/><br\/>The research infrastructure will be deployed in an under-resourced area, Pecan Park, a community in the heart of Southeast Houston with 4,760 residents per km2, a density that is unprecedented for research and has not been reached even by commercial mesh deployments. This scale provides a replicable and sustainable template of what is possible in similar communities world-wide. The infrastructure serves as both a platform for societal change and a platform for research innovation and proof-of-concept system design.","title":"Collaborative Research: CRI\/IAD: Programmable and At-Scale Infrastructure for Wireless Access, Mobile Computing, and Health Sensing","awardID":"0751173","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["548310","548312","490853"],"PO":["564778"]},"143614":{"abstract":"Student travel support is provided to the Networked Systems Design and Implementation (NSDI) conference due to the benefits to the communities and to the areas of Network Technology and Systems (NeTS) and Computer Systems Research (CSR).<br\/><br\/>Intellectual Merit: After the significant success of its first four meetings, Networked Systems Design and Implementation (NSDI) has become a very strong conference that fuses the research areas of networking and systems. It has developed a strong focus on implementation and experience. Most importantly, the cross-disciplinary emphasis of NSDI makes it well-suited for student participation. NSF student travel support not only is beneficial to the symposium, but also to students from diverse backgrounds.<br\/><br\/>Broader Impact: This support creates educational opportunities for graduate students interested in interdisciplinary research in systems and networks. NSDI is a small single track conference so the students interact significantly with more senior researchers at the leading edge of both fields. Diversity of participation in parallel with technical strength of participation is an important goal of the travel funding. In the report for last year's travel support, the fund was able to support a group consisting of 50% female students and 20% institutions not usually represented. A number of the student participants have papers to present, but in addition, students are engaged with volunteer activities as documented in last year's report.","title":"Student Travel Support for the Fifth Symposium on Networked Systems Design and Implementation (NSDI)","awardID":"0832543","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["463055"],"PO":["565090"]},"143933":{"abstract":"While the latest information technologies have made it possible for us to communicate with one another and to gain access to information more quickly than ever before, it is now clear that these powerful capabilities are also contributing to information overload, extreme busyness, and the fragmentation of attention, as well as to accelerated and even frantic modes of working and living. One of the most unfortunate consequences of this trend is the loss of time for reflection and contemplation?the loss of time to think. This is funding to partially support a workshop of about 100 participants that will be held June 16-17 on the campus of the University of Washington in Seattle, to explore this phenomenon across a number of significant cultural institutions, and to suggest possible responses and remedies. Professionals from a number of walks of life will be invited to participate and to address questions such as: How does the lack of time to think affect you in your work? How is it affecting your business, institution, or enterprise? What do you see as potential larger or long-term consequences to you, to your work, and to the larger society? Are you (or is your business, institution, or enterprise) aware of the situation? What positive steps are you taking to ameliorate it? What further steps might \/ should be taken? This 2-day event will begin the evening of Monday, June 16 with a panel of speakers drawn from various professions and walks of life. It will continue on Tuesday, June 17 with breakout groups that will allow all attendees to speak professionally and personally about the effects of the loss of time to think. The breakout groups will be followed by several parallel-track workshops that will examine the problem and\/or potential solutions from a variety of perspectives. Finally, a closing plenary session will discuss possible concrete next steps. Participants will be selected from two main groups: people representing a number of major professions and walks of life whose work is negatively affected by the loss of time to think (e.g., lawyers, judges, physicians, nurses, health care administrators, print and broadcast journalists, K-12 teachers and school administrators, university faculty and administrators, corporate leaders and middle managers, high-tech workers, government employees, religious leaders of various faiths, artists, and homemakers), and researchers from a number of disciplines whose scholarship is relevant to the problem of the loss of time to think (e.g., computer and information science, philosophy, psychology, sociology, history of technology, neuroscience, and medicine). This workshop constitutes a follow-on to the Workshop on Information, Silence, and Sanctuary which was held in Seattle in May of 2004, and the Workshop on Mindful Work and Technology which was held in Washington DC in March of 2006, both of which were organized by the PI with partial funding provided by NSF. As with the previous two events in the series, additional funding for the current workshop is expected to come from the MacArthur Foundation.<br\/><br\/>Broader Impacts: The PI's goal is to raise public awareness of the workshop topics and to stimulate broad discussion of them. To these ends, audio and videotape recordings of the opening panel, as well as a summary videotape regarding the workshop and a written report, will be made available to the public on the workshop website. The PI also plans to approach the local NPR affiliate in Seattle (KUOW) to interest them in broadcasting the opening panel discussion, as they did for the May 2004 workshop.","title":"No Time to Think Workshop","awardID":"0833928","effectiveDate":"2008-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["427132"],"PO":["565227"]},"134969":{"abstract":"The investigators propose to a) develop tools for electrophysiologically realistic simulations of large areas of mammalian cortex using modern computers with many thousands of (hetero- or homogeneous) processors b) use genetic programming techniques to evolve models of primary and secondary visual cortical areas to solve difficult image processing tasks, namely image segmentation, c)understand the structure of computations performed by the brain (that is, its computational primitives) and discover the level of biological detail necessary and sufficient for these computations.<br\/><br\/>A distinguishing trait of the proposed approach is that physiological realism is not the goal, and it will be attempted only to the extent that it is needed for understanding the neural computation and for solving complex information processing tasks. That is, functional performance will be the means of bridging over gaps in the existing knowledge. Thus the resulting cortical models fall between the traditional (and oversimplified) Artificial Neural Networks and biomedically-inspired cellular and molecular descriptions.","title":"Collaborative Research: High Performance Neural Computing","awardID":"0749348","effectiveDate":"2008-05-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7691","name":"PetaApps"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["451860","513126"],"PO":["565247"]},"134926":{"abstract":"The investigators propose to a) develop tools for electrophysiologically realistic simulations of large areas of mammalian cortex using modern computers with many thousands of (hetero- or homogeneous) processors b) use genetic programming techniques to evolve models of primary and secondary visual cortical areas to solve difficult image processing tasks, namely image segmentation, c)understand the structure of computations performed by the brain (that is, its computational primitives) and discover the level of biological detail necessary and sufficient for these computations.<br\/><br\/>A distinguishing trait of the proposed approach is that physiological realism is not the goal, and it will be attempted only to the extent that it is needed for understanding the neural computation and for solving complex information processing tasks. That is, functional performance will be the means of bridging over gaps in the existing knowledge. Thus the resulting cortical models fall between the traditional (and oversimplified) Artificial Neural Networks and biomedically-inspired cellular and molecular descriptions.","title":"Collaborative Research: High Performance Neural Computing","awardID":"0749157","effectiveDate":"2008-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7691","name":"PetaApps"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":["560901"],"PO":["496127"]},"135905":{"abstract":"Abstract:<br\/><br\/>This REU site seeks to increase the number of students choosing to pursue graduate studies, and ultimately careers, in computer science. The participants experience the most compelling aspects of <br\/>graduate school in a ten week summer program. The program nurtures <br\/>student interest in research by engaging students in the entire research process, beginning with a search of the literature, reading prior research, selecting the specific problems to be studied, working on those problems, and preparing the results for publication. The program develops research skills and improves written and oral communication skills in order to prepare students for success in graduate school.<br\/><br\/>The research topics fall under the broadly scoped area of computer systems. Topics include computer networking, robot vision, computer music systems, and memory management, among others. Each project involves two or three students under the close direction of a faculty adviser whose expertise is in that area. In addition, students participate in a number of whole-group curricular and co-curricular activities. Among these activities are workshops on research methods, ethics, applying to graduate schools, careers in computer science, and technical topics.<br\/><br\/>This program seeks to involve students from a variety of backgrounds and particularly those from schools with limited access to research opportunities. The project includes a comprehensive local and national recruiting-outreach program.","title":"REU Site: REU Site in Computer Systems","awardID":"0753306","effectiveDate":"2008-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["561152","518669"],"PO":["562760"]},"143937":{"abstract":"This is funding to support a consortium (workshop) of approximately 12 promising doctoral students from the United States and abroad, along with about 5 distinguished research faculty. The event will take place on Sunday, October 12, immediately preceding and in conjunction with the 2008 ACM ASSETS Conference, to be held Monday through Wednesday on October 13-15, 2008, in Halifax, Nova Scotia, Canada, and sponsored by the ACM Special Interest Group on Computers and Accessibility (SIGACCESS). The ASSETS conference is the premier forum for presenting research results and innovations in software and technology designed to address the special needs of people with disabilities of all kinds. Researchers and developers from both academia and industry around the world will meet to exchange ideas and present reports on the latest work relating to speech, motor, hearing, and vision impairments, cognitive limitations, emotional and learning disabilities, and aging. A key component of building this community is through its youth. The ASSETS 08 doctoral consortium will provide an opportunity for graduate students from diverse backgrounds (computing, engineering, psychology, architecture, etc.) to come together and explore their research interests in an interdisciplinary workshop, under the guidance of a panel of distinguished experts in the field, so that they can see the broader spectrum of research and development approaches to assistive technologies and universal usability, and also experience the community in which they can pursue their endeavors. Student participants will make formal presentations of their work during the consortium, and will receive constructive feedback from a faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will expose these promising young researchers to a larger community. Evaluation of the consortium will be conducted, and the results made available to the organizers of future such events. A session has been set aside during the main conference to allow doctoral consortium participants to present to the entire conference, and one student from the doctoral consortium will be selected to deliver the closing plenary presentation. More information is available online at http:\/\/www.sigaccess.org\/assets08.<br\/><br\/>Broader Impacts: The doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students? horizons are broadened to the future benefit of the field.","title":"Workshop: Doctoral Consortium for ACM Conference on Computers and Accessibility","awardID":"0833962","effectiveDate":"2008-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["517575"],"PO":["565227"]},"143928":{"abstract":"This project addresses homeland security, an issue of the highest national priority, with a goal of monitoring, preventing, and recovering from natural and inflicted disasters. In particular, in collaboration with team from UT Arlington, Penn State University and the University of Kentucky, the project will create a novel technology-enabled security framework, called Pervasively Secure Infrastructures (PSI), that will make use of such advanced technologies as smart sensors, wireless networks, pervasive computing, mobile agents, data mining, and profile-based learning in an integrated, collaborative and distributed manner. The uniqueness of this multi-disciplinary, multi-university proposal lies in the synergistic combination of the proposed research in (i) efficient data collection and aggregation from heterogeneous sensors and monitors; (ii) novel techniques for real-time, secured, authenticated information transmission and sharing, and (ii) intelligent situation awareness (e.g., threat detection and security services) through new learning, data mining, and knowledge discovery techniques. The project will mainly focus on authentication and secure data transmission in wireless networks. The project will integrate these research efforts in the novel paradigm of pervasive community computing that can efficiently handle dynamically changing information, adapt to changing situations, and provide scalability in terms of the number of users, devices, and data sizes.","title":"ITR Collaborative Research: Pervasively Secure Infrastructures (PSI): Integrating Smart Sensing, Data Mining, Pervasive Networking, and Community Computing","awardID":"0833849","effectiveDate":"2008-05-30","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":[383676],"PO":["469867"]},"139185":{"abstract":"Statistical Analysis of Neuronal Data (SAND4) is a workshop devoted to defining important problems in neuronal data analysis and useful strategies for attacking them. The conference will display novel statistical methods in the context of substantive neuroscientific research, and will highlight problems that require new statistical approaches. Throughout the conference an attempt will be made to discuss the interplay of statistical theory and practice. There will be 5 scientific sessions, at which 9 senior investigators and 16 junior investigators will speak. There will also be a poster session. A special issue of the Journal of Computational Neuroscience is planned for publication of selected papers from the conference.<br\/><br\/>Statistical Analysis of Neuronal Data (SAND4) is the fourth international workshop in the series that began in 2002. The workshops are held in even years at Carnegie Mellon University during the Spring. The fourth workshop will occur May 29-31, 2008. SAND4 will bring together neurophysiologists, statisticians, physicists, computer scientists, and engineers who are interested in quantitative analysis of neuronal data. This workshop series aims to foster communication between experimental neuroscientists and those trained in statistical and computational methods; and to provide further dissemination of the findings presented at the workshop via a set of peer-reviewed articles. Secondary objectives are to encourage young researchers, including graduate students, to present their work; expose young researchers to important challenges and opportunities in this interdisciplinary domain, while providing a small meeting atmosphere to facilitate the interaction of young researchers with senior colleagues; and include as participants women, under-represented minorities and persons with disabilities who might benefi from the small workshop environment.","title":"Workshop on Statistical Analysis of Neuronal Data (SANDS) - Participant Support, Pittsburgh, PA, May 2008","awardID":"0810224","effectiveDate":"2008-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1269","name":"STATISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["545100"],"PO":["540032"]},"136282":{"abstract":"Abstract:<br\/><br\/>This project focuses on the study of multi-agent systems (MAS) in social systems. The proposed research breaks into three parallel<br\/>projects: 1) multi-agent systems that support natural human decision- making, 2) a simulation of urban areas and their inhabitants that can be used in the MAS, and 3) a data analysis and visualization tool for the system. Students will receive training in a variety of areas, including multi-agent systems¡¯design and implementation, spatial modeling, empirical methods for system evaluation and statistical techniques for data analysis. In addition, students will attend professional meetings, learn to assimilate the latest research from reading and discussing recent papers, and learn how to write up and present the results of their own research. This REU program will focus on strong mentoring and individual contact with the students and will include weekly sessions to help them pursue graduate studies.<br\/><br\/>Intellectual Merit. The proposed research will develop a new multi- agent framework. Contributions to the MAS community will include a multi-agent system that represents dynamic interactions between agents and social structures that shape the agent¡¯s behaviors, and a decision-making mechanism that captures the common human decision- making attitudes through modeling the domain of human intuition. We will also use this MAS to simulate urban areas and their inhabitants and develop a data analysis and visualization tool for the system. <br\/>Students will have the opportunity to work in depth in the core area of MAS or with the application of the core area to different disciplines in computer science.<br\/><br\/>Broader Impact. This project creates a model program for liberal arts institutions that addresses the exposure to research by undergraduates as well as awareness of the pathway to graduate school. While the recruiting effort for students will be nationwide, we will emphasize the recruitment of students from underrepresented groups. Of particular interest to us are Hispanic students enrolled at the many Hispanic serving colleges and universities in South Texas. Training a more diverse engineering and science professoriate will benefit society significantly, not only in South Texas but nationally, in promoting a more equitable participation of minorities and women in the computer science disciplines.","title":"REU Site: Multi-Agent Simulations of Social Systems","awardID":"0755405","effectiveDate":"2008-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["468054","423736","376073"],"PO":["562760"]},"134490":{"abstract":"CCF-0746910<br\/>CAREER: System Support for Implicitly Parallel Programming<br\/><br\/>Matthew I. Frank<br\/><br\/>While multi-core processor designs allow peak performance to track Moore's law, they introduce new challenges for software developers. Explicitly multi-threaded programs generally take longer to develop, test, debug, and verify than sequential programs with equivalent functionality. Implicit parallelization, on the other hand, allows software engineers to develop parallel algorithms and applications in environments that provide sequential semantics, like the C programming language. System tools convert the parallel algorithms into a set of threads partitioned appropriately for a particular parallel machine organization. The resulting parallel programs are easier and faster to develop, debug, and maintain, because the programmer can request a meaningful and well defined program state at any point of execution. Because error checking code, code reuse, and variable scoping interfere with naive parallelization, this work will investigate system tools that perform reactive and speculative transformations to reduce the tension between application robustness and parallelization.","title":"CAREER: System Support for Implicitly Parallel Programming","awardID":"0746910","effectiveDate":"2008-05-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["526238"],"PO":["564388"]},"132291":{"abstract":"This project seeks to achieve more efficient and accurate assessment of students' mathematical reasoning by developing improved speech recognition technology, calibrated to recognize children's speech, and integrating it with a computerized mathematics education environment (SimCalc) involving interactive representations and simulations. Specific questions of interest include:<br\/>Q1. What are the most promising task-relevant mechanisms for constraining students? spoken responses in such a way that enables valid and reliable speech-based assessments despite the imperfect accuracy of automatic spoken language systems?<br\/>Q2. What are the most efficient modifications to existing spoken language technologies that achieve acceptable performance with middle-school students engaged in spontaneous speech acts about mathematical models, representations, and simulations?<br\/>Q3. Which aspects of the computer-based dynamic representation system must be integrated with student speech to provide a more complete representation of student knowledge of the mathematics underlying the model?<br\/>Q4. Which features of the combined output of the computer-based environment and student speech allow the spoken language understanding engine to reliably assign rubric-based scores to student work?<br\/><br\/>Assessments will address five key aspects of fluency with mathematical models: comprehending, predicting, explaining, improving, and reflecting. A particularly unique focus of this work will be on combining inputs from the speech recognition engine with time-stamped information from a mathematics education environment to reliably score student responses according to a rubric. In addition to its application to education, this research on adolescents' spontaneous mathematical speech will drive advances in spoken language technology.","title":"Speech Technology Enhanced Assessment of Modeling (STEAM)","awardID":"0735673","effectiveDate":"2008-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}}],"PIcoPI":["487391",351563,351564],"PO":["564318"]},"135361":{"abstract":"Significant performance gains can be obtained when software (i.e., compiled code) is optimized to exploit the hardware (i.e., processor microarchitecture) on which it is executed. For the compiler to generate optimized code for structures such as the cache memory, it needs to know the specification of the cache hierarchy, such as the associativity, block size, and so on. In this case, the code will be optimized only for that particular cache hierarchy and is not guaranteed to perform well on other machines with different cache architectures, raising portability issues. That is, the software may not execute efficiently on a wide range of machines when optimized for only a particular architecture. In this proposal, the PI proposes a framework that enables compiled code for embedded applications to be optimized for specific cache hierarchies without suffering from portability issues. The main goal is to close the gap between compilers and processor microarchitecture by providing a virtual cache system. With this, compilers can generate optimized code for specific cache architectures. When the code is executed on machines with different cache memories, the hardware will be dynamically reconfigured to take on the characteristics of the targeted cache architecture, thus exploiting the original optimizations made by the compiler.","title":"SGER: Exploring the Potential for Software-Informed Hardware Reconfigurability in the Memory Hierarchy of Embedded Systems","awardID":"0750951","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[359580],"PO":["550859"]},"136593":{"abstract":"This project focuses on the creation of novel user interface building tools that help designers create interactive behaviors. The designers using these tools are not professional programmers, but have training in Interaction Design, Graphic Design, Industrial Design, or an equivalent. Focusing on interactive behaviors, means a focus on what an application does as opposed to how it looks. Today, interactive behaviors are often programmed by designers using scripting tools, or else designers collaborate with developers who implement the designs in conventional languages. Exploring interactive behaviors today requires programming, and the techniques available to designers are too difficult to use, and do not adequately support the designers? fundamental need to explore. The intellectual merit of the project is an understanding of how designers think about and create interactive behaviors, and the invention of new methods, models and representations that allow designers to more naturally and creatively design behaviors using computers. A novel programming environment that explicitly supports creative exploration of alternative versions and fosters collaboration is the outcome. The broader impacts of the tool will be to enable designers to explore more interactive behaviors and be more creative, which will ultimately improve the user interfaces that they create and that we use every day.","title":"Pilot: Exploratory Programming for Interactive Behaviors: Unleashing Interaction Designers' Creativity","awardID":"0757511","effectiveDate":"2008-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["451255","548127","413598"],"PO":["424970"]},"132293":{"abstract":"Intelligent tutoring systems have been widely studied and applied to a variety of subjects. Most systems are based on traditional computer interfaces involving windows, icons, mouse, and pointer. Research shows that transfer from training to testing is greater when testing and training environments are similar, suggesting benefits from creating and evaluating tutoring systems with interfaces that match real-world problem-solving environments. This project aims to create pen-based tutoring systems that scaffold students in the same way they would ordinarily solve problems with paper and pencil. This goal is consistent with recent research comparing student performance across different user interfaces, demonstrating that the interfaces matching familiar work practice enhanced student performance.<br\/><br\/>From a technology perspective, the project will produce basic algorithms and user interfaces for creating pen-based tutoring software. From an education perspective, the project will develop and evaluate innovative pedagogical principles for individualizing statics instruction in pen-based environments. Statics is a critical field required for engineering and science majors.<br\/><br\/>The project will create computational techniques and tutoring systems for both tablet and pentop computers, and will assess the strengths and limitations of the two platforms. Comparisons will also be made with paper-and-pencil and traditional computer interfaces. A tablet computer has an LCD display with an integrated digitizer; the user writes directly on the display using a stylus. A pentop is a pen with an integrated digitizer and embedded processor. A pentop uses paper preprinted with a grid that allows the system to locate the pen tip and digitize pen strokes.<br\/><br\/>The tutors build upon two prototype, pen-based tutoring systems recently developed by the research team. The first, Newton's Pen, is a statics tutor implemented on the LeapFrog FLY pentop computer. The second, Kirchoff's Pen, uses a tablet computer to help students apply Kirchhoff's current and voltage laws. Preliminary studies with Newton's Pen show it is an effective teaching tool. The prototypes uncovered several important research issues that will be ad-dressed by the proposal. The project will: (1) develop new techniques for interpreting hand-written input to enable more fluid interaction with pen-based devices, (2) develop improved, pedagogically-sound user interface design principles for pen-based tutoring systems, (3) expand the class of statics problems beyond those investigated with Newton's Pen, (4) assess the educational value (both learning and transfer) of the tutors, and (5) identify the relative strengths and weaknesses of tablet and pentop platforms for instruction.","title":"Design and Evaluation of a Pen-Based Tutoring System for Statics Instruction","awardID":"0735695","effectiveDate":"2008-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}}],"PIcoPI":["423492","423493"],"PO":["564318"]},"137760":{"abstract":"North Carolina Agricultural and State University, in collaboration with Auburn University, propose to investigate the potential of a novel program that uses design and development competitions to impact the underrepresentation of women and African-American students in computing. The program will involve students in a year-round set of activities, including coaching, practice sessions, and a series of intercollegiate meets. It will culminate in a Software Design and Development (SDDTT) tournament. The project will determine whether these activities have the potential to increase the retention of students by (1) enabling them to see how concepts covered in classes are used in practice in the real world, and (2) integrating them into a community that provides a sense of belonging and the opportunity to contribute to something larger than a class assignment. The project will explore the initial development of an SDDTT approach, assessing its impact in particular on the attitudes and retention of women and African Americans in computing.","title":"NSF BPC-DP (SGER): Software Designn & Development Teams and Tournament","awardID":"0804138","effectiveDate":"2008-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["492625","367781",366191,"554885"],"PO":["561855"]},"135395":{"abstract":"Treebanks are corpora of naturally occurring text that have been annotated with morphological and syntactic (structural) information. <br\/>In the last 15 years they have led to significant advances in natural language processing (NLP) results by providing training data for supervised machine learning algorithms. These algorithms can now automatically perform useful part-of-speech tagging, parsing and semantic interpretation. This project is creating a new-generation, multi-representational Treebank. The languages being annotated are Hindi (400K words) and Urdu (200K words). The texts are being annotated in dependency structure (trees in which all nodes are labeled with words of the sentence), enriched with additional semantic role labels. The dependency representation is also being automatically mapped to a phrase-structure representation (in which the words are at the leaves of the tree and internal nodes are labeled with phrase markers). After applying standard quality-control both versions will be released to the public, providing an immediate boost to the performance of Hindi\/Urdu NLP. A tool will also be released that will allow a researcher to produce alternative formatting of the phrase structure representation. This supports a view of the treebank as a more general, abstract representation of the morphology and syntax of the language rather than merely as data for a particular style of machine learning experiment. Research into parsing and other NLP tasks has recently recognized the benefits of reformatting syntactic representations in order to improve the machine learning process; this treebank will make that step much easier for all NLP researchers interested in Hindi or Urdu in particular and in language in general.","title":"Collaborative Research: CRI: CRD: A Multi-Representational and Multi-Layered Treebank for Hindi\/Urdu","awardID":"0751089","effectiveDate":"2008-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["507533"],"PO":["565215"]},"142271":{"abstract":"Programming languages play a critical role in computer science by providing a flexible and robust interface through which human beings control computer systems. In the past ten years, programming language design and implementation has advanced significantly in response to the pervasiveness of computer science and technology. This award will fund a new workshop that will bring together programming language experts from research, educational, and industrial institutions to discuss the role of programming language design, implementation, and application in modern, undergraduate computer science education. The participants will critically evaluate the state of programming language education and identify the transformational changes needed to best prepare undergraduates in the US educational system to compete in, to contribute to, and to advance the rapidly changing field of computer science and technology. The workshop will produce a report to disseminate the resulting ideas to the broader community to spark continued efforts to have programming language curriculum keep pace with higher-education curricula Cutting-edge curricula are essential to prepare a U.S. workforce that is globally competitive, able to generate and to apply new knowledge, and to take the lead in advancing computer science and technology.","title":"Workshop on Modern Programming Language Curricula","awardID":"0825525","effectiveDate":"2008-05-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"H184","name":"National Security Agency"}}],"PIcoPI":["473711","561463"],"PO":["564388"]},"135770":{"abstract":"IIS - 0752768 <br\/>SGER: New Representations of Musical Sound<br\/>Bocko, Mark F.<br\/>University of Rochester<br\/><br\/>This SGER project proposes a new representation for encoding musical performances capable of capturing expressive and syntactic components of the performance and extending the ability to manipulate, analyze musical digital information. By focusing on the twin themes of music representation and recognition, new fundamental concepts will be developed that will enable the development of new tools to acquire, organize, and interpret musical knowledge. The project team has backgrounds in music theory and performance, engineering, signal processing, and physics and will conduct a number of interrelated projects that contribute to the main goal of developing a new musical language. Performance techniques of master musicians (performance professors at the University of Rochester's Eastman School of Music) will be recorded and studied with the goal of identifying the parametric representations that most accurately and compactly depict the music. From these a more robust representation of musical sounds and performance descriptors will be developed.","title":"SGER: New Representations of Musical Sound","awardID":"0752768","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[360639,360640,360641],"PO":["433760"]},"134571":{"abstract":"Computation has fundamentally changed the way we study nature. Recent breakthroughs in data collection technology, such as GPS and other mobile sensors, gene sequencing, and microsatellite genotyping, are giving biologists access to data about wild populations, from genetic to social interactions, that are orders of magnitude richer than any previously collected. Such data offer the promise of answering some of the big questions in population biology: How do animals form social groups and how do genetic ties affect these processes? Which individuals are leaders and to what degree do they control the behavior of others? How do social interactions affect the survival of a species? Unfortunately,in this domain,our ability to analyze data lags substantially behind our ability to collect it. There are three major drawbacks with currently available techniques for analysis of both genotypic and social structure data. First, most traditional methods are aggregate and numeric, thus they are inappropriate for identifying infrequent yet critical events, such as response to predation. Second, the newer approaches focus on human populations and are not directly applicable in the context of wildlife biology. Finally, current analysis techniques are essentially static in that all information about the time and order of social interactions or the concurrency of gene expressions is discarded. Thus, they lack the expressive and computational power to answer the questions outlined above. <br\/><br\/>Intellectual Merit<br\/>The goal of this interdisciplinary research is to develop a robust and scalable computational framework for the emerging field of computational population biology. Ultimately, this research will enable biologists in their scientific inquiry to take advantage of new data by focusing on its underlying qualitative (rather than numerical) and explicitly dynamic structure. This research will use combinatorial techniques to extract that structure. In the scope of this project the following will be developed:<br\/>1. Techniques for inferring genetic relationships in wildlife populations and using them to predict genetic diversity.<br\/>2. Novel computational methodologies and tools for analyzing dynamic social interactions, focusing on prediction of interaction patterns and dynamic processes within populations.<br\/>3. Techniques for combining the genetic and the social structures of a population and across species to identify global ecological processes. <br\/><br\/>Broader Impacts<br\/>Many students, especially female, turn away from computer science in part because of the perceived lack of its applicability to real-world issues and impact on the society. This project has the potential to attract those who would otherwise be lost to computing by providing the view of its larger impact and connection to science. A comprehensive interdisciplinary education and outreach plan will be developed which bridges the traditional pipeline from K-12 to graduate education. The standard views of mathematics and computing will be broadened to include \"puzzle-solving\" combinatorial thinking by introducing hands-on outreach activities. The unique conflation of wild life biology and computing will continue to be presented at various forums aimed at attracting minorities and girls to science and computer science. Finally, through introduction of biological motivation in computer science courses and the computational methodology in biology courses, this research will provide the students in both disciplines with experiences in asking and answering biological questions by developing new applications of computer science. The methodologies, concepts, and tools developed as part of this interdisciplinary research will be useful to scientists in diverse fields such as behavioral ecology, conservation biology, and disease ecology. Techniques for analysis of social structures have broader relevance to human societies, especially in the context of epidemiology, dissemination of ideas, and crisis management.","title":"CAREER: Computational Tools for Population Biology","awardID":"0747369","effectiveDate":"2008-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"6892","name":"CI REUSE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["533275"],"PO":["560586"]},"143350":{"abstract":"The project supports graduate student participation in the 25th International Conference on Machine Learning (ICML 2008). Specifically, the project supports travel to the conference for those who might not otherwise be able to attend for financial reasons and organizes a student poster-presentation program that will facilitate one-on-one discussions and other mentoring with the world's leading researchers in machine learning. Students will be exposed to state-of-the-art work by other researcher and will have the opportunity to attend tutorials on material that is not taught at their home institutions. Participating students will receive feedback from senior researchers beyond their institutional and national boundaries. Furthermore, participation in the poster session and conference will help integrate these students into the research community and represents a natural integration of research and education.","title":"Student Poster Program and Travel Scholarships for ICML 2008","awardID":"0830962","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518332"],"PO":["387198"]},"136035":{"abstract":"The focus of this SGER project is on the Web Services model that uses open standards, such as HTTP (Hyper Text Transfer Protocol), XML (Extensible Markup Language), or one of many other in-use or emerging standards. In particular, the project addresses the support of grid technologies with Web Services. Grid technology can deliver teraflops of computer cycles and peta-bytes of storage systems, interconnected by gigabit networks. But, the realization of this potential depends on the development of tools, applications and infrastructure that exploit it and lend themselves to easy deployment by end users.<br\/><br\/>The adoption of Web services in grid middleware and applications is primarily due to rich features. However, use of the currently available Web services implementation stacks can impact performance of grid applications. A critical component that is missing for Grid Web services is a set of fundamental metrics and micro-benchmarks for Web services based grid middleware\/applications that provide insights on performance limitations, bottlenecks, and opportunities for optimizations. The focus of this one year project is on the design and development of a set of core-kernel micro-benchmarks and application-class workloads for Web services -- standard sets of workloads to test the various features and performance characteristics of Web service implementations, rather than their interoperability. This public benchmark framework will provide a standard mechanism to quantify, compare, and evaluate the performance of toolkits and study the strengths and weaknesses for a wide range of representative use case scenarios. <br\/><br\/>The broader impacts of this project are that the outcome, a benchmark suite, may aid in the scientific understanding and evolution of grid middleware to meet the performance requirements necessary for adoption by the wider scientific community. The development of tools, middleware and applications that employ state-of-the-art performance enhancements and techniques will help in exploiting the true potential of the grid infrastructure for many scientific applications. The core-kernel benchmarks also have the potential of being adopted by the grid community as a standard for performance evaluation of Web services. Use of the open-source programming model and publication of documentation and tutorials on the project web page will help in dissemination of the results.","title":"SGER: Performance Analysis and Optimization of Grid Web Services","awardID":"0754129","effectiveDate":"2008-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["434750"],"PO":["493916"]},"139501":{"abstract":"Proposal No.: 0811541<br\/>Title: Model-based Test Generation for Embedded Software with Simulink\/Stateflow or Hybrid Automata Models<br\/>PI: Ratnesh Kumar and Changyan Zhou, Dept. of Elec. & Comp. Eng., Iowa State Univ., Ames, IA<br\/><br\/>A model-based test generation approach for embedded software systems that are reactive (interact with their environment), possess hybrid behaviors (continuous dynamics mixed with switching logics), and can be modeled using Simulink\/Stateflow or hybrid automata models, is proposed. Simulink\/Stateflow is a graphical modeling, analysis, and simulation tool for embedded software development, and is widely used in industries such as automobile, aircraft, and medical devices. The intellectual merits of this research include: (i) Translation of Simulink\/Stateflow models into hybrid automata models (to the extent possible), (ii) Test generation for hybrid systems based on discrete-behaviors preserving abstractions and system identification techniques, and (iii) Development of supporting software to be integrated with the Matlab Simulink\/Stateflow environment. The proposed research is likely to have an impact in application domains where Simulink\/Stateflow is routinely used for embedded software development. Some of the techniques developed as part of the project may find application in other areas such as verification or monitoring for fault identification. The project will support two new researchers who will be trained in model-based approaches to embedded software testing. The research outcomes, including software tools, will be made available through PIs' homepages and journal\/conference publications. The PIs are committed to recruiting minority students for the project.","title":"Model-based Test Generation for Embedded Software with Simulink\/Stateflow or Hybrid Automata Models","awardID":"0811541","effectiveDate":"2008-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[370812,"554285"],"PO":["564388"]},"136597":{"abstract":"Representation is a central construct in the creative process. Exploring alternate representations can significantly increase the quality of artifacts created, and using multiple representations enables creators to broadly consider the multifaceted nature of the problem spaces they explore. Narrative offers an ideal laboratory for investigating multiple representations in the creative process because stories can be expressed in rich text (a static, uni-modal representation) re-represented in animated stories with accompanying narration and spoken dialogue (a dynamic, multimodal representation). The objective of the proposed research is to design, build, and empirically evaluate an interactive creativity environment that facilitates the exploration of alternate representations in the creative process. In particular, the proposed work will focus on the Narrative Theatre, an interactive narrative-centered creativity environment.<br\/><br\/>The project will yield a cognitive account of creativity that will inform the design of next-generation creativity environments. By promoting rich interactions that are simultaneously effective and engaging, it will find broad application in education and training technologies. The project will increase the participation of women and underrepresented minorities. It will involve a diverse population in the Narrative Theatre user studies, it will involve women in all aspects of the research, it will train undergraduates through involvement in formal and informal research exposure efforts, and it will increase the participation of women and underrepresented groups in computer science through interaction with the STARS Alliance.","title":"Major:The Narrative Theatre - A Creativity Enhancement Environment","awardID":"0757535","effectiveDate":"2008-05-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["561013","376657"],"PO":["564456"]}}