{"174042":{"abstract":"This research explores application development and optimizations for cloud platforms by developing: 1) cloud based parallelization for data intensive graph algorithms, 2) a framework for efficient scheduling and execution of applications in a heterogeneous cloud environment, and 3) hierarchical programming abstraction to specify parallelism. The work investigates and adapts wealth of techniques in traditional parallel computing for graph problems based on a performance model of the cloud and explore strategies for scheduling and load balancing applications on the cloud. These include centralized and distributed approaches for scheduling and work stealing and work sharing. Methodologies to evaluate the framework in executing applications that involve data intensive graph computations are being developed. The broader impact of this project includes addressing key challenges in the areas of application mapping and performance optimization. The research makes developing data intensive graph applications across public and private clouds easier. The developed software will be released as free and open source software to the community, making it possible for researchers and engineers in academia and industry to leverage this work and develop applications for the cloud. Graph problems and streaming applications arising in the area of energy informatics are considered to illustrate the techniques.","title":"CiC (RDDC) Parallelizing Large Scale Graph Problems on the Cloud","awardID":"1048311","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["563658",466860],"PO":["565272"]},"176187":{"abstract":"The Evolution Park provides a testbed for applying evolutionary computation to the development and control of autonomous robotic systems. Mixed populations are created, including some robots and some natural systems to facilitate a form of biomutualism where biology, engineering and computer science inform one another in synergistic and mutually beneficial ways. The 3D printer enables the realization of physical bodies (morphologies) that evolve concurrently with their control systems. The fabricated bodies are coupled with electroactive polymer materials to produce artificial organisms capable of locomotion without motors. Specially instrumented aquatic environments allow robotic fish to be used as stimuli to elicit behavioral responses in living fish under conditions manipulated by the experimenter. A collection of high-performance graphics workstations with large monitors facilitate fine-grained, interactive analysis of evolved behaviors in simulated robots, as well as analysis of video data captured by underwater cameras.<br\/><br\/>This infrastructure enables compelling new research directions in evolutionary robotics and squarely builds on previous work by the PIs on group communication and cooperative behavior, parallel processing, wireless networking, autonomic computing, distributed algorithms, high-assurance software, complex behavior in natural organisms, sensors and actuators, robotic fish, bio-inspired robots and swarms, as well as speciation and the evolution of communication. These advances benefit many applications in science and engineering, public safety, and national defense. The Evolution Park supports several innovative educational and outreach activities. Such endeavors provide a framework for hands-on experiments that are integrated into university courses, teacher training workshops, summer camps and after-school programs for K-12 students.","title":"II-EN: Evolution Park - An Evolutionary Robotics Habitat for the Study of Crawling, Swimming and Flying Creatures","awardID":"1059373","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[472157,"560245",472159],"PO":["543539"]},"184592":{"abstract":"This is funding to support travel by 6-8 students currently enrolled in PhD programs in the United States to present their accepted papers and posters and\/or to take part in the Doctoral Consortium at the 2011 International Conference on User Modeling, Adaptation, and Personalization (UMAP) to be held in Girona, Spain, on July 11-15, 2011. UMAP, the premier user modeling conference in the world, was formed in 2009 as a merger of the long-running and successful biennial conference series on User Modeling (UM, 1986-2007) and the Adaptive Hypermedia and Adaptive Web-Based Systems (AH, 2000-2008); the former provided a forum where academic and industrial researchers from the many fields involved in user modeling research (artificial intelligence, human-computer interaction, education, linguistics, psychology, and information science) could exchange their complementary insights on user modeling issues, while the latter provided a forum for dissemination of adaptive technology for hypermedia and other web-based systems. User modeling has been found to significantly enhance the effectiveness and usability of software systems in a variety of areas. A user model is an explicit representation of properties of a particular user; a system that constructs and consults user models can adapt diverse aspects of its performance to individual users. Applications for user modeling range from electronic commerce and intelligent learning environments to health care and assistive technologies. Relevant platforms for user modeling include mobile and wearable systems, and smart environments, as well as individual desktop systems, groupware, adaptive hypermedia, and other web-based systems. More information about the conference is available at http:\/\/www.umap2011.org. <br\/><br\/>The UMAP 2011 Doctoral Consortium will provide a unique opportunity for PhD students partway through their dissertation research to receive valuable feedback from top researchers in the field. The event will be held in a special session that is open to all students, not only those accepted to present, as well as to regular conference attendees, and which is designed so as to provide a great educational opportunity for all attending students, a unique event where a community as a whole can engage in a discussion with students about emerging topics, expected rigor, evaluation approaches, etc. Each student participant will be allotted 15 minutes in which to present his\/her work (including a short demo if appropriate), with an additional 15 minutes allocated to questions and for discussion. Both during the question\/discussion period and in subsequent informal interactions, committee members and other conference participants will provide constructive comments on the student's work and attempt to address any aspects of the work on which s\/he has requested advice. Student papers will be published in the main proceedings of the conference. <br\/><br\/>Broader Impacts: Bringing young and creative researchers to UMAP 2011 will help advance an important and socially valuable research field. NSF funding will significantly impact the careers of the next generation of User Modeling researchers, by enabling a number of them to take part in an important event they would otherwise have to miss. The students will have an opportunity to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. Participation will help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior investigators at a critical stage in their professional development. In allocating NSF funds to participants, the organizers will give preference to students who are placed at a disadvantage due to the conference's location in Europe; they will strive for diversity among the selected students across a number of dimensions (gender, racial, ethnic, disabilities, institutional, etc.), and they will also take special steps to promote participation from institutions with relatively large numbers of students from under-represented groups.","title":"Supporting Students Attending the User Modeling, Adaptation and Personalization 2011 Conference","awardID":"1135374","effectiveDate":"2011-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["496622"],"PO":["565227"]},"184130":{"abstract":"This award provides funding to support the travel of 13 US-based graduate students to attend the<br\/>23rd ACM Symposium on Operating Systems Principles (SOSP 2011) which is held in Cascais, Portugal.","title":"Student Travel Support for the 23rd ACM Symposium on Operating Systems Principles (SOSP 2011)","awardID":"1132046","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["502415","309350"],"PO":["493916"]},"185373":{"abstract":"A hallmark of the scientific method has been that experiments should be described in enough detail that they can be repeated and perhaps generalized. This implies the possibility of repeating results on nominally equal configurations and then generalizing the results by replaying them on new data sets, and seeing how they vary with different parameters. In principle, this should be easier for computational experiments than for natural science experiments, because not only can computational processes be automated but also computational systems do not suffer from the \"biological variation\" that plagues the life sciences. Unfortunately, the state of the art falls far short of this goal. Most computational experiments are specified only informally in papers, where experimental results are briefly described in figure captions; the code that produced the results is seldom available; and configuration parameters change results in unforeseen ways. Because important scientific discoveries are often the result of sequences of smaller, less significant steps, the ability to publish results that are fully documented and reproducible is necessary for advancing science. While concern about repeatability and generalizability cuts across virtually all natural, computational, and social science fields, no single field has identified this concern as a target of a research effort.<br\/><br\/>This collaborative project between the University of Utah and New York University consists of tools and infrastructure that supports the process of sharing, testing and re-using scientific experiments and results by leveraging and extending the infrastructure provided by provenance-enabled scientific workflow systems. The project explores three key research questions: (1) How to package and publish compendia of scientific results that are reproducible and generalizable. (2) What are appropriate algorithms and interfaces for exploring, comparing, re-using the results or potentially discovering better approaches for a given problem? 3) How to aid reviewers to generate experiments that are most informative given a time\/resource limit.<br\/><br\/>An expected result of this work is a software infrastructure that allows authors to create workflows that encode the computational processes that derive the results (including data used, configuration parameters set, and underlying software), publish and connect these to publications where the results are reported. Testers (or reviewers) can repeat and validate results, ask questions anonymously, and modify experimental conditions. Researchers, who want to build upon previous works, are able to search, reproduce, compare and analyze experiments and results. The infrastructure supports scientists, in many disciplines, to derive, publish and share reproducible results. Results of this research, including developed software will be available via the project web site ( http:\/\/www.vistrails.org\/index.php\/RepeatabilityCentral).","title":"III: EAGER: Collaborative Research: A Community Experiment Platform for Reproducibility and Generalizability","awardID":"1139832","effectiveDate":"2011-04-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["521992"],"PO":["563751"]},"174032":{"abstract":"In the life sciences, today?s DNA sequencers can generate a terabyte (or 1 trillion bytes) of data in a minute. As a consequence, the size of DNA sequence databases is growing faster than they can be computed upon with a personal computer. Thus, scientists and engineers must increasingly rely on the parallelism of high-performance computing (HPC) to keep pace. Unfortunately, not only are such HPC resources costly to own and maintain, but they are also difficult to access and use. <br\/><br\/>The MetaRx software environment addresses the above issues by transforming and commoditizing cloud computing infrastructures, such as Microsoft Azure, to massively accelerate the discovery process for scientists and engineers. This transformation and commoditization of cloud computing provides scientists with the capability of provisioning large amounts of computational and storage resources via an easy-to-use interface to the cloud, including the capability of ?teleporting? data via a ?WonkaVision for scientific data? metaphor. With computing widely recognized as the third pillar of science, complementing the traditional pillars of theory and experimentation, and with data-intensive scientific discovery emerging as a fourth pillar (or fourth paradigm) of science, MetaRx empowers the domain scientist to focus on his\/her science rather than the minutia of high-performance computing.","title":"CiC (RDDC): Commoditizing Data-Intensive Biocomputing in the Cloud","awardID":"1048253","effectiveDate":"2011-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8010","name":"Computing in the Cloud"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":[466830,"563449","556599"],"PO":["565272"]},"177310":{"abstract":"Supervised Natural Language Processing (NLP) systems perform poorly on domains and vocabulary that differ from training texts. A growing body of empirical and theoretical work points to the features used by traditional NLP systems as the culprit for domain-dependence and for the inability to generalize to previously unseen words. <br\/><br\/>This project is the first to systematically investigate representation-learning as a technique for improving performance on domain adaptation. It explores latent-variable language models ? including Factorial Hidden Markov Models, dependency parsing models, and deep architectures ? as techniques for extracting novel features from text. The resulting representations yield similar features for distributionally-similar words, thereby allowing generalization to words not seen during training of a classifier. The project also explores novel procedures for training a language model, which incorporate Web-scale ngram statistics as substitutes for standard statistics used in unsupervised training.<br\/><br\/>Language users are extraordinarily inventive, and new domains of discourse appear constantly, such as in specialized areas of science and technology. By building on top of the representations produced by this project, NLP systems can improve in accuracy on new domains and on Web text, bringing applications like the Semantic Web closer to reality. For resource-poor languages and domains, the project can help reduce the cost of annotating texts by reducing the need for broad coverage in the training texts. By involving the diverse student bodies at Temple University and Philadelphia-area high schools, the project helps to broaden participation in computer science research by underrepresented groups.","title":"RI: Medium: Collaborative Research: Learning Representations of Language for Domain Adaptation","awardID":"1065270","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[475349],"PO":["565215"]},"177299":{"abstract":"The CirrusDB project seeks to address several key challenges that arise when building a \"database as a service\". The goal of such a service is to provide a SQL interface to many applications, storing data that today might be spread across hundreds or thousands of separate database management systems. This is attractive because the costs incurred by individual users in the form of software licensing, hardware, management, and energy can be substantially lowered because it will be possible to multiplex many different databases onto a smaller footprint. Moreover, the costs can be made proportional to actual usage, saving significant up-front investments by application developers. <br\/><br\/>The intellectual merit of CirrusDB relates to three key challenges in this area:<br\/><br\/>1) Multi-tenancy, in which the resource use of a complex set of database workloads are monitored and the databases are consolidated on to a minimum number of physical machines while ensuring performance isolation and live migration with no downtime. Unlike existing work on large-scale multi-tenancy, which has focused on co-locating tenants with similar schemas, CirrusDB attempts to co-locate tenants which have resource utilization profiles that will not exceed the capacity of the machine on which they are hosted.<br\/><br\/>2) Scalability in which the responsibility for query processing (and the corresponding data) is partitioned amongst multiple nodes in the service to achieve high throughput, using a novel graph partitioning strategy.<br\/><br\/>3) In which the DBaaS infrastructure executes SQL queries issued by applications over encrypted data, enabling complete SQL processing over fully private data. The key idea is to use the notion of \"adjustable security\" by encrypting the data in layers in a way that allows not just equality checks but also range queries, sorting operations, and joins to be executed efficiently.<br\/><br\/>CirrusDB will have broad impact in that it will result in database solutions that will a enable large, multi-node database service to be deployed both on a public cloud as well as in private data centers, providing multi-tenancy, scale-out using automatic partitioning, and privacy for SQL query execution. This will result in significantly lower administrative and capital costs required to run large-scale databases. CirrusDB will also reduce the barrier to entry for applications that use databases, because it will not be necessary to have in-house database expertise even when one needs high transactional performance.<br\/><br\/>For further information see the project web site at the URL: http:\/\/db.csail.mit.edu\/cirrusdb\/","title":"III: Medium: Scalable and Secure Database as a Service","awardID":"1065219","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["525076","562012","508283"],"PO":["563727"]},"174033":{"abstract":"With the development of sequencing technologies, over 1,400 bacterial genomes have been sequenced and this number is rising exponentially. To understand these organisms, we first need to identify all the functional sequences in the genomes. Although tremendous advances have been made in computational prediction of gene-coding sequences in genomes, our ability to accurately predict another type of important functional sequences--transcription factor binding sites (TFBSs) is still very limited due to the notorious difficulty of the problem. In this project, researchers will develop accurate algorithms and tools for predicting TFBSs in genomes at a large scale using a graph-theoretic approach. The algorithms will then be parallelized and adapted to the Microsoft Azure cloud platform to predict TFBSs in thousands of sequenced bacterial genomes.<br\/><br\/>Since it remains an unsolved task to efficiently and accurately predict TFBSs in all sequenced bacterial genomes, the algorithms, tools and predictions resulted from this project will greatly aid in deciphering gene regulatory networks in sequenced bacterial genomes. This will directly impact our ability to understand bacteria and utilize them for various purposes, and thus provide the foundations for new strategies for renewable energy production, environment protection, and infectious disease prevention.","title":"CiC (SEA): Large Scale Prediction of Transcription Factor Binding Sites for Gene Regulation Using Cloud Computing","awardID":"1048261","effectiveDate":"2011-04-01","expirationDate":"2014-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}}],"PIcoPI":["553786","554356"],"PO":["565272"]},"175265":{"abstract":"As the number of cores increases on the same die, computer architects and system designers have focused their attention to the on-chip network that is used for communication between the cores. Two of the major problems facing on-chip architectures are excessive power dissipation and reduced network performance. One approach to extend the performance of future multi-cores is to integrate new technologies, such as nano-photonics into the electronic design flow. Nano-photonics offers a scalable, low power per bit and a high- performance technology solution to current electrical signaling and interconnect bottlenecks. This research seeks to exploit this emerging field of nano-photonics and design reconfigurable, energy-efficient and high- performance on-chip architectures and switching interconnects. The goal of this research is to develop interconnects that can dynamically tune to the application and regulate power and bandwidth without system intervention. <br\/><br\/>The proposed research will have a significant impact on the design of future multi-cores using nano-photonics. The proposed research will make advances in the understanding of the interplay between performance, energy, hardware complexity and reconfigurability. This research will also play a major role in education by integrating research with teaching and training. The educational goal of this multi-disciplinary and multi-faceted proposed research is to expose undergraduate and graduate students to diverse technological advancements with an emphasis on critical analysis and reasoning to overcome limitations of current technologies. Finally, the results and findings of the proposed research will be disseminated to researchers, engineers and educators through technical publications and presentations.","title":"CAREER: Design of Reconfigurable Power and Area-Efficient Nanophotonic Architectures for Future Multi-cores","awardID":"1054339","effectiveDate":"2011-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["559859"],"PO":["562984"]},"176189":{"abstract":"This project is carried out by a team of scientific computing researchers, computer systems researchers, and computer science educators. A cutting-edge compute and storage cluster is built to enable multidisciplinary research on computer systems and scientific simulations. This cluster consists of a stable compute partition with GPGPU processors for scientific computing and an experimental storage partition for computer systems research. Leading groups at Auburn University in the areas of computational atomic physics, climate and ecosystem modeling, and computer science plan to use this computing infrastructure in their research. <br\/>This research infrastructure strengthens computer science research on parallel programming models, parallel I\/O, file systems, storage, and data-intensive analytics. In addition, it cultivates new multidisciplinary research projects on computational climate modeling, computational atomic physics, and applied computer science. Furthermore, it allows better pedagogical methods and education activities to attract more students, particularly from underrepresented groups, for computing careers. The project's research is expected to result in optimized scientific codes, fine-grained ecosystem simulations, and accurate environmental change predictions. Research results will be published in computational and computer science journals and international conferences. Open source software packages from this project will be released for community services.","title":"II-New: A Compute and Storage Cluster for Multidisciplinary Research on Computer Systems and Scientific Simulations","awardID":"1059376","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["543676","529380","542300","559143"],"PO":["565272"]},"175310":{"abstract":"Originally thought to be a relatively uncommon phenomenon, alternative splicing is now appreciated to be a widespread and primary mechanism by which eukaryotes have expanded the structural and functional diversity of their encoded proteome. The new generation of ultra-high throughput sequencers has opened up new ways to study the cell?s alternative splicing and its variation in response to environmental conditions. Accurate characterization of the transcriptome from the hundreds of millions of random short sequences sampled from messenger RNA samples, however, is still an unsolved problem. The PI proposes a research plan involving a set of novel computational approaches to address the issue. It includes: (1) a maximum likelihood approach to achieve highly sensitive and accurate identification of both novel and known splicing and fusion events; (2) a genome-wide transcriptome comparison method to detect statistically significant differential alternative splicing patterns across biological samples; and (3) data mining algorithms to reconstruct co-regulated splicing networks carrying out specific biological functions. <br\/><br\/>The successful implementation of this research plan will produce a suite of computational and statistical methods implemented as open source software to meet the immediate demand from the biology community for the analysis of high throughput RNA-seq datasets. These tools will enable individual scientists to assess the mRNA transcriptome in a matter of days using samples from any organisms with a reference genome. <br\/><br\/>The integrated educational program aims to increase the awareness of bioinformatics as a critical interdisciplinary research area among both undergraduate and graduate students from biology, computer science, and engineering at the University of Kentucky (UKy). The PI is committed to enrich the undergraduate curriculum with a new introductory bioinformatics course and to improve cross-disciplinary research training opportunities for graduate and undergraduate students through the Bioinformatics Certificate Program and a newly established Biomedical Informatics Department at UKy. In addition, the PI will emphasize recruitment and retention of under-represented groups including female students and students from the Appalachian region through the NSF funded AMSTEMM program at UKy.","title":"CAREER: Algorithms and Applications for Next Generation High-Throughput Sequencing Technologies","awardID":"1054631","effectiveDate":"2011-04-15","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[470107],"PO":["565136"]},"177235":{"abstract":"This project investigates a new approach for describing and reasoning about security properties of smartphone applications. Smartphones are becoming pervasive, and smartphone applications are increasingly used for a variety of social, health, scientific, and military purposes. However, the capabilities these phones provide, such as access to GPS, camera, Internet, calendar, contacts, and other sensitive information can lead to major security risks. Today's smartphone development methodologies do little to help developers construct applications that safely access sensitive resources.<br\/><br\/>The goal of this project is to develop new program analysis techniques that can help developers express, reason about, and enforce security policies in smartphones. The proposed technical approach will allow developers to define rich security policies in an intuitive and flexible manner: as program code that interacts with a mobile application and checks desired properties. To ensure that application code conforms to such policies, the project is pursuing several techniques that leverage recent advances in static and dynamic program analysis. The project is also investigating approaches to automatically synthesize a code-based policy for a given application. The project is instantiating these ideas in the context of Google's Android operating system, and is evaluating the ideas in terms of effectiveness and performance on a broad range of Android-based smartphone applications.","title":"TC: Medium: Collaborative Research: Program Analysis for Smartphone Application Security","awardID":"1064844","effectiveDate":"2011-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["515836"],"PO":["564388"]},"177279":{"abstract":"Meshing has been a cornerstone for simulations using the finite<br\/>element method. But more recently it has had applications wherever<br\/>one needs to define a function over a domain, such as, graphics,<br\/>computer aided design, robotics, and even machine learning. Algorithms<br\/>will be designed to efficiently work in any fixed dimension with<br\/>guarantees on output size and quality.<br\/><br\/>At present, no theory exists to formulate and produce optimal meshes<br\/>in the presence of small input angles even for the 2D case. The<br\/>research will find efficient algorithms 2D and higher dimension that<br\/>generate optimal size Delaunay triangulations using only simplices<br\/>with no angles approaching 180 degrees.<br\/><br\/>Machine learning applications need a meshing algorithm that runs in<br\/>polynomial time for meshing n points in log n dimensions.<br\/>Historically, meshing algorithms return a set of space-filling<br\/>simplices. Even good aspect ratio simplices have too small a volume<br\/>and return a mesh that is of super polynomial size. Thus, new<br\/>algorithms will be developed that handle atomic objects that are have<br\/>much larger volume than simplices.<br\/><br\/>The results from this project are eminently practical and have broad<br\/>impact on the Sciences, Engineering, Manufacturing, and Machine<br\/>Learning. In particular, meshing is an enabling technology for<br\/>designing efficient windmills and cars, and simulations of earth<br\/>quakes and medial devices. One goal is to incorporated techniques<br\/>from this research into our first generation 3D code that we made<br\/>available on the web. In addition, this material will be incorporated<br\/>into classes taught at CMU, lectures, and papers presented at<br\/>conferences.","title":"AF: Medium: Theory and Practice of Optimal Meshing","awardID":"1065106","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[475261],"PO":["565157"]},"181195":{"abstract":"This grant will provide partial travel support for US graduate students, post-doctoral scholars, and keynote speakers attending the International Symposium on Bioinformatics Research and Applications to be held on May 27-29, 2011 at Central South University in Changsha, China. The symposium aims to bring together faculty, students, junior and senior researchers, including women and members of underrepresented groups, for three days of scholarly communication on latest advances in all aspects of bioinformatics and computational biology and their applications. A main objective of the 2011 symposium is to promote communication between researchers in the US and China and particularly engagement of life scientists, statisticians, and computer scientists in cross-disciplinary transnational collaborations. The Chinese participation will be supported by the National Science Foundation of China (pending approval).<br\/><br\/>In addition to contributed abstracts, the technical program will include tutorials, panel discussions, and poster sessions, and will feature invited keynote talks by distinguished researchers in the field. The program will provide ample opportunities for interaction between researchers with complementary expertise and foster joint US-China research projects and scientific collaborations after the symposium in all areas of bioinformatics research, ranging from comparative genomics and population genetics to structure prediction and protein-protein interaction networks. Participation in the symposium will be particularly beneficial to US graduate students and post-doctoral scholars, by providing them with a critical formative experience and preparing them to become future leaders in the field.","title":"Travel Support: 7th International Symposium on Bioinformatics Research and Applications","awardID":"1116001","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["37090","525687","525689"],"PO":["565136"]},"174024":{"abstract":"This project at the J. Craig Venter Institute is developing a client-cloud application for protein-protein docking on the Azure platform. The project is designing a self-scaling computational docking server deployed in the cloud and driven by a cross-platform desktop molecular viewer.<br\/>The Azure infrastructure is being explored for numerical computations with a coarse-grained parallelism. A fault-tolerant cloud component is being built to expose both programmatic and Web form interfaces.<br\/>Economically optimal scaling strategies are being studied to address the fluctuating demand within each user session, using instance pooling across sessions and predictive instance deployment.<br\/>A popular 3D molecular viewer PyMol is being extended with protein-protein docking operations that can be executed by the cloud component in parallel, thus making possible the interactive user-driven simulation protocols.<br\/>By using a cloud platform, this project works to make the interactive protein-protein docking simulations available to any group of biologists irrespective of location, without forcing them to maintain substantial local computing resources required for such numerically intensive methodology. The docking simulations are used to uncover the details of protein-protein interactions that form the basis of functions in any living organism.<br\/>The project?s code and executables are being released under an open-source license.","title":"CiC: (SEA): Exploring Azure as a Platform for Interactive Protein-Protein Docking","awardID":"1048199","effectiveDate":"2011-04-01","expirationDate":"2014-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}}],"PIcoPI":[466809],"PO":["565272"]},"174035":{"abstract":"This project asks: how can one build a cloud storage service under minimal trust assumptions? The project aims to design, implement, and evaluate a practical, concrete system that allows clients to use cloud storage providers like Azure and S3 -- but without the clients having to trust, that is assume, that the providers always operate correctly. <br\/><br\/>Of course, reducing assumptions is generically good, but doing so is particularly relevant to cloud storage: for economic and operational reasons, data is increasingly migrating to storage service providers (SSPs), yet SSPs are complex black boxes that can experience software bugs, correlated manufacturing defects, misconfigured servers, operator error, malicious insiders, bankruptcy, fires, and more. <br\/><br\/>For these reasons, the project is building a system, called Padova, that tolerates scenarios in which all servers in the SSP fail, and the failures include malicious, buggy, or improbably unlucky behaviors. The approach is enforce a sensible ordering of updates at the client; this provides the foundation for safety and allows a client to gather updates from any node in the system, client or server, which in turn contributes to liveness and availability. Padova eliminates trust for safety and minimizes trust for liveness and availability.<br\/><br\/>This project makes cloud storage safer for existing customers and spur further adoption of cloud storage. This means more people paying less for computing, producing beneficial effects throughout the computational ecosystem. The educational benefits include graduate and undergraduate mentoring, the latter through UT's Turing Scholars program, which cultivates particularly talented undergraduates.","title":"CiC: FRCC: Cloud Storage with Minimal Trust","awardID":"1048269","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8010","name":"Computing in the Cloud"}}],"PIcoPI":[466839,466840,"470252"],"PO":["565272"]},"177247":{"abstract":"The Internet as an indispensable communication system in our society has its share in energy consumption. The underlying network infrastructure, however, lacks effective energy management solutions. Not only does the energy consumption cost financially and environmentally, it also has becoming a limiting factor in system performance. Today's networks are aggressively over-provisioned in design and load-balanced in operation for maximum performance resulting in routers and links consuming close to peak energy even when highly underutilized. This project exploits routing path redundancy and low link utilization to design smart routing schemes that allow links to sleep when the network traffic load is low, and wake them up to serve the traffic when the load is high, thus reducing energy consumption while preserving network performance. To achieve this, novel algorithms and protocols for power-aware network routing, traffic engineering, and topology in Internet Service Providers will be designed and evaluated. An energy-efficient network infrastructure will lead to a greener Internet and enable ISPs to reduce energy consumptions while still providing QoS at desired levels. In addition, ISPs will be able to deploy network infrastructure in energy-constrained environments, such as post-disaster recovery and under-developed areas. The tools and techniques developed in this project will provide the research community with a platform and direction for research in network energy management.","title":"NeTS: Medium: Green Net: Energy Management for Network Infrastructure","awardID":"1064963","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[475179,475180],"PO":["565303"]},"181691":{"abstract":"This proposal seeks funding for partial support of a series of three workshops designed to stimulate the use of new, emerging programming models and advanced high performance computing (HPC) architectures in a variety of computational science disciplines. These workshops are designed to explore computational methods for use in conjunction with the HPC systems acquired with funding from the National Science Foundation (Grants 0958379 and 0855217).<br\/>The goal of the workshop series is to accelerate the use of computational science to solve critical problems in science, engineering, and other disciplines by promoting an exchange of information between systems developers, software developers, and domain scientists. To accomplish this goal, the workshop series will explore long-term trends in high performance computing as well as the very recent developments in processor accelerator technology, for example graphics processing units (GPUs), and in partitioned global address space (PGAS) programming models and how these recent developments are part of an evolutionary path to future exascale high performance computing systems.","title":"CUNY HPCC Workshops","awardID":"1118376","effectiveDate":"2011-04-15","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["490434","490437"],"PO":["565272"]},"184672":{"abstract":"Proposal #: 11-35848<br\/>PI(s): Murphy, Robin<br\/>Institution: Texas A&M University<br\/>Title: RAPID: Sendai Earthquake and Tsunami- Remote Assessment Using Land, Sea <br\/>and Aerial Unmanned Systems<br\/>Project Proposed:<br\/>This RAPID project proposal, consisting of participatory research with land, sea, and aerial unmanned systems for remote assessment and situation awareness for critical life saving and recovery operations in the aftermath of the Sendai earthquake and tsunami, will capture and analyze valuable data on the effectiveness of various robots for recovery and inspection as well as user interface paradigms. The researchers will be engaged in some of the following activities: <br\/>- Participate in the ongoing recovery efforts in the Sendai region and northward<br\/>- Gather data on the effectiveness of various robots in various real-world scenarios<br\/>- Gather data on the effectiveness of various user interfaces for remote devices during the recovery process<br\/>- Deploy the RESPOND-R mobile instrument (NSF MRI grant CNS-0923203) to inspect critical infrastructure<br\/>The PI has secured invitations from Japanese researchers and responders, including the International Rescue Systems Institute, to bring robots to the north of Japan to assist in the inspection of critical infrastructure and other recovery operations as well as perform research on the efficacy of emergency response methods and practices. (The search and rescue phase has been terminated.) US and Japanese response teams will be deployed for victim and economic recovery decision-making while simultaneously collecting never-before-possible, ephemeral data. The Sendai disaster is unique in its large geographical and economic scale and types of damage. The geographical, damage, and economic scales drive the need for distributed decision-making, where experts will have to consult and work at a distance using remotely acquired data. Sendai also provides the first opportunity to create a corpus from multiple modalities of unmanned systems being used by the same agency. Of the 15 deployments since the first use of rescue robots at the 9-11 World Trade Center collapse, only two, Hurricanes Katrina and Haiti, used both sea and aerial vehicles; notwithstanding, these were controlled by different organizations for tasks by different agencies preventing a longitudinal survey of what works (or does not) for decision-makers and why and how assets should be coordinated.<br\/>Broader Impacts: <br\/>This proposal promises an immediate benefit to society by supporting life saving and economic recovery efforts in Japan through a participatory research paradigm. There are also long term benefits for future disasters since emergency response and unmanned systems are both formative domains and the data collected will advance the discovery and understanding of intelligent, human-centered systems in unpredictable situations. The PI is a woman who is well known as a role model for recruiting women and minorities; the data from this project will be integrated into her numerous museum, documentary, K-12, and general public education events. Data gathered by the NSF-sponsored RESPOND-R mobile distributed instrument for response research will be organized into an ontology and made available as appropriate given the sensitive nature of video footage.","title":"RAPID: Sendai Earthquake and Tsunami- Remote Assessment Using Land, Sea and Aerial Unmanned Systems","awardID":"1135848","effectiveDate":"2011-04-15","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["565226"],"PO":["557609"]},"175630":{"abstract":"Humans learn about the meanings of words and larger discourse units from repeated experience with both linguistic and perceptual information. However, current computational models of semantic learning and representation focus only on linguistic structure. This CAREER award explores how humans use multisensory perception and linguistic experience to organize semantic memory. Dr. Michael Jones at Indiana University will use specially designed web-based experiment protocols to collect large amounts of data about the perceptual structure of word referents. For example, a participant presented with a target word will be required to produce a list of verbal properties to describe the word (e.g., given DOG, a participant might produce \"has four legs, has fur, barks\" etc.). A second participant is then provided with only the list of properties and is required to guess what word is being described. Alternatively, the information to the second participant can be a drawing of what the target word represents to the first participant, who has configured predefined object components into a 2D or 3D display. By designing these experiments as internet based, Dr. Jones will collect very large amounts of data to design and test computer models of linguistic and perceptual integration during word learning. <br\/><br\/>The models resulting from this research may provide a better understanding of the learning disorders characterized by language deficiencies (e.g. many forms of autism) and age-related disorders characterized by semantic disorganization (e.g., dementias such as Alzheimer's Disease). The integration of perceptual and linguistic information could also lead to better applied algorithms for information search (e.g., Internet search engines) if the computer representation can be made to approximate the semantic representation of the human doing the searching.","title":"CAREER: Integrating Perceptual and Linguistic Information in Models of Semantic Representation","awardID":"1056744","effectiveDate":"2011-04-15","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["489674"],"PO":["563458"]},"174311":{"abstract":"Throughout the millenia, humans have used graphical symbols. 5000 years ago, in Mesopotamia, a system of symbols was codified into what was to become the world's first writing system. But in addition to writing systems, many symbol systems have been developed that, though they do communicate information, do not encode language. Such non-linguistic symbol systems include familiar examples such as mathematical symbology, European heraldry, or scouting merit badges, as well as less familiar ones such as Mesopotamian deity symbols or Dakota winter counts. Like writing, such systems are an important part of the cultures that created them.<br\/><br\/>Now suppose one has a symbol system whose interpretation is unknown. Short of deciphering it as a writing system, or otherwise providing a rigorous testable interpretation, are there any methods that can determine whether one is dealing with writing or a non-linguistic system? Some recent high-profile papers have indeed claimed to provide statistical evidence that a couple of ancient systems were linguistic. But, one problem with that work is that in order to determine which of two categories an unknown system belongs to, it is very useful to have a large set of examples of the two categories in question. In the case of writing systems, we now have many electronic corpora from hundreds of languages, both ancient and modern. But electronic corpora of non-linguistic systems are few.<br\/><br\/>This project will fill this void by developing and releasing to the public electronic corpora of a range of non-linguistic systems, including those named above as well as several others. It will also investigate statistical and machine learning methods that might help in distinguishing written language from other graphical communication. And this in turn will lead to a better understanding of a fundamental question about humanity: what sets language apart from other forms of communication?","title":"Corpora of Non-Linguistic Symbol Systems, and Statistical Analysis","awardID":"1049308","effectiveDate":"2011-04-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[467638,467639,467640],"PO":["564500"]},"184761":{"abstract":"This travel grant supports students who are near graduation, or have recently graduated, to take part in a doctoral consortium at the 2011 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). The doctoral consortium highlights the work of these up and coming researchers, and pairs each student with a senior member of the computer vision community who serves as their mentor. The mentorship process provides each student with valuable feedback on their research, as well as meaningful career advice as the students move on to the next phase of their professional development. The doctoral consortium event aims to have representation from a diverse group of participants (in terms of gender, ethnic background, academic institution and geographic location). The travel grant ensures participation from a broad range of institutions across the country and gives visibility to a diverse population of students.","title":"Group Travel Grant for the Doctoral Consortium at the IEEE Conference on Computer Vision and Pattern Recognition","awardID":"1136370","effectiveDate":"2011-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[495599],"PO":["564316"]},"184541":{"abstract":"The project supports graduate student participation in the ACM SIGKDD Conference on Knowledge Discovery and Data Mining (KDD 2011). Specifically, the project supports travel to the conference for students who might not otherwise be able to attend the conference because of financial reasons. The recipients of student travel fellowships will have an opportunity to attend the conference, associated workshops and tutorials on emerging research topics, as well as a doctoral consortium that provides a venue for the students to have one-on-one discussions and receive mentoring from some of the leading researchers in data mining, machine learning, and related topics. The project offers natural integration of research and education and contributes to the training of a new generation of researchers in an area of growing importance and impact in not only Computer Science but also a variety of data-driven disciplines.","title":"Funding Support for US Students Attending KDD 2011","awardID":"1134990","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563325"],"PO":["560586"]},"184179":{"abstract":"This proposal award supports the travel of students at U.S. institutions to attend the 9th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys 2011). MobiSys, sponsored by the ACM SIGMOBILE, will be held June 28-July 1st, 2011 in Washington, DC.","title":"Student Travel Grants to attend MobiSys 2011","awardID":"1132286","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["557642"],"PO":[493916]},"177205":{"abstract":"This project investigates a new approach for describing and reasoning about security properties of smartphone applications. Smartphones are becoming pervasive, and smartphone applications are increasingly used for a variety of social, health, scientific, and military purposes. However, the capabilities these phones provide, such as access to GPS, camera, Internet, calendar, contacts, and other sensitive information can lead to major security risks. Today's smartphone development methodologies do little to help developers construct applications that safely access sensitive resources.<br\/><br\/>The goal of this project is to develop new program analysis techniques that can help developers express, reason about, and enforce security policies in smartphones. The proposed technical approach will allow developers to define rich security policies in an intuitive and flexible manner: as program code that interacts with a mobile application and checks desired properties. To ensure that application code conforms to such policies, the project is pursuing several techniques that leverage recent advances in static and dynamic program analysis. The project is also investigating approaches to automatically synthesize a code-based policy for a given application. The project is instantiating these ideas in the context of Google's Android operating system, and is evaluating the ideas in terms of effectiveness and performance on a broad range of Android-based smartphone applications.","title":"TC: Medium: Collaborative Research: Program Analysis for Smartphone Application Security","awardID":"1064646","effectiveDate":"2011-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["553364"],"PO":["564388"]},"177327":{"abstract":"To date, motion capture technologies suffer from three major limitations. First, the hardware devices are restrictive, cumbersome, and expensive. Second, most techniques only record the kinematic information of the movement, rather than underlying dynamic properties or control mechanisms. Third, the current technique fails to capture the interaction between the subject and the environment. Without the information of contacts, reconstructing motion that consists of complex contact phenomena is nearly impossible. This project develops a new motion acquisition and reconstruction technique that solves all three problems aforementioned. The new technique combines the force sensors and a single video camera to reconstruct full-body poses, joint torques, and contact forces in an unconstrained setting. In contrast to expensive lab equipment, the proposed system consists of a pair of low-cost, non-intrusive force-sensing shoes and a single consumer-level video camera that can be used to acquire motions difficult to capture in the lab. This acquisition technology enables new design of motion controllers by leveraging a large amount of real-world contact data. The research also develops new data representations and novel algorithms for intelligent and efficient motion planning and evaluates the developed motion controllers by simulating a human figure performing challenging balanced activities in a novel and unpredicted environment. <br\/><br\/>The project is tightly integrated with education components in both Georgia Tech and Texas A&M. The research of this project lends itself well to solve important real-world problems for computer graphics. The results from this project would impact research in video gaming, sports training, remote health care, biped robots, and virtual characters, etc.","title":"G&V: Medium: Collaborative Research: Contact-Based Human Motion Acquisition and Synthesis","awardID":"1065384","effectiveDate":"2011-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[475404],"PO":["564316"]},"177338":{"abstract":"The increasingly ubiquitous use of cameras creates an exciting novel opportunity to build camera-based optical wireless networks. Optical wireless is not only a potential low-cost alternative where it can take advantage of existing cameras and light emitting devices, but it's highly directional transmissions can present advantages over radio-frequency (RF) based wireless communications. While the optical channel differs fundamentally from the RF channel, this project recognizes that it also allows multiple spatially separated channels between an array of transmitter elements and the array of camera pixels, akin to an RF multiple-input multiple-output (MIMO) system. This inter-disciplinary project therefore brings together expertise in the areas of mobile networks, communications, and computer vision to analyze, design, and prototype a network stack for such visual MIMO communications. This stack addresses the fundamentally different visual channel and receiver constraints through innovative visual signal acquisition, tracking, interference cancellation, and modulation techniques at the physical layer as well as vision-aware link and MAC layer protocols.<br\/><br\/>Visual MIMO networks can potentially support applications ranging from secure communication between cell phones, over localization of 911 callers through surveillance cameras, to interference-free car-to-car communications. The project also makes an experimental visual MIMO testbed available to the research community at large. In addition to publications, the project takes advantage of WINLAB's biannual industry meetings to disseminate results and provides a variety of appealing educational activities involving K-12 and undergraduate students.","title":"NeTS: Medium: Visual MIMO Networks","awardID":"1065463","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[475434,475435,"553648"],"PO":["557315"]},"180341":{"abstract":"The International Joint Conference on Neural Networks (IJCNN) is the premiere international conference for researchers in neural networks and related areas. This annual conference is organized jointly by the International Neural Networks Society (INNS) and the IEEE Computational Intelligence Society (IEEE-CIS), with each society taking the lead in alternate years. In recent years, a concerted effort has been made by the organizers to include areas such as computational neuroscience, cognitive science, distributed intelligence, embodied robotics, etc., in the conference. The effort is now being made, through NSF support, to expand this interdisciplinary component by organizing a formal, multi-faceted program within the conference with the theme \"From Brains to Machines.\" This program will bring together researchers from a broad spectrum of areas ranging from neuroscience to biomorphic robotics, and to showcase exciting research in these areas.","title":"From Brains to Machines: A Special Program at the 2011 International Joint Conference on Neural Networks","awardID":"1110883","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1699","name":"COGNEURO"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}}],"PIcoPI":[483285,"531801"],"PO":["497399"]},"184148":{"abstract":"This is funding to support travel for a diverse group of US PhD students and faculty mentors to participate in an international doctoral consortium on research on Free and Open Source Software that will be co-located with the 7th International Conference on Open Source Systems (OSS 2011), October 5-8, 2011 in Salvador, BA, Brazil. The last decade has witnessed a tremendous growth in the interest and diffusion of Free\/libre and Open Source Software (FLOSS) technologies, and has changed the way organizations and individuals create, acquire, and distribute software and software-based services. The OSS conference is a leading international forum where a diverse community of academics, industry professionals and FLOSS practitioners can come together to share research findings and experiences. <br\/><br\/>The OSS 2011 Doctoral Consortium will provide a group of approximately 13-15 PhD students studying FLOSS with an environment in which they can share and discuss their goals, methods and results at an early stage of their research. It will take place on October 4, the day before the OSS conference begins. By participating in the doctoral consortium, students will gain feedback on their work from other students and faculty members, allowing them to enhance their own research proposal. Students will also develop a better understanding of the different research communities engaged in the study of open source software. In addition, the consortium will provide students with opportunities to make new professional connections beyond their own disciplines. Because the consortium will be held in Brazil this year, it will also provide opportunities to develop new international connections. <br\/><br\/>Students will be recruited for the doctoral consortium through advertisement on the conference website, postings to relevant mailing lists and direct solicitation to faculty working on FLOSS related research. Particular attention will be placed on identifying participants from under-represented groups. To apply for the consortium, students will submit a paper outlining their research goals and work to date. Applications will be screened by the consortium chairs for fit to the topic area, state of development and quality of the research project.<br\/><br\/>Broader impacts: The OSS doctoral consortia traditionally bring together the best of the next generation of researchers in open source software research, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is OSS-related, regardless of the fields in which they are earning their degrees. Participation is encouraged from a broad range of relevant disciplines and approaches, including (but not limited to) computer science, sociology, psychology, anthropology, information science, cognitive science, communication, and economics. While NSF funds will be used chiefly to support participation by students enrolled in graduate programs in the United States, some international participants may be supported as well in recognition of the fact that the OSS field embraces educational and cultural traditions that vary in different parts of the world. The organizers will try explicitly to identify and include the broadest possible group of highly qualified participants. As a consequence of these steps, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"Support for the Open Source Systems 2011 Doctoral Consortium","awardID":"1132151","effectiveDate":"2011-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[493835],"PO":["565342"]},"174039":{"abstract":"This research explores an alternative data processing architecture that<br\/>fundamentally improves computing efficiency to reduce costs and provide<br\/>enhanced data mining capabilities for cloud computing. The next major<br\/>advancements in IT, medical, and science informatics will largely be<br\/>dictated by our ability to store, manage, and analyze large amounts of<br\/>information. For many important problems, advances in data acquisition<br\/>tools are rapidly increasing data generation rates, exceeding our ability<br\/>to manage and process the data they produce.<br\/><br\/>This proposal investigates novel architectures for continuous bulk data<br\/>processing, which support data-intensive applications that perform complex<br\/>multi-step computations over successive batches of input data (e.g., from<br\/>scientific or medical instruments), allowing analytics to simply be<br\/>updated, not recomputed, when new data arrives. The research seeks to<br\/>raise incremental processing as a first-class abstraction, significantly<br\/>lowering the barrier of data-intensive projects to take advantage of cloud<br\/>computing. Towards that end, the work will develop data analysis portal<br\/>architectures to increase the reach of on-demand data analytics across<br\/>various application domains. As a case study, it will develop a portal for<br\/>fatty-liver disease, allowing care givers on-demand access to medical<br\/>analytics to improve care, reduce cost, and improve clinical outcomes for<br\/>this important disease.","title":"CiC (RDDC): Continuous Bulk Processing in the Cloud","awardID":"1048296","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[466850,"518658"],"PO":["565272"]},"175029":{"abstract":"Virtually any computer system can be compromised. New software vulnerabilities are discovered and exploited daily, and even if software were bug-free, unaware users may install malware along with free screensavers or greeting cards they download online. Cleaning up after these inevitable compromises leads to days of wasted effort by users or system administrators, with no conclusive guarantee that all traces of the attack are gone, or that no legitimate changes are lost.<br\/><br\/>This research project automates recovery from intrusions by developing a system-wide undo mechanism, so that an administrator can undo an attacker's break-in attempt, along with all of its side-effects, while preserving all other legitimate operations. The key idea is to log all computations, such as processes or system calls, and the dependencies between them, so that if one operation needs to be undone, the system can both undo its direct effects, and recursively track down and re-execute other operations that may have been indirectly affected. Building on this basic approach, the project explores how computer systems must change to securely and efficiently provide system-wide undo, from operating system kernels, to programming languages, to applications and user interfaces.<br\/><br\/>If successful, this project will provide a principled approach to recovering from intrusions in computer systems. More broadly, system-wide undo may help in many situations, such as users that realize they changed the wrong setting a week ago, students that want to learn a new system by exploring and undoing, or application developers that want to experiment with a large-scale system.","title":"CAREER: System-Wide Intrusion Recovery Using Selective Re-execution","awardID":"1053143","effectiveDate":"2011-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["562012"],"PO":["551712"]},"184566":{"abstract":"This research, which involves collaboration between scientists from two institutions, will explore the intersection of interface design approaches for mobile users and users with cognitive disabilities, with the goal of identifying ways that best practices in each community can help the other create better interfaces. Initial investigation by the PIs, who possess individual expertise in the two fields, has identified similarities in the interface concerns between the two communities (e.g., the number and size of buttons, the use of icons and graphics to communicate, and the need for multiple paths to information collection). The PIs will create and study interfaces that use and expand the interface design guidelines for both communities, bringing together domain experts to launch a new generation of interfaces that are less cognitively demanding and more widely usable by important user populations. To these ends, the team will employ two types of interventions: a prototype driven development effort and an analytic evaluation effort. The prototype driven development effort will seek to address needs of mobile communities and communities of users with cognitive disabilities through user focused interface design. The analytic evaluation effort will draw upon the opinions of experts in the fields of cognitive disabilities, mobile interfaces, cognitive science, human interruption, and health and wellness, to identify the most promising avenues for research and development. The PIs expect that this work will connect two fields with promise for mutual benefit through continued research and teaching. <br\/><br\/>Broader Impacts: This project connects two fields that are not generally considered to be related, and has the potential to transform key principles for interface design by increasing cross-domain intellectual output between the mobile interfaces and cognitive disabilities communities. This research will result in the creation and distribution of interfaces to members of an under-represented group, and in so doing will draw attention to the issues faced by people with cognitive disabilities and focus efforts to address them by providing avenues toward non-litigious, scientific approaches to deal with all people's needs and desires to communicate on the go with mobile interfaces.. The project will enhance partnerships between researchers at the University of Colorado and Virginia Tech, with benefits extending across the United States and the world through publications and workshops at top venues in the fields of mobile interfaces and cognitive disabilities.","title":"EAGER: Mobile Interfaces and Cognitive Disabilities","awardID":"1135149","effectiveDate":"2011-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[494943],"PO":["565227"]},"183499":{"abstract":"The US-Finland Workshop on Wireless Networks will be held in the Finland Embassy in Washington DC from May 16 to May 17, 2011. There will be approximately 20 US participants and 20 Finland participants. The objective of this workshop is to bring together experts in the field of wireless networking from the US and Finland, as well as funding agency representatives from the NSF, the Academy of Finland and Tekes, to discuss future research and education collaboration between the two countries. This proposal requests funds to support 10 US participants, which will include researchers at various ranks, and will represent various demographics and races including individuals from under-represented groups. The workshop is expected to result in the formation of a long-term research and education collaboration between US and Finland in the field of wireless networking.","title":"US-Finland Workshop on Wireless Networks","awardID":"1128421","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["434241","531799"],"PO":["557315"]},"183720":{"abstract":"This proposed project is to support the third annual programming contest to be held at SIGMOD 2011 conference in Greece. The funding is to sponsor travel for the contest participants to the conference and staffing for running the contest at MIT. The contest is open to graduate and undergraduate teams from degree-granting institutions. This year's contest task is to build a system that stores (key, value) pairs sorted in key order, durably on a Flash disk. As with previous years, the goals of the contest are to: (a) stimulate student interest in the DBMS field, (b) present a research challenge, (c) foster the creation of sharable open source code modules, (d) foster Computer Science education by creating a forum where students can excel, and (e) present a forum where excellent students can get noticed without writing papers. This contest will stimulate the database community to develop robust open source implementations of challenging research software. Such implementations have intellectual merit in that they provide a base upon which other researchers can build tools and students can learn how others have architected large data management systems. The contest will attract young, eager, students with enthusiasm for building real systems to the database community. It will emphasize that the community values real implementations in addition to academic papers, and will potentially lead to open source software that will be used by researchers outside of the community. To promote participation from under-represented groups, participants from such groups will be especially encouraged.","title":"SIGMOD 2011 Programming Contest","awardID":"1129526","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["525076"],"PO":["543481"]},"173985":{"abstract":"Scientists are generating data at an unprecedented scale and rate. There is tremendous value in not only analyzing this data but also sharing it among scientists. Cloud-computing platforms are well-suited to support such sharing: They offer a single logical location for data, access to data management tools for analyzing it, and a pay-as-you-go charging mechanism. However, while cloud-computing systems offer simple pricing schemes for storage and compute resources, the economics of data sharing are poorly understood and only coarsely supported.<br\/><br\/>This research is developing models and infrastructures to establish relational data markets in the cloud. These markets enable scientists to upload their data and make it publicly available in the cloud, then recoup costs by charging others for using the data. The data markets also enable scientists to share their data with direct collaborators and see the cloud costs fairly distributed among team members.<br\/><br\/>The project is building a prototype system on the Windows Azure cloud to implement these data markets.<br\/><br\/>This project is having impact on both cloud computing and science by introducing new pricing techniques for data sharing in the cloud. The software and technical papers resulting from this project are being disseminated through the project website (http:\/\/cloud-data-pricing.cs.washington.edu\/).","title":"CiC RDDC: Relational Data Markets in the Cloud","awardID":"1047815","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["531543","536677","531545"],"PO":["565272"]},"183434":{"abstract":"The Human Computer Interaction Consortium (HCIC) is a collection of members of the human-computer interaction (HCI) community from 23 member organizations, who convene once a year to exchange research results with each other. The Consortium was created over 20 years ago in order to counter the typical conference short paper presentations with no follow-on discussion. The HCIC has become a marvelous place that is both intellectually and socially rich; this year the group is moving to a new, larger venue, which will allow them to open up membership to a larger set of people without reducing the quality of the interaction. Last year HCIC attendees voted to break with tradition and include tutorials on the variety of methods in HCI, which range from ethnographies to laboratory studies to analyses of masses of data captured on the Web. The idea was to teach the audience how to be knowledgeable in the methods with which they did not have deep experience, enough so that they could judge whether a research paper using that method was done well or not. The attendees rated most of these tutorials as excellent, and urged the organizers to find a way to make their content available to more people.<br\/><br\/>This is funding to support the video recording and distribution of five of these tutorials on the topics of \"Design Research,\" \"Large Data Set Analysis,\" \"Ethnography,\" \"Content and Conversation Analysis,\" and \"Crowdsourcing.\" Three of these tutorials have been accepted for presentation at the ACM 2011 Conference on Human Factors in Computing Systems (CHI 2011), which will be held May 7-12 in Vancouver, British Columbia, Canada. (The annual CHI conference is the leading international forum for the presentation and discussion of HCI research and practice, and is attended by approximately 2,500 HCI professionals from around the world; more information about the conference is available at http:\/\/www.chi2011.org.) The other two will be recorded at the speakers' home institutions. NSF funding will cover the cost of sending a videographer to these venues to record and later edit the videos, which will then be made available to the general public online. In addition, the talks will be professionally transcribed to serve as first drafts of chapters in a timely and much-needed book tentatively entitled \"Handbook of Methods for HCI.\"<br\/><br\/>Broader Impacts: This effort will expose a substantial number of people to new and sophisticated methods for investigating how people interact with computing. The video tutorials on the Web and the book to follow will enable researchers and students everywhere to learn some of the latest, state-of-the-art methods, which they can then exploit in their research.","title":"WORKSHOP: How We Know What We Know: Research Methods in HCI2","awardID":"1128010","effectiveDate":"2011-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551830"],"PO":["565227"]},"181157":{"abstract":"This project will further develop and enhance the Stork Data Scheduler to support Azure cloud computing environment, and to mitigate the end-to-end data handling bottleneck in data-intensive cloud computing applications. Stork data scheduler has been very actively used in many data-intensive application areas including coastal hazard prediction and storm surge modeling; oil flow and reservoir uncertainty analysis; numerical relativity and black hole collisions; educational video processing and behavioral assessment; digital sky imaging; and multiscale computational fluid dynamics. Making Stork available on the Azure environment will enable this already existing user base to easily migrate to the Azure Cloud Computing platform as well as other Azure application groups benefiting from the large-scale data handling capabilities of Stork.<br\/><br\/>The Stork Data Scheduler for Azure will make a distinctive contribution to cloud computing community because it focuses on planning, scheduling, monitoring and management of data placement tasks and application-level end-to-end optimization of networked I\/O for petascale data-intensive applications. Unlike existing approaches, it will treat data resources and the tasks related to data access and movement as first class entities just like computational resources and compute tasks, and not simply the side effect of computation. Stork data scheduler for Azure will provide enhanced functionality for cloud computing such as data aggregation and connection caching; peer-to-peer and streamed data management; early error detection, classification, and recovery in data transfers; scheduled storage management; optimal protocol tuning; and end-to-end performance prediction services. The Stork data scheduler for Azure will dramatically change how domain scientists perform their research by rapidly facilitating sharing of large amounts of data in cloud computing environments.","title":"EAGER: Stork Data Scheduler for Azure","awardID":"1115805","effectiveDate":"2011-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8010","name":"Computing in the Cloud"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":["558513"],"PO":["565272"]},"176713":{"abstract":"This CISE REU Site award renews an exemplary site at the University of South Florida. The site includes a strong research component combined with professional development opportunities for the participating students. Students will have the opportunity explore research topics related to ubiquitous sensing, which includes current topics such as fixed and mobile sensing networks, location-based services, participatory sensing, and human-centric sensing applications. The primary goals of this renewal are to achieve systematic increase of the graduation rate of undergraduate students as well as the enrollment numbers in graduate programs in Computer Science, to the recruit minority students, and to serve as a bridge program for community colleges students to pursue computer science degrees in 4-yr universities. The team will continue the successful strategies used to recruit Hispanics students from a broader group of institutions in Puerto Rico, Florida, and Latin America, and African-American students from their partner institutions. <br\/><br\/>The intellectual merit of this proposal in the potential to contribute to the current research body related to ubiquitous sensing. Ubiquitous sensing is an area of current interest that is well-suited to undergraduate research productivity. Students will be involved in state-of-the-art research problems and will learn how to use current tools and techniques to solve those problems.<br\/><br\/>The broader impacts of this project revolve around the ambitious outreach activities the project plans to undertake. This REU site will provide students with research opportunities in areas not available at their home institutions. The program will directly address a national concern, which is the participation and enrollment of students from under-represented groups in graduate school and research in computer science. The project will establish stronger ties between the involved institutions for more collaboration in the future, including connections with community colleges.","title":"REU Site: REU Site on Ubiquitous Sensing","awardID":"1062160","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[473743,473744],"PO":["564181"]},"185799":{"abstract":"Workflow-based systems have emerged as an alternative to ad-hoc<br\/>approaches to data exploration that are widely used in the scientific<br\/>community. Workflows can capture computational tasks at various levels<br\/>of detail and systematically record the provenance (history) information<br\/>necessary for reproducibility, result publication and<br\/>sharing. Although the benefits of using scientific workflow systems<br\/>are well known, the fact that workflows are hard to create and<br\/>maintain has been a major barrier to wider adoption of the technology<br\/>in the scientific domain.<br\/><br\/>The goal of this project is to produce new algorithms and techniques<br\/>for exploring and re-using useful knowledge embedded in workflow<br\/>specifications and in the provenance of the data they manipulate.<br\/>This project addresses key limitations in existing workflow<br\/>systems. First, it develops a set of usable tools that enable casual<br\/>users (who do not necessarily have programming expertise) to perform<br\/>exploratory tasks and solve problems through workflows. These include<br\/>intuitive user interfaces to manipulate collections of workflow and to<br\/>query workflows by example. Second, it builds a scalable provenance<br\/>management infrastructure to support the efficient execution of these<br\/>operations.<br\/><br\/>The research results of this project advance the state of the art and<br\/>build fundamental knowledge in storing, querying, and re-using<br\/>provenance of computational tasks. This project has the potential to<br\/>impact a variety of applications where the creation and maintenance of<br\/>workflows is currently a major bottleneck. This includes large<br\/>computational science projects and portals. Furthermore, it makes<br\/>workflows and workflow technology more accessible to casual users.<br\/>Through our interdisciplinary collaborations, this project will have<br\/>immediate impact in helping improve the scientific discovery process.<br\/>The involvement of graduate and undergraduate students in the project<br\/>will provide mentoring opportunities. The PI is committed to<br\/>recruiting minority students. The results of this project will be<br\/>disseminated as research papers and as freely available tools at the<br\/>project website:<br\/>http:\/\/www.cs.utah.edu\/~juliana\/projects\/NSF-IIS-0746500","title":"CAREER: Storing, Querying and Re-Using Provenance of Computational Tasks","awardID":"1142013","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["521992"],"PO":["565136"]},"184117":{"abstract":"CAREER: Data-aware Distributed Computing for Enabling<br\/>Large-scale Collaborative Science<br\/><br\/>PI: Tevfik Kosar, Louisiana State University<br\/><br\/>Abstract<br\/><br\/>Applications and experiments in all areas of science are becoming increasingly complex and more demanding in terms of their computational and data requirements. Some applications generate data volumes reaching petabytes. Sharing, disseminating, and analyzing these large data sets becomes a big challenge, especially when distributed resources are used. <br\/><br\/>This Faculty Early Career Development (CAREER) project proposes a new distributed computing paradigm called ?data-aware distributed computing?, which will include a diverse set of algorithms, models, and tools for mitigating the data bottleneck in distributed computing systems; and will support a broad range of data-intensive as well as dynamic data-driven applications. As part of this project, research and development will be performed on three main components: i) a data-aware scheduler which will provide capabilities such as planning, scheduling, resource reservation, job execution, and error recovery for data movement tasks; ii) integration of these capabilities to the other layers in distributed computing such as workflow planning, resource brokering, and storage management; and iii) further optimization of data movement tasks via dynamically tuning of underlying protocol transfer parameters. <br\/><br\/>Research will be integrated to literally all levels of education which will include science projects, seminars and summer camps on data-intensive computing with K-12 students (where 99% is minority); curriculum development, mentoring, and international student\/intern exchange programs for undergraduate and graduate students; summer internships and workshops specifically for HBCU community including faculty members. <br\/>The tools and software developed in this project will be available to public via open-source distribution.","title":"CAREER: Data-aware Distributed Computing for Enabling Large-scale Collaborative Science","awardID":"1131889","effectiveDate":"2011-04-15","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["558513"],"PO":["565255"]},"176868":{"abstract":"This award provides funding for a new Research Experiences for Undergraduates (REU) site at the University of Central Arkansas. Each year, ten undergraduate students will work on projects that integrate fundamental research in computer science with applications in health information technology (HIT), aimed at improving the overall quality, safety and efficiency of the health care delivery system. The interdisciplinary nature of this REU program offers opportunities to the participating students to perceive the importance of computer science and continue their education in this field. A series of training seminars will equip them with knowledge specific to the various research projects as well as general skills required in graduate school. The research environment offers them the opportunity to interact with computer scientists, medical physicists and industry personnel. Broader impacts result from the fact that this project provides opportunities for a diverse pool of undergraduate students, primarily from the south-central region, to gain research experience in both fundamental computer science and HIT areas, which would otherwise be unavailable to them. Overall, this REU site has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning at the K-12, undergraduate and graduate levels.","title":"REU Site: HIT@UCA: Applied Research in Health Information Technology","awardID":"1062838","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["449067",474192],"PO":["563751"]},"173931":{"abstract":"Cornell effort works towards a science of high-assurance cloud computing. Such a science is needed for to support sensitive computing applications that require higher degrees of assurance than is typical for modern cloud platforms, for example in their security, privacy, consistency, fault-tolerance or responsiveness guarantees. <br\/><br\/>The Cornell group is using a three-pronged approach: <br\/>1. Experiments to quantify the properties of today?s cloud platforms. <br\/>2. Software solutions that run on today?s clouds but enhance their properties. This entails protocol and system design, implementation, and evaluation, but will also involve creating models and proofs contributing towards a future science of highly assured cloud computing.<br\/>3. As these new tools emerge, the group can restart the cycle by using them to prototype critical applications in selected domains (finance, healthcare, control of the smart power grid), reevaluate their performance, and then explore needed optimizations and enhancements to support realistic application workloads.<br\/><br\/>Intensive access to Microsoft Azure permits the team to create a body of knowledge with immediate practical value for Azure users. However, by working towards a deeper scientific foundation for highly assured cloud computing, the expectation is that any key insights will be equally applicable on non-Microsoft systems.","title":"CiC: Science of Cloud-Scale Computing","awardID":"1047540","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["495285",466565,"502829"],"PO":["565272"]},"183776":{"abstract":"Cognitive robotics has been identified as a research area of common interest to Japan and the US; in addition, it is of mutual benefit to both countries to explore areas for collaborative work where each side brings complementary strength to the project. Moreover, there is already a good start in collaborative research among some US-Japan roboticists. We propose to propel this joint cooperative research to a higher level of impact by holding a joint NSF-JST workshop which brings together the best researchers from both countries and have them discuss and exchange ideas about the most opportune research directions, then work at a deeper level on some specific challenges in these areas in order to be well-positioned for a next round of collaborative funding opportunities.<br\/><br\/>This workshop has the potential to result not only in new research directions which could ultimately impact many industries (e.g., elderly care, logistics, security, medical, exploration, monitoring, etc.), but also lead to broader international opportunities for faculty and students. The goal is to have the results of this workshop result in high-impact collaborative US-Japan research with student and faculty exchanges and long-term visits. This renders our students and faculty more globally aware and competitive.","title":"NSF-JST Collaborative Workshop","awardID":"1129775","effectiveDate":"2011-04-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}}],"PIcoPI":[492859],"PO":["564069"]},"176903":{"abstract":"Abstract: The primary objective of the REU Site is to promote graduate studies in Computer and Information Science and Engineering to bright, talented undergraduate students with little exposure to research. The recruited participants will<br\/> - Spend 10 summer weeks on campus where they are immersed into a research environment with all its facets;<br\/> - Participate actively in shaping the research project and in defining its solution; <br\/> - Communicate to peers and other audiences about their progress and their findings; <br\/> - Visit research laboratories and attend presentations about all aspects of research and research careers;<br\/> - Be provided ample opportunities to form protégé-mentor relationships with faculty mentors, graduate <br\/> students, and other researchers involved in the program's activities; <br\/> - Meet with successful professionals from academia and industry and discuss all aspects of their lives and <br\/> careers in computing; and<br\/> - Submit the result of their research to professional conferences and, most do attend at least one <br\/> conference and present their work. <br\/>Student participants are strongly encouraged to continue their involvement in research beyond the 10-week program. Follow up contacts with past participants show that most of them do, and almost all who have graduated have enrolled in graduate school.<br\/><br\/>The intellectual merit and broader impact of the project are four-fold. First, it consists of the research results produced by the students. Their efforts contributed fresh ideas to ongoing large scale projects, or serve as seed ideas to start up new projects that are continued later by the same or other students. The second intellectual merit is of a pedagogical nature and consists of the lessons learned by the faculty in terms of successful recruiting, mentoring, and retention. Third, the program has a direct impact on the student participants especially when they enroll in graduate studies as a direct result of their participation. Most of the activities related to the program, from recruiting to the many special events open to the public have an indirect impact on a much larger number of students by raising their awareness of the nature of graduate studies and research careers. Finally, the mentors benefit from working with students in a structured setting.","title":"REU Site: Undergraduate Computer Research (UnCoRe)","awardID":"1062960","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[474287,"554666"],"PO":["564588"]},"177928":{"abstract":"This proposal seeks support to increase the participation of US researchers to the Conference on the Foundations of Computational Mathematics (FoCM) which will be hosted by the Budapest University of Technology and Economics in Hungary between July 4-14, 2011. The conference is the seventh in a sequence of international meetings organized by the Society for the Foundations of Computational Mathematics. The meetings are held every three years and the preceding ones have been held in different countries in North and South America and Europe. The NSF funding will cover the travel costs (airfare and partial subsistence support) for 30 conference participants who are US citizens\/permanent residents, or work\/study at a US institution. The supported participants will be predominantly students and young researchers from the US, but the organizers expect to also cover the travel and subsistence expenses of some senior participants. NSF funding to support travel and other participant costs for approximately 30 junior researchers and graduate students. The conference organizers have been traditionally and continue to be dedicated to attracting young participants and participants from under-represented groups and providing valuable opportunities for networking with the leaders of the disciplines. The conference will facilitate the flow of ideas between the theoretical computer science, computational and core mathematics communities.<br\/><br\/><br\/>The research areas represented at the conference span a diverse array of topics on the broad interface between mathematics and contemporary computation. The agenda of the conference includes 20 workshops on a broad array of topics including Approximation theory, Computational harmonic analysis, Computational algebraic geometry, Stochastic computation, Computational dynamics, Computational number theory, Combinatorics and intractability in computation, Discrete Optimization, Continuous Optimization, Learning theory, Information-based complexity, etc.","title":"Conference on the Foundations of Computational Mathematics","awardID":"1068800","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1267","name":"TOPOLOGY"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1281","name":"ANALYSIS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":["517853","520532"],"PO":["565027"]},"183847":{"abstract":"The project supports graduate student participation in the 28th International Conference on Machine Learning (ICML 2011). Specifically, the project supports travel to the conference for those who might not otherwise be able to attend for financial reasons, and organizes a student poster-presentation program that will facilitate one-on-one discussions and other mentoring with the world's leading researchers in machine learning. Students are exposed to state-of-the-art work by other researchers and have the opportunity to attend tutorials on material that is not taught at their home institutions. Participating students receive feedback from senior researchers beyond their institutional and national boundaries. Furthermore, participation in the poster session and conference helps to integrate these students into the research community and represents a natural integration of research and education.","title":"ICML 2011 Proposal for Student Poster Program and Travel Scholarships","awardID":"1130109","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550878"],"PO":["564316"]},"176929":{"abstract":"This REU site seeks to increase the number of students prepared to choose careers or graduate study in the computational sciences, bringing powerful computational, mathematical, and\/or statistical techniques to bear on problems in science, engineering and education. It further seeks to give undergraduates with little opportunity to participate in research a chance to do so. Unique aspects of this REU site are: <br\/><br\/>- Interdisciplinary faculty mentors within one blended department;<br\/>- A successful model based on internal pilot programs held in the summers of 2009 and 2010;<br\/>-The on-site availability of cutting-edge research laboratories, including the NSF-supported MUGrid Project and Nexos Project, which were used during the pilot programs;<br\/>- Inclusion of pre-service math teachers in research opportunities.<br\/><br\/>Throughout science and engineering fields, the availability of cheap computer processing power is driving increased interest in large-scale problems that were previously thought to be intractable through traditional methods. This can include developing new computational methodologies, software and\/or systems, and new theoretical models. Predicting the movement of diseases, understanding the effects of large oil spills, forecasting consumer gas usage, and modeling the catastrophic effects of a volcanic eruption are just a few of the real problems that computers are being used to help solve. At the same time, ever smaller computing platforms have inserted computation into mobile, embedded, and ubiquitous realms of human experience that would have been unthinkable only a few years ago. Energy consumption of both massive computing clusters and battery-operated appliances is of great concern, and complex computer systems can now be found at the heart of everything from medical devices to the phones in most Americans' pockets. For both of these kinds of computational systems -- the big and the small -- there is a great need for practitioners with a deep understanding of computer science, modeling and statistical methods who can work across disciplines to build real, robust, and cost-effective solutions. This REU Site will bring 24 undergraduates to Marquette University over the next three years to be mentored by our interdisciplinary faculty of Mathematics, Statistics, and Computer Science in ways to approach the difficult computational problems that face our increasingly technological society.<br\/><br\/>Our mentor research expertise lies in all of these areas, as well as in how people learn in these fields, and how we prepare the next generation of students to explore computational sciences and mathematics. Each of the computational activities concerns students becoming involved in real applications using concepts described in the classroom. They will learn how to apply these abstract concepts to particular areas. Each application has been chosen so that it is accessible to undergraduates, yet is current and useful. Many research projects are smaller versions of potential Ph.D. dissertation topics, and each student works on their own portion of primary research. Our target audience is undergraduates of all levels majoring in mathematics, statistics, computer science, or related areas. The project includes a recruiting plan targeting a population of students with little or no access to research opportunities both within and outside of the immediate Milwaukee area. Underrepresented student populations will be targeted and encouraged to apply. Our mentor pool is highly diverse in both the academic and demographic senses, and we look forward to attracting some of the most talented students in the region and the nation for a summer of computational sciences.","title":"REU Site: Computation Across the Disciplines","awardID":"1063041","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7335","name":"WORKFORCE IN THE MATHEMAT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["558335",474365],"PO":["564588"]},"180747":{"abstract":"This project will support students to attend the International conference on distributed systems (ICDCS) to be held in Minneapolis, MN in June 2011. ICDCS is a premier conference in distributed systems area and it is important to expose students to this conference. The students will be chosen based on a open competition and preference will be given to students without support and those that belong to underrepresented groups.","title":"Travel Support for International Conference on Distributed Computing Systems (ICDCS) 2011","awardID":"1113505","effectiveDate":"2011-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["543507"],"PO":["493916"]},"181718":{"abstract":"This funding allows ten students to travel to the Computer Aided Verification 2011 conference and its allied workshops held at Snowbird, Utah, during July 14-20. It also allows these students to partially offset registration costs. The CAV Travel Awards committee emphasizes funding minorities and underrepresented groups. This CAV is 23rd in its series and continues to be pivotal in developing new methods for software and hardware correctness.<br\/><br\/>INTELLECTUAL MERIT: CAV is the premier conference on software and hardware correctness based on model checking and allied technologies. These methods are fundamental to the production of correct hardware and software. This funding allows the advancement of science by increasing attendance and participation by students, especially underrepresented groups. Such participation is vital for sustaining the intellectual aspects of a flagship conference.<br\/><br\/>BROADER IMPACT: This award ensures the participation of students, especially underrepresented groups and minorities, in the software and hardware revolution. It ensures the development of vital technologies for correct operation of computing systems used for critical applications ranging from medical to aerospace. It ensures adequate and broad-based supply of trained manpower for hardware\/software industries and academia.","title":"Travel and Registration Support for Computer Aided Verification 2011","awardID":"1118485","effectiveDate":"2011-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["561775"],"PO":["565264"]},"175292":{"abstract":"This project will investigate broadband use and its consequences for quality of life among America's vulnerable populations, including the poor, the elderly, some racial and ethnic minorities, those who live in rural areas, and the disabled. These groups currently have lower than the national average broadband adoption. The research will provide a careful and systematic evaluation of Broadband Technology Opportunities Program (BTOP) funded projects, which are the first large-scale federal efforts to close America's broadband gap. <br\/><br\/>The research program will develop new process and outcome theories of broadband use and impact by: (1) developing experiential measures of broadband use as a basis to evaluate consequences of broadband on people?s lives; (2) evaluating consequences of broadband use using a multi-measure and multi-level concept of quality of life; (3) developing a framework of mechanisms to explain why broadband use has consequences on quality of life; (4) providing a framework of data gathering strategies, research methods, validated instruments and tools to help policymakers in their broadband decisions and impact evaluation; and (5) providing formative and summative feedback to broadband promotion practices. <br\/><br\/>Broader Impacts. The project will provide a careful and systematic evaluation of BTOP pilot projects that can form the groundwork for future broadband adoption investments. In addition, the project will help educate new IT researchers who are able to tackle challenging societal problem through the development of an interdisciplinary learning program on \"IT for human development\" using a problem-solution-impact approach and the creation of an infrastructure for \"IT and social service\" education. A K- 12 outreach program will be developed to create a pipeline of females in IT programs. The Penn State digital literacy corps will be created to enhance IT and social service educational infrastructure. This program engages Penn State students to create lessons and to provide help to vulnerable populations with difficulty and frustration from broadband use.","title":"CAREER: Connecting America: Examining Broadband Use and Consequences on Quality of Life of Vulnerable Populations","awardID":"1054533","effectiveDate":"2011-04-01","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[470070],"PO":["565342"]},"177250":{"abstract":"To date, motion capture technologies suffer from three major limitations. First, the hardware devices are restrictive, cumbersome, and expensive. Second, most techniques only record the kinematic information of the movement, rather than underlying dynamic properties or control mechanisms. Third, the current technique fails to capture the interaction between the subject and the environment. Without the information of contacts, reconstructing motion that consists of complex contact phenomena is nearly impossible. This project develops a new motion acquisition and reconstruction technique that solves all three problems aforementioned. The new technique combines the force sensors and a single video camera to reconstruct full-body poses, joint torques, and contact forces in an unconstrained setting. In contrast to expensive lab equipment, the proposed system consists of a pair of low-cost, non-intrusive force-sensing shoes and a single consumer-level video camera that can be used to acquire motions difficult to capture in the lab. This acquisition technology enables new design of motion controllers by leveraging a large amount of real-world contact data. The research also develops new data representations and novel algorithms for intelligent and efficient motion planning and evaluates the developed motion controllers by simulating a human figure performing challenging balanced activities in a novel and unpredicted environment. <br\/><br\/>The project is tightly integrated with education components in both Georgia Tech and Texas A&M. The research of this project lends itself well to solve important real-world problems for computer graphics. The results from this project would impact research in video gaming, sports training, remote health care, biped robots, and virtual characters, etc.","title":"G&V: Medium: Collaborative Research: Contact-Based Human Motion Acquisition and Synthesis","awardID":"1064983","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["496078"],"PO":["564316"]},"184192":{"abstract":"Proposal #: CNS 11-32353<br\/>PI(s): Bogosyan, Seta O.<br\/>Institution: University of Alaska-Fairbanks <br\/>Title: SPECIAL PROJECT: IEEE ICM 2011- Workshop on Human-Centered Robotics<br\/>Project Proposed:<br\/>This proposal, planning an international workshop for human-centric robotics in Turkey, examines the nature, needs, importance, challenges, and funding mechanisms for ongoing and anticipated research in different CISE areas and even more broad areas. The workshop will brings together recognized CISE research leaders and their peers from Turkey, Japan, and Korea, to conduct such an assessment and produce a material that can be shared with the CISE community, international colleagues, academic administrators, government funding agencies, and industry.<br\/>The activity brings together recognized leaders in telerobotics, medical robotics, and collaborative robotics to plan international collaborations in research and education in this rapidly evolving field. The planned interactions in this workshop will also benefit students and early career faculty from US, by providing opportunities to internationally exchange experiences and ideas. Participants from USA, Japan, Turkey, and Korea (KAIST) have actively committed their involvement in the workshop organization. The planned workshop presents a great opportunity for all interested participants to meet in person, and start a new, larger-scale international collaborative effort to serve the challenging field of human-centric robotics. With truly interdisciplinary foundations, the proposed workshop requires, not only a profound creativity and knowledge in robotics, but also deep insights into social sciences. While the expected domain disciplines to be addressed include telerobotics, medical robotics, and collaborative robotics, the associated challenges to be discussed involve adaptation of robots to human nature and behaviors, as well as human?s communication and interaction with robots<br\/>Broader Impact: <br\/>Robotics is becoming indispensible in assisted living, hospitals, schools, and even homes. The proposed workshop addresses the influence and interaction of technical, physical, psychological, and societal factors as they relate to robotic technologies, and as they are addressed in various parts of the world, by leading researchers. Thus, the findings from this event touch society overall.","title":"NSF-CISE: SPECIAL PROJECT: Human-Centered Robotics HCR2011","awardID":"1132353","effectiveDate":"2011-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[493949],"PO":["557609"]},"174040":{"abstract":"The main goal of this project is to define and develop a common cloud computing framework that can be used to stimulate the design and development of the next generation of mobile applications. The project will investigate and identify the common set of new cloud services and components needed to support the growth of next-generation mobile applications. The project will develop a framework that integrates these common services, adapts them to the cloud, and interfaces easily with developers to make it convenient to build next-generation mobile cloud computing applications. This project will further explore what enhancements are needed to existing cloud platforms\/infrastructures to accommodate this new mobile cloud computing framework.<br\/><br\/>This project has significant broader impacts. The outcomes of this project will be released as open source to spur the advancement of research and development in next-generation mobile cloud applications and systems. The research results of this project will be incorporated into relevant undergraduate and graduate courses. Undergraduate students will be employed in research through REU supplements and the SMART multicultural program at the University of Colorado at Boulder, and a new computation unit will be created and offered to middle and high school students.","title":"CiC (FRCC): Towards a Mobile Cloud Computing Framework to Support Next-Generation Mobile Applications","awardID":"1048298","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["508532","556808","555576"],"PO":["565272"]},"175382":{"abstract":"The PI's goal in this project is to develop new methods for automatically annotating, recognizing, and indexing large vocabularies of gestures, and to use these methods to create an integrated set of tools for sign language recognition. Current state-of-the-art methods for recognizing large vocabularies of gestures have significant limitations that impact both system design and the user experience. Many methods assume the existence of a near-perfect hand detector\/tracker; that is a limiting assumption, which prevents deployment of these methods in complex real-world settings where such accuracy is unachievable. In the absence of perfect hand detectors, system design may involve a large investment in manual annotation of training videos (e.g., specifying hand locations), so as to provide sufficiently clean information to training modules. The user experience is affected by the limited accuracy and robustness of existing applications. In this research the PI will address these issues by explicitly designing recognition and indexing methods that require neither perfect hand detectors nor extensive manual annotations, thus making it substantially easier to deploy accurate and efficient gesture recognition systems in real-world settings. The PI will achieve these objectives through theoretical advances in the current state of the art in computer vision, pattern recognition, and database indexing. The unifying theme in the project is the integration of low-level tracking modules that produce imperfect output, with recognition and indexing methods that are designed to take as input this imperfect output from the tracking modules. Novel articulated tracking methods will be developed that utilize probabilistic graph models to provide fully automatic long-term tracking, while improving upon the excessive time complexity that probabilistic graph models currently incur. New methods will be designed for extracting and exploiting information from hand appearance. As these novel modeling and recognition methods will violate standard assumptions made by existing indexing methods, new indexing methods will be formulated which will improve the efficiency of search in large databases of dynamic gestures and static hand shapes within the proposed framework.<br\/><br\/>Broader Impacts: Project outcomes will significantly improve the ability of sign language users around the world to search databases of sign language videos and to perform tasks such as looking up the meaning of an unknown sign or retrieving occurrences of a sign of interest in videos of continuous signing. These search tools will have an impact in educational settings, facilitating both learning a sign language and accessing arbitrary information available in a sign language. To these ends, the PI will make his software freely available to the public online. He will also work with experts in American Sign Language to implement key applications using his tools, which will be made available to Deaf students. The PI will furthermore develop a publicly available package of gesture recognition source code, applications, and datasets that will help student researchers at all levels engage in gesture recognition research. As an additional outreach activity intended to attract young people to careers in science, the PI will co-organize summer camps that educate junior high and high school students in computer science.","title":"CAREER: Large Vocabulary Gesture Recognition for Everyone: Gesture Modeling and Recognition Tools for System Builders and Users","awardID":"1055062","effectiveDate":"2011-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["557541"],"PO":["565227"]},"177252":{"abstract":"This project investigates a new approach for describing and reasoning about security properties of smartphone applications. Smartphones are becoming pervasive, and smartphone applications are increasingly used for a variety of social, health, scientific, and military purposes. However, the capabilities these phones provide, such as access to GPS, camera, Internet, calendar, contacts, and other sensitive information can lead to major security risks. Today's smartphone development methodologies do little to help developers construct applications that safely access sensitive resources.<br\/><br\/>The goal of this project is to develop new program analysis techniques that can help developers express, reason about, and enforce security policies in smartphones. The proposed technical approach will allow developers to define rich security policies in an intuitive and flexible manner: as program code that interacts with a mobile application and checks desired properties. To ensure that application code conforms to such policies, the project is pursuing several techniques that leverage recent advances in static and dynamic program analysis. The project is also investigating approaches to automatically synthesize a code-based policy for a given application. The project is instantiating these ideas in the context of Google's Android operating system, and is evaluating the ideas in terms of effectiveness and performance on a broad range of Android-based smartphone applications.","title":"TC: Medium: Collaborative Research: Program Analysis for Smartphone Application Security","awardID":"1064997","effectiveDate":"2011-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["556281"],"PO":["564388"]},"179386":{"abstract":"Imperatives for environmental and societal sustainability are challenging designers to consider factors that had been previously given little attention. The Association for the Advancement of Artificial Intelligence (AAAI) Spring Symposium on Artificial Intelligence and Sustainable Design, held March 21-23, 2011 at Stanford University, focuses on the challenges of sustainable design and the role that artificial intelligence (AI) plays in understanding and achieving sustainability. The presumption is that the increased complexity of design necessitated by a desire for very long-term planet sustainability, to include cradle-to-cradle design, requires application of and advances in AI. NSF funds are supporting travel, subsistence and registration of symposium participants. The symposium and follow-up discussion will elaborate current and future research directions at the intersection of AI, design, and sustainability. We anticipate that the AAAI Symposium proceedings and the nascent AI and Sustainable Design community will be of interest outside of AI and computing. Sustainable design is a topic of importance to society; bringing this topic to the attention of AI researchers has the potential for advances in sustainable design that go beyond current computational and design approaches.","title":"AAAI 2011 Spring Symposium on Artificial Intelligence and Sustainable Design","awardID":"1106480","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["387198"],"PO":["565215"]},"177330":{"abstract":"Supervised Natural Language Processing (NLP) systems perform poorly on domains and vocabulary that differ from training texts. A growing body of empirical and theoretical work points to the features used by traditional NLP systems as the culprit for domain-dependence and for the inability to generalize to previously unseen words. <br\/><br\/>This project is the first to systematically investigate representation-learning as a technique for improving performance on domain adaptation. It explores latent-variable language models ? including Factorial Hidden Markov Models, dependency parsing models, and deep architectures ? as techniques for extracting novel features from text. The resulting representations yield similar features for distributionally-similar words, thereby allowing generalization to words not seen during training of a classifier. The project also explores novel procedures for training a language model, which incorporate Web-scale ngram statistics as substitutes for standard statistics used in unsupervised training.<br\/><br\/>Language users are extraordinarily inventive, and new domains of discourse appear constantly, such as in specialized areas of science and technology. By building on top of the representations produced by this project, NLP systems can improve in accuracy on new domains and on Web text, bringing applications like the Semantic Web closer to reality. For resource-poor languages and domains, the project can help reduce the cost of annotating texts by reducing the need for broad coverage in the training texts. By involving the diverse student bodies at Temple University and Philadelphia-area high schools, the project helps to broaden participation in computer science research by underrepresented groups.","title":"RI: Medium: Collaborative Research: Learning Representations of Language for Domain Adaptation","awardID":"1065397","effectiveDate":"2011-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[475410,"518409"],"PO":["565215"]},"175053":{"abstract":"The PI's goal in this project is to answer the question: Can we engage new groups of people in engineering by situating technology in new material and cultural contexts? To this end, she will spark and study diverse engineering communities by developing tools that enable people to work creatively with computation in new material and cultural contexts. The PI's prior work provides strong support for her hypothesis that tools that include unorthodox combinations of materials can be uniquely appealing to diverse audiences. Materials like textiles, paper, and paint have powerful cultural associations that can balance the negative stereotypes often associated with technology. In this research the PI will explore these ideas by integrating new and traditional materials, bringing together computation, electronics, textiles and paper. Tools that open up new creative areas for mass experimentation and collaboration are tremendously important both for the future of computing and the future of society at large. Equally important are tools that bridge the digital and physical worlds, and tools and activities that diversify computing. This project is situated at a powerful intersection. The PI will design and test toolkits and curricula that blend computing with paper and fabric, and thus enable diverse groups of people to build hybrid digital-physical systems. And she will conduct longitudinal studies of the real-world creative communities that develop around these tools. This work will contribute to the study of creativity support tools, ubiquitous computing, educational technology, and creative communities.<br\/><br\/>Broader Impacts: The PI expects project outcomes to broaden participation in computing, by providing new communities (including groups of women, economically disadvantaged urban youth, and senior citizens) with compelling incentives to engage in computer science and other STEM disciplines. The tools developed in this work will expand the culture of computing by providing examples of technology that looks and feels very different from the technology we're accustomed to. The PI will make her tools available both to educators and the general public in order to ensure that the research has long-term, real-world impact.","title":"CAREER: Material Computing for Everyone: Democratizing Creative Computing via Unexpected Materials and Cultures","awardID":"1053235","effectiveDate":"2011-04-01","expirationDate":"2016-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[469513],"PO":["565227"]},"176164":{"abstract":"Today's electric power grid is experiencing a significant transformation because of rapid developments in renewable energy and smart grid technologies. This transition inevitably demands significant transformative research on many rapidly arising issues while the operation, stability, and reliability of the existing power grid is not affected. <br\/>This project supports the acquisition of a modern real-time hardware-in-the-loop (HIL) simulation system to advance smart grid and renewable energy technologies. The project will model smart grid components in a multi-disciplinary manner and investigate the interoperability characteristics of renewable energy sources, energy storage systems, and \"smart\" loads within a smart microgrid framework. The project will result in advanced computational technologies efficient for simulation-based study of both long- and short-term dynamics of future ?mixed system? and ?mixed signal? power grid configurations. At the same time, the project will examine how to integrate energy and intelligent-agent-based computing and communication systems within a decentralized electric power grid.<br\/>The project will enhance the development of advanced technologies for the future smart power grid, reduce energy-related emissions, improve energy efficiency of all economic sectors, and strengthen the technological lead for the United States in the advanced computing and energy fields. The project will attract and retain more minority and female students to the computational energy system program and educate young engineers and scientists to meet the rapid developments in energy and cyber technology for the 21st century.","title":"II-New: Modern Computing Infrastructure for Research and Education of Future Smart and Renewable Energy Systems","awardID":"1059265","effectiveDate":"2011-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[472085,"548563",472087,"524705",472089],"PO":["563661"]}}