{"110561":{"abstract":"Advanced Volume Visualization Techniques<br\/>PI: Charles Hansen, School of Computing, University of Utah<br\/>Co-PI: Sarah Creem-Regehr, Dept. of Psychology, University of Utah<br\/><br\/><br\/>Direct volume rendering has proven to be an effective and flexible visualization method for interactive exploration and analysis of 3D scalar fields. The ability to analyze 3D volumetric data sets is crucial to the success of large-scale simulation. This research will increase the analysis and understanding of volumetric data through more faithful rendering methods that take into consideration the interaction of light with the volume itself. The research will investigate a new interactive volume shading method that incorporates global illumination effects and is robust for lighting of volumetric materials. Such an illumination model will more effectively bring out data characteristics for analysis and will be more effective for multi-field visualization than current shading methods.<br\/><br\/>While direct volume rendering is widely used in visualization applications, most, if not all, of these applications render (semi-transparent) surfaces lit by an approximation to the Phong local surface shading model. This shading model renders such surfaces but it does not provide sufficient lighting characteristics for good spatial acuity. To improve an illumination model for volume rendering, it is necessary to investigate approximations to global illumination using novel volumetric shading techniques. This investigation is producing in an effective model that captures physical effects of classified volumetric data such as back-scattering, inter\/intra-surface illumination, and better forward scattering. The success of this project is being measured by applying the new techniques to multi-field visualization in the areas of computational combustion, bio-electric field simulation, multi-modal medical imaging, and scanned multi-modal data for non-destructive testing in which analysis through direct volume rendering is an appropriate visualization methodology. The effectiveness of these new methods will be tested through user studies that will include both perceptual psychologists familiar with perception testing in computer graphics and domain scientists.","title":"Advanced Volume Visualization Techniques","awardID":"0541113","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["558600","553308"],"PO":["532791"]},"110594":{"abstract":"Collaborative Research: Fast and Accurate Volumetric Rendering of<br\/>Scattering Phenomena in Computer Graphics<br\/><br\/>Real world scenes often show complex volumetric effects due to scattering of light by particulate media. These effects include some of the most magnificent visual experiences known to man, such as the colors of sunrise<br\/>and sunset, the brilliant underwater caustics, or even the gloomy weather effects due to fog, mist, haze, rain, snow, and the hazardous effects due to smoke and dust. Realistic visual reproductions of these effects has<br\/>broad impact in various application domains including digital entertainment, scientific education, simulation and training (flying, diving and medical diagnosis), and safety education (underwater explorations and search efforts in smoky and dusty conditions). While there has been a substantial body of work in computer graphics on rendering the effects of volumetric scattering, those methods are usually too slow to enable widespread adoption, taking hours to days to simulate a single scene. This makes it infeasible to include accurate scattering effects in applications like video games, interactive relighting, virtual environments or scientific education.<br\/><br\/>The key insight in this research is that while the explicit numerical simulation of scattering is difficult, its qualitative properties are quite simple, usually just involving a blurring or spreading out of light.<br\/>The investigators first identify simple configurations (or geometries) of media and sources which frequently occur in scenes. They next develop accurate analytic and data-driven models that describe multiple scattering of light in these configurations based on the theory of radiative transfer. These models are then leveraged in conjunction with Monte Carlo, hardware and precomputation methods, to render volumetric effects at interactive rates in a wide range of dynamic scenes and media. Since analytic or algorithmic techniques can only be as accurate as the underlying representations of scattering properties, a critical part of the research involves designing novel experimental setups to measure a wide array of scattering media for the first time. Finally, this effort includes a significant educational component and promotes collaborative<br\/>spirit, with new joint courses, exchange student visits, visiting lectures, enriching the experiences of both students and researchers.","title":"Collaborative Research: Fast and Accurate Volumetric Rendering of Scattering Phenomena in Computer Graphics","awardID":"0541259","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["438618","485160"],"PO":["532791"]},"119967":{"abstract":"The objective of this research is to identify the market formats, agent designs, and composite information service specifications that, in realistic information technology (IT) environments, best promote economic prosperity. The global economy is in the midst of large-scale transformation driven by innovations in IT and the explosive growth of the Internet. IT is reshaping markets and consumer and enterprise behavior, while at the same time business realities determine which IT innovations are viable. Little is yet known about the economic and social impacts of this transformation. Significant new research is needed on various types of IT-enhanced economic environments, including: markets with asynchronous participation; markets with automated agents; new market formats enabled by IT; and new composite information services. Automated trading agents play an increasing role in the IT-enabled markets, and their interaction with human traders demands close scrutiny.<br\/><br\/>The methods to be employed in this project include the development of new theoretical models and the testing and refinement of the models in controlled experiments with human subjects. To date, the most detailed scientific knowledge of trader behavior and market performance is confined to classic market formats and to very simple goods. This research will expand that classical knowledge, test its robustness, and open new lines of inquiry by considering a broader range of market formats (one-sided auctions, two-sided markets and new hybrids), a broader range of goods (including new composite IT service products), and a broader range of behavior (including human interaction with automated agents).<br\/><br\/>The scientific knowledge generated by the research will disseminate swiftly into the community of e-commerce practitioners, and will help provide a sounder basis for integrating IT into the world economy. The platforms for running the various market formats and automated agents will be incorporated into the National Science Digital Library, enhancing infrastructure for teaching and research. Teaching, training and learning will be promoted directly for numerous graduate students who serve as research assistants and programmers; some undergraduates will also help with the programming and hundreds will serve as laboratory subjects who become experienced in market trading and controlling market agents. Given the ethnicity of students at the campuses, and given the history of employment at the labs, a large share of the educational benefits are likely to accrue to women and members of minority groups.","title":"Collaborative Research: IT-Enhanced Market Design and Experiments","awardID":"0630805","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7318","name":"HSD - AGENTS OF CHANGE"}}],"PIcoPI":["413521"],"PO":["564456"]},"111431":{"abstract":"This project will conduct interdisciplinary, socio-technical research and education that address the current and potential uses of information technology in disaster contexts. The research will examine how data generation and sharing activities by response agencies and the public place new demands on information dissemination processes between these two entities. The research design includes field studies of citizen-generated textual, visual, and digital communications, and of the incident intelligence and public information officer functions in natural hazards events such as wildfires and hurricanes. Results will be in the form of ethnographically-informed models of interaction, data-generation and data-sharing activity that in turn will be put in organizational and institutional context to formulate recommendations for innovators, emergency response practitioners and policy makers engaged in emergency response reform. <br\/><br\/>Attention to disaster warning, response and recovery is high and widespread, coming from the federal government, national agencies, the private sector and academia. Technological innovation and emergency response reform mean that the relationships between the public and response agencies are becoming more complex. People are natural information seekers and, in uncertain situations like disaster, will persist in integrating information from formal and informal sources to make sense of it. Increased access to camera phones, phone text and picture messaging, and personal Global Positioning System technology means that the communications the public naturally engages in following a disaster produce data that can be appropriated into the response effort. The challenge lies in how this new data pathway could and should be incorporated into response agency activity. For agencies, the rise of GPS capability coupled with geographic information systems is changing the kind and amount of data that incident intelligence can produce not only for incident command but also for an increasingly tech-knowledgeable public. Through these activities, the very interface between agencies and the public is changing. The older, completely linear model of authorities-to-public affairs-to-news media is outmoded and is being replaced by a much more complex model of information dissemination. How can the interface between response agencies and the public better organize and encourage two-way communication and participation? <br\/><br\/>An important educational goal of this project is to develop future practitioners and researchers who appreciate the complexities of designing policy, processes, and technologies for the highly dynamic situations of disaster. The success of the research relies on a vertically integrated education and training program that includes practitioner and other subject matter expert involvement and a partnership with the Natural Hazards Center. It leverages research to produce a database of modules for use in courses and outreach activities where either domain,methodological or theoretical instruction is needed. Partnership with the National Center for Women and Information Technology is intended to increase the participation of women in the future science and engineering workforce by using examples from this research to illustrate the changing face of information technology careers. The research, education, and results dissemination efforts are built on interdisciplinary partnerships with government agencies and academic institutions, and will launch activities that join fields of research and practice. Results will be disseminated to developers, practitioners, and policy makers in ways that are useful to them.","title":"CAREER: Data in Disaster: Socio-technical Change in Response Agency & Public Communications","awardID":"0546315","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["489545"],"PO":["564456"]},"111475":{"abstract":"CCF-0546550<br\/>Jonathan Aldrich<br\/>Carnegie Mellon University<br\/><br\/>CAREER: Lightweight Modeling and Enforcement of Architectural Behavior<br\/><br\/>Building and evolving large software systems is one of the biggest challenges facing software engineers today. One approach to dealing with the complexity of a software system is to study its software architecture, <br\/>the high-level organization of a software system. This research is developing lightweight techniques for modeling software architecture and for enforcing architecture in code.<br\/><br\/>The core approach is a new formal modeling framework for software architectures that can express arbitrary dynamism in the design, yet also abstraction and composition mechanisms that allow the designs to scale. The <br\/>framework is grounded in formal semantics that define how dynamic architectural models can be simulated and analyzed.<br\/><br\/>In order to increase the impact of software architecture in practice, the project is developing new techniques for mapping from arbitrary object-oriented implementation code to a high-level architectural design, <br\/>using unobtrusive program annotations sprinkled throughout the source code. These annotations are used by novel program analysis techniques to verify that the code conforms to the structure of the architectural design, ensuring that engineers achieve the benefits of their architectural design in practice. The project is validating these techniques through case studies, and is achieving impact through open source software, <br\/>commercialization, and educational outreach.","title":"CAREER: Lightweight Modeling and Enforcement of Architectural Behavior","awardID":"0546550","effectiveDate":"2006-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":["498106"],"PO":["564388"]},"116459":{"abstract":"HPCA is one of the top-tier conferences in the field of Computer Architecture. This year program has twenty-six technical papers selected from 172 submissions (an acceptance rate of 15%). The conference addresses a broad spectrum of foundational concerns for computer architecture and computer design including microarchitecture, cache and memory system design, parallel computer architectures, power-efficient<br\/>architectures, embedded and reconfigurable architectures, I\/O systems, and performance evaluation.<br\/><br\/>This years conference is also the host to eight workshops and two tutorials. Detailed descriptions of the workshops, tutorials and the full technical program are available on the conference web site, http:\/\/www.hpcaconf.org. The conference is sponsored by the IEEE Computer Societys Technical Committee on Computer Architecture and is held annually. The lead organizers for the 2006 conference include Professors Yale Patt, and Craig Chase of The University of Texas at Austin (co-general chairs), and Professor<br\/>Chita Das, of Penn State University (program chair).","title":"Student Travel Grants for HPCA","awardID":"0612895","effectiveDate":"2006-02-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[308217],"PO":["565272"]},"110563":{"abstract":"Saliency-Guided Graphics and Visualization<br\/><br\/>Visual data is growing at an incredible rate due to advances in acquisition, modeling, and simulation technologies. This is posing significant challenges in its processing, display, and comprehension. Current graphics and visualization systems effectively assume a default; that every piece of data is equally important. As the data and displays get larger, visually finding useful information is becoming ever more challenging amidst the visual clutter. This research improves on the default uniform importance by associating every geometric primitive with a salience, an indication of its visual importance, and uses it to design and guide the rendering process. This research draws upon prior work in visual perception, vision, graphics, and scientific visualization and not only addresses how to present data but also what parts of the data to present for effective and compelling visual communication. This research involves advances in algorithms, tools, and techniques to generate effective visual content to facilitate comprehension and efficient rendering.<br\/><br\/>This research centers on defining and using saliency in graphics and visualization and involves developing a suite of methods for computing and assigning saliency to visual data. The investigators study how saliency can guide the rendering process to generate compelling visual content and to allocate computational and rendering resources where they have the most visual impact. The research involves rigorously validating saliency models through user studies using eye tracking and comparing them to human salience judgments. These tasks are in the driving application domains of computational biology and high-energy physics. Compelling scientific visual content has the potential to impact science education besides enhancing the accessibility of science to the common public.","title":"Saliency-guided Graphics and Visualization","awardID":"0541120","effectiveDate":"2006-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["543581","541955"],"PO":["532791"]},"111300":{"abstract":"Abstract<br\/>0545538<br\/>Drineas, Petros<br\/>Rensselaer Polytech Inst<br\/><br\/>Intellectual Merit. Massive data sets are ubiquitous and making effective use of such data sets is essential for the advancement of todays science, engineering, and business worlds. This proposal concerns the development and analysis of novel algorithms for structuring and interrogating multimode, heterogeneous data sets modelled by multimode arrays (tensors), which arise in many applications. The proposed algorithms use random sampling to extract representative data elements from the data sets and, subsequently, they operate<br\/>on the sample. In order to yield improved results for problems with heterogeneities and non-uniformities, importance sampling and other sophisticated sampling techniques are employed. This proposal contains three specific research directions (the first three years) and an early career plan (the last two years). First, it is proposed to address the wellstudied and broadly applicable 1 and 2 regression problems from a sampling perspective in order to prove that a small, judiciously chosen sample contains the information necessary to approximately solve the problem. Second, the above results will be extended to derive<br\/>simple, intuitive matrix decompositions, of the form CUR, where C contains a few columns of the matrix, R contains a few rows of the matrix, and U is a carefully chosen matrix. CUR-type decompositions provide summaries of the data that are very appealing from a data interpretation perspective, since they express all columns of A as linear combinations of a small number of basis columns (the columns in C), which come directly from the data, and similarly for the rows. Third, CUR-type decompositions will be extended to<br\/>tensors and a basis for dealing with complex, multimode, heterogeneous, tensor data sets exhibiting multilinear structure will be developed. In the last two years, it is proposed to focus on alleviating the assumption of linear degrees of freedom across the various modes of tensor data sets, and seek sampling techniques that extract non-linear degrees of freedom. This proposal will extend in significant ways the previous work of the PI on fast Monte Carlo algorithms for performing computations on large matrices.<br\/>Broader impact. This work will have broader impact in fields as diverse as the Social Sciences, Bioinformatics and Computer Science. The PI has initiated collaborations with three labs and will apply the proposed techniques on their data. The PI in collaboration with Prof. Alter and her lab at UT Austin will apply and interpret CUR-type decompositions on cell-cycle gene expression data in an effort to identify physiological pathways that are active during the different phases of the cell cycle. The PI will also collaborate with Prof. Kidds lab at the Genetics Department of Yale University to apply and interpret<br\/>CUR-type decompositions on genotyping data from samples from 42 populations from around the world. Finally, the PI will collaborate with M. Maggioni at the Yale Math Department and faculty at the Yale Medical School to apply the proposed tensor decompositions on colon cancer datacubes. These three collaborations will serve as proofs of concept for the practical applicability of these techniques, and will lead the PI towards the broader goal of developing a toolbox for tensor analysis for use by the multitude of researchers in<br\/>fields where multimode data naturally arise. Finally, the PIs work will be of interest to motivated undergraduates with a wide range of interests. It is proposed to disseminate this knowledge to undergraduates by continuing our previously proven commitment to involving undergraduates, even in their sophomore year, in cutting edge research. Extra effort will be made to involve underrepresented groups, in collaboration with the aforementioned labs.","title":"CAREER: A Framework for Mining Multimode, Non-Homogeneous Tensor Data Sets With Linear and Non-Linear Degrees of Freedom","awardID":"0545538","effectiveDate":"2006-02-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["550329","518263"],"PO":["551712"]},"110585":{"abstract":"Background<br\/><br\/>Memory management is a key component in the performance and reliability of virtually all software<br\/>systems. Explicit reclamation of memory is error-prone, but efficient in time and space. On the other<br\/>hand, automatic memory management via garbage collection eliminates memory errors, but requires a<br\/>heavyweight run-time system that imposes a certain amount of run-time and memory overhead.<br\/>The goal of this research is to explore novel compiler and run-time techniques for safe memory<br\/>management with explicit memory deallocation and without garbage collection.<br\/><br\/>Intellectual Merit<br\/><br\/> The PI will develop a system that will provide memory management support for Java in the following forms:<br\/>- It will augment Java bytecodes with primitive instructions for explicit memory reclamation;<br\/>- It will provide novel compiler analyses and transformations to automatically augment programs<br\/> with explicit memory deallocation<br\/>- It will provide appropriate run-time support for explicit memory deallocation in an extended Java<br\/>virtual machine.<br\/>The proposed work will investigate two paradigms for memory management with explicit deallocation:<br\/>- Region-based memory management, which groups data objects together into regions and deallocates<br\/>all of the objects in each region at once.<br\/>- Individual object deallocation, which reclaims storage for one object at a time. This approach<br\/>will use a single operation free to deallocate one object instance at a time.<br\/>-This research will leverage advanced static analyses such as pointer and shape analyses as key components of the proposed system to enable the accurate and safe reclamation of memory.<br\/><br\/>Broader Impact<br\/><br\/>This work proposes novel static analyses for pointer-based program structures, and their integration<br\/>with novel program transformations, run-time techniques, and program verification approaches to address<br\/>the memory management problem, an important problem in modern software systems. This research has the potential to lead to important advances in compiler technology. The PI proposes a broad dissemination of the developed tools, making them available to the public and to the research community; such tools have the potential to become useful to a broad class of consumers.In addition, he plans to use the results of this research to support several educational activities.<br\/><br\/>First, it will serve as a research topic for his students, both graduate and undergraduate. Second, he<br\/>intends to integrate the novel analyses developed as part of this research into the courses that he will<br\/>teach: the undergraduate compiler course, and the advanced seminar on program analysis.","title":"ST-CRTS: Compiler and Run-Time Support for Memory Management Using Explicit Memory Reclamation","awardID":"0541217","effectiveDate":"2006-02-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["555502",292974],"PO":["565272"]},"111333":{"abstract":"The main research goal of this project is to develop practical algorithms for modeling and visualizing dynamic processes based on solid theoretical foundations. Many processes, such as software evolution over time and robot dispersal over a terrain, are naturally modeled with dynamic graphs. While much is known about static graphs, dynamic graphs pose many unsolved challenges, both theoretical and practical. Specifically, the design and implementation of algorithms for modeling and visualizing dynamic graphs can make an impact on graph theory, computational geometry, information visualization, and sensor networks.<br\/><br\/>The central notions in this work are simultaneous graph embedding, graph morphing, and dynamic graphs. Simultaneous graph embedding refers to a common embedding of two or more related graphs. Research on this problem involves studying characterizations of the classes of graphs that allow planar simultaneous embeddings and designing algorithms for testing simultaneous planarity. Graph morphing refers to a transformation of a given source graph into another related target graph. Research on this problem involves designing polynomial time algorithms for morphing in Euclidean and Riemannian spaces and investigating methods for generalizing the notion of barycentric coordinates to non-Euclidean spaces. Visualizing dynamic graphs requires the ability to process large amounts of data in real time while providing informative representations of the underlying data. Research on this problem involves developing effective and efficient algorithms for dynamic graph visualization, as well as applying the new models to mobile sensor localization, robot dispersal, and map building.","title":"CAREER: Embedding, Morphing, and Visualizing Dynamic Graphs","awardID":"0545743","effectiveDate":"2006-02-15","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["485534"],"PO":["565157"]},"112731":{"abstract":"esearch in human computer interface technology is becoming increasingly <br\/>important given that powerful, portable, interconnected and ubiquitous <br\/>computers are transforming nearly every aspect of our lives. Applications of <br\/>these emerging technologies are increasingly evident in nearly every <br\/>discipline. There is a growing demand in both industry and academia for <br\/>individuals who have the interdisciplinary perspective and multiple skill sets <br\/>necessary to leverage this new technology. The Summer Program for <br\/>Interdisciplinary Research at Iowa State University will be a 10 week <br\/>interdisciplinary summer experience for undergraduates focused on integrating <br\/>research and education in emerging interface technologies. Students will be <br\/>provided with classroom training and gain hands-on research experience using <br\/>cutting-edge instruments, equipment, computers and technological <br\/>infrastructure. The program will enhance the recruitment, retention and <br\/>graduation of United States students by providing interdisciplinary experience <br\/>and information technology skills in scientific, technological, engineering <br\/>and mathematical disciplines. These students will help the United States <br\/>maintain a strong information technology workforce necessary for global <br\/>competitiveness.","title":"REU Site: Summer Program for Interdisciplinary Research: Emerging Interface Technologies","awardID":"0552522","effectiveDate":"2006-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1709","name":"CISE EDUCAT RES & CURRIC DEVEL"}}],"PIcoPI":["394883","394883",298377],"PO":["433760"]},"111521":{"abstract":"Vector and tensor fields are fundamental in many science and engineering disciplines. This research explores the design and control of time-dependent vector and tensor fields over deformable domains, which have the potential of benefiting a wide variety of applications within and outside computer graphics and scientific<br\/>visualization. These applications include: weather prediction and tsunami simulation, building and aircraft design and testing, electromagnetic simulation, fingerprint analysis, special effects for movies and games, computer-generated arts, shape and motion analysis and editing, and education.<br\/><br\/> In this project, the investigator identifies core functionalities and develops efficient algorithms to support the design and control of time-dependent vector and tensor fields on time-dependent domains. Common design operations are identified by using a number of graphics and visualization tasks as a testbed, such as vector field visualization and fluid simulation. Efficient algorithms are provided for tracking and controlling structural changes in a vector or tensor field over time which enable control over the topology and analytical behaviors of the field. The ideas behind these algorithms are based on the concepts of fiber bundles and bifurcations from differential geometry and dynamic systems, respectively. In addition, the investigator explores novel visualization techniques to address time-dependent vector and tensor fields over deformable domains. As a result of the research, core design operations are integrated into a system, and implementations of these algorithms are compiled into libraries to support direct integration into host applications. Both the design system and its supporting libraries will be disseminated to the public. With respect to its impacts on<br\/>education, the design system is integrated into the curriculum forundergraduate students majoring in science and engineering.","title":"CAREER: Vector and Tensor Field Design for Graphics and Visualization","awardID":"0546881","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["497248"],"PO":["532791"]},"110454":{"abstract":"The Department of Computer Science and Engineering and DO-IT IT (Disabilities, Opportunities, Internetworking and Technology) at the University of Washington propose to create the AccessComputing Alliance for the purpose of increasing the participation of people with disabilities in computing careers. Alliance partners Gallaudet University, Microsoft, the NSF Regional Alliances for Persons with Disabilities in STEM (hosted by the University of Southern Maine, New Mexico State University, and UW), and SIGACCESS of the Association for Computing Machinery (ACM) and collaborators represent stakeholders from education, industry, government, and professional organizations nationwide. <br\/><br\/>Alliance activities apply proven practices to support persons with disabilities within computing programs. To increase the number of students with disabilities who successfully pursue undergraduate and graduate degrees, the alliance will run college transition and bridge, tutoring, internship, and e-mentoring programs. To increase the capacity of postsecondary computing departments to fully include students with disabilities in coursers and programs, the alliance will form communities of practice, run capacity-building institutes, and develop systemic change indicators for computing departments. To create a nationwide resource to help students with disabilities pursue computing careers and computing educators and employers, professional organizations and other stakeholders to develop more inclusive programs and share effective practices, the alliance will create and maintain a searchable AccessComputing Knowledge Base of FAQs, case studies, and effective\/promising practices.<br\/><br\/>These activities will build on existing alliances and resources in a comprehensive, integrated effort. They will create nationwide collaborations among individuals with disabilities, computing professionals, employers, disability providers, and professional organizations to explore the issues that contribute to the underrepresentation of persons with disabilities and to develop, apply and assess interventions. In addition, they will support local and regional efforts to recruit and retain students with disabilities into computing and assist them in institutionalizing and replicating their programs. The alliance will work with other Alliances and organizations that serve women and underrepresented minorities to make their programs accessible to students with disabilities. Finally they will collect and publish research and implementation data to enhance scientific and technological understanding of issues related to the inclusion of people with disabilities in computing.","title":"BPC-A AccessComputing Alliance","awardID":"0540615","effectiveDate":"2006-02-15","expirationDate":"2010-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7584","name":"ITR-BROADENING PARTICIPATION"}}],"PIcoPI":[292620,"358519","464009","485574"],"PO":["561855"]},"112797":{"abstract":"Bacground<br\/><br\/>This project has been created with the aim of delivering the state-of-the-art research facilities in networking and communications the University of Texas at Austin to the vast underserved undergraduate population in the State of Texas. Students from seven distinct universities with programs in Engineering and Computer Science that form part the University of Texas System Arlington, Austin, Brownsville, Dallas, El Paso, Pan American and San Antonio will be actively recruited to participate in the EURECA endeavor. The program has been designed to ensure a significant participation of minorities and of disadvantaged communities in it. Minorities form more than 40% of the undergraduate population in the UT System, with UT Austin alone graduating the second largest number of minorities in the entire nation. In addition, UT Brownsville, El Paso, Pan American and San Antonio are minority institutions. Special partnerships have been formed between the seven universities to ensure the success of this program in reaching out and advertising, selecting worthy candidates and finally, in the follow-up process. Most importantly, our partnerships with other members of the UT System offer the knowledge and facilities possessed by UT Austins faculty to underserved students from institutions with limited resources and\/or without graduate programs. <br\/><br\/>The Wireless Networking and Communications Group (WNCG) with thirteen professors and over five labs Network Engineering Lab, MIMO Communications Lab, Wireless Networking and RF Propagation Lab, Embedded Signal Processing Lab, Image and Video Engineering Lab and the new Optical Communications Lab forms the foundation for this project. All of the WNCG faculty members are part of the EURECA team, and will supervise undergraduate research as part of EURECA, while the WNCG staff will provide full logistical and administrative support for the endeavor. The EURECA team also includes educational research specialists to facilitate and improve this research interaction, a researcher from industry and one faculty member per University for all the other participating Universities. <br\/><br\/>The undergraduate research projects have been designed to provide participants with a gamut of options, with subgroups of faculty from WNCG spearheading each effort. Participants will be urged to interact with all of UT Austins EURECA members to identify their true calling in research, and will subsequently be assigned to a mentor that will guide them through their stay in Austin. A key component of every research project is its extensibility providing students with the capacity to build on knowledge provided to them by their mentor and the PI to generate independent results, and to sustain this effort after returning to their parent institutions. The pre-existing relationships between faculty in the UT System and the new partnerships formed will prove to be an invaluable resource that secures such an extensible research experience. In addition, the PI will deliver bi-weekly lectures to enhance the participants writing and oral presentation skills, and organize a mini-symposium to culminate the summer program. <br\/><br\/>The EURECA teams objective is to generate sustained research interest among undergraduates so that they become tomorrows leaders in industry and academia. This project has thus been meticulously designed to meet this goal.<br\/><br\/>Intellectual Merit<br\/>UT Austin is one of the premier research institutions in the nation, and the faculty members constituting the EURECA team have extensive experience both performing and conducting research. Many faculty members in this team also have considerable experience working with undergraduates from across institutions. The research projects in the EURECA endeavor have been created as a focused plan to guide the student from a passive learning state to the state of being an active self-sustaining researcher. <br\/><br\/>Broader Impact <br\/>Beyond impacting on the minority and underprivileged communities in Texas, and hence that of the entire nation, EURECAs research tasks also enhance the lives of the surrounding community. Projects such as one providing wireless access to impoverished sections of the local community proves to be an invaluable and satisfying experience to the undergraduate student, while inspiring youth in the community, specially women and other underrepresented groups, towards higher education in engineering.","title":"REU Sites: EURECA: Extensible Undergraduate Research Experience in Communication Applications","awardID":"0552741","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["539207","539208"],"PO":["523800"]},"110498":{"abstract":"Background<br\/><br\/>Widely recognized problems of programming with threads and locks include race conditions,<br\/>priority inversion, and deadlock, problems notoriously difficult both to avoid and to diagnose.<br\/>We need better abstractions for ordinary programmers to use to exploit concurrency. A promising<br\/>direction that solves the problems with locks is the various forms of atomic action (AA).<br\/>An AA is a collection of computational actions that are guaranteed to appear to occur: either<br\/>entirely or not at all, and in a definite order with respect to other AAs. Atom-like notions<br\/>have enjoyed great success in database applications.<br\/><br\/>Intellectual Merit<br\/><br\/>-A precise programming model for AAs, with a focus on closed and open nesting.<br\/>- Overheads of alternative AA implementations on existing hardware.<br\/>- Performance benefits of AAs resulting from increased parallelism, despite their overheads.<br\/>- Hardware-assist for AAs: hardware interfaces (APIs) and virtualization to mask hardware limits.<br\/>- AAs vis-a-vis non-transactional activities such as I\/O, networking, etc.<br\/>- AAs vis-a-vis run-time services such as garbage collection (GC), exceptions, and traps.<br\/>- Tools for profiling and tuning performance of AAs, and their refinement re: bottlenecks.<br\/><br\/>Broader Impact<br\/><br\/>Delivering on AAs will lead to significant economic and security benefits<br\/>through improved robustness and performance of applications for new commodity hardware. AAs<br\/>will make it possible to increase concurrency, and thus performance, of software while also increasing<br\/>reliability and simplifying tuning and maintenance. Ordinary programmers will more readily exploit<br\/>thread-level parallelism on the desktop, writing programs they could not write, and get to work, before.<br\/>The project will benefit the hardware industry by exploiting their new offerings, and the software<br\/>industry by increasing the robustness of concurrent software, while also contributing to economic and<br\/>national security. All project results and tools will be available to the public, and the project will train<br\/>graduates in important high-demand skills, and thus contribute to the technical work-force.","title":"ST-CRTS: Collaborative: Delivering on Atomic Actions: Unlocking Concurrency for Ordinary Programmers","awardID":"0540862","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550864"],"PO":["565272"]},"111488":{"abstract":"ABSTRACT<br\/>0546622<br\/>Amy Langville<br\/>College of Charleston<br\/><br\/>Updating Problems in Information Retrieval and a Mathematical Dissection Lab<br\/><br\/>This proposal is about information retrieval, the field of organizing information in order to retrieve<br\/>documents relating to a specific information need. Information retrieval is divided into two categories: re-<br\/>trieval from web collections and retrieval from smaller, nonlinked document collections, called traditional<br\/>collections. Both types of retrieval, web and traditional, share at least one common problem: the updating<br\/>problem. Any time a document collection changes, which inevitably happens often as documents are mod-<br\/>ified, added, or deleted, several items must be updated, including performance measures, storage files, and<br\/>memory pointers. Of the many types of updating problems, this proposal deals with mathematical updating<br\/>problems. A mathematical updating problem for web retrieval that has impact for any application, such as<br\/>population modeling, webpage ranking, graph theoretic measures, and email analysis, that uses the domi-<br\/>nant eigenvector of a large, sparse, nonnegative matrix will be studied. For traditional information retrieval,<br\/>the project will study an updating problem regarding the so-called nonnegative matrix factorization (NMF),<br\/>which has impact on the many other fields to which the NMF has been applied including image processing,<br\/>fingerprint query processing, music processing, signal processing, movie animations, machine learning, data<br\/>mining, and summary extraction for audio and video data. This research will be enhanced by a partnership<br\/>with SAS Institute, Inc.<br\/>The Education Phase of this project proposes the design and implementation of a Mathematical Device<br\/>Dissection Lab. The proposed lab, which is similar in spirit to the mechanical dissection labs found in many<br\/>engineering schools, aims to solve a common problem with students perception of mathematics: students<br\/>think mathematics is merely about calculation, not concepts. To remedy this, the proposed lab allows<br\/>students to dissect in a hands-on, interactive manner virtual mathematical devices that demonstrate the<br\/>use of fundamental concepts. The lab requires self-study by groups of students, and as such, mimics the<br\/>research skills needed in the real world. This lab relates to the Research Phase of this project as three of<br\/>the labs nine modules will come from the above research in information retrieval. Each module describes<br\/>a virtual mathematical device. Examples include least squares, the vector space model of information<br\/>retrieval, and Googles method of ranking webpages. All modules must be able to be described in low<br\/>dimensional space, so that students can visualize the ideas, after which point, they will understand the<br\/>power of mathematics to enable extensions to higher dimensional space. Modules also contain a scientific<br\/>computation component as the students extend the simple models to much larger problems. Each module<br\/>will be posted on a website, making the modules available for worldwide dissemination and adaptation. In<br\/>addition, the lab will be used in several outreach projects. One of the labs goals is to change students<br\/>attitudes towards mathematics by demystifying the process of mathematical invention, showing them that<br\/>mathematics is more than mere calculation, it is a creative process with broad applications.","title":"CAREER: Updating Problems in Information Retrieval and a Mathematical Dissection Lab","awardID":"0546622","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":["486025"],"PO":["564924"]},"110532":{"abstract":"Background <br\/><br\/>A typical compiler is designed to apply its optimizations to built-in types of the language it is compiling. Although built-in general-purpose optimizations might be generally beneficial, they cannot be directly applied to user-defined types because their correctness cannot be determined a priori. Extending a compiler to optimize some particular userdefined type would be useful for that particular type, but this approach becomes burdensome if the compiler must be extended on a type-by-type basis. A more powerful approach would be to enable compiler optimizations that are generic, i.e., that can be applied to any type (built-in or user-defined) that meets fundamental semantic requirements. <br\/><br\/>Intellectual Merit <br\/><br\/>-Formal concept definitions. We will integrate concept-based optimization with our on-going research on formalization of concepts and generic programming. <br\/>-Language support for concepts. Concept-based optimization will leverage and inform our on-going research on direct language support for concepts and generic programming. <br\/>-Compiler support for concepts. Our initial efforts incorporating concepts into the GNU C++ compiler will be extended to support concept-based optimizations. <br\/>- Concept-based optimizations. We will leverage generic programming mechanisms to define optimizations using concepts so that such optimizations apply to user-defined types, simply by stating that the types model (i.e., meetthe requirements of) particular concepts. <br\/>-Deployment and library evolution. Selected generic libraries, including the Standard Template Library, the <br\/> Boost Graph Library, and the Vector, Signal, and Image Processing Library will be upgraded to take advantage <br\/>of language extensions for generic programming and to take advantage of concept-based optimization. <br\/>-Evaluation suite. We will collect optimizations for a suite of high-level benchmarks that can be used to evaluateconcept-based optimizations. An important benchmark in this regard will be to demonstrate that generic optimizations offer the same performance benefits when applied to built-in types as do traditional type-specific optimizations. <br\/><br\/>Broader Impact <br\/><br\/>- Direct impact on the future development of mainstream programming languages that support generic programming (e.g., C++, C#, and Java), and on their standard libraries. <br\/>- Collaborate with language and compiler implementors, and work to introduce language features that better support generic programming. <br\/>-Support for generic programming in these languages will provide valuable high-level information about user-defined types,making high-level and concept-based optimization more widely applicable. <br\/>-This project will directly train graduate students and post-doctoral researchers in the emerging field of generic programming. <br\/>-Results from our research will be integrated into graduate programming courses that we teach and (as <br\/> we have done in the past) into textbooks that we write.","title":"ST-CRTS: Collaborative Research: Lifting Compiler Optimizations via Generic Programming","awardID":"0541014","effectiveDate":"2006-02-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["550718"],"PO":["565272"]},"110543":{"abstract":"Background<br\/><br\/>As real-time embedded systems become ever more prevalent, important, and complex, it is becoming imperative that the formal foundations upon which the design and analysis of such systems are based keep pace with technological innovations. This proposal is addressing fundamental advances that have occurred in the real-time and embedded systems domain. First, the software that comprises such systems is becoming increasingly more complex; and second, such systems are increasingly coming to be implemented on execution platforms comprised of multiple processing units. The PIs propose to enhance the understanding of the behavior of complex, multiprocessor, real-time systems through some formal methods that attempt to model and analyze such systems in terms of feasibility, schedule ability and other important real-time constraints and issues.<br\/><br\/>Intellectual Merit<br\/><br\/>-Deriving new abstract models of real-time tasks that accurately capture salient features of real-life application systems that are to be implemented on multiprocessor platforms, and identifying rules for mapping application systems onto the most appropriate models.<br\/>-Designing new run-time multiprocessor scheduling algorithms that are provably better than ones currently used, both in terms of run-time efficiency and in terms of tractability of on-line analysis.<br\/>-Analyzing various (current and new) task models in order to enhance our understanding of what intrinsic properties render a model intractable from a timing analysis point of view, and to identify very general classes of tractable models.<br\/>-Constructing \"proof-of-concept\" software that validates the usefulness of the theoretical results obtained during the course of this research.<br\/><br\/><br\/>Broader Impact<br\/><br\/>-All tools and development platforms implemented as part of this project will be made public, and will be disseminated over the Internet.<br\/>-Development platforms will be integrated into undergraduate and graduate courses on real-time and embedded systems.<br\/>-Advanced (seminar) courses and projects will be devised involving the development of experimental applications on these platforms.<br\/>-A concerted effort will be made to involve under-represented groups in this research. <br\/>-The PIs intend to visit some of the Historically Black Universities in their area to make presentations concerning their work, with the hope of establishing research partnerships.<br\/>-Public outreach will also be accomplished by participating in UNC's long-running demo program, which is aimed at K-12 students, college students, and schoolteachers.","title":"DCS: Multiprocessor Real-Time Computing: Formal Foundations","awardID":"0541056","effectiveDate":"2006-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["31436","518412"],"PO":["565272"]},"111522":{"abstract":"In the last few years, some of the most interesting questions in the theory of algorithms have come up in designing mechanisms for selfish users especially in the context of the Internet. The Internet itself is <br\/>comprised of several autonomous entities with varying sizes and interests. It has also given birth to several online market places and electronic commerce applications in which several businesses sell, buy and trade in real time.<br\/><br\/>This research involves designing algorithms or protocols that can be implemented in these multi-agent settings. In particular, the PI will focus on computing central solution concepts developed in game theory <br\/>such as market equilibria, Nash equilibria, and the core of cooperative games. The PI will also apply these algorithms in designing online market places. In particular, the PI will study adwords and other <br\/>similar auctions used by search engines for selling advertisement.","title":"CAREER: Algorithms for Markets, Games and their Applications","awardID":"0546889","effectiveDate":"2006-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517313"],"PO":["565251"]},"111412":{"abstract":"Despite the rapid growth of distributed shared infrastructures such as PlanetLab and the Grid, a gap exists between the current practice and their full potential. Especially, many users wish to obtain their \"own space\" with full privilege in a shared infrastructure to run arbitrary distributed applications. This research introduces the concept of \"virtual distributed environments\" (VDEs) as a new sharing paradigm for distributed infrastructures. Based on virtualization technologies, VDEs are autonomic, mutually isolated entities, providing individual users with privileged, customized, and confined distributed environments. To realize this vision, the following new research challenges are being addressed: (1) distributed environment virtualization and logistics, (2) shepherded self-adaptation of virtual distributed environments, and (3) trusted monitoring and logging of virtual distributed environments. Solutions to these challenges are evaluated in a number of real-world application scenarios, including computer system emulation for education, e-Science service for the nanotechnology research community, and virtual playgrounds for Internet worm observation, investigation, and defense. In particular, the research and education activities of this work are closely related. Leveraging the research results, an education platform is being developed for distributed and network systems emulation. It provides students with hands-on system experience that would otherwise require expensive, dedicated equipment. This research will open the door to new opportunities for application\/service deployment and distributed system experimentation. The realization of VDE will encourage public use of the emerging cyberinfrastructure by accommodating a wide range of science and engineering activities including education and research portals, virtual collaboratories, and cyber-defense testing grounds.","title":"CAREER: Towards Virtual Distributed Environments in a Shared Distributed Infrastructure","awardID":"0546173","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518557"],"PO":["535244"]},"111467":{"abstract":"The growth of mobile devices has been phenomenal in the last few years. Despite the recent improvements in battery technologies, future applications and data rate requirements will drive mobile devices to be power hungry and put a severe strain on the scarce battery resource. In contrast to advances in the semiconductor industry, which follows Moore's Law, battery technology has advanced at a much slower pace. With the growing advent of high data rate mobile multimedia applications, color LCD displays, GPS and faster processors, the demand on battery energy becomes more intense. Thus, power efficiency is a critical<br\/>requirement of future mobile devices. <br\/><br\/>This research involves the study and design of power efficient wireless networks with Quality of service guarantees. Specific focus is on design of physical layer coding, modulation and power control in conjunction<br\/>with MAC layer scheduling algorithms. The investigators study a unified framework for multiuser and multihop networks. Fundamental bounds on power required in mobile networks are derived to provide finite delay guarantees on the multimedia traffic. The investigators use a cross disciplinary approach incorporating ideas from traditional communications theory, queuing theory, signal processing and network design.","title":"CAREER: Power efficient design of wireless networks with delay guarantees","awardID":"0546519","effectiveDate":"2006-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["462899"],"PO":["432103"]},"114118":{"abstract":"0602391<br\/>Chatterjee, Samir<br\/>Claremont Graduate University<br\/><br\/>A STUDENT FORUM PROMOTING SCIENCE OF DESIGN ISSUES AT THE INTERNATIONAL CONFERENCE ON DESIGN SCIENCE RESEARCH IN INFORMATIONS SYSTEMS & TECHNOLOGY<br\/><br\/>This proposal seeks funding for supporting a group of students, and specifically female students, who are encouraged to pursue science of design issues within the information systems discipline. This student forum will take place in conjunction with the 1st International Conference on Design Science in Information Systems and Technology (DESRIST 2006) being organized by Claremont Graduate University. This conference would be held Feb 24-25, 2006 at CGU. <br\/>Intellectual Merit: The objective of the conference is twofold. We will create a forum for discussing novel solutions to emerging problems by bringing together researchers from different backgrounds, ranging from computer science, information systems, and software engineering to social ethnography designers, economists, and policy makers interested in the design paradigm. In addition, we will use this opportunity to reach out to female students at different levels in their education (high school and university students) with an interest in CS\/IS related careers. We are asking for NSF funding to support students presenting at the conference and to enable a session orienting female students to pursue careers in IT and design science. <br\/>Broader Impact: The conference in general and the student forum fills a void in our community to address several critical issues in the design of software and IT artifacts. This event will: Assemble leading researchers, thinkers and practitioners from different disciplines to better understand the issues around science of design. The students will engage in discussions and get an opportunity to network with researchers who will shape the next generation of software design. Address newer and better ways to create IT artifacts including scope, methods, algorithms, frameworks, techniques, etc. We also welcome a focus on different emerging areas of science where such designed artifacts can contribute greatly, ranging from nanotechnology to intelligent personal health records. Widely publish the findings from the conference, including papers, panels, keynotes, posters through proceedings, and a book to be subsequently published after the conference.<br\/>Make it an international event to understand the influence of different cultures and perspectives towards science of design. Encourage participation from women in science and engineering. Also encourage undergraduate students to participate in the discussions. Several innovative tracks and panels to excite this underrepresented population have been created.","title":"A Student Forum Promoting Science of Design Issues at the International Conference on Design Science Research in Informations Systems & Technology","awardID":"0602391","effectiveDate":"2006-02-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["466904"],"PO":["564388"]},"116549":{"abstract":"Intellectual Merit<br\/>This research will help to address the challenging and pressing issue<br\/>of designing compiler-friendly multi-core architectures and developing effective compiler<br\/>support for automatically parallelizing single-threaded programs to fully utilize the<br\/>potential of multi-core processors. This research will also increase our understanding of<br\/>the interactions between VLIW core(s) and superscalar core(s) on a single chip for<br\/>collaboratively exploiting multi-grained parallelisms with different behaviors. The<br\/>developed simulator\/compiler framework will also be made publicly available, which can<br\/>facilitate a number of stimulating follow-on researches, such as energy efficiency<br\/>evaluation of the hybrid multi-core, or studying the integration of the hybrid compiler and<br\/>O.S in multi-programming environments, etc.<br\/><br\/><br\/>Broader Impact<br\/>The success of this project will open the door to a number of possible<br\/>follow-on research projects to create practical hybrid multi-core processors and the<br\/>related software systems, which will smoothen and accelerate the transition to the multicore<br\/>processor-based systems and thus greatly benefit the microprocessor industry, as the<br\/>single-thread performance can be continuously improved without fundamentally<br\/>changing the programming paradigm. The proposed hybrid multi-core architecture can<br\/>also be potentially customized for a great variety of embedded applications that demand<br\/>both high performance and energy efficiency. Moreover, since future high-performance<br\/>computing systems are very likely to utilize the multi-core processors as the basic nodes,<br\/>the transparent single-thread performance enhancement achieved by this project will also<br\/>help to advance the power of computing into the next generation for meeting the toughest<br\/>computational challenges. Additionally, this project will attract and train graduate<br\/>students in multi-core architecture and advanced compiler design, and the research results<br\/>will also be incorporated into the graduate level computer architecture course, i.e., ECE<br\/>532, to better prepare the students for this rapidly developing field.","title":"SGER: A VLIW\/Superscalar Heterogeneous Multi-core Architecture and the Compiler Support","awardID":"0613244","effectiveDate":"2006-02-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7583","name":"ITR-HECURA"}}],"PIcoPI":["121660"],"PO":["565272"]},"116329":{"abstract":"The proposal requests partial support for young researchers and students to participate in 2006 IEEE Communication Theory Workshop in Dorado, Puerto Rico. The NSF support will provide opportunities for 20 young participants to interact with established researchers in a small workshop setting. The focus of the workshop is on the interplay between communication theory and networks.<br\/><br\/>The broader impact of the proposal is fostering an environment of technical discussions and debates among two different communities of communication theory and networking. In addition the workshop is set out to encourage participation by young scientists and researchers.","title":"A Proposal to Support Students and Young Scientists in 2006 IEEE Communication Theory Workshop in Dorado, Puerto Rico, USA","awardID":"0612383","effectiveDate":"2006-02-15","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["542042"],"PO":["348215"]},"110500":{"abstract":"Background <br\/><br\/>Widely recognized problems of programming with threads and locks include race conditions, <br\/>priority inversion, and deadlock, problems notoriously difficult both to avoid and to diagnose. <br\/>We need better abstractions for ordinary programmers to use to exploit concurrency. A promising <br\/>direction that solves the problems with locks is the various forms of atomic action (AA). <br\/>An AA is a collection of computational actions that are guaranteed to appear to occur: either <br\/>entirely or not at all, and in a definite order with respect to other AAs. Atom-like notions <br\/>have enjoyed great success in database applications. <br\/><br\/>Intellectual Merit <br\/><br\/>-A precise programming model for AAs, with a focus on closed and open nesting. <br\/>- Overheads of alternative AA implementations on existing hardware. <br\/>- Performance benefits of AAs resulting from increased parallelism, despite their overheads. <br\/>- Hardware-assist for AAs: hardware interfaces (APIs) and virtualization to mask hardware limits. <br\/>- AAs vis-a-vis non-transactional activities such as I\/O, networking, etc. <br\/>- AAs vis-a-vis run-time services such as garbage collection (GC), exceptions, and traps. <br\/>- Tools for profiling and tuning performance of AAs, and their refinement re: bottlenecks. <br\/><br\/>Broader Impact <br\/><br\/>Delivering on AAs will lead to significant economic and security benefits <br\/>through improved robustness and performance of applications for new commodity hardware. AAs <br\/>will make it possible to increase concurrency, and thus performance, of software while also increasing <br\/>reliability and simplifying tuning and maintenance. Ordinary programmers will more readily exploit <br\/>thread-level parallelism on the desktop, writing programs they could not write, and get to work, before. <br\/>The project will benefit the hardware industry by exploiting their new offerings, and the software <br\/>industry by increasing the robustness of concurrent software, while also contributing to economic and <br\/>national security. All project results and tools will be available to the public, and the project will train <br\/>graduates in important high-demand skills, and thus contribute to the technical work-force.","title":"ST-CRTS: Collaborative: Delivering on Atomic Actions: Unlocking Concurrency for Ordinary Programmers","awardID":"0540866","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["562118"],"PO":["565272"]},"110511":{"abstract":"ABSTRACT<br\/><br\/>0540914<br\/>Appel, Andrew<br\/>Princeton University<br\/><br\/>End-to-End Souce-to-Object Verification of Interface Safety<br\/><br\/>The purpose of this research is to strengthen the internal protection barriers in software built from components and run in software virtual machines such as Sun's Java and Microsoft's .Net. In such software, programmers can design the interfaces between components--using standard techniques such as abstraction, object orientation, and information hiding--to limit the damage that rogue components can do. Rogue components are those that are designed maliciously or, more commonly, that have bugs making them vulnerable to attack and take-over. However, the protection barriers in Java and .Net (type systems that limit access by one component to data belonging to another component) are themselves vulnerable to attack if the type-checkers and compilers that implement them have bugs. <br\/><br\/>In order to ensure that no compiler bugs can cause security vulnerabilies, the researchers will develop formal models to relate type systems at the source language--where programmers reason about them to design their protection interfaces--to the machine language that actually executes. The researchers will construct machine-checkable specifications and design ways to construct compilers with machine-checkable proofs of security.","title":"End-to-end source-to-object verification of interface safety","awardID":"0540914","effectiveDate":"2006-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["406220"],"PO":["564388"]},"110555":{"abstract":"Background<br\/><br\/>The standardization of Message Passing Interface (MPI) has resulted in the development of a large number of MPI based parallel applications. For these applications to achieve high performance, it is crucial that the MPI library realizes communication efficiently. While progress has been made in optimizing MPI performance, the current implementations of MPI collective communication routines are far from ideal.<br\/><br\/>For MPI collective communication routines to achieve high performance on different platforms, they must be able to adapt to the system architecture and use different algorithms in different situations<br\/><br\/>The main challenge therefore, lies in the mechanism to facilitate a library routine to adapt to a given system\/application configuration and to find the most efficient algorithm for the configuration. <br\/><br\/><br\/>Intellectual Merit<br\/><br\/>The PI proposes to use a technique, which he will call delayed finalization of MPI collective<br\/>communication routines (DFoMCCR), to improve the software adaptability in MPI libraries.<br\/>A system that supports DFoMCCR has two key components:<br\/>(1) an algorithm repository that contains different algorithms that can potentially achieve high performance at different situations,<br\/>(2) an automatic algorithm selection mechanism to determine the algorithms to be used in a routine.<br\/><br\/>The delayed finalization potentially allows architecture and application specific optimizations to be performed on the library routines. A system that supports DFoMCCR can significantly out-perform traditional MPI libraries.<br\/><br\/>The PI will investigate DFoMCCR and mechanisms to facilitate DFoMCCR by developing various library systems that support DFoMCCR. The plan is to implement an algorithm repository that contains extensive sets of topology\/system unaware and topology\/system specific algorithms for common MPI collective communication operations.<br\/><br\/>Broader Impact<br\/><br\/>-efficient collective communication implementations obtained from the new libraries<br\/>-improved performance of MPI applications, which will benefit a very broad science and engineering community that uses MPI to solve problems. <br\/>-availability of these libraries will also benefit the MPI research community.<br\/>-project will train a number of undergraduate and graduate students in this area. <br\/>-Some techniques developed will be included in graduate and undergraduate elective courses.","title":"DCS: Delayed Finalization of MPI Collective Communication Routines","awardID":"0541096","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["554071","550962","463593"],"PO":["565272"]},"111413":{"abstract":"This project takes a fresh look at challenges in sensor networks in light of recent technology trends and experiences in pilot deployments. Technology trends indicate that the capacities of flash memories will continue to rise while their costs and energy consumption continue to plummet. This will make it possible to equip sensor nodes with energy-efficient, high-capacity NAND flash memory storage. Pilot deployments have shown that scalable sensor network architectures will be hierarchical, and comprise several hundreds of resource-constrained sensors as well as several tens of resource-rich sensor proxies. This motivates the need to develop novel methods to exploit resources at proxies while respecting constraints at sensors. This project has two contributions. The first contribution is a system for storage and retrieval of archival sensor data. This research includes the design, prototyping and evaluation of archival storage subsystems for sensor nodes, algorithms to enable efficient access of large distributed archival sensor data, and compression techniques for efficiently retrieving such data. Second, this project proposes an uncertainty-driven energy management architecture that unifies energy optimization across sensing, communication, routing, data processing and query processing tasks. This research uses prediction models and uncertainty as fundamental building blocks and builds a spectrum of energy-optimized services over this foundation. The project will have broad impact across data-intensive sensor network applications in science and engineering, as well as on education across the Five College consortium. The results of this project including publications, software and hardware prototypes will be made freely available to the research community.","title":"CAREER: Addressing Data and Energy Management Challenges in Hierarchical Sensor Networks","awardID":"0546177","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["526997"],"PO":["557315"]},"111435":{"abstract":"This CAREER project is developing a wireless sensor network infrastructure for medical care applications. Sensor networks have the potential for enormous impact on many aspects of medical care. In a hospital or clinic, outfitting every patient with wireless vital sign sensors will allow doctors and nurses to continuously monitor the status of their patients. In an emergency scenario, the same technology enables medics to care for large numbers of casualties. This project involves the development of a robust, scalable software platform for medical sensor networks, called CodeBlue, which provides protocols for device discovery, publish\/subscribe multihop routing, and a query interface allowing caregivers to request data from groups of patients.<br\/><br\/>CodeBlue is focused on addressing the challenges of robustness and scalability of large networks of wireless medical sensors. With limited radio bandwidth, highly variable data rates, and a broad range of reliability requirements for medical sensors, it is necessary to develop techniques that can tune the bandwidth and data quality delivered by the network. This project is developing a suite of small, wireless, wearable medical sensors; adaptive, cross-layer approaches to quality-of-service and congestion management; and techniques for analyzing and fusing data across multiple patient sensors. <br\/><br\/>The research undertaken through this project will have significant impact on the development of future medical sensing technologies. In collaboration with several hospitals and medical research groups, this project is evaluating the CodeBlue system in real clinical settings, including large-scale disaster response, monitoring stroke patient rehabilitation, and understanding the effects of medication on Parkinson's Disease.","title":"CAREER: CodeBlue: A Wireless Sensor Network Infrastructure for Medical Applications","awardID":"0546338","effectiveDate":"2006-02-15","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["297596"],"PO":["557315"]},"110588":{"abstract":"Realistic image synthesis is a central goal of computer graphics. Major recent advances have allowed researchers to model a wide spectrum of complicated visual phenomena with a very high degree of realism. Yet, even the best computer-generated feature films are a far cry from what one might consider \"real\". Curiously, the problem is generally not with computer graphics being unable to model the physics of the everyday visual world -- the problem is with the world itself! It's just too complex, too noisy, too rich and vivid to be recreated from scratch by even the most skilled and patient artist.<br\/><br\/>One solution is to use image-based methods and directly capture visual appearance of everything in the world -- if only it was feasible. Instead, this research effort centers on transferring appearance from a large database of stored visual data into a novel scene. The reason is that while capturing details of a particular scene is very expensive and time-consuming, obtaining similar information from some relevant scene is relatively easy. There is a tremendous amount of visual data that is already captured and available - thousands of webcams all over the world, millions of photographs placed on the Internet, depicting anything from sandstorms in Sahara to the glaciers in Alaska. And more data is being added every day. Our research is developing a unified approach for appearance transfer. Two broad scenarios are considered: transfer in image stacks (e.g. webcams) and single image transfer. In both cases, the major research issues involve: (1) grouping images and image stacks into regions with coherent material\/geometry properties, (2) determining correspondence between various groups in the scene and the database, (3) and finally transferring the correct appearance from the database by combining it with the large-scale structure of the input scene.","title":"Data-Driven Appearance Transfer for Realistic Image Synthesis","awardID":"0541230","effectiveDate":"2006-02-01","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["402502"],"PO":["532791"]},"111479":{"abstract":"While we are increasingly dependent on networked, distributed systems, current distributed systems require extensive manual effort to deploy, are expensive to administer, and tend to be fragile nevertheless. These problems stem fundamentally from the fact that current distributed systems lack principled design and depend on unreliable heuristics for their operation.<br\/><br\/>We are investigating new techniques for building robust, high-performance infrastructure services, based on novel analytical and numerical techniques for optimally or near-optimally performing resource allocation in large-scale distributed systems. We are developing new techniques that enable a new generation of highly reliable, self-organizing infrastructure services. In particular, we are developing a next-generation name service to replace the Domain Name Service that seamlessly supports the existing name hierarchy, a high-performance web cache that achieves predictably high performance by delivering hot data items close to clients proactively, and an eternal software repository that minimizes download time for swarming, bittorrent-style downloads. <br\/><br\/>This work lays a foundation for a principled understanding of resource tradeoffs in distributed systems that are currently performed either manually or in an ad hoc fashion. The new techniques are directly applicable to self-organizing peer-to-peer systems and lead to performance, manageability and availability properties that are difficult to achieve via conventional means. The application of these techniques to the implementation of infrastructure services will yield more robust replacements for fragile and expensive services, such as DNS, web caches, and software distribution than we use today.","title":"CAREER: Building Robust, High-Performance Infrastructure Services Through Informed Resource Tradeoffs","awardID":"0546568","effectiveDate":"2006-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["483774"],"PO":["535244"]},"116308":{"abstract":"The workshop takes place at the University of California, Santa Barbara, during May 25-25, 2006. It serves as a forum for research leaders from computational geometry and topology on the one side, and sensor and ad hoc networks on the other, to discuss problems at the interface of these disciplines. By bringing together experts from these areas, this workshop helps provide a fuller understanding of possible areas and avenues of collaboration between these fields, to stimulate cross-disciplinary research by enabling face-to-face interactions between researchers that do not normally meet, and to generate a agenda for future joint efforts in the study and exploitation of the geometric aspects of sensor networks.<br\/><br\/>The results of the workshop will be widely disseminated by means of the internet, with talk abstracts and a list of problems and issues raised. A version of the workshop report will also be published in technical journals with wide distribution in the communities of interest, such as the Communications of the ACM, the ACM Transactions on Sensor Networks, or the IEEE Transactions on Networking.","title":"Geometric Approaches to Ad Hoc and Sensor Networks","awardID":"0612299","effectiveDate":"2006-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["521232","536698","451114"],"PO":["321058"]},"110622":{"abstract":"Hierarchical Solving of Symbolic Problems in Heterogeneous Geometry Environments<br\/>PI: Elaine Cohen, <br\/>Co-PI Richard F. Riesenfeld<br\/>School of Computing, University of Utah<br\/><br\/>Abstract<br\/><br\/>Many important types of problems can be posed in a mathematical form, yet many real-world applications do not provide data in a form that can be used by traditional mathematical solvers. For example, medical models may be made of a 3D volume of point samples rather than the smooth models needed by the mathematical solvers. This research involves unifying these multiple, important methods of representing real-world data with the power of mathematical solvers by using methods based on robust geometry to solve problems. The investigators will use these results in applications for computer prototyping of mechanical systems and for computer-based surgical training. This research should be able to provide such tools as virtual calipers for imaged tumors or force-feedback interaction with complex medical data in the medical realm, and checking the fit of a CAD modeled mechanical part with a laser-scanned real part in the engineering realm.<br\/><br\/>This research proposes to use hierarchical, geometric representations to compute solutions of symbolic problems, thereby expanding the applicability of symbolic solvers to areas where the data may not be in the form of equations. Examples of such applications include real-world applications in engineering and medicine. Because this approach relies on bounds to intrinsic geometric properties, rather than manipulating only the underlying representations directly, the approach also will allow a single application problem to have several different model representations mixed together. This arises in complex problems where some data may be analytical, some acquired, and some just rough approximations.","title":"Hierarchical Solving of Symbolic Problems in Heterogeneous Geometry Environments","awardID":"0541402","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[293059,"486565"],"PO":["565157"]},"111513":{"abstract":"Digital designs that implement polynomial arithmetic computations are found in many practical applications, such as in Digital Signal Processing (DSP) for audio, video and multi-media applications. The growing market for such designs requires sophisticated CAD support for analysis and verification. Contemporary verification technology - mostly geared towards control-dominated applications - is unable to efficiently model and validate designs with large arithmetic datapath component. Such designs described at register-transfer-level (RTL) perform polynomial computations over bit-vector variables that have pre-determined word-lengths. Conventional Boolean models do not scale well wrt increasing word-lengths. To overcome this knowledge and technology gap, this research explores an altogether new paradigm for RTL datapath verification by incorporating symbolic computer algebra within a CAD-based verification methodology.<br\/><br\/>A bit-vector of size m represents integer values reduced modulo 2^m. Therefore, bit-vector arithmetic can be modeled as algebra over finite rings, where the bit-vector size dictates the cardinality of the ring. The verification problem then reduces to that of proving polynomial equivalence over finite rings of residue classes Z_{2^m}. In this project, the investigator: (1) models RTL datapaths as polynomial functions over finite integer rings of the type Z_{2^m}; (2) Studies the properties of such class of rings for polynomial equivalence using number theory and ideal theory; (3) Derives algorithmic solutions to RTL datapath verification using symbolic and algebraic manipulation; (4) Investigates the impact of polynomial manipulation over Z_{2^m} on RTL datapath synthesis; and (5) Investigates how to model arithmetic with imprecision (e.g., error rounding and saturation arithmetic) as polynomial functions. The intellectual merit of this research lies in its mathematical challenge and in its engineering application to digital design verification. Successful completion of this project would broadly impact datapath verification theory and practice and would also enhance the understanding of some classical mathematical problems. Both graduate and undergraduate students will be involved in this research. The results will be disseminated not only to the Digital Design and CAD community, but also to the Symbolic Algebra community.","title":"CAREER: Exploring Symbolic Algebra for RTL Verification of Arithmetic Datapaths","awardID":"0546859","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550799"],"PO":["562984"]},"111524":{"abstract":"A modern computer operating system comprises millions of lines of performance-critical code, much of it tightly coupled to the hardware, where most any error can be expanded into a security vulnerability, and whose behavior fundamentally impacts every application it hosts. Thus, perating systems are both inherently hard to program and critically important to get right, which has slowed the pace of operating systems research and development. New programming methodologies can help break this impasse, leading to systems that are easier to teach, understand, program, and get right. This research program develops a new component-based design for file systems and disk storage. Its particular focus is file system consistency, the process that ensures that disks contain correct information in the correct format. All file system components communicate using change descriptor data structures, a generalization of soft updates that allows independent file systems and disk structures to express dependencies. Change descriptors are exported to applications, allowing them to implement previously-inexpressible consistency policies. The resulting design will make file systems easier to develop by factoring out common code, improve storage system robustness through first-class consistency support, and lead to new application designs that are far more resilient to system crashes. The project will produce a file system component support library and an array of components, as well as several sample applications, including some designed for classroom use. All of the code will be freely and widely distributed.","title":"CAREER: Fine-Grained Operating System Components for Storage","awardID":"0546892","effectiveDate":"2006-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["541961"],"PO":["493916"]},"111447":{"abstract":"Wireless ad-hoc networks enable high utility applications for disaster recovery or military situations, mesh networks of homes, and wireless sensing networks. This work considers multiple-layer modeling, optimization, and design of multi-hop wireless ad hoc networks. It includes the two, currently debated, architectural choices - cross-layer and layered. The project contributes to practical design as well as fundamental\/theoretical understanding. It considers three canonical problems: optimal correlated data aggregation, (cooperative) data relaying, and delay-throughput optimality. Mathematical tools used include information theory, stochastic decision processes, queuing theory and algorithm complexity. Simulations of the new models complement the mathematical analysis. Some of the resulting designs are prototyped experimentally. The project involves undergraduate and graduate students, a jointly developed outreach plan with a high school teacher, and course\/laboratory development. Results, including software code, are disseminated through the project web page as well as regular publications.","title":"CAREER: Multiple-Layer Modeling and Design of Wireless Ad Hoc Networks","awardID":"0546402","effectiveDate":"2006-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["434241",295115],"PO":["557315"]},"115836":{"abstract":"This grant supports the travel, subsistence and registration expenses of 25 student participants in the Fifth International Joint Conference on Autonomous Agents and Multi-Agent Systems (AAMAS), being held June 8-12, 2006, in Hakodate, Japan. This conference is entirely devoted to all aspects of research and application of agents technology, an important area of computer science research in domains such as information retrieval, user interfaces, electronic commerce, robotics, computer mediated collaboration, computer games, ubiquitous computing, social simulation, education, and training. <br\/><br\/>Participation in this conference will allow a diverse group of students, representing a wide range of research areas and methodologies, to present their research to the agents community. In addition, special mentoring activities are planned for them. This conference will not only be extremely educational for students, but also will mark a major step forward for them in their emergence as scientific professionals. In addition, the knowledge and insights they bring back will be valuable for the research community in the United States.","title":"AAMAS-06 Student Travel Grant","awardID":"0610527","effectiveDate":"2006-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["362927"],"PO":["564456"]},"110601":{"abstract":"Collaborative Research: Fast and Accurate Volumetric Rendering of<br\/>Scattering Phenomena in Computer Graphics<br\/><br\/>Real world scenes often show complex volumetric effects due to scattering of light by particulate media. These effects include some of the most magnificent visual experiences known to man, such as the colors of sunrise<br\/>and sunset, the brilliant underwater caustics, or even the gloomy weather effects due to fog, mist, haze, rain, snow, and the hazardous effects due to smoke and dust. Realistic visual reproductions of these effects has<br\/>broad impact in various application domains including digital entertainment, scientific education, simulation and training (flying, diving and medical diagnosis), and safety education (underwater explorations and search efforts in smoky and dusty conditions). While there has been a substantial body of work in computer graphics on rendering the effects of volumetric scattering, those methods are usually too slow to enable widespread adoption, taking hours to days to simulate a single scene. This makes it infeasible to include accurate scattering effects in applications like video games, interactive relighting, virtual environments or scientific education.<br\/><br\/>The key insight in this research is that while the explicit numerical simulation of scattering is difficult, its qualitative properties are quite simple, usually just involving a blurring or spreading out of light.<br\/>The investigators first identify simple configurations (or geometries) of media and sources which frequently occur in scenes. They next develop accurate analytic and data-driven models that describe multiple scattering of light in these configurations based on the theory of radiative transfer. These models are then leveraged in conjunction with Monte Carlo, hardware and precomputation methods, to render volumetric effects at interactive rates in a wide range of dynamic scenes and media. Since analytic or algorithmic techniques can only be as accurate as the underlying representations of scattering properties, a critical part of the research involves designing novel experimental setups to measure a wide array of scattering media for the first time. Finally, this effort includes a significant educational component and promotes collaborative<br\/>spirit, with new joint courses, exchange student visits, visitinglectures, enriching the experiences of both students and researchers.","title":"Collaborative Research: Fast and Accurate Volumetric Rendering of Scattering Phenomena in Computer Graphics","awardID":"0541307","effectiveDate":"2006-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["549608"],"PO":["532791"]},"110502":{"abstract":"Although arrays of cameras have existed in various forms for more than a century, arrays of projectors have been limited by available technology to small numbers of devices. As the number of projectors that can be feasibly assembled into an array increases, one can begin to treat the illumination produced by the array as a light field - radiance as a function of ray position and direction in free space. The light field has been studied abstractly by numerous researchers; however, physical systems for generating light fields have been severely limited in resolution by the cost and size of projectors. The investigators are building an array of 128 miniature, SVGA-resolution video projectors, and will interleave these projectors with an existing array of 128 video cameras, thereby producing a device that can both record and generate light fields - a fundamentally new capability. These new techniques will yield new methodologies for image-based modeling, inspection and motion capture and will have applications in areas such as in entertainment, archaeology, and modeling and simulation for training and mission rehearsal.<br\/><br\/>Using the existing camera array the investigators have studied several types of high-performance imaging, including high-speed videography, synthetic aperture photography, and tiled panoramic imaging. Using the new hybrid array,they will explore two additional problems:<br\/><br\/> (1) Measuring the 3D shape of an object from every direction at once, meaning capturing all sides of the object in parallel. No existing technology can do this, at least not at optical wavelengths. The goals are near-instantaneous shape capture of a moving object and full-shape motion capture of moving objects.<br\/><br\/> (2) Illumination of physical objects non-photorealistically, to enhance their appearance as seen by a human observer. Examples include recoloring, cloaking, or illumination that is everywhere-perpendicular or everywhere-grazing to the surface of the object.","title":"Active Computational Imaging Using a Dense Array of Projectors and Cameras","awardID":"0540872","effectiveDate":"2006-02-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["438512","438513"],"PO":["532791"]},"111525":{"abstract":"Random structures have become an indispensable tool of computer science over the last two decades. When used to model input distributions, they provide an easily accessible experimental platform for exploring and <br\/>testing new algorithms: a number of practically important algorithmic developments have been made by designing algorithms that perform well on certain simple input distributions. When used to model the formation and growth of networks, they have been the dominant analytical tool in an area that has seen explosive growth in recent years: random graphs are now central objects in areas ranging from communications and information retrieval to biology and game theory.<br\/><br\/>This research project focuses on i) the analysis of algorithms on random constraint satisfaction problems, such as random k-SAT and, ii) the development of analytically tractable models of random networks that <br\/>incorporate realistic constraints, such as low-dimensionality and total connection length. The goal of the<br\/>first part is to address a number of questions relating the performance of algorithms on random constraint satisfaction problems to structural properties of their solution--spaces. It is partly motivated by the <br\/>remarkable experimental performance of a new algorithm for such problems, Survey Propagation, that employs a number of deep, but non-rigorous, ideas from statistical physics. The goal of the second part is to remove a number of unrealistic, hard-coded assumptions underlying existing models of random networks by introducing generative models in which networks are maximum entropy solutions of optimization tradeoffs.","title":"CAREER: Algorithms and Models for Random Structures","awardID":"0546900","effectiveDate":"2006-02-15","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[295284],"PO":["565251"]},"111448":{"abstract":"CAREER: Foundations for Ubiquitous Image-based Appearance Capture<br\/>PI: Todd Zickler<br\/><br\/>Abstract:<br\/>For many applications, the nature of visual content is rapidly changing. Two-dimensional images are being replaced by higher-dimensional appearance models that summarize the (very large)set of images of an object for many viewpoints and lighting conditions. These models enable an object to be virtually rotated, re-lit and composited into other scenes, and they improve our ability to automate visual tasks such as detection, recognition, and tracking. Yet, despite the growing number of applications, suitable appearance models of common objects are remarkably hard to find. This is due largely to the complexity of appearance, which makes the task of appearance capture quite formidable. The goal of the proposed research is to develop a framework for appearance capture that can be applied to any opaque and non-refracting surface, and that is simultaneously accurate and practical. Ultimately, we seek to enable \"ubiquitous appearance capture\": the widespread ability to acquire appearance models outside of the laboratory - in homes, offices, museums, hospitals and in the field. To achieve this goal, we take a physics-based approach that seeks to exploit common reflectance properties (e.g., Helmholtz reciprocity, reflectance separability and compressibility) that we believe have yet to be fully utilized. The benefits of this approach are two-fold. First, it enables image-based acquisition of both shape and reflectance from a small number of uncalibrated cameras and light-sources, eliminating the need for laser range-scanners, projector-based structured lighting, or other specialized equipment. Second, it makes possible the modeling of a broad class of surfaces, including those with complex reflectance not necessarily well-represented by low-dimensional (i.e., parametric)models. This second property is essential for modeling real-world surfaces, and is very different from most existing image-based<br\/>approaches that are predicated on restrictive assumptions about the nature of surface reflectance. This research activity is closely linked to an educational program that includes the development of courses in human and computer vision at both the undergraduate and graduate levels, and the creation of undergraduate and graduate research opportunities. The educational program extends beyond the university by making a mobile acquisition system available as a teaching tool in museums and classrooms in the Boston area, and by making appearance models and software available through the Internet.<br\/><br\/>URL: http:\/\/www.eecs.harvard.edu\/~zickler\/research.html","title":"CAREER: Foundations for Ubiquitous Image-Based Appearance Capture","awardID":"0546408","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["515747"],"PO":["564316"]},"111338":{"abstract":"This CAREER project is focused on voice source extraction directly from recorded speech signals for the enhancement of acoustical models in speaker affect analysis. The project has four primary research goals. The first goal is the creation of new techniques in voice source estimation from the acoustic speech signal without the use of auxiliary devices (e.g., EGG's). This is accomplished through the development of metrics for assessing glottal quality and choosing estimates that reflect the best approximation of the voice source given the available speech data. A second goal is the automated parameterization of the voice source in both the time and frequency domain allowing the shape and characteristics of the voice source to be quantified for analysis. The third goal is to integrate the parameterized voice source into an acoustical framework for describing the characteristics of a speaker's affective\/emotional state. Current databases consisting of representations of speaker emotion, deception, and stress are under analysis for the incorporation of voice source features not previously available. The final goal of the project is the creation and dissemination of a robust set of extraction and analysis tools of the voice source to the scientific community to encourage and enable the analysis of voice source parameters in all forms of speech research. The project contributes greatly to speech analysis applications by enhancing the theoretical knowledge of assessing the quality of voice source estimates and providing the tools to enhance the acoustical models of the voice. Additionally, the project allows for the design of educational demonstrations for outreach activities focused on improving community exposure to science and engineering research and increasing the participation of underrepresented groups.","title":"CAREER: Extraction and Integration of Voice Source Features into the Acoustical Analysis of Spoken Affect","awardID":"0545772","effectiveDate":"2006-02-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["485769"],"PO":["565215"]},"111349":{"abstract":"Quantum information theory, a branch of the general field of quantum information science (QIS), is the quantum extension of Shannon's classical information theory.<br\/>The past decade has seen an extraordinary amount of interest and effort in quantum information theory, spurred by quantum cryptography (which guarantees unconditionally secure communication) and the important role of error correction in overcoming decoherence in quantum computers (which are, in theory, capable of breaking RSA encryption). <br\/><br\/>Intellectual Merit <br\/>Hitherto quantum and classical information theory have been developed using an inefficient ``first principles'' approach: after the communication model has been defined, and a formula for the appropriate capacity region conjectured, ideas and techniques from related models are applied to the problem, with an ever-increasing degree of sophistication and complexity. This may be compared to computer programming directly in assembly language as opposed to using a high-level language like C++. The foundational aspect of this proposal focuses on the development a high-level, modular mathematical formalism for quantum and classical information theory, in which (i) all asymptotic coding theorems, as well certain general principles, are phrased as inequalities between information processing resources; (ii) a large class of coding theorems can be simply proved by manipulating these resource inequalities according to the rules of the resource calculus. Furthermore, such a framework provides structural insights into the logical dependencies among coding theorems. The practical aspect of this proposal regards translating these logical dependencies into coding strategies for the finite setting (such as new quantum error correction codes). The development and popularization of such a high-level framework has significant educational benefits as a compact organizing principle. The proposed program consists of four components: (I) the development of the resource calculus; (II) the classification of known resource inequalities into those which can (elementary) and cannot (composite) be made by combining others; (III) exploring new communication scenarios and establishing new coding theorems; (IV) applying the structural insights gained to practically relevant finite codes. Starting with the basic two party scenario, for each component complexity is increased in two independent directions (a) by adding more parties with varying roles (cooperative, adversarial, or passive) and (b) by imposing thermodynamically motivated constraints on local information processing.<br\/><br\/>Broader Impact<br\/>This proposal contains a further strong educational component, including: the incorporation of research ideas into the USC undergraduate curriculum; development of a graduate course in quantum communication theory; and the training of PhD students. The PI is currently writing a textbook entitled ``Principles of Quantum Information Theory'', with co-authors Patrick Hayden and Andreas Winter. The central role played by the resource calculus in this book will ensure that this project contributes meaningfully to educational and scientific activities of practical benefit to society. The PI will foster interdisciplinary collaborations and be active in contributing professionally to the broader QIS community.","title":"CAREER: A High-Level Framework for a Unified Treatment of Quantum and Classical Information Theory and Thermodynamics","awardID":"0545845","effectiveDate":"2006-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":[294913],"PO":["565157"]},"114748":{"abstract":"Background<br\/><br\/>While moving into new fields is definitively important for the future of computing, and for society, to maintain the vitality of research in the core areas of computing is also of importance for both its intellectual and economic value. In the case of compilers, although much progress has been made, there are still a vast number of open problems with solutions that may have dramatic economic impact.<br\/><br\/><br\/>Intellectual Merit<br\/><br\/>The PI requests funds to support the organization of a workshop that will congregate some of the leading researchers in compiler technology to define an agenda for compiler research in the next decade. The main goal of the workshop will be to identify the great challenges and opportunities that our times present to compiler technology and assess the likelihood of success. <br\/>Some areas of discussion will be:<br\/>-Program optimization strategies<br\/>-Compiler support for parallelism.<br\/>-Compiler analysis for correctness<br\/><br\/>The final outcome of the workshop will be a report to the National Science Foundation and a paper that the workshop organizers will write and expect to publish in a widely read magazine such as IEEE Computer or the Communications of the ACM. <br\/><br\/>Broader Impact<br\/><br\/>-Workshop participants. We expect to congregate a few of the leading researchers<br\/>and practitioners in the area of compilers mainly from the US, but will also like to<br\/>invite a few, probably three or four, international researchers. We will make the<br\/>necessary effort to distribute participants across generations, gender, race and<br\/>geographical origin within the US. <br\/>-Contributions from the community at large. We plan to request contributions from the community at large in the form of white papers. The authors of white papers with the most interesting ideas will be invited to participate in the workshop.","title":"Workshop: A Workshop on the Future of Compiler Research","awardID":"0605116","effectiveDate":"2006-02-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["533380"],"PO":["565272"]},"110602":{"abstract":"In 2003, the Principal Investigator and his collaborators introduced a new technique for measuring the appearance of a textured object as it is viewed or illuminated from different directions. The technique, which requires no mechanical movement and is very easy to calibrate, is based on use of a tapered kaleidoscope: a tapered hollow tube of polygonal cross-section, whose inner walls are lined with front-surface mirrors. This arrangement is used to simulate the effect of a large array of cameras and projectors, all pointing toward the target object from different directions. This technology promises to improve measurement and display in many areas by grounding computer generated imagery more thoroughly in real-world data and by making the means of capture more readily available to a greater number of researchers. The technology also has worthy forensic uses, such as bullet and fingerprint identification, and early detection of skin melanomas, as well as materials measurements for simulation. There is also enormous potential benefit from proposed earlier work on using the kaleidoscope principle to create a lightfield transducer, which has potential for creating a new type of three dimensional display exhibiting fundamentally improved angular characteristics.<br\/><br\/>Because this approach to data capture introduces no mechanical error, it promises to enable a new field of inquiry into questions that rely on precisely calibrated measurement of multi-view, multi-illuminated, and multi-spectral optical characteristics. Research tasks include mathematical modeling and analysis as well as practical lab-bench experimentation and data collection in the following areas: Capturing eight dimensional surface BSSRDF, capturing full lightfield for 3D objects, capturing full spectrum of lightfield with tunable<br\/>wavelength filters, real time multi-view structured light depth scanning, increasing angular resolution through combined use of multiple cameras and narrow taper angles, making effective use of image fragments, synthesis from sparse and non-rectangularsamples, and experiments toward extreme wide-angle lightfield<br\/>transducers.","title":"Reflectance Analysis and Synthesis using the Tapered Kaleidoscope","awardID":"0541314","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["482097"],"PO":["532791"]},"112802":{"abstract":"REU Site: Mobile Actuator and Sensor Networks<br\/><br\/>The goal of this REU Site program in Mobile Actuator Sensor Networks (MAS-net) is to provide eight undergraduate students an opportunity to participate in the ongoing research activities of faculty members in the Electrical and Computer Engineering Department at Utah State University. This is a ten-week<br\/>program starting from early June to mid-August. This early exposure to research activities will substantially enhance the students' learning process and research experience, actively promote their interests in MAS-net related research, and improve their research skills.<br\/><br\/>The proposed program will emphasize several MAS-net related techniques and their applications in some interesting and crucial projects that the REU participants will easily identify with. The main intellectual merit of this research is that it addresses a broad spectrum of challenging issues in the field of sensor networks using hands-on and stimulating research projects focusing on the development of (1) parsimonious signal and image processing algorithms and Ad-Hoc Positioning Systems (APS) in MAS-net; (2) consensus algorithms for coordination of multiple robotic vehicles; (3) a simulation platform to simulate distributed control of diffusion process, (4) non-model-based plume tracking algorithms with networked mobile sensors, and (5) design methods for emergent swarm behaviors in MAS-net.<br\/><br\/>REU students are encouraged to practice active learning and open exchange of ideas and to develop team spirit. REU students will participate in weekly individual meetings, weekly research group meetings, biweekly REU group meetings, bi-weekly \"expanding your horizon\" seminars, and social events. They will have opportunities to learn to assimilate the latest research, assess their own research, present their own work and experimental results, prepare publications, and prepare for admission to graduate school.<br\/><br\/>This program will directly help undergraduate students by exposing them to the intellectual excitement involved in research activities and professional meetings, and teaching them how to effectively assimilate latest research, critically assess their own research, cogently present experimental results, and effectively prepare publications. The enrollment will ensure that at least four of the eight participants are underrepresented students and at least four students are from other institutions, especially those institutions where research programs are limited.<br\/><br\/>URL: http:\/\/www.ece.usu.edu\/REU\/","title":"REU Site: Mobile Actuator and Sensor Networks","awardID":"0552758","effectiveDate":"2006-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["540506","496882"],"PO":["433760"]},"112736":{"abstract":"The REU Site at Florida International University (FIU) will provide <br\/>participants with a venue to directly participate in state-of-the-art <br\/>research while exposing them to graduate school life and work in <br\/>academia and industrial research labs. REU students will participate in <br\/>team-oriented projects involving several areas of autonomic computing, <br\/>including self-management in mobile computing, autonomic anomaly and <br\/>misuse detection, adaptive network traffic monitoring and management, <br\/>autonomic storage systems, autonomic secure operating systems, and <br\/>testing of autonomic computing systems. The REU participants will each <br\/>learn from their team-members and advising faculty, maturing as <br\/>independent thinkers and developing critical communication, social, and <br\/>team-work skills. The Site's faculty will continue their mentoring <br\/>relationships with students after the completion of the summer program <br\/>to ensure that each project is completed and that each participant will <br\/>have the support needed to make the transition to graduate school.","title":"Research Experiences for Undergraduates: Autonomic Computing Research at FIU","awardID":"0552555","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["541104","550720"],"PO":["433760"]},"111516":{"abstract":"Proposal 0546867<br\/>\"CAREER: Penalty Logic for Structured Machine Learning\"<br\/>PI: Alan Fern<br\/>Oregon State University<br\/><br\/>This research will study penalty logic as a knowledge representation technique for structured machine learning. Such learning problems involve inducing complex mappings between structured data types. Examples include learning to map American football video to play descriptions, and mapping the state of multi-agent planning problems to joint agent actions. Such problems often contain many \"nearly sound\" logical constraints, which are generally true, but sometimes violated. These constraints can be explicitly represented using penalty logic models, which are sets of weighted logical formulas, where each weight represents the cost of violating a formula. Penalty-logic models allow the synergistic combination of robust training methods for linear cost functions and years of work on logic-based representations. The project will study leveraging penalty logics in four directions: (1) learning model structure, (2) achieving practically efficient inference, (3) incorporating human provided knowledge, and (4) reducing labeling effort via active learning. The broader impact of this work will be to advance the applicability of structured machine learning to a wide range of interpretation and decision making problems, including those above. Planned educational activities include initiating an annual competition for Oregon high school students aimed at increasing CS enrollment and interest in AI.","title":"CAREER: Penalty Logic for Structured Machine Learning","awardID":"0546867","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["551065"],"PO":["491702"]},"110559":{"abstract":"Realistic rendering systems can compute physically accurate images of a wide range of materials. However, some of today's most important challenges in rendering, particularly rendering human beings, involve densely packed elements -- the hairs on a head, the threads in a shirt -- that are readily visible at ordinary distances. Because the geometry is densely packed together, accuracy requires a full simulation of how light<br\/>reflects from hair to hair, or from thread to thread, before it gets to the eye. However, these materials are difficult to work with: the parts are too numerous for a detailed simulation to be practical, but they are not small enough to be modeled as a continuous medium. This research is exploring methods that can use both approaches at once without sacrificing accuracy.<br\/><br\/>Correctly rendering these dense aggregations is an important open problem in computer graphics, requiring fundamental theoretical and algorithmic advances to be solved. Directly simulating multiple scattering on such intricate models is prohibitively costly, so in practice it is approximated by simple heuristics. However, for light-colored materials such as blond hair or white cotton, very little light is absorbed in a single interaction, so the visual appearance of these materials is significantly affected by multiple scattering. For correct results a complete scattering simulation is required.<br\/><br\/>This research project aims to efficiently simulate scattering in dense geometry by introducing an approximation of the whole aggregation as a continuous scattering medium. This allows methods for volumetric light transport to be applied when possible while still using the detailed geometry when necessary. Constructing this approximation requires a fundamentally new understanding of the relationship between geometric and volumetric rendering. Implementing the approximation will require new algorithms to be developed, and applying it will require improvements to the state of the art in volumetric rendering.","title":"Unifying Geometric and Volumetric Light Scattering for Accurate Rendering of Dense Geometry","awardID":"0541105","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["448639"],"PO":["532791"]},"121615":{"abstract":"As the pace of biological research increases, computers are being used to manage the explosive amount of biological information. Much of information relevant to biological research is recorded either as coded data in biological databases or as free text in journal articles and in annotation fields of biological databases. Natural language processing tools have shown to have the potential to decrease the difficulty of managing information in biomedical free text.<br\/>This project aims to use online resources (e.g., genetic databases, free-text corpora or machine readable dictionaries) and machine learning techniques for the construction of a biological entity tagging system that associates terms mentioned in text with entries in databases. Biological entity tagging is extremely challenging because of novelty, synonymy and ambiguity associated with terms representing biological entities in text. The project includes the construction of a biological entity dictionary and the acquisition of disambiguation knowledge using online resources. It also includes the development of dictionary lookup method and the employment of machine learning techniques for resolving ambiguity, discovering novelty, and recognizing synonymy. The research will generate several deliverables and the enriched information on gene\/protein names, bibliography, and other annotation fields will be integrated into UniProt\/PIR databases, which is an ongoing international effort on protein databases.<br\/>The project provides an opportunity of furthering the collaborations among Columbia University, Georgetown University Medical Center and University of Maryland at Baltimore County. The project also integrates educational and research activities by having graduate and undergraduate students involved in the overall project.","title":"SEI+II(BIO): BioTagger - Biological Entity Tagging Using Online Resources and Machine Learning","awardID":"0639062","effectiveDate":"2006-02-28","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7373","name":"ITR-INFORMATION INTEGRATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7602","name":"INFORMATION INTEGRATION"}}],"PIcoPI":["390544"],"PO":["563727"]},"110516":{"abstract":"Background<br\/><br\/>The proposed project will pursue the theory and practice of implementing algorithms for dense linear algebra operations on SMP and multicore systems. It will develop algorithms, abstractions, APIs, implementations, software architectures, analyses, and simulators. The successful completion of the project will improve the understanding of the subject, will provide tools for implementing scalable libraries and pedagogical tools, and will make libraries available to the scientific computing community. In addition, it is expected to provide important insights into the design and use of current and multicore processors<br\/><br\/>The intellectual merit of the proposed work lies with the knowledge that will be gained regarding the parallel<br\/>implementation of linear algebra libraries and applications in general on SMP systems and multicore processors. In addition, insights are expected to affect future design of architectures with large numbers of cores on a single chip.<br\/><br\/>The broader impact lies with the tools, in form of libraries, that will be made available to the computational<br\/>science community, and the pedagogical benefits. In the body of this proposal and in the letters of support from industry, evidence is presented that the proposed work is:<br\/>(1) of scientific importance, (2) based on sound preliminary results, (3) achievable, (4) of benefit to the<br\/>scientific computing community, (5) of interest to industry, and (6) of pedagogical value.","title":"ST-CRTS: Foundations of Programming Linear Algebra Algorithms on SMP and Multicore Systems","awardID":"0540926","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["556801","332388"],"PO":["565272"]},"111407":{"abstract":"In the environment where new large-scale problems are emerging in various disciplines and pervasive computing applications are becoming more common, there is an urgent need for techniques that provide efficient and accurate knowledge discovery by limited-capacity computing devices. The objective of this project is to address this need by developing memory-constrained predictive data mining algorithms that operate when data size exceeds the available memory capacity. The approach is based on the integration of data mining and data compression techniques to optimally utilize the memory for data and model storage, learning, and ancillary operations. The methodology will be thoroughly evaluated on a range of real-life problems that includes learning from large sorted databases, biased data and nonstationary data. Various memory constraints will be considered pertaining to devices ranging from powerful workstations to handheld computers and cell phones to small, inexpensive sensors. This research will reveal the memory lower bounds for accurate learning from different types of data and by different types of learning algorithms. The educational component of the project seeks to integrate research into computer science instruction by designing exciting courses, exploring effective teaching techniques, introducing research to undergraduate and graduate students, and involving underrepresented student groups in research. Broader impacts of the project will be in extending the frontiers of computer and information science and in facilitating knowledge discovery in various scientific, engineering, and business disciplines. Teaching materials and research results, including developed software and databases, will be widely disseminated via Internet (http:\/\/www.ist.temple.edu\/~vucetic\/CAREER.htm) to promote learning and enhance scientific understanding.","title":"CAREER: Memory-Constrained Predictive Data Mining","awardID":"0546155","effectiveDate":"2006-02-15","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["486284"],"PO":["563751"]},"111319":{"abstract":"Alexandra Boldyreva<br\/>Georgia Tech.<br\/>0545659<br\/><br\/>Abstract<br\/><br\/>While cryptographic research has made great progress in its history, providing strong solutions to a wide variety of problems, its practical utilization lags behind. Only a small fraction of cryptographic designs have been deployed in practice. Moreover, wrong choices are often made and insecure schemes are implemented leading to costly consequences. A similar situation can be seen in research done in many applied computer science disciplines. Increased security and privacy concerns have given rise to many new security-oriented research directions within traditional disciplines. However, the proposed ad-hoc solutions rarely employ results of modern cryptographic research and have proper security analysis, and are often even insecure at closer consideration. <br\/><br\/>In the PIs view the main reasons for a gap between strong cryptographic research and its poor utilization in industry and other applied research areas are: 1) cryptographers, practitioners and researchers in other computer science areas are disjoint communities that rarely collaborate and often are unaware of state-of-the-art developments of others; 2) cryptographers are perfectionists in that they define and target for very strong security notions while many applications prefer speed to such perfect security, and thus choose ad-hoc protocols; 3) practitioners often make the wrong choices because they lack basic education in cryptography.<br\/><br\/>The proposed research and educational plan aim to narrow the gap between theoretical cryptographic research and more applied areas of computer science facing the need to secure their applications, by going further than designing general-purpose cryptographic primitives and actually integrating cryptography with the applications. The approach includes the following steps: 1) close collaboration with faculty and students from applied areas such as database systems and computer architecture to rigorously study the emerging applications requiring cryptographic solutions; 2) development of appropriate security definitions for the cases where the existing definitions are too strong in the sense they are unachievable in the setting of a given application or can be achieved only by insufficiently efficient schemes; 3) design of the new protocols for the applications of emerging importance that are simultaneously functional, efficient and provably secure, and improvement of efficiency and reliability of the existing public-key encryption and signature schemes whose relative inefficiency is often an obstacle; 4) continuing outreach activities and quality education on all aspects of modern cryptography.","title":"CAREER: Integrating Cryptography with Emerging Security Applications","awardID":"0545659","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["549957"],"PO":["497499"]},"111408":{"abstract":"Nicholas Hopper<br\/>Minnesota-Twin Cities<br\/>0546162<br\/><br\/>Abstract<br\/><br\/><br\/><br\/>Protocols for Information Hiding attempt to mitigate information leakage that encryption cannot prevent: steganography protocols attempt to conceal sensitive communication within innocent messages, anonymity protocols attempt to conceal the true sender and recipient of messages, and watermarking or fingerprinting protocols attempt to indelibly mark objects to allow tracing of leaks. A gap exists between current theory and practice of information hiding, leaving currently used systems vulnerable to leakage of personal information.<br\/><br\/>This project is focused on applying recently developed cryptographic techniques to develop and implement efficient and provably secure protocols for information hiding. A secondary focus of the project is applying cryptographic proof techniques to improve understanding of the relationships between, and the inherent limitations of, steganography, watermarking, and anonymity protocols.<br\/>The project is expected to produce protocols that exhibit direct benefits to society, by improving the protection of personal privacy, national security, and intellectual property. Furthermore, an important contribution of this work is the theoretical attack models under development, which are expected to feed back into evaluation of future protocols, enhancing the infrastructure for research in information hiding.","title":"CAREER: Practice-oriented provably secure information hiding","awardID":"0546162","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["548224"],"PO":["565327"]},"111509":{"abstract":"CCF-0546844<br\/>Zhendong Su<br\/>University of California -Davis<br\/><br\/>CAREER: Reliability and Security of Database and Web Applications<br\/><br\/>Database and web applications contain many critical faults, seriously undermining the security and reliability of our national information system infrastructures. Many such errors are introduced because of<br\/>these applications' dynamic and complex interactions with outside environments such as dynamically constructing queries to access a database. Thus, it is important to automatically enforce the correctness of these interactions, but no such technique or tool exists. Consequently, these applications are susceptible to serious failures and security threats. This project proposes a novel, systematic analysis framework to address this problem. With static analysis and runtime checking as its foundation, this framework will<br\/>offer a rigorous and comprehensive approach to validate and enforce large classes of high-level properties specific to database and web applications. The additional educational component includes the development of an interdisciplinary course integrating concepts from databases, programming languages, software engineering, and computer security to address the educational need of engineering robust database-intensive applications. This project is expected to impact both industry and academia. Analysis tools developed in the project<br\/>will be distributed for teaching, research, and experimental evaluation at other institutions and by industry. This project will also produce publicly available instructional materials including web sites and courseware that help people write more reliable and secure database and web applications, and serve as a clearing house for development tools such as the ones from this project.","title":"CAREER: Reliability and Security of Database and Web Applications","awardID":"0546844","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["562712"],"PO":["564388"]},"110608":{"abstract":"Background<br\/><br\/>A typical compiler is designed to apply its optimizations to built-in types of the language it is compiling. Although built-in general-purpose optimizations might be generally beneficial, they cannot be directly applied to user-defined types because their correctness cannot be determined a priori. Extending a compiler to optimize some particular userdefined type would be useful for that particular type, but this approach becomes burdensome if the compiler must be extended on a type-by-type basis. A more powerful approach would be to enable compiler optimizations that are generic, i.e., that can be applied to any type (built-in or user-defined) that meets fundamental semantic requirements.<br\/><br\/>Intellectual Merit<br\/><br\/>-Formal concept definitions. The PIs propose to integrate concept-based optimization with their research on formalization of concepts for generic programming.<br\/>-Language support for concepts. Concept-based optimization will leverage and inform our on-going research on direct language support for concepts and generic programming.<br\/>-Compiler support for concepts. The PI's initial efforts incorporating concepts into the GNU C++ compiler will be extended to support concept-based optimizations.<br\/>- Concept-based optimizations. The PI's will leverage generic programming mechanisms to define optimizations using concepts so that such optimizations apply to user-defined types, simply by stating that the types model (i.e., meetthe requirements of) particular concepts.<br\/>-Deployment and library evolution. Selected generic libraries, including the Standard Template Library, the<br\/> Boost Graph Library, and the Vector, Signal, and Image Processing Library will be upgraded to take advantage of language extensions for generic programming and to take advantage of concept-based optimization.<br\/>-Evaluation suite. The PIs will collect optimizations for a suite of high-level benchmarks that can be used to evaluate concept-based optimizations. An important benchmark in this regard will be to demonstrate that generic optimizations offer the same performance benefits when applied to built-in types as do traditional type-specific optimizations.<br\/><br\/>Broader Impact<br\/>The proposed research will have:<br\/>- Direct impact on the future development of mainstream programming languages that support generic programming (e.g., C++, C#, and Java), and on their standard libraries. <br\/>-Support for generic programming in these languages that will provide valuable high-level information about user-defined types,making high-level and concept-based optimization more widely applicable. <br\/><br\/>This project will directly train graduate students and post-doctoral researchers in the emerging field of generic programming. Results from our research will be integrated into graduate programming coursesand into textbooks.","title":"ST-CRTS: Collaborative Research: Lifting Compiler Optimizations via Generic Programming","awardID":"0541335","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["562709"],"PO":["565272"]},"108381":{"abstract":"Scientists interested in describing the complexity of human interaction have begun to realize the necessity of collecting intensive longitudinal data to enable them to describe the dynamics of the interaction process. These data can take the form of a daily diary of marital interactions, an hourly account of the behavior of an unruly student, a second to second account of a parent-infant interaction, a continuous time measure of physiological characteristics, or a dose-to-dose account of the effect of a drug or treatment regimen. Unlike the more common approaches to the study of development that may use a single, simple model to describe average group trends, dynamic models can accommodate differences in how individuals change. They can be used to describe how a process unfolds for each individual, to show how individuals differ in that process, and to predict how that process will evolve. Once these dynamics are understood, the opportunity exists to develop a control model with the intent of moving the process toward a desired outcome. <br\/><br\/>As part of this project, the investigators plan to adapt, modify, and when necessary develop new dynamic and control models appropriate for the needs of developmental researchers. To accomplish these goals, this project brings together members of the engineering, applied developmental statistics, and developmental science research communities to develop models that will specifically address questions related to differences in the way individuals develop and interact.<br\/><br\/>To demonstrate this model data from the Infant and Child Temperament Study will be assessed to determine the individual differences in how an infant develops the ability to self-regulate emotion. The state-space implementation of this model will allow more flexibility and a richer description of the dynamics of the process by producing a model that can change and develop as the process changes. This approach leads directly to the optimal control\/process adjustment model in which individuals can be assessed to determine whether they moving in the direction of a desired outcome. If they are off target, critical control variable values can be assessed and changed. The results of these changes can then be assessed to determine if the individual is back on target. To demonstrate this model, the investigators will assess parent-infant interaction data related to the parents' ability to soothe a distressed child. A model will be developed that will allow investigators to assess which combinations of parent behavior and infant response result in decreasing the child's distress. This model can then be used to provide online assessment to parents that will give them useful feedback during the course of the subsequent interactions suggesting whether their behavior should lead to success and whether and how they should modify that behavior. This general analytic approach will allow researchers to model many different situations in which such feedback can help optimize the quality of an interaction. These can include marital interactions, parent\/child relationships, interactions between teachers and students, and encounters between therapists and clients. These methods will also be appropriate for optimizing individual outcomes based on drug treatments, physical therapies, medical treatments, and combinations of different treatment regimens.","title":"DHB: Multilevel Autoregressive Moving Average (ARMA) and Dynamic Models for Longitudinal Data and the Study of Human Interactions","awardID":"0527449","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7319","name":"HSD - DYNAMICS OF HUMAN BEHAVI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7322","name":"HSD - DEC, RISK & UNCERTAINTY"}}],"PIcoPI":[286454],"PO":["564435"]},"109393":{"abstract":"Prosody is an integral part of human communication, but one that<br\/>second language (L2) learners rarely learn. Topic shifts, contrastive<br\/>focus, and even simple question\/statement distinctions, cannot be<br\/>recognized or produced in many languages without an understanding of<br\/>their prosody. However, 'translating' between the prosody of one<br\/>language and that of another is a little-studied phenomenon. This<br\/>research addresses the 'prosody translation' problem for Mandarin<br\/>Chinese and English L2 learners by identifying correspondences between<br\/>prosodic phenomena in each language that convey similar meanings. The<br\/>work is based on comparisons of L1 and L2 prosodic phenomena and the<br\/>meanings they convey. Computational models of prosodic variation<br\/>suitable for representing these phenomena in each language are<br\/>constructed from data collected in the laboratory, with results tested<br\/>on L1 and L2 subjects. The models are tested in an interactive<br\/>tutoring system which takes an adaptive, self-paced approach to<br\/>prosody tutoring. This system modifies training and testing examples<br\/>automatically by imcremental enhancement of distinctive prosodic<br\/>features in response to student performance. The success of the<br\/>system is evaluated via longitudinal studies of L2 students of both<br\/>languages to see whether the new techniques improve students' ability<br\/>to recognize and produce L2 prosodic variation. By providing a method<br\/>and computational support for prosody tutoring, this work will not<br\/>only enable students to attain more native-like fluency but it will<br\/>provide a model for training students in other pragmatic language<br\/>phenomena --- beyond learning the words and the syntax of a new<br\/>language.","title":"Collaborative Research: Translating Prosody in an English\/Chinese Language Tutoring System","awardID":"0534133","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[289604,"314872",289606],"PO":["565227"]},"109581":{"abstract":"As the number of elderly in need of support grows, a mitigating factor in escalating<br\/>health care costs is the proper application of technology. Indeed, part of the answer is to develop<br\/>technological innovations that allow an elder population to successfully 'age in place' with dignity and a sense of involvement with their community, involving the elderly as part of the research team. This small grant will allow planning for initial research on this topic. The research team includes expertise in<br\/>computer science (vision, robotics, human-computer interface) and social work<br\/>(gerontology) and features various partnerships with government agencies.","title":"Collaborative Research: Distributed Intelligent Systems for Adaptive Aging","awardID":"0535299","effectiveDate":"2006-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[290108,290109,290110],"PO":["371077"]},"109482":{"abstract":"IIS-0534761<br\/>Roger Zimmermann <rzimmerm@imsc.usc.edu><br\/>University of Southern California<br\/><br\/>HYDRA - High Performance Data Recording Architecture for Streaming Media<br\/><br\/>Presently, an abundance of digital streaming media such as audio and video have become a pervasive and integral part of many applications. The goals of this research project are to study, design and implement a data stream recorder that addresses the challenges inherent in a broad class of innovative applications that acquire, store, manipulate and disseminate digital continuous media (CM) streams in real-time and on a large scale. To this end the research focuses on a unified paradigm that integrates multi-stream recording, retrieval and control in a synergistic manner to provide well-defined services for all media, cognizant of their characteristics such as bandwidth requirements, resolution and modality. The topics of study include novel shared buffer management techniques, statistical admission control algorithms based on a comprehensive random variable model to support both reading and writing of multiple variable bitrate media streams and multi-threshold flow control protocols enabling smooth stream acquisition and playback. Additionally, comprehensive query support is investigated through a declarative language that facilitates the specification of both temporal and semantic relationships in media streams.<br\/><br\/>The resulting capabilities have tremendous appeal and are expected to have a significant practical impact on a broad range of applications that make use of multimedia sensors, from industrial monitoring - such as intelligent traffic management - to homeland security and entertainment applications. An integral part of the project is the evaluation of the stream recorder design in the domains of information comprehension and immersive environments. The prototype implementation and experimental research of this project will be used as a teaching tool for courses covering multimedia and server technology and will be disseminated via the project Web site at http:\/\/dmrl.usc.edu\/hydra.html.","title":"HYDRA- High Performance Data Recording Architecture for Streaming Media","awardID":"0534761","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["550740",289850],"PO":["469867"]},"109493":{"abstract":"Proposal 0534809<br\/>\"Automating Commonsense reasoning for Elementary Physical Science\"<br\/>PI: Ernest S. Davis<br\/>New York University<br\/><br\/>This goal of this project is to develop a symbolic knowledge base that integrates commonsense understanding of solids, liquids, and gasses with high-school level physics. The knowledge base is intended to support simple reasoning--projection, planning, and design--about physical systems such as barometers, pistons, beakers, pipes, valves, pumps, boxes, and doors. In addition to commonsensical and textbook physics knowledge, the knowledge base will incorporate a theory of action, a representation of partial spatial information, and multiple levels of abstraction. In the near future, the broader impact of this project includes training doctoral students and writing a semi-popular book discussing how commonsense knowledge interacts with mathematical calculations. In the long run, this research could substantially contribute to a large-scale knowledge base of scientific knowledge; autonomous robotics in open environments; automated design for physical tools; automated tutoring systems for elementary science; and cognitive theories of how the understanding of formal science is grounded in ordinary experience of the physical world.","title":"Automating Commonsense Reasoning for Elementary Physical Science","awardID":"0534809","effectiveDate":"2006-02-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[289878],"PO":["491702"]},"109461":{"abstract":"IIS-0534611<br\/>Sharma Chakravarthy <sharma@cse.uta.edu><br\/>The University of Texas at Arlington<br\/><br\/>MavEStream: Synergistic Integration of Stream and Event Processing<br\/><br\/>The goal of this research project is to facilitate a synergistic integration of stream processing with event processing to meet the needs of new class of applications (e.g., intelligent home monitoring, accident monitoring on highways). The concept of window in stream processing is generalized and enhanced to a semantic window that can be applied to both streams and events. Quality of service (QoS) requirements is addressed in the context of event processing (using scheduling and load shedding strategies) to obtain a seamless end-to-end system. Current time-based semantics of event operators is extended to include attribute-based semantics to increase the expressiveness of event operators. Optimization of event operators in the presence of attribute-based semantics is addressed as well. A proof-of-principle system to incorporate the results of this research is implemented. Extensive performance and scalability experiments are conducted using data from linear road benchmark and intelligent home monitoring (e.g., MavHome) to evaluate the effectiveness of the algorithms and the implementation of the system. The results of this research will have far reaching effects on sensor as well as pervasive computing applications such as environmental monitoring, RFID- and GIS-based tracking and monitoring systems. They will be integrated into graduate and undergraduate courses taught at UTA, and will be disseminated through papers and reports and via the project Web site (http:\/\/itlab.uta.edu\/sharma\/projects\/mavestream\/index.htm).","title":"MavEstream: Synergistic Integration of Stream and Event Pocessing","awardID":"0534611","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["553596"],"PO":["469867"]},"109483":{"abstract":"IIS-0534762<br\/>Lois M. Delcambre lmd@cs.pdx.edu<br\/>David Maier (Co-Principal Investigator)<br\/>Portland State University<br\/><br\/>Adapting Information using Superimposed Models and Structures<br\/><br\/>The Overcast (Overlaid Concepts and Structures) project deals with superimposed information: information - placed over base sources - that contains marks that reference useful fragments of base information. Advantages of marking over \"copy and paste\" include retaining context of marked fragments, using applications associated with the base information to interpret them, and retaining the connection among multiple uses of a base information element. Overcast widens the use of superimposed information by (1) enriching base information with superimposed models and behaviors, (2) making marks transferable to other representations of base content, (3) developing rich transformation capabilities over assemblages of superimposed and base information, (4) broadening the situations where superimposed information can be used, and (5) extending architectural capabilities and deployment options.<br\/><br\/>Experiments are conducted in collaboration with the project's partners to evaluate the usability of the superimposed tools in supporting a variety of applications: education in a digital library context, natural resource management (USDA Forest Service), research (environmental science faculty at OGI\/OHSU), and clinical medicine (OHSU; the Danish Healthcare Ministry). Broader impacts include involvement of PhD, MS and high-school students; integration of results in existing curriculum; strong involvement of women in the project; use of developed technology in education using digital libraries; and helping computer users perform information tasks more effectively, not just more efficiently. The project information is available at http:\/\/www.cs.pdx.edu\/datalab\/overcast.","title":"Adapting Information using Superimposed Models and Structures","awardID":"0534762","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["483300","533018"],"PO":["469867"]},"109484":{"abstract":"This is a project to further develop and refine empirically grounded models and theory of the development processes, technical system configurations, work practices, organizational contexts, and their interrelationships that give rise to free\/open source software (FOSS). FOSS development represents a continually emerging and evolving approach for communities of like-minded participants to develop software systems that are intended to be shared freely, rather than offered as commercial products. The research goal is to discover and disseminate new knowledge that can guide new FOSS development efforts, as well as improve the design, use, behavior, reliability, and confidence in widely distributed FOSS systems and applications. <br\/><br\/>The research will employ field study methods to investigate, compare, and contrast the development, use and evolution of FOSS within and across projects in three communities through a three-year, longitudinal study. One community is engaged in scientific research, specifically in bioinformatics. Another community is engaged in developing and sustaining networked computer games. This community is primarily engaged in software development, not research, but has relationships with commercial enterprises. The last community is engaged in the development and deployment of large-scale FOSS applications supported by non-profit educational consortia. The choice to study these three communities stands in contrast to many prior studies that focus on the developing and sustaining the Internet\/Web infrastructure, the longest and most commonly studied source of projects that have been examined elsewhere. One of the research goals is to compare and contrast the data and findings from these three communities with those found in the prior studies of FOSS projects in the Internet\/Web infrastructure community. The focus will be on: (a) how such communities produce software; (b) how they coordinate software development work across different settings; (c) what development processes, work practices or project organizations constitute how FOSS is most effectively produced and sustained. <br\/><br\/>Researchers in a number of distinct scientific\/engineering disciplines, as well as practitioners in commercial enterprises and institutions of higher learning, are adopting FOSS approaches to software development as a basis for reducing the cost and improving the quality and diversity of infrastructural systems or application programs relevant to their domains. Thus, to the extent that research communities, development enterprises, commercial firms, and universities seek to primarily follow popular prescriptions and testimonials regarding the efficacy of FOSS, we cannot be assured that their activities will be most effective or efficient investment of their time, skill, and related resources. This research will offer a solid basis of knowledge for achieving those goals.","title":"Discovering the Processes, Practices, Community Dynamics and Principles for Developing Open Source Software Systems","awardID":"0534771","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["535599"],"PO":["564456"]},"109452":{"abstract":"Prosody is an integral part of human communication, but one that<br\/>second language (L2) learners rarely learn. Topic shifts, contrastive<br\/>focus, and even simple question\/statement distinctions, cannot be<br\/>recognized or produced in many languages without an understanding of<br\/>their prosody. However, 'translating' between the prosody of one<br\/>language and that of another is a little-studied phenomenon. This<br\/>research addresses the 'prosody translation' problem for Mandarin<br\/>Chinese and English L2 learners by identifying correspondences between<br\/>prosodic phenomena in each language that convey similar meanings. The<br\/>work is based on comparisons of L1 and L2 prosodic phenomena and the<br\/>meanings they convey. Computational models of prosodic variation<br\/>suitable for representing these phenomena in each language are<br\/>constructed from data collected in the laboratory, with results tested<br\/>on L1 and L2 subjects. The models are tested in an interactive<br\/>tutoring system which takes an adaptive, self-paced approach to<br\/>prosody tutoring. This system modifies training and testing examples<br\/>automatically by imcremental enhancement of distinctive prosodic<br\/>features in response to student performance. The success of the<br\/>system is evaluated via longitudinal studies of L2 students of both<br\/>languages to see whether the new techniques improve students' ability<br\/>to recognize and produce L2 prosodic variation. By providing a method<br\/>and computational support for prosody tutoring, this work will not<br\/>only enable students to attain more native-like fluency but it will<br\/>provide a model for training students in other pragmatic language<br\/>phenomena --- beyond learning the words and the syntax of a new<br\/>language.","title":"Collaborative Research: Translating Prosody in an English\/Chinese Language Tutoring System","awardID":"0534568","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["511614",289767],"PO":["565215"]},"111290":{"abstract":"ABSTRACT<br\/>0545488<br\/>Cardei, Mihaela <br\/>Florida Atlantic University <br\/><br\/>Wireless Sensor Networks (WSNs) are recognized as a new frontier in networking. Deployed close to the phenomenon, a WSN provides a global view of the state of the phenomenon based on local sensor measurements. Sensor nodes have size, weight, and cost restrictions that limit resource availability, such as battery, CPU, and storage resources. These constraints severely affect application capabilities and performance. <br\/><br\/>This research project seeks to establish theoretical and practical foundations for fundamental optimization problems along the following research directions: sensor coverage, topology design and control, and efficient data gathering. In sensor coverage, this research will focus on new theoretical and practical advancements for the maximum set covers problem, as well as new concepts regarding connected sensor coverage and coverage problems for heterogeneous sensor networks and tiered network architectures. <br\/><br\/>Energy-efficient topology design and control is an important operation in WSN design. This research will investigate theoretical and practical mechanisms for range assignment in WSNs that minimize power consumption. For a general architecture with multiple sinks, this project will address mechanisms for deterministic sink locations and energy-efficient anycast topology-control. In support for applications that require high reliability, the k-degree anycast topology control problem will be investigated.<br\/><br\/>An important optimization problem in the design of energy-efficient data gathering involves selecting a minimum set of data forwarding nodes. This research work will investigate this problem when each forwarding node is connected to at least one of the deployed sinks. This project will also study the problem of reliable data delivery to one of the sinks in case of failure of at most k sensor nodes. Activity scheduling is another research direction that will provide mechanisms of efficiently rotating the set of forwarding nodes in order to balance the energy consumption. This research will also investigate efficient mechanisms for cluster-based data gathering using multiple sinks.<br\/><br\/>This project is expected to have a lasting impact on the theory and practice of wireless sensor research, by providing integrated theoretical and practical foundations in sensor coverage, topology design and control, and data gathering. This research work will address these problems on two fronts. First, this project seeks to design and analyze solutions with provably good theoretic results, such as approximation algorithms and PTAS. Such results are very important and they will help understand system performance limitations through worst-case guarantees. Second, for practical implementations, this project will focus on the design of low-complexity distributed and localized algorithms. In addition, this project will provide extensive simulations for performance evaluation. <br\/><br\/>This program will integrate research and education through student participation in research projects, student mentoring, research seminar, and course development. Florida Atlantic University is a minority serving institution. This project will benefit minority students in performing research in the area of theoretical and algorithmic WSNs, offering them the opportunity to stay competitive with peers at other institutions, locally and nationally. The results from this research will be included in class materials and will be disseminated via web pages, invited talks, conference presentations, and journal publications.","title":"CAREER: Optimization Problems in Wireless Sensor Network Design and Applications","awardID":"0545488","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7934","name":"PARAL\/DISTRIBUTED ALGORITHMS"}}],"PIcoPI":[294774],"PO":["565251"]},"115383":{"abstract":"This award supports the participation of doctoral students from U.S. universities in the Doctoral Consortium of the 16th International Conference on Automated Planning and Scheduling (ICAPS) to be held June 6-10, 2006, Ambleside, England. ICAPS is the premier conference for research in artificial intelligence planning and scheduling. This Doctoral Consortium will provide participants with the opportunity to interact with established researchers as well as fellow doctoral students. The overall goals of the ICAPS Doctoral Consortium include providing participants with valuable feedback and exposure to additional perspectives on their work at a critical time in their doctoral research projects as well as providing helpful career advice at a critical time in their professional development. Participants will receive feedback and advice from mentors and fellow participants through activities and discussions at the Consortium as well as through a Poster Session of the main ICAPS conference. Participants in the Doctoral Consortium will be invited to publish their research abstracts on the conference web site and in a stand-alone proceedings that will be distributed to all conference attendees","title":"Doctoral Consortium Support for International Conference on Automated Planning and Scheduling","awardID":"0608564","effectiveDate":"2006-02-01","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[305453,"563502"],"PO":["387198"]},"117473":{"abstract":"This small grant for exploratory research aims to improve the performance of a bottom-up chunking algorithm by incorporating top-down knowledge. The approach is to evaluate chunks in terms of the operations on chunks - at the level of chunks - that the new chunks make possible. The research is expected to provide an algorithmic foundation for chunking, which is ubiquitous and important in cognition. The impact of this work should be felt broadly in machine learning.","title":"Developmental Chunking","awardID":"0618216","effectiveDate":"2006-02-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["524130"],"PO":["565136"]},"109872":{"abstract":"Computer-based learning environments continue to grow in complexity as technology for education keeps improving. One of their functions is behind-the-scenes assessment -- determining how well the student is doing and identifying any learning difficulties the student is facing. A key issue is how to make parts of that assessment activity visible to the student. Good feedback can enhance the efficiency of learning. However, full and immediate disclosure of assessment activity is not always consistent with pedagogy. This project is developing and studying a variety of policies and methods to make learning environment more transparent. Full transparency is not achieved simply by revealing all the system's assessment data; the data and processes must be presented in understandable forms. The primary target student population for the project's experiments consists of University of Washington freshmen and sophomores who enroll in a course entitled \"Pixels, Numbers and Programs.\" The research seeks a clearer understanding of the potential costs and benefits of revealing different kinds and amounts of assessment information to students as they work in computer-based learning environments. Most online learning environments that perform educational assessment have been rigid, not only in enforcing a linear interaction style (e.g., sequence of questions posed by the system, with little opportunity for student initiative), but also in terms of assumptions about student disposition to trust the software and engage willingly in the session. Transparency has the potential to engender trust by a wider set of students and thus broaden the range of students who can benefit from online learning environments. The project works toward an improved understanding of openness of assessment in computerbased learning environments. This, in turn, can assist designers of future systems in dealing with this increasingly important issue.","title":"Transparent Assessment in Online Learning: Making the User a Partner in Complex Inference Processes","awardID":"0537322","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1707","name":"ADVANCED LEARNING TECHNOLOGIES"}}],"PIcoPI":["308498","308499"],"PO":["564318"]},"108453":{"abstract":"The objective of this research is to identify the market formats, agent designs, and composite information service specifications that, in realistic information technology (IT) environments, best promote economic prosperity. The global economy is in the midst of large-scale transformation driven by innovations in IT and the explosive growth of the Internet. IT is reshaping markets and consumer and enterprise behavior, while at the same time business realities determine which IT innovations are viable. Little is yet known about the economic and social impacts of this transformation. Significant new research is needed on various types of IT-enhanced economic environments, including: markets with asynchronous participation; markets with automated agents; new market formats enabled by IT; and new composite information services. Automated trading agents play an increasing role in the IT-enabled markets, and their interaction with human traders demands close scrutiny.<br\/><br\/>The methods to be employed in this project include the development of new theoretical models and the testing and refinement of the models in controlled experiments with human subjects. To date, the most detailed scientific knowledge of trader behavior and market performance is confined to classic market formats and to very simple goods. This research will expand that classical knowledge, test its robustness, and open new lines of inquiry by considering a broader range of market formats (one-sided auctions, two-sided markets and new hybrids), a broader range of goods (including new composite IT service products), and a broader range of behavior (including human interaction with automated agents).<br\/><br\/>The scientific knowledge generated by the research will disseminate swiftly into the community of e-commerce practitioners, and will help provide a sounder basis for integrating IT into the world economy. The platforms for running the various market formats and automated agents will be incorporated into the National Science Digital Library, enhancing infrastructure for teaching and research. Teaching, training and learning will be promoted directly for numerous graduate students who serve as research assistants and programmers; some undergraduates will also help with the programming and hundreds will serve as laboratory subjects who become experienced in market trading and controlling market agents. Given the ethnicity of students at the campuses, and given the history of employment at the labs, a large share of the educational benefits are likely to accrue to women and members of minority groups.","title":"Collaborative Research: IT-Enhanced Market Design and Experiments","awardID":"0527770","effectiveDate":"2006-02-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7318","name":"HSD - AGENTS OF CHANGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["537808","563405"],"PO":["564456"]},"109466":{"abstract":"IIS-0534628 <br\/>Juliana Freire <juliana@cs.utah.edu><br\/>University of Utah<br\/><br\/>XML Data Management: Taking Order and Updates into Account<br\/><br\/>The goal of this project is to develop techniques and scalable infrastructure that cater to the diverse needs of emerging applications, which use XML to represent their data. This project addresses two key problems in XML data management. First, it develops a framework for automatically deriving information-preserving XML-to-relational mappings, which ensures document integrity is correctly (and efficiently) maintained as the mapped data is updated. Second, it develops new statistical summary structures that concisely capture both structural and order information in a document, and algorithms that use these structures to accurately estimate the cardinality of XML queries including order-sensitive queries. To ensure this framework is scalable and able to support large volumes of dynamic data, techniques are also developed that incrementally maintain precise statistical summaries in the presence of updates to the base data.<br\/><br\/>The research results of this project will have the potential to influence commercial database systems as they strive to provide better support for XML data. Through our interdisciplinary collaborations, in particular in the area of scientific data management, this project will have immediate impact in helping improve the scientific discovery process. The project will be instrumental in establishing Information Management as a key research and education area in the School of Computing at the University of Utah. The involvement of graduate and undergraduate students in the project will provide mentoring opportunities. The PI is committed to recruiting minority students. The results of this project will be disseminated as research papers and as freely available tools at the project website: http:\/\/www.cs.utah.edu\/~juliana\/projects\/NSF-IIS-0534628\/","title":"XML Data Management: Taking Order and Updates into Account","awardID":"0534628","effectiveDate":"2006-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["521992"],"PO":["563727"]},"111490":{"abstract":"Wireless sensor networks (WSNs) offer the promise of revolutionizing the way scientists observe the physical environment. Unfortunately, experience from the networks deployed to date has shown that planning and managing a sensor deployment is a great challenge requiring expertise in multiple areas of Computer Science. However, future sensor networks must be implemented by researchers in other disciplines. For this to happen, the process of deploying and managing sensor networks should be radically simpler.<br\/><br\/>In this project we develop a set of network design tools. These tools use site-specific signal propagation models coupled with detailed physical layer radio models to calculate packet loss rates. Based on these estimates, the tools determine the location of additional relay points and gateways necessary to create a reliable network around the required measurement locations. Furthermore, we develop a network self-monitoring tool that correlates measurements taken by individual sensor nodes to construct a global view of the operational network. Information from the deployment is fed back to the network design tool. Through this coupling, incremental adjustments to the network layout are made until the network reaches the desired level of performance.<br\/><br\/>Using the tools developed by this project, sensor networks will become predictable and robust instruments, empowering scientists to observe phenomena that were previously out of reach. We are working with scientists at Johns Hopkins University as well as high school teachers to bring the results of this project to the broader academic and educational community.","title":"CAREER: Towards turnkey sensor networks for the Sciences: Software tools for designing and managing networks of sensors","awardID":"0546648","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["530045"],"PO":["557315"]},"111391":{"abstract":"Intellectual Merit<br\/><br\/>This proposal presents a career development plan for integrating research and education on the topic of hardware system development for trapped ion quantum information processors<br\/>(QIPs). Toward this goal, critical research activities for system-level design and enabling<br\/>technology development are proposed. System design and optimization bounded by performance<br\/>requirements and available technology should be an on-going process in this effort. It is anticipated that a MOEM system that delivers the large number of precisely tailored laser beams required for qubit manipulation will be a critical missing technology component. Experimental development of functionally integrated MOEMS technology optimized for this purpose is proposed as the main activity of the proposal.<br\/>Broader Impacts. <br\/><br\/>The technology platform for integrated MOEMS will find a variety of exciting<br\/>applications in other areas of science and engineering research, including integrated atomic clocks, inertial sensors, optical communication elements and integrated optical sensors. A network of researchers with diverse expertise established will be valuable source of future innovation and research initiatives.<br\/><br\/>The educational component is an attempt to introduce a new paradigm for engineering education at all levels aimed at stimulating creativity, and ultimately will enhance the career prospects of the engineering students. The undergraduate curriculum development effort will concentrate on developing project-based laboratory experience at early stages of engineering education. Fundamental topics, like quantum information, will motivate the students while the projects will be managed to expose students to non-technical topics like teamwork and leadership on top of technical contents. The graduate courses will emphasize engineering principles for integrating cutting-edge technology into a practical system design.<br\/><br\/>The PI and the institution (Duke University) has successful track record of educating female and<br\/>minority engineers, and will continue to expand research and educational opportunities for them.<br\/><br\/>These activities will stimulate collaboration between physicists and engineers on this front: historically, such collaboration played a critical role in every juncture of successful application of new physical discoveries. Forming a collaborative effort among experts with various technology components to realize a QIP in the long run will also be an important element critical to the success of the program.","title":"CAREER: Ion-Trap \"Integrated Circuit\" Technology for Quantum Information Processor","awardID":"0546068","effectiveDate":"2006-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7947","name":"NANOCOMPUTING"}}],"PIcoPI":["435639"],"PO":["565157"]},"115450":{"abstract":"The workshop took place on January 13-20, 2006 at the McGill University Bellairs Research Institute in Barbados. A series of workshops has been organized by faculty from McGill and from other universities. This year the workshop is interdisciplinary, with half of the participants from Biology, Chemistry, Biophysics and Mechanical Engineering. Activities involve formulating mathematical and algorithmic problems derived from applied fields. Current research interest is in geometric problems arising from biology: protein folding, NMR structure determination and protein flexibility modeling. The goal is to highlight open problems and ongoing challenges to the field, with the intention that formalized statements of open problems will help form a catalyst for new investigations and innovative solutions, while motivating new researchers, particularly students, to engage in attacking some of the interdisciplinary research questions that rely on discrete and computational geometry. The results of the workshop will be widely disseminated by means of the internet, with talk abstracts and a detailed list of open problems raised.","title":"Workshop on \"Dynamics Under Constrants\"","awardID":"0608831","effectiveDate":"2006-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550373"],"PO":["321058"]},"116156":{"abstract":"Background<br\/><br\/>Internet services have a characteristic of bursty traffic. To deal with the burstiness and protect valuable<br\/>customers from traffic surge, a stress-resilient server must be able to control the quality of different classes of requests in a coordinated way so as to guarantee a fair and graceful performance degradation in stress conditions.<br\/>Such quality assurance technologies can also protect the server from distributed denial-of-service<br\/>attacks by downgrading the service quality of the requests with suspicious intentions. The goal of this project<br\/>is to develop an application-level multi-resource management mechanism and a coordinated space\/time request scheduling strategy for stress-resilience and high service availability on streaming servers.<br\/><br\/>Intellectual Merit<br\/>The proposed resource management system features three key innovations. First is a harmonic network-I\/O bandwidth allocation scheme. The proposed scheme not only maximizes the overall bandwidth utilization, but also provides self-management and performance isolation features to guarantee quality spacings in terms of stream bitrate between different request classes and to enhance the service availability. Second is a novel request scheduling algorithm with self-tuning feedback control that ensures fair and graceful performance degradation of requests with respect to their startup latency. Self-tuning feedback control deals with the impact of Internet traffic burstiness and provides consistent quality assurance in both long and short timescales. The third novelty of this project lies in a coordinated multi-resource management strategy that determines when and how to schedule stream requests so as to meet the quality requirements in terms of both stream bitrate and startup latency and meanwhile maximizing the streaming service availability.<br\/><br\/>Broader Impact<br\/>Todays Internet services are often vulnerable to traffic surge. This research will advance discovery and understanding of the quality assurance problem in stress conditions. By fusing the proposed stress-resilient technology into streaming services, this research will ultimately enhance the service availability and survivability to stress and DDoS attacks. In addition, this project has an integral education component. Research-based materials about Internet services will be instilled into the undergraduate and graduate distributed computing curriculum. Under-represented students will also be innovated to participate<br\/>in this integrated research and education project.","title":"SGER: Context-Aware Multi-Resource Management for High Service Availability on Internet Servers","awardID":"0611750","effectiveDate":"2006-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["451038"],"PO":["565272"]},"109435":{"abstract":"IIS-0534404<br\/>Jayavel Shanmugasundaram <jai@cs.cornell.edu><br\/>Cornell University<br\/><br\/>Hilda: A High-Level Language for Data Driven Web Applications<br\/><br\/>This project develops technology to support data-driven Web applications. It is based on Hilda, a new high-level language that addresses some significant shortcomings of current Web application technologies. Hilda provides a uniform data model for the presentation, application and data layers; clear separation of application and presentation logic; support for structured programming driven by the logical structure of the application; and support for application-level conflict resolution.<br\/><br\/>The project produces a Hilda compiler with advanced optimizations, client-server code partitioning, and data caching. It also provides tools to support application integration, testing and schema migration. Using these tools, the project develops several reference Hilda applications including CMS, a new course-management system that will replace a similar conventionally-built system currently being used by several thousand students.<br\/><br\/>Among the broader impacts of this project will be open-source release of the optimizing Hilda compiler and tools, together with a number of substantial applications implemented in Hilda. One of these applications will be CMS; another will be an application to make data collected by the Arecibo radio telescope (http:\/\/www.naic.edu) accessible to members of Physics research community and the general public. The development of these Hilda applications will be done primarily by undergraduates, and by high-school students as part of the Ithaca Learning Web program. Project publications, software and results will be made available at http:\/\/www.cs.cornell.edu\/database\/hilda.","title":"Hilda: A High-Level Language for Data-Driven Web Applications","awardID":"0534404","effectiveDate":"2006-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["345714","345714","289708",289708],"PO":["565136"]},"119478":{"abstract":"Abstract<br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: COLLABORATIVE RESEARCH: Automated facial expression measurement: toolbox and database <br\/><br\/>Lead Proposal: CNS 0454233<br\/>PI: Marian S. Bartlett<br\/>Institution: University of California-San Diego<br\/><br\/>Proposal CNS 0454183<br\/>PI: Mark Frank<br\/>Institution: Rutgers University New Brunswick<br\/><br\/><br\/>This community resource project will package and release to the CISE research community a collection of software tools for vision based perceptual primitives for human-computer interaction studies and a database of facial expressions that has been coded by facial expression experts. The tools enable recognition of basic emotions and facial actions from the Facial Action Coding Systems (FACS). The tools and database have been developed with experts from machine learning and facial expression fields. Broader impacts of this community resource include enabling research and education in this area for a broader community in the U.S., use of automated facial expression in education and machine tutoring applications, enabling advances in computer vision, enabling advances in behavioral science and medicine related to emotion, cognition, and human-machine communication, and applications in homeland security.","title":"CRI:COLLABORATIVE RESEARCH: Automated facial expression measurement toolbox and database","awardID":"0627822","effectiveDate":"2006-02-10","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["349177"],"PO":["564316"]},"109457":{"abstract":"IIS-0534592<br\/>Benjamin C. Pierce <bcpierce@cis.upenn.edu><br\/>University of Pennsylvania<br\/><br\/>Linguistic Foundations for XML View Update<br\/><br\/>This project explores a novel approach to the classical VIEW UPDATE PROBLEM in the context of tree-structured data such as XML. The problem arises from the fact that modifications to a database view may not correspond uniquely to modifications on the underlying database; a means of determining an \"update policy\" that guides how view updates are reflected in the database is needed. The approach is to define and implement a BI-DIRECTIONAL query language, in which every expression can be read both (from left to right) as a view definition and (from right to left) as an update policy.<br\/><br\/>The project's main concrete deliverable---the Harmony data synchronization framework--will be distributed freely under an open-source license and integrated with the popular Unison file synchronizer, currently a key component of the computing and collaboration infrastructure for tens of thousands of academic researchers and other users. A high quality implementation of the bi-directional tree transformation language will be distributed separately for use by others in their own tools, which might include group calendaring systems, XML data integration tools, and collaborative editors for structured documents. Project funds will support the training of one PhD student and several undergraduate research interns. Both the software tools and the technical papers describing them will be disseminated through the project's web site: http:\/\/www.cis.upenn.edu\/~harmony.","title":"Linguistic Foundations For Xml View Update","awardID":"0534592","effectiveDate":"2006-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7485","name":"DATA MANAGEMENT SYSTEMS"}}],"PIcoPI":["563479"],"PO":["563751"]},"111382":{"abstract":"Rahul Telang<br\/>CMU<br\/>0546009<br\/><br\/> Abstract<br\/>Securing cyberspace and national infrastructure has become a key priority for policy makers. Recognizing the fact that the software vendors are key to building and developing secure products, this CAREER project examines and quantifies vendors incentives to provide secure products. The PI is analyzing three major vendor incentives incentives to provide timely and reliable patches; cost of insecure products to vendors and hence their incentives to provide secure software and, incentives to adopt voluntary security assurance standards. The project is also exploring how market structure, the nature of competition and policy interventions affect these incentives. Vendors incentives to provide reliable patches provide key insights into how disclosure policies work and help industry and lawmakers develop optimal policies regarding vulnerability disclosure. By quantifying the cost of insecure products and value of security certification, this project provides insights to both vendors and policymakers in understanding whether voluntary certification works and how to speed up its diffusion. The PI is developing novel data sets, new empirical methodologies, and modeling techniques to provide actionable recommendations. The project will also have direct impact on the education of social science, economics and engineering students through course development at CMU. The PI has developed the course on Information Security and Risk Management and developing a new course on Economics of Information Security. This CAREER project is providing material for teaching modules, case studies and useful statistical exercises and illustrations on various policy and managerial aspects of Information security.","title":"CAREER: Securing Cyberspace: The Role of Markets and Policy","awardID":"0546009","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[294981],"PO":["497499"]},"117367":{"abstract":"This is funding to support a consortium (workshop) of approximately 10 promising doctoral students from the United States and abroad, along with about 5 distinguished research faculty and one individual who recently completed his\/her PhD studies. The event will take place on Sunday, October 22, immediately preceding and in conjunction with the 2006 ACM SIGACCESS ASSETS Conference, to be held Monday through Wednesday, October 23-25 in Portland, Oregon, and sponsored by the ACM Special Interest Group on Computers and Accessibility. The ASSETS conference is the premier forum for presenting research results and innovations in software and technology designed to address the special needs of people with disabilities of all kinds. Researchers and developers from both academia and industry around the world will meet to exchange ideas and present reports on the latest work relating to speech, motor, hearing, and vision impairments, cognitive limitations, emotional and learning disabilities, and aging. A key component of building this community is through its youth. The ASSETS'06 doctoral consortium will provide an opportunity for graduate students from diverse backgrounds (computing, engineering, psychology, architecture, etc) to come together and explore their research interests in an interdisciplinary workshop, under the guidance of a panel of distinguished experts in the field, so that they can see the broader spectrum of research and development approaches to assistive technologies and universal usability, and also experience the community in which they can pursue their endeavors. Student participants will make formal presentations of their work during the consortium, and will receive constructive feedback from a faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will expose these promising young researchers to a larger community. Evaluation of the consortium will be conducted, and the results made available to the organizers of future such events. A session has been set aside during the main conference to allow doctoral consortium participants to present to the entire conference, and one student from the doctoral consortium will be selected to deliver the closing plenary presentation.<br\/><br\/>Broader Impacts: The doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Consortium on IT accessibility","awardID":"0617795","effectiveDate":"2006-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["466602"],"PO":["565227"]},"112780":{"abstract":"Background<br\/><br\/>The Summer Undergraduate Research Fellowship in Information Technology (SURF-IT) program at the Santa Cruz campus of the University of California (UCSC) provides an intensive and personalized summer research program for 12 students with an emphasis on undergraduates from underrepresented groups and disadvantaged backgrounds.<br\/><br\/>The primary part of SURF-IT is a 9-week summer program that includes research directly supervised by a UCSC faculty member in computer engineering, computer science, or electrical engineering. Students will also have weekly meetings on graduate school preparation, research ethics, and research presentation, as well as field trips to local neighboring Silicon Valley research laboratories, and a number of social activities. <br\/><br\/>The summer program concludes with a research poster presentation by the SURF-IT students. The PIs goal is to promote diversity in computer science and engineering by assisting motivated students in obtaining graduate degrees to then become positive role models for future generations of college students throughout the nation. The PIs intend to maintain continuing contact with SURF-IT alumni to assist them in applying to and succeeding in graduate school, as well as in their eventual careers.<br\/><br\/>Intellectual Merit <br\/><br\/>Students join a variety of funded research projects in information technology at the UCSC Baskin School of Engineering. The specific intellectual merit of each project will vary, however all students will learn to apply their traditional academic training to open-ended research problems at the forefront of information technology.<br\/><br\/>Broader Impact <br\/><br\/>The impact over time will be greater numbers of individuals from groups underrepresented in information technology, such as women and racial\/ethnic minorities, with postgraduate degrees. These individuals will then be able to take leadership positions in academia and industry, providing positive role models for a next generation. The combination of this program and other REU sites will ensure broadened participation in computer science and engineering, as well as an increased domestic pool of highly trained information technologists.","title":"REU Site: Information Technology at the UCSC Baskin School of Engineering","awardID":"0552688","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["505531","395034"],"PO":["562944"]},"111482":{"abstract":"Communication networks are becoming irreplaceable components of any large engineering system. The performance of such networks is determined by the algorithms implemented within them. This proposal aims at developing novel design and analysis methods for implementable network algorithms. Designing high-performance implementable network algorithms is an extremely challenging task. For example, a typical network algorithm operating in the core of the Internet needs to make complicated decisions roughly every 50ns while utilizing limited resources. Similarly, in the context of wireless networks, algorithms have access to limited computation and energy resources for performing desired tasks. Consequently, only the simplest algorithms are implementable in such networks. But a simple algorithm may perform rather poorly if it is not well-designed. <br\/><br\/>Addressing this tension between simplicity and high-performance is the focal point of this proposal. The algorithm designer experiences this tension in the context of scheduling and routing algorithms, which are critical for the operation of Internet and wireless mesh networks. The established theoretical solutions for these tasks require solving complicated optimization problems. The known algorithmic solutions to these optimization problems are un-implementable. Hence ad-hoc solutions are implemented in the current networks which are poor in performance. For example, in many cases current solutions utilize no more than 30% of the network capacity ! I intend to bridge the gap between theory and practice by designing implementable good approximations of appropriate optimization problems using two simple yet powerful ideas: (1) Belief propagation (BP) and (2) Randomization. In operational terms, BP is an iterative, distributed, simple message-passing style heuristic for optimization problems. BP is based on deep insights of Statistical Physics and Artificial Intelligence. Algorithms based on BP have been very successful in solving notoriously hard problems in areas such as Turbo Decoding, Image Reconstruction, and Constraint Satisfiability. The method of randomization has been extremely successful in simplifying implementation of complex algorithms. The idea behind randomization is very simple: base decision on a few randomly chosen samples instead of the whole state. The clever choice of random samples result in excellent performance wherein the state of system has a lot of redundant information. Such is the case in many networking application, which makes randomization well-suited. The design approach based on BP and randomization for scheduling and routing may lead to more than 90% utilization of network capacity. <br\/><br\/>An important counterpart of algorithm design is the analysis method that is useful to quantify the performance of algorithm. The so-called \"curse of dimensionality\" of large networks makes performance analysis of algorithms mathematically intractable. The principal investigator (PI) plans to develop analysis method by reducing the \"effective dimension of algorithm\" and thus making it tractable for analysis using effective framework of heavy traffic theory from stochastic networks. <br\/><br\/>Intellectual merit. This proposal will primarily advance the understanding of design and analysis of implementable network algorithms. Further, it will advance the understanding of BP, which is one of the central (and rather mysterious) topics of current research in AI and Statistical Physics community. The heavy traffic based analysis method will be helpful in advancing the application and development of theory in stochastic networks. <br\/><br\/>Broad impact. The scheduling and routing algorithms that will be developed as a part of the proposed research may help in designing high-performance LAN switches and efficient wireless mesh network architecture. This may lead to a cost-effective architectural solution for broad-band access networks. The proposed research will be disseminated to the community via publications in journals, conferences and workshops. Further, the PI plans to interact and collaborate closely with networking industry. In particular, Cisco systems Inc. is supportive of this research.","title":"CAREER: Implementable Network Algorithms via Randomization, Belief Propagation and Heavy Traffic","awardID":"0546590","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["532110"],"PO":["564993"]},"115233":{"abstract":"Across all branches of engineering, computational methods share the need for reliable results. Reliability can be achieved only if all sources of errors, approximations, and uncertainty are accounted for. This workshop, organized by the Center for Reliable Engineering Computing (REC) at Georgia Tech, will bring participants from various engineering fields as well as mathematics and computer science to share methods for ensuring reliability of engineering models. The workshop will be held in Savannah, Georgia in February 1006. The focus will be on research methods to integrate the treatment of modeling errors and uncertainty in engineering computations. Reliable engineering computing, as we understand it, requires that analysis and design procedures accommodate several sources of uncertainty. The objective of the workshop is to promote cross-disciplinary research in the area of treatment of modeling errors and parameter uncertainty and their mitigation in engineering software. Such a common forum will provide a foundation for continuing cross-disciplinary advisements in reliable engineering computations. Presenting reliability of computations as a part of an engineering analysis\/design will change the way practicing engineers and engineering students design by continuously reinforcing the importance of approximations, uncertainty and reliability.<br\/><br\/>Broader Impact: In addition to the intellectual contribution cited above, the results of this workshop will have a broader impact on society. Reliable and dependable analysis and design are crucial for the health and safety of the U.S. population. More reliable structural systems will contribute into the reduction of life threatening failures and disasters. The ability to construct robust and dependable systems will aid the continuing economic development of the United States. The results of this workshop will contribute to the enhancement of the infrastructure for research and education in the US.","title":"Workshop on Modeling Errors and Uncertainty in Engineering Computations; Savannah, Georgia; February 22-24, 2006","awardID":"0607903","effectiveDate":"2006-02-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1464","name":"ENGINEERING DESIGN AND INNOVAT"}}],"PIcoPI":["365990","365991"],"PO":["325041"]},"109514":{"abstract":"This one-year planning grant will explore the following topic for feasibility.<br\/><br\/>Intellectual Merit<br\/> American Indian tribal governments provide a wide range of services to their tribal members, and providing these services requires funding. Unfortunately, tribes have historically been limited in their ability to access capital, a major barrier to economic development. Even as some tribal economies have expanded, tribal access to the capital markets remains impaired due to adverse treatment of tribal debt as compared to municipal debt issued by state and local governments. In order to counteract factors that constrain tribes from tapping into the capital markets effectively, the academic and policy-making communities - and ultimately tribes themselves - need a thorough understanding of modern tribal finance contexts. Academics studying the capital markets related to non-tribal governmental entities have access to substantial information systems, but no such system exists for tribal governments. Not only are tribes at an informational disadvantage, but credit insurers and rating agencies also cannot form a complete picture of the tribal finance market. Thus, tribes must pay a significant penalty on tribal financings because of the uncertainty due to the lack of data. Further, the adverse impact of the differential treatment of tribal debt as compared to other forms of municipal debt has never been empirically quantified.<br\/><br\/>This cross-disciplinary project will examine questions related to technological empowerment that have economic, sociological, and legal implications. Original data about tribal interaction with the capital markets will be collected and used to develop an analytical information system, providng the empirical foundations for a comprehensive understanding of tribal interaction with the capital markets, specifically identifying those factors that are critical to the success or failure of tribes. <br\/><br\/>Broader Impact. <br\/>In addition to its relevance for economic development in Indian Country, development<br\/>of the tribal finance system will also be an exercise in intergovernmental information sharing. More than 550 federally recognized tribes exist; yet almost no communication between tribes regarding capital market access has taken place. This project will contribute to the emerging economic area of incentive-centered design by designing a system to encourage tribes to disclose previously non-public information about privately-placed financial transactions, as the value to them of doing so increases with the availability of data from multiple tribes - a network effect.","title":"The Tribal Finance Information Clearinghouse","awardID":"0534905","effectiveDate":"2006-02-01","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["337849","400168"],"PO":["371077"]},"110570":{"abstract":"ABSTRACT<br\/>0541163<br\/>Robyn Lutz<br\/>Iowa State University<br\/><br\/>Safety Analysis of Evolving Product Lines<br\/><br\/>Change can jeopardize the safety of a software system. When change occurs in a product line, the safety consequences can be even greater because multiple systems are involved. Examples of safety-critical product lines include cardiac pacemakers, communication satellites, airplane cockpit displays, and assistive robots. Product lines are currently built knowing that they will need to evolve to incorporate new features and updated software but not knowing how to ensure that they will still operate safely when such changes occur. This research: (1) investigates types of evolution that are both common and problematic in safety-critical product lines, (2) extends safety-analysis techniques to efficiently update the product-line safety analysis as the software evolves, (3) develops automated tool support, and (4) applies and empirically evaluates the results. The significance of this work is that it improves understanding of how safety-critical product lines evolve and develops analysis techniques, tools, and strategies to reduce the cost of safety analysis and enhance the safety of evolving product lines. Educational activities to develop teaching materials and engage undergraduates in research, as well as involvement with industrial communities, broaden the impact of the research.","title":"Safety Analysis of Evolving Product Lines","awardID":"0541163","effectiveDate":"2006-02-01","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["531356"],"PO":["564388"]},"111461":{"abstract":"The proposed project intends to explore the notion of overlay transmission as an alternative design criterion in wireless networks involving multiple transceiver pairs, i.e., the classical interference channels (IFC). Overlay transmission refers to the communication mode where the signals from multiple users superimpose in time and frequency. It is envisioned that, facilitated by the theory and technologies to be developed under this effort, more efficient spectrum utilization can be achieved by allowing concurrent transmissions without compromising each users Quality of Service.<br\/>The intellectual merit of the project lies in its pursuit of the novel MIMO (multiple-input multiple-output) overlay transmission concept in wireless network design. This differs with existing overlay transmission, such as the code division multiple access systems, whose interference resistance comes at the cost of bandwidth expansion. Instead, we demonstrate that the interplay between spatial diversity and multiuser diversity in MIMO IFC enables overlay transmission to significantly outperform orthogonal transmission. This is also in sharp contrast to the single-input single-output system where overlay transmission has no tangible advantage in spectral efficiency over orthogonal transmission for IFC.<br\/>The proposed MIMO overlay transmission has broad applications in wireless networks. For cellular networks, prudent use of MIMO overlay transmission will enable novel frequency reuse schemes to<br\/>improve channel resource management. In ad hoc networks, incorporating MIMO overlay transmission<br\/>into the networking protocols will help enhance both the network and end-to-end throughputs.<br\/>MIMO overlay transmission, with its superior spectral efficiency and its potential to enable novel<br\/>networking protocols, has the promise to bring relief to the spectrum scarcity issue encountered in<br\/>todays wireless systems.<br\/>Along with the proposed research project, the PI has designed a set of education initiatives.<br\/>These include promoting active learning through innovative classroom teaching, enhancing graduate<br\/>and undergraduate curriculum through course development, and involving undergraduate students<br\/>with diverse background in this project.<br\/>The broader impacts of this project are multi-faceted. By engaging students at both graduate<br\/>and undergraduate levels in intellectually challenging activities, the students will assume a more<br\/>active role in various education activities. Encouraging and facilitating graduate students participation<br\/>in professional meetings and conferences will help instill enthusiasm in scientific research into the<br\/>students. Involving undergraduate students in carefully designed research projects will help foster<br\/>their interest in scientific activities. The curriculum development plan caters to the increasing needs<br\/>of students in the area of communication and signal processing. At the graduate level, it will provide<br\/>an important venue for many local industries and research institutions for the continuing education<br\/>of their employees. The PIs enthusiasm in developing and teaching undergraduate courses will ensure<br\/>the success of the ongoing undergraduate curriculum reform in the Department of Electrical<br\/>Engineering and Computer Science at Syracuse University.","title":"CAREER: Aspiring for Spectrum Freedom Through MIMO Overlay Transmission","awardID":"0546491","effectiveDate":"2006-02-15","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["518226"],"PO":["564924"]},"111351":{"abstract":"Epidemic phenomena in networks occur when an infectious disease, computer virus, behavior, piece of information, or innovation is disseminated in a highly decentralized and parallel way along the links of a social or computer network. Epidemic phenomena often have a strong effect on society. Diseases and computer viruses cause the loss of human lives and economic damage. Behavioral patterns, spread by imitation or coercion, can be desirable or undesirable. An innovation or piece of information can lead to improvements in quality of life, or to increased sales revenue for a company. It is thus crucial to study ways of leveraging the limited control one has over epidemics. In the case of harmful epidemics, this includes vaccinations, anti-virus software deployment, and other policy decisions. For the diffusion of innovations, effective<br\/>\"word-of-mouth marketing\" strategies (such as identifying influential individuals) must be chosen. For the dissemination of information, efficient network protocols need to be designed.<br\/><br\/>Given the increasingly detailed data available about social and computer networks, it is becoming feasible to model such epidemic phenomena accurately, and to address algorithmically the problems of minimizing or maximizing the spread of an epidemic in a network. Problems relating to the containment of epidemics lead to novel graph cut optimization problems, while maximization problems relate to graph covering. When multiple influences are competing, the problems take on a game-theoretic component, and in many cases, the models for epidemics are based on Markov Chains and random graphs. The investigator will study algorithms with provable guarantees for the problems of minimizing or maximizing the spread of epidemics.","title":"CAREER: Algorithms for Controlling Epidemic Phenomena in Networks","awardID":"0545855","effectiveDate":"2006-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[294917],"PO":["565251"]},"112693":{"abstract":"REU Site: Research Experiences in Computer Science for Students at Undergraduate Institutions<br\/><br\/>This program will encourage students enrolled at undergraduate institutions to pursue graduate study and research careers in Computer Science by involving them in a ten week, team-oriented, summer research experience. The research projects are drawn from a number of important fields of Computer Science, including pen-based computing, computer supported cooperative work, assistive technology (text navigation for the visually impaired), natural language processing (text summarization), functional programming languages, programming pedagogy, and virtual reality. <br\/><br\/>Faculty mentors will sponsor orientation activities to help students appreciate the nature of research and the value of working cooperatively. Students will be encouraged to collaborate formally and informally; this will be facilitated by having the students live in University housing. Students will present their work to other participants in the REU program, as well as externally. Finally, students will have the chance to learn about the graduate school application process in part by visiting a major research university.<br\/><br\/>The program will encourage a diverse group of undergraduates to consider attending graduate school and embarking on research careers. This addresses the important national need of attracting a diverse group of students to research-oriented science careers.","title":"REU Site: Research Experiences in Computer Science for Students at Undergraduate Institutions","awardID":"0552370","effectiveDate":"2006-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[298277,"505808"],"PO":["460643"]},"109515":{"abstract":"Proposals 0534908<br\/>\"Skewing: Making Greedy Learning Strategies Robust Against Myopia\"<br\/>PI: C. David Page<br\/>University of Wisconsin-Madison<br\/><br\/><br\/>ABSTRACT<br\/><br\/>This project studies \"skewing\", a novel machine learning approach that exploits the observation that some target functions are hard to learn only for some data distributions. Many practical machine learning algorithms, such as those for learning decision trees or Bayesian network structure, employ greedy strategies during learning, and although efficient, they have trouble learning some target functions, when presented with data having more than about a dozen variables or features; lookahead can help but is computationally expensive and prone to overfitting. Skewing is accurate when learning hard targets and it retains much of the efficiency of greedy strategies. This project addresses several research directions, including scaling to high-dimensional data, skewing for feature selection, and developing a theory of skewing. A broader impact of the project is further use of machine learning in Research Experiences for Undergraduates and in secondary school outreach. A second broader impact of the project is the development of machine learning systems that are more robust to the problem of myopia; these systems will be beneficial in a wide variety of practical domains including analysis of biological data.","title":"Skewing: Making Greedy Learning Strategies Robust Against Myopia","awardID":"0534908","effectiveDate":"2006-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["419800"],"PO":["387198"]},"109427":{"abstract":"Structure Induction for Manipulative and Interactive Tasks<br\/><br\/>This project will develop methods for inferring models, similar to those traditionally used for speech and language, for structured, repetitive, interactive manipulation tasks. Such tasks are typically composed of more elementary tasks that follow a nominal plan of action to achieve a set of desired outcomes. Examples include assembly tasks, various forms of surgery, gesture-based interfaces, maneuvering in traffic, sports, dancing or gymnastics to name a few. <br\/><br\/>The project will be carried out in the context of observing and modeling minimally invasive surgical procedures. Motion and video streams will be acquired from surgeons during simulated surgical tasks using the da Vinci surgical robot. Surgical tasks will be represented using grammars on a set of simple, elementary surgical gestures modeled using finite-state machines. Both the elementary gestures and the task-dependent grammatical constraints will be inferred directly from data. A key element of the proposed approach is to first develop accurate models from simple, low-dimensional datasets such as direct measurements of surgical motion, and then to use these models to boostrap model training to more complex, high-dimensional synchronized video of the same procedure.<br\/><br\/>The core research problems to be addressed are thus: Motion sequence modeling for elementary tasks: Develop algorithms that are able to learn finite-state machines modeling simple, context-independent elementary motion or manipulation tasks in terms of atomic gestures using a limited set of manually labeled motion data. Multi-modal models of elementary tasks: Create effective methods for augmenting elementary task models with complementary and contextual features from synchronized video data. Grammar induction: Use elementary task models to automatically label more, larger data sequences and infer high-level grammatical structures from these labelings. Model bootstrapping: Use elementary task and grammatical models to label even larger data corpi that are then used to retrain elemetary task models using only video data.<br\/><br\/>In summary, this project will study the problem of modeling structured human manipulative actions such as those that occur during minimally invasive surgery. Using statistical modeling methods originally developed for speech understanding, models for the language of surgical motion will be created and evaluated. These<br\/>models will first be created using motion measurements from a surgical robot, but will then be transferred to video data from the same system. These specific models will have applicability to surgical training, skill assessment, and robotic surgical augmentation. More generally, this project will advance our ability to develop structured models for understanding com-plex data sources, which has wide ranging implications. It will facilitate a variety of applications that require understanding of human action such gesture-based systems for human-machine interaction, methods for interpreting or detecting action in video surveillance data, or assessment and measurement of movement for bio-mechanics and medicine. At the same time, it will advance the basic science of modeling large and complex data streams such as video, text, speech, or medical images.<br\/><br\/>URL: http:\/\/www.cs.jhu.edu\/CIRL\/projects\/SurgicalModeling\/","title":"Structure Induction for Manipulative and Interactive Tasks","awardID":"0534359","effectiveDate":"2006-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["531055","445173","456647"],"PO":["564316"]},"109548":{"abstract":"As the number of elderly in need of support grows, a mitigating factor in escalating health care costs is<br\/>the proper application of technology. Indeed, part of the answer is to develop technological innovations<br\/>that allow an elder population to successfully 'age in place' with dignity and a sense of involvement with<br\/>their community, involving the elderly as part of the research team. This small grant will allow planning for initial research on this topic. The research team includes expertise in computer science (vision, robotics, human-computer interface) and social work (gerontology) and features various partnerships with government agencies.","title":"Collaborative Research: Distributed Intelligent Systems for Adaptive Aging","awardID":"0535120","effectiveDate":"2006-02-15","expirationDate":"2007-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":[290021,290022],"PO":["371077"]},"111473":{"abstract":"CAREER: Geometrically Coherent Image Interpretation<br\/>PI: Alexei A. Efros<br\/><br\/>Abstract<br\/><br\/>Image interpretation, the ability to see and understand the three-dimensional world behind a two-dimensional image, goes to the very heart of the computer vision problem. The overall objective of this proposal is, given a single image, to automatically produce a coherent interpretation of the depicted scene. On one level, such<br\/>interpretation should include opportunistically recognizing known objects (e.g. people, houses, cars, trees) and known materials (e.g. grass, sand, rock, foliage) as well as their rough positions and orientations within the scene. But more than that, the goal is to capture the overall \"sense of the scene\" even if we do not recognize some of its constituent parts.<br\/><br\/>To address this extremely difficult task, the PI proposes a novel framework that aims to jointly model the elements that make up a scene within the geometric context of the 3D space that they occupy. Because none of the measured quantities in the image -- geometry, materials, objects and object parts, scene classes, camera pose, etc. -- are reliable in isolation, they must all be considered together, in a coherent way. Having the geometric context representation will allow all the elements of the image to be physically \"placed\" within this contextual frame and will permit reasoning between them and their 3D environment in a joint optimization framework. During the timeframe of this proposal, the PI will develop such a framework which will allow a geometrically coherent semantic interpretation of a image to emerge.<br\/><br\/>Intellectual Merit: At the core of the proposal is an effort to unify two disjoint computer vision philosophies -- the traditional \"Geometry\" school that deals with 3D quantities like points and surfaces, and the newer \"Appearance\" school that operates in terms of 2D pixel patterns. These two views are here combined into one coherent framework, where appearance and geometry co-exist and rely on each other to jointly produce an interpretation of an image.<br\/><br\/>Broader Impact: There are a number of important real-world problems that will benefit from the proposed research even during its development. Direct applications of this work include: developing navigation assistant technology for the visually impaired, scene awareness for mobile robots and car safety, and creating graphical 3D walk-through environments from a single image.<br\/><br\/> URL: http:\/\/www.cs.cmu.edu\/~efros\/ImageInterpretation\/","title":"CAREER: Geometrically Coherent Image Interpretation","awardID":"0546547","effectiveDate":"2006-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["402502"],"PO":["543539"]}}