{"90436":{"abstract":"The objective the proposal is to create a research environment and develop a curriculum dedicated to studying and developing prototypes of seeing systems. The emphasis will be on the fundamental issue of capturing representations of objects and environments by means of visual sensing. Goals include enhancing autonomy of robotic agents, empowering humans with additional capabilities and advancing the level of human and robot interaction. The proposed adaptive representations will capture both the geometry and the appearance of the environment at various levels of detail and will be acquired robustly by properly exploiting the context and task related constraints. The two essential properties of this visual system that distinguish our approach from previously existing methods is (1) its continuous operation in extended dynamic 3D environments and (2) its capability to adapt depending on the environment and task at hand. <br\/><br\/>The intellectual merit of the proposed research will be in (1) advancing the state of the art in on-line methods for estimation of camera motion and scene structure; (2) unique learning of appearance based representations of objects and environments from a continuous video stream and (3) in the integration of the acquired models in the context of visually guided tasks. The broad impact includes advancing the understanding of biological systems, providing important guidance in building artificial systems, and together with new technological trends, will give rise to novel applications. The developed capabilities will enable more complex robotic tasks in less structured environments and advance human robot interaction -- features that are critical for deployment of (humanoid) robotic agents in service. They can also augment human navigation and planning capabilities and potentially affect the way we live and age.","title":"CAREER: Geometric and Appearance Based Methods for Model Acquisition","awardID":"0347774","effectiveDate":"2004-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["553609"],"PO":["564318"]},"90447":{"abstract":"This CAREER project aims to create a software infrastructure for statistically modeling sequence data. Users will be able to specify, train, apply, combine, and share models. For instance, to build a system for extracting information from text, or translating text into another language, one might combine several other researchers' models of various linguistic phenomena. The resulting composite model reflects expert knowledge in its structure, but it also has free parameters that can be trained on appropriate data.<br\/><br\/>The technical approach is to represent statistical models with weighted multi-tape finite-state automata. Sequence data, sequence processing tools, and relational databases can also be represented in this format. All these resources can be efficiently combined, using a flexible regular-expression language, because this class of automata is closed under many useful operations. As part of building the software infrastructure, the project will investigate improved search strategies and training algorithms. Within the PI's specialty of language and speech processing, it will also develop some useful models.<br\/><br\/>This project is designed to allow more people to succeed more quickly at building more accurate and efficient speech and NLP software for more domains and applications, thus lowering the barriers to entry in modern language and speech technology. Besides reaching out to communities through easy-to-use software and clear tutorials, the project will develop CS-specific course materials that gradually dig down to reveal the fundamental theory and algorithms.","title":"CAREER: Finite-State Machine Learning on Strings and Sequences","awardID":"0347822","effectiveDate":"2004-02-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["438772"],"PO":["565215"]},"94957":{"abstract":"This workshop in real-time networked embedded systems focuses on future automotive systems. The workshop will explore embedded system architectures, automotive software services, platforms, on- and off-board ad-hoc networking, networked automotive services, mobile sensor services, security and privacy issues for automotive applications, and enabling technology for automotive applications. The workshop brings together experts from industry and academia, who work on highly complex, distributed, reactive software systems related to the automotive domain. The expected outcome is deeper insight into the research challenges and proposed solutions for future automotive embedded software. This will help develop understanding by industry, academia, and Federal agencies of the research needed to advance progress in this embedded systems domain.<br\/><br\/>The broader impact of this workshop is the opportunity to stimulate communications between academia and industry, fuel international collaboration, and enhance communication between diverse research communities. Because of the pervasive demand for highly complex, dependable software systems, the workshop results are also relevant in many application domains beyond automotive, such as avionics, medical and telecommunications systems.","title":"Workshop: Future Generation Software Architectures in the Automotive Domain - Connected Services in Mobile Networks","awardID":"0413136","effectiveDate":"2004-02-01","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["438188"],"PO":["561889"]},"90338":{"abstract":"Sensor networks create new challenges in the understanding of communication and information processing. This research addresses two of the key issues: the scaling behavior of the networks, and the fact that sensor networks involve both sources and channels and hence generally perform both data compression and data transmission.<br\/>The \"scaling behavior\" of the network denotes its key properties and characteristics as a function of the number of nodes. For low-cost, low-power, and dense scenarios such as sensor networks, this is the most<br\/>relevant characterization, and it is theoretically important and successful since the exact analysis of network performance appears to be a very hard problem. By contrast, a scaling law focuses on how the performance depends on the number of nodes. Preliminary scaling-law results of the investigators suggest that qualitatively different laws and insights apply to large networks as compared to small networks. This is of fundamental importance to both research and education: different code constructions, algorithm designs, and signal processing techniques have to be developed, and a different intuition has to be taught to cover such networks.<br\/>The second key issue of this research concerns the fact that the sensed world is often analog, requiring both data compression and data transmission. This communication problem is unsolved to date: The omnipresent separation of the coding strategy into a compression and a transmission stage can lead to dramatically suboptimal performance, implying that the well-established understanding of information as \"bits\" needs to be revised. This research investigates a new and different understanding of communication as \"matching\" the source to the channel. In a scaling-law sense, this can lead to spectacular gains, as preliminary results have shown.","title":"CAREER: Scaling Laws and Measure-Matching in Sensor Networks","awardID":"0347298","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["426349"],"PO":["564898"]},"90416":{"abstract":"In this career development proposal, the Principal Investigator (PI) examines the development of frameworks to create, analyze, implement and validate cooperative payload transport capabilities in distributed robot collectives. <br\/>The principal research questions pertain to the investigation of the nature and selection of the underlying physical and informational infrastructure, system architecture, and mechanisms of cooperation, with the goal of realizing implementations with quantifiable performance benefits. Such investigation is proposed in the specific context of creation, control and active reconfiguration of marching formations with variable numbers of mobile manipulators for cooperative payload transportation tasks. The three aspects of research identified for examination under the common theoretical but computationally tractable framework, include: (i) methodologies for design and optimization of formations for pre-specified tasks; (ii) scalable schemes for control and adaptation of formations for changing tasks; and (iii) quantitative examination of the role of modularity, sensing, communication, modeling and decentralization on cooperative performance. A two-pronged approach of extensive simulation-based study and rigorous experimental ratification is proposed to evaluate the performance of candidate systems. <br\/>The key contribution from this investigation is the development of a flexible unified framework for design, analysis, control and validation of such cooperating systems and the broad applicability of the framework for uniformly treating: cooperative material-handling by a fleet of decentralized manipulation agents; hybrid articulated-wheeled systems with enhanced locomotion capabilities; and distributed haptic collaboration with a common virtual object within a shared virtual environment; is discussed.<br\/>The overall educational goals are to develop the courses, tools and the human resource base to conceive, investigate, implement and validate such systems-of-systems. Specific educational initiatives include: (i) developing and integrating new undergraduate and graduate courses in robotics and mechatronics into the curriculum; (ii) strengthening and modernizing existing undergraduate courses in design and systems; (iii) creating educational technology curricular modules for encapsulating knowledge and providing a mechanism for outreach within the university, with local high schools and industry and the educational community at large.","title":"CAREER: Cooperative Payload Transport by Robot Collectives","awardID":"0347653","effectiveDate":"2004-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["550248"],"PO":["564316"]},"103248":{"abstract":"EIA-0203971 Gianfranco Ciardo College of William & Mary Structured Methods to Evaluate the Performance of Distributed Software<br\/><br\/>Our goal is a collaborative research effort aimed at removing the computational barriers to the widespread adoption of Markov chain modeling technology in the software performance engineering process. <br\/><br\/>We will approach the problem from different and complementary points of view, and have the necessary means to solve many of the remaining computational issues. The results of the proposed research will open up the Markov modeling field to a surge of new, and probably unanticipated, research activity in very diverse areas of national and international importance, and provide a path towards the compositional performance assessment of systems built from off-the-shelf software modules.","title":"NGS: Methods to Evaluate the Performance of Distributed Software","awardID":"0501747","effectiveDate":"2004-02-05","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["451554"],"PO":["551712"]},"103249":{"abstract":"Abstract<br\/>0219745<br\/>Ciardo -<br\/>College of William and Mary<br\/><br\/>This research is devoted to the development and implementation of novel sequential and parallel algorithms for the verification of asynchronous software systems, such as communication protocols and distributed or embedded software. Existing automated techniques based on state-space exploration, in particular symbolic model checking based on Binary Decision Diagrams (BDDs), focus on verifying synchronous hardware and software. Although symbolic model checking may in principle be applied to asynchronous software systems as well, this poses new challenges that are not, or only insufficiently addressed in the literature. Most importantly, the inherent complexity of asynchronous software makes state-space exploration a time-bound problem, in addition to a memory-bound problem. The research addresses these two fundamental limitations by developing algorithms that employ Multi-valued Decision Diagrams (MDDs) and Boolean Kronecker Operators to encode sets of states and transitions, respectively, in contrast to BDDs traditionally used for both purposes. This paves the way for exploiting the property of event locality that is inherent in asynchronous software and, thereby, for greatly improving the efficiency of sequential algorithms and enabling their efficient parallelization.","title":"ITR: Automated Verification of Asynchronous Software Systems","awardID":"0501748","effectiveDate":"2004-02-05","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1686","name":"ITR SMALL GRANTS"}}],"PIcoPI":["451554"],"PO":["561889"]},"87063":{"abstract":"There is ample anecdotal evidence that IT investments are quite risky. Studies have shown that as much as 70% of IT projects are either cancelled, or completed late or over-budget. Yet, IT risk is virtually absent in the burgeoning literature on the returns on IT investment. This omission of IT risk considerations might explain in part the unusually high estimates of returns on IT investment, in recent research. At the same time, the debate in the IT returns literature is shifting from the \"productivity paradox\" to the \"new productivity paradox,\" wherein what is puzzling is not the lack of evidence of returns on IT investment, but inexplicably high estimates of the same. This new puzzle provides the theoretical motivation for this project, which will broadly examine the impact of IT risk on the cost of IT capital, and on the productivity and market value of firms.<br\/><br\/>The specific objectives of this project are: (1) to incorporate IT risk into existing empirical frameworks for characterizing IT returns, (2) to generate empirical metrics of IT risk at the firm and industry levels, and (3) to assess the risk-adjusted return on IT investment. The analysis of these issues will be conducted using a comprehensive set of research methods, including production function analysis, market value analysis, event study methodology, and field study research. The impact of IT risk will be analyzed at two levels of analysis or aggregation, IT capital and IT projects, echoing the existing research literature on the returns on IT investment. This will yield empirical estimates of the impact of IT risk on the cost of IT capital, and on the market value of firms. The findings are expected to be of interest to multiple disciplines including information systems and accounting.<br\/><br\/>Broader Impacts: The intellectual contributions of this research will impact both industry practice and policy formulation. The results of this study will provide a scientific platform for an informed discussion of IT risk management, an increasingly critical concern in the industry and society of the digital age. Accordingly, the findings from this study will be disseminated in practitioner and policy-oriented outlets as well as in inter-disciplinary academic journals. Practical issues surrounding IT risk management will constitute the focus of the field studies, which will involve undergraduate students in the research; this involvement will advance knowledge discovery while promoting teaching and learning.","title":"Risk Vs. Return of Information Technology Investment","awardID":"0328482","effectiveDate":"2004-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[227811,227812],"PO":["564456"]},"88681":{"abstract":"PROJECT SUMMARY <br\/>Title of Project: Northeastern University GK-12-PLUS: Partners Learning in Urban Settings <br\/>Institution: Northeastern University, Boston, MA <br\/>PI\/CoPI: David Blackman, PI, Director, Institute for STEM (Science, Technology, <br\/>Engineering & Mathematics), Education; Jean Krasnow, Co-PI, Visiting Associate Professor, Education. <br\/>Number of Fellows per year (graduate): 12 <br\/>School District Partners: Boston Charter Schools: City on a Hill, Boston <br\/>Renaissance, Health Careers Academy; Boston Public Schools: Boston Latin <br\/>Academy, Fenway High School, John D. O'Bryant H.S., Quincy Upper School <br\/>Target audience of the project (K-12 band): middle and high school, grades 7-12<br\/>Setting: urban <br\/>Disciplines involved: Mathematics, Geology, Physics, Chemistry, and Biology <br\/><br\/>Narrative Summary: The NU GK-12-PLUS project will continue the Fellows program at Northeastern, incorporate lessons learned from the first round, share the knowledge gained from the program with the faculty concerned with improving graduate and undergraduate education, and institutionalize the program within the University. We will follow the participants over time to assess the impact of the work in order to fmd out how students best acquire facts, content and skills in a variety of learning situations. Innovative aspects of the program include ( 1) maintaining a close working relationship with the Principals and Headmasters of the Boston partner schools who will be Instrumental in matching Fellows with teachers, monitoring the program in their schools, and lobbying for a strong University-public school relationship and institutionalization of the program; (2) an outcomes-based approach, with curriculum and teaching materials produced each year and made available to others; and (3) an evaluation model that will document longitudinally the activities of the Fellows and their cooperating teachers, and track the achievement of students in STEM in the partner schools. <br\/><br\/>Intellectual merit criteria: This project engages the University and 7 urban schools in the question of how best to prepare students for future careers in math and science. The models developed and the results of our assessments over time will be made available to partner schools, to our departments of arts and sciences, and to the programs in our School of Education for preparation of mathematics and science teachers and integration of GK -12 activities into graduate education. <br\/><br\/>Broader implications criteria: The project will benefit all partners: Fellows will gain practical experience in the classroom; teachers will become better STEM educators and help introduce and strengthen STEM curriculum in their schools; the K-12 students will benefit from enhanced STEM instruction which should lead to higher scores on exams, better preparation for higher education, and eventual entrance into the technology- oriented workplace. Our model can be replicated by other universities partnering with urban schools, particularly in those with high proportions of underrepresented minority students.","title":"Track 2, GK-12: Northeastern University GK-12 PLUS: Partners Learning in Urban Settings","awardID":"0338255","effectiveDate":"2004-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":["319878","478598",232639,232640],"PO":["559975"]},"92290":{"abstract":"The proposal will support the yearly workshop and conference of Digital Government Research Program grantees, along with their government partners, students, and other interested individuals. Based on past experience, there will be an attendance of about 200 individuals. A white-paper submission and process will be supported, as well as several events for student demonstrations. In addition, the proposal will support several outreach activities; these include a web site (www.digitalgovernment.org) and a printed brochure covering highlights of the DG program. The workshop will serve several purposes: <br\/><br\/>To allow grantees and their gov't partners to become aware of what other grantee\/agency teams are doing, <br\/>To provide a forum for government agencies to present their IT-related problems and challenges, and <br\/>To support much-needed dialog between social\/political science grantees and technical grantees.","title":"Digital Government Community Building and Outreach 2004","awardID":"0400529","effectiveDate":"2004-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["446979"],"PO":["371077"]},"86494":{"abstract":"Biometric systems automatically measure a physiological or behavioral \"signature\" of an individual, from which a decision can be rendered to either authenticate or determine the identity of that individual. In this way, biometric systems provide the means to bind the physical presence of an individual user with her cyber action. Despite the increasing use of these systems, neither an analytic framework for modeling and predicting their performance, nor a set of standard multibiometric data is available to researchers for testing purposes. <br\/><br\/>This research addresses these deficiencies by determining an analytic framework in which the performance of biometric systems can be modeled and predicted, removing key barriers to biometric system performance through research in multibiometrics and effective vulnerability countermeasures, and understanding the relationships among biometric applications, privacy, security, and user acceptance that are essential for both informed public policy and system design. Addressing this interrelated set of key technical barriers and societal issues will advance the understanding of biometric system acceptance, performance, and design, and will enable trustworthy authentication and identification functions essential to pervasive computing and supporting homeland security needs. The data sets generated by the coordinated tasks of this research are also being made available as a resource to the biometrics research, developer, and user communities.","title":"ITR Collaborative Research: Biometrics - Performance, Security, and Social Impact","awardID":"0325640","effectiveDate":"2004-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H280","name":"US DEPT OF HOMELAND SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H342","name":"DEPT OF HOMELAND SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T780","name":"DHS-BIOMETRICS PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V962","name":"HOMELAND SECURITY-BIOMETRICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"V462","name":"HOMELAND SECURITY-ARMY-HOMELAN"}}],"PIcoPI":["564474","560285",226091,226092,"525557","525557"],"PO":["565264"]},"89399":{"abstract":"Rosenberg, Aronld<br\/>University of Massachusetts Amherst<br\/>CCF-0342417<br\/><br\/>The past decade has seen a paradigm shift in the computing platforms used for a wide variety of computations. Advances in technology and economic considerations have made clusters of workstations or pc's a viable medium for high-performance \"collaborative'' computing (wherein many computers cooperate to solve a single computational problem). Many of the algorithmic devices that ensured efficient \"collaborative'' computing in earlier computing environments no longer guarantee efficiency within such clusters, especially when the clusters are heterogeneous, in the sense that their workstations may differ in computational power. The program of research proposed herein is dedicated to achieving provably efficient computation in heterogeneous clusters, via efficient algorithms for large classes of important computations. The first component of the goal of \"provably efficient computation'' will be the use of a combination of analytical and experimental methods to develop the insights needed to craft scheduling algorithms whose performance is predictable via rigorous mathematical and\/or statistical analyses. The second component of the goal will be to validate the abstract models used to formulate and analyze algorithms. Implementations of algorithms on actual clusters, and comparison of measured performance against the predictions of the abstract algorithmic models, will be used to validate or, where necessary, to modify the models. The scheduling algorithms and, when appropriate, implementations thereof that result from this process will be the main product of the research.<br\/><br\/>The proposed research will focus on \"ad hoc'' clusters, which are assembled from \"off the shelf'' workstations or pc's, interconnected via local-area networks. The major scheduling challenges here reside in the substantial cost of interworkstation communication and in the cluster's (likely) heterogeneity, i.e., the differences in computing power of its constituent workstations. Initial studies have led to a mathematical framework for the proposed research.<br\/><br\/>Technical impact.. The proposed work will provide rigorously validated guidelines for<br\/>scheduling a broad variety of significant computational problems efficiently on heterogeneous clusters. Research results will be disseminated in leading conferences and journals, and will be<br\/>incorporated into courses and seminars. Via the training of students, and via collaborations and technical interactions with colleagues, both in the US and abroad, the work will lead to yet further technical progress. (There are ongoing collaborations with colleagues in Australia, France, and Italy.)<br\/><br\/>Broader impacts. Prior support from NSF has led to the incorporation of cutting-edge<br\/>technical material into independent studies, courses, and research seminars, which have been part of the training of several generations of students in several departments at U Mass Amherst. All but one of the PI's doctoral students have pursued (successful) academic careers at colleges or universities in the US. Two recent doctoral students have been women: one was born in China and one in eastern Europe; both are successfully pursuing careers in US educational institutions.<br\/>Results from the proposed research will be incorporated into the educational program in the same way that prior results have been.","title":"Scheduling Collaborative Computations on Heterogeneous Clusters","awardID":"0342417","effectiveDate":"2004-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["518069"],"PO":["565272"]},"90280":{"abstract":"Future communication systems will be required to operate very close to<br\/>their theoretical limits and achieve high performance with limited<br\/>resources (e.g., bandwidth, energy, complexity). In order to realize<br\/>these goals, the receiver of a communication system should be able to<br\/>decode the digital data in the presence of channel uncertainty (e.g.,<br\/>unknown channel quality, interference, etc.). The current state of<br\/>knowledge regarding the complexity of these receivers is that their<br\/>complexity grows exponentially with the sequence length. This is<br\/>unacceptable when practical implementation of these algorithms is of<br\/>interest. A number of fundamental questions thus arise: (i) How<br\/>accurate is the conventional wisdom that complexity grows<br\/>exponentially with the sequence length? (ii) What is the impact of<br\/>the above question on the design of near-optimal, approximate<br\/>algorithms suited for ultra-fast integrated circuit implementation?<br\/>(iii) How can the complexity\/performance tradeoff of these approximate<br\/>algorithms be analyzed, and how can it be improved?<br\/><br\/>This research addresses the aforementioned fundamental questions<br\/>using a novel approach in looking at the problem of joint data<br\/>detection and channel estimation, consisting of two main thrusts: (a)<br\/>On the theoretical front, the current state of knowledge is challenged,<br\/>by investigating a broad class of communication scenarios for which<br\/>the exact solution can be obtained with only polynomial complexity.<br\/>(b) Utilizing the constructive proofs of the aforementioned statements,<br\/>a family of novel receivers is investigated with near-optimal<br\/>performance, linear complexity, and moreover, algorithmic structure<br\/>that is suitable for high-speed hardware implementation.","title":"CAREER: Exploring the Complexity Limits of Joint Data Detection and Channel Estimation: Exact, Polynomial-Complexity Solutions and Ultra-Fast Approximations","awardID":"0346977","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["483402"],"PO":["432103"]},"93162":{"abstract":"This proposal supports the participation of doctoral students from U.S. universities in the Doctoral Consortium of the 14th International Conference on Automated Planning and Scheduling (ICAPS) to be held June 3-7, 2004 in Whistler, B.C., Canada. ICAPS is the premier conference for research in artificial intelligence planning and scheduling. This Doctoral Consortium includes a Poster Session and a mentoring program that matches PhD students with established researchers with similar interests. The goals of the Doctoral Consortium include providing doctoral students with valuable exposure to additional perspectives on their work at a critical time in their research projects as well as providing helpful career advice at a critical time in their professional development.","title":"ICAPS-2004 Doctoral Consortium; June 3-7, 2004; Whistler, Canada","awardID":"0404713","effectiveDate":"2004-02-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["39192"],"PO":["491702"]},"86452":{"abstract":"The design and development of future wireless networks and services will require sophisticated simulation and emulation tools that captures the scale, complexity, and abstraction of both the protocols that constitute the multi-layered network stack, as well as the heterogeneous nature of the wireless and wired Internet - tools that currently do not exist. Future simulation strategies must capture the heterogeneity of evolving protocols while simultaneously supporting high-fidelity wireless modeling environment.<br\/>This proposal will build a comprehensive Integrated Protocol Development Environment (IPDE)<br\/>to support design and development of wireless network protocols. This work will enable researchers to design and<br\/>develop end-to-end network applications in a unified public-domain simulation and emulation environment. <br\/>Two key innovations in this proposal that will empower real time test and emulation of future wireless applications<br\/>include (i) the notion of relativistic time, that integrates the controllability of virtual-time with the natural selfsynchronizing property of real-time, and (ii) spatial scaling, where various components of the system will operate at different spatial scales - ranging from continuous fluid flow models for the Internet backbone, to discrete packet data flows in actual routers - with overall spatial coordination occuring in a decentralized manner. Validation of such an IPDE framework will be in the form of the design and deployment of multiparametric adaptive algorithms for wireless network scheduling and control.<br\/>By providing an integrated framework for simulation, hardware emulation, and direct code execution of network protocols, the IPDE will enable researchers to setup large scale virtual test-beds, validate their modeling, and design middleware algorithms.","title":"Collaborative Research: ITR\/NGS: Fast Wireless Network Simulation Using Spatio-Temporal Dilations","awardID":"0325410","effectiveDate":"2004-02-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["309299"],"PO":["551712"]},"94450":{"abstract":"Abstract<br\/>IIS 0410409<br\/>PI Olivia R. Sheng and Paul Hu, University of Utah<br\/><br\/>This Small Grant for Exploratory Research will support a collaboration with the State of Utah's Electronic Resource and Eligibility Product governance board, in the development of an electronic system for temporary assistance for needy families (Utah Cares). The PI's, from the University's School of Business, will develop a framework for investigating the inter-relationships among system quality, cost, benefit, usability, usage, and user acceptance. The collection of data will be accomplished through web log analysis and data-mining, supplemented by questionnaires as needed. As changes are made to improve Utah Cares, the impact should be discernible through the framework which has been developed and the data which is continually collected.","title":"Digital Government Services for Family Assistance: Evaluation and Implications for Inter-Agency Implementation","awardID":"0410409","effectiveDate":"2004-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":[247564,247565],"PO":["371077"]},"90260":{"abstract":"New challenges for computational scientists have emerged in the past several years as the size of data generated from simulations has experienced an exponential growth. One major factor that is contributing to the growth of data size is the increasingly widespread ability to perform very large-scale time-varying simulations. This project aims to design efficient data processing and effective feature extraction techniques to facilitate large-scale time-varying data analysis.<br\/><br\/>The specific goal of this research is to study the following fundamental problems in time-varying visualization algorithms: (1) Design spatio-temporal data encoding and management schemes to facilitate run-time browsing and analysis of data at arbitrary spatial and temporal scales, (2) Develop accelerated visualization algorithms to utilize spatial and temporal data coherence. Topics of interest include the design of space-efficient time-varying isosurface extraction algorithms, automatic level of detail algorithms for multi resolution time-varying volume rendering, and load balanced parallel data distribution and visualization schemes, (3) Design novel time-varying feature enhancement and tracking techniques. Specifically, focus is on the development of novel high dimensional volume projection techniques to highlight the progression and evolution of time-dependent features, and high dimensional geometric algorithms to track time varying is contours and interval volumes. Focus is also on the design of effective transfer functions used in volume rendering to extract salient time-dependent features","title":"CAREER: Toward Effective Visualization of Large Scale Time-Varying Data","awardID":"0346883","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["533228"],"PO":["550859"]},"94441":{"abstract":"We seek to initiate an exploratory research program aimed at creating design tools for designing, optimizing, simulating and testing biological circuits built out of basic machineries of biology; specifically, mechanisms composed of DNA, RNA and protein interactions. These circuits are dispersed, asynchronous but are easily replicable as their basic components are created out of those elements that already occur in nature and can be synthesized, controlled and degraded using the same principles. The basic biological principles that they utilize are: polymerase-induced replication, transcription controlled by transcription activation, translation into proteins, interference by small RNA, and modulation via extra-chromosomal plasmids. Because of the underlying design principles, biological circuits created in this manner can be easily transfected into simple prokaryotic organism such as E. coli, eukaryotic organisms such as yeast as well as cell lines. We hope to gain a better understanding of the biological mechanisms of interest by studying the interaction between the designed biological circuit, whose operation is known, modeled and already studied, and the unknown function of the genes of the host organism. In this manner, the proposed research program extends the current functional genomics methods based on knock-in mutants, knock-out mutants, genes perturbed by extra-chromosomal plasmids and interference through RNAi.<br\/><br\/>Thus ultimately the proposed research is aimed at understanding gene networks through computational and mathematical methods using both forward engineering and reverse engineering paradigms. For forward engineering, we directly address various topics dealing with genetic circuits - in particular, we focus on creating novel artificial circuits out of regulatory genes, RNAs, and proteins. For the reverse engineering, in the context of our other related research, we have also addressed the problem of inferring gene networks with techniques analyzing time-course data in abundance data, such as transcriptome data, but not excluding proteome, or metabolome data. Furthermore, it should be apparent that in the near future these methods could play an important role in gene therapy, genetic modification of organisms or even large-scale systems to solve challenging computational problems.<br\/><br\/>The major computational challenge is the development of novel design principles for delay-independent asynchronous circuits using simple building blocks such as combinatorial logic-gates (AND, NOT, XOR, etc.), arbiter circuits (Muller C-circuit) and memory elements (FIFO queue elements).","title":"SGER: Biologically Inspired Computation to Understand Regulatory Gene Networks","awardID":"0410335","effectiveDate":"2004-02-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["417590"],"PO":["521045"]},"93551":{"abstract":"The workshop will focus on initiating cooperative activities to accelerate research and the deployment of testbeds for critical and pervasive applications across academia, industry, and government incorporating advanced information technologies. It will bring together computer scientists in security, networking, software engineering, and other fields to work with application scientists and engineers to gain insight into common problems and to identify common goals across many pervasive and critical application domains. The workshop will identify technology needs and major testbed problems in science and engineering research areas of interest to industry and to the National Science Foundation. It will identify technical and resource requirements for achieving significant progress on the global challenges of Digital Government, National Security, Emergency Preparedness, and Homeland Security.","title":"Workshop: Accelerating Trustworthy Internetworking (ATI 2004) - Deploying Critical and Pervasive Applications","awardID":"0406313","effectiveDate":"2004-02-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":[245221],"PO":["529429"]},"94662":{"abstract":"An interdisciplinary team of anthropologists, engineers, computer scientists, public health <br\/>scholars, and organizational theorists, will conduct an exploratory study of creating a <br\/>multi-agent simulation model for planning and evaluating disaster response in complex <br\/>urban settings. The research team will use data collected at disaster scenarios and <br\/>exercises to develop small-scale models of the coordination of multiple agencies and <br\/>jurisdictions in the Detroit Metropolitan Area. These models will provide a proof-of-<br\/>concept for an innovative concept - multi-agent modeling with cultural algorithms - to <br\/>be used in both training and evaluation of coordination of first responders. <br\/> <br\/>Upon successful completion of the feasibility study and funds permitting, the research team will scale up and <br\/>extend these models to build the MAJOR (Multiple Agency and Jurisdiction Organized <br\/>Response) Disaster Model. This model will be developed in close cooperation with <br\/>municipal police, firefighter, and emergency medical service personnel.","title":"SGER: Computational Modeling of Disaster Response","awardID":"0411587","effectiveDate":"2004-02-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["354231","354232","257652"],"PO":["371077"]},"95355":{"abstract":"The problems encountered by novice and experienced users when browsing the Web have been well documented in the literature. This project seeks to learn more about the experiences of users with visual impairment who must use screen readers to this end. Through a partnership with the National Federation of the Blind, the PI will document the errors and frustrations of these users. Modified time diaries will be used to collect data on causes, severity, responses, and time lost. The research methods to be used for this project have previously been employed successfully by the PI in preliminary research relating to web usability, web accessibility, user error, user frustration, and user-centered design.<br\/><br\/>Broader Impacts: There are documented differences in the computer usage and needs of different user groups, but there is limited research on the errors and frustrations that diverse user populations face. The end result of this project will be to increase our knowledge on what the causes of user frustration are, for a large user community for which access to the Web is a problem, so that in future work it will be possible to develop and test improved computer interfaces for the Web that bring us a step closer to achieving the goal of universal usability.","title":"SGER: Reducing User Frustration for Blind People on the Web","awardID":"0414704","effectiveDate":"2004-02-01","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["431050"],"PO":["565227"]},"89426":{"abstract":"A growing concern among corporate information technology (IT) managers is the elevating gap between the increasing system maintenance and administration cost of the IT infrastructure and the decreasing hardware\/software acquisition cost. This gap is escalating because system administration and management is still heavily labor-intensive and does not scale very well with system size and complexity, despite extensive research efforts to automate the process. One promising approach to drastically reduce this cost is to adopt a computing utility model, in which a centrally managed computing infrastructure is shared among multiple enterprise applications in a way that preserves their high-level business objectives. The primary technical challenge in the computing utility model is how to provision and schedule system resources to support the desired quality of service (QoS) of individual business applications that share the same physical infrastructure without human intervention. This project proposes to develop a multi-dimensional resource virtualization system called Iguacu, which multiplexes multiple system resources among a set of enterprise applications on a large-scale PC cluster such that the delay and\/or throughput requirement of each such application is satisfied. Iguacu features three key innovations. First, unlike most previous QoS efforts that focus on a single system resource, Iguacu coordinates the allocation and scheduling of multiple system resources, including CPU, disk, and network link, to meet application-specific QoS requirements while significantly improving individual resource's utilization efficiency. Second, Iguacu supports a unified and reusable implementation framework that could quickly convert, with zero or minor modification, a given database-intensive enterprise application into a form that provides guarantees based on service-specific performance metrics. The development of such a framework greatly mitigates the efforts required to deploy QoS-aware enterprise applications in a complicated IT environment. Third, Iguacu features a novel procedure that automatically translates high-level QoS specifications into physical system resource requirements for distributed enterprise applications running on a cluster environment.<br\/><br\/><br\/>Besides its intellectual contributions, this project is expected to make a major impact on the undergraduate and graduate education of the Computer Science department at Stony Brook University by introducing a series of system management and administration courses, which will use the Iguacu prototype as a case study on the functionality and implementation details of an enterprise-scale system management system for scalable PC clusters. Finally, the technologies developed in this project are expected to influence the future product directions of a major system management solution vendor, Computer Associates International, through an on-going research collaboration in the network\/system management area.","title":"Quality of Service Management for Enterprise-Application Computing Utilities","awardID":"0342556","effectiveDate":"2004-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["359707"],"PO":["565272"]},"81770":{"abstract":"The emergence of computational Grids and the potential for seamless aggregation, integration and interactions has made it possible to conceive a new generation of realistic, scientific and engineering simulations of complex physical phenomena. These applications will symbiotically and opportunistically combine computations, experiments, observations, and realtime data, and will provide important insights into complex systems. Furthermore, the underlying Grid infrastructure is similarly heterogeneous and<br\/>dynamic, globally aggregating large numbers of independent computing and communication resources, data stores and sensor networks. The combination of the two results in an application development, configuration and management complexities that break current paradigms based on passive components and static compositions. This projectwill make the following specific contributions:<br\/>1. Definition of Autonomous Components: We will define programming abstractions and supporting infrastructure that will enable the definition of autonomous components. Together, the aspects, policies, and policy engine allow autonomous components to consistently and securely configure, manage, adapt and optimize their execution.<br\/>2. Dynamic Composition of Autonomic Applications: We will develop mechanisms and supporting infrastructure to enable autonomic applications to be dynamically and opportunistically composed from autonomic components. The composition will be based on policies and constraints that are defined, deployed and executed at run time, and will be aware of available Grid resources (systems, services, storage, data) and components, and their current states, requirements, and capabilities.<br\/>3. Online Performance Modeling of Component-based Applications: We will investigate the formulation of<br\/>predictive performance functions that hierarchically combine analytical, experimental and empirical performance models for application components and elements of the Grid. <br\/>4. Autonomic Middleware Services: The project will design, develop and deploy key services on top of the emerging Grid middleware infrastructure to support autonomic applications. One of the key requirements for autonomic behavior and dynamic compositions is the ability of the components, applications and resources (systems, services, storage, data) to interact as peers. Furthermore the components should be able to sense their environment. The project will extend the Grid middleware with (1) a peer-to-peer substrate, (2) context aware services, and (3) peer-to-peer deductive engines for composition, configuration and management of autonomic applications. An active peer-to-peer control network will combine sensors, actuators and rules to configure and tune components and their execution environment at runtime and satisfy requirements, and performance and quality of service constraints.","title":"NGS: Collaborative Research: Autonomic Computing Middleware","awardID":"0305427","effectiveDate":"2004-02-15","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["561892"],"PO":["301532"]},"90361":{"abstract":"The PI will develop and test a model of the influences of team, project, and user factors on success in open source software (OSS) development. A multi-dimensional conceptualization of success will be explored, including both a development and a usage perspective. The following general propositions are developed: Team factors that enhance identification and commitment attract and retain developer input and facilitate the successful conversion of that input into output; Project factors that are aligned with developer motivations attract developer input; Project factors that facilitate the coordination and combination of developer contributions increase the successful conversion of development input into output; Project factors act as cues to usefulness and ease of use of the software, thereby influencing user interest and adoption; The alignment of project factors with user factors influences user interest and impact; Positive impact of prior OSS adoption will enhance user interest in other OSS products. These propositions are further developed to provide the basis for testable hypotheses. Data will be collected on a large sample of open source projects using several sources: community websites (SourceForge.net and Freshmeat.net), project homepages, surveys of project participants, and case studies and surveys of users. Projects in the sample will be monitored over the proposed research period, so that both cross-sectional between-projects effects and longitudinal within-project effects can be analyzed. To start the process, data collected in three pilot studies previously conducted by the PI to refine her theoretical model and data collection strategies will be integrated and significantly expanded.<br\/><br\/>The PI expects this work will advance our knowledge and understanding of OSS as a unique and important phenomenon by providing a large sample investigation of influences on development success, and by introducing a usage perspective on success that has been lacking in prior work. Using a large sample of newly introduced projects and following them over time, this study will complement prior work by addressing limitations that have resulted from studying mainly large, successful OSS projects and\/or limiting study to cross-sectional analysis of publicly available data (i.e., SourceForge data). This study combines both publicly available data from OSS websites as well as survey data and case studies, to provide a richer picture of success. Examining team, project, and user factors in a single study will allow for interaction effects and comparison of the relative importance of different kinds of success antecedents. The research model is grounded in emerging research on OSS and relevant organizational research literatures, investigating both factors unique in the OSS setting, as well as factors drawn from other studies of virtual teams. The research is expected to contribute not only to our understanding of OSS, but also to the wider research literatures from which the model is derived, including the information systems (IS) literatures on virtual teams and IS adoption and use. <br\/> <br\/>Broader Impacts: Open source software represents a new means of innovation that may have great societal benefits. The PI expects the results of the research will enable organizations to effectively use open source software and development approaches, and will further help policy makers to determine appropriate means for fostering innovation. The PI will widely disseminate the results of this research both in academia and industry. The project will directly promote learning through the participation of undergraduate and graduate students in the study activities; in particular, as three of the four students who worked with the PI on her pilot studies (and who she expect to continue working with her) are African Americans, the research may directly increase the participation of under-represented groups.","title":"CAREER: A Study of Open Source Software Project Success","awardID":"0347376","effectiveDate":"2004-02-15","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["343661"],"PO":["564456"]},"90372":{"abstract":"Despite dramatic increases in the performance of graphics hardware, the use of 3D graphics by most users remains limited because of the difficulty of creating or obtaining 3D content. The widespread availability of inexpensive, easy to use 3D scanning systems will help bridge this \"content gap\", with impacts in fields ranging from art education and cultural heritage preservation to construction and law enforcement. The aim of this research is to develop a theoretical understanding of triangulation-based 3D scanning systems and to design new 3D scanners that are flexible, robust, inexpensive, and easy to use. As a specific example, the project involves bringing 3D scanning into elementary school classrooms by developing a scanning system that can be built out of Lego cameras and building blocks, set up by teachers, and operated by fourth graders. The goal is to encourage early interest in science, technology, and arts by letting students create their own computer-animated movies.<br\/><br\/>The research builds upon a framework of \"space-time stereo\" to generalize many currently used scanner designs, such as stereo and laser stripe scanning. An analysis of existing and novel scanners relates the processing performed by the systems, consisting of correspondence across spatial, temporal, or space-time windows, to properties of the object being scanned (such as depth variation, presence or absence of color texture, and speed of motion). Based on this analysis, new 3D scanner designs are developed that eliminate the need for expensive optics and motors while being more adaptable to a wide range of scanning scenarios. Several specific applications are implemented, including an inexpensive, high-resolution desktop scanner for small objects, scanners for building interiors that flexibly incorporate multiple cameras and projectors, and an omni directional scanner that captures an entire room at once. Efficient and stable alignment algorithms combine the multiple scans obtained by each scanner into complete 3D models.","title":"CAREER: Practical 3D Model Acquisition","awardID":"0347427","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["456692"],"PO":["550859"]},"96654":{"abstract":"The purpose of the informational meeting is to share with the community the goals and scope of the focus area. By including presentations from researchers, vendors, and applications experts, this meeting will enable attendees to get a sense of the state of the art in sensor networks, and the key challenges facing the focus area and sub-areas thereof. It will help the community better target proposals; PIs will be able to conserve efforts by understanding which proposals would be completely out of scope. Finally, it will start to build a community for the focus area, perhaps encouraging early collaboration and potentially strengthening the pool of submissions.","title":"Informational Meeting for Focus Area: Networking of Sensor Systems - February 20, 2004, Marina del Ray, CA","awardID":"0421552","effectiveDate":"2004-02-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553707"],"PO":["543507"]},"90450":{"abstract":"Cryptographic security models are defined in terms of the capabilities of the adversary, including computational limitations and what access he is allowed to the system. The security of protocols is then proven with respect to such adversaries, in a well-defined, rigorous and quantifiable way (typically relying on some computational hardness assumption). However, traditional models are often not adequate, especially in light of the widespread use of cryptography today. Since we cannot predict everything the adversary can do a priori, it is important to reduce the assumptions about the adversary's (in)capabilities as much as possible. <br\/><br\/>Here, we propose to expand the traditional cryptographic foundations so as to withstand attacks by stronger, more realistic adversaries. In particular, we challenge the classical assumption that the adversary has no access whatsoever to the legitimate parties' secret keys. We will study the strongest existing models, design new models, develop protocols, and explore the limits of what is possible to achieve, for the following types of attacks: <br\/><br\/> Chosen ciphertext attack: can we achieve CCA security from any scheme satisfying only standard semantic security? What are the relations among the <br\/>different notions of security for public key encryption? <br\/><br\/>Tampering attacks: can we achieve security for various cryptographic applications when the adversary can tamper with the secret key, e.g. through fault attacks? <br\/><br\/> Key exposure attacks: can we achieve security when the adversary can <br\/>obtain the secret key? how to design and instantiate key evolving schemes<br\/>with optimal security and efficiency to limit damage caused by key exposure? <br\/><br\/>We will seek both positive and negative results in the above areas, in order to better understand the relevant implications and requirements, and to obtain optimal solutions.","title":"CAREER: Strengthening Cryptography by Reducing Assumptions about the Adversary","awardID":"0347839","effectiveDate":"2004-02-15","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}}],"PIcoPI":["485875"],"PO":["565157"]},"90340":{"abstract":"Today it is feasible to attempt very realistic rendering of complex natural scenes: for example, in the film effects industry a particular focus is rendering realistic humans. The difficulty of doing this illuminates the shortcomings in current knowledge about skin, hair, and cloth and how their physical properties produce the distinctive visual appearance of these materials. Across the board, the increasing quality of computer-generated images is limited by a fundamental unsolved problem: the efficient and accurate modeling of the properties of materials. This research addresses this problem by looking at materials in several ways: how they interact with light, how they change their shape and appearance as they move, and how human observers perceive them.<br\/><br\/>In a departure from much previous work on materials in graphics, this research program expands the definition of material properties from optical properties alone to include mechanical properties and their effects. Additionally, material appearance is considered in the context of human visual perception. These goals lead to three related paths of research:<br\/><br\/>1. Optics of materials. Light reflection is central to rendering materials and forms the core of this research: developing the fundamentals using a scientific approach progressing from measurements of real materials through analysis to models that are practical for rendering.<br\/><br\/>2. Mechanics of materials. Recognizing that optics and static geometry alone suffice only to represent rigid materials, this project broadens the definition of material properties to include the mechanical properties that create the distinctive shape and motion that are so important to the appearance of deformable materials.<br\/><br\/>3. Perception of materials. Rendering is about making images that will be viewed by human observers, and to achieve efficiency and quality it is critical to have a better understanding of how the human visual system interprets, classifies, and infers properties of materials","title":"CAREER: Modeling the Properties and Appearance of Materials","awardID":"0347303","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["448639"],"PO":["532791"]},"90472":{"abstract":"Self-assembly (SA) occurs when many building blocks are placed in an environment that thermodynamically favors their forming structured aggregates. For example, capillary forces between millimeter scale tiles floating on a liquid-liquid interface produce regular arrays of various shapes as the system is gently shaken. Similar phenomena play crucial roles in the assembly of viruses, organism development, growth of silicon crystals, electronics, pathogen detectors, artificial tissue, ad hoc wireless networks and reconfigurable robotic devices. However, most examples of engineered SA usually produce rather simple, regular arrays of parts. Engineering a system that self assembles something as complicated and irregular as, for example, a virus is well beyond our capabilities both theoretically and technologically.<br\/><br\/>The PI proposes to address this problem by supplying the parts to be assembled with active control over the binding interactions in which they participate, developing a theory and practice of Programmed Robotic Self-Assembly. In particular, the PI proposes to implement programmed robotic SA in a test-bed where programmable parts have micro-controllers, local sensors and mechanical or magnetic latches. The idea is to approximate organic SA where changes in molecular conformation (shape) guide the assembly process. A task that the test-bed should be able to perform is: \"Given a desired assembly specification input by the user, download programs onto each robotic part so that, when they are placed in a suitable environment, the parts self assemble into copies of the desired assembly.\" The success of this agenda will yield a useful class of robotic self-assembling structures as well as a theory for their design and operation.<br\/><br\/>The proposed research involves theoretical models from computer science, dynamical systems and control, robotics and embedded systems. Thus, the interdisciplinary education of students of all levels is required. To address this need, the PI will develop two new courses, on Self Organizing Systems and Specification and Control, and interdisciplinary collaboration aimed at creating graduate and undergraduate students well versed in computer science, robotics, controls and the information-rich physical settings in which these fields are increasingly applied. The PI recognizes that not all students have equal experiences leading up to and while in college. Therefore, the PI will collaborate with the University of Washington College of Engineering's Mathematics Engineering Science Achievement program to employ high school student interns in the PI's laboratory. Furthermore, to make the results of the proposed research and curriculum development accessible to the public, the PI proposes to create interactive demonstrations of SA and robotics more generally. This material will be made available on the web as well as in the PI's lab and will be used by the PI and his students for education and outreach in conjunction with the University of Washington Electrical Engineering Department's K-12 outreach program","title":"CAREER: Programmed Robotic Self Assembly","awardID":"0347955","effectiveDate":"2004-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549567"],"PO":["403839"]},"90483":{"abstract":"The proposed project addresses several challenging issues in multi-object tracking such as failure modes, occlusion, background clutter, varying object appearance, multi-object confusion, and high computational complexity. This project will investigate five key elements in multi-object tracking including (1) a trajectory tracking framework, (2) a joint multi-object representation, (3) image-based likelihood functions, (4) the integration of object detection in tracking, and (5) the compact and efficient discriminative feature tracking. Based on recent preliminary results, it is expected that significant improvements in multi-object tracking will be achieved by integrating these elements into the proposed probabilistic estimation framework. An experimental system for tracking multiple pedestrians and vehicles will be implemented for testing the developed algorithms. The proposed educational program will focus on developing graduate and undergraduate courses in the area of computer vision, establishing an active research laboratory in visual computing and human-computer interaction, and promoting collaboration with the industry to offer students the opportunities to work on real-world research problems.<br\/>Success of this project will provide a novel solution to the multi-object tracking problem and significantly advance the state-of-the-art. The proposed project is expected to have broader impacts in the areas of video surveillance, human-computer interaction, and intelligent teleconferencing. The proposed research will also have an impact on establishing an educational program in computer vision at the University of California, Santa Cr","title":"CAREER: Elements in Solving the Multiple Object Tracking Problem","awardID":"0348020","effectiveDate":"2004-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[237233],"PO":["564318"]},"90373":{"abstract":"Micro-air-vehicles (MAVs) are bird-sized platforms designed to fly in near-Earth environments like forests, buildings, tunnels and caves where often GPS, lighting and communication are poor and the flight spaces are cluttered. The fundamental gap in the knowledge base that prevents MAVs from becoming autonomous is the lack of flight data and sensor metrics. Without such data, designing sensor suites remains ad hoc and hapchance. Proposed is work that combines fundamental analytical, computational and experimental research towards the design, validation and flight-testing of sensor suites for MAVs. A novel lab-based test rig is designed to collect data and performance metrics under a wide range of gust and lighting levels in a controlled and repeatable manner. The rig serves as a tool to also test whether sensor designs and navigation principles that biomimic flying insects can reliably be applied to MAVs. Industrial and government lab collaborations buttress this proposal. Unique K-20 educational components complement this proposal and are capstoned by the first-ever indoor flying robot contest to coincide with the Wright Brothers Centennial.","title":"CAREER: Test Rig and Sensor Suite for Micro-Air-Vehicles Moving in Near-Earth Environments","awardID":"0347430","effectiveDate":"2004-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["492593","403839"],"PO":["564316"]},"90396":{"abstract":"Multimodal systems allow users to interact with computers through multiple modalities such as speech, gesture, and gaze. One challenge for multimodal systems is multimodal interpretation, which is the process of understanding what a user intends to communicate. Despite recent progress in multimodal interpretation, most systems still have problems handling unexpected or unreliable user inputs.<br\/><br\/>This project seeks to improve the robustness of multimodal interpretation through two objectives: 1) to adapt system interpretation capability over time through automated knowledge acquisition, 2) to optimize interpretation through probabilistic reasoning. Specifically, this research will develop supervised and unsupervised learning approaches to automatically acquire knowledge, both offline from annotated data and online from real time interactions. Furthermore, this project will develop mechanisms to account for uncertainties that occur at different stages in the interpretation process and to derive an optimal interpretation through probabilistic reasoning about context and user intent. To support these approaches, large corpora of multimodal data will be collected from human machine conversation and annotated in terms of user intent and interaction context.<br\/><br\/>This research will provide a benchmark for algorithmic advancement and evaluation. The enhanced robustness and reliability in multimodal interpretation will make multimodal systems more effective for real world applications. Through a multimodal conversation system that helps students explore options for undergraduate and graduate study at various institutions and locations, the results of this research will be directly applied to an education plan that includes outreach activities, curriculum development, and student mentoring. This tight integration of research and education will offer a unique multidisciplinary opportunity to synergize other programs within the university such as speech processing, psycholinguistics, and cognitive science.","title":"CAREER: Learning and Optimization for Robust Multimodal Interpretation in Conversation Systems","awardID":"0347548","effectiveDate":"2004-02-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["565127"],"PO":["565215"]},"92585":{"abstract":"Sign languages of the Deaf have extensive lexical inventories and use complex morphological and syntactic constructions like vocally produced languages do. However, unlike the production of spoken words, some categories of signs must be directed or placed in gradient meaningful ways. The American Sign Language (ASL) verb ASK, for example, must be directed toward the one asked - if present. There is no grammatical parallel for this in speech. When not physically present, signers conceptualize space as though missing entities were present. Several conventionalized ways of conceptualizing non-present entities as present have been identified. Once the one asked is conceptualized as present, ASK could be directed toward that spatially conceptualized entity. Although required and meaningful, these gradient aspects of signing are not symbolic. Thus, the ASL language signal includes gradience and gesture overlaid on symbolic signs.<br\/><br\/>This study examines the signing of two-, four-, and six-year-old Deaf children acquiring ASL. How these children direct signs when referents are physically present reveals the children's awareness of the spatial requirements of these signs. How children direct these signs when entities are missing provides evidence of the children's developing abilities to conceptualize space. The analysis should reveal an interaction between the developing ability to meaningfully direct signs and the developing ability to conceptualize missing entities as present. This research should shed light on the interaction of grammar, gesture and spatial conceptualization in the acquisition of ASL and thereby provide valuable new insights into the acquisition of a language that goes beyond lexicon and grammar.","title":"SGER: A Study of the Development of Children's Abilities to Conceptualize Space","awardID":"0401657","effectiveDate":"2004-02-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[242565],"PO":["565215"]},"90330":{"abstract":"CAREER: A Framework for Dynamic Self-Tuning of General Purpose Programs<br\/><br\/>Abstract<br\/><br\/><br\/>As computing systems become more complicated, they are exposing an increasingly large number of \"knobs\" that can be used for tuning. These knobs typically represent a trade-off (e.g., size vs. speed of a local data storage resource) and thus must be set differently for different workloads to achieve optimal performance (or power-performance). While many such knobs have been proposed, there has been little work towards a comprehensive approach to set these knobs automatically. The proposed research is meant to help fill this gap.<br\/><br\/>Specifically, this work proposes a dynamic self-tuning framework for optimizing the compilation of general-purpose programs. The proposed framework draws inspiration from the successes in empirical optimization frameworks like ATLAS, applying their ideas to a new context where optimization cannot be done at install time. By performing the tuning at run time, code can be optimized for specific input data (a necessity for non-numeric programs), but introduces challenges in maintaining low overhead and good performance in the presence on non-stationary workloads.","title":"CAREER: A Framework for Dynamic Self-Tuning of General Purpose Programs","awardID":"0347260","effectiveDate":"2004-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["539055"],"PO":["550859"]},"91452":{"abstract":"We are requesting funding for the second Workshop on Genomic Signal Processing and Statistics (GENSIPS), which is planned for May 26-28, 2004. The workshop will be held on the Homewood campus of The Johns Hopkins University, in Baltimore, Maryland. The aim of this three-day workshop is to provide a forum for presenting new results on genomic signal processing and statistics and identify potential areas of research and collaboration between the biological, statistical, and signal processing communities. The workshop has been approved as an IEEE Signal Processing Society cooperating meeting and has a significant tutorial component with the aim to educate, to bring awareness of genomics problems to the signal processing and statistics communities, and to stimulate collaborative research in this area. We are planning to invite ten internationally renowned researchers to deliver plenary talks covering all three areas of interest: biology, signal processing and statistics. Contributed poster sessions and a round-table discussion session will also be featured in the technical program. Support from DARPA, NSF and the Whitaker foundation is sought to help defray registration fees and travel expenses for invited speakers and a few students, as well as anticipated costs associated with the planning and the logistical issues related to holding a successful meeting.","title":"Workshop on Genomic Signal Processing and Statistics (GENSIPS); May 26-28, 2004; Baltimore, MD","awardID":"0352769","effectiveDate":"2004-02-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["517652","313579"],"PO":["564898"]},"94104":{"abstract":"This award is for funding to subsidize travel, conference, and housing expenses of students selected to participate in the ACL Student Research Workshop to be held during the joint ACL on July 21st to 26th, 2004 in Barcelona, Spain. The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing and language engineering. The Association's annual conference, which rotates among the Americas, Pacific-rim countries, and Europe\/Africa, is the major international meeting in the field. Computational linguistics is a multidisciplinary field of increasing importance to science, commerce, and society. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.<br\/><br\/>The workshop format allows students to present their research and receive feedback from a panel of established researchers in the field. It provides students with invaluable exposure to outside perspectives on their work at a critical time in their professional development through feedback from the panel and other student participants. Also, student participants will be able to see each other's presentations and feedback, which could lead to a general raising of standards and expectations, strengthening future student research. The ACL Student Workshop is an inexpensive yet highly effective means of encouraging young and upcoming computational linguists. The intimate format encourages the student participants to begin building a rapport with established researchers. The workshop should contribute to the maintenance and development of a skilled and diverse natural language processing workforce, helping to produce a pool of researchers with the scientific and engineering knowledge required for future applications of natural language processing. It should help to foster international scientific exchange, providing merit-based opportunities for future leaders of the field to attend a conference that might otherwise be less geographically diverse than is desirable for the field. In addition, by building a supportive environment for these students, it is more likely that down the road, they will lend a supporting hand to other students who follow.","title":"Workshop: Student Research in Computational Linguistics","awardID":"0408674","effectiveDate":"2004-02-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["496760"],"PO":[246649]},"90441":{"abstract":"Broad coverage dictionaries and ontologies for natural language processing (NLP) are difficult and costly to create and maintain by hand. It is therefore desirable to learn them from distributional information, such as can be obtained from unlabeled or sparsely labeled text corpora. Many linguistic and psycholinguistic theories are distributional, but emphasize local neighborhood structure more than do previous NLP approaches. Successful visualization techniques such as keyword-in-context also rely on the preservation of neighborhood structure. A similar emphasis is present in emerging techniques for data reduction, such as LLE and min-cut algorithms, whose application to language data the project is investigating.<br\/><br\/>While the immediate goal of the project is to gain a better understanding of lexical tuning and acquisition, the resulting dictionaries, ontologies and mapping techniques have the potential to help information professionals (such as librarians, translators, patent examiners and paralegal researchers) to navigate through corpora, to understand the significance of the data that they see, and to incorporate insights derived from the data into their working practice.<br\/><br\/>The PI and his students are also integrating computational linguistics into the undergraduate curriculum of the Department of Linguistics and creating new courses designed primarily to appeal to students majoring in the humanities in order to offer such students fresh options in meeting the scientific, mathematical, and quantitative components of the university's breadth requirement.","title":"CAREER Hybrid methods for acquisition and tuning of lexical information","awardID":"0347799","effectiveDate":"2004-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["384542"],"PO":["565215"]},"90398":{"abstract":"The ever-increasing demand for Internet bandwidth has renewed interest in photonic switching. This project aims to address the problem of switching speed in an optical network infrastructure within a rigorous framework that bridges research and education in several key areas of computer science and mathematics, including probabilistic methods, combinatorial analyses, switching theory, circuit complexity, and WDM network routing algorithms. An objective of the project is to completely characterize the trade-offs between various design options faced by photonic switch designers such as depth vs. size, and blocking behavior vs. cost.<br\/><br\/>The project involves the investigation of (a) novel WDM switching fabrics designs guided by practical criteria such as cost-effectiveness, speed, and scalability (b) models to analyze switches qualitatively and quantitatively using a graph-theoretic framework that also draws on techniques from circuit complexity and probabilistic methods (c) combinatorial models to probabilistically analyze switch designs and characterize design trade-offs, such as between cost and blocking behavior (d) online and offline routing algorithms that are formulated as problems in graph coloring.","title":"CAREER: Designs and Analyses of WDM Switching Architectures","awardID":"0347565","effectiveDate":"2004-02-15","expirationDate":"2010-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550386"],"PO":["565157"]},"90442":{"abstract":"The objective of this research program is twofold: first, to develop<br\/>and apply new computational inference methods for elucidating the<br\/>underlying mechanisms of complex biological systems, and second, to<br\/>develop and enhance a series of courses that incorporate various<br\/>aspects of computational biology into both the undergraduate and<br\/>graduate curricula.<br\/><br\/>Network inference methods based on dynamic Bayesian networks are being<br\/>implemented and extended to discover models of complex biological<br\/>systems. In addition, simulation systems capable of generating<br\/>biologically plausible data are being developed to evaluate and<br\/>improve the inference methods. The aim is to apply the most effective<br\/>methods to real experimental data to produce models of the underlying<br\/>biological systems. The inference methods being developed are widely<br\/>applicable to biological and non-biological problems where models of<br\/>complex systems need to be recovered from noisy or incomplete data.<br\/>Both the inference algorithms and the simulators are designed to be<br\/>flexible and adaptable to other systems.<br\/><br\/>Insights gleaned during the course of this research program are being<br\/>folded into new courses on machine learning and the dynamics of<br\/>complex biological systems. These courses are intended to accompany<br\/>the three existing computational biology courses previously developed<br\/>by the PI. Collectively, these five courses will contribute to<br\/>shaping both undergraduate and graduate programs in computational<br\/>biology at Duke University.","title":"CAREER: Computational Methods for Learning Dynamic Networks of Biological Regulation and Control","awardID":"0347801","effectiveDate":"2004-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":[237149],"PO":["565136"]},"90365":{"abstract":"Due to the difficulties in precisely computing some of the key<br\/>quantities, such as the channel capacities and the detection error<br\/>probabilities, most of the current analytical work in wireless<br\/>communications has been limited to asymptotic analysis in a number of<br\/>mutually separated regimes. As a result, the engineering conclusions<br\/>based on these studies are sometimes incompatible, making it hard to<br\/>apply the analytical results in the designs of practical systems. The<br\/>goal of this research is to develop novel approaches to address the<br\/>interactions among several key system parameters, to understand the<br\/>joint impacts of them, and to synthesize the different theoretical<br\/>results into one unified picture.<br\/><br\/>Specifically, this project studies the emerging new technologies in<br\/>multi-input multi-output (MIMO) channels and ultra-wideband<br\/>channels. Most current research on these systems has been focused on<br\/>different limiting cases, including high\/low signal power, wide\/narrow<br\/>bandwidth, and fast\/slow time-variation of the channel. Such<br\/>asymptotic analysis greatly simplifies the problems. However, since<br\/>usually one parameter is isolated and taken to its limit, the relation<br\/>among different parameters is sometimes distorted, resulting in<br\/>inconsistent conclusions. This project aims to solve such problems by<br\/>developing new approaches to asymptotic analysis that address the<br\/>interactions among several key system parameters, including channel<br\/>time-variation, power and energy efficiency, bandwidth scaling,<br\/>reliability and delay requirements, and peak-to-average ratio<br\/>constraints. A key component of the new approach is to take multiple<br\/>parameters to their limits together, but keep a carefully chosen<br\/>relation among them. Such an approach, while maintaining the<br\/>simplicity of the asymptotic analysis, helps to describe a continuum<br\/>that bridges the gap between the current results for different extreme<br\/>cases.","title":"CAREER: Towards Unified Theory of Wireless Communications","awardID":"0347395","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["530080"],"PO":["432103"]},"90376":{"abstract":"The quantitative modeling and automatic extraction of semantic information (objects, actions, and events) from images or videos has traditionally been a difficult and intriguing problem for scientists and engineers who are interested in system automation, human machine interface, machine intelligence, and information technologies. The basis for this difficulty, and interest, is largely attributed to physical, spatial, and dynamical complexity of visual patterns (of a shape or a process): high dimensionality and inherent variability in photometry, geometry, and dynamics are just a few of such characteristics. The proposed research program aims to tackle this complexity and variability by exploiting invariant properties in spatial and dynamical patterns that can be modeled as a hierarchy of discrete and continuous symmetries in the geometry, dynamics, and physics of visual patterns commonly encountered in an urban environment. Domain knowledge from photometry, multiple-view geometry, and systems theory will be used to analytically model and study both spatial and dynamical symmetries encoded in the visual data, and efficient numerical algorithms will be developed to detect such symmetries directly from images. High-level semantics of the images or videos can therefore be identified, inferred, or learned by machines more efficiently at the level of symmetries. We envision that such a modeling paradigm will marry the benefits of both analytical modeling and statistical inference techniques and significantly reduce the complexity in modeling, analysis, and computation. It will be the key to the success of developing efficient, accurate, and robust vision systems for identifying a wide range of objects, actions, and events in an urban environment. <br\/><br\/>Direct outcome of the proposed research program will be scalable algorithms that can automatically generate three-dimensional geometric models from images or efficient systems that can identify in human actions and events from a large array of video input. Such algorithms will greatly facilitate applications such as security surveillance, traffic\/environmental monitoring, automatic mapping of urban areas, vision-based navigation and coordination of autonomous robots, instant sports coverage\/broadcast, movie edition\/video indexing, and medical image analysis. Along with an increasing interest in the relations between symmetry and perception in cognitive science and psychology, the results from this program will also help provide an analytical and computational basis for the scientific study of biological and artificial visual perception in general. On the education end, the proposed research program provides unique opportunities for the development of new interdisciplinary courses that integrate scientific methods, mathematical skills, computational techniques, and laboratory experiments across multiple scientific and engineering disciplines, including computer vision, systems theory, and machine learning. These courses will help transform and enhance future college engineering education in robotics, machine vision\/learning, and image processing. The illustrative examples and computer programs to be developed can also help teach many basic and important geometric concepts to high school students or to the general public through association with common visual experience and phenomena.","title":"CAREER: Identifying Spatial and Dynamical Patterns from Images","awardID":"0347456","effectiveDate":"2004-02-01","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["311520"],"PO":["564318"]},"92302":{"abstract":"The University of Hawaii has established a partnership with the Industry\/University Cooperative Research Center (I\/UCRC) for Telecommunications Circuits and Systems at Arizona State University known as \"Connection One\". The Hawaii Center for Advanced Communications will provide the capabilities, expertise, and research facilities for doing the research. The vision for the next generation wireless communications technology calls for fully integrated, low cost, expanded broadband and high data rate applications\/services, seamless hands-off between heterogeneous networks, full mobility with minimum latency. These constraints make it exceedingly difficult to design affordable wireless systems. Confronting these technology challenges will require breakthroughs and innovative multidisciplinary research contributions across the multi-layer wireless communication network system.","title":"University of Hawaii Partnership with the NSF I\/U CRC for Telecommunications Systems","awardID":"0400575","effectiveDate":"2004-02-15","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"7218","name":"RET SUPPLEMENTS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["328464","498056","451433","78843",241866],"PO":["565057"]},"81797":{"abstract":"The emergence of computational Grids and the potential for seamless aggregation, integration and interactions has made it possible to conceive a new generation of realistic, scientific and engineering simulations of complex physical phenomena.<br\/><br\/>These applications will symbiotically and opportunistically combine computations, experiments, observations, and realtime data, and will provide important insights into complex systems. Furthermore, the underlying Grid infrastructure is similarly heterogeneous and dynamic, globally aggregating large numbers of independent computing and communication resources, data stores and sensor networks. The combination of the two results in an application development, configuration and management complexities that break current paradigms based on passive components and static compositions. This projectwill make the following specific contributions:<br\/><br\/>1. Definition of Autonomous Components: We will define programming abstractions and supporting infrastructure that will enable the definition of autonomous components. Together, the aspects, policies, and policy engine allow autonomous components to consistently and securely configure, manage, adapt and optimize their execution.<br\/>2. Dynamic Composition of Autonomic Applications: We will develop mechanisms and supporting infrastructure to enable autonomic applications to be dynamically and opportunistically composed from autonomic components. The composition will be based on policies and constraints that are defined, deployed and executed at run time, and will be aware of available Grid resources (systems, services, storage, data) and components, and their current states, requirements, and capabilities.<br\/>3. Online Performance Modeling of Component-based Applications: We will investigate the formulation of<br\/>predictive performance functions that hierarchically combine analytical, experimental and empirical performance models for application components and elements of the Grid. <br\/>4. Autonomic Middleware Services: The project will design, develop and deploy key services on top of the emerging Grid middleware infrastructure to support autonomic applications. One of the key requirements for autonomic behavior and dynamic compositions is the ability of the components, applications and resources (systems, services, storage, data) to interact as peers. Furthermore the components should be able to sense their environment. The project will extend the Grid middleware with (1) a peer-to-peer substrate, (2) context aware services, and (3) peer-to-peer deductive engines for composition, configuration and management of autonomic applications. An active peer-to-peer control network will combine sensors, actuators and rules to configure and tune components and their execution environment at runtime and satisfy requirements, and performance and quality of service constraints.","title":"NGS: Collaborative Research: An Autonomic Component Framework for Grid Applications","awardID":"0305495","effectiveDate":"2004-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["558205"],"PO":["551712"]},"90388":{"abstract":"This project aims to develop a tighter integration of generative (e.g., Bayesian networks) and discriminative (e.g., support vector machines) machine learning. These two types of learning are typically not integrated in current practice and are often seen as competing approaches; however, such integration is crucial in complex multi-disciplinary domains, such as vision, speech, and computational biology, where scientists have real expertise and exploitable knowledge about elaborate systems yet also need machine learning to achieve optimal performance for specific tasks. This project's integrated generative-discriminative framework will allow practitioners to flexibly design and structure a given learning problem using generative tools like Bayesian networks and then to maximize the performance of these models using discriminative methods like maximum entropy and probabilistic kernels. This framework will be used in computer vision tracking applications and in classification of gestures. In a laparoscopic robotic surgery platform, the methods will be used for classifying surgical drill movements and predicting surgeon dexterity level. The project's unified approach will be used to create a more comprehensive machine learning course experience for students, complete with online class materials, visual demonstrations and software toolkits.","title":"CAREER: Discriminative and Generative Machine Learning with Applications in Tracking and Gesture Recogniton","awardID":"0347499","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T471","name":"CIA-KDD WORKING GROUP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"T028","name":"CIA-KDD WORKING GROUP"}}],"PIcoPI":["541923"],"PO":["564316"]},"86429":{"abstract":"PI: Lawrence A. Hornak, West Virginia University<br\/><br\/>Biometric systems automatically measure a physiological or behavioral \"signature\" of an individual, from which a decision can be rendered to either authenticate or determine the identity of that individual. In this way, biometric systems provide the means to bind the physical presence of an individual user with her cyber action. Despite the increasing use of these systems, neither an analytic framework for modeling and predicting their performance, nor a set of standard data available to researchers for testing purposes is available. <br\/><br\/>This research addresses these deficiencies by determining an analytic framework in which the performance of biometric systems can be modeled and predicted, removing key barriers to biometric system performance through research in multibiometrics and effective vulnerability countermeasures, and understanding the relationships among biometric applications, privacy, security, and user acceptance that are essential for both informed public policy and system design. Addressing this interrelated set of key technical barriers and societal issues will advance the understanding of biometric system acceptance, performance, and design, and will enable trustworthy authentication and identification functions essential to pervasive computing and supporting homeland security needs. The data sets generated by the coordinated tasks of this research are also being made available as a resource to the biometrics research, developer, and user communities.","title":"ITR Collaborative Research: Biometrics -- Performance, Security and Social Impact","awardID":"0325333","effectiveDate":"2004-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H280","name":"US DEPT OF HOMELAND SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H342","name":"DEPT OF HOMELAND SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T780","name":"DHS-BIOMETRICS PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V962","name":"HOMELAND SECURITY-BIOMETRICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"V462","name":"HOMELAND SECURITY-ARMY-HOMELAN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"V466","name":"HOMELAND SECURITY ARMY-HOMELAN"}}],"PIcoPI":["334363","560284","535233"],"PO":["565264"]},"90323":{"abstract":"During emergencies, communication networks are characterized by their high degree of variability in terms of link failure and packet loss. However, current Voice over Internet Protocol (VoIP) methods deliver dissatisfactory performance during emergencies, lacking both the agility to adapt to demanding network conditions, and a systematic framework for measuring voice Quality-of-Service (QoS). The goal of this research is to provide a VoIP framework and methods suitable for demanding network situations. By furnishing methods for achieving voice communication during emergencies or other demanding situations such as distance-learning, this research will provide an immeasurable benefit to society.<br\/><br\/> The highly dynamic nature of channels and networks necessitates cross-layer design approaches in which parameters across all layers of a protocol stack are optimized to efficiently maximize application QoS. To integrate VoIP into a cross-layer design framework, this research offers a new paradigm for speech and audio coding together with several novel error control and transmission methods. In particular, this research provides a functional layering approach to speech and audio coding, breaking up the operation of the coder into three ascending, hierarchical layers: the Waveform Layer, the Statistical Layer, and the Expected Distortion Layer. At the Waveform Layer, a signal is decomposed into perceptually relevant objects whose evolution through time is tracked at the Statistical Layer. Quantization is performed at the Statistical Layer with direction from the Expected Distortion Layer. The Expected Distortion Layer calculates voice QoS for various coder, error-control, and transmission parameter settings, allowing cross-layer optimization based adaptive resource allocation. This paradigm engenders a unique unified model for coding and packet loss concealment, enabling perceptually-adaptive packet protection, transmission, and traffic engineering over time-varying heterogeneous wired and wireless networks.","title":"CAREER: Agile Speech and Audio Coding and Transmission over Heterogeneous Networks","awardID":"0347229","effectiveDate":"2004-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["560252"],"PO":["432103"]},"95329":{"abstract":"This is funding to support a research symposium (workshop) of approximately 15 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the 6th International ACM SIGCAPH Conference on Assistive Technologies (ASSETS'04), to be held October 18-20 in Atlanta, and sponsored by the Association for Computing Machinery's Special Interest Group on Computers and the Physically Handicapped. The ASSETS conference is the premier forum for presenting research results and innovations in software and technology designed to address the special needs of people with disabilities of all kinds. Researchers and developers from both academia and industry around the world will meet to exchange ideas and present reports on the latest work relating to speech, motor, hearing, and vision impairments, cognitive limitations, emotional and learning disabilities, and aging. The ASSETS'04 doctoral research symposium will provide an opportunity for graduate students to explore their research interests in an interdisciplinary workshop, under the guidance of a panel of distinguished experts in the field. Student participants will make formal presentations of their work during the symposium, and will receive constructive feedback from a faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the symposium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will expose these promising young researchers to a larger community. Evaluation of the symposium will be conducted, and the results made available to the organizers of future such events.<br\/><br\/>Broader Impacts: The doctoral symposium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Doctoral Consortium for Research In Universally Accessible IT","awardID":"0414560","effectiveDate":"2004-02-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["333704"],"PO":["565227"]},"89906":{"abstract":"Characterization of the Acidovorax-Earthworm Association<br\/>David A. Stahl<br\/>University of Washington<br\/><br\/>The common earthworms (lumbricids) are among the most well recognized of soil-dwelling animals. Favored by gardeners for their composting abilities, they are active in altering soil structure and nutrient availability in soils throughout the world. Soil transformation is not solely due to the earthworm, but is assisted by microorganisms living in association with the worm. The best understood associations occur in the worm's digestive system. The worm's gut selects for a variety of microbial populations and activities not prevalent in the soil. A much more specific association is found in the worm's waste fluids elimination system. Each segment of the worm contains a pair of internal kidney-like organs (nephridia) adjacent to the body wall (ca. 200 nephridia per worm) that eliminate fluids (\"urine\"). Unlike the diverse microbiota of the gut, a single species of microorganism is present as a dense population in each nephridium. This appears to be a stable and specific association since different species of earthworm harbor different symbiotic Acidovorax species. The character of this association and the bacterial contribution to the development, physiology, and excretion chemistry of the host are virtually unexplored. The main objectives of this project are to resolve the early events of colonization and determine the contribution of bacteria to host physiology, including symbiont-conferred changes in host tissue architecture. These studies are enabled by the ability to maintain the full life cycle of the worm (Eisenia foetida) in the laboratory, and the recent success of these investigators in resolving and reforming the symbiosis. The worm can be \"cured\" and later reunited with its symbiont by inoculating egg capsules with symbiotic bacteria propagated in pure culture. This offers the opportunity for experimental manipulation of each stage of the symbiosis. A combination of analytical chemistry, molecular genetics, and microscopy (confocal laser scanning microscopy and electron microscopy) will be used to characterize the association. The bacterial contribution to the earthworm fluid chemistry and tissue architecture will be evaluated by comparing worms with and without their symbionts during development and at adulthood. The contribution of the bacteria to the overall fitness of the worms will be evaluated by comparisons of growth rates, reproduction rates and response to certain environmental stresses of worms with and without their symbionts. Characterization of bacterial symbiont in pure culture will be used to identify metabolic traits relevant to waste transformation. Genetic modification of the symbiont will also be evaluated. The development of tools for genetic manipulation would greatly enable more highly refined studies of microbe-animal associations, including the identification of factors governing the specificity of colonization. The results from this work will contribute to an understanding of the physiology and chemistry of this abundant, widespread and ecologically significant member of soil systems. More generally, this symbiosis could provide a new model system for resolving basic features of the most common type of interaction between animals and bacteria, host epithelial tissues colonized by extracellular, gram-negative bacteria.","title":"Characterization of the Acidovorax-Earthworm Association","awardID":"0345049","effectiveDate":"2004-02-15","expirationDate":"2009-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T489","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1148","name":"ECOLOGICAL & EVOLUTIONARY PHYS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"7474","name":"ENVIRON & STRUCTURAL SYS CL"}}],"PIcoPI":["521577","431445","420964"],"PO":["401557"]},"86518":{"abstract":"The design and development of future wireless networks and services will require<br\/>sophisticated simulation and emulation tools that captures the scale, complexity, and<br\/>abstraction of both the protocols that constitute the multi-layered network stack, as well<br\/>as the heterogeneous nature of the wireless and wired Internet - tools that currently do<br\/>not exist. Future simulation strategies must capture the heterogeneity of evolving<br\/>protocols while simultaneously supporting high-fidelity wireless modeling environment.<br\/>This proposal will build a comprehensive Integrated Protocol Development Environment<br\/>(IPDE) to support design and development of wireless network protocols. This work will enable<br\/>researchers to design and develop end-to-end network applications in a unified public-domain simulation and emulation environment.<br\/><br\/>Two key innovations in this proposal that will empower real time test and emulation of<br\/>future wireless applications include (i) the notion of relativistic time, that integrates the controllability of virtual-time with the natural selfsynchronizing property of real-time, and (ii) spatial scaling, where<br\/>various components of the system will operate at different spatial scales - ranging from<br\/>continuous fluid flow models for the Internet backbone, to discrete packet data flows in<br\/>actual routers - with overall spatial coordination occuring in a decentralized manner.<br\/>Validation of such an IPDE framework will be in the form of the design and deployment<br\/>of multiparametric adaptive algorithms for wireless network scheduling and control.<br\/>By providing an integrated framework for simulation, hardware emulation, and direct<br\/>code execution of network protocols, the IPDE will enable researchers to setup large<br\/>scale virtual test-beds, validate their modeling, and design middleware algorithms.","title":"Collaborative Research: ITR\/NGS: Fast Wireless Network Simulation Using Spatio-Temporal Dilations","awardID":"0325788","effectiveDate":"2004-02-15","expirationDate":"2008-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["550857","560222"],"PO":["551712"]},"90335":{"abstract":"Lewis, Christopher<br\/>University of Pennsylvia<br\/>CCF-0347290<br\/><br\/>Parallel programs are notoriously difficult to write and growing<br\/>application requirements (e.g, ease of development, reliability,<br\/>security, etc.) are only exacerbating the problem. Ad hoc dynamic<br\/>techniques that observe, limit, or otherwise control running<br\/>applications (e.g., array bounds checks, assertions, bug isolation) have<br\/>helped satisfy some of these requirements in sequential programs, but<br\/>performance overhead and implementation challenges have limited their<br\/>general utility. This research develops and evaluates<br\/>supplement-oriented programming as a programming paradigm for<br\/>conveniently and efficiently enhancing parallel systems with dynamic<br\/>checks and monitors. Supplement-oriented programming is a style of<br\/>programming in which abstract computations (called supplements)<br\/>implement supplemental behaviors that are added to a running application<br\/>in order to dynamically observe, limit, or control it without changing<br\/>its core functional behavior. Supplement-oriented programming<br\/>transforms the use of supplemental behaviors from an awkward, ad hoc art<br\/>to a well-supported programming paradigm. The logical separation of<br\/>functional and supplemental behaviors allows for simpler<br\/>supplement-enabled programs, plug-and-play supplement libraries,<br\/>language and tool-based support, and (ultimately) higher quality, easier<br\/>to build parallel programs. This work also explores novel<br\/>implementation techniques, such as backfill processing, that efficiently<br\/>implement supplements using the often underutilized parallel resources<br\/>of typical systems.<br\/><br\/>Supplement-oriented programming is an enabling technology. It will not<br\/>only improve the robustness of parallel software, it will allow people<br\/>with broader abilities, interests, and backgrounds to use parallel<br\/>systems, magnifying their creative power so that they may find new and<br\/>important uses for these machines.","title":"CAREER: Take Your Vitamins: Robust Parallel Software Through Supplement Oriented Programming","awardID":"0347290","effectiveDate":"2004-02-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[236924],"PO":["565272"]},"90478":{"abstract":"This research comprises projects that focus on two aspects of computer-assisted music making: expression synthesis using a driving (steering wheel and pedals) interface; and collaborative performance assessment. The common motivator in both cases is the performer (the pilot of the expression synthesis machine, or the ensemble musicians). The human performer is the engineer of expressive performances and creator of coordinated interpretations in ensemble playing. Incorporating the counsel of the performer is critical to the success of systems for generating, tracking and assessing single- or multi-player performances. A performance is the result of analysis, and decisions based on the analysis. This process will be studied through computational models of music perception and cognition, based in part on the PI's prior work relating to a representation for tonality called the Spiral Array model. Developing the quantitative tools for music analysis will form the foundation for the testbed applications.<br\/><br\/>The Expression Synthesis Project (ESP) will support a driving interface that will enable non-experts to create expressive musical performances. Anecdotal evidence amongst musicians suggests that generating an expressive performance is very much like driving a car. Not everyone can play an instrument, but almost anyone can drive a car. In the first instantiation of the ESP interface, the pedals will allow the user to control the tempo (speed). The display will show landscape that directly map to musical content (extracted through computational analysis), so as to guide the expressive decisions. By relating preferred renditions of a piece to musical structure, we can better understand and explain human creativity through music performance. When the technology matures, plans to create an interactive ESP museum installation will commence.<br\/><br\/>The Collaborative Performance Assessment (CPA) project will create metrics and systems for measuring temporal and contextual synchronization in collaborative performance. The most immediate application of the technology is to distributed collaborative performance. Ensemble playing requires coordinated decision-making amongst performers. In score-based music, the ensemble players' tempo and timing of expressive (musical) gestures must agree. In improvised music, the chords and transitions must also be synchronized. CPA tools will provide feedback to ensemble players to help them identify and solve problems so as to play together better. In remote collaborations, the tools will be used to quantify the effects of latency and presence, and to guide the design of distributed immersive performance systems.<br\/><br\/>Broader Impacts: Expressive performance is usually only accessible to expert musicians after many years of practice. The ESP interface will allow expressive decisions to be explored long before (or without) the mastery of an instrument or a piece. Furthermore, a musical score is only an approximate representation of a composer's creation. Most composers are not expert performers, so the realization of their creation must be left to musicians' interpretations in live performance. The ESP system will allow composers to record their expressive intent precisely. The system will furthermore present a more intuitive interface for linking music to video and for creating coordinated music and picture in movies, and thus will inspire new entertainment technologies. CPA tools will give remote regions access to artistes, bands and orchestras that would normally not pass their way. They will enable distributed recordings to take place, allowing musicians to reduce their time on the road. The PI plans to organize performances and demonstrations showcasing distributed and local collaborations, to disseminate research results. With diminishing funding for the arts, technology-driven music applications such as those to be developed in this research will become a prime motivator for music education in schools.","title":"CAREER: Performer-Centered Approaches to Computer-Assisted Music Making","awardID":"0347988","effectiveDate":"2004-02-01","expirationDate":"2013-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[237222],"PO":["565227"]},"90379":{"abstract":"Using force and tactile (haptic) feedback, humans are able to accomplish complex exploration and manipulation tasks in unstructured environments, even when other sensory modes are limited. However, we cannot reach environments that are remote in space and\/or scale, such as outer space, under bodies of water, and inside the human body. The proposed research activity will harness the extraordinary ability of human exploration through novel telemanipulation systems. The intellectual merit is that controls, human factors, and modeling techniques will be used to develop versatile, practical telemanipulators that provide appropriate haptic feedback to the operator and automatically generate detailed haptic models of explored environments. A set of crucial telemanipulation issues will be addressed: (1) sensor\/actuator asymmetry, which is necessary for practical implementation in many applications, (2) the roles of level and degrees of freedom of haptic feedback during teleoperated haptic exploration, and (3) the design and control of virtual fixtures that assist in teleoperated exploration, while not interfering with the operator's perception of the remote environment. The broader impacts of this work are safety for humans working in hazardous environments and improved health care through robot-assisted surgery. Specific education goals are to create haptic laboratories and public displays that use the sense of touch to improve scientific understanding and interest in technology","title":"CAREER: Haptic Exploration and Modeling of Unknown Environments","awardID":"0347464","effectiveDate":"2004-02-01","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["520895"],"PO":["564316"]},"90402":{"abstract":"CAREER: Future Values: Reshaping the Future of Instruction Level Parallelism<br\/><br\/>Abstract<br\/><br\/><br\/>This research aims at providing an effective solution to the fetch problem of instruction level parallel processors. With the concept of \"future values\", one can represent traditional programs in a new control-flow form such that on any control flow path the data-flow aspect of the computation is either traditional (i.e., definition of a value precedes its consumers), or reversed (i.e., consumers of a value precedes its definition). The representation hence allows ordering of instructions even when the data dependencies would prohibit doing so in a control-flow graph. As a result, it is possible to seamlessly exploit control independence, use predication to eliminate any branch instruction, and design processors, which can reuse the internally generated dataflow graph as another source of instructions. <br\/><br\/>This approach has the potential to significantly impact the design of processors and optimizing compilers, and positively affect every field of science and commerce that relies on processor performance. The project will also result in course materials and software tool sets that will be made publicly available. Finally, the project will contribute greatly to the development of the recently initiated Computer Science Ph.D. program at Michigan Technological University.","title":"CAREER: Future Values: Reshaping the Future of Instruction Level Parallelism","awardID":"0347592","effectiveDate":"2004-02-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["485798"],"PO":["559883"]},"90413":{"abstract":"The goal of this research is to develop algorithms with rigorous performance guarantees for core machine learning tasks. Although the most common guarantee in the current literature is that of local optimality in the solution space, this project aims to use stronger performance criteria, such as quantitative bounds on the ratio by which the cost of the learned solution exceeds that of the global optimum, both to guide the development of new algorithms and to compare existing ones. This project will focus on two canonical unsupervised learning tasks: hierarchical clustering and learning the structure of directed probabilistic (Bayesian) nets. Both models are already in widespread use for analyzing massive data sets; better algorithms will increase their effectiveness and reliability, and will involve technical tools that are likely to be of broader use for other machine learning and statistical tasks. The results of this research project will be integrated into a new course that focuses on algorithmic aspects of machine learning; the resulting educational materials will be made available to the academic community.","title":"CAREER: Algorithms for Unsupervised Learning","awardID":"0347646","effectiveDate":"2004-02-15","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["525613"],"PO":["564316"]},"90457":{"abstract":"This project is about analyzing high-dimensional motion (HDM) from video. HDM refers to various complex motions with high degrees of freedom, including the articulation of human body, the deformation of elastic shapes and the multi-motion of multiple occluding targets. The goal of this project is to overcome the curse of dimensionality embedded in this challenging visual inference problem, by systematically pursuing a new distributed\/collaborative approach that unifies various HDMs. <br\/><br\/>Substantially different from centralized methods, the new approach distributes HDM into a networked representation of subpart motions, based on Markov network models. Then the prohibitive HDM inference tasks can be effectively and efficiently fulfilled by the \"collaborations\" among the distributed but mutually constrained small-scale visual inference processes, as revealed by the proposed theoretical study of this model and implemented by the proposed collaborative particle network algorithms. This new approach is expected to be significantly more efficient, more scalable and flexible, and more robust. This project has impact on intelligent video surveillance by making possible fast and accurate human tracking and detection techniques, and significantly benefits the research of human-computer interaction and medical imaging.<br\/><br\/>The research is linked to educational activities aiming at the promotion of learning and innovation through (1) developing an integrated curriculum for visual computing and statistical modeling; (2) motivating students to explore the unknown frontiers via innovative course projects and real-world applications; (3) outreaching to other related research communities via conferences and websites; (4) disseminating the research to the general public, female and minority students by creating Vision OpenHouse events.","title":"CAREER: Visual Analysis of High-Dimensional Motion: A Distributed\/Collaborative Approach","awardID":"0347877","effectiveDate":"2004-02-01","expirationDate":"2012-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["182691"],"PO":["564316"]},"90259":{"abstract":"In this project, the PI will develop a System for Assisted Navigation of Dynamic and Complex Environments (SANDEE) that will significantly increase navigation effectiveness for the visually impaired in dynamic and complex indoor and outdoor environments. Specific goals are: To develop new localization, orientation, and wayfinding algorithms; To develop new sensor fusion algorithms; To design lightweight wearable wayfinding toolkits for the visually impaired; To design multi-modal communication interfaces; To test the technology on the target population of visually impaired users; And to mentor and train young scientists in assistive technology research.. Critical aspects of navigation effectiveness will be systematically evaluated through longitudinal user studies.<br\/><br\/>This project will significantly advance our understanding of: localization, orientation, and wayfinding; audio representation of environments; sensor fusion; multi-modal user interfaces; and pervasive computing. Current navigation technologies can be quite error-prone and inflexible due to their tendency to rely on one type of sensor. The PI's premise is that in many environments exploiting a broad range of sensor types will lead to superior navigation effectiveness. Current navigation technologies require that the user commit to a specific communication model. The PI expects to show that multi-modal communication interfaces reduce the user's navigation-related cognitive load, and allow him\/her to add intelligence to the system dynamically. Existing navigation technologies for the visually impaired rely on body sensors, or sensors embedded in the environment. This project will demonstrate that, in unfamiliar indoor environments, better navigation effectiveness and user satisfaction are achieved through the use of mobile robotic guides. To achieve these objectives, a particularly challenging tasks the PI will address include the design and implementation of robust localization, orientation, and wayfinding algorithms that integrate information from multiple sensors, the design and development of multi-modal communication interfaces, and the evaluation of the human ability to learn and adjust critical aspects of the system and to use the system on a continuous basis.<br\/><br\/>Broader Impact: This project will develop new assistive technology for the visually impaired. Individuals with vision loss will be included in this project at all stages, both as researchers and as participants in longitudinal evaluation studies. Both undergraduate and graduate students will be involved in the PI's research activities, and the findings will be integrated into the university coursework. Software and hardware innovations resulting from this research will be documented and, in the case of software, distributed over the Internet to the target population, the scientific community, and the general public.","title":"Career: Assisted Navigation In Dynamic And Complex Environments","awardID":"0346880","effectiveDate":"2004-02-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[236764],"PO":["565227"]}}