{"19290":{"abstract":"Recently, a new threat model has been discovered which can be used to break many existing cryptographic protocols. The threat is based on the fact that certain hardware may be induced to perform miscalculations. This scenario is applicable to tamper proof devices which can be made to miscalculate by operating them in an extreme physical environment. The possibility of attacking various cryptographic protocols using hardware faults raises many interesting open problems. First, it now becomes desirable to construct efficient schemes which are resistant to attacks using hardware faults. The project will develop the theory necessary to prove the fault resistance of certain schemes. Other cryptographic schemes will be analyzed to determine whether they are susceptible to the new attack. The hardness of factoring integers is a standard cryptographic assumption. Various mathematical implications of this assumption will be studied. The previous results show that the hardness of factoring implies that polynomials having many roots in low algebraic extensions of the rationals are hard to evaluate. Generally speaking, criteria for when polynomials are hard to evaluate are useful in many applications. Further applications of the hardness of factoring will be studied. Specifically, the goal is to construct new classes of polynomials which are hard to evaluate, unless factoring is easy. There are several such candidates, for example, certain polynomials which generate Galois extensions over the rationals. Estimating the difficulty of evaluating certain polynomials based on the type of number fields they generate is a promising area of research. Such results will hopefully shed light on the complexity of evaluating polynomials.***","title":"Proposal for Research on Fault Resistant Cryptography and the Hardness of Factoring","awardID":"9700283","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["400310"],"PO":["528421"]},"19480":{"abstract":"CDA-9700866 Papamarcou, Adrianos Farvardin, Nariman Geraniotis, Evaggelos Tassiulas, Leandros Tretter, Steven University of Maryland-College Park Indoor Wireless Project This project addresses the problem of effectively educating seniors and beginning graduate students in the fundamentals of wireless communication technology. The project will provide hands-on learning in the context of a course title Indoor Wireless Project. The course will be taught by the team of PI's who are actively engaged in research in wireless communications and have significant experience in hardware implementation of communication and digital signal processing systems. The project will carry two credits per semester and will require a two-semester commitment from participants. It will be offered in two sections accommodating a total of 24 students, who will be working in teams of three. Graduate students involved in parallel research efforts will also participate. The overall goal will be to design, implement and test an indoor wireless network for two-way voice communication, data transfers and (eventually) video transmission on an adaptable hardware platform based on programmable digital signal processor chips. The first-year goal will be to implement and test a simplex wireless link between two portables, i.e., one transmitting and the other receiving. For the second year, the goal will be to implement a working wireless network consisting of a base station and four portables in a star configuration. For the third year of the effort, the goal will be to refine the platform to enable simultaneous real-time voice, data and video transfers among the portables, possibly using different system implementations. The project will continue evolving after the third year as a regular course in the electrical engineering curriculum. The Indoor Wireless Project will generate software and written reports which will be electronically disseminated to the academic community. It will also result in the creation of a virtual wireless lab site on the World Wide Web. The effectiveness of the project will be evaluated in terms of the project's output, the participants' subjective evaluation and long-term career profiles, and the project's impact on the academic community at large.","title":"Combined Research-Curriculum Development: Indoor Wireless Project","awardID":"9700866","effectiveDate":"1997-04-15","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":[49421,"446637",49423,"158256","69356"],"PO":["551712"]},"16492":{"abstract":"Modern higher-order languages such as Scheme and Standard ML provide simple but powerful tools for controlling complexity through abstraction. For twenty years, a major goal for research on these languages has been the development of implementation techniques that bring their performance closer to that of lower level languages. This project will study techniques for optimizing the use of memory in higher- order programming languages, using a combination of theoretical and experimental techniques. Specific activities include: (1) Development of theoretical methods for proving the correctness of storage optimizations in compilers. (2) Proof of correctness of several variations of aggregate update analysis and their associated transformations. (3) Analysis and experimental investigation of new algorithms for generational garbage collection. ***","title":"Heap Storage Optimizations and Their Semantics in Higher-Order Languages","awardID":"9629801","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["370419","186582"],"PO":["150697"]},"23292":{"abstract":"*** 9712586 Atkins This workshop is the first phase of a process to assist in defining a multi-faceted research agenda in the general area of advanced global information and knowledge work environments -- environments to support people (as individuals and members of groups) in the entire life cycle of information\/knowledge creation, dissemination, access, preservation, and use. Such environments are enabled by the coalescence of computation, communication, and integrated media, driven by increasingly powerful and ubiquitous hardware. Realizing the full potential of the technology, however, requires a holistic approach which considers both technical and social\/behavioral\/cultural factors. It will particularly include consideration of the current NSF\/DARPA\/NASA Digital Library Initiative (DLI) in terms of what has been accomplished, learned, demonstrated and what does this suggest about the need for follow-on activities. ***","title":"Invitational Workshop on Research Agenda for Distributed Knowledge Work Environments; Santa Fe, New Mexico","awardID":"9712586","effectiveDate":"1997-04-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["209323"],"PO":["433760"]},"19970":{"abstract":"For about the last forty years, Positron Emission Tomography (PET) has been used to assess biochemical processes in the human body. Using data obtained from PET scanners, reconstruction algorithms generate images that contain important information about the functionality of an organ or region of interest. This research involves the development of fast, robust reconstruction algorithms that provide accurate PET images. With more accurate images, physicians and researchers will be able to better understand the functionality of vital organs; and subtle differences between healthy and unhealthy tissue would become more distinguishable. The knowledge gained through the research will be shared with both undergraduate and graduate students. In particular, undergraduate students from under-represented groups will be mentored through summer research programs and senior projects. To reconstruct PET images, the investigator is undertaking a two part strategy. First, Poisson noise in the data is reduced using a modified wavelet denoising method. Specifically, a variance stabilizing transformation, known as Anscombe's transformation, is applied to the data to convert the Poisson noise to Gaussian noise with mean zero and variance one. The transformed data is then further processed using a well-known wavelet denoising method due to Donoho and Johnstone. Once the Poisson noise has been reduced, the desired images are reconstructed using set theoretic estimation methods. An advantage of using a set theoretic formulation is that it is flexible enough to incorporate all available a priori information and to address the uncertainty in the transmission data used to correct errors due to attenuation. The resulting algorithms will be tested using real phantom and subject data from PET centers at the Massachusetts General Hospital in Boston, MA and Emory Hospital in Atlanta, GA.","title":"CAREER: Set Theortic Methods for Reconstructing PET Images From Denoised Data","awardID":"9702856","effectiveDate":"1997-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["531008"],"PO":["564898"]},"14130":{"abstract":"An important recent advance in prediction has been the discovery that getting multiple versions of a predictor and then combining these can lead to dramatic reductions in error rates. Examples are bagging (Breiman) and Adaboost (Freund and Schapire). What is not clear is the mechanism behind these reductions, and this is a main problem in our research. Work by Shang and Breiman show that it is possible to grow binary trees that have considerably lower error rates than trees grown the standard way, i.e. CART or C4.5. This method uses the training set to estimate the input-output distribution and then uses this distribution to grow the tree. More research is necessary to make it robust and efficient. Currently, complex medical studies are analyzed using a class of simple models that depend on estimating parameters in a single linear combination of the input variables. Another research direction is the adaptation of the more general predictive methods developed in machine learning to the analysis of medical data. This research will result in improved prediction methods in combining many predictors, in growing a single binary tree, and in the analysis of medical outcomes.","title":"Understanding and Improving Predictors","awardID":"9619589","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["161500"],"PO":["565227"]},"17772":{"abstract":"Many problems in the real world involve systems that are complex, stochastic, and partially observable -- for example, jet engines, the human body, and the stock market. Recent developments in probabilistic representation and reasoning technology, especially probabilistic (Bayesian) networks, have led to a rapid growth of successful applications in engineering, finance, medicine, software systems, etc. This project concerns the development of techniques for automated construction of complex probabilistic networks directly from data. Previous work by the principal investigator has shown that distributed, gradient-based methods can be used to learn probabilistic networks with hidden variables. This work is being extended to handle models of temporal processes, models with mixtures of continuous and discrete variables, models with unknown structure, and models for which various types of prior knowledge are available, thereby providing more powerful learning methods for applications such as data mining, forecasting, speech recognition, and computer vision. Because probabilistic networks can provide compact and easily understandable models of very complex processes, the project will also yield new tools for automated scientific investigation in cases where current data analysis tools are ineffective -- for example, in understanding the complex pathways by which DNA lesions lead to tumors.","title":"Learning Complex Probabilistic Models from Data","awardID":"9634215","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["401938"],"PO":["565227"]},"19620":{"abstract":"The research program is centered around the design and analysis of algorithms in combinatorial optimization, with an emphasis in two major directions: the development of efficient approximation algorithms to provide near-optimal solutions to intractable problems in combinatorial optimization; and the use of these techniques in the design of algorithms for large-scale networks. A fundamental goal is the development of general methods for approximating the optimal solutions to intractable optimization problems. The study of linear programming methods has proved to be a valuable way to gain insight into the structure of such problems. The approach in this work involves the development of techniques based on linear programming and some of its generalizations, in conjunction with probabilistic methods and randomized algorithms. A related issue is the behavior of local-search methods for optimization, as a means of understanding the ``landscape'' of feasible solutions on which they operate; there are close connections between this issue at a general level and some concrete optimization questions in the area of biomolecular structure. A rich application area for these algorithmic techniques, and the focus of much of this research, is in the area of network optimization problems. One basic issue is the problem of routing traffic streams so as to minimize congestion in communication networks. This involves techniques from network flows, adapted to the framework of virtual circuit routing. Another on-going issue in this research is the development of tools to analyze network traffic as a dynamic phenomenon, which arrives continuously over time. Some fundamental issues here are {\\em stability} --- determining whether delays in the network remain bounded over long durations --- and the probabilistic analysis of traffic whose rate can fluctuate greatly over time. The education component of the program is focused on the planned development of a course designed to link curren t developments in algorithms with work in the biological sciences. In particular, there is an emerging opportunity here to bring together students from computer science, and those in biology and chemistry, around the set of fundamental computational problems that have arisen in molecular biology. Related to this is a plan for increased coverage of certain topics in the core undergraduate algorithms course: in particular, the general area of heuristic and local-search methods in optimization, which has figured prominently in much of the computational work currently being done in molecular biology and related areas.***","title":"CAREER: Algorithmic Methods for Networks","awardID":"9701399","effectiveDate":"1997-04-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["450550"],"PO":["528421"]},"19862":{"abstract":"Automatic parallelization of object-oriented computations is becoming increasingly important with the widespread acceptance of object-oriented languages such as Java and C++, and the adoption of small-scale shared-memory multiprocessors as the mainstay of enterprise computing. A key problem that complicates the automatic parallelization of object-oriented programs is the pervasive use of irregular linked data structures such as lists, trees and graphs. The project will investigate a fundamentally new analysis technique, commutativity analysis, that is designed to automatically parallelize object- oriented computations that manipulate linked data structures. The project will focus on practical techniques such as the generation of self-tuning code, or code that dynamically changes its behavior to adapt to changes in the execution environment, and optimizations that reduce synchronization overhead. It will also investigate advanced analyses such as relative commutativity analysis, which enables the automatic parallelization of computations that build linked data structures, and replication analysis, which enables the dynamic replication of objects to eliminate serialization. The overall goal is to develop techniques that enable a dramatic reduction in the cost and difficulty of developing software for parallel machines. Educational contributions include the involvement of students in the research and the development of a new class in program analysis.***","title":"CAREER: Commutativity Analysis: A New Analysis Framework for Automatically Parallelizing Object-Oriented Computations","awardID":"9702297","effectiveDate":"1997-04-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["497068"],"PO":["250083"]},"13331":{"abstract":"This project connects Florida Memorial College to the Internet over a T1 (1.544 million bits per second) line. Faculty and students at the school benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they are able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Florida Memorial College Connection to the Internet","awardID":"9617040","effectiveDate":"1997-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["194404"],"PO":["121202"]},"19744":{"abstract":"The objective of this research is the development of methods for the automatic recognition of American Sign Language (ASL) utterances using as input the 3D shape and motion parameters of a subject's face, hands and arm. These parameters are extracted based on the use of computer vision techniques on relevant image sequences. The novel aspects of this research are: 1) use of 3D information from the vision-based analysis of the data that consists of the three-dimensional hand, arm and face shape and motion, 2) use of Hidden Markov Models (HMMs) to recognize the ASL structure at multiple levels, and 3) coupling of computer vision and HMMs to go beyond the limitations of both computer vision and HMMs. Novel computer vision methods will be developed based on the use of deformable models, visual cues, and knowledge of anthropometry to allow the accurate tracking of a human's face and upper limbs. The 3D output from the vision system will be used as input to the HMM for ASL recognition. To improve the robustness of the system, research on feedback mechanisms between the computer vision system and the HMMs will also be conducted. The final goal of this research is to demonstrate the feasibility of building an automated robust system with high recognition accuracy (recovery of sign sequences at the sign level) that is capable of handling the inflectional and derivational properties of ASL in a systematic way.","title":"Towards American Sign Language Recognition from Visual Input","awardID":"9701803","effectiveDate":"1997-04-15","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["522465"],"PO":["475621"]},"19459":{"abstract":"This award provides supplemental funding for the First IEEE Signal Processing Workshop on Signal Processing Advances in Wireless Communication (SPAWC) to be held at La Villette, Paris, France, April 16-18, 1997. This workshop is organized by Professors Lang Tong, Georgios Giannakis and Jean-Francois Cardoso. The objective of this workshop is threefold: (1) to present the most recent research results in the area of signal processing applications in wireless communications; (2) to provide a forum for exchanging ideas on current trends and future research directions; (3) to encourage cross-fertilization of ideas between signal processing and communications communities, and between academia and industry. The scope of the workshop includes the following key areas in wireless communications where advanced signal processing techniques are making significant impact: Array Signal Processing in Wireless Communications; Signal Separation, Channel Estimation and Equalization; Detection and Estimation in Wireless Systems; Modeling of Wireless Channels; Multi-user Wireless Communications: DDMA, TDMA, FDMA; Synchronization and Tracking; Mobile, PCS and Indoor Systems; Underwater and Satellite Communication Systems, and, Performance Analysis and Experimental Results.","title":"The First IEEE Signal Processing Workshop on Signal Processing Advances in Wireless Communication, Paris, France, April 16-18, 1997","awardID":"9700798","effectiveDate":"1997-04-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["531874"],"PO":["564898"]},"14125":{"abstract":"9619579 Pollack This is the first-year of a three continuing award. Research on planning within AI has led to the development of computational techniques for generating a plan to achieve a specified goal from a specified initial state, given definitions of the available actions. Until recently, however, much of this research has been governed by a number of simplifying assumptions, notably that there is no indeterminacy either in the planning agent's knowledge, in the effects of its actions, or in the notion of goal satisfaction, and that there are no changes either in the goals presented to the agent or in its environment. This award supports research aimed at relaxing the latter assumption. Specifically, the research investigates the issues involved in extending planning technology to a dynamic setting, in which the agent's goals and environment are both subject to change. A study is being made of both the theoretical and practical issues presented by situations that call for integrated generation, maintenance, and execution of plans for multiple, changing goals. The project addresses these issues from two complementary points of view. The first is designing and implementing a dynamic planning system that is flexible enough to allow for the experimental investigation of the consequences of adopting different reasoning strategies in different dynamic planning environments. Secondly, but in parallel, a formal analysis is being carried out of the dynamic planning problem, with a special emphasis on providing a clean semantic analysis of the implemented system. The aim of the project is more flexible and realistic planning models and systems.","title":"Plan Management in Dynamic Environments","awardID":"9619579","effectiveDate":"1997-04-15","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1401","name":"Division of ARCTIC SCIENCES DIVISION","abbr":"ARC"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["333698"],"PO":["565227"]},"10990":{"abstract":"This three-year award for U.S.-France cooperative research in signal processing involves Robert Gray of Stanford University and Michel Barlaud of the Laboratoire d'Information Signaux et Systemes of the French National Center for Scientific Research in Sophia Antipolis, France. The award provides travel support and living expenses to Dr. Gray and a research assistant. The objective of the research is to develop a theory and design of algorithms for image compression and classification. Substantial time will be devoted to studying digital mammograms, aerial photographs, and multimedia images. The project takes advantage of French expertise in mathematical methods.","title":"U.S.-France Cooperative Research: Combined Compression and Classification","awardID":"9603498","effectiveDate":"1997-04-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0504","name":"Division of MICROELECTRONIC INFOR PROCESS","abbr":"MIP"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["441541"],"PO":["323582"]},"20164":{"abstract":"The 1997 IEEE International Symposium on Information Theory will be held in Ulm Germany June 29 - July 4, 1997. Papers presented will address new results in the following areas: applications of information theory, image and speech coding, coded modulation, communication systems, multi-user information theory, cryptography and security, neural networks, data compression, optical communications, data networks, pattern recognition, detection and estimation, Shannon theory, distributed information processing, signal processing, error-control coding, source coding, and stochastic processes. This symposium is a premiere meeting in the field of Information theory. Travel through this grant will provide travel support for U.S. Participants, particularly graduate students and new faculty whose papers have been selected for presentation at the symposium, but who lack the travel funds to the conference site.","title":"1997 IEEE International Symposium on Information Theory","awardID":"9703704","effectiveDate":"1997-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508186"],"PO":["150490"]},"19956":{"abstract":"The current information revolution is stimulating the emergence of new computing devices, here called network appliances, that connect to the information infrastructure, interact with the real world, and can be programmed to perform custom functions. The limited resources available on most appliances will create a need for in-network servers supplying CPU cycles and storage. These servers will host proxy services as well as application specific gateways. This project will research the design and implementation of computer systems for network appliances and the related in- network servers. This includes developments at the level of the operating system, programming languages, and the run- time system. More concretely, the research will develop around the Secure Language Kernel (SLK) operating system being developed. SLK relies on the type safety properties of the language system in order to enforce protection boundaries between applications and the OS itself, which means that all code can run in a single address space, and at a single hardware privilege level. The expected benefits of this approach are higher resource efficiency, seamless system extensibility, and flexibility in the form of fine grain sharing across protection domains.***","title":"CAREER: Developing Secure Systems for Network Appliances","awardID":"9702755","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["84110"],"PO":["250083"]},"16954":{"abstract":"DMS-9631618 Golub The award will permit the creation of a graduate fellowship program in applied and computational mathematics which fully integrates mathematics with a variety of application areas. In particular, students in the program will be expected to actively participate in the experimental laboratory whose results provide the impetus for the mathematical modelling, analysis and computation that the student will engage in. The program will be built upon the existing Program in Scientific Computing and Computational Mathematics (SCCM). The goal of merging applied mathematics with an application area will be achieved in a variety of ways: the student will be jointly advised by two people, one with interests in applied mathematics or numerical analysis, and a second with interest in a specific scientific or engineering discipline; after passing written qualifying exams in applied mathematics and numerical analysis, the student will be integrated into the laboratory of the external input to, as well as evaluation of, the interdisciplinary training can be achieved. The technical area around which the program is organized is that of constitutive modelling for complicated nonlinear phenomena arising in science and engineering. In particular the areas of turbulence modelling, non-Newtonian fluids (such as polymers), the biomechanics of growth, and computational chemistry form the primary areas of application. This activity is being funded by the following programs: New Technologies (CISE), Office of Multdisciplinary Activities (OMA), MPS,and the Division of Mathematical Sciences.","title":"Mathematical Sciences\/GIG: Graduate Fellowships in Interdisciplinary Research in Mathematical Sciences","awardID":"9631618","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[42635,42636,"320271","556551","309499","122729","521141"],"PO":["256494"]},"14215":{"abstract":"The goal of this project is to accelerate the rendering of three dimensional surface models using multiresolution modeling techniques. Multiresolution modeling is the description of shape at multiple levels of detail. In conventional image synthesis, an object is rendered from the same geometric model independent of its screen size, but this is unnecessarily slow for small and distant objects. With multiresolution models, nearby objects are rendered using a detailed model, while distant objects are rendered using a coarse model employing many fewer polygons. To date, the creation of multiresolution models has been largely manual. New algorithms will be developed to adaptively simplify polygonal surface models, attempting to find an accurate approximation to the surface using as few polygons as possible, and to do this as quickly as possible. Methods for smoothing the transitions between levels of detail will be developed. The resulting image should be indistinguishable from a scene rendered from a fully detailed model. Multiresolution models can speed up a number of applications, including flight and driving simulation, computer aided design, visualization, video games, virtual reality, and computer animation. They can allow scenes of great complexity to be rendered in real time.","title":"Fast, Realistic Image Synthesis","awardID":"9619853","effectiveDate":"1997-04-15","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["85148"],"PO":["187585"]},"10794":{"abstract":"This three-year award for U.S.-France cooperative research in computer programming languages involves Jean-Luc Gaudiot of the University of Southern California, Isabelle Attali of the French National Institute for Research in Computer Science and Engineering and Applied Mathematics (INRIA) at Sophia-Antipolis, and Denis Caromel of the University of Nice. The award provides travel support and subsistence to Dr. Gaudiot for his collaboration with the French researchers. The objective of the research is to investigate formal description and extension of parallelization techniques and algorithms for compilation of programs written in a functional language (Sisal) and in a parallel object oriented language (Eiffel). They will also explore their effectiveness in designing parallel programming. The project takes advantage of access to a programming language known as Eiffel which was developed by the French investigators.","title":"U.S.- France Cooperative Research (INRIA): Formal Specification and Transformation of Parallel Programs","awardID":"9602937","effectiveDate":"1997-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["475291"],"PO":["323582"]},"23258":{"abstract":"Packet switching, as exemplified by the Internet and Broadband Integrated Services Digital Networks, has grown to tremendous proportions in the short space of 30 years of research and development. However, many of the concepts in networking and communications were developed in the context of metallic or optical-fiber links to which network nodes are permanently attached. Several of the basic tenets of networking are being challenged by the introduction of wireless links that rely on atmospheric propagation of radio-frequency signals and mobile nodes that are connected to wireless (or even wired) links for only a short period of time. This workshop will identify the major research issues in wireless and mobile communications. The workshop, to be held March 24-16, 1997, will identify major research issues in wireless and mobile communications. By assembling leading researchers in the field the workshop will provide a forum for intense discussion and debate about the essential problems to be solved and about how best to approach these problems. The workshop will feature active participation by researcher with well established contributions in the field. Two basic tracks of researchers are being assembled: 1) communications, link, and hardware technology experts; and 2) networking, middleware, and advanced applications experts. The workshop will consist of joint and two-track sessions, allowing the exchange of ideas among different specialists and focusing discussion among related specialists. A final report of the workshop will be a group-authored report entitled, \"Research Priorities in Wireless and Mobile Communications\".","title":"Wireless and Mobile Communications Workshop (WIRELESS)","awardID":"9712470","effectiveDate":"1997-04-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["427568",58411],"PO":["150490"]},"14117":{"abstract":"9619562 Horty This is the first-year of a three-year continuing award. Research on planning within AI has led to the development of computational techniques for generating a plan to achieve a specified goal from a specified initial state, given definitions of the available actions. Until recently, however, much of this research has been governed by a number of simplifying assumptions, notably that there is no indeterminacy either in the planning agent's knowledge, in the effects of its actions, or in the notion of goal satisfaction, and that there are no changes either in the goals presented to the agent or in its environment. This award supports research aimed at relaxing the latter assumption. Specifically, the research investigates the issues involved in extending planning technology to a dynamic setting, in which the agent's goals and environment are both subject to change. A study is being made of both the theoretical and practical issues presented by situations that call for integrated generation, maintenance, and execution of plans for multiple, changing goals. The project addresses these issues from two complementary points of view. The first is designing and implementing a dynamic planning system that is flexible enough to allow for the experimental investigation of the consequences of adopting different reasoning strategies in different dynamic planning environments. Secondly, but in parallel, a formal analysis is being carried out of the dynamic planning problem, with a special emphasis on providing a clean semantic analysis of the implemented system. The aim of the project is more flexible and realistic planning models and systems.","title":"Plan Management in Dynamic Environments","awardID":"9619562","effectiveDate":"1997-04-15","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[35857],"PO":["565227"]},"10950":{"abstract":"*** 9603361 Goldburg This three-year award for U.S.-France cooperative research in condensed matter physics involves the research groups of Walter Goldburg at the University of Pittsburgh and H. Kellay at the University of Bordeaux I. The award provides travel support and living expenses to Dr. Goldburg, his colleague, X.L. Wu, and a graduate student. The objective of the research is to investigate the statistical properties of the vorticity field in two dimensional (2D) turbulence flow. The U.S. investigators bring to this collaboration expertise in turbulence studies. This is complemented by the French experimental effort in thermodynamics and phase behavior of systems. The collaboration will advance understanding of two dimensional turbulence. ***","title":"U.S.- France Cooperative Research: Experimental Study of Two-Dimensional Turbulence","awardID":"9603361","effectiveDate":"1997-04-01","expirationDate":"2003-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["465153","543337"],"PO":["323582"]},"11533":{"abstract":"The goal of this project, funded as a Research Planning Grant (RPG) is to perform preliminary studies and develop a long term research proposal to investigate strategies for implementation of file system extensions in widely used operating systems. Examples of extensions under consideration include disconnected operation, weak and partial connectivity, informed prefetching and file reference tracing. The major difficulty in transferring these technologies into commercial practice stems from frequent inability to modify the native system source code. Therefore, alternative mechanisms and tools, such as microkernel augmented DLLs, installable file systems, loadable modules, proxies and TSR programs, will be considered. The scope of the study will span the families of all widely used operating systems such as Windows family, Unix family, and OS\/2 family. In addition to the inability to modify the native system source code, constraints such as hardware limitations, and the effect of the extension on system performance will be investigated. The long term goal of this research is to develop a set of guidelines for practical implementation of file system extensions, and study their impact on the native system, thereby furnishing a vital missing link in the transfer of file system research results into computer practice.***","title":"Strategies for Practical Implementations of File System Extensions","awardID":"9610104","effectiveDate":"1997-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["513752"],"PO":["250083"]},"11588":{"abstract":"PI: Anshuman Razdan Scientific visualization provides scientists with tools to model and visually observe three dimensional data. This technique has advanced scientific understanding in numerous scientific fields such as biology, chemistry and engineering. The traditional method of visualization is to model the data into one of the many surface modeling schemes and display the data on a computer screen. This approach has obvious limitations for people that are visually impaired. This project will test a novel way to provide analogous information to these individuals whether they are students, scientists or researchers. Data are modeled in the normal manner, but instead of displaying the model on a computer screen, a three-dimensional wax-based model will be created. The data, after being geometrically modeled, will be converted into a physical model using a Layered Manufacturing (Rapid Prototyping) machine. The tactile model will maintain the appropriate ratios so as not to distort the proportions of the data. A Scanning Probe Microscope (SPM) has been chosen as the test-bed to provide 3D data. A SPM is used to probe objects on a nano scale and its output is inherently three dimensional. The only way to currently observe experiments and data performed on SPM is a visual display on a screen. With the proposed technique, a visually impaired student will be able to feel the surface representation of the 3D data on the physical model as seen on a SPM. The use of 3D physical models for tactile feedback will be developed in three Arizona State University classes: a junior level course in Chemical Engineering, a sophomore level course in Physical Science for in-service and preservice teachers, and a junior level interdisciplinary science course. Activities will be created to demonstrate the viability, importance and success of this project. Workshops will be organized to bring educators, scientists, special education teachers and students to both evaluate and provide input to this project. The project has broad implications for science education for all students because they will be able to touch, feel and observe tangible three- dimensional data models.","title":"PPD: Scientific Visualization Using Tactile Feedback for Visually Impaired Students","awardID":"9610289","effectiveDate":"1997-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1545","name":"RES IN DISABILITIES ED"}}],"PIcoPI":["503021","248768","455160","478405","559203"],"PO":["74950"]},"13536":{"abstract":"An integrated computational environment for computer-aided mechanical design will be developed and tested. The environment will support the key design tasks of function validation, dynamical simulation, parametric design, and functional tolerancing for a broad range of mechanical assemblies, such as camera shutter mechanisms, part feeders, robotic arms, and computer housings. The research will address the fundamental task of computing the effects of part contacts on function. Contact analysis is difficult and time-consuming even for experienced designers due to the quantity and complexity of the contact constraints in modern assemblies. The difficulty is greatest in assemblies with multiple contacts, meaning that different parts interact at various stages of the work cycle. There is no general purpose software for contact analysis. Contact analysis will be studied within the configuration space representation of mechanical function. Configuration space computation algorithms will be extended to the full range of planar assemblies and to selected spatial assemblies. Algorithmic support will be developed for the design tasks via configuration space manipulation. The software will emphasize breadth of coverage, depth of analysis, and robustness.","title":"Integrated Computer-Aided Mechanical Design with Configuration Spaces","awardID":"9617600","effectiveDate":"1997-04-01","expirationDate":"2001-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["402028"],"PO":["179846"]},"11920":{"abstract":"In recent years there has been an explosion of research in packetized VBR video, with the great majority of the work addressing live video such as video conference and the broadcast of a sporting event. While this research on live video certainly merits the attention it has received, we feel that the majority of the video carried on high-speed networks will emanate from prerecorded sources. These sources include full-length movies, music video clips, and educational material. From the perspective of the transport network, prerecorded VBR video sources are fundamentally different from live video sources: for live video, the exact dynamics of the VBR traffic are unknown; for prerecorded sources, the traffic is fully known before it is transmitted into the network. Surprisingly, little attention to date has been given to the management of prerecorded video traffic in high-speed networks. There is an emerging type of prerecorded traffic that will likely dominate the broadband residential networks of the future --- Video-on-Demand (VoD) traffic. It is expected that the telecommunication networks of the future will offer a rich variety of VoD services. For example, a costly service would allow the movie to instantaneously begin at the viewers request and would provide full VCR control (pause, rewind, and fast-forward). An inexpensive service would require the viewer to schedule the commencement of the movie minutes or hours in advance and provide no VCR control. This research will develop, analyze and compare a wide variety of end-to-end traffic management schemes for prerecorded video. A central theme of the research is that VoD traffic is prerecorded, and that video providers, networking companies, and equipment manufacturers should fully exploit this important property. Traffic management schemes will be designed which allow varying degrees of VCR control, schemes which guarantee zero cell loss, and schemes which permit infrequent cell loss. Initially, the research wi ll assume that an ATM network transports the video directly between the provider's server and viewer's set-top box. But prerecorded traffic management schemes will also be developed for architectures with neighborhood caches and for architectures based on future generations of the Internet. This research will also investigate how the traffic management schemes impact the resource management of the provider's VoD server, and how VoD services should be priced. The research will lead to a comprehensive methodology for the analysis of prerecorded video over packet-switched networks. This research is described in greater detail on the following Web page: http:\/\/www.seas.upenn.edu\/~ross\/nsf\/prerecorded.html .","title":"Prerecorded Video Over Packet-Switched Networks","awardID":"9612781","effectiveDate":"1997-04-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["184184","550020"],"PO":["125800"]},"11986":{"abstract":"The dramatic growth of interest in wireless communication systems has motivated an attendant interest in signal processing techniques for data demodulation in multiple-access communication channels. Multi-user detection provides a useful theoretical basis for the study of optimum signal processing in such channels. One principle established through the study of multi-user detection is that multiple-access channels can be reduced to ambient-noise-limited channels with appropriate signal processing. The primary framework within which multi-user detection has been developed has been the Gaussian code-division multiple-access (CDMA) channel, in which the ambient background noise is white and Gaussian. Experimental evidence suggests that the ambient noise in many channels of interest in wireless applications (e.g., urban and indoor radio channels, and underwater acoustic-modem channels) is significantly non-Gaussian. In particular, it is known that such noise environments can be better modeled as being derived from more general linear processes, in which both Gaussian and impulsive components can arise. It is further well-established in the context of single-user communications that non-Gaussian noise can be quite detrimental to the performance of systems optimized for Gaussian noise, whereas it can be quite beneficial if appropriately modeled and ameliorated. Thus, as work in multi-user detection moves closer to practice, it is of interest to examine the multi-user detection problem in the context of more realistic ambient noise models. The proposed study will address this issue in depth. Specifically, three research problems arising in the area of multiple-access communications in non-Gaussian channels will be addressed - the analysis of extant multi-user detectors in non-Gaussian ambient noise; the design of optimum and near-optimum multi-user detectors for non Gaussian channels; and the design of waveform sets for non-orthogonal signaling through non-G aussian channels. The results of this study should be quite beneficial in practical communication systems, particularly in areas such as urban mobile telephony, indoor wireless communications, and tetherless underwater acoustic communications (which is of emerging interest in oceanographic instrumentation). For the foreseeable future, there will be considerable commercial and scientific interest in techniques that allow wireless networks to operate with better performance for more users\/subscribers and with lower transmitter power requirements. This means that signal processing techniques that can significantly improve the performance of wireless systems in real channels, such as those proposed for study here, will be of significant interest to the commercial and scientific sectors.","title":"Multiuser Detection in Non-Gaussian Channels","awardID":"9613108","effectiveDate":"1997-04-01","expirationDate":"2000-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["560130"],"PO":["150411"]},"21835":{"abstract":"One of the most important aspects in learning how to do research is early and detailed discussions on various aspects of the research plan with experienced mentors. Unfortunately, most students get little feedback on their thesis at the initial stages except from their immediate advisors. Attending conferences can be a good way to meet other researchers and discuss work. However, the chances of a student at an early stage of his\/her work getting the opportunity to discuss their preliminary ideas with well established researchers are not very good. The Doctoral Consortium (DC) at the American Association for Artificial Intelligence conference was planned as a way to improve this situation. Students about to begin their thesis work are chosen to present their research plans in front of a group of carefully selected faculty panelists. Unlike traditional conference presentations, the bulk of the time in a DC is devoted to discussions between the students and the faculty panelists. Each student is also assigned a faculty mentor who works with the student at a more detailed level. Students learn from both their own presentations as well as watching other students being advised by the faculty panelists. A survey taken after the first DC held last year found all participants (both students and faculty) agreeing that the DC was tremendously useful. We anticipate that all students attending the DC this year (both as presenters as well as those just attending) will leave with renewed confidence in their work, suggestions for improving their thesis plans and a clearer idea of what constitutes good research practice.","title":"Doctoral Consortium for Students in AI; July 28, 1997; Providence, RI","awardID":"9708559","effectiveDate":"1997-04-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["550649",54991],"PO":["183208"]},"21648":{"abstract":"9707894 Camp, Tracy Computing Research Association Special Project: Travel Grant Support for Grace Hopper Celebration of Women in Computing Conference On September 19-21, 1997, the second Grace Hopper Celebration of Women in Computing Conference is being held at the Fairmont Hotel in San Jose, California. The meeting is a technical conference presenting talks by successful women in the computing field, short technical presentations by a range of conference participants, as well as panels, workshops, and birds-of-a-feather sessions. This grant provides travel costs and registration expenses for approximately eighty people in computing and related fields who otherwise would be unlikely to attend. The awards are made to selected advanced undergraduates, graduate students, and people early in their processional careers. Cost sharing by the institutions represented covers part of the costs for a large majority of the participants.","title":"Special Project: Travel Grant Support for Grace Hopper Celebration of Women in Computing Conference","awardID":"9707894","effectiveDate":"1997-04-15","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["208531","546219"],"PO":["297837"]},"20108":{"abstract":"*** This award, in the Small Grants for Exploratory Research mode, will explore the balance between human operator supervision and computer automation in a human-robot cooperation. The research will do this by finding ways to combine human high-level visual perception and task- understanding capabilities with a robot's low-level vision and positioning precision, to optimize the performance of the human-machine team in vision and manipulation processes. The focus of this initial exploration is to determine ways to combine prior domain knowledge and models, and overall vision and scene perception capabilities of the human operator, with precision and high-speed machine operation in execution of complex robotic tasks. This investigation offers promise of identifying new approaches to allocating human and machine roles in cooperative endeavors, which will be important in a wide range of emerging applications.***","title":"SGER: Operator-Cue-Assisted Machine Vision.","awardID":"9703524","effectiveDate":"1997-04-15","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["51468"],"PO":["475621"]},"20549":{"abstract":"97-04702 Burdick, Joel W. California Institute of Technology Postdoc: Planning for Hybrid Systems (This award supports CES associate Milos Zefran) Systems that are governed by discrete and continuous processes are known as \"hybrid\" systems. Such systems are described by continuous dynamical equations whose structure and\/or inputs change in accordance with the state transitions of a finite automaton. Due to the widespread use of computers to control physical devices, hybrid systems abound. Successful hybrid systems must robustly combine high-level planning (planning of the finite automaton transitions) with low-level control (evolution of the dynamic equations). While the planning and control problems have been addressed separately by computer scientists and control theorists, the interaction of the discrete and continuous worlds is largely left to the ingenuity of engineers. As the complexity of the computer controlled physical systems grows, such methods break down and there is a need for rigorous theory to design, build, and evaluate hybrid systems. The proposed research will investigate how to unify discrete and continuous models to help build a foundation for hybrid system engineering. Prior work on planning for a subclass of hybrid systems will be extended in two directions. First, an optimal control framework will be extended to a game-theoretic framework so as to take uncertainty into account. Second, the hybrid control problem will be explored for systems whose dynamics exhibit some simplifying properties, such as Lie group symmetries.","title":"Postdoc: Planning for Hybrid Systems","awardID":"9704702","effectiveDate":"1997-04-01","expirationDate":"1999-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["301111"],"PO":["297837"]}}