{"94979":{"abstract":"The sensorimotor system for a long-lived autonomous robot is the foundation for its knowledge base. This project addresses fundamental questions about how higher-level features and actions, which are usually engineered into robots by human designers, can be learned autonomously and grounded in experience interacting with the environment. The project involves three tasks. <br\/><br\/>In Task 1, an unknown sensory system is divided into different sensory \"modalities\", for example, vision and different types of range sensors, and the goal is to learn the distinctions among these, their individual properties, and sensor fusion methods for combining their information into a common model of the nearby (\"small-scale'') environment. <br\/><br\/>In Task 2, the basis for a map of the \"large-scale'' environment is assumed to be a deterministic automaton model consisting of a discrete set of so-called \"distinctive states\" that are reliably connected by actions. One goal is to learn hill-climbing control laws that define distinctive states by reaching the local maximum activation of learned feature-detectors. A second goal is to learn trajectory-following control laws for moving reliably from one distinctive state to the neighborhood of another, where hill-climbing eliminates accumulated error. <br\/><br\/>In Task 3, the goal is to learn to model the dynamic as well as the static environment, using coherent motion to distinguish individual objects from the background, so they can be categorized and their properties learned to support recognition elsewhere. This is in contrast to the usual approach of assuming that the environment is static and that anything dynamic is treated as noise to be filtered out.<br\/><br\/>Together, the results of these tasks will allow an autonomous learning agent to ground its own sensors and effectors in its own experience, supporting a high level of competence in modeling and interacting with its environment. Besides addressing fundamental issues in spatial cognition, this research has practical importance in showing how robots can adapt autonomously to new or changing sensors and effectors. These results can apply to non-standard \"robots'' such as autonomic computing in complex computing systems, distributed sensor networks, MEMS sensors, or reconfigurable autonomous spacecraft, and have applications to the creation of intelligent aids, such as wheelchairs, for the disabled.<br\/><br\/>The results of this project have broader impacts on many educational activities, including innovative undergraduate courses in robotics, involvement of high school students in the work of the project, and outreach to the community through open houses and public demonstrations. One focus of the project is the development of mobility aids like an Intelligent Wheelchair for persons with disabilities in mobility and communication, but with normal cognition and perception.","title":"Learning the Sensorimotor Foundation for Spatial Reasoning","awardID":"0413257","effectiveDate":"2005-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["534124"],"PO":["387198"]},"98929":{"abstract":"Proposal Number: 0435173<br\/>PI: Jonathan Turner<br\/>Institution: Washington University <br\/>Title: Virtual Networking - Enabling Network Service Innovation <br\/><br\/>Abstract: <br\/><br\/>A recurring problem with communications networks is that as they grow and become more widely used, they become resistant to change. The Internet is now becoming subject to network ossification, making it difficult to deploy new capabilities to meet emerging needs. The advent of high performance network processors and advanced configurable logic devices now make it practical to virtualize the Internet, allowing multiple virtual networks to co-exist within the same physical infrastructure. This project is investigating the requirements for virtual networking architectures and the design options for realizing them.<br\/><br\/>The expected results of this work include analysis of major issues that affect the design of virtual network substrates. Options by which resources are allocated from the network substrate to virtual networks are being explored. The program is also investigating alternative approaches to virtualizing end-systems and design issues for virtual data links. In addition, the program is exploring architectures for virtualized routers. Virtualization places new requirements on network processors to enable different virtual routers to share resources in a single device, without interference. <br\/><br\/>Network virtualization has the potential for eliminating the recurring problem of network ossification and enabling continuing innovation in core network technologies and services. It can have a dramatic impact on the nation's information technology infrastructure, allowing much more rapid introduction of new capabilities as new needs arise.","title":"Virtual Networking - Enabling Network Service Innovation","awardID":"0435173","effectiveDate":"2005-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["522381","316262","522382","319506"],"PO":["292741"]},"102885":{"abstract":"The Joint Workshop on Hands-Free Speech Communication and Microphone Arrays (HSCMA2005) will be held on March 17-18, 2005, at Rutgers University in Piscataway NJ, USA (immediately before the 2005 ICASSP in Philadelphia PA). This workshop is devoted to reviewing the current state-of-the-art as well as recent advances in signal processing related to the problem of hands-free speech communications. It will bring together researchers and practitioners from universities and companies working in the fields of robust speech recognition, speech enhancement, microphone arrays, and MIMO (multiple-input multiple- output) acoustic signal processing. In order to facilitate interaction between different research communities, this workshop combines two earlier established workshops: Microphone Arrays and Hands- Free Speech Communications. The Microphone Array Workshop held typically every other year for the past 10 years has been growing in participation and diversity in subject matter coverage, but focused mainly on the problem of hands-free communications. The Hands-Free Speech Communication Workshop organized in Japan three years ago, focused mainly on back-end processing for automatic speech recognition of hands-free speech. This workshop will act to synergistically combine front-end MIMO acoustic signal processing with back-end automatic speech recognition processing. The workshop organizers believe that by bringing these two disparate research groups together will lead to synergistic advances in the field of hands-free speech communication. The workshop will feature keynote addresses by leading researchers, panel discussion of future research directions, and contributed technical papers.<br\/><br\/>This proposal requests facility and travel support for students. We would like to keep the registration cost of the workshop low to allow many folks to easily participate. In order to accomplish this, we have decided to host the conference at the CAIP center at the Rutgers University. We request support for the cost of the organizational staff and university facilities required for the workshop. We also request support for students from US institutions who are authors or coauthors of a paper to be presented, who without travel subsidies would not be able to attend.<br\/><br\/>The workshop website will provide further details URL: www.hscma2005.org","title":"Joint Workshop on Hands-Free Speech Communication and Microphone Arrays","awardID":"0457563","effectiveDate":"2005-01-15","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":[271307,271308,271309,271310],"PO":["564898"]},"100995":{"abstract":"Infrastructures in critical domains such as medical, power, telecommunications, and finance depend on information systems. Therefore, attacks can have devastating affects on these critical infrastructures. Moreover, an increasing number of organizations are relying on commodity software. This trend can be attributed to increasing reliance on out-sourcing and commercial off-the-shelf (COTS) components. However, deploying commodity software poses significant risks because they can contain exploitable vulnerabilities and hidden malicious behavior. Combating malicious behavior in commodity software is especially challenging because its user only has access to the executable for the software. This proposal addresses the problem of combating malicious behavior in commodity software. The proposed tasks are applicable in the context of model-based intrusion detection systems (MIDS) which are a type of host-based intrusion detection system (HIDS) that monitor program execution using a model. There are three major areas in MIDS: model construction, enforcement, and model analysis. This proposal addresses model construction and model analysis. In the context of MIDS, the proposed research will improve precision of existing model-construction algorithms, tackle privacy violations, and develop techniques for analyzing and refining models.","title":"CAREER: Combating Malicious Behavior in Commodity Software","awardID":"0448476","effectiveDate":"2005-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["521593"],"PO":["565264"]},"104922":{"abstract":"Synthetic speech has moved out of the imaginary realm of science fiction, where it provided the voices of robots from HAL to C-3PO, into our everyday world of appliances, telephony applications and personal communication devices. In the domain of assistive technology, individuals with severe communication disorders often rely on speech synthesis to speak on their behalf. Yet, anyone who has tried to listen to the PA system in a noisy train station or airport knows that speech synthesis fails in these everyday noise situations. These are precisely the types of communication scenarios in which users must rely most on the technology, thus highlighting the importance of developing a synthesizer capable of accommodating its speaking style to the user's situational noise context. In this exploratory project the PI will take first steps toward designing and developing a speech synthesizer that listens to the ambient noise level and modifies its prosody to compensate for background noise in human-like ways. The PI will begin by examining the modifications to speech in noise made by humans in order to learn how to implement these changes in machines. She posits that human modifications to speech will differ for semantically salient (i.e. content) words compared to non-salient (i.e. function) words; this is an important distinction that has not received much attention. If the hypothesis proves to be correct, the adaptive synthesizer will need to differentially modify its speaking style to account for the semantic role of the words spoken as well as the background noise level.<br\/><br\/>Broader Impacts: This research will impact all people who use spoken dialog interfaces (e.g., in telephony and virtual transaction applications), as well as individuals with disabilities who must rely on speech synthesis as their sole mode of communication. Most communicative interactions occur in lively spaces that have some degree of ambient noise. Current speech synthesis technology cannot cope with such conditions and thus it fails to serve as an enabling technology in commonplace situations such as classrooms, restaurants, hotel lobbies, cars, bus stations, and numerous other situations.","title":"SGER: Loudmouth - Toward Intelligible Speech Synthesis in Everyday Noise Situations","awardID":"0509935","effectiveDate":"2005-01-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["485923"],"PO":["565227"]},"100864":{"abstract":"The key to reliable communications over wireless channels is diversity. <br\/>Of the various methods used to achieve diversity, spatial diversity <br\/>through the use of multiple transmit and\/or receive antennas is <br\/>particularly attractive in that it does not require additional <br\/>bandwidth or loss of transmission rate. Spatial diversity does, <br\/>however, require the use of multiple antennas which must be separated <br\/>by at least a few wavelengths in order to be effective. This physical <br\/>constraint precludes the use of spatial diversity in many scenarios, <br\/>but recently, researchers considered this problem in the context of <br\/>multiuser communication systems in which there may be multiple sources <br\/>and\/or destinations each with only a single antenna. In these types of <br\/>systems, communicating nodes can form \"partnerships\" to achieve a new <br\/>kind of spatial diversity: \"user cooperation diversity\". Nodes in a <br\/>partnership pool their antenna resources to form a virtual antenna <br\/>array and many of the benefits of spatial diversity are achieved <br\/>without the need for a \"real\" antenna array.<br\/><br\/>While user cooperation diversity can provide many of the advantages of <br\/>antenna arrays to devices that would otherwise only have access to a <br\/>single antenna, the implementation issues are significantly different <br\/>than those of antenna arrays. Unlike a traditional antenna array, the <br\/>nodes in a cooperative partnership are at least semi-autonomous in the <br\/>sense that they each typically have their own local resources, <br\/>quality-of-service requirements, and timing references. This project is <br\/>centered around the questions created by the inherent autonomy of nodes <br\/>in cooperative multiuser communication systems: how to initiate and <br\/>maintain cooperative partnerships, how to optimally allocate resources <br\/>in cooperative partnerships, and how to synchronize cooperating nodes.","title":"CAREER: Cooperative Communication Systems: Resource Allocation, Self-Organization, and Synchronization","awardID":"0447743","effectiveDate":"2005-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["550414"],"PO":["432103"]},"100336":{"abstract":"AAD: A Software Tool for Asynchronous-Algorithm Development<br\/><br\/>Zhiyuan Li, Ananth Grama, Ahmed Sameh<br\/><br\/>Department of Computer Sciences<br\/>Purdue University<br\/><br\/>Project Summary<br\/><br\/>Intellectual Merit:<br\/><br\/>Data communication and memory access latency will continue to be the most severe<br\/>performance-limiting factor for high-end computing problems. This proposal takes the view that, for a wide range<br\/>of applications, the computation efficiency can be substantially improved by a fundamental change to <br\/>the data propagation model in parallel algorithms.<br\/><br\/>Many important applications use iterative solvers to solve partial differential equations (PDEs). In such solvers, each data point is iteratively updated<br\/>using the new values of its neighbors.<br\/>Data values are therefore propagated across the problem domain over the time<br\/>steps. Currently, the predominant way<br\/>to propagate the data requires the processor to suspend its computation until all data computed at a predetermined time step have arrived from its neighbors.<br\/>Such a rigid model not only<br\/>incurs a heavy performance penalty due to processor waiting, but<br\/>it also severely limits the compiler's ability to transform programs to achieve<br\/>more efficient parallel execution and better data locality. <br\/>The PIs propose a software tool which supports a new model called the asynchronous model. <br\/>Under this model, each data point is updated based on whatever the <br\/>most recent values available from its neighbors, instead of waiting for values<br\/>computed at a predetermined step. The new model will hence overcome<br\/>the difficulties mentioned above. The asynchronous model, nonetheless,<br\/>may change the convergence rate of the algorithm.<br\/>Hence, based on the tradeoff between the convergence rate and the<br\/>parallel execution efficiency,<br\/>the application programmer should tune the frequency at which<br\/>the data propagation is re-synchronized in order to<br\/>accelarate the convergence. The proposed tool will make it easy<br\/>for the application programmer to perform such important tuning.<br\/><br\/>Broader Impact:<br\/><br\/>The success of this project will contribute substantially to<br\/>the advance of high-end computing.<br\/>Moreover, it will also make significant educational and outreach impact.<br\/>The PIs plan to use the proposed software tool in Purdue's educational<br\/>computational science and engineering (CSE) graduate program. Students and <br\/>faculty in this program will use the tool in courses on parallel computing<br\/>and performance evaluation, as well as in research projects that can benefit <br\/>from fine-tuning performance on high-end parallel computing platforms.<br\/>The software developed in this project can also be an effective tool<br\/>in CSE education programs elsewhere.<br\/><br\/>The PIs have a track record of transferring research ideas to<br\/>industrial labs and such collaboration will continue to project<br\/>positive influences on high-performance computer industries.<br\/>This project will also further enhance PIs' ability to engage a broad community of undergraduate students in various disciplines, through Honor Seminars, special mentoring programs and undergraduate research opportunities.","title":"AAD: Software Tool for Asynchronous-Algorithm Development","awardID":"0444285","effectiveDate":"2005-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7417","name":"S AND T HIGH-END COMPUTING"}}],"PIcoPI":["501195","408878","540776"],"PO":["565272"]},"101007":{"abstract":"This project focuses on the field of meta-learning by investigating the relation between learning mechanisms and the tasks and domains where these mechanisms are applicable. An important activity of this project is to propose effective data structures and meta-features that characterize example distributions. We plan to extend model-based and information-theoretic characterizations, and to exploit multivariate density estimation techniques to generate a concise mapping of an example distribution. Results from this project will be used in the design and construction of meta-learning assistants that will be able to provide automatic and systematic user guidance for model selection and model ranking.<br\/><br\/>This project is multidisciplinary in nature, with a particular emphasis on physics and astronomy. The principal area of application lies in the classification of Mars landscapes from geo-morphological features.<br\/><br\/>A major goal of this project is to combine research and educational strategies aimed at the establishment of a Pattern Classification and Machine Learning Laboratory at the University of Houston. This laboratory will be used to analyze, learn, and perform predictions using real scientific data. It will also be used to help local youth, especially women and minorities, acquire a deep appreciation for science. Through the formation of science clubs and learning communities among high school and undergraduate students, this project strives to have a strong impact in fostering interest among young students in choosing scientific or technological paths as their professional career.","title":"CAREER: Advancing the Theory and Practice of Meta-Learning with Applications in Physics","awardID":"0448542","effectiveDate":"2005-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["371194"],"PO":["460643"]},"100942":{"abstract":"Capacity of Wireless Networks: Cooperative Communication<br\/><br\/>The fundamental capacity limit of wireless networks is a highly pursued<br\/>yet elusive problem lying at the intersection of distinct fields of<br\/>research. The principle issue is the lack of appropriate tools within any<br\/>one field to tackle this problem in its entirety. This research activity<br\/>builds an inter-disciplinary framework for the analysis of this<br\/>fundamental limit, merging networking and optimization theoretic concepts<br\/>such as node cooperation, cooperative routing and Lagrangian duality in<br\/>conjunction with sophisticated mathematical tools from information theory.<br\/>A mathematical theory is developed using these diverse tools and, where<br\/>necessary, introducing new tools to obtain 1) improved achievable rates<br\/>for a given network configuration over those currently known 2) novel<br\/>outer bounds on network sum capacity, 3) non-trivial conditions where<br\/>inner and outer bounds meet and 4) algorithms that compute the<br\/>corresponding resource allocation strategies for time-varying wireless<br\/>networks.<br\/>Specifically, techniques such as joint source-channel coding, multi-user<br\/>binning and multiuser cooperative coding are used to develop the inner<br\/>bounds on the capacity of the systems, while Lagrangian duality theory and<br\/>estimation theory is used both to develop outer bounds on capacity and to<br\/>compare the inner and outer bounds.","title":"CAREER: Capacity of Wireless Networks: Cooperative Communication","awardID":"0448181","effectiveDate":"2005-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7937","name":"NETWORK CODING AND INFO THEORY"}}],"PIcoPI":["539208"],"PO":["432103"]},"100822":{"abstract":"This research characterizes light transport from a signal-processing perspective with applications to image synthesis and material-appearance acquisition. A crucial aspect of visual signals is their frequency content, that is, whether light intensity varies smoothly or presents high-frequency content and discontinuities. While such characteristics are implicitly exploited by a number of techniques, there has been little work on the formal frequency analysis of global lighting. This research develops a theoretical framework that describes the effect of all light interaction in a scene in terms of frequency characteristics. This theory is also applied to develop more efficient image synthesis algorithms, and to solve inverse problems in material-property acquisition. The research provides strong signal-processing fundamentals to realistic graphics and enables faster and easier creation of high-quality computer graphics imagery.<br\/><br\/>This research establishes a novel signal-processing framework for the mechanisms of light transport. The local frequency content of the radiance function is studied with an emphasis on how it is affected by phenomena such as shading, occlusion, and travel in free space. This work is comprehensive in that it treats both the angular and spatial dimensions of the radiance domain, which extends previous work that usually treated only one of these components. This theoretical work serves as conceptual inspiration and provides analytical formulas for applications. In particular, practical algorithms are developed for lighting simulation and real-time rendering. These algorithms exploit knowledge of the frequency characteristics of the radiance signal. The acceleration strategies rely on lower sampling rates when appropriate and perceptual masking due to high-frequency patterns. New techniques are also developed to acquire real-world material properties, including the acquisition and characterization of ground-truth data. This permits the validation of assumptions made in other projects, and also the exploitation of these characteristics for faster acquisition.","title":"CAREER: Transient Signal Processing for Realistic Imagery","awardID":"0447561","effectiveDate":"2005-01-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["485699"],"PO":["550859"]},"100834":{"abstract":"With the recent advances in theory, technology and applications of<br\/>wireless communications a vision of the next generation wireless<br\/>systems arises to be that of communicating arbitrarily correlated<br\/>data, in arbitrarily structured networks, in challenging physical<br\/>layer conditions, using wireless devices that are more flexible in<br\/>terms of their transmitting\/receiving capabilities and in terms of the<br\/>boundaries between the layers of their protocol stack. The goal of<br\/>this research is to develop a comprehensive information theoretic<br\/>framework for determining the ultimate capacity limits of such<br\/>networks and for developing efficient coding, transmission, reception<br\/>and decoding schemes to be used in such networks.<br\/><br\/>The research is structured into four heavily interrelated parts:<br\/>network, data, tools, and channel. This research investigates the<br\/>capacity regions and capacity achieving transmit\/receive<br\/>coding\/decoding schemes of basic network structures that are building<br\/>blocks of general ad-hoc multi-hop wireless networks, with an emphasis<br\/>on the interference channel. This research develops principles of<br\/>communicating correlated and common data. Specifically, the<br\/>investigator determines the optimum coding and transmission schemes<br\/>for correlated\/common data and also studies the trade-offs between<br\/>performance and complexity; in particular, the loss in performance<br\/>when the source-channel separation principle is enforced. This<br\/>research develops new tools and integrates and jointly optimizes some<br\/>of the existing tools; the emphasis is on the joint optimization of<br\/>user cooperation and power control. This research integrates the<br\/>fading nature of the wireless communication channel into all of the<br\/>problem formulations. The existence of fading in the channel can be<br\/>both challenging and fortuitous, more the latter, if it is carefully<br\/>exploited to the advantage of the network capacity. The investigator<br\/>incorporates the existence of the channel fading into the capacity<br\/>evaluations (hence, ergodic and outage capacities), into coding and<br\/>transmission schemes for common\/correlated data, and also into the<br\/>development of the tools.<br\/>------------------","title":"CAREER: A Network Information Theoretic Approach to Wireless Ad-hoc and Sensor Networks","awardID":"0447613","effectiveDate":"2005-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["548269"],"PO":["432103"]},"100989":{"abstract":"Data-intensive applications such as web information retrieval and scientific data-driven applications consume significant computational and I\/O resources. With the ubiquity of computer networks and advances in server clustering technologies, it has become a reachable goal to make large-scale datasets and related services available to many concurrent users in real-time. System support for online applications must achieve high performance in the presence of concurrent execution and runtime workload fluctuation. Extending such support for data intensive applications presents significant challenges, including those concerning highly concurrent I\/O at the host level and multi-dimensional resource allocation (e.g., CPU, memory, network, and disk I\/O) on distributed platforms.<br\/><br\/>The overarching goal of this project is to develop system-level support to achieve high throughput and efficient resource utilization for data intensive online applications. Large-scale online applications often contain multiple application components and data partitions, hosted on server and storage clusters. The resource utilization efficiencies at both the host-level and the cluster-level are important for achieving high system throughput. There are two parallel research thrusts in this project. At the host level, the project will investigate operating system support (particularly I\/O prefetching and memory management) for I\/O-intensive concurrent application execution. At the cluster level, the proposed research will explore efficient resource allocation to application and data components on heterogeneous distributed platforms using a profile-driven approach.<br\/><br\/>Techniques developed in this project will be evaluated through experimentation with real applications, drawn from both the scientific domain and web-based commercial applications. Developed software artifacts and experimental datasets will be released for public use. In parallel to research, this project will enhance the curriculum of relevant systems-area courses at the PI's institution. This effort includes the development of a new operating system instructional laboratory platform focusing on performance-oriented system design and implementation. Additionally, a new graduate course on scalable online systems and applications will be created, using results produced in this research and by other related research.","title":"CAREER: System Support for Data-Intensive Online Applications","awardID":"0448413","effectiveDate":"2005-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7469","name":"ITR-HEC"}}],"PIcoPI":["550397"],"PO":["565272"]},"100879":{"abstract":"This research studies the problem of digital content distribution in conjunction with the effective enforcement of intellectual property rights and laws from a cryptographic viewpoint. Understanding, modeling and constructing the necessary framework and tools for digital content distribution and rights enforcement are fundamental for the development of future Digital Rights Management (DRM) systems. Cryptography is a technology that, if applied correctly, has a recognized potential in minimizing trust assumptions, alleviating production and distribution costs, facilitating legal frameworks as well as mitigating threats in the context of DRM systems. The methodological viewpoint of the present research is to harvest the techniques of modern cryptography for the specification and solution of various facets of the DRM problem and advance the understanding of what cryptography can offer to future DRM technologies. The present investigation provides a framework for modeling digital content distribution systems together with the arrays of adversarial behaviors against them and delves into the development of novel cryptographic constructions finely tuned to DRM environments. Various cryptographic tools for DRM systems are investigated, their interoperability and composition within a digital content distribution system are studied and their threat mitigation capabilities as well as interactions with legal frameworks are examined.","title":"CAREER: Cryptographic Aspects of Digital Rights Management","awardID":"0447808","effectiveDate":"2005-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["381857"],"PO":["529429"]},"102926":{"abstract":"Research concerning the relationship between technology and ethics has largely focused on responsible and irresponsible use of technology by human beings, with a few people being interested in how human beings ought to treat machines. In all cases, only human beings have engaged in ethical reasoning. The PIs believe the time has come to add an ethical dimension to at least some machines. Recognition of the ethical ramifications of behavior involving machines, and recent and potential developments in machine autonomy, necessitate this. In this project, the PIs will explore this dimension through investigation of what has been called machine ethics, which (in contrast to computer hacking, software property issues, privacy issues and other topics normally ascribed to computer ethics) is concerned with the consequences of behavior of machines towards human users and other machines. Clearly, relying on machine intelligence to effect change in the world without some restraint can be dangerous. Until fairly recently, the ethical impact of a machine's actions has either been negligible (e.g., a calculator) or, when considerable, has only been taken under the supervision of a human operator (e.g., robotic automobile assembly). As we increasingly rely upon machine intelligence with reduced human supervision, we will need to be able to count on a certain level of ethical behavior from them. And as machines are given more responsibility, an equal measure of accountability for their actions must be meted out to them if we are to avoid undesirable machine behavior. In this project, the PIs will implement prototype systems in limited domains, one that incorporates an ethical dimension to its advantage, and another that learns weights of competing duties to the end of providing a decision procedure for an ethical theory. The PIs hope these investigations will sharpen their understanding of the field, so that they can compose a well-argued position paper that clarifies the objectives of and answers objections to machine ethics, as a first step towards dealing with an issue that has been of concern since the beginning of the 20th century but has seen little serious scientific effort. <br\/><br\/>Broader Impacts: The PIs will develop a machine ethics website, and will organize a AAAI Machine Ethics symposium tentatively planned for fall 2005. The outcomes of this research will contribute to the development of autonomous intelligent agents that could be used to replace human effort in many subservient, dangerous, or undesirable tasks. In the longer run, an ethical dimension in machines could be used to alert humans who rely on machines before they do something that is ethically questionable, averting harm that might have been caused otherwise. Such capabilities might be harnessed to assist us in ethical decision-making; machine-machine relationships might also benefit, in that the new capabilities could provide a basis for resolving resource conflicts or predicting behavior of other machines. Perhaps most importantly, the behavior of more fully autonomous machines, guided by an ethical dimension, might be more socially acceptable in real-world environments than that of machines without such a dimension.","title":"SGER: Towards Machine Ethics","awardID":"0500133","effectiveDate":"2005-01-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["529182",271428,271429],"PO":["565227"]},"100805":{"abstract":"The goal of this project is to develop algorithms that will allow robots to discover theoretical entities -- that is, causally relevant features of the environment that cannot be sensed directly. The algorithms developed by the PI will make it possible for robots to expand their understanding and control of the world around them by discovering theoretical entities, such as force and mass, in much the same way as human scientists do. This project also aims to shed light on human cognition, particularly about how we acquire foundational concepts. Bayesian Model Merging will be used to learn a model of the robot's environment. Non-determinism in action outcomes indicates the existence of theoretical entities, and mutual information among posited theoretical entities suggests that a single entity explains observed non-determinism and validates its causal efficacy. This work will be evaluated in three domains: (1) a simulated robot with realistic physics, (2) process control in an aluminum smelting plant, and (3) visual object recognition. This project will make it possible for robots to see beyond the \"veil of perception\", to overcome limitations of their sensory systems (as humans have), and to better understand, predict, and control their environments. In applying these algorithms to the aluminum smelting process, it will lead to reductions in energy consumption and production of greenhouse gases. Planned educational activities include working with female and minority undergraduate students, teaching a freshman seminar on the scientific method, and development of a new graduate-level course in robotics.","title":"CAREER: Discovering Theoretical Entities","awardID":"0447435","effectiveDate":"2005-01-15","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["518236"],"PO":["491702"]},"97294":{"abstract":"The goal of this project is to develop a plan to increase the number of under-represented students (Hispanics, African Americans, American Indians, and women) pursuing M.S. and Ph.D. degrees in computer engineering and computer science by enhancing research opportunities in the areas of computer networking and medical imaging. The project achieves its goal through three specific activities: (1) enhancement of research infrastructure in the computer networks and computerized tomography fields, (2) creation of collaborative research opportunities with the other research institutions in the region and development of joint mentorship program with local industry, and (3) improvement of minority students recruiting and retention efforts. The research in this project is in the areas of security of mobile ad hoc networks (MANETs) and sensor networks and image reconstruction in Computerized Tomography. The project develops methods for authentication, and trust establishment and maintenance in MANETs. It also develops and implements effective new methods of image reconstruction from projections that are based on non-traditional tensor and paired representations of images in forms of totalities of \"independent\" splitting signals. Creation of collaborative research opportunities will enhance UT San Antonio research, and the joint mentorship program will provide industrial experience to students. The results of these planning efforts provide the basis for developing proposals to be submitted to NSF's Computing Research Infrastructure program and Advanced Research and Education program.","title":"MII: Infrastructure Improvement in Computer Engineering Education and Research: Computing, Networking and Security","awardID":"0424583","effectiveDate":"2005-01-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7399","name":"CISE MINOR INST INFRA (MII) PR"}}],"PIcoPI":["297664",255963,255964,"474417"],"PO":["297837"]},"100909":{"abstract":"This research aims at establishing new theoretical foundations for nonlinear optimization of communication systems, developing efficient and distributed solution algorithms, and applying the methodologies to enable next generation broadband access networks. An important goal is to transfer the elegance of mathematical models and analysis to practical communication system design, with significant impacts on economics and ways-of-life in the society through collaboration with several major companies. Furthermore, two new courses are developed on optimization methodologies for communication systems. Using a just-in-time pedagogical approach and a modular structure, these courses traverse the disciplinary boundaries among electrical engineering, computer science, and operations research, and the traditional divide between physical layer and networking layers.<br\/><br\/>The investigation utilizes the power of recent developments in nonlinear optimization to tackle a much wider scope of problems in the analysis and design of communication systems than what the traditional linear programming methodologies allow, touching every layer of the layered network architecture, making practical impacts to real world deployments, and leading to a new intellectual foundation for communication systems. There are two major thrusts of research on several indispensable and interdependent areas in wireless and wired communications. First is information-theoretic limits characterized and computed using optimization methods. The investigator develops a Lagrange duality approach to prove, bound, and compute channel capacity and rate distortion functions for single and multiple terminal systems. Second is network resource allocation in the utility maximization framework, including analysis of Internet protocol of TCP congestion control and it's interact ional with other protocols as distributed algorithms solving implicit network utility maximization problems. The 'layering as optimization decomposition' approach is developed to provide a unified view on disparate problems in communication networks.","title":"CAREER: From Shannon to TCP: Theory, Algorithms, and Applications of Nonlinear Optimization in Communication Systems","awardID":"0448012","effectiveDate":"2005-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["561963"],"PO":["432103"]},"99420":{"abstract":"Abstract<br\/>Language Towers as Desigh Frameworks<br\/>Olin Shivers, Panagiotis Manolios (Georgia Tech) 0438871; <br\/>Matthew Flatt (University of Utah) 0438847<br\/><br\/>Good notations enable good design: they channel designer effort away from infeasible designs, highlight novel aspects of a specific design, supress inessential detail, and enable both human and automated reasoning about the artifact being described. Unfortunately, a tremendous amount of labor is required at the meta-design level to implement the tool suites supporting design in a new, extended, or domains-specific notation. This labor overhead means it is not practical for most designers and engineers to incorporate notation design, or meta-design, into their design methodology.<br\/><br\/>This research explores developing the meta-tools to allow the development of specialized notations, allowing designers to better express and reason about their artifacts. The focus of the research is on enabling design-time reasoning---what the programming-language community refers to as \"static semantics\"---of the designed artifact.<br\/><br\/>The resulting framework allows the construction of \"language towers,\" that is, notations defined at varying levels of abstraction, linked by procedurally-encoded static semantics (analyses) and dynamic semantics (translations) between the levels of the tower. While the work has its origin in the research underlying the Scheme macro system, it is intended to be applied to language frameworks that have much greater static-semantic content.","title":"SoD: Language Towers as Design Frameworks","awardID":"0438847","effectiveDate":"2005-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["518130"],"PO":["564388"]},"98321":{"abstract":"This project studies the theory of multidimensional<br\/>channels and develop effective coding techniques for such<br\/>channels. The coding techniques investigated are of three<br\/>types: error-correction channel coding, constrained coding,<br\/>and joint source-channel coding. Emphasis is placed on<br\/>applications to two-dimensional magnetic and optical<br\/>recording as well as three-dimensional holographic<br\/>recording. These are the storage devices of the future.<br\/><br\/>The investigation involves code design, theoretical analysis,<br\/> and computer simulation.<br\/><br\/>The main topic areas investigated for multidimensional<br\/>channels are:<br\/><br\/> Interleaving techniques in two and three dimensions<br\/> Multidimensional codes correcting cluster errors <br\/> Constrained coding and defect avoidance for<br\/>multidimensional media - Progressive source coding for<br\/>multidimensional channels - Index assignment for<br\/>multidimensional channels<br\/><br\/>Multidimensional storage devices require a completely new<br\/>theory and new technical breakthroughs, since most of the<br\/>existing theory for error-correcting codes, constrained<br\/>codes, and source-channel codes was developed in the context<br\/>of one-dimensional applications. The problems associated<br\/>with multidimensional channels are usually much more<br\/>challenging than their one-dimensional counterparts.<br\/><br\/>In particular, interesting technical problems arise due to<br\/>the spatially dependent nature of errors and constraints in<br\/>multidimensional recording media. New error-correcting codes<br\/>and interleaving techniques are needed to effectively<br\/>protect data stored on such media. The study of constrained<br\/>coding for multidimensional channels is still in its infancy<br\/>, and needs substantial further research to blossom into a<br\/>theory. Joint source-channel coding techniques are needed<br\/>to maximize the recovered source fidelity for images and<br\/>video stored on multidimensional devices.","title":"Advanced Coding for Multidimensional Channels","awardID":"0431177","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["517054","485936"],"PO":["432103"]},"95375":{"abstract":"The goal of the project is to construct a system for automatic extraction of audio files containing a tune performed with desired timbre, given microphone vocal input. The system will be able to identify which audio files within the searched database match the tune and timbre of specified instrument or instrument family with selected articulation. The approach consists of sound processing, segmentation, and indexing of audio files for content-based searching. The first step is the elaboration of the appropriate sound description for timbre classification, based on low-level sound parameters. The main process involves segmentation of audio files from the database into musical events, and indexing them using a dedicated tree-based structure. When this step is accomplished, the database of audio files, indexed using the above procedure, can be searched. <br\/><br\/>This research project has a strong educational component. It involves graduate students gaining expertise in sound processing under the guidance of PIs and adding this new research domain into a set of topics currently offered by the graduate program in Computer Science at UNC-Charlotte. Involvement of faculty and graduate students from the Polish-Japanese Institute of Information Technology in this project will add not only a strong international component to it, but also will expose graduate students at UNC-Charlotte to international collaboration.<br\/><br\/>As the result of this project, new tools applicable for automatic search of audio files matching desired contents, including melody and timbre information, will be available to users and research community.","title":"Automatic Indexing of Audio with Timbre Information for Musical Instruments of Definite Pitch","awardID":"0414815","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["440783",250095],"PO":["433760"]},"99423":{"abstract":"This research project focuses on developing a data integration and transformation process that supports maintainability, adaptability, and evolution. Data integration systems are software systems that permit the transformation, integration, and exchange of structured data that has been designed and developed independently. The often subtle and complex interdependencies within data can make the creation, maintenance, and use of such systems quite challenging. The PI, with the collaborator Renee Miller (University of Toronto) have available a robust arsenal of tools and mechanisms for reconciling semantic differences in how data is represented including views, mappings, and transformation languages. The major focus is on the maintenance of the metadata necessary to achieve semantic integration and sharing of data. This project develops an integration and transformation process that is designed for evolution. The research will develop a new theory of metadata discovery and adaptation based on modern statistical learning and a new theory of the data integration process, that supports not only automation, but also maintainability, adaptability and evolution. The major contribution of this research will be the development of a design process that supports robust data sharing, an crucial aspect in the Science of Design. As part of the broader impacts of this work, the expected results will contribute to an enhanced infrastructure for research by developing a benchmark for schema and mapping discovery and management tasks. The research results and the benchmark that will be accessible on the project Web site (http:\/www.cs.umd.edu\/~getoor\/sod) to facilitate dissemination of knowledge and tools to a variety of scientific communities. The methods developed in this project will be of particular value to scientists who routinely need to gather, manage, and integrate diverse data sets. The researchers also plan to partner with industry collaborators in order to learn from and address industry needs, receive feedback, and facilitate technology transfer.","title":"SoD: Data and Meta-Data Integration Maintenance","awardID":"0438866","effectiveDate":"2005-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T510","name":"NGIA-ENTITY RESOL FOR GEONAMES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["518332"],"PO":["565227"]},"94981":{"abstract":"Understanding Image-feature and Decision-procedure Choice for Human Face Detection<br\/><br\/>NSF Proposal 0413284<br\/><br\/>Abstract<br\/><br\/><br\/>Face detection algorithms have improved significantly in the last five years, in part because of a shift away from handcrafted systems to supervised learning systems that discover effective feature combinations from large amounts of training data. This broad characterization covers three prominent algorithms: the Viola and Jones Ada Boost algorithm, the statistical model approach of Schneiderman, and the SNoW algorithm of Yang et al. However, beyond this broad characterization, these algorithms differ greatly in detail. In particular, they use different image-features and different decision-procedures for determining whether a face is present. Why do these very different algorithms all perform relatively well, and how do the image-feature and decision-procedure choices implicit in these algorithms interact? This study will reveal the underlying fundamentals of these three approaches and others by establishing a common framework for combining and comparing image-feature extraction and decision-procedures. Empirical advances will be made in characterizing face detection tasks in an algorithm independent fashion critical to the development of better face detection algorithms. The practical impact of this research is two-fold. New open source versions of three prominent face detection algorithms will be developed and integrated into the current CSU Face Identification Evaluation System. Downloads of the current system exceeded 7,000 in November 2004, and the inclusion of face detection will enhance this tool. More broadly, better, more reliable face detection is a key stepping stone to better face recognition. Competent, reliable face recognition is highly valuable for many applications such as security. However, the practical value of good face recognition transcends security applications -- computers are more likely to interact helpfully with people they can recognize.","title":"Understanding Image-feature and Decision-procedure Choice for Human Face Detection","awardID":"0413284","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["479306","412511"],"PO":["564316"]},"98942":{"abstract":"National Science Foundation<br\/>NETS - Research in Network Technologies and Systems <br\/>CISE\/CNS<br\/><br\/><br\/>ABSTRACT<br\/><br\/>Proposal Number: 0435259<br\/>Principal Investigator: Kalyanaraman, Shivkumar<br\/>Institution: Rensselaer Polytechnic Institute<br\/>Proposal Title: NeTS-NR ROSS.Net: A Platform for Integrated Large-Scale Net-work Design of Experiments and Simulation<br\/><br\/><br\/>Performance analysis tools to aid design, analysis, understanding and operation of networking protocols on large-scale and in heterogeneous deployment con-texts are urgently needed in networking research. Though there are popular tools for small-scale analysis and emerging test-bed facilities, large-scale analy-sis requires tools such as scalable simulators, experiment design and empirical modeling engines (a.k.a \"meta-simulation\" tools). The overall goal of this project is to provide tools that significantly improve the way networking community de-signs, tunes, and studies network protocols, especially for target deployment in large-scale, heterogeneous and time-varying conditions. In particular, the pro-ject develops an experimentation platform, called \"ROSS.Net\", with meta-simulation and simulation capabilities. In order to rapidly interpret system be-havior, ROSS.Net employs large-scale experiment design tools that allow model-ing and optimization of protocol response, i.e. a response surface in a large-dimensional parameter space. The goal is to generate a unified search, optimi-zation and sparse empirical modeling framework with demonstrated ability to pose meaningful large-scale design questions and provide \"good\" models rapidly for on-line operation. For a researcher to selectively compose a set of experi-ments resulting in accurate answers to the questions posed by the model de-signer; ROSS.Net uses reversible computation techniques to enable memory-efficient optimistic parallel simulation and model construction. The work has immediate impact in applications broadly in the area of computer systems where large-scale design is crucial (e.g. operating systems, distributed systems). Particularly, features like fast-approximation and sparse modeling have poten-tial impact in areas far from computer networking such as include industrial quality control, agriculture, and bioinformatics.<br\/><br\/>Dr. Admela Jukan<br\/>Program Director, CISE\/CNS<br\/>Aug 5, 2004.","title":"NeTS-NR ROSS.Net: A Platform for Integrated Large-Scale Network Design of Experiments and Simulation","awardID":"0435259","effectiveDate":"2005-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["541895","541895","342900"],"PO":["565090"]},"95312":{"abstract":"This project seeks to improve information-access systems for large digital collections by incorporating metadata about the documents' genres. Genre metadata facilitates information retrieval and use. For example, people rarely have to read every word to understand documents' meaning. Instead, they start by identifying the kinds of documents they are faced with, and then use different types of documents in appropriate ways. For example, a grant proposal is used differently from a syllabus, a product brochure or a bank statement. Information-access systems would be more useful for many tasks if they could similarly distinguish the form and purpose of documents (that is, their genres).<br\/><br\/>The study includes a series of human-centered studies of information use by K-12 teachers to develop an understanding of genre and its role in information use. Based on these studies, the researchers develop a taxonomy of relevant genres and the features that identify each. The study includes the development and preliminary testing of genre-enhanced interface prototypes for information access tools. The study provides an understanding of the role of document genre in information-based tasks, evidence of the level of utility of genre metadata in improving user performance on those tasks and development of methods for studying genre.<br\/><br\/>Broader impacts of the study include a reusable classification of genres, enhancing the infrastructure for research and advancement of the domain of education, both in the population targeted by the studies (K-12 teachers) and by including students in the research. The project Web site (http:\/\/crowston.syr.edu\/genre\/) provides access to more information.","title":"How can document-genre metadata improve information-access for large digital collections?","awardID":"0414482","effectiveDate":"2005-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[249924,"565342"],"PO":["433760"]},"109222":{"abstract":"The use of wireless technology has the potential to significantly reduce the cost and enhance the growth of broadband data access, which is currently dominated by the cost of installation and maintenance of wired networks. A significant challenge in wireless networks is the issue of cross-layer design, which this research addresses by modeling broadband wireless networks as a complex system of interacting economies with two parts, wireless bandwidth (local), and the network core link-capacities (end-to-end). Media access control (MAC) provides a bandwidth multiplexing scheme, while at the transport layer, congestion\/rate control determine the demand, hence the buffer and capacity allocation. In other words, the optimal design of broadband wireless networks can be viewed as the problem of scalable yet optimal utilization\/sharing of various resources among autonomous users. Economists have been studying similar problems in various contexts such as air pollution, traffic management, etc. It is known, for example, that in all of these scenarios a centralization of decisions is not always possible or desirable. At the same time, unregulated access can result in over-utilization (which is suboptimal) due to each user's incentive to deviate from the common good (known as \"tragedy of the commons\"). Similarly, addressing the fundamental trade-offs between fairness, optimal allocation, and decentralization is essential in a cross-layer design of broadband wireless networks. This research provides a novel methodology that addresses such issues across various layers of protocol stack, and integrates these interdisciplinary studies into the academic curriculum.","title":"CAREER: Cross-Layer Integrated Protocol Design for Broadband Wireless Data Networks: A Microeconomic Approach","awardID":"0533035","effectiveDate":"2005-01-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["553607"],"PO":["434241"]},"108012":{"abstract":"Robotics and Computer Vision Program<br\/><br\/>ABSTRACT<br\/><br\/><br\/>Proposal #: 0330008<br\/>Title: SENSORS: Cooperative Robotics and Geometric Optimization for Mobile Sensors<br\/>PI: Bullo, Francesco<br\/>University of Illinois at Urbana-Champaign<br\/><br\/> This project focuses on mobile and tunable sensor networks and on the algorithms required to perform spatially-distributed sensing tasks including coverage, surveillance, exploration, target detection, and search. To achieve these desirable capabilities, the major objective of this project is the design of cooperative control algorithms for sensor networks. Practically meaningful algorithms need to take into careful consideration all constraints on the mobile sensor network. In particular, this project will focus on algorithms that are amenable to implementation in a cooperative setting, i.e., they are required to be distributed, asynchronous, adaptive, and verifiably correct.<br\/><br\/>The innovative technical approach relies on the following two main ideas. First, optimal sensor coverage is formalized as an aggregate performance metric via methods from geometric optimization. Second, a class of cooperative control algorithms are synthesized by generalizing the classic Lloyd algorithm from quantization theory. The resulting control laws are interaction protocols between the mobile sensors and include behaviors such as, ``move away from your closest neighbor,'' and, ``move toward the geometric center of your sensing region.''<br\/><br\/>Broad dissemination of this research will take place through regular publications, conference presentations and technical reports. Undergraduate and graduate students in the College of Engineering at UIUC will be involved in building the experimental setups and implementing cooperative control algorithms both in the teaching-oriented Mechatronics and Robotics Laboratories as well as in the research-oriented Agile and Coordinated Vehicles Laboratory.","title":"SENSORS: Cooperative Robotics and Geometric Optimization for Mobile Sensors","awardID":"0525543","effectiveDate":"2005-01-01","expirationDate":"2008-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["495278"],"PO":["403839"]},"94960":{"abstract":"The research in this proposal will develop probabilistic models that learn abstract images properties and invariant features from the statistical regularities of natural images. The long-term goal of this research is to understand the essential computational principles underlying the transformation of visual sensory codes into increasingly abstract representations that reveal the intrinsic properties of natural visual images and scenes. The specific aims are to develop probabilistic models for learning efficient, hierarchical representations of natural images; to extend these models to allow overcomplete representations and additive noise; and finally to model the natural image density variation in local spatial and temporal regions. This research will provide a deeper understanding of the theoretical issues and computational challenges involved in deriving abstract and invariant representations from statistical regularities in natural images. Progress toward these goals will have a broad impact in applications that require discovery and encoding of intrinsic structures in complex visual images and scenes, such as image compression, visual scene analysis, image processing, and machine vision. The statistical models proposed in this research are broadly applicable and could also have impact in many areas of signal processing, knowledge discovery, and data mining.","title":"Learning Higher-Order Image and Scene Structure From Natural Image Statistics","awardID":"0413152","effectiveDate":"2005-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}}],"PIcoPI":["483749"],"PO":["564318"]},"94972":{"abstract":"Abstract: 0413214. Alan L. Yuille.<br\/><br\/>The proposal will develop a computational framework for parsing images. Image parsing subsumes many standard computer vision tasks such as object detection and image segmentation. The approach is based on Bayesian inference using the Data Driven Markov Chain Monte Carlo (DDMCMC) algorithm. It involves modeling the diverse visual patterns that occur in natural images by hierarchical generative models. It also requires an algorithm, DDMCMC, that is capable of performing inference on these models. The design principle of DDMCMC is to use discriminative models to guide the search through the parameters of the generative models. Specific applications of image parsing include the development of computer vision systems to help the visually disabled by detecting and reading text, and detecting other salient objects such as faces. Hence we except this work to have broad impact in helping the visually disabled. Other applications include context based image retrieval and automatic security systems. The work will also help train 2-3 graduate students in Computer Science and Statistics.","title":"Image Parsing: Integrating Generative and Discriminative Methods","awardID":"0413214","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549461","456867"],"PO":["564318"]},"94983":{"abstract":"A novel pulsatile jet propulsion scheme for low speed maneuvering of small underwater robots is developed, demonstrated, and characterized. This propulsion scheme is loosely analogous to that used by squid and jellyfish. The potential for pulsatile jet propulsion is explored by first optimizing the design of a pulsatile jet actuator and associated actuation concepts. Next, a vehicle-level fluid dynamical model is developed in order to capture the interaction of the pulsatile jet flows with the primary flow past the vehicle. Prior development in nonlinear averaging-based vehicle feedback control schemes is adapted to this technology using such models. The pulsatile jet prototypes and control scheme is integrated into a prototype underwater vehicle, whose performance is characterized. The suggested propulsion scheme has very few moving parts, has no protruding components that increase drag, and takes up relatively little volume.<br\/><br\/>Undergraduate engineering students are heavily involved in the design, fabrication, and testing of the pulsatile jet actuators and underwater vehicle prototypes proposed in this project. These activities provide excellent hands-on engineering experiences for the participating students.","title":"Collaborative Research: Pulsatile Jet Propulsion for Underwater Robots","awardID":"0413300","effectiveDate":"2005-01-01","expirationDate":"2008-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["500157"],"PO":["403839"]},"99428":{"abstract":"Often today, the tools used to design a small personal database are as complex as the tools used to design enterprise-size information systems. This challenges the human ability to deal effectively with the complex structures employed in these tools. In addition, as the world gets increasingly networked, we find it possible and desirable to access, and integrate information from multiple autonomously created data stores. Even if each of these data stores individually is simple, the entire collection may be very complex. Finally, information stores persist over time, and our needs change over this period. In consequence, the stores need to evolve with time, as do our queries of them. Information systems must be designed to adapt to this change. <br\/><br\/>This project develops techniques for the incremental design of XML-based information systems. Techniques are developed for the hierarchical decomposition of schemas and through this, resolution of multiple incomplete schema specifications considered as \"views\" of related information contexts. Automated techniques are also developed for mapping these into XML schema that are both suited for efficient query processing as well as being normalized to satisfy known functional dependencies and avoid update anomalies. <br\/><br\/>This project develops a formal conceptual basis for the design of complex heterogeneous information systems. It also develops incremental techniques to deal with evolutionary change over time, as well as with the merger (and loss) of data stores. If successful, this project will greatly reduce the human effort involved in the design and maintenance of information stores, particularly for designers and users of information systems who may not be familiar with the underlying technical details, such as domain experts who are interested in bringing together information from many heterogeneous information sources and whose information needs change rapidly. The likelihood of such impact will be maximized by working closely with a group of biologists who will serve as local users of the technology and provide feedback. The project Web site http:\/\/www.eecs.umich.edu\/~jag\/design\/ will be used to disseminate the results, including software tools created in this project that we will make available free of charge for academic use.","title":"SoD: Incremental Design of Complex Information Systems","awardID":"0438909","effectiveDate":"2005-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":["533266"],"PO":["565227"]},"94841":{"abstract":"Robotic Insect Flight Stabilization Using Biomimetic Sensors<br\/>Ronald S. Fearing (Principal Investigator)<br\/>Dept. of EECS<br\/>Univ. of California, Berkeley 94720<br\/><br\/><br\/>This project concerns flight control for miniature flapping wing robotic fliers. The focus of the research will be on the use of biomimetic (inpired by nature) sensors to stabilize the flight of an approximately one tenth gram two wing robot. Two winged flapping<br\/>fliers such as true flies provide unmatched capability for aerial maneuverability and robustness when flying in cluttered environments. At this small scale, conventional sensors require too much electrical and computational power to use. This research project will study the use of rapidly-prototyped, low-power biomimetic sensors<br\/>modelled after insect ocelli (for visual horizon sensing), halteres (for angular rate), and eyes (for optical flow) for flight control.<br\/><br\/>Intellectual Merit:<br\/><br\/>The proposed research advances understanding in biomimetic sensors and<br\/>flight control strategies for flapping wing fliers. For insect-sized flying robots, flapping flight provides very high maneuverability while requiring a very tight coupling between sensors and wing actuation. This project will also lead to better understanding of extremely low power, sensor-rich control techniques for mobile micro-robots.<br\/><br\/>Broader Impacts:<br\/><br\/>This project will provide interdisciplinary education for undergraduate and graduate students in biomimetic sensing and control, as well as micro-robotics. For the broader robotics community, rapidly prototyped microsensors will be useful on a wide variety of mobile platforms. For society, a potential broader impact will be large numbers of low-cost, light-weight flying robots which could robustly enter unknown and hazardous environments, potentially keeping rescue workers out of harm's way.","title":"Robotic Insect Flight Stabilization Using Biomimetic Sensors","awardID":"0412541","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["420868"],"PO":["403839"]},"104088":{"abstract":"This award funds a workshop to bring together ecological and environmental decision makers from government and non-government organizations, computer scientists, social scientists, ecologists and biologists, and funding and mission agencies to address how the emerging area of eco-informatics can be harnessed to help solve problems of ecological and environmental decision makers. Information technology issues to be addressed include: data gaps, data presentation, and how to use or create appropriate indicators. Computer science research areas to be included in the workshop discussion are: information integration, modeling and simulation, data quality, ontologies, human-centered issues such as training, technology transfer, best practices for information provision and use, and human-friendly software for decision makers and information providers. Thirty-five participants from the resource management, computer science and social science research, and mission agencies will attend. <br\/><br\/>The primary outcome of the workshop is a January 2005 report to be widely disseminated, defining the problems faced by ecological and environmental decision makers, the research that might begin to address those problems, and the likely impact on specific decision making scenarios. The aim is to help program officers from mission and research funding agencies better understand how new information products and information technology can foster better ecological and environmental decisions. <br\/><br\/>Resource managers and decisions makers will have the opportunity to articulate problems and see them expressed in the report; they will gain a better understanding of the current state of the art of information technology, and what promise technology has to offer for future improvements. Participants from the research community will learn about new research problems and competitive opportunities. Both decision makers and researchers will have opportunities to learn about potential collaborators. <br\/><br\/>The report will briefly address how new research and resource management policy might be integrated into curricular design in ecology, biology, computer science, social science, mathematics, and engineering, to be informed by a report from students providing logistical support at the workshop.","title":"Eco-Informatics for Decision Making Workshop","awardID":"0505790","effectiveDate":"2005-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["474015"],"PO":["371077"]},"94952":{"abstract":"A novel pulsatile jet propulsion scheme for low speed maneuvering of small underwater robots is developed, demonstrated, and characterized. This propulsion scheme is loosely analogous to that used by squid and jellyfish. The potential for pulsatile jet propulsion is explored by first optimizing the design of a pulsatile jet actuator and associated actuation concepts. Next, a vehicle-level fluid dynamical model is developed in order to capture the interaction of the pulsatile jet flows with the primary flow past the vehicle. Prior development in nonlinear averaging-based vehicle feedback control schemes is adapted to this technology using such models. The pulsatile jet prototypes and control scheme is integrated into a prototype underwater vehicle, whose performance is characterized. The suggested propulsion scheme has very few moving parts, has no protruding components that increase drag, and takes up relatively little volume.<br\/><br\/>Undergraduate engineering students are heavily involved in the design, fabrication, and testing of the pulsatile jet actuators and underwater vehicle prototypes proposed in this project. These activities provide excellent hands-on engineering experiences for the participating students.","title":"Collaborative Research: Pulsatile Jet Propulsion for Underwater Robots","awardID":"0413078","effectiveDate":"2005-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["448655","301111"],"PO":["403839"]},"115078":{"abstract":"Clusters of workstations have become standard system platforms for many scientific, commercial, and educational applications. This research focuses on effective usage of global memory resources to deal with dynamic job demands in large cluster systems. The targeted workloads are data-intensive scientific applications, Internet web accesses, and data processing for commercial databases. The first objective is to develop analytical\/experimental performance models\/tools to quantitatively examine the impact of the technology changes and data-intensive workloads to resource management policies, and to provide resource management guidance. The second objective is to design several memory-centric load sharing schemes by comprehensively considering dynamic job interactions and global cluster system resources. Finally, these schemes will be implemented and tested in a large cluster system. The impact and contributions of the proposed projects will be: (1) providing insights into memory systems performance and understanding potentials of memory-centric load sharing in clusters; (2) providing effective system solutions to adapt rapid changes of technology and workloads in cluster computing; and (3) making low-cost clusters more accessible for both scientists and business users to effectively run their large and demanding applications.","title":"Memory-Centric Resource Management for Data-Intensive Workloads on Clusters","awardID":"0607241","effectiveDate":"2005-01-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["551992"],"PO":["309350"]},"100371":{"abstract":"This project aims to address the issue of inadequate software support for High Performance <br\/>Computing by improving two widely used standard libraries, LAPACK and ScaLAPCK, both <br\/>of which provide numerical linear algebra kernels. <br\/>By a combination of algorithmic research, an on-going user and vendor survey (at <br\/>icl.cs.utk.edu\/lapack-survey.html), and anticipation of the demands and opportunities of new <br\/>architectures and modern programming languages, the following key improvements to the <br\/>current versions have been identified. <br\/><br\/>The use of novel, improved algorithms. <br\/>Improved ease of use. <br\/>Performance Tuning. <br\/>Improved reliability and support. <br\/><br\/>First, new state-of-the-art algorithms will improve speed, accuracy, and memory efficiency. <br\/>Second, improved user interfaces that exploit features of modern programming languages are <br\/>important for better ease of use and also hide some of the underlying complex, possibly <br\/>distributed, data structures. Third, the performance of both libraries crucially depends on a <br\/>number of machine-dependent parameters whose setting can benefit from automatic tuning <br\/>techniques developed very successfully in the ATLAS project. Last, there is a huge demand for <br\/>ongoing support and maintenance of both LAPACK and ScaLAPACK, and there is a need for <br\/>installing a formal mechanism for user feedback, for tracking bugs, for version management, <br\/>and facilitated installation. <br\/><br\/>Broader Impacts: <br\/>LAPACK and ScaLAPACK have been adopted by many vendors as the basis of their own <br\/>libraries: SGI\/Cray, IBM, HP-Convex, Fujitsu, NEC, NAG and IMSL, and the Mathworks <br\/>(producers of Matlab). For this reason, the proposed changes will have a large impact. <br\/>Furthermore, recent origin of most of the algorithms described in this proposal means that there <br\/>are not yet any easily accessible descriptions suitable for education. As part of the project <br\/>documentation, tutorial material will be developed that is suitable for classroom instruction and <br\/>wide educational outreach. <br\/>The development of LAPACK and ScaLAPACK is part of a long and successful history of <br\/>collaboration between the PIs. In addition, for the current improvements, numerous outside <br\/>collaborators have offered support ranging from software and ideas to help in programming <br\/>and development.","title":"Reliable and Scalable Software for Linear Algebra Computations on High End Computers","awardID":"0444486","effectiveDate":"2005-01-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7417","name":"S AND T HIGH-END COMPUTING"}}],"PIcoPI":["558550","558475"],"PO":["565272"]},"104892":{"abstract":"The overall goal of this research is to introduce a new class of algorithms for solving complex optimization problems on graphs. <br\/><br\/>Intellectual Merit<br\/>This project contributes to applications by solving an important problem in high performance computing. The adaptive algorithm:<br\/>-computes a trajectory for achieving a target (clock cycle period)<br\/>-creates control points to correct a trajectory (guidance algorithm function)<br\/>-changes trajectory relative to inherent deviations<br\/>-timing delay accumulated along data paths when logic gates interconnect on the chip<br\/>-accumulated timing compared with projections, and bounds on distances between not yet placed components are reevaluated<br\/>-new bounds consistent with original clock cycle period used to find locations for a new group of components<br\/><br\/><br\/>Broader Impact<br\/>Preliminary experiments have shown that this methodology is indeed capable of producing chip design with better timing than any of existing systems for the test cases tried.","title":"SGER: Adaptive Multi-Objective Algorithms for High-Performance Designs","awardID":"0509782","effectiveDate":"2005-01-01","expirationDate":"2006-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":[276918],"PO":["565272"]},"98947":{"abstract":"National Science Foundation<br\/>NETS - Research in Network Technologies and Systems <br\/>CISE\/CNS<br\/><br\/><br\/>ABSTRACT<br\/><br\/>Proposal Number: 0435303<br\/>Principal Investigator: Panwar, Shivendra S.<br\/>Institution: Polytechnic University of New York<br\/>Proposal Title: High-Performance Stable Packet Switches<br\/><br\/><br\/><br\/>While switching capacity follows Moore's Law and doubles every 18 months, op-tical fiber line bandwidths double every 12 months. Consequently, packet switching technology continues to be one of the bottlenecks in the development of broadband networks. In this project, the research team has devised a new class of low complexity matching algorithms, i.e. Exhaustive Service Match with Hamiltonian Walk, which achieves stability and low packet delay, as opposed to cell delay, which was the focus of most previous research. Specifically, the fol-lowing two important issues are studied: (i) determination of the optimal packet delay for a matching algorithm, and (ii) options for the packet delay to increase sub-linearly with switch size under a general traffic pattern. This project will also address the class of switches that resolve the output contention by using the load balancing, where no scheduler is used, and re-sequencing is needed at the output. The total packet delay being investigated consists of the queuing delay and the re-sequencing delay. Another goal is to re-examine switch archi-tectures and their performance under more realistic long range dependent (LRD) traffic, and suggest improved architectures tuned to LRD traffic based on the insights thus derived.<br\/><br\/>Dr. Admela Jukan<br\/>Program Director, CISE\/CNS<br\/>Aug 5, 2004.","title":"High-Performance Stable Packet Switches","awardID":"0435303","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["525973","522037"],"PO":["565090"]},"98958":{"abstract":"Proposal Number: 0435353<br\/>PI: Thomas Little <br\/>Institution: Boston University <br\/>Title: Semantic Internetworking of Sensor Systems for Efficient In-Network Information Processing<br\/><br\/>Abstract: <br\/><br\/>Advances in sensor and computing technologies provide impetus for deploying wireless sensor networks in diverse applications ranging from environmental and habitat monitoring, power systems and manufacturing. Successful realization of such systems hinges on systematic methodologies to address and resolve bottleneck issues. Sensor network operation and lifetime is fundamentally limited by energy, a particular concern in environmental applications that necessitate long-term deployment. The project systematically interfaces new techniques for data networking and distributed information-processing to realize scalability and massive energy efficiencies in sensor network operation. The employed methods include novel semantic routing techniques and in-network localized distributed inferencing algorithms. A challenging ecological application, which is representative of the challenges arising in environmental monitoring, is addressed as proof-of-concept. Successfully completed project will lead to (1) an enabling technique for building systems to monitor and understand our environment and thus provide a framework for evaluating broad policy questions relevant to society; (2) new techniques and theories to advance the viability of large scale sensor networks as an engineering challenge; (3) novel, unanticipated insights and technologies in biology, geography, and engineering, which are bridged by the interdisciplinary effort; (4) scientific tools for scientists, educators, students, and like-minded individuals who might apply the results of the project. The results of the project will be disseminated through scholarly venues, journal, conference and online publications.","title":"NeTS - NOSS:Semantic Internetworking of Sensor Systems for Efficient In-Network Information Processing","awardID":"0435353","effectiveDate":"2005-01-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["514728","371069","430419","553668","451601"],"PO":["543507"]},"100372":{"abstract":"This conference, Advancing Knowledge and the Knowledge Economy, will bring together a large body of research for the first time in a way that gives participants and audience a coherent high-level perspective on what is known about how information and communications technologies (ICTs) and economic context are affecting knowledge processes and activities, how the economics of knowledge are changing with the emergence of distributed systems of innovation and learning, and the challenge of crafting public policies to advance the generation and effective utilization of knowledge. The conference will convey the importance of emerging issues in the management and economics of knowledge, including the design of cyberinfrastructure, to the international science and technology policy community.","title":"Advancing Knowledge and the Knowledge Economy","awardID":"0444492","effectiveDate":"2005-01-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["297929"],"PO":[264837]},"105652":{"abstract":"Feniosky Pena-Mora<br\/>9875557<br\/>ABSTRACT <br\/>---------<br\/><br\/>The objective of the proposed CAREER program is to develop a negotiation<br\/>methodology and tool for large-scale collaborative infrastructure projects.<br\/>The proposed methodology and tool will help: 1) organize negotiation<br\/>knowledge into a structure that enables systematic and scientific<br\/>exploration; 2) formally model the structural and substantive issues of<br\/>negotiations in large-scale infrastructure projects; and 3) understand and<br\/>model how communication technologies influence the pattern of such<br\/>negotiations. In addition, the proposed methodology and practical tool<br\/>will help engineers and designers establish negotiation strategies for<br\/>mitigating and resolving engineering conflicts in large-scale<br\/>infrastructure projects. Such a comprehensive negotiation methodology and<br\/>tool is expected to provide benefits for the entire life cycle of the<br\/>project by reducing costs, avoiding delays, eliminating counterproductive<br\/>negotiation plans, and improving negotiation skills among engineers working<br\/>on large-scale infrastructure projects.<br\/><br\/>In addition, the project will develop an integrated research laboratory and<br\/>classroom alliance aimed at improving the understanding of negotiation and<br\/>collaboration in the domain of large-scale engineering systems. This<br\/>effort will place tomorrow's communication and collaboration technologies<br\/>along with the understanding of how to use it most effectively, into the<br\/>hands of the next generation of professionals. This will be accomplished<br\/>through a unique research-industry-education-research feedback loop created<br\/>by the participation of five universities, two corporate entities, and one<br\/>public agency. The core of the research will be achieved through a formal<br\/>analysis cycle starting with information acquisition, formalization,<br\/>systematization, testing, refinement, and ending with information<br\/>dissemination. In this program, practice, research and education are<br\/>expected to work in an integrated fashion to understand and master<br\/>negotiation strategies in large-scale infrastructure projects requiring<br\/>collaboration between global teams. <br\/><br\/>The proposed program provides excellent benefits both, from the research<br\/>and educational perspectives in analyzing systematic negotiation strategies<br\/>for large-scale infrastructure projects. From the research perspective,<br\/>the key intellectual contribution of this work is the acquisition,<br\/>formalization, systematization, testing and dissemination of a partially<br\/>formalized structure of the existing negotiation knowledge, where the<br\/>fundamental questions about collaboration and negotiation could start to be<br\/>answered. From the educational perspective, the proposed class will<br\/>provide a forum in which the impact of a negotiation methodology addressing<br\/>the issues of time and distance on project life cycle will be explored.<br\/>Finally, the class will include the participation and guidance of seasoned<br\/>industry professionals in a controlled environment with real-world data.","title":"PECASE: Collaborative Negotiation Methodology for Large-Scale Infrastructure Projects","awardID":"0513489","effectiveDate":"2005-01-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1631","name":"CIVIL INFRASTRUCTURE SYSTEMS"}}],"PIcoPI":["508612"],"PO":["310666"]},"102022":{"abstract":"The objective of the proposed program is to provide undergraduate members of groups traditionally underrepresented in computer science and engineering with a practical and inspiring summer study experience to reinforce and supplement their regular course of study, build their leadership and teamwork skills, and motivate them to go on to pursue graduate degrees.<br\/><br\/>Intellectual Merit<br\/><br\/>Interns will gain expertise in the science of design learn to understand and frame problems, capture requirements and derive specifications for software engineering. The design of software will be applied to network systems, mathematic and simulation models, geographic information systems and renewable energy systems. <br\/><br\/>Broader Impact<br\/><br\/>REU-RMS at HSU will contribute to the broader goal of attracting more women and minorities to fields in computer science and engineering in which they are underrepresented, and preparing them for successful careers in those fields.<br\/><br\/>HSU will provide minority and women faculty in computing science, mathematics, engineering and natural resource sciences to serve as mentors for minority and women students in the program. <br\/><br\/>HSU is nationally known for its successfulprograms to recruit and support Native American students, particularly in sciences, natural resources, and engineering, and in addition has existing solid and successful recruiting and support programs for women and minority students.","title":"REU: Role Modeling in Sciences (REU-RMS)","awardID":"0453491","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[268930,268931],"PO":["381214"]},"95549":{"abstract":"The goal of this research project is to make a qualitative leap in the speed and accuracy of machine translation (MT) between human languages. The overall strategy is to marry novel schemes for representing structured knowledge about translational equivalence with recent and upcoming advances in machine learning. The use of machine learning offers the practical advantages of broad coverage, graceful degradation, and rapid adaptation to new domains of discourse. This work embraces the exciting recent strides forward in machine learning, and extends them to make structured predictions from structured data. At the same time, the research is grounded in sound knowledge representation schemes that can accommodate and exploit whatever information can be efficiently acquired on a large scale. When properly optimized, rich and extensible knowledge representation schemes enable MT systems to make important linguistic generalizations, leading to more accurate predictions in a wider variety of contexts.<br\/><br\/>Advances in this field have the potential to promote communication and understanding between different cultures, grease the wheels of international commerce, further the national security interests of the U.S. and its allies, and save lives by facilitating communication during natural or man-made catastrophes. The research results will be widely published, and the resulting software will be made publicly available. In addition, the research will be accompanied by a comprehensive educational program that includes new curricular materials, conference workshops, and ample opportunities for students at all levels to learn by doing.","title":"Statistical Machine Translation with Richer Knowledge Representation","awardID":"0415933","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[250539],"PO":["565215"]},"95407":{"abstract":"Statistical approaches to machine translation (MT) have been the subject of a great deal of recent research in natural language processing. A seminal piece of work in the field is that of researchers at IBM in the early 1990s; many of the original concepts within statistical MT were introduced within this paper, and much of the more recent work in statistical MT has built upon these ideas.<br\/><br\/>This project involves research that investigates alternative approaches to the IBM models. In particular, we are investigating the use of global feature-vector representations of translations, along with discriminative training methods. A first aim of the project is to develop a new framework for statistical machine translation. A second aim is to use the approach as a testbed for new features in machine translation systems. Our goal is to use the new approach to make a systematic study of issues such as word-sense disambiguation and the use of syntactic knowledge in statistical MT systems.<br\/><br\/>Improvements in the quality of machine translation systems could have a major impact on society. Recently, users of the world wide web or digital libraries (English speaking or otherwise) face a huge amount of text written in foreign languages. Human translation of any significant proportion of this text is not feasible. Machine translation systems could make a major impact on our ability to access natural language information in electronic form. In addition, this research will facilitate research on a wide range of features in MT systems, by a wide range of researchers.","title":"New Models for Statistical Machine Translation","awardID":"0415030","effectiveDate":"2005-01-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["508222"],"PO":["565215"]},"98927":{"abstract":"Proposal Number: 0435157<br\/>PI: Injong Rhee <br\/>Institution: North Carolina State University <br\/>Title: Exploring the Design Space of Sensor Networks Using Route-aware MAC Protocols<br\/><br\/>Abstract: <br\/><br\/>Applications for wireless sensor networks are extremely diverse, covering almost every walk of human life. Most existing work considers wireless sensor network design to be an optimization problem - minimizing energy consumption while maximizing some performance parameters. These studies typically offer only a few design choices (sometimes only one) that provide \"better\" optimization techniques for design of a few isolated network settings. Because of diverse application requirements, designers will benefit immensely from (sensor) network protocols that can provide a wide spectrum of design choices, especially for very low energy budget applications. In this proposal, the PIs describe an approach, Route-aware Media Access Control (RASMAC), that can greatly diversify design choices by extending existing MAC layer protocols to include an expressed tradeoff between energy and performance qualities. RASMAC uses knowledge of routing paths to opportunistically turn off the radio when a node is not on an active routing path. The research plans of the PIs center on developing and evaluating new MAC and routing protocols that improve the design choices offered by RASMAC and the performance modeling of these protocols. A comprehensive evaluation plan of the developed protocols and their performance models is planned that involve design and implementation of a wildlife tracking system. This offers a valuable opportunity for collaboration between computer scientists and biologists, which may produce critical advances in the ability to protect endangered species in the future.","title":"NeTS-NOSS: Exploring the Design Space of Sensor Networks Using Route-Aware MAC Protocols","awardID":"0435157","effectiveDate":"2005-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[260758,"450636"],"PO":["434241"]},"101793":{"abstract":"Abstract<br\/>CNS-0452547<br\/>PI: Alfred Weaver<br\/>Institution: University of Virginia<br\/><br\/>Title: REU Site: Creating Computer Applications for Medicine<br\/><br\/>This project creates a new Research Experience for Undergraduates site focused on the development of new computer applications for medicine. Cohorts of undergraduate students participate in a ten-week summer research program engaging in a current medically-related research project at the host institution. Through their research the students should improve the quality of healthcare delivery by devising, developing, adapting, or inventing computer-based solutions to modern medical problems.<br\/> <br\/>The intellectual merit of this project lies in strong research basis and the expertise of the collaborative partners participating in the project. The project team includes faculty with significant expertise in engineering and engineering ethics as well as medical doctors to oversee the medical aspects of the projects. The students in the project have the opportunity to work with teams to develop solutions to problems that are relevant and critical in an emerging interdisciplinary field that combines computer science and medicine.<br\/> <br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The project provides community college students an opportunity to engage in research and actively pursue a full range of professional opportunities. Thus, the project has the potential to produce new computer science undergraduate and graduate students as well as future faculty members. The project team of computer science faculty, engineering ethics faculty, and physicians provides each student cohort a broad exposure to the technical, medical, ethical, and social issues related to their problems. Thus the project represents a quality educational and professional experience, which is innovative and challenging to the students.","title":"REU Site: Creating Computer Applications for Medicine","awardID":"0452547","effectiveDate":"2005-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["368593"],"PO":["564181"]},"94956":{"abstract":"This project investigates unsupervised learning of motion models from visual sequences.<br\/>Recovery of detailed motion models would enable numerous applications of motion recognition, analysis and synthesis in areas such as surveillance, monitoring, multimedia, as well as understanding of motion in general. Describing motion is difficult because it requires the knowledge of motion categories; however, their manual specification is laborious and automated extraction is aggravated by noise and ambiguous measurements of the human motion from video. The central goal of this project is to develop methods and algorithms for grouping and analysis of motion acquired from video sequence using a unified statistical framework. The framework relies on concepts from statistical modeling, Bayesian networks (switching linear dynamic systems) and probabilistic reasoning to develop motion models of sufficient detail, quality, scalability and robustness that could be used to (1) group motion into perceptually plausible categories and styles, (2) recognize and predict motion dynamics, and (3) possibly synthesize natural-looking motion. The utility of the framework will be evaluated on sequences of human body or hand motion. The novel methods and algorithms developed in the course of this project may have wide applicability in many areas that involve modeling and grouping of sequence data, such as biotechnology and life sciences.","title":"Nonlinear methods for parametric grouping and modeling of motion","awardID":"0413105","effectiveDate":"2005-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["522466"],"PO":["564316"]}}