{"95617":{"abstract":"The success of the computer and video game software industry has spurred interest in exploiting games in a range of applications for business and consumer products as well as pedagogical agents. But building and playing computer games is a male business; existing games don't appeal to women and girls in the same way they do to men and boys. In this project, the PI aims to teach women to build games that engage women and girls. The PI's approach is interdisciplinary in nature, building on cultural analysis as a condition of successful and responsible technology design, by means of a collaboration between a computer scientist and an anthropologist. Thus, the project will contribute to bridging the divide between the sciences and the social sciences. The PI also expects that the project will contribute to gender theory, in that for the first time a significant cultural medium allows interactive experimentation with identity. The PI will explore how\/whether women designers build different games than men. The PI believes that the differences between male and female design have something to do with women's experiences with the cultural expectations and gender stereotypes that pervade existing games, that by critiquing existing games they will articulate how they practice gender in their day-to-day lives, where by building new games women will build new images of gender. Thus, the PI envisions that this project will enable more subtle and alternate gender roles and categories to emerge. <br\/><br\/>Broader Impact: The research will contribute to our understanding of the complications of gender in technology. It will enhance our understanding of the simultaneous shaping of culture and technology. And it will bring this integration into practice by simultaneously building and analyzing games, which have the power to increase computer literacy among girls and women, and thus in the end to attract more women to technological careers. Female game developers can change the repertoire of games that the industry produces; they will enrich the cast of characters and the modes of behavior that games provide, yielding more responsible re-creations of the cultural space that, whether they aim to or not, games unmistakably represent.","title":"GenderQuest","awardID":"0416364","effectiveDate":"2004-07-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["270550","464130"],"PO":["564456"]},"90458":{"abstract":"As the ubiquity and acceptance of mobile devices increases, a variety of new applications are emerging. One noticeable trend is the desire for media-rich content. The delivery of media-rich content is poised to transform computing. One specific area that will reap significant benefit from this new content is on-line collaboration. The focus of this work is the mobile network support of collaboration services for on-line collaborations, and the target application is a Collaborative Learning Environment. The requirements for this environment include the integrated use of real-time multimedia streaming, stored media streaming and voice streams, as well as automatic detection of services embedded in the environment. To support the collaborative environment, the following challenges are being addressed: (i) the design and analysis of network support for advanced media that is optimized for the characteristics of mobile wireless environments; (ii) the specification of mechanisms for resource monitoring and proactive networking, whereby the optimal service quality can be delivered to users based on the network and end device resources; and (iii) the development of automatic detection and provisioning of services, such that mobile users can discover and utilize services near their current location, as well as offer services to other mobile users. This work will result in the development of techniques for supporting collaboration services within mobile networks. Numerous applications, such as disaster control, administration, education, and public safety are likely to benefit. An immediate impact of this work is the education of undergraduate and graduate students through participation in this research.","title":"CAREER: Mobile Network Support for Collaborative Environments","awardID":"0347886","effectiveDate":"2004-07-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["560332"],"PO":["564777"]},"92912":{"abstract":"PROPOSAL NO: 0403130<br\/>INSTITUTION: University of Akron<br\/>PRINCIPAL INVESTIGATOR: Dai , Liming<br\/>TITLE: NER: Conducting polymer nanocontainers and conducting polymer-carbon nanotube junctions<br\/><br\/>Abtsract:<br\/>The recent development of nanoscience and nanotechnology could revolutionize computers and electronics by miniaturizing transistors and developing novel integration methods. This proposal aims at performing a feasibility study on the synthesis of conducting polymer nanostructures and their junctions with aligned carbon nanotubes. The proposed research stemmed from our long-term interest in nano-\/micro-fabrication of conducting polymers and aligned carbon nanotubes. The main approach involves the use of nanobubbles generated on aligned carbon nanotube tips as the template for electrodeposition of conducting polymers, leading to the generation of novel conducting polymer nanostructures (e.g. polymer nanotubes) and conducting polymer-carbon nanotube junctions. Examples include the formation of novel multiple metal-semiconductor or semiconductor-semiconductor junctions by sequential electrodeposition of different conducting polymer nanostructures on the aligned carbon nanotube tips and novel switchable junctions by electrochemical and\/or chemical doping of the conducting polymer components. In conjunction with the proposed multi-scale modeling and simulation efforts for fundamental understanding of the conducting polymer nanostructures and their junctions with carbon nanotubes, results from the proposed studies could open up new possibilities for fabricating novel integrated circuits and electronics, for example, through 3-dimensional integration and\/or by chemically-induced switching memory devices. In addition, the use of conducting polymer nanostructures for sensing and controlled release applications will also be demonstrated.","title":"NER: Conducting Polymer Nanocontainers and Conducting Polymer-Carbon Nanotube Junctions","awardID":"0403130","effectiveDate":"2004-07-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["501561","560171"],"PO":["562984"]},"92923":{"abstract":"PROPOSAL NO: 0403218<br\/>INSTITUTION: Case Western Reserve<br\/>PRINCIPAL INVESTIGATOR: Tabib-Azar , Massood<br\/>TITLE: NER: Solid Electrolytic Flash Memory Devices<br\/><br\/><br\/>Abstract:<br\/><br\/>The main objective of this exploratory study is to develop a new class of non-volatile ?memory devices based on solid-electrolytes such as CuxS and AgS<br\/>These devices are based on nanometer scale metallic wires grown by passing electric currents through electrodes on thin solid-electrolyte films. Very much like mechanical switches the \"1\" and \"0\" states of the memory is given by the presence (i.e., high conductance) state or lack (i.e., low conductance) state of a metallic wire between the electrodes. The proposed devices have a simple \"cross-bar\" geometry that makes them ideal for very large scale integration with high yield. Non-volatile memories are an integral part of \"embedded systems\" with growing importance in emerging systems where operating systems are stored in non-volatile memories for easy updating.<br\/><br\/>There are many other applications of the proposed studies in self-organized and forced assembly of nano-objects self-healing and programmable interconnects and break junctions and in weakly-coupled quantum particles for sensing and information processing. The proposed devices can be used to study and demonstrate real-time growth of wires with fractal geometry in optically transparent solid electrolyte films with interesting and important quantized electrical properties.","title":"NER: Solid Electrolytic Flash Memory Devices","awardID":"0403218","effectiveDate":"2004-07-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["329343"],"PO":["562984"]},"90404":{"abstract":"Spatial databases and Geographic Information Systems (GIS) have many applications. Examples include environmental systems, corporate decision-support systems, travel arrangement systems, etc. Typically, such applications have large volumes of data, with a critical need for fast query response. This project examines efficient query processing in spatial databases. In particular, the research focuses on the selection query, the aggregation query and the proximity query. The selection query finds the objects in a user-specified region. For instance, find objects in the Washington, DC area. This project examines novel techniques that are more efficient than existing approaches. The aggregation query computes some aggregate information in a user-specified region, for example: find the total number of restaurants in a given region, find the total precipitation of rainfall in New York State over the past year, etc. Here enumerating the actual objects is not required for answering the query. This project designs algorithms with sub-linear query cost. The proximity query finds interesting results based on the closeness of objects, for example: find a hotel\/library pair which are the closest to each other, find a location for a potential supermarket which will be close to maximum number of residents, find an apartment whose weighted total distance to a supermarket and a subway station is minimal. The project will advance the spatial database technology, and will have an impact on many fields that deal with spatial data. When systems in such fields are equipped with more expressive query features and faster query processing algorithms, the end users will benefit from the research results. The project also has a strong educational focus, including a modern curriculum which is based on not only providing the students with textbook knowledge and hands-on practice, but involving them in research. The project Web site http:\/\/www.ccs.neu.edu\/home\/donghui\/research\/CAREER_grant will be used to disseminate the published papers, and the system integration and the experimental results.","title":"CAREER: Fast Query Support for Emerging Spatial Database Applications","awardID":"0347600","effectiveDate":"2004-07-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["433352"],"PO":["563727"]},"90426":{"abstract":"A ubiquitous and integrated architecture has been envisioned for future wireless communication. In particular, integrating multi-hop wireless networking technology with infrastructure-based systems is becoming one of the most promising trends in building the next generation mobile wireless network. Developed as an independently-deployed system, however, the multi-hop wireless network is usually the performance bottleneck in terms of throughput and reliability in integrated heterogeneous systems. There is an urgent need to investigate new approaches that exploit the complementary characteristics of different technologies in order to make integrated communication systems robust and efficient.<br\/><br\/>This project consists of two intimately interrelated research thrusts: enhanced communication protocols and self-configurable management schemes. The first thrust aims to achieve superior system throughput and quality of service (QoS) in integrated multi-hop wireless networks. In particular, a synchronized MAC protocol is designed based on a binary countdown scheme tailored for multi-hop wireless networks, and a cluster-based routing protocol is developed where the cluster size is determined by a scalability model and the clusters are bridged by existing network infrastructure. The second research thrust explores several fundamental problems in three areas: (1) a self-configurable, robust, and highly accurate local positioning technique, (2) self-healing tractable node management for enhancing reliability of multi-hop wireless networks, and (3) a self-maintenance scheduling model generally applicable to various integrated multi-hop wireless networks. Success of this project will enable researches to gain deep understanding of the integration of heterogeneous wireless technologies and to establish a new paradigm for integrating research and education in heterogeneous wireless networks.","title":"CAREER: Integrated Multi-hop Wireless Networks","awardID":"0347686","effectiveDate":"2004-07-01","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["551058"],"PO":["557315"]},"92926":{"abstract":"PROPOSAL NO: 0403269<br\/>INSTITUTION: Mich Technological Univ<br\/>PRINCIPAL INVESTIGATOR: Liu , Jian<br\/>TITLE: NER: Semiconductor Quantum Dot-Based Artificial Enzymes Rational Design and Development<br\/><br\/><br\/>The goal of the proposed work, funded by NSF\/NER program, is to seek new functionalities of water-soluble semiconductor quantum dots (QDs) by mimicking the activities of natural enzyme within a non-protein environment. Under such scheme, the nano-composite based photo-catalytic artificial enzymes are designed to mimic the regulation mechanisms and the selective chemistry of enzymes by imposing light-induced electronic, energetic, and geometric changes on artificial substrate recognition sites on QDs. Several key features of enzymes will be mimicked to understand how can we control the activities of these QD-based, non-protein enzymes in using light as a source of thermodynamic driving force for benign solar chemical processes.","title":"NER: Semiconductor Quantum Dot-Based Artificial Enzymes. Rational Design and Development","awardID":"0403269","effectiveDate":"2004-07-01","expirationDate":"2005-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":[243531,"467145","448515"],"PO":["562984"]},"92948":{"abstract":"PROPOSAL NO: 0403460<br\/>INSTITUTION: Northeastern University<br\/>PRINCIPAL INVESTIGATOR: Hopwood , Je_rey<br\/>TITLE: NER: Airborne Nanoparticle Detector Based on a Microplasma Particle Trap<br\/><br\/>Abstract:<br\/>This exploratory research focuses on measuring the sizes and concentrations of airborne nanoparticles. Nanoparticles are difficult to quickly measure due to extremely small size. As nanotechnology becomes a reality, however, the accurate and rapid sensing of nanoparticles becomes an important part of many manufacturing processes. Controlling the density and size distribution of nanoparticles is not only key for reliable manufacturing, but also critical to the health and safety of the workforce. The proposed sensor consists to two components: a nanoparticle trap and a nanoparticle detector. The trap uses a small region of ionized gas (i.e., a microplasma) to negatively charge the nanoparticle. Once the particle is charged, it is trapped by the voltage gradient within the microplasma. Next, the accumulated nanoparticles are detected by using a voltage pulse to empty particles from the trap. The charged particles are collected by an electrode that senses both the accumulated charge on each particle and its time-of-flight between the microplasma and the sensing electrode. These data allow the density and size of the particles to be determined. Part of the research will concentrate on the basic physics of trapping nanoparticles by examining the multitude of forces exerted on the particles. The expulsion of nanoparticles from the trap will also be examined using dynamic models and experiments. The research will not only demonstrate a fast, low-cost sensor for nanoparticles in the environment, but also provide basic data for nanoparticle behavior in gas streams and plasmas. By including a graduate student and an undergraduate student in this program, the nanotechnology workforce infrastructure will also benefit.","title":"NER: Airborne Nanoparticle Detector Based on a Microplasma Particle Trap","awardID":"0403460","effectiveDate":"2004-07-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["362232"],"PO":["562984"]},"92959":{"abstract":"PROPOSAL NO: 0403495<br\/>INSTITUTION: U of Rhode Island<br\/>PRINCIPAL INVESTIGATOR: Euler , William<br\/>TITLE: NER: Micromechanical Actuators Constructed from Polymer\/Carbon Nanotube Composites<br\/><br\/>Abstract:<br\/><br\/>Actuators are devices that convert an input form of energy into mechanical motion. An common example is muscle tissue, which converts chemical energy into biological movement. In this research project, materials will be studied that convert either electrical energy or light energy into a bending motion. Such devices may have application in areas such as sensors or switches and can be adapted to the micro- or nanoscale.<br\/><br\/>The electrical actuators are made from nafion sandwiched between layers of carbon nanotubes. The carbon nanotube layers act as electrodes for electrical input. When current is supplied, the composite bends towards the positive electrode or can be made to oscillate if an alternating current is used. The research activities will be aimed at understanding the mechanism of this behavior so that an optimal structure can be devised and tested. In contrast, the light driven actuator is composed of only two layers: nafion and carbon nanotubes. When light is shined on this bilayer, the composite bends toward the nafion layer, independent of the orientation of the light source. Such a mode of action is unprecedented. The research will be designed to begin to understand the <br\/>underlying source for this physical behavior.","title":"NER: Micromechanical Actuators Constructed from Polymer\/Carbon Nanotube Composites","awardID":"0403495","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["350596"],"PO":["562984"]},"95160":{"abstract":"The proposed research addresses the problem of determining the purpose and functional capacities of facilities whose functions are deliberately obfuscated by their operators. As it is very difficult to obtain information that is directly related to the function of such facilities, the focus is on augmenting this traditional, direct approach to analysis with information extracted from data that are only indirectly related to facility function. More specifically, the PI proposes to use a rigorous, systematic methodology for identifying facility function in situations where observation opportunities are limited. The feasibility of this approach is based upon a newly-discovered, and rather surprising, property possessed by a broad class of complex systems: despite their complexity, it is possible to extract deep, quantitative information about these systems using only limited observations of their behavior. This property will be exploited for facility function identification by formulating the problem as one of identifying the dynamical process required to realize the facility, and by developing a multiple models strategy for efficiently extracting information from the available data sets and performing the requisite (dynamical system) identification. The feasibility of the proposed identification strategy has been demonstrated in a preliminary proof of process study involving a real world facility.","title":"Identification of Facility Fundtion Using Complex Systems Analysis","awardID":"0413851","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V427","name":"CIA-KNOWLEDGE DISCOVERY & DISS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V513","name":"CIA-KDD WORKING GROUP"}}],"PIcoPI":[249540],"PO":["565136"]},"97371":{"abstract":"Rates of voter participation have declined dramatically in the United States to the point where only half the electorate voted in the last presidential election. Recent events suggest that the use of the Internet may reverse this trend. While technology alone cannot reinvigorate democracy, as a tool in the hands of committed people, it is poised to make a significant difference in engaging Americans in the political process. In 2003, the Internet was used extensively in Howard Dean's campaign for the Democratic presidential nomination; thousands of enthusiastic supporters conducted a variety of campaign activities via the Dean website and millions of dollars were raised. The research will contribute to assessing the impact of e-democracy on the larger political arena. Internet tools including email, blogging, chat, electronic fundraising, specialized websites for campaign organizing, and campaign archives will be analyzed to learn how they were used to engage voters and support the campaign. Using grounded theory, the research will utilize audiotaped interviews and observations of key campaign personnel and supporters as well as descriptive statistics on use of each of the tools. <br\/> <br\/>Understanding how new technical tools can shape democracy is a critical question for the future of representative democracy. The United States came a hair's breadth from electing a president with less than half the electorate participating. New means of communicating with voters, and encouraging their participation are needed. Such tools appear to be emerging as part of the Internet landscape. With an extensive background in the study of computer-mediated communication, the PI will be able to make a significant contribution to understanding the broader social impacts of Internet tools in reaching out to voters and engaging wider democratic <br\/>participation.","title":"SGER: Participatory Democracy and Information Technology: The Use of The Internet in American Elections.","awardID":"0424909","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["483548"],"PO":["371077"]},"99264":{"abstract":"The goal of this project is to address the problem of accessibility and preservation of research data. Today, the responsibility for most scientific data rests on individual researchers who typically do not have the means for long-term preservation of or access to their data. As a consequence, scientific data all too frequently are not available for comparative analysis and may become lost altogether due to funding changes, personnel turnover, and physical deterioration. Research universities, however, already rely on the library to provide institutional support for archiving, access, metadata, and outreach services for print and digital collections. This project will examine the opportunities for partnership between the research community and the library to ensure that research data are collected, preserved, and accessible to research communities. The project will focus on language acquisition data that have been collected by the Cornell Language Acquisition Laboratory (CLAL) over twenty years and across more than twenty languages and countries. The project will develop and document the principles of access, dissemination, and data preservation; develop and document a prototype for testing and demonstration; and examine possible protocols for inter-institutional library cooperation. The project will also assess both start-up and ongoing costs required for this planned infrastructure to facilitate extending the model to other research institutions and libraries. The project will have broad impact by exploring a new approach to long-term storage, preservation, access, and dissemination of scientific data which may be applicable to many disciplines.","title":"SGER: Planning Information Infrastructure Through a New Library-Research Partnership","awardID":"0437603","effectiveDate":"2004-07-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1311","name":"LINGUISTICS"}}],"PIcoPI":["361107","337870"],"PO":["565136"]},"99023":{"abstract":"This award to subsidize travel, conference, and housing expenses for students participating in the Senseval-3 workshop, held in conjunction with the Association for Computational Linguistics (ACL) meeting on July 25-26, 2004, in Barcelona, Spain. ACL is the primary international organization for researchers in the field of computational linguistics, and Senseval is a major event and international meeting for the ACL Special Interest Group on the Lexicon (ACL-SIGLEX).<br\/><br\/>The main purpose of Senseval-3 is to analyze and discuss the results of systems participating in the Senseval-3 evaluations, held in March-April 2004. Fourteen different tasks are organized part of Senseval-3, to conduct evaluations of systems that perform automatic semantic analysis of text, including: word sense disambiguation for various languages, identification of semantic roles, logic forms, multilingual annotations, subcategorization acquisition. The participating students will be supported to participate in this international evaluation exercise for their systems and have the potential to gain invaluable feedback from the senior participants.","title":"Workshop: Senseval-3 - Evaluation of Systems for the Semantic Analysis of Text; July 25-26, 2004; Barcelona, Spain","awardID":"0435695","effectiveDate":"2004-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["564432"],"PO":["565215"]},"95361":{"abstract":"As is clear from the emergence of the Internet, the national electric power grid, and other large-scale network infrastructures, engineering systems today are increasingly reliant on distributed control authority and coordination between subsystems. Typically, coordination is achieved in engineering systems through the specification of ad hoc protocols for relatively well-defined (constrained) interactions between distributed systems. As information systems become more integrated into society, however, we find that existing protocols are not adequately tuned for new applications and\/or unexpected situations. Though issues of decentralized control and planning are becoming more prevalent in the engineering systems we build today, there unfortunately appears to be little in the way of underlying guiding principles and theory for designing and operating such systems. Notions of game theory and decentralized control go only part way toward revealing the basic problems associated with distributed engineering systems, especially in situations where distributed agents\/players\/actors all recognize the same performance objective and would work together except for the problem of having little or no opportunities to coordinate their actions because of limited communication. In this project, the PI's goal is to derive an enhanced understanding of coordination without explicit communication by posing a new class of sequential decision processes, known as coordination processes, whose analysis will provide new theoretical insights and new algorithmic approaches in decentralized systems and distributed planning applications. The mathematical framework the PI team will investigate is rooted in the theory of controlled Markov processes and dynamic games, thus providing a firm foundation for new results, including new solution concepts and new algorithmic approaches for identifying optimal coordination strategies. The PI team will focus their efforts broadly on two subclasses of coordination problems: transient coordination processes where all actors seek to drive an underlying system to a terminal state with minimum cost; repeated play coordination processes where the objective is to learn optimal coordination strategies that tend to minimize the average cost perceived in repeated instances of a coordination problem. The PI team will evaluate their solution concepts and algorithmic procedures in the context of two illustrative applications, a robotic planning problem and an Internet traffic engineering problem, both of which require autonomous agents (actors) to coordinate without opportunities for explicit communication.<br\/><br\/>Broader Impact: This work will impact diverse research communities, including those for control theory, game theory, and decision sciences. The results should find application in diverse sectors<br\/>of engineering and computer science, including the design of new MAC-layer protocols, the design of better conflict resolution algorithms in distributed collaboration tools and peer-to-peer applications, the design and control of transportation resource management systems, and in future sensor management systems.","title":"Dynamic Coordination for Distributed Planning with Limited Communication","awardID":"0414727","effectiveDate":"2004-07-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["540767","540771","540768"],"PO":["564456"]},"93062":{"abstract":"PROPOSAL NO: 0404088<br\/>INSTITUTION: U of NC Chapel Hill<br\/>PRINCIPAL INVESTIGATOR: Lin , Ming<br\/>TITLE: NER: Modeling and Simulation of Fibrin Fibers<br\/><br\/>ABSTRACT:<br\/><br\/>Fibrin fibers are the major structural components of blood clots. Determining the mechanical properties of these fibers will provide new insights into the wound healing process and advance our understanding of heart attacks and strokes. There has been considerable interest in determining the response of fibrin clots to mechanical stresses. <br\/>Most of the investigations in the past have mainly focused on the bulk mechanical properties of whole fibrin clots. <br\/><br\/>This project is a preliminary feasibility study on the use of a gross model based on continuum mechanics to qualitatively model and simulate the behavior of individual fibrin fibers, for better understanding of their mechanical properties. The underlying theme of proposed research is design of novel computational models, simulation methods and software systems based on the \"multi-scale\" framework, i.e. describing geometry, numerics, and physical simulation across different scales. Given the high complexity of molecular structures at the nanoscale, this approach could potentially offer a robust and efficient solution that scales up to large-sized problems and perhaps adequately models the mutual interaction among multiple nano-entities in complex physical or biological systems. <br\/><br\/>To ensure the correctness of our proposed models and simulation methods, we will test and verify our approaches by comparing the simulation results with experimental data. This will provide timely feedback and allow rapid modification of our proposed models and simulation methods.","title":"NER: Modeling and Simulation of Fibrin Fibers","awardID":"0404088","effectiveDate":"2004-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["477122","559716","553223"],"PO":["562984"]},"99442":{"abstract":"Bargaining is a major alternative to violence in actual situations of human conflict but is rarely available to players of the computer and console games where our youth spend so much of their time. It has been pointed out that today's children, physically confined by urban conditions, are finding virtual play spaces in console and computer games for the sort of adventure, risk taking, challenges, and problem solving vital to identity formation. The role of, special purpose computational engines included in a computer or console game product (e.g., dynamics engines that provide game developers with ready models of simulated physical motion) is well established. In this project, the PI team will investigate the application potential and the feasibility of a \"bargaining engine\" that would simulate and assist bargaining behavior in computer games. To address the application potential aspects, the PI team will carry out a survey and analysis of the instances and forms (representation and interaction) of bargaining and proto-bargaining in contemporary computer\/console games. They will use those results in a sample of interviews with game designers and marketers, who will be asked to project what a sophisticated bargaining model could contribute to game play, character, and plot. The result will be a report incorporating the survey, analysis, and interviews. The overall goal will be to develop an accurate picture of bargaining in games today and to assess the potential for bargaining in games of the future. To address feasibility aspects, the PI team will produce an MS Windows application that implements continuous-time (as opposed to turn-based) bargaining on a single divisible issue with perfect information. Continuous-time bargaining game theoretic models are a relatively recent development that may be particularly relevant to many of the newer computer games that involve continuous-time play. Bargaining behavior is represented by a Markov strategy that combines offers with a holding-time stochastic process to describe the chances of acceptance as a function of elapsed time. Players' preferences are classically represented by utility functions to be expressed before bargaining takes place. The members of the PI team bring complementary, interdisciplinary expertise and experience to this subject, and are uniquely qualified to undertake this research.<br\/><br\/>Broader Impact: The PI argues that adding bargaining to the repertoire of skills such virtual experiences can offer could enrich the value of interactive entertainment for children and widen their perspective on meeting real-life challenges. Yet, bargaining as a capability cannot simply be grafted onto existing game content, structure, or interaction. One must start by analyzing where even primitive forms of bargaining exist now, researching where the potential lies for expansion and depth, projecting what forms this might take, and identifying directions for research and experimental prototyping.","title":"SGER: Bargaining in Computer Games","awardID":"0439034","effectiveDate":"2004-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[262296,262297],"PO":["564456"]},"98344":{"abstract":"This is funding to support a research event (workshop) for 10-14 promising doctoral students from the United States and abroad, along with distinguished research faculty, which will take place in conjunction with the 2004 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC'04), to be held September 26-28 in Rome, Italy, and sponsored by the IEEE Computer Society. Our society has evolved into two distinct classes: the information haves and have-nots. Because information is power, this class distinction is a highly effective barrier to the ability of the have-nots to advance in terms of career and influence, both individually and in groups. The development of programming tools that allow end users to operate on task information (e.g., via complex queries and manipulations) may increase this gap even more. It will no longer be enough to find and use information others create; increasingly, employees and citizens will be expected to generate and manipulate information in creative ways to solve complex problems. There is an urgent need to consider the accessibility of these more powerful information tools, before the gap between the haves and have-nots becomes too great to cross. We need to design for inclusiveness as we envision and build programming tools for end users, so that everyone will have the opportunity to benefit from the power that they offer. That is the theme of this year's doctoral consortium, the second funded by NSF in this series. The event will bring together and build community among young researchers working on different aspects of the research problem, whether their \"home\" research community is in Computer Science, Sociology, or Education. The workshop will emphasize to attendees (both the graduate students immediately involved and general conference participants) the crosscutting nature of research relevant to this pressing research problem, which has received almost no prior study. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Extended abstracts of the students' work will be published in the conference proceedings, which has wide print and electronic distribution. The conference steering committee will evaluate the workshop outcome, and the results will be made available to the organizers of possible similar future events.<br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other.","title":"VL\/HCC'04 Doctoral Consortium","awardID":"0431282","effectiveDate":"2004-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["549540"],"PO":["565227"]},"93076":{"abstract":"PROPOSAL NO: 0404193<br\/>INSTITUTION: U of NC Charlotte<br\/>PRINCIPAL INVESTIGATOR: Poler , Jordan<br\/>TITLE: NER: Diameter specific Separations of Carbon Nanotubes for 3D<br\/>Nanoassembling<br\/><br\/><br\/>Abstract: <br\/><br\/>This project will develop new methods of assembling, processing and manipulating nanoscale materials. By examining the mechanical bonds between rigid molecules and carbon nanotubes, this research will result in a highly purified solution of these nano-materials, thereby enabling three-dimensional nanostructuring of nanotube assemblies.<br\/><br\/>This research will impact students at several levels. Master's and undergraduate students will be involved in much of this research, which can impact their philosophies of science and their directions as teachers and researchers. Molecular models, developed in this research, will be used to assemble a \"visualization toolbox\" that can be brought into the high schools through the Internet. These activities can have nation-wide impact on the science and technology education of high school students.","title":"NER: Diameter Specific Separations of Carbon Nanotubes for 3D Nanoassembling","awardID":"0404193","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":[244050,244051],"PO":["562984"]},"99599":{"abstract":"Cognitive Work Analysis (CWA) approaches computer-based work in socio-technical systems by focusing on the analysis of cognitive work within a holistic framework in order to develop system requirements. Its unique contribution to human-centered design is its ability to address the complexity and the dynamic nature of the workplace. As a result, CWA facilitates flexibility in problem solving in this ever-changing environment. CWA is one of the few conceptual frameworks that provide researchers with a way to study both task and context simultaneously, and affords a mechanism for transfering results from an in-depth analysis of human-information interaction directly to design requirements. This workshop, to be organized by the Center for Human-Information Interaction at the Information School of the University of Washington in November of 2004, with participants from both industry and academe, will focus on issues relating to research work using CWA and to training and education in this area. Ten participants from various disciplines, including psychology, information retrieval, knowledge representation, human-computer interaction, control and simulation, industrial design, mechanical engineering, and human factors engineering, will be invited. <br\/><br\/>Broader Impacts: For the first time, researchers and practitioners from around the globe will be able to come together and discuss CWA and computer-based technology design, not as a subsystem of Cognitive Systems Engineering, but as a research focus well able to stand on its own and offering its own unique insights and benefits. The workshop will be advertised among other CWA experts, who will be welcome to register at no charge; the organizers thus expect a total of approximately 40 participants in all. Summaries of the results of working groups, as well as other materials, will be made available on the workshop's website. In addition, the workshop will begin to establish an international network of researchers and practitioners who employ CWA in their daily work.","title":"Workshop on Cognitive Work Analysis","awardID":"0440021","effectiveDate":"2004-07-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["289998","289999"],"PO":["564456"]},"99269":{"abstract":"This award provides support for participants in the Grid Summer Workshop to be hosted by the University of Texas at Brownsville on South Padre Island (TX) from June 21 to June 25, 2004. The goal of this summer school is to provide intensive immersion in Grid computing and its application in scientific data analysis. The Workshop is open to graduate and undergraduate students in Computer Science, Physics, and Mathematics.","title":"Grid Summer Workshop; South Padre Island, TX","awardID":"0437628","effectiveDate":"2004-07-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1221","name":"ELEMENTARY PARTICLE ACCEL USER"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1252","name":"LIGO RESEARCH SUPPORT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["511634"],"PO":["445352"]},"93011":{"abstract":"PROPOSAL NO: 0403809<br\/>INSTITUTION: MIT<br\/>PRINCIPAL INVESTIGATOR: Cory , David<br\/>TITLE: NER: Hydrogen in Carbon Nanotubes - NMR and Multiscale Simulations<br\/><br\/><br\/>Abstract:<br\/>The properties of complex material systems such as nanoscale structures are determined by the physical and chemical interactions among its constituent elements, both at the microscopic and mesoscopic scales. This project uses a unique combination of nuclear magnetic resonance (NMR) experiments and theory to elucidate the properties of a particular nanoscale system - hydrogen gas stored within carbon nanotubes.<br\/><br\/>Carbon nanotubes have emerged as an important candidate technology for hydrogen storage in fuel calls. Understanding how the hydrogen interacts locally with the carbon framework - in essence achieving an atomic level insight into this process - would be very useful in furthering this technology. This study combines detailed NMR experiments designed to probe how the hydrogen and the carbon interact on the surfaces of the nanotube, with computer modelling at the atomic level, to correlate how the bulk properties of the hydrogen - carbon nanotube system are determined by the interactions between the two at the microscopic level.","title":"NER: Hydrogen in Carbon Nanotubes - NMR and Multiscale Simulations","awardID":"0403809","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["332141"],"PO":["562984"]},"93066":{"abstract":"PROPOSAL NO: 0404116<br\/>INSTITUTION: University of Florida<br\/>PRINCIPAL INVESTIGATOR: Sitharam , Meera<br\/>TITLE: NER: Geometry and Tensegrity Based Computational Modeling of<br\/>Birus Assembly Pathways<br\/><br\/>Abstract:<br\/><br\/>Icosahedral viral shell assembly is an outstanding, poorly understood example of nanoscale self-assembly occuring in nature. Mostly identical protein monomers assemble with high rate of efficacy into a closed icosahedral shell; onset and termination are spontaneous, and assembly is robust, rapid and economical. All of these requirements are both desirable and difficult to achieve when engineering self-assembly at the nanoscale.<br\/><br\/>The proposed project is to develop and test a formal, static model capable of answering focused questions about viral shell assembly pathways, based on geometric constraints and tensegrity concepts. The model development and testing crucially requires and integrates the expertise of the 3 PIs in Computer Science, Structural Biology and Mechanical Enginnering. By carefully defining and focusing on the questions of interest, the model will avoid expensive dynamics and moreover will be fully analyzable and refinable. A tractable and provably accurate computational simulation of the formal model will also be developed. Biochemical and mathematical justifications of the model assumptions and rigorous comparisons to other models will be given. The model will be validated using real data from the structure of 2 specific viruses that contain the minimal number of monomers and are carefully chosen to test various aspects of the model: the predictions of the model will be biochemically verified using known information about the viruses and experiments that are designed to be completed in the project period.","title":"NER: Geometry and Tensegrity Based Computational Modeling of Birus Assembly Pathways","awardID":"0404116","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":[244014,"488681","488683"],"PO":["562984"]},"99325":{"abstract":"Technological innovations have made it possible to complement our traditional (physical) museums and libraries with digital archives. Emerging digital technologies are quickly making possible new forms of access to artifacts, including virtual museums built on immersive visual technology. In such environments, it is likely viewers will be less passive; they will configure artifacts as they wish, and not be limited by the experts' views of what is good, useful, or significant. This raises concerns about historical and interpretative accuracy, both concerning replication of materials and with respect to setting them in relation to each other to produce meaningful interpretations. As a first step to exploring such issues, the PI will in this project investigate the technological difficulties in creating accurate 3D representations of physical artifacts. She will focus in particular on three fundamental unsolved problems: automatic 3D data acquisition of arbitrary complex shapes; representation of these complex shapes allowing search algorithms to easily access the right object or a part thereof; and the proper display\/visualization of such objects as they serve the user needs depending on the user's questions. <br\/><br\/>To anchor this research, the PI will focus on works of Sikh art and cultural artifacts, an area chosen because it supports a large collaborative project to establish a Virtual Museum of 500 years of Sikh art and cultural artifacts, involving the Center for Information Technology Research in the Interest of Society (CITRIS) at UC Berkeley, the University of California Humanities Research Institute (UCHRI) at UC Irvine, and the Sikh Foundation of Palo Alto, which will provide financial and in-kind assistance in identifying and enabling access to virtually all major Sikh art and cultural collections in the West. <br\/><br\/>Broader Impacts: This project constitutes in many ways the cutting edge of the relation between IT and humanities research. If successful, the work will form the basis for collecting, collating, displaying, and distributing materials for the purposes of advancing art, historical, cultural, and social research, and education on particular cultures. We will be able to assess comparative studies of similar objects (their geometries, materials and functionalities), and their evolution over time. In turn, this will enable better explanations of the evolution of the societies that produced these artifacts.","title":"SGER:The Futures of Our Past: Three-Dimensional Representations of Culturally Significant Objects & their Humanistic Implications","awardID":"0438125","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["563532"],"PO":["564456"]},"93100":{"abstract":"PROPOSAL NO: 0404380<br\/>INSTITUTION: California Inst of Tech<br\/>PRINCIPAL INVESTIGATOR: Martin , Alain<br\/>TITLE: NER: Rules for the Physical Implementation of Computations<br\/><br\/>Abstract:<br\/>A modern digital chip is a complex distributed system where many actions are performed concurrently. So far this difficult concurrency problem has been solved rather crudely but conveniently by distributing a global timing reference signal (the global ``clock'') and by estimating how long each action takes. (The estimations are necessary to schedule the clock signals.) This approach will not work in nanotechnology mainly because the variations of physical parameters due to fabrication imprecision will make the use of a global time reference either too brittle or too costly!. It is therefore very likely that nanotechnology-implemented digital computations will be asynchronous, i.e. the sequencing and timing of the steps of a computation will take place without reference to a clock signal and possibly without knowledge about delays. Such an approach is called ``delay-insensitive.''<br\/><br\/>The advantages of such an approach are enormous because independence of delay implies independence from many physical parameter variations. But now the question is: What are the requirements to implement a collection of partially ordered binary transitions (a low-level description of a digital computation) into a provably equivalent collection of events (voltage transitions or other) in a physical medium: a deep-submicron CMOS chip, a network or nanowires and nanotubes, a cellular replication of DNA strands, or other.<br\/><br\/>In particular, how do we justify replacing binary transitions on Boolean variables with continuous variations of physical quantities and being able to argue that the variables have a well-defined value at any time. (With a clock, we only need to look at the physical quantities at well-defined moments.) How do we guarantee that the signals are able to absorb noise and degradation: in other words how systematically do we inject energy in the system to restore the signals? Again, without a global time reference, how do we distribute a single signal (say the output of a gate) to different parts of the circuit and<br\/>assume that the values received are consistent at the times they are used?<br\/><br\/>In order to construct large-scale systems, we need to define a set of rules that guarantee that any implementation that follows the rules will be correct by construction: Given the complexity of such systems the engineer cannot afford to finetune every single gate to make sure that it behaves correctly. Those rules will be based on a universal model of the digital side of the computation that we think is both a convenient ``object code'' of any high-level representation of the computation, and a ``thin'' direct interface to the physical device. What those rules are and how they can be ported from one technology to another is the subject of this exploratory research. We think we can formalize the rules for deep submicron silicon technology and then extrapolate them to first SiNW and CNT thanks to the strong activity in this area at Caltech.","title":"NER: Rules for the Physical Implementation of Computations","awardID":"0404380","effectiveDate":"2004-07-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["460489"],"PO":["562984"]},"96334":{"abstract":"Title: ITWF: Culture Clash! The Adverse Effects of IT Occupational Subculture on Formative Work Experiences of IT Students<br\/><br\/><br\/>This ITWF project explores possible adverse influences of the information technology occupational subculture on students in higher education and possible ways to counteract them. It includes a longitudinal analysis of the occupational culture expectations, sources of information, and perceptions of IT students over time. Models developed from the longitudinal analysis are then tested in a cross sectional study of diverse IT students. Finally, an inoculation intervention is applied and assessed in a set of workshops to ascertain the extent to which students can be prepared for the subculture stresses they might experience during their formative work experiences.<br\/><br\/>The intellectual merit of this project lies in the strong theoretical and empirically validated research work on occupational cultures and subcultures on which it is based. The research culture clash approach has not been widely applied in the IT paraprofessional experience area and thus this research offers the potential for new understandings that may be particularly important for addressing issues related to the under representation of some populations in the IT pipeline and profession.<br\/><br\/>The broader impacts of the project lie with the potential for models that can be adapted by institutions to address possibly disruptive effects of the IT subculture within their programs. The tools developed and refined through the inoculation intervention component have the potential to be of significant value to a diverse set of institutions that wish to institute similar practices. Thus, this project expects to promote retention of under-represented women and minority students in IT programs by improving the outcomes and quality of their early paraprofessional experiences.","title":"ITWF: Culture Clash! The Adverse Effects of IT Occupational Subculture on Formative Work Experiences of IT Students","awardID":"0420434","effectiveDate":"2004-07-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["538658",252606],"PO":["361119"]},"93089":{"abstract":"PROPOSAL NO: 0404297<br\/>INSTITUTION: U of Minnesota-Twin Cities<br\/>PRINCIPAL INVESTIGATOR: Kiehl , Richard<br\/>TITLE: NER: Negative-Di_erential-Resistance in Heterobilayer Junctions: The Role of the Molecule-Molecule Interface<br\/><br\/>Abstract<br\/><br\/>A systematic study of the relationship between chemical structure and electrical characteristics in a two-layer molecular junction is proposed. The junction is comprised of two thin layers of molecules (self-assembled monolayers) that are sandwiched between metal contacts and share a common interface - i.e., a metal-molecule(1)-molecule(2)-metal structure. The co-PI's have shown that such junctions exhibit reproducible negative differential resistance (NDR) for certain combinations of the two molecular components. Such a junction is an ideal platform for experimental study since it permits the systematic variation of the molecular components and of the chemical nature of the molecule-molecule interface. The present study is predicated on the assumption that the chemical nature of the termini of the two layers impacts the electrical characteristics in a major way through its influence on the electrical and mechanical environment, which would affect charge transfer and the freedom for conformational changes. This study will contribute to the basic understanding of NDR in molecular junctions and will lead to means for optimizing molecular NDR for electronics applications.","title":"NER: Negative-Differential-Resistance in Heterobilayer Junctions: The Role of the Molecule-Molecule Interface","awardID":"0404297","effectiveDate":"2004-07-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["495787",244108],"PO":["562984"]},"90285":{"abstract":"Complexity Theory is the mathematical study of the limits of efficient<br\/>computation. This study is framed in terms of the power of<br\/>nondeterminism, the power of randomness, and the relationships between a<br\/>rich variety of complexity classes that capture computational aspects of<br\/>natural problems. This proposal addresses two fundamental questions in<br\/>Complexity Theory, and seeks to employ the tools developed in these<br\/>investigations to attack significant open problems in Algorithms.<br\/><br\/>The first question concerns the power of randomness, which is used<br\/>pervasively in modern algorithm design, cryptography, large-scale<br\/>simulation in the natural sciences, and other settings. For certain<br\/>problems, efficient randomized solutions are known but not efficient<br\/>deterministic ones, so randomness may appear to be essential. However, a<br\/>striking sequence of results over the last decade gives strong formal<br\/>evidence to the contrary, by developing a generic procedure that<br\/>\"compiles\" every efficient randomized algorithm into an efficient<br\/>deterministic one (\"derandomizes\"<br\/>the algorithm). A number of powerful tools and methods have emerged from<br\/>this effort, including optimal pseudo-random generators, so-called<br\/>\"randomness extractors\", and techniques for the \"amplification\" of<br\/>computational hardness. The objective of this research is to build upon<br\/>and improve these tools, and to use them to extend the derandomization<br\/>paradigm to broad classes of randomized procedures beyond<br\/>\"polynomial-time decision<br\/>procedures,\" which have been a primary focus until now. Specific goals<br\/>include the derandomization of space-bounded computation,<br\/>derandomization of computation in which nondeterminism and randomness<br\/>interact, and derandomization of procedures relevant to large-scale<br\/>simulations, such as approximate counting.<br\/><br\/>The second question concerns the power of nondeterminism in<br\/>space-bounded computation. Savitch's famous result shows that the power<br\/>of space-bounded computation is only slightly enhanced by supplementing<br\/>it with nondeterminism. This stands in sharp contrast to the situation<br\/>with respect to polynomial-time computation, where the addition of<br\/>nondeterminism results in the (presumably) exponentially more powerful<br\/>class NP. It is a longstanding open problem to improve Savitch's result<br\/>and ultimately show that nondeterminism adds no power to space-bounded<br\/>computation. The PI will initiate a sustained effort to resolve this<br\/>fundamental problem, initially focusing on a novel approach that exposes<br\/>the problem to a broad array of powerful tools from Group Theory and<br\/>Representation Theory.<br\/><br\/>Wherever possible, the techniques developed in pursuing these objectives<br\/>in Complexity Theory will be applied to significant problems in<br\/>Algorithms. For example, one goal is to employ ideas that naturally<br\/>arise in derandomization to attack a number of open problems in the<br\/>generation of random structures. The suggested techniques are quite<br\/>different from the currently predominant<br\/>method of \"Markov chain Monte Carlo\" simulations. Another goal is to<br\/>work toward an improved algorithm for fast matrix multiplication, by<br\/>exploiting a special case of the group-theoretic approach to improving<br\/>Savitch's result. Fast matrix multiplication lies at the heart of many<br\/>fundamental problems in algorithmic linear algebra; an improved<br\/>algorithm would have a major impact in this area and beyond.<br\/><br\/>The educational plan encompasses new course development related to this<br\/>research, integration of accessible theoretical and mathematical<br\/>components early in the undergraduate curriculum, and a focused effort<br\/>to enhance interactions between Mathematics and Computer Science through<br\/>seminar series and joint course offerings.<br\/><br\/>The proposed activities will involve both undergraduate and graduate<br\/>students as integral participants in the research and teaching<br\/>components as appropriate. The PI will seek to strengthen and expand<br\/>ongoing collaborations with researchers from several disciplines at<br\/>academic institutions (including liberal arts colleges) and industry<br\/>research labs.<br\/><br\/>The activities' intellectual merit derives from its dual goals of<br\/>advancing an understanding of the nature of two fundamental<br\/>computational resources (and consequently, broad classes of problems<br\/>that utilize these resources), and resolving core algorithmic problems<br\/>that transcend application area.<br\/><br\/>Broader impacts are realized through integrated activities to advance<br\/>discovery while promoting innovative teaching and training,<br\/>dissemination of educational materials, and activities to enhance<br\/>interdisciplinary interaction, as well as encourage undergraduate<br\/>involvement in research.","title":"CAREER: Research in Complexity Theory with Applications","awardID":"0346991","effectiveDate":"2004-07-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["485618"],"PO":["499399"]},"90461":{"abstract":"NSF CAREER 0347902<br\/>A Linguistic Approach to Software Development<br\/>Cristina Videira Lopes<br\/>University of California - Irvince<br\/><br\/>Software in Science, Engineering and Business requires domain expertise. But software development is worsened by the fact that the description mechanisms - programming languages - are inadequate for conveying relevant information to people. As a result, software systems become fragile monuments of code that only software \"artisans\" dare to modify. <br\/>Work will be conducted within Domain-Specific Languages (DSLs) and Aspect-Oriented Programming (AOP), with the aim of exploring their benefits in software development. DSLs will be developed within ubiquitous computing, as it includes several fields of expertise. The objective is the identification of abstractions and the integration of different pieces of specification. A greater objective is to find fundamental principles and techniques for the rapid development of DSLs. The following will be studied, developed and empirically evaluated: (1) Natural Language-based mechanisms for the support of more kinds of referencing, such as anaphora; (2) methods for developing domain-specific vocabularies; (3) techniques for the rapid development of DSLs.<br\/>The goal is that the process of software development will be improved considerably by shortening expression gaps. The state of the art in both theory and practice of Programming and Software Engineering will be<br\/>enhanced with a foundation for a new, important class of programming languages.","title":"CAREER: A Linguistic Approach to Software Development","awardID":"0347902","effectiveDate":"2004-07-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["518206"],"PO":["564388"]},"94554":{"abstract":"National Science Foundation<br\/>Distributed Systems Research <br\/>CISE\/CNS<br\/><br\/><br\/>ABSTRACT<br\/><br\/>Proposal Number: 0411026<br\/>Principal Investigator: Dahlin, Michael D.<br\/>Institution: University of Texas at Austin<br\/>Proposal Title: Unified Data Replication Architecture<br\/><br\/><br\/>Data replication is a fundamental technique for improving the performance and availabil-ity of large-scale distributed systems. However, current replication mechanisms are en-tangled with policy decisions that make it difficult to re-use existing systems in new envi-ronments and that restrict the effectiveness of systems built using these mechanisms. The goal of this proposed research is to develop a unified data replication architecture and toolkit for large-scale distributed services. If successful, this work will will simplify building systems, improve the availability v. consistency v. performance trade-offs avail-able to system designers, and give the community a deeper understanding of the tech-niques at the core of data replication. Specific research objectives include (1) developing a novel architecture for data replication in large scale distributed systems that separates replication mechanism from policy, (2) systematically developing improved low-level replication mechanisms, scalable and flexible consistency mechanisms, and self-tuning data placement mechanisms, and (3) constructing a toolkit for technology refinement and transfer as well as using this toolkit to develop several key case study replication systems.<br\/><br\/>Dr. Brett D. Fleisch<br\/>Program Director, CISE\/CNS<br\/>May 28, 2004<br\/>.","title":"Unified Data Replication Architecture","awardID":"0411026","effectiveDate":"2004-07-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["466839"],"PO":["543507"]},"90397":{"abstract":"SQL is the standard query language for relational databases; however, it makes expression of certain queries that appear to be simple in natural language (e.g., Find the employees working in all the projects, or half the projects, or check whether all employees are working on the same number of projects) awkward or impossible. Even when such queries can be written, the optimization of their processing is very difficult. This proposal addresses this shortcoming by defining and studying a new query language, QLGQ that can express a large class of queries in a natural and easy way. Although it is more flexible and powerful than SQL, QLGQ shares important characteristics with it. Hence, it is expected that study of QLGQ and its optimization will yield insights that can be applied to SQL. The most immediate results are expected in possible extensions to SQL and optimization techniques for them. As the research extends to other data models (XML), contributions to the design of query languages for those models are also expected. The broader impacts of this proposal are significant: as more and more scientific and technological fields depend on the analysis of large amounts of accumulated data for their progress, powerful query languages that make such analysis possible become more and more important. The PI plans to explore applications of the technology by collaborating with interested potential users. It is also planned to seek commercial developments. Dissemination of all results (papers, software, presentations, experiments, etc.) is an important goal of the project and will be accomplished via a Web site http:\/\/date.spd.louisville.edu\/Research\/GQs.htm. The PI will also present results at workshops, talks, etc. for researchers (specialists or non-specialists), database or XML practitioners, and students. The educational plan for this project includes incorporation of the research into the PI's courses, conducting seminars with students and actively trying to recruit both graduate and undergraduate students to participate in the project.","title":"CAREER: Processing and Optimization of Generalized Quantification","awardID":"0347555","effectiveDate":"2004-07-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[237056],"PO":["563751"]},"93048":{"abstract":"PROPOSAL NO: 0404001<br\/>INSTITUTION: U of Cincinnati<br\/>PRINCIPAL INVESTIGATOR: Qian , Dong<br\/>TITLE: NER: Interplay between Mechanical Deformation and Electronic Properties in Carbon Nanotube Structures<br\/><br\/>Abstract:<br\/>This research project explores the coupling mechanism between mechanical deformation and electronic properties in carbon nanotube (CNT) structures. The proposed goal is to be accomplished with an integrated theoretical and experimental approach. First of all, a multiscale method is proposed to extend the length scale limit of the quantum-mechanical method in order to realistically predict the electro-mechanical coupling in CNT structures. The simulation results will be verified by the proposed experiments. The advanced experimental approach is featured by the integrated electronic and mechanical characterization of CNT structures through flexible handling of nanosized materials and high resolution visualization of the measurement. The proposed efforts will aim to understand the fundamental electro-mechanical coupling in CNTs having realistic dimensions for application and provide valuable parameters related to the functionality and reliability of such CNT electromechanical devices.<br\/>The research goals will be fully integrated with the strong educational efforts. An educational plan that centers on modeling and characterization of nanomaterials will be developed. A new curriculum will be designed for both undergraduate and graduate students. Two Ph.D. students will receive training with the support of this grant. New tools will be used to enhance the teaching and research efforts. By promoting interests and providing knowledge that is suitable for both starters and professionals, the efforts are directed towards a broad base.","title":"NER: Interplay Between Mechanical Deformation and Electronic Properties in Carbon Nanotube Structures","awardID":"0404001","effectiveDate":"2004-07-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["493657","555848"],"PO":["562984"]},"92971":{"abstract":"PROPOSAL NO: 0403582<br\/>INSTITUTION: U of Cal Irvine<br\/>PRINCIPAL INVESTIGATOR: Burke , Peter<br\/>TITLE: NER: Electron spin resonance on a single carbon nanotube<br\/><br\/>Abstract:<br\/><br\/>This research project integrates and develops technology in three related areas: spin, nano, and quantum. The research project will attempt to measure the quantum properties of the spin of an electron inside of a carbon nanotube. In particular, the project will measure how long the spin maintains its coherence, i.e. how long the spin maintains its quantum properties. If the spin-coherence time of electrons in a nanotube is long enough, then the system could function as an elementary quantum bit (qubit), the building block of quantum computers. Furthermore, by measuring the quantum properties of electron spin in one-dimensional systems, new concepts and technologies useful for spin based classical data storage devices (such as magnetic hard drives) will be developed and realized, especially important as the technology moves into the nanometer domain. Thus, the research will both develop an important experimental technique (electron spin resonance on a single nanotube) as well as performing a specific measurement of a property directly related to the physical implementation of quantum computing: the spin coherence time of electrons in a single nanotube.<br\/><br\/>The intellectual merit of the proposed activity is the development of a new technique to control the spin degree of freedom in nano-electronic systems. This will be a crucial advance that leads to enormously powerful information processing systems. The broader impact of the proposed activity will be to involve educationally disadvantaged students from neighborhoods with predominately ethnic-minority student populations in combo hands-on and distance learning exercises in micro and nanofabrication, to provide minority undergraduate role models for these students, to train these undergraduates for careers in science, engineering, and teaching through direct participation in both research and educational outreach, and to promote partnerships between University of California researchers and local K-12 teachers.","title":"NER: Electron Spin Resonance on a Single Carbon Nanotube","awardID":"0403582","effectiveDate":"2004-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":[243669],"PO":["562984"]},"93104":{"abstract":"PROPOSAL NO: 0404440<br\/>INSTITUTION: U of Cal Santa Barbara<br\/>PRINCIPAL INVESTIGATOR: Bouwmeester , Dirk<br\/>TITLE: NER: Energy Transport in Microtubules<br\/><br\/><br\/><br\/>Abstract<br\/><br\/>Microtubules are very important biological polymers that support the structure and function of cells. They are about 25 nm in diameter and often grow to many microns in length. However, microtubule length is rarely constant. During growth a chemical reaction takes place that releases energy. This energy is stored within the microtubule and contributes to the sudden change to a disassembling state. Little is known about the energy storage and possible energy transport along microtubules. The very regular structure of the microtubule together with the fact that the small segments of microtubules have an electric dipole moment suggest that energy transport through dipole-dipole interactions is possible.<br\/><br\/>We aim to investigate the possibility of energy transfer by chemically attaching artificial atoms (colloidal quantum dots) to bundles of microtubules. Using light, dipoles can be induced inside the artificial atoms, thus providing a way to initiate and read-out energy transport. Evidence of this type of energy transport could have a major impact on the understanding of cell dynamics.","title":"NER: Energy Transport in Microtubules","awardID":"0404440","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["527564","548405"],"PO":["562984"]},"95777":{"abstract":"AIID\/Hats: An Architecture for Interpreting Intelligence Data<br\/>Paul Cohen, Center for Research on Unexpected Events, USC Information Sciences Institute.<br\/><br\/>This proposal will demonstrate how the new technology of Bayesian blackboards scales to problems involving ambiguous and incomplete data about thousands of individuals. <br\/>The Center for Research on Unexpected Events (CRUE) has developed a prototype of a Bayesian blackboard system called AIID, Architecture for the Interpretation of Intelligence Data. A Bayesian blackboard combines the technologies of blackboard systems and Bayesian belief networks. One consequence of this marriage is that the control of intelligence gathering in the world and inference on the blackboard can be rational, that is, grounded in probability and utility theory.<br\/><br\/>The second part of this project is a simulator of terrorist activities called Hats. The simulator is home to thousands of agents (\"hats\"), which travel to meetings. Some hats are covert terrorists and a very few hats are known terrorists. All hats are governed by plans generated by a planner. Terrorist plans end in the destruction of landmarks. The object of a game against the Hats simulator is to find terrorist task forces before they carry out their plans. One pays for information about hats, and also for false arrests and destroyed landmarks. At the end of a game, one is given a score, which is the sum of these costs. The goal is to play Hats rationally, that is, to catch terrorist groups with the least combined cost of information, false arrests, and destroyed landmarks.<br\/><br\/>The Bayesian blackboard is a marriage of the best knowledge-based information fusion architecture and the best methods to organize and reason with probabilistic hypotheses.<br\/>The Bayesian blackboard, because it gives a sound probabilistic semantics to hypotheses, enables a theory of rational intelligence analysis, or, equivalently, the development of mathematical formulations of the utility of intelligence and action against suspects.<br\/><br\/>This project is part of an effort by the Center for Research on Unexpected Events (CRUE) at USC's Information Sciences Institute to develop tools for rational intelligence analysis. CRUE's scientific focus is mathematical and simulation models which unify apparently diverse activities such as intrusion detection and biosurveillance. Taken together these models constitute a new field called informatics for urban security. These models will be tested in the AIID\/Hats system, and AIID will be developed as a tool for intelligence analysts. The current proposal, and all CRUE efforts, serve the intelligence community; in this instance through the KD-D program.","title":"AIID\/Hats: An Architecture for the Interpretation of Intelligence Data","awardID":"0417233","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V513","name":"CIA-KDD WORKING GROUP"}}],"PIcoPI":["524130"],"PO":["565136"]},"93038":{"abstract":"PROPOSAL NO: 0403958<br\/>INSTITUTION: Brown University<br\/>PRINCIPAL INVESTIGATOR: Zaslavsky , Alexander<br\/>TITLE: NER: Exploring Nanodevices for Probabilistic Computing Architectures<br\/><br\/>Abstract:<br\/>The progress of modern transistor-based digital technology has depended on shrinking silicon transistor to ever smaller sizes and integrating more of these transistors into logic circuits. At some point in the next decade, however, transistors will reach their ultimate physical size and circuits will contain so many transistors that some nonworking devices are inevitable. As a result, we may need both new types of devices to replace silicon transistors or new types of logic architectures that can tolerate some number of defective devices in a circuit, or both.<br\/><br\/>The proposed exploratory research targets both of these issues. We propose to map our previously developed probabilistic computer architectures onto real experimental devices, that will be fabricated from carbon nanotube material. Conversely, the nonlinear characteristics of the nanotube device prototypes will provide the experimental inputs to designing more advanced fault-tolerant logic circuits.","title":"NER: Exploring Nanodevices for Probabilistic Computing Architectures","awardID":"0403958","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["275123","527300","550256","364777"],"PO":["562984"]},"99957":{"abstract":"One of the most fundamental capabilities for an autonomous or<br\/>semi-autonomous robot system is the ability to quickly plan and<br\/>reliably execute its own motions. We will study these fundamental<br\/>problems for underactuated mechanical systems -- systems with fewer<br\/>actuators than degrees-of-freedom. Our interest in controlling this<br\/>class of systems stems from two considerations. (1) It allows<br\/>software control redundancy (as opposed to mechanical or actuation<br\/>redundancy) when one or more actuators of a fully actuated system<br\/>fails. (2) It is possible to design inexpensive mechanical systems by<br\/>minimizing expensive mechanical elements such as actuators and<br\/>transmissions and replacing them with advanced control algorithms.<br\/><br\/>We will explore a novel concept for mechanical control systems called<br\/>kinematic reductions. A kinematic reduction of a mechanical system is<br\/>a first-order driftless system whose trajectories can be followed by<br\/>the second-order mechanical system. Kinematic reductions allow<br\/>kinematic constraints (such as obstacles and joint limits) and<br\/>actuator limits to be handled in a computationally efficient manner,<br\/>allowing the possibility of real-time trajectory generation for<br\/>underactuated systems. Kinematic reductions encode the notion of<br\/>``preferred'' motion directions for the system, allowing the planned<br\/>trajectories to be followed quickly.<br\/><br\/>To make full use of these properties of mechanical systems for<br\/>real-time trajectory generation and control, we will study a number of<br\/>open issues. These include understanding when the kinematic reduction<br\/>allows for closed-form calculation of motion plans for underactuated<br\/>systems; adapting efficient kinematic motion planners from the<br\/>robotics literature to kinematically controllable systems; local<br\/>trajectory optimization; feedback control to stabilize trajectories of<br\/>the kinematic reductions; and implementation and validation of the<br\/>control strategies on an experimental vehicle. We also plan to<br\/>explore the role kinematic reductions will play in developing<br\/>reduced-complexity hierarchical hybrid motion models.","title":"Collaborative Research: Kinematic Reductions of Underactuated Mechanical Systems","awardID":"0442041","effectiveDate":"2004-07-15","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1632","name":"CONTROL SYSTEMS"}}],"PIcoPI":["495278"],"PO":["532987"]},"100381":{"abstract":"This is a Faculty Early Career Development (CAREER) award. The research will develop new methods for analyzing the structure of protein molecules, interpreting spatial data sets containing significant noise and sparse information content. Despite many experimental and computational advances, traditional structure determination protocols remain very difficult, expensive, and time-consuming. Consequently, in order to increase the throughput of structure determination, researchers are pursuing minimalist techniques that provide much less structure information much faster; examples include mutation studies, indicating at which positions amino acid substitutions significantly affect the protein's function; cross-linking mass spectrometry, providing crude proximity information for some positions in the protein; and electron microscopy, elucidating the protein's surface\/volume at relatively low resolution. These minimalist experiments then place more burden on associated algorithms for experiment planning and data interpretation.<br\/><br\/>This project pursues new theory, representations, and algorithms to address data interpretation and experiment design problems in domains characterized by sparse spatial data. A significant component of the research is the case study application of minimalist protein structure determination. The education plan addresses the need to build bridges between computer science and the life sciences in order to attack problems of this combined computational-experimental kind.<br\/><br\/>A spatial reasoner will be developed, leveraging key problem structure to efficiently and effectively plan and interpret experiments. It will represent data, models, and biophysical knowledge with multi-level, multi-dimensional topological and geometric objects and constraints. This representation will allow algorithms to match features of data and models, overcome problems of noise and scarcity by uncovering consistent feature sets, target clarifying queries in response to conflicts, and plan additional experiments. This approach will thus support closed-loop integration of modeling and experiment -- experimental evidence will trigger evaluation of model features and even optimization of models themselves, while model analysis will trigger specific data interpretation questions and even new experiments.<br\/><br\/>The education component of this project brings together students from computer science and the life sciences to train them for interdisciplinary computational biology research. Additional and revised coursework, to be developed in conjunction with the Computer Science Department and Computational Science and Engineering program at Purdue, will combine advanced computational techniques and biological applications. The training will provide life science students with the necessary algorithmic background and computer science students with the necessary exposure to and experience with motivating biological problems. Research opportunities, course projects, and other learning opportunities will further involve students in the many challenging and fascinating biological problems requiring advanced computational techniques.<br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. The research will lead to scientific contributions in the structural and functional understanding of biomolecular machinery. The challenges faced in developing, applying, and extending algorithms for this application will lead to core contributions in reasoning about physical systems, where many similar tasks in planning, modeling, predicting, and controlling face similar problems with sparse, noisy spatial data.","title":"CAREER: Sparse Spatial Reasoning for High-Throughput Protein Structure Determination","awardID":"0444544","effectiveDate":"2004-07-09","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["511584"],"PO":["565136"]},"90311":{"abstract":"The goal of this CAREER project is to develop an interdisciplinary research and education program for investigating the underlying theoretical and computational principles of machine-learning-based image annotation and retrieval. The novel research approach uses an automated learning-based image annotation method using a 3D-Hidden Markov Model (HDD) stochastic model that directly uses pixel level data as opposed to using the results of a segmentation algorithm. Using low-level features to learn high-level semantics is an important step towards automatic annotation of images. The research of this project focuses on three areas: (1) developing highly efficient machine learning mechanisms for imagery data, (2) developing models for high-dimensional imagery, and (3) developing a learning-based image annotation and retrieval system. This research will fundamentally improve image annotation technologies. This advance will provide theoretical understanding to the problem of managing and interpreting imagery data. The results of this research will also have impacts beyond pattern recognition for image databases. Many of these results can also be applied to other machine learning and data mining problems. This research will gain deeper insights into the principles of image understanding and annotation, and will ultimately contribute to the creation of intelligent and robust multimedia information systems. The educational plan includes developing interdisciplinary curriculum, and promoting diversity in the students' participation in this project. The scientific results of the research will enhance computer technology for recognizing objects and scenes with direct applications in online information management, homeland security, the military, and many scientific applications, including healthcare. Scientific publications and the project Web site http:\/\/riemann.ist.psu.edu will be used for the research results dissemination.","title":"CAREER: Machine Learning Based Intelligent Image Annotation and Retrieval","awardID":"0347148","effectiveDate":"2004-07-01","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["503706",236874],"PO":["563751"]},"92973":{"abstract":"PROPOSAL NO: 0403590<br\/>INSTITUTION: Northwestern University<br\/>PRINCIPAL INVESTIGATOR: Ismail , Yehea<br\/>TITLE: NER: Exploring Possibilities for Carbon Nanotube as Circuits and<br\/>Interconnects<br\/><br\/><br\/>Abstract:<br\/>The scaling of CMOS technologies is showing worrisome trends in terms of noise immunity, power consumption, reliability issues, and performance bottle necks. Major challenges are facing VLSI technologies in trying to maintain the current exponential growth in speed and density of devices. These physical challenges are resulting into an exponentially growing effort to maintain Moore's law. Hence, completely different alternative ways may be soon required to keep the hundreds of billions of dollars VLSI industry alive. Since their introduction, carbon nanotubes have been envisioned as the next leap in electronic circuits due to many attractive features such as their ability to act as both transistors and interconnect as well as photo devices. This multifunctional behavior is very desirable in building a single monolithic technology based only on carbon nanotubes that can perform every function available with silicon and GaAs technologies. Also, the speed and power consumption of these devices are expected to be immensely superior to CMOS technologies. In addition, there may be noise and coupling advantages when using metallic carbon nanotubes as interconnect relative to the typical metals used presently.<br\/><br\/>The proposed research will focus on the design, simulation, and testing of SWNT circuits and interconnects as well as extracting circuit and system level characteristics. The specific topics that the PIs and their groups plan to conduct under this project are: Accurate models and simulations of simple SWNT circuits using different logic styles. Comparison of different logic styles used for SWNTs and consequently a possible outcome of the best suitable style for SWNT circuits. Establishment of testing and fabrication techniques that are cost-effective, simple, and replicable. Modeling of metallic SWNT interconnects. Modeling of SWNT-metal based hybrid interconnects.","title":"NER: Exploring Possibilities for Carbon Nanotube as Circuits and Interconnects","awardID":"0403590","effectiveDate":"2004-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["293032","445747"],"PO":["562984"]},"94931":{"abstract":"At present, otologic surgeons are unable to perform surgical procedures on the inner ear without rendering irreversible injury to cochlear and vestibular function. This limitation fundamentally constrains our ability to understand, diagnose, and treat inner ear disorders such as hearing loss and vertigo. <br\/>This exploratory research program seeks to develop and test a \"proof of concept\" real-time cochlear imaging system that will provide navigation for the precise and atraumatic placement of micro-needles into compartments of the inner ear using robotic assistance. The system will consist of a robotic end-effector combining a 70 MHz focused-beam ultrasonic transducer with a 110 micron diameter micro-needle. The end-effector will be actuated in two degrees-of-freedom and mounted on a robotic arm to acquire both 2-D planar and 3-D volumetric ultrasonic images, and to insert and retract the micro-needle. <br\/>Intellectual Merit: The proposed robotic device will be the first system capable of (a) performing real-time ultrasonic imaging of the cochlea and (b) employing these images for image-guided needle placement into the compartments of the cochlea. The proposed system will enable in vivo otologic research presently considered impossible. The proposed SGER will enable us to do the basic research necessary to develop a working real-time robotic image guided intervention system. <br\/>Broader Impact: The ability to perform real-time in vivo imaging of the intracochlear membranes and to place precisely tools and sensors within the cochlea with minimal trauma would open new avenues for the diagnosis and treatment of inner ear disorders. The intracochlear placement of sensors for example, would allow real-time spectrographic assessment of metabolic changes inside the cochlea, enabling new lines of research into cochlear pathophysiology. In the future, the placement of needles within the inner ear would permit the direct delivery of therapeutic compounds to treat cochlear disease, including medications, gene therapy vectors and stem cell therapy","title":"SGER: Exploratory Research in Device Development for Robot Assisted Image Guided Needle Access of Cochlea","awardID":"0412965","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["550512",249011],"PO":["335186"]},"90366":{"abstract":"PROPOSAL: 0347400<br\/>INSTITUTION: U of Texas Austin<br\/>PRINCIPAL INVESTIGATOR: Shakkottai, Sanjay <br\/>TITLE: CAREER: Spatial Models and Algorithms for Sensor Networks<br\/><br\/>From everyday tasks like buying groceries, to tracking chemical<br\/>pollutants through a riverbed, sensor network technology will<br\/>transform the way we understand and interact with the physical<br\/>world. Such networks will support communications over thousands of<br\/>sensor nodes -- communications of a scale not seen in today's<br\/>networks.<br\/><br\/>Motivated by the physics of gases, where the behavior of individual<br\/>atoms are inconsequential in order to understand macroscopic behavior<br\/>such as pressure or temperature, this CAREER project develops a research<br\/>program based on a continuum viewpoint of a network of sensor nodes --<br\/>where individual node properties aggregate, and manifest only as<br\/>random fluctuations in an underlying continuous medium. By introducing<br\/>techniques from statistical physics, this proposal develops a<br\/>framework for sensor network algorithm design and architecture. This<br\/>is applied to obtain basic insights, and develop algorithms for sensor<br\/>network communications -- from network protocol primitives such as<br\/>querying, flooding and route setup, to data flow path optimization, to<br\/>the interactions of multiple data flows over wireless media, and their<br\/>impact on topological properties.<br\/><br\/>Research results impact design methodology for a wide range of sensor<br\/>network applications, and are incorporated into the undergraduate and<br\/>graduate curricula at UT Austin. The results are easily accessible to<br\/>industry through the Wireless Networking and Communications Group<br\/>industrial affiliates program at UT Austin. A network testbed that<br\/>integrates actual network hardware with analytical network models has<br\/>been prototyped to measure and validate sensor network algorithms, and<br\/>furthers outreach efforts to high school students.","title":"CAREER: Spatial Models and Algorithms for Sensor Networks","awardID":"0347400","effectiveDate":"2004-07-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["560222"],"PO":["561889"]},"94536":{"abstract":"National Science Foundation<br\/>Distributed Systems Research <br\/>CISE\/CNS<br\/><br\/><br\/>ABSTRACT<br\/><br\/>PROPOSAL NUMBER: 0410908\/0410896<br\/>PRINCIPAL INVESTIGATOR: Reiher Peter\/Wang An-I<br\/>INSTITUTION: University of California, Los Angeles and Florida State University<br\/>PROPOSAL TITLE: Collaborative Research: Conquest-2: Improving Energy Effi-ciency and Performance Through a Disk\/RAM Hybrid File System<br\/><br\/>This project improves energy efficiency and performance for many kinds of com-puters. Portables must be shut down when their battery is exhausted. While large servers do not rely on batteries, their energy consumption is a significant fraction of overall cost. Disk drives incur large energy costs for both types of machines, consuming up to 77% of all energy used by some servers. <br\/><br\/>The Conquest-2 file system reduces energy consumption by replacing disks with inexpensive RAM for persistent storage of many files. The earlier Conquest filesystem demonstrated impressive speed improvements through this tech-nique. Conquest-2 builds on Conquest to reduce disk power consumption as well. Conquest-2 is being built as a working prototype to demonstrate that it can reduce the energy demands of both individual laptop machines and huge data centers, while achieving speeds better than traditional systems. Files that were previously kept on disk are stored in persistent RAM, saving energy by keeping the disk spinning much less. Since RAM itself consumes power, a re-search challenge for Conquest-2 is to use the persistent RAM in a power-efficient way without compromising the system's speed. Under popular Web server loads, Conquest-2 is expected to save up to 77% of power on servers and achieve up to a 96% increase in file system speed, to be demonstrated by measuring the prototype with realistic workloads. The source code of Con-quest-2 will be available under an open-source license. Conquest-2 will sup-port many different machine types and applications, including databases, web and other on-line servers, and laptops. <br\/><br\/>Dr. Brett D. Fleisch<br\/>Program Director, CISE\/CNS<br\/>May 26, 2004.<br\/>.","title":"Collaborative Research. Conquest-2: Improving Energy Efficiency and Performance Through a Disk\/RAM Hybrid File System","awardID":"0410896","effectiveDate":"2004-07-01","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["537229"],"PO":["543507"]},"95615":{"abstract":"Over the course of the past decade, a number of governmental and nongovernmental organizations at various levels (city, state, nation) have supported pilot programs intended to facilitate citizen deliberation and citizen-to-government communication with digital technologies, with mixed results. The PI argues that citizen-to-citizen deliberative democracy can be strongly supported with digital technologies if democratic principles are used from beginning toe end (i.e., to conceptualize, design, implement, deploy and evaluate new digital technologies for democracy). In this project the PI will build upon his previous work in text analysis and interface design methods for automatically summarizing and visualizing large volumes of e-mail, to develop an interface and search engine for deliberation that is designed to aid citizens to find, browse and sort through opposing opinions. A set of \"hybrid\" computational methods will incorporate both ideas and algorithms from social network analysis and corpus-based computational linguistics, in order to support large-scale e-mail based conversational data (like that found in high-volume newsgroups, listservs, weblogs, etc.) to be summarized as not just social interaction, nor simply linguistic production, but as sociolinguistic phenomenon. The PI envisions a tool for browsing and visualizing information, more than for information retrieval because, although users have a general information need - to discover opposing opinions - their need is not sufficiently precise to evaluate the technology according to the usual IR criteria of precision and recall. Consequently, the PI will utilize a new method of evaluation for this type of tool for democracy, according to its efficacy in reducing what in social cognition is called \"false consensus\" and \"pluralistic ignorance.\" In other words, the PI will evaluate his tool according to whether or not it can provide an essential platform for deliberation, a means for citizens to discover and explore opposing and diverse opinions.<br\/><br\/>Broader Impact: There is great hope that digital technologies can help reinvigorate the public sphere. Consequently, the outcomes of research projects such as this one should be of interest and of use to a wide range of citizens and citizen groups. The PI will establish a website for the project during and after completion of the software system, and will make his tool available for others to download and use. The users who will test the system in the evaluation phase will be drawn from a range of academic and non-academic communities, in order to ensure the software is accessible outside of the PI's immediate scientific community.","title":"An Interface and Search Engine for Deliberation","awardID":"0416353","effectiveDate":"2004-07-01","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["522609"],"PO":["564456"]},"95307":{"abstract":"The PI will investigate methods for modeling and evaluating the decisions an agent must make when requesting quotes and when bidding for tasks that have complex time constraints and interdependencies. Time plays a major role in most human contracting and planning activities, yet current auction-based systems do not support decisions involving time constraints and inter-item dependencies. The way task schedules are specified in a Request for Quotes affects the number and types of bids received, and therefore the quality of the solutions that can be produced by such a system. Similarly, the way tasks are scheduled affects the ability of an agent to fit a new task into its own pre-existing commitments. The research will focus on two major goals: quantifying the relationships between schedules of tasks, bids, costs, and commitments of agents (to this end, the PI will develop theory, algorithms, and heuristics to maximize the expected utility for an agent scheduling tasks in a Request for Quotes and for an agent submitting bids); and experimentally validating the algorithms and heuristics in two application domains, supply-chain management and collaborative planning among robots and people. The project will provide a fundamental understanding of the tradeoffs between schedules and feasibility of tasks, in particular the dependencies between the way tasks are scheduled in a Request for Quotes, the bids they solicit, and their cost. The ability of agents to bid for tasks depends on their previous commitments, so different settings of time windows will end up soliciting different bids with different costs. The model proposed is based on Expected Utility Theory. Expected utility provides a natural way of accounting for the risk posture of the person or organization on whose behalf the agent is acting, and for modeling the tradeoffs between risks and profit expectations. The outcomes of the project will include a theoretical study of the dependencies between task schedules, bids, and costs, which will provide the foundations for efficient maximization algorithms and heuristics for determining optimal schedules, a collection of methods for generating practical schedules suitable for use in a Request for Quotes, algorithms and heuristics for an agent to generate bids for tasks with time and precedence constraints, and an experimental validation in two application domains, supply-chain management and collaborative planning among robots and people.<br\/><br\/>Broader Impact: This research will produce a new theoretical understanding of the interdependencies between time and costs, which will lay the foundations for designing more capable agents, and thus will increase the effectiveness of systems of agents. The application scenarios address real world problems, and have significant societal impact. Improving the efficiency of supply-chain management has the potential to decrease costs and open new markets. The results of this work will be especially useful in situations involving a large number of intersecting constraints and\/or dynamic environments with evolving constraints. Enabling teams of robots and people to plan and interact will make robots more useful for tasks such as monitoring large areas or helping people in their daily life. The software tools developed will be made available to the community at large.","title":"Auctions for Time-Dependent Tasks","awardID":"0414466","effectiveDate":"2004-07-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["561562"],"PO":["564456"]},"99839":{"abstract":"This is funding to support attendance by approximately 15 graduate students in a doctoral consortium (workshop) to be held in conjunction with the Sixth International Conference on Multimodal Interfaces (ICMI'04), to be held October 13-15, 2004 in State College, PA, and sponsored by the Association for Computing Machinery (ACM). The 3-day conference will bring together researchers from academia and industry from around the world to present and discuss the latest multi-disciplinary work on multimodal interfaces, systems, and applications. The conference represents the growing interest in next-generation perceptive, adaptive and multimodal user interfaces. These new interfaces are especially well suited for interpreting natural communication and activity patterns in real-world environments; their emergence represents a radical departure from previous computing, and is rapidly transforming the nature of human-computer interaction by creating more natural, expressively powerful, flexible and robust means of interacting with computers. Participants in the doctoral consortium will receive feedback from an invited committee of 3-5 senior personnel to posters which reflect work-in-progress not mature enough for a full paper at ICMI. <br\/><br\/>Broader Impacts: The doctoral consortium will give students exposure to their new research community, both by presenting their own work and by observing and interacting with established professionals in the field. It will encourage students at this critical time in their careers to begin building a social support network of peers and mentors. The organizers will make a special effort to recruit student participants from less well-funded institutions, where adequate support for student conference attendance may be otherwise unavailable. Participation by members of traditionally under-represented groups, including women, minority students, people with disabilities and veterans, will be strongly encouraged.","title":"Student Participant Support for Sixth International Conference on Multimodal Interfaces (ICMI 2004); October 13-15, 2004; State College, PA","awardID":"0441176","effectiveDate":"2004-07-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["515704"],"PO":["565227"]},"94538":{"abstract":"National Science Foundation<br\/>Distributed Systems Research <br\/>CISE\/CNS<br\/><br\/><br\/>ABSTRACT<br\/><br\/>PROPOSAL NUMBER: 0410908\/0410896<br\/>PRINCIPAL INVESTIGATOR: Reiher Peter\/Wang An-I<br\/>INSTITUTION: University of California, Los Angeles and Florida State University<br\/>PROPOSAL TITLE: Collaborative Research: Conquest-2: Improving Energy Effi-ciency and Performance Through a Disk\/RAM Hybrid File System<br\/><br\/>This project improves energy efficiency and performance for many kinds of com-puters. Portables must be shut down when their battery is exhausted. While large servers do not rely on batteries, their energy consumption is a significant fraction of overall cost. Disk drives incur large energy costs for both types of machines, consuming up to 77% of all energy used by some servers. <br\/><br\/>The Conquest-2 file system reduces energy consumption by replacing disks with inexpensive RAM for persistent storage of many files. The earlier Conquest filesystem demonstrated impressive speed improvements through this tech-nique. Conquest-2 builds on Conquest to reduce disk power consumption as well. Conquest-2 is being built as a working prototype to demonstrate that it can reduce the energy demands of both individual laptop machines and huge data centers, while achieving speeds better than traditional systems. Files that were previously kept on disk are stored in persistent RAM, saving energy by keeping the disk spinning much less. Since RAM itself consumes power, a re-search challenge for Conquest-2 is to use the persistent RAM in a power-efficient way without compromising the system's speed. Under popular Web server loads, Conquest-2 is expected to save up to 77% of power on servers and achieve up to a 96% increase in file system speed, to be demonstrated by measuring the prototype with realistic workloads. The source code of Con-quest-2 will be available under an open-source license. Conquest-2 will sup-port many different machine types and applications, including databases, web and other on-line servers, and laptops. <br\/><br\/>Dr. Brett D. Fleisch<br\/>Program Director, CISE\/CNS<br\/>May 26, 2004.<br\/>.","title":"Collaborative Research. Conquest-2: Improving Energy Efficiency and Performance Through a Disk\/RAM Hybrid File System","awardID":"0410908","effectiveDate":"2004-07-01","expirationDate":"2008-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["485932"],"PO":["560587"]},"93823":{"abstract":"The U.S. National Committee (USNC) for the Committee on Data for Science and Technology (CODATA) (of the International Council for Science (ICSU)) will convene a workshop on \"Strategies for Preservation of and Open Access to Digital Scientific Information Resources in China: Opportunities and Challenges\". This workshop is being organized in cooperation with the Chinese National Committee for CODATA (of the Chinese Academy of Sciences) and with the CODATA Task Group on Preservation and Archiving of Scientific and Technical Data in Developing Countries. The workshop will be held in Beijing in June 2004. The proposed workshop is intended to identify the data and information resources issues that require the highest priority attention in order to develop long-term preservation and open access management. The workshop is intended to (a) explore various options for open digital archiving that might be adopted or adapted for use within the Chinese context on a realistic and sustainable basis and (b) provide an interdisciplinary analysis and methodology to improving those activities in China. Four areas have been identified for possible initial consideration: scientific, technological and medical (STM) journals; earth and environmental science data; biomedical science data; and laboratory physical sciences data. The workshop is expected to bring together scientific and digital archiving experts, national science policy and funding officials, and representatives of public and private donor and development organizations who will be able to integrate the results of this project into their future planning. As a result, access to STM data and information resources in China might be improved and future scientific cooperation between Chinese and U.S. researchers might be facilitated by such improved access. The issues identified and discussed during the course of the workshop may also have broader application for other developing countries and, to this end, the results will be considered by the USNC\/CODATA and the international CODATA Task Group in considering the organization of similar activities in other developing regions and countries.","title":"Strategies for Preservation of and Open Access to Digital Scientific Information Resources in China: Opportunities and Challenges","awardID":"0407487","effectiveDate":"2004-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"1679","name":"INTERNATIONAL COORDINATION ACT"}}],"PIcoPI":["499569"],"PO":["353098"]},"93735":{"abstract":"This proposal supports participation of doctoral students from U.S. universities in the ninth SIGART\/AAAI Doctoral Consortium to be held July 25-26, 2004 in San Jose, CA., in conjunction with the 19th National Conference on Artificial Intelligence (AAAI-04), July, 25-29, 2004. The Doctoral Consortium aims to: (1) provide a setting for feedback on participants' current research and guidance on future research directions; (2) develop a supportive community of scholars and a spirit of collaborative research; (3) support a new generation of researchers; and (4) contribute to the conference through interaction with other researchers at the conference. The Doctoral Consortium will aim to recruit and include students from under-represented groups (e.g., women and under-represented minorities) and smaller schools or schools with less established programs in artificial intelligence. Each student will give a 25-minute presentation to be followed by 20 minutes of discussion lead by a faculty participant. In addition, each student will have a one-on-one meeting with the faculty participant. There will also be a panel to discuss career issues in both academic and other career pathways.","title":"2004 SIGART\/AAAI Doctoral Consortium; July 25-26, 2004; San Jose, CA","awardID":"0407103","effectiveDate":"2004-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["289699"],"PO":["491702"]},"92899":{"abstract":"DATE: May 15, 2004<br\/>PROPOSAL NO: 0403020<br\/>INSTITUTION: U of Ill Urbana-Champaign<br\/>PRINCIPAL INVESTIGATOR: Aluru , N<br\/>TITLE: NER: Device and Circuit Modeling of Integrated Nano-electromechanical Systems (NEMS)<br\/><br\/>Abstract:<br\/>The objective of this research is to develop device modeling tools for NEMS, to extract compact models and to develop multi-phenomena based circuit simulation tools that can model NEMS along with other components of integrated nanosystems. The device modeling research will focus on self-consistent analysis of three mixed-energy domains - namely, electrostatics, mechanical and van der Waals energy domains. Hierarchical physical theories for electrostatics will be combined with van der Waals interactions and nanometer scale mechanical theories. The final goal of the device modeling effort is to extract parameterized reduced-order or compact models that can be used as input models for circuit simulation of integrated nano electromechanical systems. The circuit modeling research will focus on the enhancement of the SPICE-based simulation framework with the capability to support multi-physics and multi-phenomena for CAD-based conceptualization, design exploration and synthesis of nanosystems. Specifically, the circuit modeling effort will focus on the circuit representation of the non-electrical components of NEMS as well as on the development of efficient time- and frequency-dependent simulation of NEMS.","title":"NER: Device and Circuit Modeling of Integrated Nanoelectromechanical Systems (NEMS)","awardID":"0403020","effectiveDate":"2004-07-01","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["243970","539633"],"PO":["562984"]}}