{"105963":{"abstract":"This proposal encompasses three main subjects of research within the general field of computational complexity. They consider (1) communication complexity: the measure of the amount of information required by computationally unbounded entities in a distributed environment to compute shared functions of inputs that are not available to all entities, and (2) proof complexity: the complexity of expressing proofs of propositional logic tautologies (and unsatisfiable formulas) as a function of the size of these tautologies. Approximation plays a role in the research in both of these areas.<br\/><br\/>Intellectual Merits Tradeoffs between the time and space used to solve computational problems are fundamental in computational complexity. In many instances one can save space by employing more time to recompute intermediate results rather than storing them. Moreover, the relationship between time and space is one of the major open questions in computational complexity. One of the most important is whether or not every efficiently-solvable problem can be solved using small space. Computational complexity is the key to the best methods of analysis for time-space tradeoffs but more powerful models of computational complexity are required to analyze comptutation at a finer-grained level. <br\/> Massive data sets have become ubiquitous and are growing faster than random access memories. To handle these massive data sets efficiently, algorithms must use the fact that data can typically be transferred more quickly sequentially. Moreover, as in the internet context, the data can be evanescent. These features have led to the study of streaming algorithms which compute properties of datasets based on a single sweep through the unordered data. To keep the space requirements of these algorithms small and feasible, the answers produced are necessarily approximations. Analysis of communication complexity has been the major tool for studying streaming algorithms but existing results on approximation problems are very limited.<br\/> By Cook's theorem, the existence of proof systems whose proofs are polynomially-bounded in the sizes of the input formulas is equivalent to NP = coNP. Although such an understanding is the ultimate goal of proof complexity, proof complexity also has many applications in the design of inference systems that are useful in practice and important for understanding the complexity of NP-hard problems.<br\/><br\/>Research Topics The proposed research encompasses all three of these areas: (1) research on new models of communication complexity with the goal of obtaining stronger time-space tradeoff lower bounds. (2) research on a systematic study of approximation problems in communication complexity with the goal of obtaining bounds for a wider variety of problems using streaming (and related) algorithms. (3) research on<br\/>proof complexity including the use of proof complexity in analyzing approximation algorithms, connections to communication complexity, search algorithms on satisfiable instances (including random instances), and more powerful inferencing algorithms.<br\/><br\/>Broader Impact The proposed research on proof complexity has direct relevance to algorithms for satisfiability search and general automated inference, tasks which are major tools in AI and formal verification.<br\/> Researchers in statistical physics and AI have suggested a strong connection between the properties of phase transitions in random problems and their associated computational complexity. Recent research on proof complexity by the PI and others has shed light on the connections between these areas. The PI has a record of interactions with researchers in statistical physics and AI. The proposed research will continue work on briding the gap between the methodologies of statistical physics, combinatorics and theoretical computer science and will encourage the cross-fertilization of ideas. <br\/> Communication complexity is so fundamental that it necessarily impacts a broad range of topics within computer science. The list of impacts of the known techniques already encompasses applications ranging from properties of OBDDs used in formal verification to the efficiency of VLSI layout to streaming algorithms in database systems. The proposed research on the communication complexity of approximation problems will yield a body of results for application to streaming algorithms and will permit the extension of these notions to graphics pipelines as well.","title":"Communication Complexity, Proof Complexity, and Approximation","awardID":"0514870","effectiveDate":"2005-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517581"],"PO":["499399"]},"104555":{"abstract":"Proposal no: 508319<br\/>Title: NER\/SNB: High-frequency, three-dimensional integrated CNFET\/CMOS technology<br\/>Inst: Columbia University<br\/>PI: Ken Shepard<br\/><br\/><br\/>Carbon nano-tube field-effect transistors (CNFET) have emerged as a potential alternative field-effect technology to conventional deep-submicron silicon transistors. While operating under physical principles similar to complementary metal-oxide semiconductor (CMOS) silicon field-effect transistors, these devices offer several possible advantages in circuits including reduced short-channel effects, potential molecular-level control to reduce variability, and a hybrid three-dimensional integration in which active devices (CMOS on the bottom and CNFET on the top) will sandwich the metal interconnect layers. For any of these potential advantages to be realized, these devices must coexist with silicon CMOS FETs and must be able to leverage the existing investment in CMOS process technology. By combining CMOS-compatible CNFET fabrication with comprehensive circuit-focused device characterization, the PIs seek to further explore the potential advantage of CNFETs for real microelectronics applications while pursuing the development of viable circuits that combine CNFET transistors with conventional deep submicron CMOS technology.","title":"NER\/SNB: High-frequency, three-dimensional integrated CNFET\/CMOS technology","awardID":"0508319","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1674","name":"NANOSCALE: INTRDISCPL RESRCH T"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["529662","496706","541064"],"PO":["562984"]},"100871":{"abstract":"CAREER: Architectural Support for Parallel Execution as a Continuum of Transactions (ASPECT)<br\/><br\/>Abstract<br\/><br\/>Effective use of future chip-multiprocessing and multi-threaded machines will increasingly rely on the availability of parallel software. However, creating such software is sill notoriously difficult and error prone. This project explores ways of designing future parallel machines that will be easier to program in order to decrease software developmental costs, increase software reliability, and facilitate wider adoption.<br\/><br\/>Current CMP and MT architectures provide programers with only rudimentary mechanisms to control the non-deterministic ordering of events in parallel execution. This project is an integrated exploration of computer architecture and system software that will develop architectural support to explicitly track and manipulate event ordering in parallel execution. The mechanisms will allow programmers to directly express ordering constraints which are then enforced by the system, help find and debug event-ordering problems, and leverage architecture-level knowledge of intended ordering for prformance and power optimizations. Insights and results from this project wilol also stimulate further related research in computer architecture, software engineering, and programming languages.","title":"CAREER: Architectural Support for Parallel Execution as a Continuum of Transactions (ASPECT)","awardID":"0447783","effectiveDate":"2005-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["550974"],"PO":["559883"]},"104523":{"abstract":"Proposal ID: 0508213<br\/>Title: NER: Far-Field Optical Microscopy Based on In-Plane Image Magnification by Surface Plasmon-Polaritons<br\/>Inst: U of Maryland<br\/>PI: Igor Smolyaninov<br\/><br\/><br\/>ABSTRACT<br\/><br\/>This NER proposal is based on the recently introduced new design of an optical microscope, which theoretically could reach resolution down to a scale of a few nanometers. In this new design a regular optical microscope is supplemented by a two-dimensional optical arrangement, which utilizes surface electromagnetic waves called surface plasmon-polaritons. These two-dimensional light waves have an unusual combination of nanometer scale wavelengths and visible-range frequencies, which means that the theoretical diffraction limit on resolution of an optical microscope may be pushed down to nanometer-scale values defined by the short wavelengths of plasmon-polaritons. Such a microscope has the potential to become a valuable tool in medical and biological imaging, where far-field optical imaging of individual viruses and DNA molecules may become reality. In addition, used in reverse such a microscope may be utilized in nanometer-scale optical lithography. The development of the proposed novel microscopy and nanolithography tools may have profound impacts on technology and society on many levels. We can envision building new inexpensive optical microscopes, which would look and cost very much like regular optical microscopes in a high school biology class, while allowing direct visualization of biomaterials (such as viruses and DNA molecules) on the 30-50 nm scale. Such a development would open the \"nano-universe\" to very broad layers of our society.","title":"NER: Far-Field Optical Microscopy Based on In-Plane Image Magnification by Surface Plasmon-Polaritons","awardID":"0508213","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["554332","491930","276028"],"PO":["562984"]},"104534":{"abstract":"ABSTRACT<br\/>Proposal ID: 508239<br\/>Title: NER: Measurement of the separation dependence of the dot-dot interaction<br\/>PI: Ricardo S. Decca<br\/><br\/>This proposal will characterize the interaction between two nanocrystals. These nanocrystals are made of CdSe, a semiconductor. Each one of the nanocrystals behave as an \"artificial atom\", where its properties can be controlled by changing its properties. In particular, the discrete energy levels that electrons can take in the nanocrystals are strongly affected by their size. This project will deal with how an \"artificial molecule\" forms, by studying the interaction of two such nanocrystals. Although these interactions have been studied either in ensembles of nanocrystals or between two nanocrystals fixed in space, the novelty of this work is mainly associated with the fact that the separation between the two nanocrystals can be varied and controlled. In this way the dependence of the interaction with respect to the separation can be investigated. <br\/><br\/>This study is important to achieve a complete characterization of the nanoparticles, the effect of non-uniformities on their properties and on their interactions. This is, in turn, important for the implementation of these particles in more advanced systems, as fluorescent markers and even in potential quantum computers.","title":"NER: Measurement of the separation dependence of the dot-dot interaction","awardID":"0508239","effectiveDate":"2005-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["522339"],"PO":["562984"]},"106009":{"abstract":"ABSTRACT<br\/><br\/>Source coding plays a critical role in many modern digital systems.<br\/>Indeed, as a research area, source coding is more important and<br\/>fertile than ever, with a wealth of new opportunities and challenges<br\/>arising from the increasing pervasiveness of multimedia and sensor<br\/>data in a digital world. This research pursues a set of particularly<br\/>interesting, novel, and timely directions in this realm, and aims to<br\/>impact the design of practical systems. There are three complementary<br\/>aspects to the research: theory, algorithms, and applications.<br\/><br\/>In the theory area, the emphasis is on problems of distributed source<br\/>coding. There has been strong growth in interest in such problems,<br\/>motivated by, for example, the need for resource efficient<br\/>quantization and compression techniques in networks. The<br\/>investigation pursues a substantial but largely unexplored aspect of<br\/>distributed source coding theory: how distortion side information<br\/>--- i.e., information about the relative importance of the signal<br\/>components to be coded --- can be exploited in such problems.<br\/><br\/>In the algorithms area, the focusses on turbo-quantization ---<br\/>low-complexity iterative source encoding techniques and their<br\/>implementation. Over the past decade, there has been a tremendous<br\/>success in developing low-complexity iterative channel decoding<br\/>algorithms for use with error-correction codes. The corresponding<br\/>source codes obtained via duality principles have the potential to<br\/>similarly transform the practice of source coding.<br\/><br\/>Finally, the research investigates important emerging<br\/>decision-system applications in which source coding and<br\/>distortion criteria play an integral role, but in nontraditional ways.<br\/>Specific examples being pursued include hashing systems for<br\/>multimedia databases and systems for authenticating multimedia<br\/>content.","title":"Coding for Multimedia Sources and Sensor Data: New Theory, Algorithms, and Applications","awardID":"0515109","effectiveDate":"2005-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["550597"],"PO":["432103"]},"105965":{"abstract":"Intellectual Merit. The proposed research will deal with mathematical problems relating to sparse random graphs. These include developing solutions for basic problems on random graphs with a speci_ed degree sequence, developing a mathematical theory to support complex modeling of real-world networks as random graphs, and studying and relating models for sparse random graphs.<br\/><br\/>Many large, real-world structures can be modeled as graphs, and the need to determine key properties and design e_cient algorithms for a particular real-world graph arises in a wide range of social and natural sciences. Massive graph structures occur in sociology as social networks representing human interactions, in epidemiology as models of disease transmission through a population, in biology in diverse phenomena including metabolic pathways, neural networks and food webs of ecosystems, and in communications in phone-call databases and geographic information systems (GIS). The interconnection network of the internet and the hyperlinked landscape of the<br\/>World Wide Web (the web graph) are two other prominent examples of massive real-world graphs.<br\/><br\/>Real-world graphs are rarely created according to a precise global design; rather, they grow and change over time according to processes which are fundamentally random. These graphs are also very large, and whether connected or not, they almost always have a small number of edges. Thus, most real-world graphs can be viewed as massive sparse random graphs.<br\/><br\/>The structure of the web and other massive graphs has been a matter of much study from a probabilistic point of view, and the most celebrated result known to date is that their degree sequence obeys a power law, in the sense that the number of vertices of degree d is proportional to 1=d_ for a suitable constant _. In contrast, most of the extensive research on random graphs over the past _fty years (starting with the seminal work of Erdos and Renyi) has been on the classical random graph models Gn;p and Gn;m, which bear little resemblance to the graphs with power-law and related degree sequences that have been observed in real-world graphs.<br\/><br\/>We propose to study structural and algorithmic problems that remain unresolved for sparse random graphs with a _xed degree sequence, since the power-law degree sequence is a special case of a _xed degree sequence. We also propose to investigate some more technical problems involved with modeling random graphs, and we propose to study clustering in sparse random graphs. Since most real world graphs are clustered and most random graphs are not, clustering is an important frontier in modeling massive graphs.<br\/><br\/>The proposed research is largely theoretical, but its motivation is the development of a rigorous empirical science of massive networks that occur in the real world. Since real-world graphs are typically massive, the asymptotic approach we propose to use should yield results applicable in practice. In fact, the theoretical and applied objectives are fairly well-aligned, since progress towards useful applications of the theory of random graphs will almost certainly require substantial advancements on the theoretical front.<br\/><br\/>Broader Impact. The basic problems described in the proposed research have broad implications to furthering the understanding of the structure and properties of real-world massive graphs. Hence the proposed research holds the promise of broad impact across science and society.<br\/>The PI has a strong commitment to encouraging and including women and minorities, and she will actively encourage such individuals to participate in the proposed research. She will disseminate research results from the proposed work in scholarly journals and conferences, and will post papers describing the research on her webpage.","title":"Methods and Models for Sparse Random Graphs","awardID":"0514876","effectiveDate":"2005-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550960"],"PO":["562944"]},"105987":{"abstract":"Abstract <br\/>0514975<br\/>Dongsoo S. Kim<br\/>Indiana University<br\/><br\/>Mobile ad-hoc network (MANET) will be one of the leading technologies in future warfare and emergency rescue to reduce the threats to personnel and to enhance the efficiency of their missions. The vehicular industry is exploiting the MANET technology for enabling road safety and commercial applications. A communication device in the MANET is capable of being a packet forwarder to provide rapid inter-connection without any stationary infrastructure. Mobile nodes are supposed to cooperate in order to achieve overall objective in a reconnaissance mission in the nature of their applications. There are, however, very few research results on cooperative mobility models. Even if there are, their theoretical foundations are not<br\/>known and the similarity to real movement are neither.<br\/><br\/>The PI, Prof. Kim, proposes to analyze the characteristics of node movement in ad hoc networks to investigate the theoretical aspects of cooperative node movemett. Among those characteristics are the distance and signal power between mobile nodes, the number of neighbor nodes within a transmission range, the logical link duration, and their cooperating strategies. Utilizing the characteristics, he will develop a new cooperative movement model that closely describe a realistic node movement pattern. In addition, the project will use<br\/>stochastic process models to investigate an analytic framework of movement models and to describe different mobility models including entity mobility models and group mobility models. The framework will provide a tool to compare two or more dissimilar mobility models in fair ways regardless of detailed deployment environments.<br\/><br\/>Intellectual Merits<br\/>Existing mathematical models can describe only a specific mobility model, mostly a random walk model. The PI intends to build a uniform mathematical framework that can characterize different mobility models<br\/>including random walk, random waypoint, and some group mobility models. Due to the lack of the mathematical foundation, MANET studies focus on exercising extensive simulation using a limited number of<br\/>mobility models. It is possible to generate biased results validated only for the given mobility models, which leads to an invalid conclusion. The analytic model proposed in the project will give a general insight to the nodal movement and a capability to predict the resulting topological change. <br\/><br\/>Broad Impact <br\/>To the large scale of mobile ad hoc networks, the ability to analyze node movement and to predict topological changes due to the movement will give thorough understanding on the availability of logical link and hence the accessibility of multi-hop path in MANET. The project abstracts geometrical properties of node movements so that it gives a generality for comparing different mobility models in a uniform constitution that makes it possible to discover their resemblances and differences.","title":"Analysis of Node Movement Models in Mobile Ad Hoc Networks","awardID":"0514975","effectiveDate":"2005-06-15","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[279610],"PO":["399214"]},"108902":{"abstract":"This is funding to support a consortium (workshop) of approximately 12 promising doctoral students from the United States and abroad, along with distinguished research faculty, to be held on Sunday, October 9, immediately preceding and in conjunction with the 2005 ACM SIGACCESS ASSETS Conference, to be held Monday through Wednesday, October 10-12 in Baltimore, and sponsored by the ACM Special Interest Group on Computers and Accessibility. The ASSETS conference is the premier forum for presenting research results and innovations in software and technology designed to address the special needs of people with disabilities of all kinds. Researchers and developers from both academia and industry around the world will meet to exchange ideas and present reports on the latest work relating to speech, motor, hearing, and vision impairments, cognitive limitations, emotional and learning disabilities, and aging. A key component of building this community is through its youth. The ASSETS05 doctoral consortium will provide an opportunity for graduate students from diverse backgrounds (computing, engineering, psychology, architecture, etc) to come together and explore their research interests in an interdisciplinary workshop, under the guidance of a panel of distinguished experts in the field, so that they can see the broader spectrum of research and development approaches to assistive technologies and universal usability, and also experience the community in which they can pursue their endeavors. Student participants will make formal presentations of their work during the consortium, and will receive constructive feedback from a faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will expose these promising young researchers to a larger community. Evaluation of the consortium will be conducted, and the results made available to the organizers of future such events. This year, a session during the main conference has been set aside to allow the doctoral consortium participants to present to the entire conference, and one student from the doctoral consortium will be selected to deliver the closing plenary presentation.<br\/><br\/>Broader Impacts: The doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Consortium for research on accessible computing","awardID":"0531269","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["333704","466602"],"PO":["565227"]},"108913":{"abstract":"ABSTRACT<br\/><br\/>Proposal 0531358<br\/>\"Student Poster Program and Travel Scholarships for the 22nd International Conference on Machine Learning (ICML 2005)\"<br\/>PI: Thorsten Joachims<br\/>Cornell University<br\/><br\/>This award provides funds to help subsidize travel and registration costs for selected students to attend and participate in the 22nd International Conference on Machine Learning (ICML 2005) to be held August 7-11, 2005 in Bonn, Germany. Selected students will present results on their research projects in poster sessions that are part of the conference program. These sessions are designed to provide the students with feedback from senior researchers from the international machine learning community. Students will also have the opportunity to attend tutorials, especially on material not taught to them at their home institutions, and to hear invited talks and presentations on state-of-the-art research on machine learning. These activities will provide students with invaluable exposure to outside perspectives on their work at a critical time in their research and will contribute to the professional development of young scientists in the important field of machine learning.","title":"Student Poster Program and Travel Scholarships for the 22nd International Conference on Machine Learning (ICML 2005)","awardID":"0531358","effectiveDate":"2005-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["531625"],"PO":["491702"]},"105778":{"abstract":"Group theory is the mathematical theory of symmetry. Algorithms for finite groups and their associated graphs have a wide range of applications in mathematics, the physical sciences, and computer science. This project has two main foci. The first one is the development of a unified data structure for the algorithmic treatment of finite groups in their concrete representations as permutation groups or matrix groups; the second one is the design, analysis, and implementation of algorithms for large dimensional matrix groups, applying the unified framework. Implementations of the new algorithms will be distributed worldwide in the GAP computer algebra system and they will contribute to a computational environment in GAP for research in group theory, algebra, graph theory, coding theory, and design theory, and to computer-based educational materials for undergraduate algebra courses.<br\/><br\/>The project will develop divide-and-conquer techniques for various classes of Aschbacher's classification of matrix groups, thereby reducing the computations to smaller dimensional matrix groups or to permutation groups. Also, particular emphasis is placed on algorithms dealing with simple groups, which are the final stages of recursion in this divide-and-conquer scheme. The research also includes problems in group theory and combinatorics which are either necessary for the proof of correctness of the algorithms, or became accessible by the new machinery. In particular, these problems include the minimum base size and minimal suborbit size of primitive permutation groups, diameter estimates of Cayley graphs of almost simple groups, finding short presentations for simple groups, and the construction of highly symmetric graphs with a distinguished set of cycles.","title":"Efficient Computation in Finite Groups","awardID":"0514122","effectiveDate":"2005-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["451149"],"PO":["321058"]},"108859":{"abstract":"The Hispanic Association of Colleges and Universities (HACU) is the recipient of an award for summer internship support. HACU, a national, non-profit organization, has a long and distinguished record of providing summer internship opportunities through the organization's National Internship Program (HNIP). Through HNIP, academically prepared students throughout the US and Puerto Rico have received quality internship assignments through various federal government agencies. Students who participate in the program are exposed to various career options in the Federal sector that serve as a basis in helping them make informed career choices and solidify career objectives. In an effort to continue its collaboration with HACU, the National Science Foundation, a participating government agency, will offer challenging assignments that will broaden the exposure of students pursuing careers in science, technology, engineering and mathematics (STEM). As a result the Foundation actively participates in strengthening the infrastructure to achieve excellence in STEM education, by helping to prepare a diverse and competitive U.S. workforce of scientists and engineers.","title":"HACU National Inernship Program","awardID":"0531068","effectiveDate":"2005-06-15","expirationDate":"2008-10-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"068P","name":"INTERNSHIPS PROGRAM"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"9170","name":"NSF PLANNING & EVALUATION"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1798","name":"SPECIAL PROJECTS (AST)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7396","name":"NEES RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1786","name":"MANFG ENTERPRISE SYSTEMS"}}],"PIcoPI":[287984],"PO":["552354"]},"100961":{"abstract":"One of the two goals of the project is to advance the state-of-the art in approximate query processing (AQP), a critical component of analytical processing -- a 3.5 billion dollar segment of the software industry. The need for approximate query processing arises from the growing discrepancy between the volume of information that has to be processed and the computational resources or communication capabilities available. Using two computational models, data-streaming and distributed computation, the project addresses fundamental problems in AQP such as development of new approximation techniques for data-stream computation, extensions of data-stream algorithms to distributed algorithms that can efficiently query sensor and peer-to-peer networks, and theoretical aspects of AQP that allow the design of AQP techniques to be accelerated and better understood. Part of the project's research goal is the design and implementation of a approximate query processing engine that uses the developed AQP techniques and the rigorous benchmarking of the software produced. The second goal of the project is educational and consists in, on one hand, motivating students to study and pursue carers in databases through bonus points for extra activities and integration of the database curricula and other CS disciplines, and, on the other hand, integration of approximate query processing into both undergraduate and graduate curricula. The project will have broad impact by developing techniques for efficient processing of large volumes of data -- crucial for scientific data processing and home-land security -- and by increasing the quality of database education with a direct impact on nation's technological leadership.<br\/><br\/>http:\/\/www.cise.ufl.edu\/~adobra\/AQP","title":"CAREER: New Technologies for Approximate Query Processing","awardID":"0448264","effectiveDate":"2005-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["533539"],"PO":["565136"]},"100862":{"abstract":"CAREER: E-textile-based Wearable Computing for Sensing User Motions<br\/><br\/>Project Abstract <br\/><br\/>Ideally, a wearable computer should always be available to the user,<br\/>should not interfere with the user's movements, and should be invisible<br\/>to those around the user. Electronic textiles (e-textiles), an emerging<br\/>technology that blends fabric with electronics, has the potential to<br\/>meet these goals. Interconnections and components are an intrinsic<br\/>part of the cloth, enabling the creation of \"smart\" garments that have<br\/>the appearance and feel of normal clothing while providing sensing and<br\/>computing capabilities. This NSF CAREER project addresses the research issues involved<br\/>in designing e-textile garments that can sense their own shapes and<br\/>the positions of their sensing\/processing elements. The major<br\/>outcome of the research component of this project will be a complete<br\/>e-textiles design framework that will permit e-textiles to function<br\/>robustly across a wide range of applications and the full spectrum of<br\/>the user population. The education component of this project integrates<br\/>e-textiles research into the classroom and develops novel educational<br\/>modules for improving the debugging skills of students based upon Kolb's<br\/>learning cycle and Felder's learning styles. The project's intellectual <br\/>merit is that it enables e-textiles to reach their full potential<br\/>for wearable computing, creating a better platform for existing wearable<br\/>computing applications and being an enabling platform for applications<br\/>that are not feasible with existing technology. The project also has<br\/>significant broader impact, by enabling novel applications in the areas<br\/>of health care for the elderly and people with disabilities, industry,<br\/>emergency response, and untethered motion tracking. The collaborative<br\/>nature of the project provides students with multidisciplinary research<br\/>experience, enhancing their contributions to the future growth of the<br\/>field. Finally, it is expected that e-textiles can help reinvigorate<br\/>the Virginia textile industry.","title":"CAREER: E-textile-based Wearable Computing for Sensing User Motions","awardID":"0447741","effectiveDate":"2005-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553340"],"PO":["561889"]},"101005":{"abstract":"Abstract<br\/>NSF Proposal#: 0448534<br\/>Dr. Xiang-Dong (Sheldon Tan) Tan<br\/><br\/>University of California at Riverside<br\/><br\/>This research seeks to develop an integrated research and education program on behavioral modeling, simulation, and optimization techniques to address and overcome the mixed-signal (MS) system-on-a-chip (SoC) design challenges and enable a leap to a new generation of mixed-signal VLSI systems. The focus is to develop efficient techniques for modeling, simulation and optimization of MS SoCs designs, which consist of both analog and digital blocks and operates in mixed frequency ranges (base-band frequency or radio frequency (RF)). The project specifically targets at (a) development of efficient parametric behavioral modeling and hierarchical piecewise linear (PWL) nonlinear modeling techniques based on a graph-based approach for linear and nonlinear analog circuits; (b) investigation of efficient algorithms for optimizing analog circuits and on-chip power-delivery systems for MS-SoC circuits based on modeling techniques. The new modeling techniques will explore a determinant-design diagram (DDD) based symbolic analysis method to construct behavioral models that consider device parameter ranges and design variations to cope with increasing manufacture uncertainty. For modeling nonlinear analog circuits, DDD-based hierarchical piece wise linear (PWL) modeling techniques will be investigated, which promises high fidelity behavioral modeling of very large nonlinear circuits at various abstract levels. As more physical effects become prominent, design practice, especially for the analog circuits, has become an optimization-like process because performance, reliability and manufacturability specifications have to be satisfied or optimized simultaneously. Such optimization-like design paradigms require new different design strategies and methodologies from that of digital circuits and will be explored in this research.<br\/>The education component of the program consists of development of new curriculum in behavioral modeling, simulation and optimization of MS SoCs, and exploration of innovative learning approaches via web-enabled instructional tools and project-oriented learning for the education of future engineers with the knowledge of behavioral modeling, design and verification for mixed-signal SoCs. Engineers very versed in MS VLSI design and MS CAD development will be trained under this research project.","title":"CAREER: Career Development Plan: Behavioral Modeling, Simulation and Optimization for Mixed-Signal System on a Chip","awardID":"0448534","effectiveDate":"2005-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["535204"],"PO":["562984"]},"105889":{"abstract":"Erich Kaltofen is studying efficient algorithms for symbolic computation problems in linear and polynomial algebra that can impact applications such as geometric modeling, diophantine optimization, or cryptography. The overarching goal of the field of symbolic computation is performing mathematical computations by computer. Programs, such as Mathematica by Wolfram Research Inc. and Maple by Maplesoft, have already reached millions of users, who use them to automatically and without error perform the mechanics of mathematical manipulation. Our research affects broadly the functionality and efficiency of the underlying mathematics engine on the computer. The investigated problems provide algorithms for new tasks, and make the execution of existing procedures significantly faster, thus allowing computation with bigger models and providing mathematics servers to more users ranging from practicing scientists to high school students. Several of the algorithms have immediate application to engineering problems such as the design of Stewart-Gouch platforms. Kaltofen, under the umbrella of the LinBox group (www.linalg.org), is making the developed software freely available.<br\/><br\/>The problem of decomposing a curve, surface or zero-set of polynomial equations into their components hinges on multivariate polynomial factorization. When the coefficients are imprecise due to floating point truncation or empirical measurement, the factorizations cannot be exact but must approximate the input data. We study sparse multidimensional models through employing the significant recent progress in hybrid symbolic\/numeric algorithms for sparse interpolation and dense bi- and trivariate approximate polynomial factorization. Our research in exact sparse and structured linear algebra algorithms studies the control of the lengths of the intermediately computed rational numbers and the use of residue arithmetic modulo a power of 2. In the subject of polynomial factorization, we seek polynomial-time algorithms and NP-hardness proofs for problems on what we call supersparse polynomials, i.e., polynomials where the term degrees can have hundreds of digits as binary numbers. We also investigate efficient solutions for standard factorization problems, such as factorization by substituting a term for the variable. Finally, we study the problem of computing the determinant without a division and of deriving pure determinantal formulas for the resultant.","title":"Challenges in Linear and Polynomil Algebra in Symbolic Computation Algorithms","awardID":"0514585","effectiveDate":"2005-06-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485433"],"PO":["499399"]},"105835":{"abstract":"Abstract<br\/>NSF-0514361<br\/>Grebel, Haim<br\/><br\/>This research program will develop new concepts for producing infrared filters for sensors based on integrated circuit microstructure technology. These components will be used in infrared through millimeter wave applications for remote sensing instruments in astrophysics, planetary, and space science. Infrared filters play an integral role on every infrared sensor, ground-based or portable, airborne and\/or space mission, yet are currently a weak link in the US infrared technology infrastructure. The group uses state-of-the-art modeling and fabrication to undertake the development. The plan is to develop and test filters for operation of all types of spectral sensors applied to a broad range of monitoring and detection systems from the visible to the THz region.<br\/><br\/>This interdisciplinary proposal is combines fundamentals of wave propagation with applications to 3-D periodic hybrid structures to produce a robust technology that serves a wide rating of sensor needs. The study will enable novel three-dimensional design of spectral filters, splitters and combiners and novel imaging devices. In addition this project will be incorporated into the interdisciplinary program of Optical Science and Engineering (OPSE) at NJIT through two new modules. The program is geared to seniors and first year graduates across the campus and combines design and laboratory work.","title":"Sensors: Narrow Band, Broad Band and Low Pass Metal Mesh Filters for sensors in the IR to THz region and instant multiple wavelength detection of chemical agents [NJIT_FY05_015]","awardID":"0514361","effectiveDate":"2005-06-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H186","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H187","name":"DEFENSE INTELLIGENCE AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T377","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T489","name":"DIA-MASINT CONSORTIUM PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T768","name":"DIA -MASINT RESEARCH PROJECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"T885","name":"DIA-MASINT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V918","name":"DIA-SOW"}}],"PIcoPI":[279237,"560438"],"PO":["565136"]},"100930":{"abstract":"CCF CAREER 0448128<br\/>William R. Cook<br\/>University of Texas at Austin<br\/><br\/>Integrating Programming Languages and Databases <br\/><br\/>Programs that use databases are central to our information infrastructure. But building efficient and maintainable data-oriented systems is difficult because procedural languages and relational databases are based on different semantic foundations and optimization strategies. In addition, databases and programming are taught separately so that developers trained in one domain may not be expert in the other domain. Finally, there has not been sufficient evaluation of the performance of different integration approaches. The goal of this project is to create methods, languages and tools which enable application programmers to readily develop efficient and well-structured programs for applications that integrate database processing<br\/>into procedural programs. Programming languages will be extended to specify modular and type-safe database operations, while leveraging database query optimization and concurrency control. Near-term research will focus on defining queries as type-safe classes within the context of existing systems. Longer-term research will focus on extracting database queries from procedural programs. In additional to traditional performance benchmarking, open-source applications will be used to test the effectiveness of proposed solutions. The project will also explore ways to integrate database and programming courses. Taken together, these results can significantly improve the development of software systems that combine procedural programming with<br\/>relational databases.","title":"CAREER: Integrating Programming Languages and Databases","awardID":"0448128","effectiveDate":"2005-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["379633"],"PO":["564388"]},"105902":{"abstract":"Descriptive Complexity measures the richness of a language or sentence needed to describe a given property. The languages are variants of first-order logic and their targets are finite, ordered structures. There is a profound relationship between the traditional computational complexity of a problem and the descriptive complexity of the problem; indeed, all major complexity classes have been shown to have natural descriptive characterizations. Thus complexity can be understood entirely from a logical point of view. Important new understandings about complexity have arisen from the descriptive point of view. In particular, new insights about dynamic complexity and the first complete problems for dynamic complexity classes have grown out of the approach.<br\/><br\/>Insights from descriptive complexity have recently led to progress on the Three-Valued-Logic Analysis Engine (TVLA), a tool that automatically deduces properties of real programs and program modules using three-valued logic. TVLA was originally the brain child of Sagiv, Reps, and Wilhelm, among others. It successfully handles the very difficult case of programs that use dynamic data structures, including allocation and deallocation of memory cells. <br\/><br\/>TVLA uses three-valued logical structures to summarize a potentially infinite set of real data structures. In doing so, it is sometimes necessary to use the truth value of \"1<br\/>2\" meaning \"unknown\". A key technical challenge for TVLA is to use the value 1<br\/>2 as little as possible, so that the summaries are as precise as possible.<br\/><br\/>The proposed research has several thrusts, the first two involve TVLA and the remaining three concern other directions in descriptive complexity: (1) Extend previous work to maintain TVLA abstractions that are as precise as possible. Part of this proposed work makes use of results from dynamic complexity. (2) Employ dual-vocabulary, three-valued TVLA structures to automatically summarize the effects of recursive procedures. Algorithms to do this precisely and to compose these descriptions efficiently will be used to scale up the applications of TVLA to larger programs whose procedures can call each other recursively. (3) Add group theory to logic. The resulting family of logical languages will likely characterize all graphs in the classes known to have polynomial-time isomorphism algorithms. This will improve our understanding of this important<br\/>algorithmic problem and also shed light on a question in descriptive complexity concerning the capturing of all polynomial-time order-independent properties. (4) Extend and develop further characterizations of the relationships between dynamic complexity classes. (5) Use the recently developed game for proving lower bounds on the size of formulas to learn more about a fundamental trade-off in descriptive complexity: formula size versus number of variables. <br\/><br\/>The broader impact of the above work is four fold: (1) The work related to TVLA will have direct, practical use in building tools that can automatically reason about real programs, thus improving software maintenance and reliability, a huge national and international need. (2) All the work will improve our understanding of the fundamental nature of computation. (3) Results from this work will be widely distributed. They will be presented at conferences, published in journals, and taught in seminars. (4) Graduate students will be trained to do research in this combination of very pure theory and quite applied theory.","title":"Logic and Dynamic Computation","awardID":"0514621","effectiveDate":"2005-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["485266"],"PO":["499399"]},"105803":{"abstract":"Decision makers, such as natural resource managers charged with managing our national forests or clinicians involved in patient care, need to find relevant information quickly and reliably. In the best case, they need to access and take benefit from up-to-date information on similar issues, decision, and situations. This exploratory project is focused on providing quick access to documents in a domain-specific setting.<br\/><br\/>Professionals write, index, and search for documents using specialized terminology (that often includes the use of normal English words) that may be unfamiliar to users with less domain expertise. Yet both experts and non-experts need to be able to find and use the information contained in these documents. This approach will exploit the various well developed, widely used controlled vocabularies and classification schemes to assist with indexing domain-specific documents. <br\/><br\/>Given the difficulty of information retrieval in general, the project is high-risk, but may succeed because the work occurs in a domain-specific setting with well-developed terminology. The intellectual merit of this proposal stems from the use of a novel thesaurus model, Metadata++, with path-based representation of term senses to assist with indexing. The broader impact of this project stems from the ubiquity of the problem<br\/>of helping decision makers find information and from the extensive collaborations with the US Forest Service, the non-profit Nature Conservancy, and Denmark's Royal School of Library and Information Science.","title":"SGER: Accelerated Indexing in a Domain-Specific Digital Library","awardID":"0514238","effectiveDate":"2005-06-01","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["533018"],"PO":["371077"]},"100259":{"abstract":"PROJECT ABSTRACT<br\/><br\/>High-performance computing has traditionally been the realm of lengthy, batch-oriented computations. As consumer technology has become more robust and feature-rich, clusters of commodity computers have emerged as a popular alternative to traditional monolithic supercomputers. Because these computers can easily be augmented with inexpensive consumer graphics processor units (GPUs), researchers have begun to investigate their use for high-performance interactive applications such as visualization. The computational power of a commodity GPU is increasing much faster than Moore's Law, and this, along with the GPU's inherent parallel vector-processing architecture, is making it an attractive platform for high performance general purpose computing. Unfortunately, clusters of graphics-enabled workstations have historically been underutilized because of their centralized nature; scientists must leave their normal work environment to access a dedicated \"visualization center\" containing a graphics-enabled cluster and exotic display and input devices. The investigator is solving this problem by enabling flexible remote access to these scalable, inexpensive clusters of commodity PCs. The ultimate vision is that a collection of centralized, easily maintainable and upgradeable, and inexpensive computers could serve the interactive, high-performance graphics and computation needs of an entire group, building, university, or even city. The research involves the design of appropriate visualization delivery infrastructure, as well as compelling multi-user, remotely accessible applications in the areas of engineering and education. <br\/><br\/>Leveraging his existing cluster-rendering infrastructure, the investigator is exploring two novel research directions. First, he is designing a remotely accessible graphics system that adapts to the capabilities of the target display. Using compressed video and streaming graphics API filters, he is creating technology to allow a single application to run effectively on displays with differing characteristics, such as resolution, color depth, brightness and form factor. This application need not be aware of the changing characteristics of the display; in fact a running application can be retargeted to a different display without restarting it. Secondly, he is creating the first ever network-aware graphics system, so that the rendering infrastructure and even the graphics architecture itself can adapt to the capabilities of the underlying network. For example, dynamic configuration of compression codecs will provide a consistent user experience as network bandwidth changes. To validate these ideas, the investigator will deploy a new visualization suite for mathematics education. Working closely with education researchers at the University of Virginia, he will design and field test new uses for visualization in the teaching of secondary mathematics. The availability of the remote delivery mechanism makes this an especially cost-effective way to bring judiciously applied high-performance 3D graphics into the classroom.","title":"Career:systems For Effective Visualization In Education And Engineering","awardID":"0443861","effectiveDate":"2005-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7417","name":"S AND T HIGH-END COMPUTING"}}],"PIcoPI":["338013"],"PO":["532791"]},"106925":{"abstract":"INFOCOM 2005, sponsored by the IEEE Communication Society, will be held at the Hyatt Regency hotel in Miami in March 2005. This is the 24th annual conference, a major event in computer communications and networking which brings researchers and practitioners of every aspect of digital communications and networks together to present the most up-to-date results and achievements in the field. Since its inception, the organizers of this annual conference have endeavored to provide professionals with a cutting-edge forum to exchange and publish their work and ideas. Participation in events like this is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work in the field. The support provided enables the participation of students who would otherwise be unable to attend INFOCOM 2005.","title":"Infocom 2005 Student Travel Support","awardID":"0519826","effectiveDate":"2005-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["194325"],"PO":["7594"]},"100931":{"abstract":"Modern wireless networks are complex dynamic systems that promise to provide the public with Internet access, new commercial and public safety services, and real-time information about the world at any location and any time. Without a unifying analytical framework, though, the promises of wireless technology will not be fully realized. This project is exploring the application of game theory, an analysis tool that has been successful in explaining complex economic systems, to create an analytical framework for wireless networks.<br\/><br\/>Specifically, the project is developing a theory of cooperation to explain how network nodes with disparate and limited information can cooperate to achieve network-wide goals. This theory is based on the game-theoretic notion of a potential game, and makes game theory more useful for engineering applications. The nascent theory is being applied to produce optimal algorithms for controlling transmission power and selecting code sequences in a wireless network. This work is expected to lead to more efficient power control and interference avoidance algorithms, thus improving the performance of wireless networks and using radio spectrum (an important public resource) more efficiently. More importantly, though, this research is developing fundamental analytical tools that will enable other researchers to create more efficient and more powerful wireless networks for a wide variety of applications.<br\/><br\/>While pursuing these important research aims, the project also includes strong education components which introduce K-12 students to wireless technology with hands-on activities designed to stimulate interest in electrical and computer engineering and wireless communications.","title":"CAREER: Game Theoretic Models for Cooperation in Wireless Networks","awardID":"0448131","effectiveDate":"2005-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["540078"],"PO":["557315"]},"100888":{"abstract":"Computer networks and particularly the Internet are suffering from the lack of security, quality of service, and manageability. A key issue that leads to this situation is the limited flexibility of packet processing in the data path of routers. Novel edge routers that use embedded network processors can be programmed and dynamically reprogrammed for custom packet processing to adapt to changing requirements and to provide a range of advanced network services. The goal of this project is to explore the dynamic aspects of network processing with three objectives. First, the project will focus on development and prototyping of a run-time environment for network processors that supports several network processing applications and allows dynamic reconfiguration of the workload. Second, the research will include modeling of packet processing delay and exploring its impact on networking. Network models and simulation need to consider the impact of processing delay in order to accurately reflect the reality of modern networks. Finally, the project will also include the development of a network service protocol for access and control of network processing. The control protocol allows end-systems to identify the processing that is performed on a data stream and to control this functionality to limit the increase in system complexity due to network processing functions. This project presents a novel approach to providing dynamic support for network processing systems, understanding its impact on the network, and providing an interface to expose and control its functionality. The results from this work will be implemented on a prototype system and will be made available to other researchers","title":"CAREER: The Dynamics of Network Processing","awardID":"0447873","effectiveDate":"2005-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["485542"],"PO":["565090"]},"104716":{"abstract":"Internet services are rapidly becoming an integral part of people's work and leisure all over the world. With such popularity and importance comes the need for 24x7 availability. Yet, recent research suggests that, at best, Internet services are achieving only 99-99.9% availability, implying 8 to 80 hours of downtime per year.<br\/><br\/>This project addresses a major source of unavailability: operator mistakes. Specifically, the PIs seek to reduce the impact of mistakes by guiding and validating operator actions, focusing specifically on cluster-based Internet services. This approach involves three efforts: (1) to explore the nature of operator mistakes and their impact on the performance and availability of Internet services by interviewing and surveying experienced operators, running experiments with volunteer operators, and running several operator contests; (2) to develop operator models that can be used to guide operator actions based on the likelihood of mistakes; and (3) to design and prototype a validation infrastructure that is part of the online system, yet allows operators to check the correctness of their actions before they can impact the live service.<br\/><br\/>The main expected outcome of the project is a demonstration that systems that guide and validate operator actions can significantly reduce the impact of operator mistakes on service availability. Valuable artifacts for other research efforts relating to availability (and manageability) will include: (1) extensive data on operator mistakes and their impact on service performance and availability; (2) models of operator behavior for guiding actions; and (3) a prototype validation infrastructure.","title":"CSR---PDOS: Guiding and Validating Operator Behavior in Internet Services","awardID":"0509007","effectiveDate":"2005-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["486839","559843","556616"],"PO":["535244"]},"102517":{"abstract":"Intellectual merit<br\/><br\/>Long-term preservation of digital data is critical in the sciences and especially so in the ocean sciences where the cost of data acquisition is very high, typically $750K per project for ship time alone, and re-acquiring datasets is generally not feasible. Instrumentation, media and formats are rapidly evolving, more diverse types of sensors are being used, and the volume of data collected is increasing exponentially. While there have been dramatic advances in storage technology, raw storage capacity alone will not solve the long-term data retrieval and preservation problems. Years after data were collected, researchers seeking to re-use the data struggle to discover information about the context of original observations. There is a critical lack of metadata<br\/>infrastructure, and substantial barriers often exist between individual projects, diverse computer systems, and different institutions. Because the requirements for long-term preservation of data and those for independent re-use of data have a great deal in common, they can both be met by a common approach, the publication of information in a digital library designed for handling scientific data. This award will establish a multi-institution, scalable digital archiving testbed, combining the efforts of the San Diego Supercomputer Center (SDSC), the Scripps Institution of Oceanography (SIO), and the Woods Hole Oceanographic Institution (WHOI). This inter-institutional demonstration project, will implement a fully functioning digital library, providing a spectrum of curatorial functions including automated ingest, metadata extraction, provenance tracking, validation, quality control, and access control. The combined SIO\/WHOI digital library will allow data from approximately 60 new oceanogrphic research projects to be preserved each year, augmenting data from roughly 1600 awards to dozens of institutions over the last 4 decades, over a wide range of disciplines. With the introduction of WHOI data, the testbed will provide access to data, photographs, video images and documents from WHOI ships, Alvin submersible and Jason ROV dives, and deep-towed vehicle surveys. Notions of scalability will be tested, as data volumes range from 3 CDs per cruise to 200 DVDs per cruise. An interactive digital library interface will allow combinations of distributed collections to be browsed, metadata<br\/>inspected, and objects displayed or selected for download. In addition, web services will be implemented to insure computer-to-computer interoperability, thus helping to streamline data interchange with the NOAA's National Data Centers, and with other major research consortia.<br\/><br\/> Broader impact<br\/><br\/>Data and technology from this effort will be incorporated in the second national teachers' workshop for the grantees' ERESE (Enduring Resources for Earth Science Education) Project, scheduled for summer, 2005 at SIO. These efforts will result in direct access for 3000 students in the classrooms of participating teachers, and a wider audience across the Internet as a component of NSF's National Science Digital Library. Seafloor photos and video from Alvin have enthralled schoolchildren around the world for generations. This effort will make these images much more readily accessible to students, teachers and the general public.","title":"Collaborative Research: Multi-Institution Testbed for Scalable Digital Archiving","awardID":"0455998","effectiveDate":"2005-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V753","name":"LIB CONGRESS-DIGITAL PRESERVAT"}}],"PIcoPI":["556882","472132"],"PO":["371077"]},"105806":{"abstract":"A good archetype for a sensor network is that of a technology that consists of large set of independent devices that, through communications, can reach consensus on the fly on events that occur in an area they monitor, a region, which is large, compared to their size and communication range. This project has three main research thrusts that will contribute to build such infrastructure: 1) the scheduling of the sensor transmissions; 2) the synchronization 3) the physical layer transmission architecture. The ideas we propose are distributed, cooperative and data driven and challenge some of the conventional wisdom used in building communication networks today which neglect fundamental aspects of the problem, such as: 1) the sensors are not end users; 2) the sensors can cooperate rather than contend for the medium to deliver critical information; 3) the aggregate entropy\/complexity of the data in space and time is low. In fact, sensor networks are deployed to record unexpected dispersed events, sudden but localized changes, inconsistencies or discontinuities that occur rarely. Current network technology applied to this problem fails in one fundamental aspect: the scalability. The interactions among nodes are heavily structured in a number of layered functionalities.<br\/><br\/>Scalability will result from un-complicating the interactions between the<br\/>large population of devices and constraining their operations and message exchange to be through a broadcast, noisy, limited range interface. The most original contribution of this research is in finding a class of scheduling strategies that operate within these restrictions and is driven by the sensors' data, achieving efficient transmission from the distributed sources without requiring any prior exchange of data among them.","title":"Scalable scheduling and transmission for sensor systems","awardID":"0514243","effectiveDate":"2005-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["475375","550699"],"PO":["564898"]},"100967":{"abstract":"Autonomous sensing\/actuation applications will use sensors to observe the world around them, process the data they gather to reach conclusions and make decisions, and use actuators to affect the world on the basis of those decisions, all potentially without any human involvement. These applications significantly extend the scope of today's sensor networks, which are used primarily to ease data collection for offline analysis by humans. The goal of this project is to design and build a data-centric software infrastructure and pertinent abstractions, mechanisms and protocols that significantly simplify the structuring and implementation of robust and efficient autonomous applications.<br\/><br\/>The system enables developers to easily specify application-specific data acquisition, processing, dissemination, and actuation logic using a flexible set of high-level computational primitives. The system translates these global specifications to code and protocols executable by individual network nodes and then automatically distributes and executes them reliably and efficiently using a novel set of algorithms. The system can employ both generic and application-specific optimization techniques to improve its operation, as these specifications are logical and do not indicate where and how execution should take place.<br\/><br\/>Broader impacts of the proposal include significant graduate and undergraduate course development, the recruitment of undergraduates into research, integration of research and teaching through graduate courses, introduction of state-of-the-art research ideas into undergraduate courses, public dissemination of educational materials and research results, and development of publicly-accessible tools and infrastructures that facilitate learning, discovery, innovation, and solutions to real problems.<br\/><br\/>http:\/\/www.cs.brown.edu\/~ugur\/spawn_project.html","title":"CAREER: Infrastructures for Sensor-based Data-centric Monitoring Applications","awardID":"0448284","effectiveDate":"2005-06-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["483626"],"PO":["469867"]},"110649":{"abstract":"The goal of this project is to design, implement and prototype a general platform for survivable and secure data storage systems. The platform will provide a set of computation efficient MDS encoders and decoders for general (n,k) schemes, as well as a suite of basic file operations. This project will also explore a few applications of such a platform for storage-based intrusion detection, prevention and restoration. Such a platform can be incorporated, modified, adapted and extended in future research and development of data storage systems and data distribution networks. The proposed research will provide a practical key building block to networked storage systems that form the basis of national cyber security.<br\/>This project is a system practice extension from various theoretical results and tools we have accumulated from related projects.<br\/>The broader impact of this research includes multiple aspects: we will disseminate tools and systems developed in this project to related research communities for wide adoption and adaptation; we will actively incorporate research results into various educational activities; and this project will both make use and provide theory, tools and testbed to the PI's other related NSF-sponsored projects.","title":"Design and Implementation of Hydra: A Platform for Survivable and Secure Storage Systems","awardID":"0541527","effectiveDate":"2005-06-15","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}}],"PIcoPI":["296397"],"PO":["469867"]},"105919":{"abstract":"One can argue that theoretical computer science (tcs) is an essential part of almost everything that we do in computer science and it plays an important role in the growing connections between computer science and other disciplines. This project is aimed at exploring the connections of tcs both throughout computer science and to other fields of research. The vehicle for exploration will be a series of workshops carried out over a period of three years and involving a large cross-section of the theory community in partnership with individuals outside that community.<br\/><br\/>Intellectual Merit<br\/> The workshops that we plan are organized into several broad themes that span a wide variety of topics: (1) Algorithmic Decision Theory, (2) New Applications of combinatorial Optimization, (3) Autonomic Computing and Self-Healing, Self-Adapting Systems, (4) Discrete Random Systems, (5) New Tools for Bioinformatics\/Computational Biomedicine, and (6) TCS and Neuroscience. Under Theme 1, there will be workshops on: Efficient Representation and Elicitation of Information in Decision Making and on Decision Problems in Algorithmic Forensic Linguistics. Theme 2 workshops will be on Combinatorial Optimization Approaches in Computational Biology, Oblivious Routing and Robust Optimization, Experimental Analysis of Algorithms in Combinatorial Optimization, and Challenging Industrial Applications of Combinatorial Optimization, while Theme 3 workshops will be on Fundamental Science of Self-Managing Systems and on Self-Healing Systems. Under Theme 4, planned workshops are on Random Structures and Randomized Algorithms and on \\From Heuristics to Rigor in Physical Arguments.\" Theme 5 workshops are on Trends in Bioinformatics: The Interplay between Experimental Biology and Theoretical Computer Science, Machine Learning Techniques in Bioinformatics, Clustering problems in Biological Networks, and Discrete Mathematical Problems in Computational Biomedicine. Finally, in Theme 6, we will have workshops on Quantitative Neuroscience and on Neural Imaging.<br\/><br\/>Broader Impacts<br\/> The ideas developed in this project will have impact on a myriad of fields and create cross-disciplinary connections. A visitor program will encourage senior and junior researchers, including students, to participate in collaborative research spawned by the workshops. Each workshop will have a fund for support of graduate students and postdocs amd workshops will have a substantial educational component through talks of a tutorial\/expository nature. The topic lends itself well to undergraduate research and participating faculty will coordinate topics with an undergraduate research program (REU program) already in existence, one that caters to students from all over the U.S. To give the project widespread dissemination, each workshop will have a website with relevant references, problems, and copies of presentations that can make it a resource for a large community. The project is expected to have a long-term impact well beyond its three year duration since the workshop, visitor, and dissemination components of the project will allow the ideas developed to reach hundreds of people nationwide and worldwide.","title":"Workshops Connecting Theoretical CS to Other Fields","awardID":"0514703","effectiveDate":"2005-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["264120","555420"],"PO":["550329"]},"100949":{"abstract":"Access control is one of the most fundamental security mechanisms in use today; however, the specification and management of access control policies remains a challenging problem, and today's administrators have no effective tools to assist them. This research addresses these needs and arising challenges by developing new verification techniques for access control policies, and verification tools that will help administrators specify, understand, and manage their access control policies. In particular, this research studies security analysis and insider threat assessment. Security analysis techniques answer the fundamental question of whether an access control system preserves essential security properties across changes to the authorization state. Insider threat assessment techniques determine what damages insiders can cause if they misuse the trust that has been placed on them. While focusing primarily on the widely-deployed Role-Based Access Control model, this project also aims at developing theoretical foundations and general techniques for access control policy verification. Insights obtained from this research will be applicable to other richer access control models and will help improve the understanding of the power and limitation of access control.","title":"CAREER: Access Control Policy Verification Through Security Analysis And Insider Threat Assessment","awardID":"0448204","effectiveDate":"2005-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["548254"],"PO":["497499"]},"100929":{"abstract":"MACAQUE is an uncertainty-aware data collection system that provides energy- and bandwidth-efficient querying in resource-limited environments, such as sensor or other wireless networks. MACAQUE provides an SQL-like query interface for specifying when and where data should be acquired. Uncertainty information, represented as confidences or probability distributions, is provided as a part of the data model, and carried with every raw reading or processed result. By explicitly representing uncertainty, MACAQUE provides users with information and interfaces that enable them to better interpret the actual state of some environment even in the presence of lost data or failed sensing nodes. MACAQUE is developed as a suite of open source data management tools designed to allow the user's to capture data from wireless sensor networks and to answer queries about that data while taking into account imprecision and uncertainty. The project has a broad impact on the community by involving undergraduate and graduate students in database systems research at MIT as well as in forming a key component of a joint Civil Engineering\/EECS undergraduate sensing laboratory. More information about MACAQUE, as well as pointers to source code, data sets, publications, presentations, and course materials (all of which are made freely available) are available on the project web site (http:\/\/db.csail.mit.edu\/macaque\/).","title":"CAREER: MACAQUE - Managing Ambiguity and Complexity in Acquisitional QUery Environments","awardID":"0448124","effectiveDate":"2005-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["525076"],"PO":["469867"]},"109261":{"abstract":"The Real-time and Embedded Technology and Application Symposium (RTAS) is an annual symposium partially sponsored by the IEEE Computer Society. The symposium traditionally brings together researchers in the broad field of embedded and real-time computing, control, and communication. The symposium took place in San Francisco, CA, March 7-10th, 2005. To ensure a broader impact in disseminating the results of this symposium, and to interest young researches in the field of embedded and hybrid systems, this NSF award creates a number of travel grants. These grants facilitate student travel to attend RTAS 2005 as well as a pre-conference workshop on current challenges in embedded computing. The purpose is to encourage the attendance of those students from groups under-represented in computer science and who otherwise would not<br\/>have the opportunity to visit such a conference.","title":"CSR-EHS: Supporting Under-Represented Student Travel to RTAS","awardID":"0533213","effectiveDate":"2005-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553633"],"PO":["561889"]},"95352":{"abstract":"This project will investigate how, when and why open source collaborative software development projects succeed or fail. Open source software runs the Internet, dominates the web server market and competes successfully in operating systems and even applications markets. This success is remarkable given the major communication and coordination problems that typically plague other forms of geographically distributed collaboration. But despite the visible successes of open source, it is also true that most projects fail. This project will conduct theory-driven empirical studies of coordination, social networks, and outcomes. The first step will be to replicate studies of commercial software development projects to determine if coordination in open source follows the same processes, or if it is fundamentally different. The next step will be to perform comparisons of open source and commercial developments to see if the theoretically-predicted differences are observed. Next, a computational model of open source software development will be constructed. Model predictions will be validated against actual observations. Finally, field experiments will be conducted to make specific coordination improvements in selected open source projects.","title":"Coordination, communication, and collaboration in open source software development","awardID":"0414698","effectiveDate":"2005-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7372","name":"ITR-SCIENCE OF DESIGN"}}],"PIcoPI":[250029,"551802","560995","268366"],"PO":["564456"]},"108230":{"abstract":"This award will provide travel support for approximately eighteen graduate students to attend the 2004 ACM SIGCOMM Conference on Communications Architectures, Protocols and Applications to be held in Portland, OR, from August 30-September 3, 2005. The travel award will target graduate students, since attending conferences is an important part of their educational experience, and they often have limited funds. SIGCOMM is a highly esteemed international conference series that have endeavored to provide researchers and professionals with a cutting-edge forum to exchange and publish their work and ideas in computer networks and communications.","title":"Student Travel Support for ACM SIGCOMM 2005 Conference","awardID":"0526702","effectiveDate":"2005-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["521556"],"PO":["565090"]},"106052":{"abstract":"Intellectual merit of the proposed activity. The primary focus of this investigation is the following ubiquitous algorithmic challenge: Given a large data set, provide a \"simple\" yet \"accurate\" description of the data.<br\/><br\/>The question is treated at several levels. In the first it is considered as a data-clustering problem. A clustering algorithm (designed with regard to a particular \"distortion\" that measures dissimilarity of points) partitions the data into clusters so that the distortion between points within a cluster is minimized (i.e., similarity is maximized), while the distortion across clusters is maximized. In the huge databases prevalent in scientific, engineering, business, government and medical applications, \"polynomial time algorithms\" are not good enough since a typical algorithm running in quadratic or cubic time is too slow to be executed on gigabytes or terabytes of data. This proposal therefore places an emphasis on near-linear time algorithms. A particular novel approach, recently developed by the proposer, is described.<br\/><br\/>In the second treatment, more advanced data analysis problems are addressed. In these problems richer and more flexible models for the data are allowed, such as mixture models of several low-degree surfaces. Data analysis in these models is beyond the reach of current approximation algorithms. The data analysis requires partitioning of the data, and so the NP-completeness of clustering is inherited; but in addition, new difficulties are inherited from applied statistics, such as the issue of missing or incomplete records in real world data. The combination requires solution of fundamental new algorithmic and geometric questions.<br\/><br\/>The third part of the proposal is concerned not with a particular clustering problem but with setting up the right kind of theory for such nonparametric inference problems. The fundamental principle is this: We should seek to cluster only data sets that admit a high-quality clustering. Often, what makes a particular input hard for a clustering algorithm is that its best clustering is little better than average: the input does not separate cleanly into well-separated pieces. A good data analysis should detect this fact, rather than stall on a search for a best yet near-average clustering. Developing a sound theoretical framework for clustering therefore requires departing from the \"worst-case analysis\" framework that has been dominant so far.<br\/><br\/>The fourth part of the proposal is devoted to theoretical analysis of the EM clustering algorithm and its variants. EM is an iterative heuristic for which there are few performance guarantees. However, it is fast, and widely used in practice. Because of this, an important goal is to determine under what conditions EM performs well, and what conditions require other approaches.<br\/><br\/>The fifth part of the proposal is devoted to a different topic: the limitations imposed on feedback<br\/>Control mechanisms because of limited processing power or limited communication capacity. Because of the real-time nature of control tasks, conventional \"input-output\" circuit complexity is not an appropriate theoretical framework. Two general types of questions are pursued. The first is characterization of the class of stabilization tasks that can be performed by highly parallelized, ultra-fast digital control circuits. The second is the ensuring of reliable and real-time communications among components of a control system in spite of noise on the communication channels. <br\/><br\/>Broader impact of the proposed activity. Data analysis is required in many scientific, engineering, business, government and medical applications. The importance of sifting out useful information from huge databases is such, that advances in data analysis algorithms as well as in the mathematical framework underpinning the design of these algorithms, has significant potential benefit to society.<br\/><br\/>Increasing automation in our technological infrastructure has created a convergence of control, computation and communication technologies. Some of the difficulties associated with carrying out this convergence will be resolved through progress on the questions described in the last section of the proposal.<br\/><br\/>All topics in the proposal are highly suited to graduate, and in some cases undergraduate, research. Interdisciplinary student training in algorithms, complexity, control and information theory is ongoing (by the PI and several colleagues). Increase in this activity is intended during the period of the proposed investigation.","title":"Algorithms for Data Analysis","awardID":"0515342","effectiveDate":"2005-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550549"],"PO":["499399"]},"109100":{"abstract":"This award provides support for participants in the Grid Summer Workshop to be hosted by the University of Texas at Brownsville on South Padre Island (TX) from July 11 to July 15, 2005. The goal of this summer school is to provide intensive immersion in Grid computing and its application in scientific data analysis. The Workshop is open to graduate and undergraduate students in Computer Science, Physics, and Mathematics.","title":"Grid Summer Workshop 2005","awardID":"0532351","effectiveDate":"2005-06-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1221","name":"ELEMENTARY PARTICLE ACCEL USER"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1252","name":"LIGO RESEARCH SUPPORT"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7553","name":"PHYSICS AT THE INFO FRONTIER"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["511634"],"PO":["445352"]},"109144":{"abstract":"ABSTRACT<br\/>0532613<br\/>Ramesh Karri<br\/>Polytechnic University of New York<br\/><br\/>We are requesting support for travel grants to graduate students and postdoctoral researchers to attend the IEEE International Workshop on Design and Test of Defect-Tolerant Nanoscale Architectures (NANOARCH'05) to be held in conjunction with with the VLSI Test Symposium May 1, 2005 at the Lodge at Rancho Mirage, Palm Springs, CA, USA. Intellectual Merit: The NANOARCH workshop is building a community of researchers in the emerging area of Computer Aided Design and Test Tools, Fault and Defect Tolerant Architectures etc. for the emerging nanotechnology based computing systems. Broader Impact: We envision a community of researchers and practitioners drawn from several disciplines (electrical engineering, computer engineering, computer science, physics, biology, chemistry, mechanical engineering). We envision this NANOARCH community to be the focal point for research in this important area of nano architectures, nano computing,<br\/>nanoelelctronics and nanocomputing systems. We will encourage participation from graduate student and postdoctoral researchers including those from EPSCOR states, women and minorities by advertising this workshop in appropriate forums.","title":"Travel Grants for IEEE NANOARCH workshop","awardID":"0532613","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550604"],"PO":["562984"]},"105493":{"abstract":"Rutgers University has received a Special Projects award to support a portion of the infrastructure of the DIMACS Center. DIMACS was founded as the Center for Discrete Mathematics and Theoretical Computer Science. As the Center has grown and matured, it has greatly expanded its scope, culminating in the D3 Project: New Directions, Dimensions, and Domains for Computer Science.<br\/><br\/>The D3 Project aims at providing a resource for the national computer science community through innovative research and educational programs with a broad scope and impact. The programs will emphasize new directions in areas such as information and data management, artificial intelligence, and trusted computing. In-depth investigation of emerging trends in areas such as privacy, security, and sensors will open up new dimensions for computer science. Applications of computer science and closely-related areas of mathematics and statistics will explore new domains in biology, chemistry, physics, engineering, public heath, business, and the social sciences.","title":"D^3: New Directions, Dimensions, and Domains for Computer Science","awardID":"0513102","effectiveDate":"2005-06-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7368","name":"SCI TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["264120"],"PO":["564181"]},"106032":{"abstract":"This proposal describes research and educational work in computational complexity, in the three areas of average-case complexity, derandomization and inapproximability. Derandomization is the task of simulating probabilistic algorithms with comparably efficient deterministic ones; Inapproximability is the study of the complexity of finding approximate solutions to combinatorial optimization problems; and averagecase<br\/>complexity is the area of complexity theory that studies algorithms that work well on most, but not necessarily all, inputs.<br\/><br\/> These three strongly connected areas are rich in technically deep results and in important open questions. Several new techniques and insights have been developed in the last few years, suggesting the tractability of long-standing open questions as well as the importance of new questions. A wider dissemination of these recent insights, techniques and conjectures is also important.<br\/><br\/>Intellectual Merits. The research will focus on a number of fundamental questions in each area, as well as on connections between the areas. Here we mention a few of the problems that the PI and his students will work on. <br\/> On the topic the derandomization, the PI will work on a generalization of Reingold's recent breakthrough derandomization of the random walk algorithm for undirected connectivity. The PI is engaged in ongoing work with Dinur, Reingold and Vadhan to generalize the result to arbitrary randomized log-space algorithms.<br\/> On average-case complexity, the PI will work on the question: can cryptography be based on NPhardness? Work by Ajtai, Dwork, Micciancio Regev and others on lattice-based cryptosystems gives hope for a positive answer, while recent work by the PI and Bogdanov gives a parital negative answer. This proposal describes work towards a general negative resolution of the question.<br\/> At the intersetion between average-case complexity and inapproximability, the PI will study the complexity of certifying unsatisfiability of random k-SAT istances and the inapproximability results that can be proved assuming the intractability of this problem. On the topic of inapproximability results based on probabilistically checkable proofs (PCPs), the PI will work towards constructing \"two-to-one\" PCPs, a weakening of the \"Unique Games\" conjectured by Khot, and then use such PCPs to prove inapproximability results without resorting to the unproved Unique Games Conjecture.<br\/><br\/>Broader Impact. This proposal supports two graduate students, who will work with the PI on the problems described here, and present their results at international conferences.<br\/> Three graduate courses at Berkeley will be influenced by this grant. An extensive survey paper on average-case complexity will be written next year, and another survey paper is planned for the following year.<br\/> Several of the questions addressed in this proposal are fundamental, and methods devised for their resolution are likely to lead to other discoveries in unrelated fields. The question of basing cryptography on the weakest possible assumptions is of broad interest in computer science and beyond.","title":"Average-Case Complexity, Derandomization and Inapproximability","awardID":"0515231","effectiveDate":"2005-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["517279"],"PO":["499399"]},"107155":{"abstract":"American Sign Language (ASL) is a full natural language, with a linguistic structure distinct from English, used as the primary means of communication for approximately one half million deaf people in the United States. Furthermore, because they are unable to hear spoken English during the critical language acquisition years of childhood, the majority of deaf high school graduates in the U.S. have only a fourth grade English reading level. Because of this low English literacy rate and because English and ASL have such different linguistic structure, many deaf people in the United States could benefit from technology that translates English text into animations of ASL performed by a virtual human character on a computer screen. But previous English-to-ASL machine translation projects have made only limited progress. Instead of producing actual ASL animations, these projects have produced restricted subsets of the language, thus allowing them to side-step many important linguistic and animation issues, including in particular the ubiquitous ASL linguistic constructions called \"classifier predicates\" that are required in order to translate many English input sentences. Classifier predicates are an ASL phenomenon, in which the signer uses the space around his or her body to position invisible objects representing entities or concepts under discussion; the signer's hands show the movement and location of these objects in space. Classifier predicates are the ASL phenomenon that is most unlike elements of spoken or written languages, and they are therefore difficult to translate by machine translation software. In this research the PIs and their graduate students will build on prior research in ASL linguistics, machine translation and artificial intelligence, 3D graphics simulation and human animation, to design and implement a prototype software system capable of producing animations of classifier predicates from English text. In doing so, they will address some of the most challenging issues in English-to-ASL translation, with the goal of producing a software design that can serve as a robust framework for future implementation of a complete English-to-ASL machine translation system. The prototype implementation will have sufficient visual quality and linguistic breadth to enable a pilot evaluation of the design and the quality of the output animations by deaf native ASL signers.<br\/><br\/>Broader Impacts: This research will lead to significant advances in the state of the art relating to English-to-ASL machine translation software, which will eventually allow development of new applications to provide improved access to information, media and services for the hundreds of thousands of deaf Americans who have low English literacy. Instead of displaying English text, devices like computers, closed-captioned televisions, or wireless pagers could show deaf users an animation of a virtual human character performing ASL. Novel educational reading applications software for deaf children to promote English literacy skills could also be developed. The project will also expose the graduate students involved to research issues relating to ASL and animation, and will support a summer ASL language training program at Gallaudet University for these students.","title":"SGER: Generating Animations of American Sign Language Classifier Predicates","awardID":"0520798","effectiveDate":"2005-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["397034","311362"],"PO":["565227"]},"95413":{"abstract":"This project is working to develop a new system that simultaneously discovers the patterns of word morphology and parts of speech for a wide range of the world's languages from unannotated text. Given a quantity of training text, such a system will yield a transducer, which segments the words in new texts into stems and affixes and determine the part of speech of each word as a whole. Through unsupervised learning, an iterative bootstrapping procedure will combine several different linguistic knowledge sources to gradually build up a representation of the language in the form of paradigms. From these paradigms, symbolic part of speech rules and morphophonological rewrite rules will be extracted, which will then be compiled into a probabilistic finite-state transducer, which can label new texts with morphology and part of speech.<br\/><br\/>Despite the widespread application of machine learning techniques to natural language processing, developing morphological analyzers still involves much human effort. While the morphology of English is very simple, the automatic analysis by computer of texts or speech in the majority of the world's languages depend on the availability of appropriate morphological analyzers. It is also important for the important problem of automatic information extraction in the biomedical domain, where it is necessary to analyze the complex structure of technical terms, even in English. Such analyzers are useful in most applications in natural language processing, including parsing, information retrieval, machine translation, text summarization, correct pronunciation in speech synthesis, language models in speech recognition, language generation, and named entity recognition.","title":"Unsupervised Learning of Morphology","awardID":"0415138","effectiveDate":"2005-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["311362"],"PO":["565215"]},"107596":{"abstract":"This SGER project is in response to the Sumatra-Andaman Island earthquake and Indian Ocean tsunami disaster. The project will study the functioning of communication networks and their use by various social groups to better understand how sensor technologies could be best deployed and integrated into global communication networks. Such research is necessary to avoid what happened during this disaster where despite the fact that the tsunami hit land two hours before hitting India and Sri Lanka, no warning signal propagated to these regions. The proposed research will build models of how information flows in a communication network, taking into account the \"trustability\" of the information. The broader impacts of this research will speak to what went wrong and the provision of recommendations to avoid such a situation in the future. Under high stress conditions, where parts of a communication network may be destroyed or disrupted, the nature of social communication networks will change. The objective is to understand how they changed and how information flow relating to the disaster was affected. Ultimately, the goal is to provide concrete suggestions for how to improve social communication networks so as to allow warning messages to flow under situations of disruption and destruction.","title":"SGER: Using Global Communication Systems as Early Warning Systems for Natural Disasters","awardID":"0522672","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["548125","320859","489824"],"PO":["564456"]},"107134":{"abstract":"Serious system-level study on the realization of quantum information processor is in its infancy, and faces challenges due to its vastly interdisciplinary nature. A successful hardware system architecture for trapped ion systems will provide a concrete path to realizing a robust quantum information processor. This proposal presents research activity on the topic of hardware system engineering for a trapped ion quantum information processor, with a long- term goal of constructing a quantum communication network.<br\/><br\/>Intellectual Merit<br\/>Trapped ion systems provide a promising physical substrate to realize qubits. Existing integrated circuit (IC) and system-on-a-chip (SOC) technologies, and recent progress in micro-opto-electro-mechanical systems (MOEMS) technology could be utilized to realize the complex classical system needed to control these qubits. Development of functionally integrated MOEMS technology optimized for this purpose is proposed as the main experimental activity of the proposal.<br\/><br\/>Broader Impact<br\/>The eventual realization of the quantum processor requires components from various technology areas, and the current proposed research activity can only be effectively pursued in a collaborative and interdisciplinary team. Cultivating collaborative team will be an essential element of the research activity. The research activities proposed will offer the participating students and postdoctoral researchers many opportunities to gain broad range of experiences. All participating students will enjoy collaboration with network of researchers from leading research organizations.","title":"SGER: QuBIC: Hardware System Architecture for Quantum Information Processor in Quantum Communication Networks","awardID":"0520702","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["435639"],"PO":["521045"]},"108586":{"abstract":"This is a Small Grant for Exploratory Research (SGER) proposal to undertake a preliminary framing study of a new design for an Internet. There is no doubt that the Internet is both a technical and a world-wide success. However, there are two factors that justify a fresh look at the basic design principles of the Internet. First, the Internet design was initially articulated over 30 years ago, and the set of requirements that it now has to meet were not fully understood at that time. Second, many incremental improvements and modifications have been imposed on the Internet, and the resulting design is getting harder and harder to evolve. There is a fear that even though new requirements continue to emerge, we will have less and less success incrementally trying to change the design to meet them.<br\/><br\/>A radical proposal, framed as a question, is the following: Can the research community devise a fresh, new design for an Internet-a design that takes into account both the wisdom in the original design and what has been learned since, a design that takes into account the requirements the network now faces and those we can predict in the future-and demonstrate a network with sufficient appeal and merit that we might persuade the world to move to it? <br\/><br\/>This is a proposal to explore the above question: to frame the set of requirements, to survey what we now know about network design, to articulate some initial design choices and to propose an outline for a possible major research effort that might bring together a large segment of the community to address a common goal-a new architecture for an Internet.","title":"SGER: Preliminary study for a new Internet architecture","awardID":"0528646","effectiveDate":"2005-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["565000"],"PO":["402055"]},"105792":{"abstract":"Computer Science (31)<br\/><br\/>This project is allowing qualified participants from the United States to attend the 8th IFIP World Conference on Computers in Education (IFIP WCCE'2005) will be held July 4-7, 2005 at the University of Stellenbosch in Cape Town, South Africa. Participants will be selected competitively by a committee of qualified reviewers, and will be chosen based in part on the likelihood of their sharing the results of this participation with others. The maximum travel award will be $2000.<br\/><br\/>This conference is an opportunity for United States faculty to interact with peers from other nations who are exploring opportunities and addressing problems critical to advances in computing education and the uses of computers in education. Individuals who are able to attend WCCE as a result of this funding will bring new ideas and collaboration opportunities back to share at a variety of U.S. based conferences as well as the institutions in which they teach. The results of this support will be magnified by the continuing interactions of these participants over the next few years.","title":"Travel Support. United States Participation in the 8th World Conference on Computers in Education (WCCE 2005)","awardID":"0514181","effectiveDate":"2005-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7428","name":"CCLI-ADAPTATION AND IMPLEMENTA"}}],"PIcoPI":["83531","380708"],"PO":["288365"]},"106035":{"abstract":"In the past decade, particle filtering has generated astounding interest among engineers and scientists with its capacity to process data that are modeled by dynamic systems. These methods belong to the family of procedures for sequential signal processing where the objectives are to filter, predict, or smooth unknown and time-varying signals from available observations. The general area of work in this research effort is the building of a new class of particle filters, the development of their theory, and their application to a number of important tasks.<br\/><br\/>The known particle filtering methods require a mathematical representation of the system dynamics and assumptions about the state transition probability distribution function, and the likelihood of the states. These probabilistic assumptions are often inaccurate and made out of convenience, and in many cases lead to formidable degradations in performance of the particle filters. We develop a more general class of particle filters which do not use probabilistic model assumptions. Instead, the new filters are based on discrete measures defined by particle streams and associated costs that are sequentially updated. With the developed theory, we are able to build particle filters that are simpler, more accurate, more robust, and more flexible than the conventional ones. The standard particle filters, however, are particular instances of the new filters. We investigate in great detail various important issues including the foundations of the new filters, their convergence, connections of the new theory with existing theories, and its extensions to batch type signal processing. The filters are tested on various challenging problems.","title":"Theory of generalized particle filtering","awardID":"0515246","effectiveDate":"2005-06-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["563567","432413"],"PO":["564898"]},"104561":{"abstract":"ABSTRACT:<br\/>Proposal No: 0508346<br\/>Title: MICROSCOPIC TRAPS FOR ELECTRONS IN VACUUM <br\/>PI: Marija Drindic<br\/>Inst: University of Pennsylvania <br\/><br\/>The objective of this NSF NER proposal is to build the first microscopic traps for cold (low-energy) electrons in vacuum and to demonstrate the trapping, detection, and manipulation of single electrons at small scales above surfaces in vacuum. The intellectual merit of this proposal is in developing the technologies for electron trapping, detection and manipulation on small scales in vacuum. In realizing these traps, it will be studied how the electrons interact with nearby surfaces at nanometer and micrometer length-scales, and how the electron motion can be detected and controlled near microfabricated wires. The broad impact of the proposed research is that it will present the first realization of electron \"quantum dots\" or \"artificial atoms\" in vacuum. An electron in a microtrap resembles a hydrogen atom; the hydrogen nucleus will be \"replaced\" in the proposed case by the electrodes of the microtrap. Control of electrons on microscopic scales is expected to open up new possibilities at the interface of atomic and condensed matter physics including integrated electronic circuits in vacuum, single and coupled quantum dots in vacuum and possible implementation of quantum computers. The PI is actively supporting the research of undergraduates, and one undergraduate will be involved in the proposed exploratory project.","title":"NER: Microscopic Traps for Electrons in Vacuum","awardID":"0508346","effectiveDate":"2005-06-01","expirationDate":"2007-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["415164"],"PO":["562984"]},"108302":{"abstract":"This award is for funding to subsidize travel, conference, and housing expenses of students selected to participate in the ACL Student Research Workshop to be held on June 27th in conjunction with the annual conference of the Association for Computational Linguistics (ACL) to be held in Ann Arbor, Michigan. ACL is the primary international organization in the field of natural language processing and language engineering. The Association's annual conference, which rotates among the Americas, Pacific-rim countries, and Europe\/Africa, is the major international meeting in the field. Computational linguistics is a multidisciplinary field of increasing importance to science, commerce, and society. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades. <br\/><br\/>The workshop format allows students to present their research and receive feedback from a panel of established researchers in the field. It provides students with invaluable exposure to outside perspectives on their work at a critical time in their professional development through feedback from the panel and other student participants. Also, student participants will be able to see each other's presentations and feedback, which could lead to a general raising of standards and expectations, strengthening future student research. The ACL Student Workshop is an inexpensive yet highly effective means of encouraging young and upcoming computational linguists. The intimate format encourages the student participants to begin building a rapport with established researchers. The workshop should contribute to the maintenance and development of a skilled and diverse natural language processing workforce, helping to produce a pool of researchers with the scientific and engineering knowledge required for future applications of natural language processing. It should help to foster international scientific exchange, providing merit-based opportunities for future leaders of the field to attend a conference that might otherwise be less geographically diverse than is desirable for the field. In addition, by building a supportive environment for these students, it is more likely that down the road, they will lend a supporting hand to other students who follow.","title":"Student Research Workshop in Computational Linguistics, at the Association for Computational Linguistics (ACL) 2005 Conference; June 27, 2005; Ann Arbor, MI","awardID":"0527130","effectiveDate":"2005-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["401949"],"PO":["565215"]},"109347":{"abstract":"Prior work by others has established a correlation between static seated postures and back discomfort, so that as sedentary jobs become more prevalent in the workplaces (e.g., with prolonged sessions of computer use), the incidence of musculo-skeletal problems, in particular lower back pain, is also on the rise. Physical movement has been shown to be a key preventative measure for back pain; individuals are better able to sit for prolonged periods when they can change their posture throughout the day. The potential benefit of introducing healthy movement into daily computer use has led the PIs to fundamentally rethink current desktop computer design, with the goal of transforming its static nature to one that moves and invites movement. In this project, the PIs will explore how movement-related benefits can be achieved in human-computer interaction, by designing and fabricating a prototype physically animated computer wherein the desktop monitor possesses the ability to move in subtly expressive ways that respond to its user. Through a human subject study designed to investigate the ergonomics of a moving screen, the PIs will evaluate whether the user's movement can be increased while sitting at a computer without negatively impacting task performance or quality of experience. Can the reciprocal movement of human and computer be designed to promote back health, without being distracting or annoying to the user? Can such movement, and its interaction with affect and cognition, be designed to improve the efficacy of computer use? The PIs believe this is possible in light of new theories in the literature that link physical posture and its influence on cognition and affect. The outcome of this work will be a set of design principles for how to introduce healthy movement into effective desktop computer usage, as well as an initial theory for ergonomic movement in human-computer interaction.<br\/><br\/>Broader Impacts: This work will establish a proof of concept for a novel technology, and will lay an initial and important theoretical foundation for new lines of research in HCI that explore the intriguing possibilities of incorporating ergonomic movement in human-computer interaction both for health benefits and also as a potential means to foster performance and learning gains.","title":"SGER: A Physically Animated Desktop Computer for Healthful Movement","awardID":"0533703","effectiveDate":"2005-06-01","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["457547","497073"],"PO":["565227"]},"105981":{"abstract":"Advances in computer-aided design and manufacturing (CAD\/CAM) now make it possible to create physical prototypes of complex three-dimensional objects directly from their digital representations, using a \"3D printer\". The basis for this is a process called Layered Manufacturing (LM), which slices the digital model into layers and prints these layers successively, each atop the previous one. An emerging application of LM is Computer-Aided Tissue Engineering (CATE), whose goal is to restore and improve human health through the creation of artificial organs. LM is used in CATE to construct biodegradable scaffold structures and to seed them with cells that then grow to form the desired organs.<br\/><br\/>This research will address several broad classes of algorithmic problems in LM, including geometric optimization, path planning, decomposition, and packing, with the added goal of leveraging the solutions to meet the needs of scaffold construction in CATE. The research will also involve an experimental component, which includes implementation and testing of algorithms and verification of results via physical prototyping. The intellectual merit of the research is that it will provide a rigorous algorithmic framework within which a number of challenging problems in LM, including scaffold construction, can be addressed, thereby leading to significant design and performance improvements. Simultaneously, these applications will provide interesting new problems that will stimulate further research in geometric algorithms. The broader impacts of the research are that it will foster further interaction between computer science and CAD\/CAM and CATE through the involvement of undergraduate and graduate students from these areas in the research, the integration of new topics into the algorithm design curriculum, and collaboration with industry.","title":"Geometric Algorithms for Layered Manufacturing, with Applications","awardID":"0514950","effectiveDate":"2005-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[279596],"PO":["565157"]},"102440":{"abstract":"Intellectual merit<br\/><br\/>Long-term preservation of digital data is critical in the sciences and especially so in the ocean sciences where the cost of data acquisition is very high, typically $750K per project for ship time alone, and re-acquiring datasets is generally not feasible. Instrumentation, media and formats are rapidly evolving, more diverse types of sensors are being used, and the volume of data collected is increasing exponentially. While there have been dramatic advances in storage technology, raw storage capacity alone will not solve the long-term data retrieval and preservation problems. Years after data were collected, researchers seeking to re-use the data struggle to discover information about the context of original observations. There is a critical lack of metadata<br\/>infrastructure, and substantial barriers often exist between individual projects, diverse computer systems, and different institutions. Because the requirements for long-term preservation of data and those for independent re-use of data have a great deal in common, they can both be met by a common approach, the publication of information in a digital library designed for handling scientific data. This award will establish a multi-institution, scalable digital archiving testbed, combining the efforts of the San Diego Supercomputer Center (SDSC), the Scripps Institution of Oceanography (SIO), and the Woods Hole Oceanographic Institution (WHOI). This inter-institutional demonstration project, will implement a fully functioning digital library, providing a spectrum of curatorial functions including automated ingest, metadata extraction, provenance tracking, validation, quality control, and access control. The combined SIO\/WHOI digital library will allow data from approximately 60 new oceanogrphic research projects to be preserved each year, augmenting data from roughly 1600 awards to dozens of institutions over the last 4 decades, over a wide range of disciplines. With the introduction of WHOI data, the testbed will provide access to data, photographs, video images and documents from WHOI ships, Alvin submersible and Jason ROV dives, and deep-towed vehicle surveys. Notions of scalability will be tested, as data volumes range from 3 CDs per cruise to 200 DVDs per cruise. An interactive digital library interface will allow combinations of distributed collections to be browsed, metadata<br\/>inspected, and objects displayed or selected for download. In addition, web services will be implemented to insure computer-to-computer interoperability, thus helping to streamline data interchange with the NOAA's National Data Centers, and with other major research consortia.<br\/><br\/> Broader impact<br\/><br\/>Data and technology from this effort will be incorporated in the second national teachers' workshop for the grantees' ERESE (Enduring Resources for Earth Science Education) Project, scheduled for summer, 2005 at SIO. These efforts will result in direct access for 3000 students in the classrooms of participating teachers, and a wider audience across the Internet as a component of NSF's National Science Digital Library. Seafloor photos and video from Alvin have enthralled schoolchildren around the world for generations. This effort will make these images much more readily accessible to students, teachers and the general public.","title":"Collaborative Research: Multi-Institution Testbed for Scalable Digital Archiving","awardID":"0455651","effectiveDate":"2005-06-01","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V753","name":"LIB CONGRESS-DIGITAL PRESERVAT"}}],"PIcoPI":["278961"],"PO":["371077"]},"105960":{"abstract":"The availability of inexpensive, reliable, high-capacity data storage devices in compact form factors has revolutionized personal computing and information management during the past decade. More recently, with the introduction of high-density disk drives into such products as digital cameras, audio players, and set-top video recording systems, storage devices are transforming the world of consumer electronics. These popular applications, as well as the use of mass storage systems in science and commerce, will motivate continued advances in magnetic recording technology. These advances, such as perpendicular recording, are expected to yield areal densities as high as 500 billion bits of information per square inch. Beyond that, however, magnetic recording technology will likely encounter fundamental physical limits on achievable density and data transfer rate. Therefore, it is vital to pursue new approaches to high capacity digital information storage. Many of these approaches use page-oriented reading and writing, in contrast to today's track-oriented methods. Examples include recording on nano-scale patterned media, multi-beam two-dimensional optical recording, and optical holographic recording. This project studies theoretical limits on the storage capacity of these page-oriented technologies, as well as the signal processing and coding algorithms needed to achieve those limits in practice. <br\/><br\/>Specifically, the project addresses theoretical and algorithmic aspects of coding and detection for noisy two-dimensional channels with intersymbol interference channels. The investigators study novel iterative, soft-input, soft-output detection methods for these channels, as well as capacity-approaching algebraic and graph-based error-control codes and their decoding algorithms. The project also develops information-theoretic foundations and construction techniques for two-dimensional constrained modulation codes. These signal processing and coding methods are combined in novel system architectures, whose performance is evaluated using analytical and computational methods.","title":"TF-Capacity-Approaching Coding and Detection for Page-Oriented Digital Recording Channels.","awardID":"0514859","effectiveDate":"2005-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":[279549,"522738"],"PO":["348215"]},"105971":{"abstract":"The identification of all protein coding genes in a genome sequence and the determination of the cellular functions of the proteins encoded by these genes can only be accomplished by combining powerful computational tools with a variety of experimental approaches. It is unrealistic to expect that every single gene and protein will ever be studied experimentally. However, using relatively cheap and fast computational approaches, it is usually possible to reliably predict the protein-coding regions in DNA sequences and to predict the functions of the encoded proteins.<br\/><br\/>Within this context, the investigator improves the accuracy of secondary structure predictions by discovering the most significant dependencies using statical analysis. In addition, the investigator incorporates non-local correlations that arise from hydrogen bonding interactions in beta-strands. This is achieved by extracting hydrogen bonding statistics in interacting beta-strand segments and by implementing a hidden Markov model (HMM) that combines non-local hydrogen bonding patterns with local physiochemical interactions.","title":"Understanding the Book of Life: Bayesian Protein Secondary Structure Analysis and its Application to Protein Function Prediction","awardID":"0514903","effectiveDate":"2005-06-15","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["347935"],"PO":["564898"]},"104530":{"abstract":"Proposal ID: 508225<br\/>Title: NER: Bipolar Quantum Dot Thermoelectric Devices<br\/>Inst: U. of Michigan<br\/>PI: Kevin Pipe<br\/><br\/><br\/>ABSTRACT<br\/><br\/>Thermoelectric coolers are rapidly becoming a viable alternative to conventional vapor-compression (household) refrigerators due to their comparable efficiency, smaller size\/weight, and higher reliability. In addition, thermoelectric coolers have the capability to be scaled down in size to cool small devices such as integrated circuits, and can be operated reversibly to generate electrical power from a heat source. The metric used to quantify the efficiency of a thermoelectric material is the figure-of-merit ZT, which for the best thermoelectric materials has remained nearly constant at ZT=1 for the last 50 years. In the last several years, however, research into nanostructured materials that have specially-tailored properties has demonstrated ZT values of more than 2.<br\/>In this work, we will explore a new effect that has recently been shown to increase thermoelectric performance at the nanoscale. Measurements indicate that simple diode structures (a basic building block of electronic devices) have strong thermoelectric effects near the internal semiconductor bipolar junction that defines the device. We will take advantage of this effect by creating a nanostructured thermoelectric material in which bipolar junctions are interspersed throughout the material at interfaces with quantum dots, causing a net increase in the thermoelectric performance of the material. We will use several methods to measure how the presence of these quantum dot bipolar junctions affects thermoelectric properties on a nanometer scale as well as how they affect the overall ZT of the material.","title":"NER: Bipolar Quantum Dot Thermoelectric Devices","awardID":"0508225","effectiveDate":"2005-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["445970","508096"],"PO":["562984"]},"107512":{"abstract":"Workshop on Feedback Control of Computing Systems (Tilbury)<br\/><br\/>A Workshop on Feedback Control of Computing Systems is supported by NSF in May, 2005, to bring together key academic and industrial researchers in the field of control of computing systems. In addition to suggesting new research problems and identifying gaps in current theory and practice, the workshop goal is to assess viability, importance, potential, and expected impact of key recent contributions and research directions in the field.<br\/><br\/>This workshop is motivated by two considerations. The first is progress made in control of computing systems in the current decade. Accelerated research efforts were conducted in different research communities including Networking, Hybrid Control, Real-time and Embedded Computing, Quality-of-Service, Web Architecture, Databases, Distributed Systems, among others. A second consideration is the demonstration that control theory can be used effectively by software practitioners in the development of commercial products, such as IBM's experience with autonomic features in DB2. The workshop seeks a unified view of the field that identifies commonalities between isolated research problems, provides opportunities to generalize, develops broad theoretical foundations for this new class of control problems in which the controlled process is a (typically distributed) software entity, and identifies likely application areas for practical impact. The workshop provides an opportunity for an interdisciplinary exchange to identify key research problems that are fundamental, cross-cutting, and most broadly applicable within the software system control domain. A compilation of the results is to be made publicly available and disseminated through published reports in control and computer science magazines and newsletters.","title":"Workshop on Feedback Control of Computing Systems","awardID":"0522209","effectiveDate":"2005-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["502459"],"PO":["561889"]},"106016":{"abstract":"One of the great challenges of neuroscience is to understand how nerve cells act synergistically to create perception, thought, and emotion. The PI has for the last 16 years directed the Boston Retinal Implant Project, the goal of which is to develop a prosthesis to restore vision to the blind. An extrapolation of this work strongly suggests that even a perfectly engineered device will not succeed in producing high quality vision. The missing factor is the knowledge of how to communicate with the central nervous system, of which the retina is a part. The neural code is complex; developing insights into its properties will occur gradually, and over a much longer period of time than this grant will cover. The PI's goals for this phase of the project are to develop platform technologies to advance the study of neural coding, and to perform learning experiments that will provide new information about the natural coding of the visual system and how artificial stimuli can be delivered to emulate natural responses. Using the existing strengths of his research group, the PI will build devices that will make it possible to record and wirelessly transmit neural responses from large regions of the retina or brain, with the ultimate goal of capturing these responses in awake animals as they roam freely within a test environment. Computational strategies will be used to compare neural responses that are generated by stimulating the retina with light to those generated by stimulating the retina with electricity delivered in the same geometric patterns. Learning algorithms will be used to adjust the patterns of electrical stimulation to emulate the natural light-induced responses. Collectively, these studies will provide new insights into properties of neural coding and how the natural responses of the brain can be emulated to create vision, and take us a few steps further along the path toward restoration of function to disabled patients.<br\/><br\/>Broader Impacts: This work will increase the probability that a retinal prosthesis will one day restore useful vision to blind patients. Many millions of patients with age-related macular degeneration and another 1.6 million with retinitis pigmentosa suffer from blindness because of a relatively selective loss of photoreceptors. A retinal prosthesis could restore vision to such patients by directly stimulating the nerve cells that connect the eye to the brain. This hope will be realized only if proper communication strategies to deliver visual information to the brain are learned. This research will also train students in engineering and biomedical disciplines who will contribute to the emerging fields of neural coding, brain-machine interfaces and the science of learning.","title":"Development of a Technological Platform to Study the Neural Code for Vision","awardID":"0515134","effectiveDate":"2005-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["486094","486352","486351"],"PO":["565227"]},"109349":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 17 promising graduate students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the 11th International Conference on Auditory Display (ICAD 2005), to be held July 6-9 in Limerick, Ireland. ICAD is an interdisciplinary conference whose focus is on using sound to display\/convey information; topics include, but are not limited to, data sonification, auditory wayfinding, auditory graphs, speech interfaces and virtual environments, along with associated perceptual, cognitive, technical, and technological research and development. Many of these efforts are of direct relevance to persons with perceptual disabilities, especially visual impairments; a common approach in this field is universal design, wherein a display strategy is developed once to be used by all kinds of users. The goal of the doctoral consortium is to bring together graduate students from diverse backgrounds (e.g., engineering, computing, music, and psychology), so that they can experience the broad spectrum of approaches to auditory displays, assistive technologies and universal design, while exploring their research interests through interaction with peers and under the guidance of a panel of distinguished experts in the field. To these ends, the ThinkTank will develop a supportive community of scholars and a spirit of collaborative research, by providing participants with a friendly and open, yet rigorous, scientific forum to present their research ideas, listen to ongoing work from peer students, and receive constructive feedback. Student participants will make formal presentations of their work during the ThinkTank and will receive feedback from the faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The ThinkTank will also provide students with relevant information about important issues for doctoral candidates, whether they are considering academic or industrial career paths. The event will further offer invited speakers and discussion groups, and will involve many students as part of the audience and discussion groups, in addition to those presenting their work. An evaluation of the ThinkTank will be conducted, the results to be made available to the organizers of future conferences and consortia.<br\/><br\/>Broader Impacts: This event will promote scholarship and networking among new researchers in an important emerging interdisciplinary area, and will help shape ongoing and future research projects that have clear and important implications for development of assistive technologies and universal access. The doctoral consortium will afford participants exposure to a larger community, allowing them to bond among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality and culture as well as scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"Think Tank (Doctoral Consortium) at International Conference on Auditory Display 2005","awardID":"0533717","effectiveDate":"2005-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["529975"],"PO":["565227"]},"104575":{"abstract":"Proposal no: 508416<br\/>Title: NER:Carbon Nanotube Absolute Displacement Encoder with Atomic Lattice Registry Sensitivity <br\/>PI: Min-Feng Yu<br\/>Inst.: University of Illinois at Urbana-Champaign<br\/><br\/><br\/>ABSTRACT:<br\/>The goal of this research is to understand the fundamental issues related to the atomic lattice registry related interlayer tunneling in multiwalled carbon nanotube and to explore the development of novel devices based on this basic understanding. The research will exploit concurrently the unique structural, mechanical and electronic properties of carbon nanotube and engineer them for the application of carbon nanotube in a new field: nanometrology. The research will ultimately lead to the development of a brand new type of nanometrology device, namely an absolute displacement encoder with sub-nanometer resolution, which has rarely been explored, but could find wide application in precision engineering and nanoscale fabrication. The proposed research integrates nanomaterials, nanofabrication and precision engineering, and requires broad knowledge in electronics, mechanics, physics and engineering. The program is thus multi-faceted from an education point of view, and provides a perfect learning and training opportunity for the active participation and effective education of students.","title":"NER: Carbon Nanotube Absolute Displacement Encoder with Atomic Lattice Registry Sensitivity","awardID":"0508416","effectiveDate":"2005-06-15","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["541378","541157","493657"],"PO":["562984"]},"106028":{"abstract":"Computational Geometry Algorithms for Medical Problems in Radiation Therapy and Medical Imaging <br\/><br\/>This project investigates a number of important computational geometry problems that arise in radiation therapy, medical imaging, and other applications. The target geometric problems include multileaf collimator leaf sequencing, field partitioning, shape approximation, sphere packing, and image segmentation and analysis. These problems play crucial roles in current medical research and clinical practice, especially in diagnostic imaging and radiosurgical treatment of cancers and other diseases. The project has broader impacts beyond computational geometry and computer science. It will produce efficient and effective algorithms and software for solving key problems in radiosurgery, medical imaging, and other related medical areas. New algorithmic approaches and software for computing radiosurgical plans of much better quality for cancer treatment than those used in current clinical practice will be developed. Optimal quality 3-D and 4-D medical image segmentation algorithms for various anatomical structures and their motions will be obtained. Thus, this study will help unite the powers of computer algorithms and modern medicine, and improve the quality of life for patients. <br\/><br\/>Theoretically, the target problems belong to fundamental topics of computational geometry such as geometric packing, covering, shaping, partitioning, and approximation, and present significant new challenges and new problem sources to computational geometry research. To develop new geometric techniques for solving these problems, diverse ideas and methods from other theoretical areas, such as graph algorithms, combinatorial optimization, and operations research, must be utilized. Algorithm implementation, experimentation, evaluation, and software development are a crucial component of this project. The investigator's group has been working with medical researchers and practitioners, and has access to real medical data and clinical radiation treatment systems for their experimental studies. The intellectual merit of this research includes: (1) providing new algorithmic techniques for solving a set of important geometric problems confronted by current medical research and practice; (2) introducing fresh and theoretically interesting problems and algorithms to computational geometry, enriching this area, and prodding further development of geometric techniques; (3) presenting new challenging problems and new approaches to other theoretical areas such as graph algorithms, combinatorial optimization, and operations research, and bringing new applications to these areas.","title":"Computational Geometry Algorithms for Medical Problems in Radiation Therapy and Medical Imaging","awardID":"0515203","effectiveDate":"2005-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["518029"],"PO":["565157"]},"100374":{"abstract":"CAREER: Improving Multiprocessor Availability with Dynamic Verification and Autonomic Operation<br\/>Abstract<br\/><br\/>The research focuses on hardware-based techniques for fault detection and recovery in multiprocessor systems. Specifically the project examines correctness with respect to the following safety and timing properties of the system: dynamic validation of the correctness of the consistency model, dynamic detection of deadlock and livelock, and autonomic recovery from detected errors (transient or permanent). <br\/><br\/>Improved computer availability will provide a qualitative benefit to society that increasingly depends on reliable computer systems. The research is motivated by the tremendous economic and human costs resulting from unanticipated downtime or unmonitored malfunctions in safety-critical systems.","title":"CAREER: Improving Multiprocessor Availability with Dynamic Verification and Autonomic Operation","awardID":"0444516","effectiveDate":"2005-06-15","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["536996"],"PO":["559883"]},"104565":{"abstract":"ABSTRACT:<br\/><br\/><br\/>Proposal no: 0508382 <br\/>Title: \"NER: WISP: Wire-Streaming Processors in 2-D Nanoscale Fabrics<br\/>PI: Csaba Andras Moritz<br\/>Inst: University of Massachusetts<br\/><br\/>In this proposal, the PIs outline a project whose goal is to explore the design and capabilities of high-density nanoscale integrated circuit systems. A key objective is to address the impact of device and fabrication properties on computing and fully exploit the density advantages of nanoscale devices based on silicon nanowires or carbon nanotubes. In addition, the proposed work could have a significant impact at the nanodevice level, by establishing desirable device characteristics and fabrication requirements required for successful nanoscale architectures. In the proposed WIre-Streaming Processors (WISP) design data is streamed through the nanofabric with minimal control with intermediate results during processing often stored on the wire without requiring explicit storage. The added nanodevice-specific optimizations help maximize the density advantages of nanodevices as the building blocks of nanoscale architectures.","title":"NER: WISP: Wire-Streaming Processors in 2-D Nanoscale Fabrics","awardID":"0508382","effectiveDate":"2005-06-15","expirationDate":"2006-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":["485542","408968"],"PO":["562984"]}}