{"135421":{"abstract":"In the early 1990s, the introduction of the CAVE display, which permits a group of people to share a virtual space simultaneously, was a major milestone in the development of projective virtual environments. Since then, many researchers, including those at UNC, have developed new methods for combining projectors into large tiled displays with seamless imagery on arbitrarily shaped display surfaces. Achieving wide-area virtual presence involves monumental challenges in 3D reconstruction, model management, and simulation, as well as display. Among the applications for this work are virtual team training and telepresence.<br\/><br\/>This project creates a one-of-a-kind laboratory in the new 35,000-sq.-ft. Frederick P. Brooks Jr. Computer Science Building (part of the UNC Computer Science complex) dedicated to wide-area virtual presence research, multidisciplinary collaborative applications, and education and outreach. The researchers use the facility to pursue independent but coordinated research in the following complementary areas related to virtual presence. Samples of their work are: wide-area 4D scene\/event capture in room-sized spaces that include moving humans; modeling of 3D scenes from non-uniform arrays of cameras using spatio-temporal hypervolumes;multi-person motion tracking\/capture with the goal of achieving completely markerless tracking, specially of the head and limb pose; exploration of the space-time\/frequency characteristics of human motion to aid in prediction and to help quantify uncertainty; wide-area, immersive, high-resolution multi-person displays; and comparison of user behavior in a virtual environment to the gold standard of user behavior in the real world, to decide what is important from a technology standpoint.<br\/><br\/>Beyond the core research related to wide-area virtual presence, the investigators use this leading-edge facility for multidisciplinary collaborative projects that benefit from the tightly coupled capture, computation, or display infrastructure. The investigators will also make use of the infrastructure for several education and outreach projects, to start developing the next generation of computer scientists.","title":"CRI: IAD Integrated Projector-Camera Modules for the Capture and Creation of Wide-Area Immersive Experiences","awardID":"0751187","effectiveDate":"2008-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["550455","371221","554470",359767,"541984"],"PO":["532791"]},"136301":{"abstract":"IIS - 0755534 <br\/>Title: REU Site: Coordination, Communication, Autonomy: Principles and Technologies<br\/>PIs: Gaurav Sukhatme and Leana Golubchik<br\/><br\/>Institution: University of Southern California<br\/><br\/>REU Site: Coordination, Communication, Autonomy: Principles and Technologies<br\/><br\/>PI: Gaurav S. Sukhatme Institution: University of Southern California<br\/><br\/>The objective of this REU site is to train students in research methodology and to enthuse them about Computer Science research. The intended impact is that a signicant proportion of the students go on to graduate school. Students will work with faculty mentors and their graduate students at the Computer Science department at the University of Southern California. A training program in ethics is planned as are three external research visits to local research labs in the Los Angeles area. A vibrant social program is planned to facilitate a sense of community wherein students will interact with participants in summer internship programs on the USC campus. A formal assessment of outcomes is planned via a principled and rigorous site evaluation program. The participating faculty mentors are well established in their fields and span a spectrum of cutting edge research topics in Computer Science.<br\/><br\/>Students participating in the program will have a chance to work on projects spanning robotics, agents and artificial intelligence, networks and systems, algorithms and modeling, and software engineering. Within robotics, projects are available in the newly emerging societally relevant area of robotics for healthcare and at- risk populations, networked robotics for scientic discovery covering water and air pollution monitoring, and humanoid robotics. Agents and artificial intelligence projects span multi-agent systems, planning and learning. Networking and systems projects include networked sensing and its use in scientic applications, scalable and robust routing infrastructures in large networks such as the Internet, data dissemination in wireless sensor networks, structural properties of the Internet and high level abstractions and analytical models. <br\/>Within algorithms and modeling, students may work on graph algorithms, applications to networks, randomized algorithms, and information flow through networks. Finally, projects are available in software architecture modeling and analysis for embedded systems, middleware facilities for architectural implementation and software reliability modeling.<br\/><br\/>We are especially interesting in attracting participation in the USC Computer Science REU site from three populations: 1. academically talented students from traditionally underserved colleges and universities, 2. women, and 3. underrepresented minorities.","title":"REU Site: Coordination, Communication, Autonomy: Principles and Technologies","awardID":"0755534","effectiveDate":"2008-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["410098","560335"],"PO":["564318"]},"135355":{"abstract":"A number of new developments in video coding and networking are dramatically changing multimedia networking, including: (i) HDTV resolution video transmission over IP networks, (ii) fundamentally new scalable coding paradigms introduced with the scalability extensions of the H.264\/AVC (Advanced Video Coding) codec, (iii) novel error resilience techniques, and (iv) the UMA (Universal Media Access) paradigm, which allows for unprecedented flexibility in content characterization and adaptivity in video transport. These new coding techniques open a vast research and development space for novel video transport mechanisms and make possible groundbreaking advances over existing mechanisms. To enable the exploration of this research space we (a) design trace characterizations of the new video coding paradigms, (b) create and disseminate an extensive publicly available library of video traces for these new codec developments, (c) conduct statistical analyses of the video traffic and quality and the video content features captured in the traces and (d) formulate usage guidelines for the trace library.<br\/><br\/>The intellectual merit of this community resource development project is the design of trace characterizations capturing the traffic, quality, and content features of video up to HDTV resolution coded with the new scalability, error-resilience, and UMA paradigms in video traces. The provision of both these traces and of the statistical analysis of the traffic, quality, and content characteristics will inform and advance networking, systems and video research.<br\/><br\/>The broader impact is provision of these sophisticated traces and analytical results in free and publicly available form. In particular, this video trace library allows the networking research community to keep pace with the developments in the video coding area and provides traces that reflect the properties of the video codings that will dominate the future Internet and wireless networks. The video trace library and the accompanying trace usage guidelines\/tutorials enable and educate networking researchers without deep video coding expertise and\/or without up-to-date equipment to conduct timely, high-quality research on a wide range of critical multimedia networking projects and hence to expand the research base.","title":"CRI: CRD: VIDEO TRACES II - Designing, Creating, and Disseminating Video Traces for Networking Research","awardID":"0750927","effectiveDate":"2008-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[359564,"455149"],"PO":["535244"]},"134597":{"abstract":"The PI introduces the term Anywhere Augmentation to refer to the idea of linking location-specific computing services with the physical world, making them readily and directly available in any situation and location. This project embodies a novel approach to Anywhere Augmentation based on efficient human input for wearable computing and augmented reality (AR), through both sketch-based interfaces on hand-held devices and direct-overlay 3D user interfaces. Mobile augmented reality is a powerful interface for wearable computing. If computer users are enabled to place arbitrary annotations in 3D space wherever they go, the physical world becomes the user interface. Instead of embedding computing and display equipment in the environment as in the case of ubiquitous computing, graphical annotations are overlaid on top of the environment by means of optical see-through glasses or video overlay. Robust registration between the physical world and the augmentations is necessary. Current approaches rely on the availability of a 3D model of the environment or on its instrumentation with active or passive markers. The PI's approach is novel in that he proposes to emphasize, support, and utilize the expertise of the human in the loop to make Anywhere Augmentation feasible. Human users generally have a clear grasp of the layout of the scene in front of them, and they can easily identify the physical objects with which information should be linked. The PI plans to enable users to transfer their intuitional scene understanding to the computer through intelligently constrained and assisted user interfaces. Current real-time computer vision techniques and algorithms, while far from being able to facilitate automatic scene understanding, are very well suited to constrain and guide a user?s informed input for scene analysis and augmentation, delivered in the form of a few simple point selections, stroke gestures, and common classifications. As a main source of input, the PI will employ video feeds from small head-worn or palm-top-device cameras. The devices, algorithms and interaction techniques will be applicable to novel settings and application scenarios (e.g., visualization of occluded infrastructure, navigational guidance, and social and educational applications for high-school students).<br\/><br\/>Broader Impact: The PI will use this research as a case study and platform for projects supporting the teaching of human-computer interaction fundamentals. As a first step towards actively furthering the inclusion of minority students in the benefits of the research, the PI has partnered with Jackson State University, MS, and will also collaborate with outreach programs supporting local underrepresented K-12 students, where he will enhance the after-school programs and field trips with carefully planned AR experimentation and mentoring. The goal of Anywhere Augmentation will be tested by making research products (new devices, tools, and interfaces) available to students and field scientists in a wide variety of environments (e.g., as a campus navigation and inventory tool, for an emergency response scenario, at UCSB lab open houses, and at international conferences). The PI will also introduce innovations in three courses in the curriculum of the UCSB Computer Science Department (an undergraduate elective on HCI which he established, the undergraduate senior CS design project course cycle, and a new graduate course on 3D user interfaces), so they include hands-on experiences on effective UI design and programming for mobile devices, including mobile AR interfaces. To this end, the PI will also involve the UCSB Allosphere, a 3-story spherical surround-view 3D immersive space, as a mobile AR simulator.","title":"CAREER: Anywhere Augmentation: Practical Mobile Augmented Reality in Unprepared Physical Environments","awardID":"0747520","effectiveDate":"2008-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["518684"],"PO":["565227"]},"135401":{"abstract":"Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture.<br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin.<br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0751112","effectiveDate":"2008-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["540130","485309","558495",359692,"550720"],"PO":["565272"]},"135412":{"abstract":"Commodity processors are highly programmable, but their need to support general purpose computation limits both peak and sustained performance. Such observations have motivated the use of \"accelerator\" boards, which are co-processing elements that interface with the host server through a standard hardware bus such as PCI-Express but have their own computational engine and typically their own memory as well. Unlike the main processor, the accelerator does not support general applications; instead, its hardware and software is tuned for only specific types of computations. Accelerators can offload the most demanding parts of an application from the host processor, speeding up the desired computation using their specialized resources. This improved performance enables various forms of high-performance computing (HPC), but comes at a high cost in programmability.<br\/><br\/>This research targets high-performance computing research using PC-based clusters for cost and scalability combined with accelerators for high performance. The Purdue Everest project encompasses several related efforts in achieving high performance, low power consumption, and high programmability for highly heterogeneous systems. Acquiring a 30-node Gigabit Ethernet-based cluster of multicore PC-based workstations equipped with various accelerator boards (e.g., GPU, Cell, FPGA, Crypto) will enable research into effective and highly-programmable use of accelerator-based clusters. Supporting multiple accelerators per node allows applications to use different accelerator boards in different phases. This cluster also allows fair apples-to-apples comparisons of different accelerators by keeping the other system factors constant. This research also investigates the use of multiple concurrency domains, with parallelism across the cluster, across the cores in a single node, among the host processors and accelerators in a single node, and across the processing elements of a given accelerator.","title":"CRI: IAD: Accelerator-Based High-Performance Computing","awardID":"0751153","effectiveDate":"2008-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["558595","550994","517389","518316","451692"],"PO":["565272"]},"134598":{"abstract":"The goal of this project is to enable novices (non-programmers and non-expert storytellers) to create interactive dramas (IDs), artificial intelligence (AI) based interactive story experiences with autonomous characters and dynamic plot progression. Accomplishing this goal requires answering the following research question: how can one incorporate storytelling and character creation theories from the theory of dramatic writing, as well as theories of storyboard layout from comics, into an AI model of story generation and character creation that collaborates with a human author to create an ID. Most research work in ID has focused on individual components, such as autonomous character architectures or story managers\/generators, not on fully integrated systems with engaging content. This is primarily due to the difficulty of authoring; creating IDs currently requires large, interdisciplinary teams of AI researchers, story authors and domain experts. This project will address the authoring problem by combining novel work in story generation, novel work in visual interfaces for programming, and authoring insights from the only publicly fielded, complete ID (Facade).<br\/><br\/>Enabling novice authoring of ID will have significant impact: as a new and powerful mode of personal expression, in applications of ID technology to education and training, and for engaging middle school and high-school students in computational expression. Unlike traditional videogames, ID focuses on interpersonal interaction, enabling rich and powerful game-like experiences that focus on meaningful social interaction with autonomous characters within a dynamically generated, changing story. Such technology is essential for serious games (games for education and training) that focus on people-to-people interaction, such as management training, and public service games that tackle complex topics such as racism. Currently, the construction of IDs requires teams of experts, putting them out of reach of individuals and organizations who are not technology and game design experts, but who wish to harness this powerful new medium. The goal of the project is to take the construction of ID out of the hands of experts, and make it available to everyone.","title":"CAREER: Automated Support for Novice Authorning of Interactive Drama","awardID":"0747522","effectiveDate":"2008-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["536597"],"PO":["564456"]},"134401":{"abstract":"The maturing discipline of ubiquitous computing (ubicomp) has largely ignored usability in lieu the more fundamental quest to simply develop and deploy compelling applications. In these projects usability and social analysis is often post-hoc, one-off, and not accreting into a uniform body of scientific knowledge. This project spotlights the core ubicomp usability challenge as \"intelligibility.\" That is the mapping of mental models, the user's explanations and predictions of a system's expected behavior, to the actual behavior of context-aware ubicomp application. While the use of mental models has been applied to well-understood systems, its application to context-aware systems is novel and promising. It is critical to understand how mental models develop, what sorts of explanations will promote correct mental model formation and what feedback will support users in making correct predictions about application behavior.<br\/><br\/>Broader Impact: <br\/>The combination of the fundamental understanding gleaned from the proposed studies with the resulting widely disseminated toolkit, has the potential to enable a new class of context aware applications and related usability metrics. Improved usability of and trust in context-aware applications should reduce the chance of abandonment by making it clear how these applications behave. Easier to understand systems may engage a broader cross-section of end users, advancing the adoption of context-aware systems. <br\/><br\/>The PI has demonstrated that ubicomp design and evaluation projects such as this engage undergraduates from groups under-represented in computer science research.","title":"CAREER: Supporting the Intelligibility of Context-Aware Applications","awardID":"0746428","effectiveDate":"2008-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["532662"],"PO":["564456"]},"134522":{"abstract":"Abstract<br\/><br\/>Title: Integrated system for object and scene recognition<br\/><br\/>PI: Antonio Torralba<br\/><br\/>Institution: MIT<br\/><br\/>In traditional computer vision, scene and object recognition are two related visual tasks generally studied separately. By devising systems that solve these tasks in an integrated fashion it is possible to build more efficient and robust recognition systems. At the lowest level, significant computational savings can be achieved if different categories share a common set of features. More importantly, jointly trained recognition systems can use similarities between object categories to their advantage by learning features which lead to better generalization. In complex natural scenes, object recognition systems can be further improved by using contextual knowledge both about the objects likely to be found in a given scene, and also the spatial relationships between those objects. Object detection and recognition is generally posed as a matching problem between the object representation and the image features while rejecting the background features using an outlier process. The PI will formulate object detection as a problem of aligning elements of the entire scene. The background, instead of being treated as a set of outliers will be used to guide the detection process.<br\/><br\/>In developing integrated systems that try to recognize many objects, the lack of large annotated datasets becomes a major problem. The PI created and will extend two datasets; LabelMe and the 80 million tiny images datasets. LabelMe is an online annotation tool that allows sharing and labeling images for computer vision research. Both datasets offers an invaluable resource for research and teaching on computer vision and computer graphics. The datasets are also intended to foster creativity, as they allows students at all levels to explore well established algorithms as well as devise new applications in computer vision and computer graphics. The PI will also develop new image and video datasets by exploiting the millions of images available on the internet.<br\/><br\/>The creation of robust systems for scene understanding will have a major impact on many fields by allowing the creation of smart devices able to interact and understand their environment, from aids to the visually-impaired, to autonomous vehicles, robotic assistants, or online tools for searching visual information.<br\/><br\/>The PI will extend his teaching and research activities beyond the boundaries of the classroom and the laboratory by developing a substantial amount of online material.<br\/><br\/>URL: http:\/\/people.csail.mit.edu\/torralba\/integratedSceneRecognition\/","title":"CAREER: Integrated system for object and scene recognition","awardID":"0747120","effectiveDate":"2008-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[357604],"PO":["564318"]},"135347":{"abstract":"Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0750884","effectiveDate":"2008-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["430632"],"PO":["565272"]},"135369":{"abstract":"Computer architecture research has greatly benefitted from insights gained running simulation experiments. The infrastructure proposed for acquisition in this project is a high-performance server capable of 64-bit operations which will be used to support simulations and related research activities aimed at improving the performance and resiliency of multicore processor systems as well as reducing power consumption. The infrastructure will also be used by faculty and students in the PI's department to conduct simulations in specialized undergraduate and graduate computer architecture courses.","title":"CRI-IAD: Infrastructure Acquisition and Development for Computer Architecture Research and Education","awardID":"0750985","effectiveDate":"2008-04-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[359600,"524103"],"PO":["565272"]},"131894":{"abstract":"Earth Systems Science (40). SACNAS (Society for the Advancement of Chicanos and Native Americans in Science) is promoting polar science and education among Native American and other underrepresented minority (URM) communities by adding a polar science dimension to its annual conferences. The 2008-2010 IPY-themed national conferences are using polar scientists as keynote speakers, guides for scientific symposia, and structured mentors for students. URM participation in the conferences is being encouraged by targeted travel grant programs. Minority students are being: exposed to role models with similar backgrounds who are leaders in polar science and can advise on career options; alerted to internship opportunities; connected to URM student social networks; and advised on effective leadership skills to navigate the scientific enterprise. A host of supporting activities includes the use of SACNAS' Minority Postdoctoral Community as an online resource for peer-to-peer mentoring. The project is using ongoing assessment and evaluation to improve its effectiveness in recruiting URM into polar science as well as in creating a bridge between the scientific community and the traditional knowledge and values of Tribal leaders. The broader impact of this project includes increased URM participation in polar science, educating URM on the issues of polar science and climate change on human communities, and improving URM understanding of the role of the Polar Regions in global processes.","title":"IPY: A SACNAS Initiative for Engaging New Audiences in Polar Science","awardID":"0733055","effectiveDate":"2008-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"7783","name":"UNGRAD RES MENTORING IN BIO"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1575","name":"EDUCATION AND HUMAN RESOURCES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7492","name":"CCLI-Type 2 (Expansion)"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7494","name":"CCLI-Type 1 (Exploratory)"}}],"PIcoPI":["453858","528716","528713"],"PO":["468673"]},"143015":{"abstract":"IPDPS is an international forum for engineers and scientists from around the world to present their latest research findings in all aspects of parallel computation. In addition to technical sessions of submitted paper presentations, the meeting offers workshops, tutorials, and commercial presentations & exhibits.<br\/><br\/>This proposal is to seek l funding for TCPP to allow 20 awards (at $500 per student), to be split evenly between IPDPS student author and inaugural TCPP PhD forum travel support.<br\/>This would particularly allow several underrepresented women and minorities to be awarded travel support, increasing the likelihood of their participation. Each award will provide up to $500 for reimbursement of actual travel, accommodations, and registration expenses.<br\/>In making these awards, the TCPP gives priority to individuals who would otherwise be unable to attend and to students presenting their own published work.","title":"Student Travel Support for TCPP PhD Forum and IPDPS-08","awardID":"0829755","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["526127"],"PO":["565272"]},"136613":{"abstract":"An important aspect of creative thinking in science education is the set of metaphors that students use to understand and conceptualize material. Previous research has shown that metaphorical and analogical thinking are key components in creative processes and play an integral role in academic creativity. An important part of encouraging creativity through metaphor is raising a student's awareness of the conceptual metaphors they already use. However, identifying the metaphors that students use in their learning has previously been labor intensive, requiring a great deal of time and attention from a human instructor. Previous work in computational linguistics has enabled the automatic extraction of metaphor from bodies of written text. This project improves the state of the art in computational metaphor identification (CMI) through the use of large corpora, through the employment of typed dependency parsing, and through a comparison of several selectional preference learning techniques. The result will be a technological tool kit that supports human creativity by automatically identifying metaphors in bodies of text. This research makes a significant contribution to the fields of computer science and computational linguistics by improving existing metaphor extraction techniques through the integration of current research in selectional preference learning and dependency parsing. In the area of education research, the project will evaluate the impact of CMI on both students' thinking and teachers' teaching, as well as examining the perceived utility of CMI by both groups. This research will allow these metaphors to be used to anchor instruction. This project has the potential to improve creative thinking in science instruction by helping students and their teachers perceive more effectively the ways in which students are thinking about science concepts. In addition, the research may provide insight into how this type of system could enhance creativity and learning across a wide range of other disciplines. Finally, the ability to perform computational metaphor identification may have a variety of other potential applications, from automated search and information retrieval to knowledge representation and artificial intelligence.","title":"Pilot: Computational Metaphor Identification for Supporting Creativity in Science Education","awardID":"0757646","effectiveDate":"2008-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["422697","547658"],"PO":["424970"]},"131069":{"abstract":"Given a graph G=(V,E), an orientation of G assigns a direction to every edge of G. Recent research indicates that the set of all the orientations satisfying certain predefined properties often possesses good combinatorial structures. For example, the set of all the orientations with prescribed out degree for each vertex of a plane graph G is a distributive lattice. Several such orientations and their respective combinatorial structures have been studied for plane graphs recently. Those combinatorial structures have been successfully used in understanding the properties of the studied graphs and in designing new efficient graph algorithms. They find applications in many fields such as graph drawing, information visualization, VLSI layout, etc. However, two main challenges exist in this field: (1) finding more combinatorial structures to a broader class of graphs, and (2) finding the implications of the combinatorial structures to the studied graphs. <br\/><br\/>The principal investigator has recently obtained interesting results using various graph orientations. This research extends those results. The research activities include: (1) investigation on a special group of orientations of maximal bipartite plane graphs, which is somewhat related to the famous Barnette's conjecture, and hence may provide useful hints in solving this long-standing open problem, and (2) investigation on finding more combinatorial structures and their inter-relations to a broader class of graphs. In practice, the research is motivated by applications in graph drawing, information visualization, and VLSI layout problems. In theory, this research will discover novel combinatorial concepts, structures and algorithms for a broader class of graphs.","title":"Graph Orientation Structures and Their Applications","awardID":"0728830","effectiveDate":"2008-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["451236"],"PO":["565157"]},"135337":{"abstract":"Abstract <br\/>Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0750847","effectiveDate":"2008-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["409687"],"PO":["565272"]},"140035":{"abstract":"This award will help to subsidize the participation of graduate students in the third Northeast Student Colloquium on Artificial Intelligence (NESCAI) to be held May 2-4, 2008 at Cornell University in Ithaca, New York. This conference is to include oral and poster presentations by students and invited talks and tutorials by senior AI researchers. The conference will be largely run by a program committee consisting of doctoral students under the guidance of senior faculty. The program committee will conduct a review process to select the projects chosen for oral and poster presentations. In addition to graduate students, the conference plans to encourage attendance by a few outstanding senior undergraduates in the hope that it will increase their enthusiasm for research and thus the likelihood that they will go on to graduate work. The project integrates research and education and commits to broadening diversity.","title":"The Third Northeast Student Colloquium on Artificial Intelligence","awardID":"0813924","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["516488"],"PO":["387198"]},"135338":{"abstract":"Abstract <br\/>Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0750851","effectiveDate":"2008-04-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[359520],"PO":["565272"]},"134932":{"abstract":"This project will explore the utility of \"computational creativity\" as an organizing theme for interdisciplinary curricula in computer science, media arts, and cognitive science. The project develops and evaluates an approach to computer science education that challenges the students to develop computational creativity. A computational creativity system is a computational system that simulates the cognitive processes involved in human creativity, or that implements an algorithm that meets the criteria for creativity even if it is not cognitively based. The goal of this project is to develop, in joint work among computer science and media arts faculty and undergraduate students, computational creativity systems that are useful in real artistic practice. These systems will be extended and used in computer science, media arts, and interdisciplinary courses. The curriculum will integrate research and teaching while drawing new populations of potentially creative and diverse students into the study of computer science.<br\/><br\/>This project is experimental because it seeks to integrate and cross-fertilize curricula in two and possibly more disciplines in a novel way. The payoff for success may be high, however, because computational creativity could potentially integrate -- and draw students and ideas from -- several disciplines beyond computer science and media arts, including, for example, cognitive psychology, education, and philosophy of mind. The project will also explore ways in which the curriculum could be targeted to groups traditionally underrepresented in computer science, and expanded to include students from community colleges with significant populations of students from underrepresented groups. Software (including source code) and curricular materials will be disseminated on the internet for application at other institutions.","title":"The Computational Creativity Curriculum","awardID":"0749184","effectiveDate":"2008-04-01","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["554244","439613",358490],"PO":["424970"]},"134536":{"abstract":"Technology scaling has arguably been the most important contributor to the increase in the computational power in microprocessors and indirectly affects many aspects of modern life. One of the most important challenges facing continued technology scaling is the increasing variability in device characteristics, i.e., process variations. Process variations manifest themselves as fluctuations in performance, power, and reliability of manufactured processors. To mitigate these effects, this CAREER program develops variation-tolerant architectures that utilize ?holistic optimizations?, i.e., this project studies techniques that simultaneously consider various computational abstraction levels. The two intriguing examples of such techniques are the consideration of economical incentives to measure the quality of architectures and optimizing for user-perceived performance to increase lifetime reliability. In addition, this project studies the development of understudy components and modular architectures. Understudy components are structures that can replace parts of the chips that fail, whereas modular architectures are processors built using a small variety of similar structures that can be dynamically allocated. These research tasks have the potential of having a large impact on both academic and industrial research. Process variations cause immense problems to all processor manufacturers and their rising impact should be understood in detail. In addition, there is a growing need to understand how different architectures affect the overall targets of the processor manufacturers as well as the users of these processors. Such an understanding, which will be developed in this project, can then be used to architect much more efficient processors.","title":"CAREER: Holistic Computer Architectures for Nanoscale Processors","awardID":"0747201","effectiveDate":"2008-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["409687"],"PO":["366560"]},"135339":{"abstract":"Abstract <br\/>Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0750852","effectiveDate":"2008-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["537232"],"PO":["565272"]},"141873":{"abstract":"0823774<br\/><br\/>This project explores a new class of parallel algorithms that process very large network datasets. The goal is to be able to analyze 2.7 billion pings to map the Internet address space, process six months of flow records to understand long-term traffic trends, and search a week?s worth of packet headers to retroactively detect zero-day compromised machines. Each of these tasks requires efficient and economical processing of datasets in sizes from 50GB to several terabytes. This leap in dataset sizes by a factor of 100-1000-fold or more requires fundamentally different ways of handling network data than today?s tcpdump and ethereal on a workstation. Two recent developments make this leap possible. First, Google has demonstrated that the map\/reduce abstraction be easily parallelized and run efficiently and cost-effectively over clusters of hundreds of commodity PCs. It is the basis of their web search engine and has prompted at least one open source implementation. Map\/reduce is the computation engine of Google?s web search engine, increasingly being used in other applications. Map\/reduce is the key to processing huge network datasets. Second, recent programs such as PREDICT make massive network datasets available. PREDICT promises to make available packet header traces, address space scans, netflow records, dark address space traffic, and voice over IP (VoIP) call records from several large ISPs. At USC researchers are collecting packet header traces and address space scans. PREDICT is the key to obtaining huge network datasets. This work is proposes as a SGER because it is both timely and, at this point, highly speculative. The researchers must characterize what network problems can be solved by map\/reduce before a full proposal will be credible. This proposal is the key to demonstrating the potential impact of for map\/reduce processing of huge network datasets to change our understanding of the Internet.<br\/><br\/>The intellectual merit of this work is to develop a preliminary understanding of how to use map\/reduce style processing for network datasets. What algorithms are applicable? What problems parallelize well or poorly? What kind of compute clusters are needed? And more generally, how can networking researchers cope with gigabyte-to-terabyte datasets that are needed to describe a billion-user Internet?<br\/><br\/>The broader merit of this work is that it will lead to answers of both fundamental and practical questions facing the Internet. Considering these datasets, questions include: What does the Internet look like? At what rate is the Internet address space being consumed? How many Internet users connect with dynamic addresses? How can one respond to intrusions effectively? Can new techniques detect low-rate denial-of-service attacks, spam generation in compromised servers? Can one traceback and detect botnets control networks? More important than these specific questions is the broader question of how can one understand properties in a billion-node Internet and the petabyte-per day of traffic that flows over it.","title":"NeTS-NBD-SGER: Map\/Reduce for Network Traffic Analysis (MR-Net Sger)","awardID":"0823774","effectiveDate":"2008-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[377594],"PO":["565090"]},"135406":{"abstract":"The focus of this project is to plan for and then assemble an initial outdoor vehicular testbed, called MadBed (for its location in Madison, Wisconsin) equipped with unique capabilities of spectrum agility. <br\/><br\/>The testbed has been designed: (i) to enable a research plan that involves experimental support for ongoing projects of multiple research groups, initially at UW-Madison, and after the planning phase, for open access. <br\/><br\/>(ii) to initiate an educational plan that focuses on a laboratory-oriented curriculum and facilitates distance learning programs with other educational institutions; and introduces an undergraduate wireless experimentation laboratory that supplements courses with hands-on experience; and<br\/><br\/>(iii) to realize an outreach plan that includes public release of developed platforms and software, open availability of the testbed to the broader wireless research community, and demonstration of wireless substrate that may be of great value for research in the GENI vision. <br\/><br\/>The testbed is being deployed in the downtown area of Madison, WI. The pilot deployment for planning consists of 5 roadside (static) nodes and 4 vehicular mobile nodes, each equipped with a combination of software defined radio (SDR) and off-the-shelf radio interfaces. SDR technologies are ideally suited for use in vehicular networking environments where the conditions for communication can change rapidly with mobility and there needs to be adaptation at high speeds or else the vehicular networking will not become reliable enough to meet societal requirements. <br\/><br\/>MadBed is expected to evolve into a first-of-its-kind: a metro-scale, public testbed for research in vehicular networking with the use of spectrum agile interfaces. The broader impacts will derive from providing new capabilities and new degrees of reliability and resilience to an emerging type of communication, vehicular networking, that is expected to change the American scene.","title":"CRI-Planning: A Virtualized Vehilcular Wireless Testbed with Spectrum Agility","awardID":"0751127","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["553458","560207"],"PO":["434241"]},"135428":{"abstract":"Power consumption and related thermal effects of processor chips are worstening with each technology generation. Modeling the power and thermal behavior of processor chips requires challenging and complex validation approaches which, in some cases, may be unreliable. The proposed infrastructure project develops an infrared measurement setup that allows run-time power consumption of state-of-the-art processors to be accurately measured in real time. The proposed infrared measurement setup has a high spatial resolution (10x10um) with a high frame rate (125Hz) capacity to capture thermal maps of processor chips. The synchronized traces produced can be used to validate existing and newly proposed power and thermal models, and they can also be used to develop new process variability models for the design of future generation processor chips.","title":"CRI: IAD Temperature Measurement Infrastructure for Power, Variability, and Reliability Analysis","awardID":"0751222","effectiveDate":"2008-04-01","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["556721"],"PO":["565272"]},"135407":{"abstract":"Our goal is to create and validate the paradigm of a Real-Time Haptic Immersive Virtual Environment (RT-HIVE) as a venue to expand, assist, train and monitor human sensorimotor skills\/strengths, using the case-study of a Virtual Cadaveric Anatomic Simulator (VCAS) for anatomical dissection training.<br\/><br\/>Intellectual Merit: To realistically mimic the ?feel? and response of tissues during dissection\/surgery requires the development of new techniques and methods and furthering the state-of-knowledge in the engineering\/computational domains including: (i) novel design- and control-architectures for enhanced Haptic User Interfaces; (ii) advances in distributed architectures\/algorithms for real-time tool-interactions with irregular, inhomogeneous and nonlinear biological materials; and (iii) validation of transparent monitoring and quantitative assessment protocols for sensorimotor training.<br\/> <br\/>Broader Impact: The integration of such a VCAS simulator with systematic education programs will revolutionize the training of the next generation of health-care professionals (from novitiate nurses\/ medical students to specialist surgeons\/pathologists). We also see the VCAS as an important teaching and collaboration tool in research labs, classrooms, application settings or in conjunction with museum displays. Finally, the architecture, algorithms and validation efforts would be invaluable in the development of other such Virtual Reality (VR) based simulators.","title":"CRI: IAD: A Real-Time Haptic Immersive Virtual Environment (RT-HIVE)","awardID":"0751132","effectiveDate":"2008-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[359715,"550248"],"PO":["543539"]},"143339":{"abstract":"This Special Project award provides funding for a workshop to bring together professionals involved in programs and organizations involved in increasing the cultural diversity in the field of computing and information technologies. The workshop focus is on priorities with respect to ethnic diversity and access for persons with disabilities and on organization of a national center to coordinate activities and raise public awareness of cultural issues related to computing and information technologies.<br\/><br\/>The intellectual merit of this project lies with the expertise of the participating computing professionals to contribute to the knowledge and research on cultural diversity in computing. The broader impacts revolve around the potential for the collected group to raise public awareness about cultural diversity and to collectively initiate projects that may broaden the field of computing.","title":"Workshop on Cultural Diversity in Computer and Information Technology","awardID":"0830918","effectiveDate":"2008-04-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["485574","541641","503742"],"PO":["564181"]},"141865":{"abstract":"This award supports participation of doctoral students from U.S. universities in the 12th SIGART\/AAAI Doctoral Consortium to be held July 13-14, 2008 in Chicago, IL in conjunction with the 23rd National Conference on Artificial Intelligence, July 13-17, 2008. The Doctoral Consortium aims to: (1) provide a setting for feedback on participants' current research and guidance on future research directions; (2) develop a supportive community of scholars and a spirit of collaborative research; and (3) support a new generation of researchers. The Doctoral Consortium organizers strive to recruit and include students from underrepresented groups (e.g., women and underrepresented minorities) and smaller schools and schools with less established programs in artificial intelligence. Each student gives a 25-minute presentation to be followed by 20 minutes of discussion; there are one-on-one meeting with a faculty mentor. There will also be opportunities to discuss career issues in both academic and other career pathways. A report on the Consortium will be published in the AI Magazine.","title":"2008 SIGART\/AAAI Doctoral Consortium","awardID":"0823735","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["403473",377576],"PO":["387198"]},"140418":{"abstract":"Institution: Renaissance Computing Institute (RENCI), University of North Carolina at Chapel Hill<br\/>Principal Investigator: Marilyn Lombardi<br\/><br\/>Today's graphical user interfaces continue to rely on WIMP (windows, icons, menus, pointing device) technology first developed in the 1960's. High performance computational science is still commonly performed in batch mode, since today's HPC architectures and software do not support real time interaction between scientists and HPC applications. How can cutting edge 21st century interaction mechanisms enable high performance science and discovery? How can new technology make science come alive for students and the general public? Jointly sponsored by the NSF Office of Cyberinfrastructure (OCI) and the Computing and Information Science and Engineering (CISE) directorate, this two-day, invitation-only workshop will bring together a select group of thought leaders from industry and the academy to develop a guiding vision and a cross-cutting research agenda for human-centered interface and interaction design over the next decade. The workshop represents a critical step in moving beyond independent research projects toward coherent application of national resources in the area of human-centered interface and interaction design. Invitees drawn from computer science, engineering, robotics, artificial intelligence, the cognitive sciences, perceptual psychology, neurobiology, architecture, design, and the interactive arts will work together to address a set of key questions: Where do we want to be by the year 2018? How do we plan on getting there in a scalable and sustainable fashion? What are the major trends in the field? Which forces are driving change? What impedes further progress? What are the technical, social, psychological, and legal issues requiring further study? What are our beliefs about human-computer interaction research and its goals? What are the funding priorities over the coming decade and what are the respective roles of the federal, non-profit, and commercial sectors in shaping the group's vision of a human-centered future? Workshop results will be captured in a workshop report and disseminated to the National Science Foundation and the research community.","title":"NSF Workshop on Human-Computer Interaction for 21st Century Discovery","awardID":"0817173","effectiveDate":"2008-04-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7701","name":"DATA INTEROPERABILITY NETWORKS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[373169],"PO":["565136"]},"142619":{"abstract":"The 2008 IEEE INFOCOM Conference on Computer Communications will be held in Phoenix, Arizona, USA from April 13 to April 19, 2008. This preeminent technical conference is the primary venue for presenting new research results in the area of computer communications, and is widely attended by researchers and practitioners in the field. Attending conferences such as INFOCOM is of great importance for the development of graduate students. Participants have the opportunity to present their work, attend panel and keynote sessions, and interact with hundreds of others performing leading-edge research in the field. This award provides funds to support approximately twenty graduate students in the United States to attend this premiere conference. The travel awards will target graduate students, in particular, women and under-represented minority students, since attending conferences is an important part of their educational experience, and they often have limited travel funds.<br\/><br\/>The intellectual merit of the proposal resides in encouraging and supporting graduate student attendance to INFOCOM 2008, which will continue the tradition of the previous INFOCOM conferences as a premier venue for bringing together academia, industry, and government to share newest developments in communications. Besides technical paper presentations, the conference offers a wide range of technical activities including workshops and tutorials.<br\/><br\/>In terms of its broader impact, this proposal aims at providing graduate students conducting research in the field of communications with the opportunity to attend the INFOCOM 2008, one of the main technical conferences in the field. Attending such high-caliber technical venues is extremely valuable for future researchers. Not only they will be exposed to the state-of-the-art in the field, but also they will have the opportunity to interact with peers from institutions worldwide, meet with leading researchers, and take part in discussions that are likely to shape the future of the field (e.g., in terms of technology, standards, etc).","title":"Student Travel Support for IEEE INFOCOM 2008 Conference","awardID":"0827298","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["564860"],"PO":["565090"]},"140719":{"abstract":"This project supports US student researchers to travel to the Doctoral Consortium and the premier international conference on autonomous agents and multiagent systems. The Seventh International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS 2008) will be held in Estoril, Portugal between May 12 and May 16, 2008. The conference provides these students with a platform to present their research results and allows them to participate in valuable discussions that will likely shape the future of this critically important field. The technical program is complemented with an array of workshops, tutorials and other events, as it has in previous years. The wide variety and significance of the topics typically presented at AAMAS, in both the technical program and the workshop program, provides a great opportunity for students to share, exchange and learn from each others successes and failures. A Doctoral Mentoring Program is available for Ph.D. students in advanced stages of their research. This program will provide an opportunity for students to interact closely with established researchers, to receive feedback on their work and to get advice on managing their careers.","title":"Doctoral Consortium at Seventh International Conference on Autonomous Agents and Multi-Agent Systems","awardID":"0818761","effectiveDate":"2008-04-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[373988],"PO":["387198"]},"135291":{"abstract":"This is an equipment grant to purchase eye-tracking and display technology to support multidisciplinary research on the use of virtual environments as a medium for the study of human behavior. The research program uses an immersive, interactive bicycling simulator to study how child and adult cyclists make decisions about crossing traffic-filled roads, and a large-screen immersive display system to study spatial perception in real and virtual environments. Using the new instrumentation, the project will: 1) Integrate an eye-tracking and head-tracking system with the existing interactive bicycling simulator to conduct studies of visual attention during road crossing, 2) Test how projecting stereo images and a ground surface adds to the realism and effectiveness of a large-screen display system, and 3) Compare a large-screen display system with a head-mounted display system to investigate how display characteristics impact spatial perception.<br\/><br\/>New instrumentation will expand current facilities in four important ways: 1) adding eye tracking to the high fidelity bicycling simulator, 2) upgrading large screen displays with stereo projection, 3) adding a ground display to the bicycling simulator, and 4) acquiring a head-mounted display system. By increasing and testing the realism and effectiveness of different types of immersive, interactive virtual environments, and developing new computational techniques for integrating virtual environment technology with other cutting-edge technologies, research using this infrastructure will advance the development of state-of-the-art virtual environments as laboratories for the study of human behavior.<br\/><br\/>The research made possible by this infrastructure will contribute to both our understanding of the development of perception-action coupling during late childhood and early adolescence and to our understanding of the underlying causes of child bicycling injuries. The results will lay a foundation for future intervention studies designed to reduce car-bicycle collisions. Advances made on this project in simulation technology, in experimental methodology, and in our understanding of distance perception will contribute to the development of virtual environments for use in behavioral research. This research will also have impact on interactive simulation technology for training, teaching, and entertainment purposes. Finally, this project will promote multidisciplinary training by providing collaborative research experience to a diverse group of undergraduate students, graduate students, and postdocs in psychology and computer science.","title":"CRI: IAD - Advancing Virtual Environments as Laboratories for Studying Human Behavior","awardID":"0750677","effectiveDate":"2008-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["543444","543446","543447"],"PO":["564456"]},"142090":{"abstract":"This is funding to support travel by 6 students currently enrolled in PhD programs in the United States to present their accepted papers and posters, and to take part in the Doctoral Consortium, at the upcoming Adaptive Hypermedia Conference, to be held July 28-August 1, 2008 in Hannover, Germany. User interfaces that adapt themselves to individual needs and preferences, or to available user information, are becoming increasingly important, so much so that adaptivity has become a selling point for software products. A system with the ability to construct and consult user models can adapt diverse aspects of its performance to individual users or user groups, thus enhancing its effectiveness, usability and\/or acceptance in a wide variety of situations. This leads to the concept of adaptive hypermedia as providing the underpinning of personalized interfaces that can successfully deal with information overload while improving the quality of information retrieval and filtering, information restructuring and annotation, information visualization, etc. But as Web sites explore ways to personalize, they must also investigate the effect of such algorithms on privacy, efficiency, and our ability to disseminate new information. In addition to the ubiquitous Web applications, educational applications and applications oriented to users with different kinds of disabilities can also benefit from adaptive systems. The International Conferences on Adaptive Hypermedia is the major forum for the scientific exchange and presentation of research in adaptive hypermedia and adaptive Web-based systems, held biannually; AH 2008 will be the 5th event in the series, and represents the marriage of the Adaptive Hypermedia and User Modeling communities, both of which are major sponsors. Active participation of young researchers in the conference is very important, both for the health of the field and for the researchers themselves. The AH 2008 Doctoral Consortium provides a unique opportunity for PhD students partway through their dissertation research to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior people in the field. Experience has shown that most Doctoral Consortium participants at past UM and AH conferences were later able to expand and publish their work originally presented at the Consortium.<br\/><br\/>Broader Impacts: Bringing young and creative researchers to AH 2008 will help advance an important and socially valuable research field. For many graduate students, the cost of attending the conference exceeds their travel budget. Thus, NSF funding will significantly impact the careers of the next generation of researchers, by enabling a number of them to take part in an important event they would otherwise have to miss. Participation will also help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The PI has indicated that she will act to assure participation by members of traditionally under-represented institutions, and will pay close attention to inclusion of minorities and women.","title":"Supporting Students Attending the 2008 Adaptive Hypermedia Doctoral Consortium","awardID":"0824712","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["468587"],"PO":["565227"]},"135393":{"abstract":"This grant will make it possible to establish a laboratory for Web accessibility. This computing research infrastructure will enable research on technologies for processing Web content for multiple user populations, including users with visual disabilities, mobile users, and computer science researchers. In particular, the laboratory will be used to perform research on transaction processing and for extensive evaluation activities. Central to this work is a non-visual Web browser called HearSay, targeted at users with visual disabilities.<br\/><br\/>The broader impacts of the research made possible by this infrastructure include providing greatly improved tools to allow visually impaired people to perform important tasks on the World Wide Web, such as: completing a survey at the social security administration, reserving a book at a university library, online bill paying, and shopping.","title":"CRI: IAD - Web Accessibility Laboratory","awardID":"0751083","effectiveDate":"2008-04-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["518366","518367","369058"],"PO":["564456"]},"136583":{"abstract":"Complex communication for co-located performers within telepresence applications across networks is still impaired compared performers sharing one physical location. This impairment must be significantly reduced to allow the broader community to participate in complex communication scenarios. To achieve this goal, an avatar in the form of a musical conductor with forms of artificial intelligence will coordinate between co-located musicians. Improvised Contemporary Live Music of a larger ensemble, serving as a test bed, is arguably one of the most complex scenarios one could think of, because it requires engaged communication between individuals within a multiple-source sound field that also has to be considered as a whole. The results are expected to inspire solutions for other communication tasks. <br\/><br\/>The avatar system will actively coordinate co-located improvisation ensembles in a creative way. To achieve this goal, Computational Auditory Scene Analysis (CASA) systems, to allow robust feature recognition, and Evolutionary algorithms, for the creative component, will be combined, to form the first model of its kind. The research results are expected to be significant by themselves and are not bound to telematic applications. With regard to the latter, the proposed system will have a clear advantage over a human musician\/conductor, while intelligent algorithms are clearly lacking behind human performance in most other applications, especially when it comes to creativity.","title":"Pilot: A Robust Distributed Intelligent System for Telematic Applications","awardID":"0757454","effectiveDate":"2008-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["443287","550695"],"PO":["424970"]},"134582":{"abstract":"While search engines address the problem of helping people find particular information, they are not directly built to support people developing creative ideas. This research supports people engaged in sustained information discovery tasks, such as invention and thesis development, in which the goal is to create new knowledge by forming ideas while finding and assembling information. New modalities of human computer interaction will be developed to support people engaged in assembling their building blocks of invention, utilizing information semantics, dynamic organization, and visualization. The approach is based on the form of composition, which visually and conceptually integrates elements to represent a collection. The research notebook will support sustained innovation, in which people need to connect and integrate key findings in the collections they create while conducting research and invention over time. Physically-based techniques, such as mass-spring and flocking models, will be applied and extended to facilitate human manipulation of collections as compositions. New modalities of interaction, such as pen-based, will improve sensory feedback and engagement by enabling participants to literally get their hands into digital information. The physically-based techniques and new interaction modalities will be integrated with the combinFormation mixed-initiative composition platform to provide a basis for augmenting the research notebook beyond the desktop metaphor. Our principal hypothesis is that mixed-initiative composition and physically-based multimodal interaction will improve the emergence of new ideas during individual and team-based information discovery tasks. Using the research notebook on assignments by over 1,000 undergraduate students developing new inventions each year in The Design Process course will catalyze innovative education, while also generating evaluation data on information discovery.<br\/><br\/>The proposed research is innovative in its interdisciplinary approach, expected to yield significant outcomes: (1) new techniques for physically-based interaction with information; (2) new multimodal techniques for interaction with information; (3) new integrated semantic, visual, and interactive methods for supporting human discovery of connections among ideas; (4) a research notebook infrastructure for supporting sustained interaction with digital information by students and researchers; (5) new data about how students and researchers develop ideas over time in practice; (6) new understanding of creative processes that make up research and invention; and (7) new methods for supporting research and invention in education. Advanced learning technologies developed by this proposal will be implemented and distributed through the Research Notebook and the combinFormation platform. Software technologies will be made available to the students and the public through the web. A multimodal interaction lab will make integrated software\/hardware systems available to some of the students. The Research Notebook methods, techniques, and cyberinfrastructure can amplify the productivity of scientists. The new interactive techniques for discovery and semantics can transform how students, researchers, knowledge workers, and the public experience the internet and digital repositories. The integration into education of research issues, designs, and implementations, with a learner-centered approach, will contribute to the development of a new generation of creativity-oriented human-centered computing researchers and practitioners.","title":"CAREER: A Multimodal Mixed-Initiative Research Notebook for Information Discovery","awardID":"0747428","effectiveDate":"2008-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["531380"],"PO":["565227"]},"135396":{"abstract":"Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0751091","effectiveDate":"2008-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["557272",359676],"PO":["565272"]},"149268":{"abstract":"This award supports the development of software infrastructure for large scale simulations of gravitational wave sources (numerical relativity) through a collaboration among researchers at Louisiana State University, Pennsylvania State University, and Rochester Institute of Technology. Recent breakthroughs have provided the numerical relativity community with the basic techniques in to evolve binary black holes for multiple orbits, including the merger and final black hole ring-down phases. Information from these computer simulations have the potential both to enhance the likelihood that ground-based and space-based gravitational wave detectors will recognize these gravitational wave signals from these exotic events and to improve the ability to determine the properties of these systems if signals are detected. The infrastructure to be developed, called XiRel, will build upon and integrate several well developed and widely used computational infrastructures and emerging standards, including Cactus and Carpet. The initial and primary focus of this project is the development of a highly scalable, efficient and accurate adaptive mesh refinement layer based on the existing Carpet driver, which will be fully integrated and supported in Cactus and optimized for numerical relativity. This project will be driven by the scientific goal to perform accurate simulations of black hole binaries with larger initial separations than currently possible, with un-equal masses and unequal spins, and providing reliable physical results critical for gravitational wave astronomy and astrophysics. This award is supported by the Division of Physics in the Mathematical and Physical Sciences Directorate and by the Division of Computing and Communication Foundations in the Computer and Information Science and Engineering Directorate.","title":"Collaborative Research: XiRel, a Next Generation Infrastructure for Numerical Relativity","awardID":"0855892","effectiveDate":"2008-04-26","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"7244","name":"COMPUTATIONAL PHYSICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["555235","523449"],"PO":["467733"]},"143130":{"abstract":"This is a workshop meeting of the NSF Future Internet Design (FIND) program that the PI will host and coordinate on April 8-9 in Los Angeles, California. This meeting is a chance to bring both the FIND-funded researchers and externally funded researchers with related projects together. The goals are to learn about each others' work and to develop concepts for large scale network architecture and systems. Large scale network architecture and systems increasingly seems as though it is an emerging field, and the researchers are trying to come to grips with its possibilities for transformative research. <br\/><br\/>Intellectual Merit<br\/><br\/>The primary intellectual merit of the proposal is the provision of the meeting, because the meeting will result in community building for the emerging future internet and large scale network architecture and systems field, and in researcher contribution and understanding for FIND Phase 2. This is a very important contribution that can benefit networking research at large. <br\/><br\/>The FIND programmatic area of the NeTS program requires that PIs attend three FIND meetings per year. This will be the fifth of these meetings, taking place at the midpoint of most of the PIs? three year grants for Phase 1 of the FIND program. The goal of this meeting is a deep discussion of the nature of a second phase of FIND, in which researchers will go from exploring future internet design without constraints or assumptions from the present Internet to researching and designing large scale network architecture and systems using the same degrees of freedom. <br\/><br\/>Broader Impacts<br\/><br\/>The FIND meetings encourage the FIND research community collectively to rise to the challenges of creating new internet architectures for societal demands of the 21st century. Both the FIND-funded and externally funded researchers are actively engaged with broader impacts. Phase 2 of FIND will create larger internet architectures and these will address such pressing demands as 1. security and privacy that work, because trust in the network must underlie so much future development; 2. availability for critical communications, because inexorably critical infrastructures have complex dependencies on our fallible internet systems; and 3. evolvable capabilities that enable economic models and that allow economic growth that the present internet may currently block. There are many areas of potential broader impact of future internet design. The meeting's discussions of Phase 2 and of large scale architecture and systems design will bring the FIND program closer to its realization of broader impacts.","title":"Future Internet Network Design Meeting 2008","awardID":"0830154","effectiveDate":"2008-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["458851"],"PO":["565090"]},"134462":{"abstract":"Title: CAREER: Scale Variability of 3D Geometry for Computer Vision<br\/><br\/>PI: Ko Nishino<br\/>Institution: Drexel University<br\/><br\/>With the advent of active and passive 3D sensing techniques, 3D geometric data now play vital roles in many applications spanning a broad range of disciplines. Yet, little attention has been given to the fact that real-world objects and scenes consist of geometric structures of varying scales. For instance, a human face has a handful of discriminative local surface structures that span a wide range of spatial extents, such as the forehead, chin, nose, eyes, mouth, nostrils, earlobes, wrinkles, and dimples, from large to small scales. The relative sizes and the spatial configuration of these local structures collectively define the characteristic geometry of the face. In turn, if extracted properly, they add significant information for accurately describing the geometry of the object or scene. The goal of this research program is to establish a general theoretical and computational foundation for analyzing and exploiting this hidden dimension of 3D geometry -- the geometric scale variability. At the heart of the research program are the investigation and derivation of a formal scale-space representation of surface geometry, novel local and global geometric representations that faithfully encode the scale variability, and novel computational methods for leveraging the extra scale-related information in a number of important applications. These key componential research thrusts will individually and collectively enable one to unveil and harness the hidden characteristic properties of 3D geometry.<br\/><br\/>This research program also focuses on investigating the use of geometric scale variability in a number of fundamental applications, including 3D matching, registration, and recognition, all of which serve as vital building blocks in many other applications that use 3D geometric data. The research will lead to not only more robust and efficient analysis and processing of 3D geometry, but will also enable novel approaches to handling geometry, for instance stitching together range images just like mosaicing intensity images, and set the foundation for novel use of 3D geometric data, for example, in appearance modeling. Due to the ubiquitous use of geometric data, the results are expected to have a significant impact across a broad range of disciplines, especially in nationally and societally vital domains. For instance, it will enable finer analysis of anomalous geometric structures of human organs, such as those recovered with 3D endoscopy, leading to more accurate medical diagnosis; provide rich discriminative information for sorting and matching a large collection of geometric data as often encountered in digital archaeology; and undoubtedly serve as an integral component of any 3D sensing-based surveillance application for homeland security. The use of geometric scale variability can go far beyond these examples, leading to a new paradigm for exploiting 3D geometric data.<br\/><br\/>URL: http:\/\/www.cs.drexel.edu\/~kon\/gscale\/","title":"CAREER: Scale Variability of 3D Geometry for Computer Vision","awardID":"0746717","effectiveDate":"2008-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563384"],"PO":["564316"]},"134594":{"abstract":"Abstract:<br\/><br\/>Title: CAREER: Learning Models for Object Structure<br\/><br\/>PI: Kobus Barnard<br\/><br\/>Institution: University of Arizona.<br\/><br\/>This project will develop approaches for learning stochastic geometric models for object categories from image data. Good representations of object form that encode the variation in typical categories (e.g. cars) are needed for important problems in computer vision and intelligent systems. One key problem is object recognition at the category level. What makes an object a member of one category (e.g. tables) instead of another (e.g. chairs) strongly relates to its structure, and automatically choosing among them to robustly recognize a new object requires appropriate representations of form. <br\/><br\/>A second problem is reasoning about object configuration and structure. For example, a standard chair should be recognizable as being similar to a table in certain ways, different in other ways, perhaps seen as blocking a particular path in a room, and considered useful as a step for reaching something. To achieve this level of understanding, representations for geometric structure that can link to physics and semantics are needed. But where should they come from? <br\/><br\/>To address this question, this project will explore learning effective representations from image data. More specifically, this project will study the novel approach of putting representation at the core, and learn from data which objects can be modeled in this manner. The work will begin with simple effective representations that are appropriate for some objects, and then expand the pool of models, largely by exploiting the fact that many complex objects are composed of simpler, natural, substructures, and that these are shared across multiple object categories. One result of this process will be statistical models for objects based on image data that will be disseminated to the research community.<br\/><br\/>This research will have positive impact on many applications that rely on robust recognition and scene understanding from image data, particularly in cases where the configuration, orientation, and form of objects are relevant. <br\/><br\/>These include applications where robots must function in natural environments and systems for augmenting human operators in numerous industrial, military, and everyday situations. <br\/><br\/>The learned object category representations will have additional uses in image and video retrieval and for model palettes in computer graphics applications. This research will also impact biomedical research by improving automated extraction of biological structure from image data to recognize phenotypes and to quantify the relation of form and function in high throughput experiments.<br\/><br\/>This project integrates two important educational initiatives: 1) curriculum development to increase opportunities for classroom study in computer vision, machine learning, and scientific applications at the University of Arizona; and 2) an educational outreach program targeted at Tucson high-school students from low socioeconomic groups that will promote an understanding of the integration of science and computation.<br\/><br\/>Project URL: http:\/\/vision.cs.arizona.edu\/kobus\/CAREER","title":"CAREER: Learning models for object structure","awardID":"0747511","effectiveDate":"2008-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["552110"],"PO":["564316"]},"135342":{"abstract":"Abstract <br\/>Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0750860","effectiveDate":"2008-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["556800"],"PO":["565272"]},"134495":{"abstract":"Today's world requires that we participate in, comprehend, or otherwise navigate many kinds of networks, including social networks, communication networks, financial transaction networks, gene regulatory networks, disease transmission networks, ecological food networks, sensor networks and more. Observational data on such networks is plentiful, but extracting the relevant data is challenging. Furthermore, this data often has errors, is incomplete and fragmented, or otherwise does not offer a concise and big-picture view of the network that we want to understand and use. <br\/><br\/>This research project will develop methods for inferring and representing the essential, underlying network structure that best accounts for observed entities and interactions between these entities. In particular, the proposal introduces a process abstraction called ?graph identification,? which is composed of more basic processes for identifying observed entities that are equivalent, identifying links (i.e., relationships) between entities from observed interactions, and simultaneously classifying many entities into classes based on their interconnection structure. <br\/><br\/>A computational challenge of this project is integrating these basic processes, each of which has been studied by the PI and others, to achieve accurate solutions to the overall graph identification problem, in a manner that is efficient and scalable. <br\/><br\/>This research has broader impacts for basic science, national security and a better understanding of privacy issues in today's networked society.","title":"CAREER: Graph Identification","awardID":"0746930","effectiveDate":"2008-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["518332"],"PO":["491702"]},"135343":{"abstract":"Researchers at eight U.S. universities are collaborating in the development of Archer, a community-based computing infrastructure for computer architecture research and education. Archer addresses, in an integrated manner, computer architecture researchers' broad need to access powerful computational resources and share simulation environments. The project achieves this objective by deploying a large-scale, flexible, and easy-to-use computing infrastructure which adds users' local computing resources to Archer-dedicated resources as users join the network, thereby increasing Archer's computing power as more users join. In addition, the Archer project comprehends a repository where users can share tools and simulation environments they've created, adding another incentive for users to join the Archer community, facilitating collaboration among research groups, and advancing the field of computer architecture. <br\/><br\/>The core hardware of Archer consists of computer clusters to be deployed at Cornell University, Florida State U., Northeastern U., Northwestern U., U. FLorida, U. Minnesota, and U. Texas at Austin. The hardware infrastructure provides hundreds of processors to support the demanding simulation workloads required by computer architecture research in areas including soft-error modeling, statistically-based design exploration, and chip-multiprocessor micro-architectures. The key software technologies enabling community resources to be aggregated in a secure, scalable and seamless manner are resource virtualization and robust batch job scheduling, which include the IPOP virtual network from U. Florida and the Condor middleware from U. Wisconsin. <br\/><br\/>The Archer community resource will enable advances in computer architecture by allowing researchers, particularly those in institutions not equipped with local resources for high-throughput computing, to run large-scale simulation experiments. Its technology provides a new way to swiftly create ad-hoc shared \"Grid\" computing pools within or across institutions, which will pave the way to the creation of similar cyberinfrastructures for other communities.","title":"CRI: CRD Collaborative Research: Archer - Seeding a Community-based Computing Infrastructure for Computer Architecture Research and Education","awardID":"0750868","effectiveDate":"2008-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["528635"],"PO":["565272"]}}