{"80538":{"abstract":"","title":"RUI: Computing With Diagrams","awardID":"0296129","effectiveDate":"2001-06-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["529182"],"PO":["564456"]},"59070":{"abstract":"EIA 0097464<br\/>Dershem, Herbert<br\/>Hope College<br\/><br\/>REU Sites: An Undergraduate Research Participation Program in Computer Science<br\/><br\/> The Hope College REU program in Computer Science is designed to provide promising undergraduates with an intensive and meaningful research experience that will encourage them to consider a career in computer science research. Our goal is to expose students to the techniques, attitudes, and rewards of computer science research and to provide encouragement and direction in the pursuit of such a career through close collaboration with a faculty mentor on a significant project. We will make extensive efforts to include qualified female and minority group students among the participants. Each year a partner undergraduate institution will be selected where there is presently insufficient infrastructure for a strong undergraduate research program in computer science. One faculty member from the partner institution will be invited to participate in this program, joining three or four Hope College faculty members as research mentors. In addition, two students from the partner institution will join three Hope College students and three students from other institutions as student participants. The student participants will reside on the Hope College campus, spending a minimum of 40 hours per week on research activities for a 10 week period. Each participant will work in close collaboration with a faculty mentor and be given exclusive use of a workstation on the Hope College Computer Science network. The development of communication skills will be emphasized by having participants present their results during summer seminars, at their home institution during the following academic year, and at a regional or national conference. In addition, the participants will prepare a research report and an online poster describing their work.","title":"REU Sites: An Undergraduate Research Participation Program in Computer Science","awardID":"0097464","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["503906"],"PO":["564181"]},"60829":{"abstract":"This proposal addresses one simple question: how can we develop effective multi-agent systems out of the exception-prone (buggy, malicious, or simply \"dumb\") agents and infrastructures we can expect to encounter in open system contexts? This problem will be addressed by developing technologies that can determine, at run time, what exceptions can occur, as well as what exception detection and resolution strategies are appropriate, for a dynamically changing agent population and system environment. This work<br\/>will build on two key ideas: (1) it is possible to identify highly reusable domain-independent exception handling expertise, and (2) this expertise can be instantiated in the form of distinct exception handling services that outsource exception handling from the agents, requiring only that they adhere to some relatively simple guidelines. The potential impact of this work will include (1) enabling the creation of multi-agent systems that can function effectively in open contexts, while (2) reducing the burden on agent developers by obviating the need to create agents with sophisticated exception handling capabilities.","title":"Towards Robust Open Multi-Agent Systems: Domain-Independent Exception Handling Services","awardID":"0103820","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["427334"],"PO":["564456"]},"59071":{"abstract":"This is a standard award. Automated systems that interact with human users in spoken and written communication will greatly enhance productivity and program usability. These systems will allow friendly access to information services and are essential for people with disabilities, or for accessing databases while performing intricate tasks. Unfortunately, current technology is inadequate for the tasks at hand, and there is a need to make progress. The number of available personnel trained in the field must be vastly increased and solutions to long standing problems must be found. At this time, relatively few universities educate students capable of performing the required tasks. Leading professionals are scattered in various industrial, academic, and governmental institutions, often duplicating each other's work. This award will allow a summer workshop on language engineering to be conducted where mixed teams of leading professionals and students can cooperate to advance the state of the art. The professionals will normally be university professors and industrial and government researchers working in widely dispersed locations. Graduate and undergraduate students will join these teams. The participation of undergraduate students is intended not only as an educational opportunity, but also to broaden the appeal of the language engineering field amongst students considering graduate studies.","title":"2001 Language Engineering Workshop for Students and Professionals: Integrating Research and Education (WS01)","awardID":"0097467","effectiveDate":"2001-06-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X803","name":"DARPA-JHU SUMMER WORKSHOP"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X867","name":"ARPA-JHU SUMMER WORKSHOP"}}],"PIcoPI":["445172","445173","168075"],"PO":["565227"]},"59161":{"abstract":"This is a three year standard award. Visual servoing, the use of visual feedback in the control of a robot end-effector, can provide a superior robot interface than those offered by teach pendants or tele-operated systems. Visual servoing is advantageous when precise fixturing is impractical or impossible. In image based servoing, control is effected in the image. This method has the advantages that one does not have to reconstruct 3D information about the robot's environment, and that control laws exist that are not overly sensitive to camera calibration errors. However, there are problems with image based servoing that need to be overcome in order to develop robust, stable systems. This project will address two issues impeding the application of image-based servoing. First, image feature-point path planning methods will be developed and demonstrated. Previous research efforts have focused on the form, and possible decompositions, of the \"Image Jacobian\", relating manipulator velocities to image motion. In contrast, this project will develop methods to determining a path within the image to use as input to a \"standard\" image-based regulator. The PI's approach will both improve controller performance and also ensure the image features remain within the field of view during the manipulation task. Second, a parameterized direct image-to-actuator model will be analyzed, evaluated, tested, and compared with classical approaches. The error signal from the image together with the image Jacobian typically map to end-effector velocities which then must be converted to actuator velocities using the robot kinematic model. A controller that converts image displacements directly to actuator commands would eliminate the intermediate step thus enhancing system performance, both in terms of speed and accuracy. Addressing issues of robustness and sensitivity will facilitate application of these techniques outside of the laboratory. Success of this project will facilitate the acceptance of image based servo techniques as a viable control method in production operations. The key scientific contributions created by this effort will include advances in the design of image based visual servo controllers through (1) the introduction of superior robot motion command generation created through image path planning and (2) the introduction of a parameterized direct image Jacobian with appropriate understanding of the model's limitations.","title":"Generating Image Trajectories and Direct Image Jacobians for Visual Servoing","awardID":"0097717","effectiveDate":"2001-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["555023"],"PO":["335186"]},"59282":{"abstract":"Two software systems, SATO (SAtisfiability Test Optimized) and SEM (a System for Enumerating Models), developed with the NSF support, have been widely and successfully used for solving many problems often considered a challenge for automated reasoning systems. SATO and SEM were used to solve over a hundred cases of of previously open problems in algebras and logics. The proposed research will further increase the reasoning power of SATO and SEM. A new experimental software system called HOTTER (a Humble OTTER) will be fine-tuned for the high-performance first-order satisfiability testing. The main objective of this research is to develop high performance model generation techniques. These software systems will be serve as an environment for experimenting and developing these techniques, and will be available to the public. Many computational problems from a variety of fields, i.e., software and hardware verification, circuit design verification, scheduling and planning, can be reformulated as a model generation problems. Instead of creating special-purpose software for these problems, an alternative and competitive approach is to write the problems in a model-generation language and then submit the problems to a model generator optimized to this language. Another objective of this research is to support this approach by designing a general-purpose language for model generation, and implementing it with SATO, SEM, and HOTTER as its components. The language will provide an easy-to-use model generator for people in various fields.","title":"High Performance Model Construction","awardID":"0098093","effectiveDate":"2001-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["292881"],"PO":["321058"]},"59350":{"abstract":"This research involves the study algorithmic problems that arise in<br\/>the design of next generation networking technology.<br\/>Rapid growth of the internet user base, coupled with rapid parallel<br\/>growth in mobile subscriber numbers, is creating powerful pent-up demand<br\/>for wireless access to the internet\/intranets and other data networks.<br\/>Communication in wireless networks differs in some fundamental <br\/>ways from communication in wired networks. In particular, the basic<br\/>form of communication in wireless networks is broadcasting,<br\/>as opposed to point-to-point communications in most wired<br\/>networks. This research investigates the effect of switching to <br\/>broadcast communication on server strategies<br\/>in the client-server computing model, one of the most common <br\/>computing paradigms.<br\/><br\/><br\/><br\/>A wide range of real-time applications, such as multimedia conferencing, <br\/>computer supported cooperated workspaces, remote medical diagnosis etc., <br\/>has become very popular in recent years. These applications have <br\/>dynamically changing bandwidth requirements. <br\/>It is clear that controlling and allocating<br\/>bandwidth for individual users and web browsers is becoming very <br\/>important for bursty traffic flows utilizing highly constrained<br\/>communications channels.<br\/>From the network management's perspective, it is advantageous to <br\/>allow the network to dynamically <br\/>change the tariff parameters of the charging scheme in response to demand. <br\/>This research investigates dynamic renegotiation and<br\/>pricing problems that arise in the design of networks<br\/>that give quality of service guarantees.","title":"Collaborative Research: Algorithmic Problems in Next Generation Networks","awardID":"0098271","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565251"],"PO":["279077"]},"59076":{"abstract":"This is the first year funding of a three year continuing award. This project concerns a new approach to evolutionary computation, called Learnable Evolution Model (LEM), which draws inspiration from \"intellectual evolution\" - an evolution of human ideas, designs, artifacts, organizations, etc. Unlike conventional Darwinian-type evolutionary algorithms, in which new candidate solutions are created by semi-random mutations and\/or recombinations, LEM generates new solutions by hypothesis formation (via machine learning) and hypothesis instantiation (via deduction). Pilot studies have shown that LEM can accelerate evolutionary processes by two or more orders of magnitude over Darwininan-type algorithms (in terms of the number of births or fitness evaluations), and thus appears to be particularly advantageous in application domains in which fitness evaluations are time-consuming and\/or costly, such as engineering optimization problems, evolutionary design, fluid dynamics, drug development, evolvable hardware, geological inversion, etc. This research will explore LEM's capabilities, limitations, and scalability to complex optimization and engineering design tasks. The PI will develop extensions of the initial methodology, and will experimentally test LEM in selected real-world problem domains.","title":"Non-Darwinian Evolutionary Computation: Guiding Evolution by Machine Learning","awardID":"0097476","effectiveDate":"2001-06-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["355581"],"PO":["387198"]},"59330":{"abstract":"Wireless communication systems must inevitably deal with the <br\/>severe effects of fading, the phenomenon whereby received signals fluctuate <br\/>over very wide ranges as the propagation environment changes in time. <br\/>Various forms of diversity are commonly employed to combat the effects <br\/>of fading. In various scenarios, it is possible to achieve diversity by <br\/>transmitting a signal that is redundant in time or frequency, by using <br\/>multiple transmit antennas and\/or multiple receive antennas. While techniques<br\/>for achieving time diversity, frequency diversity, and space diversity <br\/>through multiple receive antennas are well known, developing techniques<br\/>for achieving diversity through the use of multiple transmit antennas is<br\/>a relatively new area which is currently of great practical and theoretical <br\/>interest. This research involves the design of improved modulation and coding<br\/>techniques for the so-called space-time systems, i.e., those with multiple <br\/>transmit antennas. One main goal of this project is to maximize improvement <br\/>in what is in some sense the worst case scenario where the number of receive <br\/>antennas is either one or a very small number and also where the channel is<br\/>fading in a very slow (i.e., quasi-static) manner. In this environment, <br\/>transmitter diversity and possibly frequency selectivity may be the only <br\/>sources of potential diversity.<br\/><br\/>This research studies the potential of improving on existing techniques<br\/>by overcoming two flaws that plague many existing or proposed space-time <br\/>systems: 1) Space time codes have difficulty providing both diversity and <br\/>significant coding gain, Many space-time codes must use up all their redundancy <br\/>to provide diversity and actually provide little or no coding gain. By <br\/>splitting the jobs of providing diversity and coding gain between either two <br\/>separate codes or between the coding and modulation formats, this research <br\/>produces a more effective space-time communication system. 2) Space time codes <br\/>which promise significant coding gain often do not produce it in a quasi-static <br\/>fading channel (QSFC). The currently accepted design rules for space-time <br\/>codes are in fact shaky when applied to a QSFC. By forming a more solid <br\/>foundation for designing codes for QSFCs, this research produces better design <br\/>criteria and ultimately better space-time coding techniques.","title":"Coding and Modulation for Space-Time Systems","awardID":"0098209","effectiveDate":"2001-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["564558"],"PO":["223414"]},"59352":{"abstract":"This project investigates novel self-encoded multiple access (SEMA) communications for the transmission of digital information in multiuser wireless channels. The approach is based on the unconventional self-encoded spread spectrum technique that has been developed at the University of Nebraska for the modulation and detection of spread spectrum signals. The application of self-encoded spread spectrum to multiple access communications entails a number of considerations in system and coding designs. They arise from the fact that self-encoding does not guarantee pair-wise code isolations between the spreading sequences. Multiuser channel coding can mitigate code collisions and improve the system performance. The research will characterize the system performance under various wireless channel disturbances such as noise, interference and fading. The results from this project demonstrate the feasibility of SEMA communications that will have a developmental impact on mobile communications technology.<br\/><br\/>The focus of this project is the analysis and applications of code-modulated SEMA communications. An analytical model of the system is developed that incorporates multiuser channel coding to control statistical code collisions between the self-encoding sequences. Cooperative channel coding among the users is exploited to determine the balanced trade-offs between signal despreading, capacity (code rate) and error correction capability. The bit-error-rate and capacity of the system are analyzed under various channel conditions. The research includes investigating the use of training sequences and preambles for synchronization acquisition and tracking of self-encoded signals. The development of SEMA multiuser detectors is of particular interest given the fact that the spreading sequences are random, time varying, and not known a priori. SEMA turbo receiver that employs iterative, joint multiuser detector and channel decoding is also studied. The goal of the research is to develop the theoretical foundation for self-encoded multiple access communications, with the potential applications spanning from terrestrial wireless to satellite and optical fiber communications systems.","title":"Code Modulated Self-Encoded Multiple Access Communications","awardID":"0098273","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[152439,152440],"PO":["348215"]},"58274":{"abstract":"Many multivariate problems of practical interests are intractable in the worst case setting. Such intractability could be removed by either identifying new properties (i.e., classes) that allow for efficient algorithms or by switching to the average (or probabilistic) settings. This is often referred to as breaking intractability. A substantial part of the proposed research will deal with breaking intractability of a number of important problems. This will lead to deeper knowledge of the complexities of multivariate problems and will result in new efficient algorithms for a host of important problems. <br\/><br\/>Related to the average case study are path integrals. The research will be a continuation of a recently initiated study on the complexity of path integration and will provide additional complexity bounds and new efficient algorithms. <br\/><br\/>A number of important problems deal with classes of functions of unbounded domains. However, there are but few corresponding complexity results and, in practice, commonly used algorithms are ad hoc and are not optimal. Significant part of the proposed research will deal with problems defined for classes of functions with unbounded domains; both the worst case and the average case settings will be studied. This will enrich understanding of the complexity of such problems and will provide new algorithms that are optimal (or almost optimal). <br\/><br\/>The theoretical work will yield new and efficient algorithms for a host of important problems. These algorithms will be developed and thoroughly tested. Graduate students will be involved in both theoretical and development phases of the research.","title":"Information-Based Complexity of Multivariate Problems","awardID":"0095709","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["306203"],"PO":["321058"]},"59298":{"abstract":"The project studies typed heterogeneous meta-programming systems where the meta-language and the object-language are different languages, with different type systems. The objective of the project is to design and implement a system with a fixed meta-language, in which it is possible to build different systems with different object-languages, or one system with multiple object-languages.<br\/><br\/>The project studies how to integrate the multiple type systems that must coexist in a heterogeneous meta programming system. The type system of the meta-language must be extensible, in a manner that makes it possible to incorporate the type systems of arbitrary object languages. The goal is to produce a system where type correct meta-programs produce only type-correct object-programs. Ideas from extensible kinds, higher-order abstract syntax, intensional analysis of code, indexed-types, and the use of constrained type systems will be investigated as mechanisms to accomplish these goals.","title":"Heterogeneous Meta Programming Systems","awardID":"0098126","effectiveDate":"2001-06-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["551061"],"PO":["564388"]},"59199":{"abstract":"EIA-0097858<br\/>Frincke, Deborah<br\/>University of Idaho<br\/><br\/>REU SITES: Developing Undergraduate Research in Computer Network-Based Intruision Detection and Information System Protection<br\/><br\/>The need for technologically literate workers has reached a critical level. The US Department of commerce predicts that by 2006, the United States will need more than 1.3 million new technology workers. Further, there is a growing consensus that the lack of trained information security an information assurance personnel has reached or soon will reach crisis proportions. This REU is intended to address the shortage of information assurance researchers by providing opportunities for undergraduates to participate in ongoing research projects under the auspices of the CSDS. The Center for Secure and Dependable Software (CSDS) at the University of Idaho (UI) was formed in 1998 as an Idaho Center to better organize and promote information security education and research. The CSDS\/University of Idaho was named as one of the first seven Centers of Excellence in Information Assurance Education, and is therefore uniquely suited to lead this initiative.<br\/><br\/> Our specific objectives are to include 14 undergraduate REU participants yearly (42 total) in a program, which is intended:<br\/><br\/>1. To address the national need for researchers and \"thinkers\" with competencies in critical infrastructure protection by involving undergraduates in this area of research.<br\/>2. To provide an \"learn by doing\" environment in which motivated undergraduates learn how to take charge of their research in a disciplined and creative manner, and to lead others in such endeavors.<br\/>3. To offer a unique research experiences to people who would not otherwise have such opportunities.<br\/>4. To stimulate undergraduates to pursue graduate education or research careers in information assurance.<br\/>5. To attract a diverse student population to this field of study.<br\/>6. To provoke discussion and consideration of the vast array of ethical issues involved in computer security and privacy research and practice, both for the REU participants and later at her REU participants' home site.<br\/><br\/>Key components of our program include: a faculty with considerable experience in working with undergraduates in a research environment; immediate integration of students in existing research programs in information assurance, drawn from the PI and senior investigator's currently funded research: an emphasis on critical thinking, leadership, presentation, and publication skills; the Expanding Horizons seminars, which bring students into direct contact with highly regarded members of the information assurance field, with practitioners, and with those involved in setting national policy in this area; also an optional ethics component in the form of an integrated sequence of lectures and discussion sections to be led by senior investigators with considerable expertise in this area. A service aspect is also included, where students lead a project of their choice to solve specific real problems in information assurance.<br\/><br\/>The program is geared towards students who would not normally have an opportunity to work in research or in this area. Recruitment will emphasize diversity, both to enrich the student experience and to bring underrepresented groups in the national security\/privacy\/information assurance policy and technology debates. Ongoing assessment is emphasized in terms both of examining how student capabilities change through their participation in this program as well as in tracking student career choices after the program ends.","title":"REU Site: Developing Undergraduate Research in Computer Network-Based Intrusion Detection and Information System Protection","awardID":"0097858","effectiveDate":"2001-06-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["162171","522597"],"PO":["564181"]},"59354":{"abstract":"The advance of high-speed deep-submicron VLSI technology requires chip<br\/>interconnect and packaging to be modeled by distributed circuits. Such a<br\/>detailed modeling level eventually results in large scale linear circuits to<br\/>be analyzed. Thus, the research objective is to develop new circuit order<br\/>reduction approach to evaluate the circuit performance and characteristics<br\/>in a reasonable time period and with a guaranteed performance, as required<br\/>by real design practice.<br\/><br\/>This project focuses on the following tasks:<br\/>a) Develop new order reduction approaches that provide guaranteed performance;<br\/>b) Derive correspondingly high efficiency numerical methods;<br\/>c) Investigate the methods of maintaining preferred characteristics in the<br\/>reduced order system as well as related implementation issues;<br\/>d) Investigate wavelet method application in model order reduction and<br\/>analysis; and<br\/>e) Contribute to graduate education at UT- Dallas and UNC-Charlotte.<br\/><br\/>The expected research results will provide efficient and performance<br\/>guaranteed methods for order reduction and analysis of VLSI interconnect<br\/>circuits, and their corresponding algorithms and software for simulation<br\/>test. It will also contribute to engineering and science aspects by the<br\/>expected research results and software, as well as to graduate education.","title":"Efficient and Performance Guaranteed Methods for Order Reduction and Analysis of VLSI Interconnect Circuits","awardID":"0098275","effectiveDate":"2001-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485314"],"PO":["562984"]},"59134":{"abstract":"EIA-0097625<br\/>Heisterkamp, Douglas R<br\/>Oklahoma State University<br\/><br\/>REU Sites: REU Site in Computer Graphics, Vision, and Content Based Image Retrieval at Oklahoma State University<br\/><br\/>This is a three year proposal for an Research Experiences for Undergraduates (REU) Site at Oklahoma State University in the interrelated fields of 3D computer graphics, 3D computer vision, and content based image retrieval. The objective is to provide a hands on research experience for under-represented minority students from institutions without graduate programs.<br\/><br\/>The aspects of the program are as follows. Ten students will be recruited each year. The target population will be under-represented minority groups. Students will be recruited from institutions without graduate programs. The REU program will be divided into three phases. The first phase, an introduction to research methodology and content background, and the second phase, the actual research project, will occur during an eight week summer program at Oklahoma State University. The third phase involving a paper and presentation will occur at the student's home university.<br\/><br\/>Institution support from Oklahoma State University for the program is strong. The previously funded REU programs conducted by the computer science department have been a great success. This proposed program w ill continue with and build upon the efforts of the department's past REU site programs. <br\/><br\/>The lasting impact of the program will be in its effect on the participating students. We want to use the concrete feedback available in the visual information processing field to improve the students awareness of their knowledge and capabilities, to increase their expectations of what they can do, and to motivate them to actively contribute to the computer science discipline throughout their career. Throughout the program, we will provide information and encouragement to the students on continuing with a graduate education.","title":"REU Sites in Computer Graphics, Vision, and Content Based Image Retrieval at Oklahoma State University","awardID":"0097625","effectiveDate":"2001-06-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["176134"],"PO":["564181"]},"59255":{"abstract":"Over the past decade, iterative decoding methods have received a great deal of interest due to the astonishing error performances achieved first by turbo codes, and more recently by low-density parity check (LDPC) codes. However, since the vast majority of these results have been either theoretically derived for, or achieved by computer simulations of very long codes, several<br\/>issues remain problematic in the implementation of LDPC codes.<br\/><br\/>This research addresses some of these problems and can be divided into three major areas:<br\/><br\/>(1) Algebraic construction of LDPC codes:<br\/>This research investigates the construction of LDPC codes based on algebra and finite geometries. These constructions are motivated by the possibility of describing families of codes in a very specific and unambiguous way, which is impossible for codes generated with the aid of a computer. Furthermore, tight bounds if not exact values of important parameters such as the code minimum Hamming distance can be determined. This feature remains interesting to evaluate the error performance of applications requiring very small bit error rates such as storage systems. In addition, the algebraic structure of the codes constructed can be exploited to perform simple encoding or decoding, such as encoding of cyclic or quasi-cyclic codes based on linear feedback shift registers.<br\/><br\/>(2) Near-optimum reduced-latency iterative decoding of short to medium length LDPC codes:<br\/>Although very impressive results have been derived and achieved with long LDPC codes,<br\/>codes of shorter lengths are more likely to be used in practical applications such as wireless communication systems. For codes of medium length, iterative decoding alone requires a lot of iterations and falls significantly short of the optimum error performance. The investigators devise new decoding methods which, combined with iterative decoding, both reduce the number of<br\/>required iterations and improve the error performance of current approaches.<br\/><br\/>(3) Simplification of iterative decoding methods:<br\/><br\/>The best iterative decoding methods for LDPC codes depend on the operating signal-to-noise ratio and are subject to numerical problems inherent to the evaluation of probabilities or log-likelihood ratios. The investigators study new decoding methods which become universal and are<br\/>much less sensitive to numerical problems while maintaining near-optimum error performance. Such properties are important for implementing these promising new decoding approaches in commercial products.","title":"Iterative Decoding Techniques and their Applications","awardID":"0098029","effectiveDate":"2001-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["328464"],"PO":["348215"]},"57572":{"abstract":"This is a computer graphics project that will research the interactive rendering of large-scale geometric datasets. This is an increasingly crucial problem because model sizes grow faster than the hardware speeds up. Specifically, this project will study:<br\/><br\/>- perceptually-based simulation,<br\/><br\/>- out-of-core and distributed simplification, and<br\/><br\/>- dynamic simplication.<br\/><br\/>The material will also be used to design and teach computer graphics courses, in order to foster student talent and interest.","title":"CAREER: Techniques for Very Large-Scale Interactive Rendering","awardID":"0092973","effectiveDate":"2001-06-01","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["451003"],"PO":["532791"]},"57221":{"abstract":"EIA-0091494<br\/>Ohio State University<br\/>Rongxing Li<br\/><br\/>TITLE: Digital Government: Digitalization of Coastal Management and Decision-Making Supported by Multi-dimensional Geospatial Information and Analysis<br\/><br\/>With the continuing trend of increasing population and economic activities in the coastal zone, a sustainable coastal environment is crucial to the well being of human, wildlife, and properties in the zone. Recently, the coastal zone has been directly or indirectly affected by a series of problems such as global warming, climate change, seal level raising, coastal erosion, environmental contamination, and overpopulation. Coastal management and decision-making involve extremely comprehensive and critical operations across multiple governmental organizations, where the above problems and impacts have to be dealt with. Geospatial information and analysis can be used to coordinate and support multi-agency operations include a) federal government: coastal erosion monitoring, coastal resource management, coastal forecasting, coastal development permission, and residential erosion awareness and watching system. The goal of this research is to investigate and develop technologies that will greatly enhance operation capabilities of federal, state, and local government agencies for coastal management and decision-making using multiple spaceborne, airborne, and in situ remotely-sensed measurements, spatio-temporal databases, and geospatial analysis tools.<br\/><br\/>The objectives of this research project are:<br\/>a) develop a strategy and technologies for utilizing geospatial information of all level of government agencies in coastal management and decision-making.<br\/>b) develop and integrate technologies of space- and airborne and insitu spatial data acquisition, spatio-temporal data modeling and analysis, hydrological modeling and forecasting, and web-based information systems for digital government operations,<br\/>c) develop and test an integrated coastal management and decision-making system that incorporates the spatial analysis and hydrological modeling technologies that will examine historical coastal environment and future changes based on desired or proposed scenarios,<br\/>d) test and implement the above strategy and the system to demonstrate the significantly improved interagency operations of coastal decision-making through a pilot project in the primary site in Lake Erie area and another test site in the Tampa Bay area, and<br\/>e) disseminate coastal geospatial data and coastal erosion information to end users including coastal residents in erosion areas and to assist them in making their decisions such as property protection measures, property purchasing\/selling, and small community planning activities.<br\/><br\/>If successfully implemented, this project will significantly enhance our capability of handling spatio-temporal coastal databases, build a fundamental basis of coastal geospatial information for inter-governmental agency operations, and provide innovative tools for all levels of governmental agencies to improve efficiency and reduce operational costs.","title":"Digital Goverment: Digitalization of Coastal Management and Decision Making Supported by Multi-dimensional Geospatial Information and Analysis","awardID":"0091494","effectiveDate":"2001-06-15","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":["311348","559849",147217,"518277","311350"],"PO":["371077"]},"59366":{"abstract":"Our ability to build complex software systems relies on composition techniques that enable complete programs to be constructed from smaller pieces. A particular decomposition imposes a structure that makes it possible to manage the complexity of a large system. But the same decomposition can also make it harder to add or change features that cut across the structure. The thesis of this project is that the design, evolution, and comprehension of software can be better supported by tools that allow programmers to examine and work with multiple perspectives of a system. In particular, such tools empower programmers to think of programs, not as linear texts, but as equivalence classes of concrete views, each of which might be appropriate for different tasks.<br\/><br\/>The project develops both foundational results and practical tools for representing and manipulating software. Firm semantic foundations are provided by a new algebraic framework for reasoning about the construction of complex software systems. Practical experience is obtained by developing and experimenting with an interactive browser and editor based on the same algebra. This tool will allow programmers to explore and modify a software system from multiple perspectives, some user-defined, and some automatically generated.","title":"Perspectives on Software","awardID":"0098323","effectiveDate":"2001-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["284472","485861"],"PO":["564388"]},"59103":{"abstract":"This is the first year funding of a three year continuing award. The PI will build a knowledge-based system capable of carrying out commonsense reasoning in the domain of rigid solid objects. For example, such a system would be able to reason that a table with one leg shorter than the others will wobble, or that a door locked with a dead-bolt can be opened from the side with the bolt, but not from the opposite side. The design of such a system will involve a variety of different issue that have not received much attention in previous work on automated physical reasoning, including: reasoning about gross behavior over extended periods of time, while ignoring differential behavior over local time; reasoning using the kinds of partial spatial information that is relevant in this domain; the use of rough estimates of likelihood and of comparative likelihoods; reasoning about collections of an indeterminate number of objects; and integrating reasoning using rules of varying degrees of specificity and certainty. The success of the system will be evaluated using a hand-crafted corpus of some hundreds of examples. The study of these inferences and the development of this system will yield important insights, not only into the epistemic and computational structure of this important domain, but also into issues of more general interest in the construction, extension, and evaluation of large knowledge-based systems for semantically rich domains.","title":"Qualitative Reasoning about Loosely Constrained Systems of Solid Objects","awardID":"0097537","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["289878"],"PO":["491702"]},"59169":{"abstract":"EIA -0097738<br\/>Shah, Mubarak<br\/>Niels J da Vitoria Lobo<br\/><br\/>REU Sites: Research Experience for Undergraduates in Computer Vision<br\/><br\/> This project represents a continuation of a Research Experience for Undergraduates site<br\/>which has operated successfully for the past {\\bf thirteen} years. Approximately {\\bf one hundred thirty} undergraduate students from several institutions in Florida and outside Florida have participated in this<br\/>program. The key distinctive elements of our approach are (1) to have a full calendar year experience planned for the participants, so that they have time to follow a substantial project through to completion, (2) to present each participant with several possible project topics, so that they can feel they have chosen a project which is most interesting to them, (3) to immerse the participants in the general research environment<br\/>essentially as if they were graduate students, by having them meet with their faculty advisor once each week<br\/>to discuss their project, participate in the weekly research group meetings, attend research presentations and meet with visiting researchers, and (4) to follow through over the year by working with the students<br\/>to write a technical report on their project, to prepare for the GREs and to apply to graduate programs.<br\/>In past years, a large fraction of our REU participants have been able to prepare a paper for submission to a conference, have the paper accepted and then attend the conference to present the paper. Several past participants have even accomplished substantial enough research to also result in journal publications.<br\/>Many of our past participants are now pursuing graduate studies at various institutions, and some are now occupying faculty positions.","title":"REU Sites - Research Experience for Undergraduates in Computer Vision","awardID":"0097738","effectiveDate":"2001-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["505885","505886"],"PO":["564181"]},"59368":{"abstract":"A new approach to software testing called \"observation-based testing\" is investigated. Observation-based testing is intended to reduce the cost of testing by minimizing the number of test cases that must be evaluated manually for conformance to requirements. It calls for profiling the executions induced by a set of potential test cases and then filtering the executions based on their profiles to identify a subset that warrants manual evaluation. The executions are filtered using multivariate analysis techniques. The subset of execution that is selected for evaluation is one whose profiles suggest is more likely to contain failures than are other subsets. In order to provide a methodology and set of tools for observation-based testing, alternative forms of execution are evaluated to determine which are most effective for identifying conditions associated with program failure; alternative procedures for filtering executions are evaluated to determine which are most effective for identifying failures among a set of executions; and alternative observation-based techniques for estimating software reliability are evaluated with respect to their efficiency. In conjunction with such methodological research, a prototype suite of tools is being developed to support observation-based testing.","title":"Observation-Based Software Testing","awardID":"0098325","effectiveDate":"2001-06-01","expirationDate":"2004-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["460483"],"PO":["564388"]},"57663":{"abstract":"Next generation computer systems will be characterized by pervasive<br\/>networked devices interconnected by a variety of networks and organized in<br\/>loose and dynamically changing confederations. This research addresses the<br\/>question of how to program these new computer systems. In particular,<br\/>foundations and implementation techniques for programming heterogeneous<br\/>distributed systems are being investigated. Specific results are expected in<br\/>the following areas:<br\/><br\/>Trusted Software Composition: This research focuses on developing a security infrastructure<br\/>for software composition consisting of a policy meta-language and<br\/>language-level enforcement mechanisms such as type-driven static<br\/>enforcement and automatic wrapper code generation.<br\/><br\/>Mobile Calculi: The project will investigates the foundations of a core<br\/>Internet programming language with a good algebraic theory, a natural<br\/>mapping into a distributed implementation, and expression of security<br\/>properties as types.<br\/><br\/>This work is expected to have applications in a variety of fields; from distributed<br\/>applications with high information assurance requirements to active<br\/>networks and distributed system monitoring and administration.","title":"CAREER: Foundations and Implementation of Mobile Object Systems","awardID":"0093282","effectiveDate":"2001-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["549800"],"PO":["564388"]},"57212":{"abstract":"EIA 0091474<br\/>Hanan Samet<br\/>University of Maryland<br\/><br\/>Digital Government: Scalable Data Collection Infrastructure for Digital Government Applications<br\/><br\/><br\/>This project in collaboration with the Internal Revenue Service, the Department of Justice, and the US Census Bureau will explore the collection of data over wide-area networks. Of particular interest are situations with high submission volume from a variety of sites to one agency (hot spots); e.g. the submission of electronic tax forms to IRS in the April 14-14 timeframe. Within that context, research issues will include scalability, and privacy\/integrity. Other possible government applications include submissions of proposals at deadlines, such as the NSF Fastlane system, and voting in digital democracy. The technology to be developed will work at the application layer of TCP\/IP, implementing a small set of primitive services.","title":"Digital Government: Scalable Data Collection Infrastructure for Digital Government Applications","awardID":"0091474","effectiveDate":"2001-06-15","expirationDate":"2007-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7602","name":"INFORMATION INTEGRATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"T188","name":"HUD-SPATIAL SEARCH ENGINE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"T694","name":"HUD-SPATIAL SEARCH ENGINE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["551003","538796","410098"],"PO":["371077"]},"59303":{"abstract":"There is a chronic need for more effective methods of designing correct and robust computer software as well as hardware. A method called \"Model Checking\" has been developed, providing an algorithmic means for establishing correctness of nominally finite state programs. Computer manufacturers<br\/>such as IBM, Intel, and Motorola are finding model checking useful for verifying computer hardware circuits of moderate size. However, further research is required before model checking can be applied successfully to large hardware designs and to software. Software is more difficult to construct and verify than hardware due to its less uniform organization and sheer scale. Techniques to cope with irregular organization based on partial order and asymmetry reduction facilitating application of model checking to large software systems will be investigated.<br\/>Other central topics of investigation include: new and improved basic techniques, including abstractions, algorithms, and data structures, for more efficient model checking; integration of model checking with other program design methods; <br\/>automatic program synthesis via model checking; and the feasibility of extending the dichotomous (correct\/incorrect) framework of conventional model checking using richer program robustness notions.","title":"Model Checking and Beyond","awardID":"0098141","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["184167"],"PO":["564388"]},"59204":{"abstract":"EIA-0097873<br\/>Reeker, Larry H<br\/>NIST<br\/><br\/>REU Sites: SURFing the Information Technology Lab: A NIST-NSF Partnership<br\/><br\/>The Summer University Research Fellowship (SURF) program at the National Institute for Standards and Technology (NIST) was begun by the Physics Laboratory in cooperation with NSF in 1993. Additional NIST laboratories have added such programs, and its youngest lab, Information Technology (ITL), is now doing so. NIST, the second oldest federal scientific organization, is a major working scientific organization, with many stimulating projects for undergraduate participation. Scientists with such projects are given time and resources by NIST to supervise the student research. NSF funds for stipend, travel, and housing expenses go to students via their academic institutions, which have submitted names of interested students and individual application materials provided by the students. NIST obtains quality summer housing at a level covered by the funds granted, provides the project resources, and has an office to administer the program, including recruiting through universities. There is a particular stress on outreach to obtain a group as diverse as it is talented. In addition to the individual projects, NIST provides a series of special seminars, many run by students who select and invite the speakers. SURF and post-SURF seminars by students on their projects are also expected, and papers or other participation at scientific conferences is encouraged. NIST and its individual labs also conduct ongoing reporting and evaluation to assure and increase SURF program quality.","title":"REU Sites: SURFing The Information Technology Lab: A NIST-NSF Partnership","awardID":"0097873","effectiveDate":"2001-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["54008"],"PO":["564181"]},"65650":{"abstract":"Assessing Research Training, Education and Career Development in Bioengineering, Medical Engineering, and Bioinformatics: Opportunities for NIH and NSF Collaboration","title":"Assessing Research Training, Education, and Career Development in Bioengineering, Medical Engineering, and Bioinformatics: Opportunities for NIH and NSF Collaboration.","awardID":"0125569","effectiveDate":"2001-06-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1401","name":"Division of ARCTIC SCIENCES DIVISION","abbr":"ARC"},"pgm":{"id":"1335","name":"IGERT FULL PROPOSALS"}}],"PIcoPI":[169920],"PO":["552354"]},"64088":{"abstract":"EIA-011777<br\/>Carol A. Hert<br\/>Syracuse University<br\/><br\/>Digital Government: Challenges in Statistical Digital Government: A Workshop promoting Agency-Research institution interaction<br\/><br\/>This workshop will bring together the grantee researchers in the Digital Government program who are working in areas related to the collection, maintenance, delivery and use of statistical data. Attendees will include researchers and agency employees and upper-level managers. The research technologies developed under theses grants in their first year or two will be demonstrated and there will be an opportunity to discuss mechanisms for transitioning these laboratory technologies to operational production at the participating agencies. In addition, participants will discuss and bring up to date a research agenda for work on information technologies in statistical settings","title":"Digital Government: Challenges in Statistical Digital Government: A workshop promoting Agency-Research institution interaction","awardID":"0117777","effectiveDate":"2001-06-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":[165198],"PO":["371077"]},"57632":{"abstract":"There is a tremendous market for tetherless and ubiquitous network<br\/>access, and a great demand for nomadic computation and<br\/>communication. A major component of such a system is a high speed<br\/>robust wireless local area network (WLAN) that provides services for a<br\/>limited geographical area. This limited geographical area enables a<br\/>large density of access points as well as high power tranmissions and<br\/>opens up the possibility of high rate robust multimedia communications<br\/>comparable to wired systems. Even though the bandwidth is still<br\/>scarce, the spatial dimension can now be exploited: The size of<br\/>typical WLAN devices, such as laptops and hand-held computers, enable<br\/>proper spacing of multiple antennas to provide diversity and coding<br\/>gains.<br\/><br\/>This research is aimed at a complete system design for multiple<br\/>antenna methods in the WLAN environment including coding, modulation,<br\/>channel estimation and power control strategies specifically tailored<br\/>for the slow fading environment of a WLAN channel. In particular,<br\/>high-rate multiple antenna coded modulation techniques and multiple<br\/>transmit antenna joint source and channel coding strategies are<br\/>developed. The issue of channel estimation along with feedback is<br\/>investigated and power control based on limited feedback is adressed.<br\/>A general approach to multiple transmit antenna methods is explored by<br\/>providing a theoretical foundation for spatially separated antennas in<br\/>WLAN environments. <br\/><br\/>The education plan is closely aligned with the research work and<br\/>emphasises the use of internet and computers in education by making<br\/>use of Polytechnic University's newly installed WLAN system on<br\/>campus. Curriculum development addresses specific needs of<br\/>Polytechnic's professional masters program and is based on an<br\/>integrated, end-to-end approach to communication systems.","title":"CAREER: Multiple Transmit Elements for High Speed Robust Wireless Local Area Networks","awardID":"0093163","effectiveDate":"2001-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["559524"],"PO":["348215"]},"59327":{"abstract":"A higher-type function is a function that takes as arguments, or<br\/>produces as results, other functions. Higher-type functions have<br\/>proven to be valuable tools in both theoretical and practical work<br\/>in programming. Indeed, higher-type constructs (e.g., classes,<br\/>components, modules, etc.) pervade contemporary computing. There<br\/>is a great deal of useful theoretical work in support of reasoning<br\/>about the correctness of programs that make use of higher-order<br\/>features. In contrast, there has been relatively little theoretical<br\/>work in support of reasoning about the performance (e.g., time and<br\/>space usage) of such programs. It is clearly a great folly to<br\/>ignore correctness in program development, but it is nearly as great<br\/>a folly to ignore performance. Thus there is a serious gap in the<br\/>scientific underpinnings of programs that use higher-type<br\/>features---even benchmarking a higher-type procedure is problematic<br\/>in the absence of a theory to help interpret what the results mean.<br\/><br\/>Higher-type complexity theory extends the general program of<br\/>computational complexity to a higher-type setting. This project<br\/>proposes the investigation of several topics in higher-type<br\/>complexity theory, particularly its relation to the recent results<br\/>on realizer models of higher-type computation. These topics<br\/>include:<br\/><br\/>1. Continuity and feasible computation. The (Scott) continuous<br\/>functionals of finite type are a key object of study in programming<br\/>language theory. There are examples of continuous functionals of<br\/>finite type that are arguably feasibly computable, but do not fit<br\/>within prior notions of higher-type feasibility. This project<br\/>proposes use an appropriate polynomial-time version of Kleene's<br\/>associate\/realizer framework to develop and investigate notions of<br\/>feasible computation in the context of the continuous functionals.<br\/><br\/>2. Prompt fixed points. Various sorts of fixed points are another<br\/>key tool in the theory of programming languages, especially in<br\/>explaining forms of recursion. The project proposes to explore<br\/>certain form of feasible, or prompt, fixed points so as to provide a<br\/>general context for recent work on feasible higher-type recursions.<br\/><br\/>3. Efficient programming systems for SR. The sequentially realizable<br\/>functionals (SR) is another class of functionals that have been the<br\/>focus of some important in programming languages theory. A key<br\/>question about SR is whether there is a complexity-theoretically<br\/>reasonable programming language for the class. The PI has a partial<br\/>negative result related to this. The project proposes to extend<br\/>this work. <br\/><br\/>4. Maximal notions of higher-type computation. The project proposes<br\/>to show that the (effective) continuous and the (effective) SR<br\/>functionals both satisfy a structural maximality property amongst<br\/>higher-type notions of computations.","title":"Computation and Complexity at Higher-Types","awardID":"0098198","effectiveDate":"2001-06-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["550560"],"PO":["279077"]},"59217":{"abstract":"This project advances the theory and practice of extensible object-oriented (OO) software by investigating how to support careful design, specification, and reasoning. Enhancing theoretical understanding for specifying and verifying extensible OO software forms the first subproblem. The project investigates several avenues: the soundness of proof techniques for behavioral subtyping among abstract data types with mutable objects, whose operations may have nondeterministic specifications; the extent to which the use of multimethods affects one's ability to prove behavioral subtyping; and the soundness of a specification and verification technique that allows the implementation of a subclass from a superclass's specification, without seeing the superclass's code.<br\/><br\/>The second subproblem comprises enhancing Java and a specification language for Java to better support extensible OO frameworks and libraries. The project implements and refines MultiJava, an extension to Java that supports both open classes and multimethods. The former allow one to extend existing classes with new methods, while the latter allow one to easily extend both a set of data types and the methods that work on them. The project also extends and refines JML, which is a behavioral interface specification language tailored to Java.","title":"Formal Methods for Extensible Object-Oriented Software","awardID":"0097907","effectiveDate":"2001-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[152128,"521544"],"PO":["564388"]},"61120":{"abstract":"PROPOSAL #0104834<br\/>TEXAS ENGINEERING EXP. STA.<br\/>XIONG, ZIXIANG<br\/><br\/>This ambitious project explores several new directions in the algorithmic design and architecture of challenging multimedia communication systems. A unified approach is taken for transmission of multimedia data over heterogeneous networks (e.g., the Internet) and noisy channels (e.g., a wireless LAN) based on scalable source coding. Topics covered in the project are:<br\/><br\/>1) Scalable multimedia data compression based on efficient arithmetic coding of bit planes of transform coefficients. For image coding, the wavelet transform is used like in the new JPEG-2000 standard. The focus is on introducing progressiveness in the traditionally non-progressive trellis coded quantization scheme. The 3-D wavelet transform is adopted for fully scalable video coding. A new nonuniform modulated complex lapped transform (NMCLT) is applied for audio coding. To achieve high arithmetic coding performance, a significant amount of effort is invested in high-order context modeling of the NMCLT or wavelet coefficients. In addition, new methods are studied for masking quantization noise of the NMCLT coefficients for audio coding and exploring the motion information for 3-D wavelet video coding.<br\/><br\/>2) Scalable transmission of Internet multimedia via optimal packetization and joint congestion and error control. A dynamic programming based optimal packetization scheme for scalable multimedia bit streams is<br\/>studied. Suboptimal but low complexity packetization schemes are also investigated. Congestion control is used to determine the available transmission rate and an end-to-end optimal error control scheme devised<br\/>to mitigate the effects of pack loss. This is achieved by optimally trading off scalable source coding and unequal error protection.","title":"Scalable Compression and Transmission of Internet Multimedia","awardID":"0104834","effectiveDate":"2001-06-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["516912"],"PO":["564898"]},"64244":{"abstract":"The proposal requests travel expenses for US researchers to participate in a DELOS workshop on \"Personalisation and Recommender Systems in Digital Libraries\" to be held at Dublin City University in Dublin, Ireland June 18-20, 2001. DELOS is a major forum for and organizer of digital libraries research and planning activities in Europe. It is funded by Information Societies Technologies (IST) 5th Framework Programme of the European Commission. This proposal seeks travel support for six participants from the American research community.<br\/><br\/>The workshop continues the planning and research agenda put forward by the multi-year NSF-EU working groups' process jointly sponsored by CISE\/IIS, SBE\/INT and the European Union. In the groups' final report \"An International Research Agenda for Digital Libraries\", increased levels of collaboration and interaction was seen as critical to building multi-lingual, multi-national digital libraries.","title":"Travel Support for the DELOS-NSF Workshop on Personalisation and Recommender Systems in Digital Libraries on June 18-20, 2001 in Dublin, Ireland","awardID":"0118551","effectiveDate":"2001-06-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["541869"],"PO":["433760"]},"56786":{"abstract":"0089759<br\/>Sanders<br\/><br\/>This three-year award for U.S.-France cooperative research in software systems involves Beverly Sanders of the University of Florida and Dominique Mery of LORIA (Information Applications Laboratory), Universite Henry Poincare, Nancy, France. The goal of this project is to explore the relationship between two known approaches to managing the complexity of software systems: composition and refinement of components. The US investigator brings to this collaboration expertise in compositional reasoning of software systems. This is complemented by the French investigator's experience with feature interactions in telecommunication systems. The project takes advantage of French expertise in theorem provers, model checkers and systems for abstract interpretation. The project will also benefit from interaction with European industry which tends to be ahead of the US in utilization of formal approaches to system design.<br\/><br\/>This award represents the US side of a joint proposal to the NSF and the French National Center for Scientific Research (CNRS). NSF will cover travel funds and living expenses for the US investigator. The CNRS will support the visits of French researchers to the United States. The collaboration will advance fundamental understanding of component based development of software systems and may lead to new understanding about the refinement and composition approach to managing complex and huge software systems.","title":"US-France Cooperative Research: Composition by Refinement","awardID":"0089759","effectiveDate":"2001-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["382541"],"PO":["564152"]},"77830":{"abstract":"Multiple parties are increasingly using distributed information systems, especially the Internet, for automated negotiations. Game theory provides a basis for engineering incentives into the interaction mechanisms of these systems so that desirable social outcomes follow -- even though every party acts based on self-interest. However, there is a hazardous gap in game theory when it comes to incentives and computation, leaving such systems open to manipulation. Extensions to game theory that address computation are required for settings where the participants are self-interested, and there is an underlying intractable problem that limits the agents' rationality. In this project, a theory of interaction is being developed where computational actions are treated as part of each agent's strategy. The work involves model development, game-theoretic analysis, mechanism and algorithm design, and computational experiments. This research paves the way to building secure systems that are robust against manipulation, yet computationally feasible. The theories being developed allow the construction of optimal negotiating agents in settings where computation is an issue. This enables wider and fairer access to Internet commerce by putting novices, assisted by these software agents, on an equal playing field with expert market participants. The methodology being developed also enables the design of economically and computationally more efficient interaction mechanisms.","title":"ITR: Secure Automated Negotiation under Limited Computation: Deliberation in Equilibrium","awardID":"0234694","effectiveDate":"2001-06-01","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["561267"],"PO":["564456"]},"56930":{"abstract":"Modern computers have multi-level memory hierarchies in which the cost of data access may increase by an order of magnitude or more from one level to the next. On these machines, a program that touches a large amount of data runs well only if it exhibits locality - that is, if most of its references are satisfied by the highest level of the memory hierarchy. Unfortunately, many programs do not exhibit locality.<br\/><br\/>For 2-level memory hierarchies, the numerical linear algebra community has addressed the problem by implementing libraries of blocked codes such as LAPACK. For multi-level memory hierarchies, they are developing libraries of block-recursive algorithms. <br\/><br\/>The problem with any library is that it is not general-purpose - for example, the BLAS and LAPACK libraries cannot be used for obtaining good performance on finite-difference codes. This research will develop a general-purpose restructuring compiler for synthesizing block-recursive codes from standard iterative ones. The compiler is general-purpose in the sense that in principle, it can restructure any program in which dense arrays are accessed by affine array references. The technology proposed has already been used successfully to restructure iterative codes into LAPACK-style blocked codes.<br\/><br\/>The approach to be taken consists of:<br\/><br\/>--- converting the problem of generating code that touches data in a block-recursive order into the problem of generating code that walks over a certain iteration space called the product space in a block-recursive or space-filling order. This enables standard techniques from dependence analysis to be used to synthesize the appropriate restructuring transformations.<br\/><br\/>- switching to an iterative code once the problem size becomes small enough. The threshold problem size at which this transition should happen may be difficult to determine analytically. In our system, the compiler will estimate this size using a simple abstraction of the underlying machine architecture. For frequently used codes however, the system will use a new approach called empirical optimization - whenever there are free cycles on the machine, our system will experiment with different threshold values, remember the best threshold value for each input size, and use that value when that code is run again.<br\/><br\/>- developing a symbolic analysis technique called fractal symbolic analysis for verifying the legality of transformations on codes like LU with pivoting (since it is well-known that dependence analysis is inadequate for restructuring codes such as LU factorization with pivoting). However, it is not yet known how to synthesize the right locality-enhancing transformations from information provided by fractal symbolic analysis. Such techniques will be developed and integrated with dependence-based techniques.","title":"Synthesis of Block-recursive Codes for Deep Memory Hierarchies","awardID":"0090217","effectiveDate":"2001-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["556730","292960"],"PO":["551992"]},"58943":{"abstract":"Recursive decoding for Reed-Muller codes and their modifications<br\/> <br\/>Powerful error correction is in great demand in modern communication systems. However, practical performance of the best codes is often limited due to infeasible decoding complexity or excessive length of the blocks to be used. In particular, optimum maximum likelihood decoding has huge complexity even on short blocks of one hundred bits. By contrast, iterative decoding combines low complexity and superior performance using long blocks that include tens of thousands bits. Therefore this research focuses on code constructions and decoding algorithms that can achieve good performance and low decoding complexity while using the blocks of moderate length. The particular goal of the research is to employ the blocks ranging from 100 bits to 1000 bits, where neither maximum likelihood decoding nor iterative procedures achieve good performance at a low complexity. Due to short lengths and fast decoding, the new codes can be used in a variety of high-speed applications arising in broadband and wireless systems.<br\/> <br\/>To achieve this goal, the researchers employ fast recursive techniques that split original codes of length n into two codes of length n\/2. These techniques are applied to Reed-Muller (RM) codes, their subcodes, and new code modifications. The basic procedure splits the RM code (r, m) into the two constituent RM codes (m - 1, r - 1) and (m - 1, r). Decoding is then relegated further to the shorter codes. In all intermediate steps, the decoder only recalculates the reliabilities of the newly defined symbols. Finally, fast optimum decoding is performed on the basic RM codes of the first order. For longer codes, this repetitive multilevel recursion increasingly outperforms other low-complexity algorithms, such as bounded distance decoding and majority decoding. The procedures are further enhanced by using very short lists of candidates taken in the intermediate steps of the recursion. Another enhancement uses subcodes of RM codes, for which tracking a few plausible candidates already gives near-maximum likelihood decoding. In particular, even short RM codes of length 128 achieve low output bit error rates (BER) at a signal-to-noise ratio (SNR) of 2.5 dB. Further research topics include:<br\/> <br\/>General study of recursive decoding algorithms. The goals are:<br\/> <br\/>(a) to estimate the output BER in each step of multilevel recursions;<br\/> <br\/>(b) to choose the most protected subcodes of RM codes;<br\/> <br\/>(c) to evaluate the output BER in recursive list decoding;<br\/> <br\/>(d) to design new criteria for choosing short lists of candidates. <br\/><br\/>Design of new recursive algorithms. The goal is to design more advanced constructions that:<br\/> <br\/>a) split the original block into multiple subblocks with different levels of protection;<br\/> <br\/>(b) use the recursions with new constituent codes different from RM codes;<br\/> <br\/>(c) incorporate permutation techniques in recursive decoding;<br\/> <br\/>(d) achieve efficient decoding for blocks up to 1024 bits used at SNR of 1 to 2 dB.","title":"Recursive Decoding for Reed-Muller Codes and their Modifications","awardID":"0097125","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["478371"],"PO":["348215"]},"69624":{"abstract":"","title":"CAREER: Bandwidth Allocation Techniques for Video-on-Demand Systems","awardID":"0196515","effectiveDate":"2001-06-30","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["518376"],"PO":["565090"]},"57656":{"abstract":"Wireless communications systems free users from physically attaching to access points, while the Internet provides the universal accessibility to information services of many kinds, thus the marriage of the wireless and the Internet will be tremendous, making ubiquitous communications possible. However, in wireless network segments, resources (frequency, time and code) are extremely limited, thus, overdimensioning of such a network is equivalent to poor capital investment, while congestion at busy hours could mean lost calls and lost revenues. Therefore, the cost-effective dimensioning and management of wireless network resources to handle users' demands have to be carefully investigated. Compared to the vast resources of its wired counterpart, wireless segments become the bottleneck for integrated systems (wireless internet). Thus, intelligent resource management in the wireless mobile networks becomes a critical issue.<br\/> This proposal will investigate the intelligent resource management and performance evaluation for wireless mobile networks. This research is motivated by the following observations: (1) a lot of information available in network operations has not been effectively used in resource management; (2) co-operative network operations (such as information sharing) among the wired communications entities (such as base stations or mobile switching centers) can significantly improve the overall network performance, incurring signaling traffic over the wired segments is a good tradeoff. For example, if we could predict a mobile user's movement based on his\/her movement history, the network could make appropriate resource reservation around the moving trajectory to overcome the potential call drops. If traffic information and mobility information are shared among a group of neighboring base stations, then potential congestion can be avoided or early actions can be taken. If the traffic type of a call connection can be passed to a lower layer (say, radio resource layer), then better transmission schemes can be designed. Thus, in this proposal the researcher will investigate intelligent resource management by accomplishing the following few tasks:<br\/>_ Propose a Virtual Management Network to coordinate the information exchanges;<br\/>_ Develop new mobility management schemes using location tracking and location prediction; _ Investigate various call admission control and intelligent call handling schemes and provide guidelines for choosing the appropriate schemes for specific applications;<br\/>_ Study the resource reservation schemes in combination with mobility prediction;<br\/>_ Provide a general framework for performance evaluation of wireless mobile networks under various resource allocation schemes.<br\/> The significant difference between the proposed work and the previous work in the open literature is that the research considers the wireless networks with call connections requiring different amounts of resources, and also considers the mobility factors in its analysis. This research will be important for future telecommunications design, particularly for wireless Internet.<br\/> In conjunction with the proposed research, the PI will integrate the research on wireless networks and mobile communications into teaching. Based on his expertise's in various areas in electrical engineering, computer science, systems engineering and mathematics, the PI is planning to help build up a strong networking program in the Department of Electrical and Computer Engineering at University of Florida. He will strive to bring his diversified expertise's, particularly the mathematical thinking process, into the classroom, to teach students how and why by going through the creation process of \"new\" concepts or results in combination with associative learning and critical reading, to provide students with the new developments in the current research fronts and industrial practices and to develop a collaborative learning environment. The ultimate goal of his teaching is to help students to develop a life-long learning ability. The PI also realizes that the area of the wireless networks and mobile communications provides a better place for cooperation between electrical engineers and computer scientists, the proposed research and educational plan could bring this cooperative mode into the classroom.","title":"CAREER: Intelligent Resource Management and Performance Evaluation for Wireless Mobile Networks Supporting Integrated Services","awardID":"0093241","effectiveDate":"2001-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["560200"],"PO":["565090"]},"59329":{"abstract":"The project develops techniques to quantify design attributes of object-oriented software in terms of architectural structures and patterns, and demonstrates that these design attributes are related to external quality attributes such as maintainability, reusability, testability, and reliability. The focus is on identifying design structures and patterns that will make software easier to adapt and test. Design measurement is based on the structure of interconnected objects including the links between objects, the properties of these links, and the properties of individual object classes. Design patterns are identified through program and design analysis and the use of existing design pattern recognition technology. External design quality evaluations are based on process data from commercial organizations and analytical evaluation of change difficulty. Relationships between design attributes and external quality are identified by examining commercial software engineering data and through analyses of the connection between internal and external attributes. Results from this work demonstrate costs and benefits of alternative object-oriented software designs. The work should lead to improved design methods to produce software that is easier to adapt, extend, and test as it evolves.","title":"Evaluating Object-Oriented Designs","awardID":"0098202","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["543603"],"PO":["564388"]},"60682":{"abstract":"This research project, supported by the Division of Integrative Biology and Neuroscience, will be carried out by Dr. Rong Wang, Dr. Nickolas Menhart and their students at the Illinois Institute of Technology. The target of the research is to develop a novel approach that allows a real-time study of the dynamic behavior of individual ligand-receptor pairs (typical size of several nanometers) in the living cell environment. The essence of this approach is to guide the tip of the atomic force microscope (AFM) to desired receptor proteins regardless of the roughness and complexity on the cell membrane surface. Besides imaging of biomolecules at the submolecular level under physiological conditions, dynamic and kinetic processes of the biorecognition events can be clarified on the nanoscale. <br\/>The research will involve novel experiments aimed at fundamental studies of single ligand-receptor interaction in the natural environment. This will provide the molecular basis for biological activities and molecular communications within cells. One of the promising applications is to elucidate a vaccine or drug target at the particular cell-surface protein in a diseased cell or an activator target in a growth cell. This revolutionary approach shows strong promise to elevate the development of the fundamental understanding of molecular functions in bioscience to an entirely new level, and will stimulate progress in the study of biological and biologically inspired systems in which nanostructures play an important role.","title":"NER: Dynamic Behavior of Ligand-Receptor Interactions in Living Cells on the Nanoscale","awardID":"0103080","effectiveDate":"2001-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1708","name":"QuBIC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1676","name":"NANOSCALE:  EXPLORATORY RSRCH"}}],"PIcoPI":[156063,156064],"PO":["560906"]},"60572":{"abstract":"Research shows that direct experiences with nature have beneficial effects on people's physical, cognitive, and emotional well-being. Yet what happens psychologically when advanced technologies augment human\/nature interactions? Grounded in Value-Sensitive Design, this project represents an early, cohesive, and rigorous effort to answer this question. At the heart of this project lies five empirical studies. Study 1 involves a room with an augmented \"window\" view (a video plasma display of a real-time local nature scene). Study 2 involves whether it matters psychologically that an augmentation of a natural scene occurs in real-time. Study 3 involves robot \"pets\" in the lives of children and adolescents. Study 4 involves robot \"pets\" as possible companions for the elderly. Study 5 involves a \"telegarden\" (a telerobotic installation that allows Web users to garden by controlling a remote industrial robot arm). A diverse range of physiological, behavioral, and social-cognitive data are collected over short-term and longer-term conditions. In the coming years, augmented reality will become part of our everyday lives, and pervasive across diverse fields, such as architecture, education, gerontology, recreation, and ecommerce. This project contributes proactively to the design and use - from an ethical stance - of this emerging technology.","title":"Augmented Reality of the Natural World and its Psychological Effects: A Value-Sensitive Design Approach","awardID":"0102558","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[155714,"546850","542095"],"PO":["564456"]},"62695":{"abstract":"EIA-0111840<br\/>College of William & Mary<br\/>Nikos P. Chrisochoides<br\/><br\/>NGS: Introducing the Next Generation of Computational Scientists in the Science and Art of Meshing<br\/><br\/>International Meshing Roundtable (IMR) takes place every year in the United States. IMR attracts researchers from universities, national laboratories, and computer vendors from the US, Canada, many countries from Europe, Japan, and some countries from South America. IMR is an ideal forum to attract and excite young researchers in the field of mesh generation. Graduate students selection for travel support will be based on two criteria: ( i ) advanced students will present their own papers accepted by the IMR program committee ( ii ) not so advanced students will be asked to submit one page statements of interest signed by their advisor and\/or chairman of their department.","title":"Introducing the Next Generation of Computational Scientists in the Science and Art of Meshing","awardID":"0111840","effectiveDate":"2001-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["561580"],"PO":["301532"]},"77831":{"abstract":"A growing standardized communications infrastucture, over which, agents belonging to different organizations can interact, is expected to raise the importance of automated negotiation among self-interested automated agents. This project investigates normative negotiation stratagies for agents, specifically: a) extending work on single contracts by investigating decommitments, penalties, etc. and their relationships to optimality; b) designing barganing protocals that lead to optimal contracts, and c) studying sequences of contracts among multiple agents, including the affects of changing the pace of decommitments, contingancy contracts, and more powerful contract types that reduce needs for backtracking. The results of these studies will be used to design a normative hybrid multi-agent search algorithm that repesents the best chice in a space of protocals where each dimension corresponds to a methodilogical tradeoff. Among other things, this work is expected to impact electronic commerce, including such aspects as the formation of dynamic alliances of small agile enterprises through dynamic automated contracting. http:\/\/www.cs.wustl.edu\/~sandholm","title":"Advanced Contract Types for Automated Negotiation","awardID":"0234695","effectiveDate":"2001-06-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["561267"],"PO":["565227"]},"64642":{"abstract":"The biological sciences have the potential to become substantially more quantitative because emerging computational and mathematical tools could facilitate collection and analysis of vast amounts of biological data. New methods for computational analysis and mathematical modeling of complex biological processes and signals can be used for characterizing variability and uncertainty of biological data across scales of space and time. For example, such signals or measurements are direct indicators of the biological state of the corresponding cells or organs in an organism. There is an increasing demand for interactions among biologists, engineers, mathematicians, computer scientists and medical researchers in the use of these emerging technologies and methods to be able to develop a new interdisciplinary workforce that is able to understand and facilitate reliable quantitative approaches and answers to the major integrative biological challenges.<br\/>The main objective of this summer school is to expose undergraduate, graduate, and postdoctoral biological science and bioengineering students to the relatively new approaches of nonlinear dynamical analysis and biosignal interpretation in complex biological systems, and to facilitate rapid diffusion of these mathematical and computational tools in the biological sciences. These methods will be helpful, also, to both students and post-doctoral fellows in computer science and mathematics who are interested in pursuing research in biology and bioengineering, since the summer school provides exceptional insights into the fundamental challenges in biological sciences.<br\/>The summer school uses lectures, oriented toward biological science students, by expert faculty. The faculty will describe their research areas, and focus on ways to use the mathematical and computational tools to understand the underlying mechanisms of complex biological systems and processes. In addition to these lectures, the summer school will employ a two-hour panel discussion, with active participation of undergraduate, graduate and post-doctoral fellows, focused on future developments in biocomplexity and their potential impacts on biology and medicine. In addition, tutorials and hands-on research projects using computers will allow students to explore real-world biological applications of the new computational and modeling approaches. Students will present the results of their projects in a culminating poster session, which will facilitate discussion of both the biology and computational approaches.<br\/>The summer school will stimulate further interdisciplinary research and collaborations among engineers, mathematicians, computer scientists, and medical researchers, and will help in identifying new, challenging directions in complex biological science and bioengineering research.","title":"International Summer School on Biocomplexity, June 24 - July 1, 2001 in Hanover, New Hampshire","awardID":"0120792","effectiveDate":"2001-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1114","name":"Cellular Processes"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1155","name":"INTEGRATIVE ANIMAL BIOLOGY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1162","name":"COMPUTATIONAL NEUROSCIENCE"}}],"PIcoPI":["542495"],"PO":["563574"]},"57701":{"abstract":"Digital data can occur in diverse forms; it may occur as database records with numerical fields, as raw text documents or image files, or as website traffic log files. Data mining is the automatic discovery of interesting patterns, associations,changes, anomalies, rules, and statistically significant structures and events in data. <br\/><br\/>A key feature, often an overwhelming feature, of the data is its sheer magnitude. The rapidly expanding internet already contains more than 1 billion web pages, and typical warehouse and web traffic data can occupy terabytes of disk space. It is clear that data mining tools must be efficient and scalable if they are to serve any practical purpose. Parallel computing can help in satisfying the demands on computing cycles and memory storage imposed by these large data sets.<br\/><br\/>The main focus of this project is to develop scalable solutions for large-scale data analysis. The main thrust is<br\/>in exploring and developing efficient, parallel, mathematical and statistical methods that can mine large data sets and deliver results in a timely manner. In particular, new clustering techniques that partition data into<br\/>disjoint partitions, the new method of concept decompositions for dimensionality reduction, improved computation of principal components analysis, efficient classification schemes for folding in newly arriving unlabeled data into known classes, and effective visualization of multidimensional data will be investigated. <br\/><br\/>Another focus is to adapt the data analyses tools developed to the application area of text mining.<br\/>A completely parallel text mining system that is capable of (a) efficient preprocessing of text data into<br\/>numerical data, (b) clustering large unlabeled document collections, (c) classifying unlabeled documents into a known concept hierarchy and (d) visualization of document & word relationships will be built. This system will allow the user to easily navigate, assimilate, search and organize the contents of very large document collections; we hope to process up to 100 million documents on a 128-processor cluster of workstations. Many of the text mining algorithms we develop will scale linearly with the size of the data. In this scenario, it becomes important to avoid I\/O bottlenecks, exploit memory hierarchies of modern processors and hide network latencies.<br\/><br\/>The educational plan consists of three components: (i) a teaching philosophy that emphasizes<br\/>the scientific method in undergraduate and graduate education, by incorporating new technologies for in-class and web-based offline instruction; (ii) a focus on multidisciplinary education with a commitment to develop centralized web-oriented primers designed to quickly acquaint students with desired pre-requisites; and (iii) curriculum development for two courses; the first, a scientific computing course for non-CS undergraduates as part of UT Austin's new \"Elements of Computing\" program, and the second, a new course on large-scale data mining for graduate students.","title":"CAREER: Scalable Algorithms for Large-Scale Data Mining","awardID":"0093404","effectiveDate":"2001-06-01","expirationDate":"2008-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["550986"],"PO":["565272"]},"57668":{"abstract":"The emergence of new technologies for content distribution including content delivery networks (CDNs, end system multicast, distributed content exchange and application-level anycast are fundamentally changing the relationships between consumers and producers of digital content. Whereas traditional approaches to content delivery are predicated on point-to-point connections from a client to a single origin server, these new mechanisms for content distribution fundamentally undermine the assumptions inherent in that model. For example, CDNs redirect clients to a number of equivalent replica servers, while end system multicast goes further and blurs the distinction between client and server by requiring that every participant who wishes to access content serve content as well. To illustrate this point, consider the access graph plotting the flow of TCP connections serving a popular document through the network at an instant in time. Until very recently, this graph could easily be characterized as forming a hub-and-spoke topology with the hub at the origin server; now its complex structure is little known except perhaps to network engineers within the CDNs themselves.<br\/> Broadly, the researcher's interests lie in characterizing the impact that new and increasingly distributed content delivery mechanisms will have on network traffic, resource management and the design of network protocols. In the research component of the researcher's career development program, he focuses on strategies for addressing the challenges and opportunities that distributed content delivery mechanisms will place on reliable transport protocols. In particular, the complex one-to-many and many-to-many relationships between consumers and producers of digital content will place strain on transport protocols such as TCP, as those protocols are not designed to accomodate the fluid interactions which will take place when users have a multiplicity of service options. The researcher argues for lightweight reliable transport services designed for maximum flexibility which can accomodate connection preemption, connection suspension, connection migration and connection aggregation. While these considerations are fundamental , they have not been carefully studied in the context of TCP because of daunting technical hurdles, complexity, and absence of a driving need. The researcher brings new techniques to bear on the problem, as the proposed work leverages his experience with fast forward error correcting coding techniques which he has applied in the domain of reliable multicast [11] and downloading digital content from multiple mirror sites in parallel [10]. In some of the settings considered, such as dynamic server selection and redirection, the flexibility which the proposed techniques afford can be considered to be a performance optimization, but in other settings, such as providing reliability for end system multicast, the researcher argues that the flexible services proposed are essential to delivering high performance.<br\/> The proposed educational aspect of the researcher's career development program focuses on enhancing the undergraduate and graduate student experience in his department and building a stronger basis for industrial and inter-institutional networking research collaborations in the Boston area. Proposed activities center around ongoing projects to promote undergraduate involvement in networking research; to enhance the department's networking curriculum; and to encourage students to participate in the computer science community outside of the university, whether by volunteering at a community outreach program or by becoming involved in local organizations of computer scientists. An exciting initiative which the researcher is e actively involved in and which will help achieve these goals is the institution of a center for networking research at Boston University.","title":"CAREER: Flexible Strategies for Internet Content Distribution","awardID":"0093296","effectiveDate":"2001-06-01","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["313342"],"PO":["565090"]},"58779":{"abstract":"This grant provides partial support for the First International Symposium on Computational Cell<br\/>Biology to be held March 4-6, 2001 in Lenox, MA. Computational Cell Biology is an emerging interdisciplinary field that responds to the need for computational methods to analyze and organize the abundance of experimental data on the structure and function of the cell. Whereas other meetings have been held that focus on bioinformatics and molecular and structural biology, this will be the first meeting geared to the use of computational modeling applications in cell biology, and will be primarily targeted to cell<br\/>biologists. The major focus of the meeting will be on areas of cell biology for which modeling approaches are currently being developed, or that are ripe for computational modeling approaches. A key goal is to bring together cell biologists whose research addresses quantitative aspects of cellular mechanisms with computer scientists and mathematicians who can provide the computational tools. The symposium is being organized by The National Resource for Cell Analysis and Modeling (NRCAM), located in the Center for Biomedical Imaging Technology (CBIT) at the University of Connecticut Health Center. The organizing committee consists of<br\/>Drs. Leslie M. Loew, Director of NRCAM and CBIT, John Carson, co-Director of NRCAM and Vladimir Rodionov, associate faculty of CBIT, and is chaired by Ann Cowan, Deputy Director of CBIT and head of dissemination and training for NRCAM. The members of the organizing committee feel that the time is ripe to bring together cell biologists, mathematicians, and computer scientists to develop a true community of scientists sharing the common goal of developing computational tools for cell biological modeling and simulation. Topics at the meetings will encompass a range of cellular mechanisms including regulation of the cytoskeleton and molecular motors, membrane and protein trafficking, regulation of calcium dynamics, signal transduction pathways, and cell cycle control. In each of these areas key researchers who utilize highly quantitative experimental approaches and\/or are applying mathematical modeling approaches will be invited to speak. The meeting will be an intensive mix of platform sessions, poster sessions and small workshops and tutorials. The venue for the meeting is a resort in the Berkshire mountains that is limited to a maximum of 125 participants. This setting and meeting size will be ideal for encouraging individual interactions between this diverse group of scientists. It will also serve as an excellent educational activity for graduate and<br\/>postdoctoral students working in this young and expanding field.","title":"Conference \"First International Symposium on Computational Cell Biology\" held March 4-6, 2001 in Lenox, MA.","awardID":"0096625","effectiveDate":"2001-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1114","name":"Cellular Processes"}}],"PIcoPI":["267562","412303","559216"],"PO":["310749"]},"61332":{"abstract":"Online computation involves optimization problems for which the input is<br\/>revealed progressively. Online algorithms base their decisions only on the<br\/>past without knowledge of the future, much in the same way that a stock<br\/>market investor or a robot that explores an unknown environment decide<br\/>about their next action. Naturally such problems of decision-making with<br\/>incomplete information arise in many areas. During the last decade<br\/>research in the area of online algorithms has been very intensive. Still,<br\/>some of the fundamental problems remain unresolved and important problems<br\/>arise from new applications. The project deals both with old and new<br\/>online problems.<br\/><br\/>Perhaps the most important fundamental unsolved problem is the k-server<br\/>problem. The objective is to settle the k-server conjecture and to<br\/>investigate other variants of the problem such as the k-taxicab problem<br\/>and the CNN problem. Another objective is to design and analyze<br\/>competitive algorithms for a related problem, the online matching problem<br\/>on Euclidean spaces; some interesting variants of the problem seem to play<br\/>a central role in new e-commerce applications. For all these and many<br\/>other problems, one algorithm, the generalized Work Function Algorithm,<br\/>seems to have almost optimal competitive ratio. The research addresses the<br\/>roots of this phenomenon.<br\/><br\/>Research deals also with the pertinent problem of indexing of databases;<br\/>the size of datasets of real applications has been increasing dramatically<br\/>and so does the importance of good indexing schemes. Competitive analysis<br\/>can be used to quantify how much the performance of indexing schemes is<br\/>affected by changes in a database. Finally, the techniques of competitive<br\/>analysis are a useful tool to address specific game-theoretic problems in<br\/>networks.","title":"Online Algorithms","awardID":"0105752","effectiveDate":"2001-06-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[157704],"PO":["499399"]},"61244":{"abstract":"EIA-0105272<br\/>Edward Riseman<br\/>University of Massachusetts<br\/><br\/>SGER: Digital Aerial Video Mosaics for Ecosystem Carbon Cycle Modeling<br\/><br\/>This grant will support preliminary explorations for applying digital video aerial image analysis to long-term issues of global warming, in particular carbon cycle modeling, in the government arena. Many government agencies are already using GIS heavily, but in a less dynamic way, relying on single images in time, without fine-grain time references. This project will explore government uses of real-time imaging, at resolutions beyond what can be achieved with commercial satellite images, allowing the digital film to be geo-referenced, integrated with data streams from other sensors, and viewed in 3D through polarized glasses.","title":"SGER: Digital Aerial Video Mosaics for EcoSystem Carbon Cycle Modeling","awardID":"0105272","effectiveDate":"2001-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["290021","258685","290022"],"PO":["371077"]},"62003":{"abstract":"EIA-0109049<br\/>Sharon Dawes<br\/>SUNY @ Albany<br\/><br\/>Digital Government: Proposal to investigate e-business transformation at the National Science Foundation<br\/><br\/><br\/>This workshop will examine today's information technology resarch status and products, and the variety of ways research granting institutions currently accomplish their missions. That examination will support an extrapolation of technology and organizational practices 5-7 years into the future, to consider how those coming technologies and practices might be employed in a granting institution's mission. Of interest also will be how the organization of such an institution might be constructed to best take advantage of those technologies and to ensure the appropriate injection of new technologies in achieving high effectiveness in the furtherance of its mission.","title":"Digital Government: Developing an Information Technology and Organizational Design Research Agenda for the Evaluation and Management of Research Proposals","awardID":"0109049","effectiveDate":"2001-06-15","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["433610","551444","433032"],"PO":["371077"]},"60684":{"abstract":"PROPOSAL NO.: 0103096<br\/>PRINCIPAL INVESTIGATOR: Lu, Yicheng<br\/>INSTITUTION NAME: Rutgers University New Brunswick<br\/>TITLE: NER: Feasibility Studies on ZnO Nanostructures And Their Device Applications<br\/><br\/>This proposal addresses the exploratory research on zinc oxide (ZnO) based nanoscale structures<br\/>and feasibility study of their device applications. ZnO is a multifunctional material possessing unique<br\/>electrical, optical, acoustical, and mechanical properties. Semiconductor ZnO has a wide and direct<br\/>energy bandgap (~3.3eV). ZnO can be grown at low temperatures, in contrast with the other wide<br\/>bandgap materials, such as GaN and SiC. Its ternary compounds, formed by alloying ZnO with CdO and<br\/>MgO, permit bandgap tuning from ~2.8 eV to ~4 eV. Doped ZnO ternaries can be made magnetic or<br\/>ferroelectric, extending its applications beyond the traditional semiconductor confines. In this exploratory<br\/>research, we will study growth mechanisms and conduct substrate engineering for selective growth of<br\/>ZnO nanotips and nanotip arrays on various substrates, including R-plane sapphire, Si, silicon-on-sapphire<br\/>(SOS), and GaN-on-sapphire. Feasibility studies of ZnO nanotip applications will focus on field-emission,<br\/>two-dimensional photonic bandgap (PBG), and fine instrumentation such as atomic force<br\/>microscopy and scanning tunneling optical microscopy. We will also explore the feasibility to form CdO<br\/>quantum dots in ZnO using the activated alloy phase segregation mechanism, which may be proved as a<br\/>viable alternative to the Stranski-Krastanov mechanism. These quantum dots have potential applications<br\/>in UV lasers and integrated UV optoelectronic chips. The proposed work will extend the research on<br\/>nanoscale structures and devices into the field of wide bandgap semiconductor nanoscale science and<br\/>engineering. The research and development of nanoscale structures in ZnO and its ternaries will lead to a<br\/>fundamentally new class of devices, which integrate multi-phenomena and posses unprecedented multi-functional<br\/>characteristics.","title":"NER: Feasibility Studies on ZnO Nanostructures And Their Device Applications","awardID":"0103096","effectiveDate":"2001-06-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["539738"],"PO":["187585"]},"63885":{"abstract":"This proposal seeks to sponsor travel expenses for graduate students and junior faculty members<br\/>to attend the 7th IEEE Real-Time Technology and Application Symposium (RTAS) to be held<br\/>in Taipei, Taiwan and sponsored by the IEEE Computer Society Technical Committee on Real-<br\/>Time Systems. RTAS provides a forum for presenting the latest advances in real-time systems<br\/>research and for discussing the practical challenges encountered and the solutions adopted. A<br\/>special mission of RTAS 2001 is to foster discussion and technology exchange in the real-time<br\/>computing and communication communities between Asia and North America. As such, we have<br\/>invited Dr. C. L. Liu (who developed the rate-monotonic scheduling theory in the 70's and is<br\/>currently the president of National Ching-Hua University in Hsin-Chu, Taiwan) to serve as the<br\/>Honorary Chair, and top-notch researchers in both Asia, Americas, and Europe to serve on the<br\/>Technical Program Committee. In addition to single-track technical sessions, we will also organize<br\/>tutorials and workshops that address practical, temporal QoS issues in application domains or over<br\/>the Internet.<br\/><br\/>The symposium, as many other academic activities, relies on the experience of senior members<br\/>of the community but requires fresh ideas and new people to join the community. As such, and<br\/>to encourage graduate students and young faculty members to participate in the exciting technical<br\/>program, we are requesting support to defray the travel expenses for graduate students and junior<br\/>faculty attendees. The total amount requested is $12,000 on the basis of an average travel grant<br\/>of $1,200 for each selected junior faculty participant and $800 for each selected graduate student.<br\/>We believe attendance at this Symposium will be very beneficial to young scientists who otherwise<br\/>would be unable to participlate in the gathering. Contacts for future (international) collaborations<br\/>will be made and idea exchange will certainly occur. Travel support for student and junior faculty<br\/>attendance will be advertised nationwide and women, minorities and disabled students will be<br\/>especially encouraged to apply for sponsorship.","title":"Proposal for Supporting Travel Expenses to Attend the 7th IEEE Real-Time Technology and Application Symposium (RTAS) in Taipei, Taiwan","awardID":"0116796","effectiveDate":"2001-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["453727","554329"],"PO":["209879"]},"58924":{"abstract":"This is the first year funding of a three year continuing award. In this project, the PI will build upon his prior NSF-funded work to develop computer systems capable of operating autonomously in dynamic and uncertain environments. Specifically, the research will focus on three major themes: Qualitative planning under uncertainty using causal and counterfactual relationships; Automatic generation of natural language explanations of actions, recommendations, and unexpected eventualities; Learning causal structures from spontaneous changes, to facilitate predictions and decisions in data-intensive applications.","title":"Probalistic Networks for Automated Reasoning","awardID":"0097082","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["541989"],"PO":["491702"]},"57506":{"abstract":"In 1989, the researcher applied for graduate schooland wrote that global network access would change the way people work and that people would use the network to \"plan travel, pay bills and access libraries of information\". A decade later, the Internet and Web applications made these network applications a reality. As we look to the future, the next major evolution in technology will be to make it possible for users to access information and interact with all devices in their environment through ubiquitous wireless networks and simple inexpensive computing devices such as PDAs [81]. The popular approach to achieving this future vision has been to move the applications and network services available on the Internet onto the simple mobile devices and the wireless network infrastructure. However, innovative network services and protocols will be necessary to operate such networks and applications efficiently.<br\/> The objective of this NSF CAREER proposal is to examine the services that this new generation of mobile applications need from the network and to carefully adapt the design and implementation of these services to the environment's demands. The unique requirements of this environment include:<br\/> Power Awareness. Most mobile devices will be battery operated and thus require energy efficiency.<br\/> Wireless Link Characteristics. Wireless links are slower due to limited spectrum availability, are prone to loss and disconnection, and are often connection-oriented or stateful.<br\/> Network Evolution. Since users will not upgrade all their small devices simultaneously, the future system must support automatic upgrading, multiple simultaneous versions and\/or backward compatibility.<br\/> Dynamic Network. The members of a network are dynamic due to mobility and range of network.<br\/> Isolation. A group of wireless devices should be able to operate in isolation from any infrastructure.<br\/> Simple Devices. Many of the devices that participate in such a network may be extremely simple.<br\/> Scale of Operation. The future network will have billions of small devices.<br\/> New Applications. Applications in this environment may need very different services from the network.<br\/> The objective of this CAREER proposal is to design a new networking and operating system infrastructure for this next generation of ubiquitous computing applications. The research plan consists of three major stages. In the first stage, the researcher plans to build some of these next generation applications to improve the understanding of their requirements. The next stage consists of developing protocols and operating system services based on these new requirements. The project is especially interested in 1) improving the bandwidth and power efficiency of network protocols, 2) making it possible for applications and protocols to adapt to the availability of power, availability of bandwidth and other environmental conditions, 3) designing service discovery approaches that can handle the query types that are likely for mobile applications, and 4) making this environment support the easy introduction of new link technologies, network protocols and applications. Finally, the research will be evaluated by modifying our test applications to use these new services. If successful, this project will significantly change how wireless networks and mobile applications of the future will be structured and built.<br\/> The education plan proposes to use educational applications such as shared note taking [24] and intelligent classrooms [1] among the early target applications to be used. In addition, the researcher plans to incorporate mobile and wireless education into the already existing mainstream undergraduate and graduate networking classes.","title":"CAREER: Towards an Efficient Ubiquitous Computing Infrastructure","awardID":"0092678","effectiveDate":"2001-06-01","expirationDate":"2007-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["458795"],"PO":["565090"]},"60653":{"abstract":"PROPOSAL NO.: 0102955<br\/>PRINCIPAL INVESTIGATOR: Zhou, Chongwu<br\/>INSTITUTION NAME: University of Southern California<br\/>TITLE: NER: Carbon Nanotube Devices and Integrated Systems<br\/><br\/><br\/>This is a proposal to design, build and evaluate various novel nanotube devices and<br\/>integrated systems. Specifically I propose to make n type field effect transistors (FET),<br\/>nanotube p-n junctions, and an integrated single-molecule CMOS inverter. This research<br\/>is exploratory in nature; however, if successful, will advance our understanding of the<br\/>fundamental properties of nanotubes and produce practical nanoscale devices for the real<br\/>world.<br\/>There has been a great deal of research into carbon nanotubes in the past few years. P<br\/>type field effect transistors have been demonstrated consisting of semiconductive<br\/>nanotubes with a silicon substrate backgate separated from the tube by a layer of SiO2.<br\/>Despite the utmost interest in developing n type FETs to enable nanoscale CMOS<br\/>circuits, the research effort has been hampered by lack of an effective doping method for<br\/>nanotubes. I propose to demonstrate a simple, effective and reliable method to<br\/>electrostatically dope nanotubes into n type, thus paving the way for n type FETs, p-n<br\/>junctions and integrated systems. This new method will employ TiO2 instead of SiO2 as<br\/>the gate dielectric. With a dielectric constant of 30 for TiO2, as compared to 3.8 for SiO2,<br\/>the gate utilizing TiO2 will be seven times more effective than previously reported, and<br\/>our preliminary analysis confirms that with a reasonable gate bias (~ 10 V), a nanotube<br\/>can be electrostatically doped into n type, thereby producing an n type FETs.<br\/>Furthermore, carbon nanotube p-n junctions will be demonstrated with a split-gate<br\/>technique, by depositing TiO2 onto a semiconductive nanotube contacted with source and<br\/>drain electrodes, and patterning two gate electrodes atop the TiO2, each covering half of<br\/>the tube. By controlling these two gate biases independently, one can tune the left half<br\/>tube into p type and the right half into n type, thus creating a p-n junction in between,<br\/>which provides an ideal system for studying the depletion and screening in one<br\/>dimension.<br\/>Finally, a simple integrated system will be demonstrated by attaching an electrode to the<br\/>center of a semiconductive nanotube in addition to the source and drain electrodes. This<br\/>center electrode divides the nanotube into two segments and serves as the output of the<br\/>circuit. The silicon substrate backgate with TiO2 dielectric layer will serve as the circuit<br\/>input and be used to tune one tube segment to function as an n type FET and the other<br\/>segment as a p type FET, thereby forming the worlds first single molecule inverter.","title":"NER: Carbon Nanotube Devices and Integrated Systems","awardID":"0102955","effectiveDate":"2001-06-15","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["442245"],"PO":["187585"]},"57617":{"abstract":"The ubiquity of communications technology is becoming more evident<br\/>every day. As the number of customers grows within each market, along<br\/>with their demand for higher and higher data rates, the need to use <br\/>available resources such as power and bandwidth as efficiently as possible <br\/>becomes paramount. Typically a communications system that is operating near <br\/>theoretical limits requires a receiver whose computational complexity<br\/>is prohibitively large. To reduce complexity, it is common to linearize<br\/>a portion of the receiver but this can severely reduce system performance<br\/>relative to theoretical potential. However, there is a class of nonlinear<br\/>receivers known as decision-feedback receivers whose complexity is essentially <br\/>no more than that of linear receivers but whose performance is often much <br\/>closer to that of optimal receivers. This research explores the <br\/>decision-feedback receiver structure as a practical means of realizing <br\/>resource-efficient communications systems. The research is also integrated <br\/>into educational activities at all student levels. Aspects of the research <br\/>are purposefully introduced to undergraduate students in the classroom,<br\/>during summer work programs, and through senior-level thesis advising. <br\/>This prepares them both technically and motivationally to enter industry<br\/>or to pursue further studies in graduate school. Graduate students are<br\/>provided an environment conducive to doing quality research in the exciting <br\/>field of communications, whether they choose careers in industry or academia.<br\/><br\/>The technical aspects of the research involve three components. First, it <br\/>is determined, at least in principle, how to combine a decision-feedback <br\/>receiver with error-control coding for a variety of important communications <br\/>channels. Then, within these decision-feedback frameworks analytical <br\/>relationships between available resources and system requirements are derived, <br\/>and resource-efficient systems are designed. Lastly, the transition is made <br\/>from theoretical random codes to actual encoders and decoders that are <br\/>simulated in software. Together these investigations provide communications <br\/>systems that are highly efficient in regard to their conservation of <br\/>resources, yet with low enough complexity to be amenable to implementation.","title":"CAREER: The Design of Resource-Efficient Communications Systems by Combining Decision Feedback with Error-Control Coding","awardID":"0093114","effectiveDate":"2001-06-01","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[148168],"PO":["348215"]},"61447":{"abstract":"Bioinformatics is the application of information technology to study and analyze biological and genetic data. Functional genomics, the second phase of the Human Genome Project, assigns function to DNA sequences, and is gearing up rapidly based on the new microarray technology. Microarray images make possible the simultaneous expressions of thousands of genes, and hold the keys to understanding of gene regulation and interaction, genetic pathways for diseases such as cancer, and finding the subpopulations most responsive to certain drugs. They are widely used in laboratories of academia and industry alike. The emergence of the microarray imaging technology puts image processing in an important position in functional genomics, and calls for interdisciplinary research between image processing and statistical data analysis. The investigators will be studying problems at exactly this interface.<br\/><br\/>The amount of data for even one microarray image is HUGE (>30 MB\/scan and two scans\/image). The need for compression is pressing because of the exponential explosion of its use and (despite of the cheaper disk space) the bottleneck on the conversion cost to tapes, the only reliable permanent storage. The investigators are addressing this need for microarray image compression with a progressive or multi-level coded data structure which is useful for transmission and statistical analysis. A case is made for lossy compression to obtain aggressive compression ratios such as 15:1 without much loss of statistical information. This research is also investigating the optimality question of statistical estimation based lossy compressed data with applications to microarray data. Finally, this research is using the statistical modeling principle based on data compression: Rissanen's minimum description length (MDL) principle, for gene clustering and other biological information extraction.","title":"Compressing and Analyzing Microarray Images for Genetic Information Extraction","awardID":"0106656","effectiveDate":"2001-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["521186"],"PO":["564898"]},"61317":{"abstract":"An effective way of providing error resilience for multimedia transmission in a<br\/>communication system with a relatively small reduction in efficiency is multiple<br\/>description coding (MDC), which assumes the existence of multiple independent<br\/>channels between the transmitter and receiver, each of which can be temporarily<br\/>down or can experience burst errors. With MDC several coded streams, called<br\/>descriptions, are generated and transmitted over different channels. At the<br\/>destination, if all of the streams are received error free, than the signal can<br\/>be reconstructed at its highest level of fidelity. However, if only one or a few<br\/>descriptions are received in a usable form, the receiver can still reconstruct<br\/>an acceptable signal. All multiple description coding methods to date assume an<br\/>on-off channel model between the transmitter and the receiver; each link is<br\/>either broken, in which case the transmitted symbols, or packets, are lost<br\/>completely, or it functions properly, in which case the packets are received<br\/>free of errors. This model is appropriate for Internet transmission, but it is<br\/>not appropriate for wireless channels.<br\/><br\/>This study replaces the parallel independent on-off channel model with a<br\/>wireless channel model, such as a Rayleigh fading model. Communication is<br\/>performed using multiple transmit and receive antennas over the channel. With<br\/>these models the signal at any of the receive antennas is the superposition of<br\/>the transmitted signals from each transmit antenna independently faded.<br\/>Therefore, even if the descriptions at the receiver side are completely<br\/>independent, the received signal at each antenna will include some information<br\/>from each description. This research involves finding the best multiple<br\/>description coding strategy for these channels, the theoretical limits of such a<br\/>scheme, and the efficiency with which it can be implemented.","title":"Multiple Description Coding with Correlating Transforms for Multiple Antenna Wireless Systems","awardID":"0105654","effectiveDate":"2001-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["173930","347935"],"PO":["564898"]},"77829":{"abstract":"The award supports research into the development of efficient automated coalition formation methods that are targeted to operate in inherently distributed situations with combinatorial characteristics---e.g. task and resource allocation and multi- agent planning and scheduling. Of specific interest are situations in which agents have different goals and each agent is trying to maximize its own good without concern for the global good. The first part of the research extends prior work on coalition formation under bounded rationality to new models of computation and communication limitations. More general settings will also be studied in which a coalition's value is affected by nonmembers actions. For this, powerful new strategic solution concepts will be used. A paradox of bounded rationality in multi- agent systems also will be further studied and resolved. A second part of the work will explore coalition formation, using protocols that incorporate constructive multi-agent search, iterative refinement via renegotiation, backtracking via decommitting, and avoiding local optima via specific more powerful agreement types. A broad set of protocols will be explored. Collusion will also be analyzed among agents that have probabilistic, conditional performance profiles for their local deliberation algorithms, as well as agents that can gain by explicitly coordinating their computations with others. Algorithms will be designed and tested, and applied to two real- world problems: distributed vehicle routing and multi-enterprise manufacturing.","title":"CAREER: Coalition Formation Among Self-Interested Computationally Limited Agents","awardID":"0234693","effectiveDate":"2001-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["561267"],"PO":["565227"]},"61901":{"abstract":"The main objective of this project is to organize UNIF 2001,<br\/>the 15th International Workshop on Unification.<br\/><br\/>Unification is concerned with the problem of identifying given <br\/>terms, either syntactically or modulo a given logical theory. <br\/>Syntactic unification is the basic operation of most automated <br\/>reasoning systems, and unification modulo theories can be used,<br\/>for instance, to build in special equational theories into <br\/>theorem provers. <br\/><br\/>UNIF 2001 will be the latest in a series of annual international<br\/>workshops on unification, the previous ones having been mostly in <br\/>Europe (France, Germany, Italy, and Spain) and twice in the US.<br\/><br\/>The aim of UNIF 2001, as that of the previous meetings, is to <br\/>bring together people interested in unification, present recent <br\/>(even unfinished) work, and discuss new ideas and trends in <br\/>unification and related fields.<br\/><br\/>In particular, it is intended to offer a good opportunity for <br\/>young researchers and researchers working in related areas to get <br\/>an overview of the current state of the art in unification theory<br\/>and get in contact with the experts in the field.<br\/><br\/>In addition to researchers from automated reasoning and term <br\/>rewriting, the traditional participants to UNIF, this year's <br\/>workshop will try to attract also researchers from theoretical <br\/>computer science working on unification algorithms for special <br\/>theories (such as associativity) where astonishing progress has <br\/>been achieved in the last two years.<br\/><br\/>The workshop will also try to facilitate, with travel awards and <br\/>registration fee waivers, the participation of young researchers <br\/>from the United States. The intent of this is to stimulate research<br\/>on unification in this country, as well as alert US researchers <br\/>working in automated reasoning and verification to recent results <br\/>in this field.","title":"15th International Workshop on Unification (UNIF 2001) to be held in Europe","awardID":"0108548","effectiveDate":"2001-06-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["521573"],"PO":["179846"]}}