{"6855":{"abstract":"9529950 Sitharam This project funds the speaker and participant costs for a special session, titled ``Foundations and Mathematical Aspects of Computer Science'', of the Central Section of the American Mathematical Society, Kent State University, November 3 -- 4, 1995. The purpose of this special session is to encourage interaction between mathematicians and the more theoretical computer scientists. Such interaction is currently rare, and would benefit both communities: the process of formalizing and solving many challenging problems that arise in computer science theory not only benefits from the mathematical formulation but often requires the development of new and deep mathematics. The aim of this session is to create awareness of these special connections and problems, and to open communication channels with mathematicians attending the AMS Meeting. In fact, both the formal session (with talks that outline problems in such areas as algorithms, complexity theory, computational learning theory, computational geometry, parallel computing models, probabilistic and randomized computation,and computer security and cryptography), and the planned open problem sessions (for an interchange of solution techniques and problems) should facilitate interdisciplinary collaborations between mathematicians and computer scientists. There are three NSF programs which are split funding this project: Theory of Computing Program of CCR, Computational Mathematics Program of DMS, and Algebra and Number Theory Program of DMS. ***","title":"Foundations and Mathematical Aspects of Computer Science (An AMS session) to be held at Kent State University, November,l995","awardID":"9529950","effectiveDate":"1995-11-01","expirationDate":"1996-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["488681"],"PO":["150516"]},"7409":{"abstract":"9531794 Luby This project funds speaker and participant costs for a workshop, titled ``Randomized Algorithms and Computation'', at ICSI, December 17 -- 22, 1995. The Workshop emphasizes applications to approximation algorithms for optimization and counting problems, coding theory with network and multimedia applications, cryptography and security, distributed computation, and derandomization of algorithms. The Workshop: (1) Brings together leading researchers from Europe, Israel, Canada and the U.S.; (2) Is being combined with the Weizmann Institute Workshop on ``Randomness and Computation'' (normally held in Israel in January); (3) Is organized in cooperation with the ESPIRT RAND Working Group. This project is a cooperative funding effort with support for European participants provided by the ESPRIT RAND-REC Project. ***","title":"Workshop at ICSI: On Randomized Algorithms and Computation, December 17-22, l995, Berkeley, California","awardID":"9531792","effectiveDate":"1995-11-15","expirationDate":"1996-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["74796"],"PO":["150516"]},"6863":{"abstract":"This is a proposal to hold a workshop involving about forty leading researchers from academia and industry to discuss: 1) the importance and value of Structured Design Methods for MEMS; 2) the research opportunities in this area, and, 3) the likely increase in effectiveness of MEMS design utilizing these methods.","title":"A Workshop on Structured Design Methods for MEMS; November 12-15, 1995, Pasadena, California","awardID":"9529977","effectiveDate":"1995-11-01","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["96648"],"PO":["549626"]},"1080":{"abstract":"The goals of this research are to design fast, precise parts feeders and to improve nonprehensile robotic manipulation. The two goals are closely related. A good architecture for a parts feeder exploits both parallelism and dynamic contact, by pipelining fast-acting low-degree of freedom manipulators along the feeder. Nonprehensile manipulation of objects by humans or animals often involves dynamic contact in which the object undergoes a series of partial grasps, shuffled back and forth between various contacts. The key to fast nonprehensilemanipulation of parts is controlling part motions through moving and accelerating contacts. This research builds a set of analysis tools that describe how the motions of accelerating constraints affect the effective forces felt by the parts being manipulated. These analyses take careful account of contact and friction, plus any forces already acting on the part, such as gravity. The resulting tools will allow a planner to produce control algorithms for the feeder, and thus dynamically reconfigure the feeder as part shapes change or errors appear. In traditional feeder design, much of the mechanics of the task has been compiled into hardware, in the form of fixed feeder gates and orienting shapes. At the other extreme, general purpose robots have suffered from too much generality and too little reliable software. An important intermediate architecture consists of a sequence of simple manipulators under software control. This research will explore feeders using the palm manipulation paradigm. As parts pass through a feeder, a sequence of low-degree of freedom devices will orient the parts using nonprehensile dynamic contacts. Since the configurations and motions of the devices are under software control and since the devices are easy to program by virtue of having low degrees of freedom, the feeder should be able to accomodate las t-minute part changes with relative ease.","title":"Designing Fast Parts Feeders Using Acceleration-Based Non-Prehensile Manipulation","awardID":"9503648","effectiveDate":"1995-11-15","expirationDate":"2001-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["196088"],"PO":["179262"]}}