{"82417":{"abstract":"Comprehensive and computational models of human performance have both scientific and practical importance to human-computer system design. This project will make a significan contribution in the area of HCI modeling. The PI will expand a computational model and a simulation technology (implementation) called Queueing Network-Model Human Processor (QN-MHP) he has been developing. QN-MHP is unique, in that it integrates two complementary approaches to cognitive modeling: the procedure and production systems approach (exemplified by the MHP\/GOMS family of models, ACT-R, CAPS, EPIC, and SOAR), and the queueing network approach. Procedure and production systems models have achieved great success in modeling, and in generating the detailed procedures and actions that a person might take in performing, a wide range of tasks; their shortcoming is that although they employ mathematics to analyze specific aspects of their models, they lack mathematical theories to represent the overall structure of their models. The queueing network model is able to integrate a large number of influential mathematical models of mental structure as special cases (such as Sternberg's serial stages model, McClelland's cascade model, and Schweikert's critical path network model), and is in general well suited for modeling dynamic and complex tasks and architectural arrangements of processes; as a mathematical theory alone, however, queueing networks cannot be used to generate detailed actions of a person in specific task situations, lacking procedural knowledge a person may employ in accomplishing his\/her specific goals. QN-MHP integrates these two approaches by expanding the three discrete serial stages of the MHP into three continuous-transmission subnetworks of a queueing network, by defining each server with procedure functions, and by using a GOMS-style method for task analysis. In this project, the PI will use extensive driving simulator data as a testbed to (1) study different methods of modeling concurrent tasks with QN-MHP; (2) apply queueing network theory such as optimal network load balancing and server scheduling in multitask modeling; (3) perform time-series modeling and visualization of the relationship between queueing network indices such as network sojourn time and server congestion with human performance data such as time, error, and mental workload; (4) further develop QN-MHP to cover a broader range of human performance such as providing certain servers with production capabilities for problem solving; and (5) further develop the simulation technology of QN-MHP.<br\/><br\/>Broader Impacts: The QN-MHP simulator is implemented in ProModel, a widely used software package that requires minimal learning time and allows an analyst to visualize in real time the QN-MHP internal network processes, in addition to the final statistical outcomes. These features are valuable not only for interface analysis, but also for promoting teaching and training in cognitive analysis and modeling. This software and other research results will be made readily available by the PI to practitioners, researchers, and educators. With the proliferation of life-critical multimodal, multitask HCI interfaces such as in-vehicle and aviation devices, QN-MHP will significantly impact system safety and product usability.","title":"Queueing Network-Model Human Processor (QN-MHP): A Computational Model and a Simulation Technology for Analyzing Human Multitask Performance in Human-Computer Systems","awardID":"0308000","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[214889],"PO":["565227"]},"82539":{"abstract":"This is a collaborative between NSF\/ANIR and DoE. The purpose of this workshop is to discuss challenges in cyber-security in large-scale networks and identify impediments and deployment obstacles of security on a large scale.<br\/><br\/>This workshop has potential to develop a long-term research and development vision to address not only the technical impediments to large scale deployment of cyber-security, but also identify the technical challenges and develop strategies to address these impediments.","title":"Workshop: Scalable Cyber-Security Challenges in Large-Scale Networks: Deployment Obstacles","awardID":"0308639","effectiveDate":"2003-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["450982"],"PO":["565090"]},"80736":{"abstract":"Measurement-based network monitoring and surveillance is an important area for providing reliability and security to IP network infrastructure. A challenge is how to develop scalable monitoring approaches.<br\/><br\/>This Project will investigate the scalability and performance of measurement-based network monitoring. At the high level scalability relates to the growth rate of monitoring resource with respect to the size of a network. The performance characterizes the accuracy of network monitoring. The scalability and performance together impact the feasibility of such approaches to large networks.<br\/><br\/>The PI will use a statistical learning framework to investigate the issues of scalability and performance. She will formally define and analyze scalability, and provide understanding on when and why scalability may be achieved. She will then investigate the trade-off between scalability and performance, and provide guidelines for developing good measurement-based approaches for large networks.<br\/><br\/>Although there have been many efforts to develop measurement-based methods for network monitoring, the scalability and performance issues have been investigated little. Meanwhile, though statistical learning theory has been applied to many areas, it has not been widely used in measurement-based network monitoring. The proposed investigation hopes to benefit measurement-based network monitoring, and to enrich the statistical learning theory also. This research will be done in Collaboration with Anwar Elwalid at Bell-Labs Lucent Technologies.","title":"A Statistical Learning Framework for Investigating Scalability and Performance of Measurement-based Network Monitoring","awardID":"0300605","effectiveDate":"2003-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}}],"PIcoPI":["432210"],"PO":["563109"]},"87083":{"abstract":"SGER: A Testbed for eRulemaking Data<br\/><br\/>This small grant will support a collaborative, multi-disciplinary planning project to explore the potential application of text retrieval, text clustering, text summarization and topic threading research tools in the area of Federal government rulemaking over the Internet. Rulemaking is the process of considering public opinion before issuing final detailed implementation rules in response to laws passed by Congress, Erulemaking is the collection of public comments in digital form, including email, phone, and fax. One issue that the work will begin to address is the problem of large scale (greater that 100,000) submitted comments.","title":"SGER COLLABORATIVE: A Testbed for eRulemaking Data","awardID":"0328618","effectiveDate":"2003-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["258114"],"PO":["371077"]},"88062":{"abstract":"Robotics and Computer Vision Program<br\/><br\/>Abstract<br\/><br\/>ID: 0334822 <br\/>P I: Kakadiaris, Ioannis A. Organization: University of Houston <br\/>Title: 2003 Workshop on Robotics and Computer Vision: PI Meeting <br\/><br\/>This project is to support about 130 Robotics and Computer Vision PIs to participate in the PI Workshop to be held in Las Vegas, NV on Oct. 27 and 28, 2003. The primary objectives are to report and share the research progress; to explore collaboration; and to provide research directions in Robotics and Computer Vision areas.","title":"2003 Workshop on Robotics and Computer Vision: PI Meeting","awardID":"0334822","effectiveDate":"2003-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["351676","513187","554348","460591"],"PO":["317663"]},"83190":{"abstract":"The sizes of problems that need to be solved in modern applications<br\/>have grown enormously. Sampling to draw a (small) subset of the data<br\/>to store in main memory and process in detail is thus a natural<br\/>alternative to computing on the entire data.<br\/>The project addresses the questions of how well the answers from a<br\/>sample approximates answers to the full problem for many optimization<br\/>problems that go under the name of Constraint Satisfaction Problems. <br\/>The project also considers problems where the input data consists of<br\/>matrices or higher dimensional arrays. Here adaptive sampling (where<br\/>the probability of sampling a piece of the data depends on its<br\/>relative importance) has been successfully used by the PI and others<br\/>recently. The existing results are to be improved. Adaptive sampling<br\/>calls for making more than one pass through the data. The project will<br\/>study models of computation, where the number of passes is measured as<br\/>an important resource. This is expected to contribute to the<br\/>discussion of models to handle large data.<br\/><br\/>A third part of the proposal is to continue the <br\/>PI's study of rapidly mixing Markov Chains, both<br\/>by developing new general techniques and applying to<br\/>specific problems like the computation of volumes of<br\/>convex sets.<br\/><br\/>Broader Impact: The research is expected to have broad<br\/>impact since the processing of massive data via sampling is of<br\/>enormous importance in modern computing. The<br\/>PI teaches specialized courses at Yale and <br\/>hopes to disseminate the results of<br\/>the research to students through the courses.","title":"Sampling on the Fly From Massive Data","awardID":"0310805","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["320878"],"PO":["499399"]},"83080":{"abstract":"DMS-0310354<br\/>Satyan Devadoss<br\/><br\/>This collaborative project funded under DMS-0310642 and <br\/>DMS-0310354 is a CARGO full team award made under solicitation <br\/>http:\/\/www.nsf.gov\/pubs\/2002\/nsf02155\/nsf02155.htm.<br\/><br\/>Geodesists and computational geometry specialists use different <br\/>mathematical tools for building surfaces from sampled points. One part of <br\/>this project (DMS-0310642) encompasses cross-fertilization of tool <br\/>development along with merging and extension of the underlying mathematical <br\/>theories. The mathematical development will address issues in statistical <br\/>adjustment theory, meshing and other computational geometry applications, <br\/>and modified polyhedral Morse theory. Another part of the project <br\/>(DMS-0310354) deals with exposing and equipping undergraduates to work on such <br\/>problems by offering courses and summer REU workshops. The mission is to <br\/>involve research at all levels, based on the interplay of fundamental <br\/>ideas, such as curvature, polyhedral geometry, graphs on surfaces, and <br\/>combinatorial topology, eventually leading to advanced topics such as noise <br\/>handling in geodetic data, Morse theory, mesh generation of surfaces, and <br\/>smoothing.<br\/><br\/>Using statistical adjustment methods, traditional geodesists fit smooth <br\/>surfaces to noisy surface data. Using computational geometry, our computer <br\/>scientists have begun developing and will continue to develop efficient <br\/>algorithms for finding meshed surfaces that are close to and provably <br\/>homeomorphic to densely sampled smooth surfaces. The interplay between <br\/>differential and discrete geometry has sparked a renewed interest among <br\/>mathematicians and theoretical computer scientists to find algorithms for <br\/>computing topological invariants and for examining properties of surface <br\/>decompositions and of graphs on surfaces. The research offers challenges <br\/>to graduate students, undergraduate students, and research faculty alike.","title":"Geodetic Surfaces: Understanding Their Geometry and Topology","awardID":"0310354","effectiveDate":"2003-05-01","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["216726"],"PO":["565280"]},"87480":{"abstract":"Proposal Number: 0331343<br\/>Title: Software Engineering Pioneers Symposium: On Doing Work of Lasting Value<br\/>PI: Stuart R. Faulk<br\/><br\/>The Pioneers Symposium will explore the question \"What does it take to do Software Engineering research of enduring value?\" Of the many works published in Software Engineering over the past 25 years, relatively few of them remain important today. Those few works that continue to be worth reading have met the test of time, demonstrating lasting value to both researchers and practitioners in the field.<br\/><br\/>The Pioneers' Symposium will provide a forum in which Software Engineering's next generation has the opportunity to learn from some of the field's preeminent contributors what it takes to recognize and to do work that exhibits this kind of lasting value. The Symposium is primarily targeted to graduate students and new faculty beginning their research or careers. Funding under this proposal will be used to support attendance by students and faculty who, for economic reasons, might otherwise not be able to attend.","title":"Sofware Engineering Pioneers Symposium - ICSE 03","awardID":"0331343","effectiveDate":"2003-05-15","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["425261"],"PO":["564388"]},"78560":{"abstract":"The common theme of promoting storage systems as a discipline distinct from databases, operating systems, and distributed systems unites the research and educational goals of this project. As its own discipline, storage systems will attain prominence in academia commensurate with storage's importance to computing. Storage limits the performance of most applications, holds enterprises' most valuable assets, and consumes the majority of IT dollars spent. Training storage specialists to serve the IT community and creating software to increase the manageability and performance of storage is imperative.<br\/><br\/>The research component of this project addresses the inability of large-scale storage systems to share persistent data. Each global-scale system owns data and isolates that data from unaffiliated computers. This project will develop a syndication protocol that allows storage systems to migrate, share, and replicate data interactively. Syndication is not an access protocol; it does not provide data to users and applications. Rather, syndication enables storage servers and data stores to transfer and share the management of persistent data. <br\/>Syndication decouples data from software systems, which breaks down the boundaries between access to data on a global scale and access to data anywhere on the globe.<br\/><br\/>The educational component of this project develops a curriculum to train storage systems specialists within an eight course Master's degree. The sequence of courses organizes knowledge specific to the management of persistent data, culling it out of many other disciplines. The curriculum integrates classwork with Internet-based educational software systems that support mobile, ad-hoc, and resource limited classrooms.","title":"CAREER: Interoperation Among Heterogeneous Global-Scale Storage Systems","awardID":"0238305","effectiveDate":"2003-05-15","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["551737"],"PO":["565272"]},"87461":{"abstract":"0331276<br\/>Fred Roberts, DIMACS<br\/>Workshop on Information Processing in the Biological Organism<br\/><br\/><br\/><br\/>A workshop on Information Processing in the Biological Organism will bring together internationally known experts in systems biology. The workshop will investigate information processing in biological organisms from the general point of view of systems biology. The workshop will discuss model systems concerning information processing in the biological organism, the mathematical foundations and algorithms of broad and central utility for this topic, the next generation of reference resources needed for it, and how the topic might inform other disciplines, including computer science. Issues to be emphasized include gene-to-product information flows, signal fusion within the cell, cell-to-cell communication, and information flow at the system level, including environmental interaction. A report summarizing the workshop recommendations will be presented to the Fall BISTIC Symposium.","title":"Workshop on Information Processing in the Biological Organism","awardID":"0331276","effectiveDate":"2003-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}}],"PIcoPI":["264120"],"PO":["565136"]},"83161":{"abstract":"DMS-0310645<br\/>Fuhua (Frank) Cheng<br\/><br\/>This is a CARGO incubation award made under solicitation <br\/>http:\/\/www.nsf.gov\/pubs\/2002\/nsf02155\/nsf02155.htm.<br\/>This grant provides funding for the development of necessary<br\/>mathematical theories and geometric algorithms to support<br\/>subdivision surface based one-piece representation, i.e.,<br\/>representing the final object in a design process with only<br\/>one subdivision surface, no matter how complicated the object's<br\/>topology or shape. Hence, the number of parts in the final<br\/>representation is always the minimum: one. The research requires<br\/>studies in three areas: representation refinement, representation<br\/>conversion and representation joining. The aim for representation<br\/>refinement is to develop new vertex generation schemes and<br\/>topological structures that allow local refinement of a subdivision<br\/>surface's control mesh while preserving the crack-free property of<br\/>the refining process. The aim for representation conversion is to<br\/>develop conversion algorithms for subdivision surfaces of different<br\/>type or subdivision surfaces of the same type but whose control<br\/>meshes are of different topology. The aim for representation<br\/>joining is to develop direct and indirect joining techniques that<br\/>can be iteratively applied to join different component surfaces of<br\/>an object into a single surface.<br\/><br\/>If successful, the results of this research will significantly<br\/>shorten the construction process of a free-from surface because<br\/>one-piece representation makes Boolean operations more efficient<br\/>and, consequently, increase the productivity of a design engineer.<br\/>Actually, in addition to their roles in one-piece representation,<br\/>the results in the first area will also significantly improve the<br\/>current art of subdivision surface theory. They would not only<br\/>include current refinement techniques as special cases, but also<br\/>provide more powerful mesh refining rules which allow both local<br\/>and adaptive refinement of subdivision surfaces. The results in<br\/>the second area will also make it possible for a CAD\/CAM system to<br\/>include subdivision surfaces as a new and yet more general free-form<br\/>surface modeling tool because B-splines and NURBS are special cases<br\/>of subdivision surfaces.","title":"Subdivision Surface Based One-Piece Representation","awardID":"0310645","effectiveDate":"2003-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["254434"],"PO":["565280"]},"87672":{"abstract":"This proposal is to support a workshop to elicit technical and policy assumptions, determine the state-of-the-art in radio hardware and software technologies, and identify what the fundamental and practical limits of future technological alternatives are - both in short term and long term. The result of the workshop will be a report covering the topics considered and recommendations of actions for NSF and the research community.","title":"The Future of Spectrum: Technologies and Policies Workshop; May 28-29, 2003, Washington, DC","awardID":"0332249","effectiveDate":"2003-05-01","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["421842","250082"],"PO":["434241"]},"78476":{"abstract":"Self-assembly is the process by which simple objects <br\/>spontaneously assemble into complexes. <br\/>It is expected to ultimately become <br\/>an important technology at the level of atoms and<br\/>molecules. The development of researches in programmable<br\/>self-assembly is reaching the stage that we have<br\/>to understand it mathematically in order<br\/>to take full advantage of this new tool.<br\/>The goal of this research is to study <br\/>the computational aspects of self-assembly. <br\/><br\/>The objectives of this project includes: <br\/>(1) Solving concrete problems in the Tile Assembly Model,<br\/>including but not limited to<br\/>finding an approximation algorithm for the Minimum<br\/>Tile Set Problem (MTSP)<br\/>and characterizing the shape languages.<br\/>(2) Exploring different modelings of self-assembly, which<br\/>will give a more accurate abstraction of <br\/>the experimental results and will reflect the massive parallelism <br\/>in molecular\/DNA computing.<br\/>(3) Studying the connections between <br\/>the algorithmic self-assembly and the classical theory<br\/>of computation, especially the communication theory<br\/>and the resource-bounded Kolmogorov complexity.<br\/><br\/>This CAREER project will integrate teaching activity <br\/>into the research of self-assembly.<br\/>The PI will offer graduate level courses in <br\/>molecular computing and closely-related fields such as <br\/>bioinformatics, and introduce the research<br\/>to undergraduate and graduate students in general theory courses.<br\/>This project will adopt the active learning techniques in teaching.<br\/>It is expected that the project will contribute to understanding<br\/>the engineering power of self-assembly, and to disseminating<br\/>the current research information to students as well.","title":"CAREER: Research in Algorithmic Theory of Self-Assembly","awardID":"0237845","effectiveDate":"2003-05-15","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["518429"],"PO":["499399"]},"87992":{"abstract":"EIA-0334333<br\/>K. Birgitta Whaley<br\/>Univ of California,Berkeley,<br\/><br\/>A meeting is proposed of the principle (PI) and co-principal (co-PI) investigators working<br\/>in Bio-computation and Quantum Information Sciences who are currently funded through the<br\/>NSF Information Technology Research and QuBIC Programs. The meeting will take place at<br\/>the Fort Lauderdale Marina Marriott in Fort Lauderdale, Florida, May 13-16, 2003.","title":"Workshop for PIs and Co-PIs of NSF Information Technology Research (ITR) and Quantum and Biologically Inspired Computing (QuBIC) Projects","awardID":"0334333","effectiveDate":"2003-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["515838"],"PO":["565223"]},"79863":{"abstract":"The Physics Department of the University of California at Davis will host undergraduates for a summer research experience. The ultimate goal is to encourage students to continue studying physics through and beyond the college level. The program will give students views of physics not seen in typical coursework: first-hand experience of the joys and frustrations of research, and information about several types of physics careers. The program will support ten students per year for the next three years, with half recruited from two-year and four-year colleges in northern California and the remainder recruited nationally from four-year colleges and universities. The heart of the program is a research project, supervised by one or more faculty members, in condensed matter physics, biophysics, geophysics, environmental physics, nuclear physics, high energy physics, or cosmology. Supplementary activities will include introductory talks giving overviews of current physics research areas, lunch meetings to encourage discussion about the students' research projects, and visits to nearby national laboratories and industry to illustrate careers open to trained physicists. The program will conclude with research presentations by the students, given at a combined session with another ten-student summer program aimed at science and engineering undergraduates from community colleges.","title":"REU Site in Physics at UC Davis","awardID":"0243904","effectiveDate":"2003-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["539097"],"PO":["561720"]},"87387":{"abstract":"CiteSeer, a computer science document search engine and digital library, has become over the last three years the search engine of choice for exploring and accessing computer science documents for computer scientists and related disciplines. Not only can the searcher find actual documents but also many other related linked aspects of document information such as citations, relevance of citations, active bibliography and co-citations. CiteSeer is so popular with the computer science community that it gets over 100,000 hits and thousands of document downloads a day. CiteSeer currently has over 500,000 documents with over 10 million citations. The goal of this research is to explore methods for making CiteSeer a permanent research fixture for the computer science community. Archiving and URL permanence methods, plus methods for enhanced archive mirroring and archive scaling will be investigated. Availability of CiteSeer resources is promoted through exploratory APIs (application programming interfaces) for researcher data access. In addition, new linked information such as organizations and individuals in acknowledgements will be correlated with citation rankings. Exploratory research investigating new document crawling algorithms and procedures further boost the efficiency and functionality of CiteSeer. This project will have broad impact by providing computer scientists enhanced access to the computer science literature and promoting the participation of the researchers in building the CiteSeer by new additions to the document database.","title":"SGER: A Digital Library Archive for Computer Scientists","awardID":"0330783","effectiveDate":"2003-05-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["562561"],"PO":["563751"]},"79665":{"abstract":"0243284<br\/>Atanas Radenski<br\/>Chapman University<br\/><br\/>This project will make contributions to the area of component and object oriented languages and programming. The goal is to design, implement, and evaluate class overriding - a new code adaptation language mechanism that is intended to overcome the subclassing anomaly in evolving software components. An in-depth analysis of the subclassing anomaly will reveal and systematize its linguistic roots as found in compiled object-oriented languages. Class overriding will be designed to serve as a generic, language-independent method for anomaly-free component adaptation. Translation patterns for class overriding will define an implementation model with low run-time overhead.<br\/><br\/>This project is expected to have impact on the language design community and on the software architecture community. For the language design community, class overriding will be a linguistic mechanism that can be adapted to either new component-oriented languages, or to existing object-oriented languages, in order to enhance software component adaptability. The software architecture community will be able to employ the analysis of the subclassing anomaly to foresee and avoid possible adaptation anomalies in evolving object-oriented software components.","title":"RUI: Class Overriding for Anomaly-Free Component Adaptation","awardID":"0243284","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[207416],"PO":["564388"]},"79797":{"abstract":"Institution: Montana State University<br\/>Proposal Number: EIA - 0243736<br\/>PI: Denbigh Starkey<br\/>Title: A Computer Science REU for Tribal College Students<br\/><br\/>This project supports an REU Site that provides a summer research experience for students from Montana's tribal colleges, with the intention of encouraging participants to continue their education at a university after completion of their two- or four-year current degrees. The REU program supports eight students per year; six in the summer program, and two year-round. The students work on the graphics and visualization components of a five-state precision agriculture project, interacting not only with the PI of this REU proposal (who is graphics and visualization team leader for the precision agriculture project) but also with researchers and producers associated with the project. The participants are immersed in 3D graphics and programming, usually for the first time.","title":"A Computer Science REU for Tribal College Students","awardID":"0243736","effectiveDate":"2003-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":[207755],"PO":["519302"]},"87178":{"abstract":"Abstract<br\/>March 21 2003<br\/><br\/>Southwest Quantum Information and Technology: 2003 Student Summer School and Retreat<br\/>Ivan H. Deutsch<br\/>University of New Mexico<br\/>0329339<br\/><br\/><br\/>The Southwest Quantum Information and Technology (SQuInT) Network is a consortium of universities, national laboratories, and industry with the purpose to promote the exchange of scientific ideas and resources in the highly interdisciplinary field of quantum information science (QIS). Under this project, the 2003 student summer school and retreat is being held from June 15-19, 2003 in Asilomar State Park, California. A series of pedagogical lectures aimed at the beginning graduate students and new researchers in the field with special focus on computer science and engineering aspects of QIS with lectures regarding algorithms, complexity, and control theory are central to the program. A strong series of lectures on laboratory implementations in a variety of physical settings are also being presented. The close collaboration of theorist and experimenters in QIS is crucial to the success of the field and a hallmark of this SQuInT Network. This summer school is providing about 50 students from all over the country a valuable opportunity to network and build a strong community of future QIS researchers.","title":"Southwest Quantum Information and Technology: 2003 Student Summer School and Retreat","awardID":"0329339","effectiveDate":"2003-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["515838","544643","543493"],"PO":["565223"]},"84363":{"abstract":"ABSTRACT: EIA 0316105, CRA, B. York, PI<br\/><br\/>This award provides support for students and faculty from minority-serving institutions to attend and participate in \"The Richard Tapia Celebration of Diversity in Computing Conference 2003\", to be held in October 2003, in Atlanta, Georgia. Organized by the Coalition to Diversify Computing (CDC), the theme of this conference is \"Building Diverse Leadership in Computing\". The conference program includes refereed papers, poster sessions and panels in addition to invited plenary talks by some of the nation's outstanding scientists. The papers presented will be published in a proceedings journal. In addition, a one-day doctoral consortium is included in which Ph.D. students will present and discuss their work before a panel of experts during which the students will receive constructive feedback as well as career guidance. The conference is expected to be an unusual opportunity for the participants to interact with a diverse collection of world class researchers, be exposed to new concepts, ideas and state-of-the-art research, as well as to gain an understanding of the history of diversity in computing and to participate themselves in panels, posters and formal paper presentations.","title":"The Richard Tapia Celebration of Diversity in Computing Conference 2003","awardID":"0316105","effectiveDate":"2003-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["520681","353752","363758"],"PO":["289456"]},"87674":{"abstract":"EIA 0332251<br\/>Harvey Rubin<br\/>University of Pennsylvania<br\/>Project Summary<br\/><br\/><br\/>Biologically-Inspired Reliable Computing Systems:<br\/><br\/>Biologically-inspired computing seeks to understand and replicate some of the fundamental computational principles by which natural biological information processing systems operate. Traditional computing systems today are extremely brittle in situations for which they have not been explicitly designed. In comparison, biological systems are adaptable to new environments, can handle a large amount of uncertainty in their perception and processing of the surrounding world, and can collaborate with other biological systems to solve complex problems. Biological systems also have sophisticated protection and repair mechanisms. Is it possible for computing systems to display the same degree of robustness and reliability across a wide range of situations? What types of computational architectures and algorithms are needed to achieve this reliability? How can such systems be developed and organized to ensure they can deal with faults? How can these systems be put together to leverage their individual capabilities? Can their survivability be ensured? These are some of the questions this workshop seeks to address.<br\/><br\/>The workshop brings together researchers who work in areas close to biology and computer and information science to discuss how biological systems are able to achieve their robustness and reliability, and how some of these computing principles can be incorporated into artificial systems. The main focus of the workshop will be the reliability of biological computation and information processing, and will explore how this reliability is achieved in four areas: cognitive computing processes, development and self-organization, social interactions, and protection and immunity. The format will bring together researchers in each of these fields to delve into the relevant questions of how biological systems operate robustly and their applicability to computing systems.<br\/><br\/>The resulting presentations and discussions of the workshop will be made available through web-based publications as well as printed materials.","title":"NSF Conference on Biologically Inspired Computing","awardID":"0332251","effectiveDate":"2003-05-15","expirationDate":"2003-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}}],"PIcoPI":["461485"],"PO":["565223"]},"83352":{"abstract":"The measurement and assessment of technological innovation has attracted the interest of many actors. As reflected in national science and technology statistical publications, the demand for reliable innovation indicators has steadily increased over recent decades, both for macro and micro-economic analysis, and for policy use. The goal of the proposed research is to leverage advances in data\/text analysis and visualization techniques to support knowledge discovery and to identify knowledge transfer based on (NSF) project funding and (USPTO) patent databases. As indicators of inventive output are mostly based on patents, efficient and innovative methodologies and frameworks for the analysis of the information related to technological innovation stored in patent databases are needed. Information about trends in NSF funding can be derived from the analysis of the NSF award abstracts and other relevant data. The research challenges are: uncertainty about the validity of using the award and patent data to approximate science and technology development, difficulty in intuitive presentation of analysis result, and precise identification of emerging topics and concepts in the NSF award and patent databases. This exploratory project aims to examine both technical issues and the fundamental hypotheses involved. Major information and computer science techniques adopted include: text-based linguistic analysis, 2D\/3D knowledge map visualization, citation network analysis, and graphical display and analysis of temporal patterns. The current testbed is related to analysis of nano science and technology research in USA and other research described at http:\/\/ai.bpa.arizona.edu\/.","title":"SGER: Intelligent Patent Analysis and Visualization","awardID":"0311628","effectiveDate":"2003-05-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["548216"],"PO":["563751"]},"86993":{"abstract":"SGER: A Testbed for eRulemaking Data<br\/><br\/>This small grant will support a collaborative, multi-disciplinary planning project to explore the potential application of text retrieval, text clustering, text summarization and topic threading research tools in the area of Federal government rulemaking over the Internet. Rulemaking is the process of considering public opinion before issuing final detailed implementation rules in response to laws passed by Congress, Erulemaking is the collection of public comments in digital form, including email, phone, and fax. One issue that the work will begin to address is the problem of large scale (greater that 100,000) submitted comments.","title":"SGER COLLABORATIVE: A Testbed for eRulemaking Data","awardID":"0328175","effectiveDate":"2003-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["543277"],"PO":["371077"]},"78820":{"abstract":"Recent breakthroughs in biotechnology and sequencing create numerous new opportunities for comparative analysis of complex genomic sequences. Comparative genomic analysis requires building databases and tools to address important biological questions including elucidating the molds of conservation and patterns of divergence that lead to species diversification, robustness, fitness, and taxonomical organization. Evolutionary selection creates variable rates of conservation on different functional sites thereby producing distinctive comparative signatures in different genomic regions. These signatures can be exploited by computational methods for an improved detection of functionally important regions such as protein-coding exons, RNA genes, promoters regions, initiation sites and 3'UTR regions. Since the pattern of conservation in coding regions is different from the pattern in intronic or intergenic regions, a comparative computational analysis can lead, in principle, to a significantly improved computational identification of genes in a target genome by using a reference genome. This work focuses on a systematic investigation of these fundamental questions with the goal of producing a prototype, modular and adaptive gene identification system that can be trained on different species. A modular and adaptive architecture for modeling genomic sequences and evolutionary alignment for comparative genomic analysis has three important features: a) A compositional organization that allows global model training for cross-species analysis of specific organisms. b) A novel mechanism to perform Bayesian adaptation of the model to the specific pair of orthologous genes being compared in order to refine the interpretation and thereby improve prediction accuracy. c) A flexible capability to integrate other sources of evidence for comparative gene identification that include matches to proteins, ESTs and gene expression databases. There are a number of broad implications of the proposed research, cataloging the evolutionary patterns that can be extracted from comparative analysis and discovery of novel genes, building a highly usable software prototype for comparative genomic analysis that will be distributed freely to the academic community or order to improve the annotation accuracy of genomic regions; Producing comparative databases of functional sites that can be used for evolutionary analysis and biological research, and training a new generation of computational biology researchers to attain a deeper understanding of biological processes as well as sophisticated computational methodologies.","title":"Comparative Genomic Analysis Using Evidence Integration Frameworks","awardID":"0239435","effectiveDate":"2003-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["335993","522466"],"PO":["561879"]},"86972":{"abstract":"SGER: A Testbed for eRulemaking Data<br\/><br\/>This small grant will support a collaborative, multi-disciplinary planning project to explore the potential application of text retrieval, text clustering, text summarization and topic threading research tools in the area of Federal government rulemaking over the Internet. Rulemaking is the process of considering public opinion before issuing final detailed implementation rules in response to laws passed by Congress, Erulemaking is the collection of public comments in digital form, including email, phone, and fax. One issue that the work will begin to address is the problem of large scale (greater that 100,000) submitted comments.","title":"SGER COLLABORATIVE: A Testbed for eRulemaking Data","awardID":"0327979","effectiveDate":"2003-05-01","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V709","name":"EPA-TESTBED TECHNOLOGY DEVELOP"}}],"PIcoPI":["541869"],"PO":["371077"]},"80384":{"abstract":"Solution algorithms for difficult discrete optimization problems often rely on problem-specific cutting-planes to improve the associated linear-programming relaxations. It is standard practice to look for cutting planes that match prescribed templates, where the templates are drawn exclusively from the set of linear inequalities that induce facets of the convex hull of the solution set for the problem. In the traveling salesman problem (TSP) research of Applegate, Bixby, Chvatal, and Cook, an alternative to this template paradigm for cutting planes was proposed. The new procedure is called local cuts and it played a crucial role in the solution of a set of large-scale TSP instances, including a 13,509-city example and a 15,112-city example. The goal of this project is to extend the local-cut procedure to other classes of discrete optimization problems and to general mixed-integer programming models. The local-cut procedure consists of selecting a family of linear mappings taking the original solution space down to one of low dimension, and selecting a super-set of the image that is accessible, that is, it is easy to optimize linear functions over the super-set. Using delayed column-generation, cutting planes for the accessible set are determined; these cuts are then mapped back to cutting planes in the original set of variables. This project will continue the investigation of local cuts for the TSP, but a major part of the work will be to develop the methodology for other classes of problems, including mixed-integer programming models, vehicle routing, steiner trees, and stable sets.<br\/><br\/>Broader Impact. Discrete optimization is used to solve practical problems that involve choosing the best alternative from a field of possibilities; it has broad applications in nearly every segment of the economy. The local-cut techniques developed in the proposed project will permit the solution of larger, more-complex problem instances, allowing users to be more aggressive in building models to represent the details of their applications.","title":"Local Cuts in Discrete Optimization and Mixed-Integer Programming","awardID":"0245609","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["379633"],"PO":["351577"]},"83288":{"abstract":"Abstract<br\/>0311311<br\/>Sennur Ulukus<br\/>U of Maryland, Coll Park<br\/><br\/>The increase in the number of users, and proliferation of the services which require high bit-rates, combined with the scarcity of the wireless bandwidth, make it more important than ever to develop<br\/>technologies, techniques and algorithms to make the most efficient use of the available resources. The goal of this research is to understand and determine the ultimate capacity limits of wireless communication networks, and develop techniques and algorithms to achieve or approach these capacity limits. An important consequence of this research will be the development of principles and guidelines for the design of<br\/>future wireless networks.<br\/><br\/>The focus of this research is the design of, and algorithm development for, the physical and medium access control (MAC) layers of multiuser vector multiple access channels. This research targets realistic and<br\/>important system conditions of multiple-transmitter multiple-receiver networks (multi-cell cellular, and more generally, ad-hoc networks), asynchronous reception, dispersive channels with nter-symbol-interference(ISI), and fading channels. The investigator studies the design of optimum<br\/>multiuser transmit strategies with the aim of maximizing the overall network capacity. Here, the transmit strategy means, for each user, the decision of the user to transmit or not, at any given fading and interference state, and the power and the vector it uses in its transmission, if it decides to transmit. <br\/>The receiver optimization is incorporated as well, when applicable. The investigator studies<br\/>the development of feedback- and measurement-based, highly-adaptive, distributed and iterative algorithms for the construction of network-wide optimum transmit strategy ensembles.","title":"Distributed Signal Design and Optimum Transmit Strategies for Wireless Networks","awardID":"0311311","effectiveDate":"2003-05-15","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["548269"],"PO":["564898"]},"79944":{"abstract":"Institution: Auburn University<br\/>Proposal Number: EIA - 0243862<br\/>PI: Saad Biaz<br\/>Title: Collaborative Proposal: REU Site for Pervasive and Mobile Computing<br\/><br\/>Collaborator:<br\/><br\/>Institution: University of Alabama - Tuscaloosa<br\/>Proposal Number: EIA - 0244156<br\/>PI: Joel Jones<br\/><br\/>This project supports a collaborative effort of two Computer Science departments in two universities to establish an REU site in Pervasive and Mobile Computing. The collaboration supports 16 undergraduate students per year at the two campuses who would not be otherwise exposed to research. This Site builds on complementary expertise of the two institutions and on existing collaborative research projects in pervasive and mobile computing. One university contributes expertise in wireless systems and in minority student education, and the other will contributes expertise in emergency reporting. <br\/><br\/>The multi-university pervasive and mobile computing project is developing a system architecture for integrating information appliances such as PDA's and 3G mobile phones into first-responders' operations in emergency situations. The goal of the research in which the undergraduates participate is to define not a particular <br\/>system but a framework for public-sector mobile data systems based on empirical data derived from ongoing development of such systems.","title":"Collaborative Research: REU Site for Pervasive and Mobile Computing","awardID":"0244156","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["426940","411195","254667",208191],"PO":["564181"]},"82200":{"abstract":"While head-mounted display (HMD) technologies have undergone significant developments and their functional benefits for 3D visualization have been recognized, they have suffered from tradeoffs and limitations in capability, which impose critical affects on visualization accuracy, user performance, and user safety. Chief among these problems is an ignorance of eye movement. Most state-of-the-art HMDs use head pose to approximate line-of-sight, which may cause a significant disparity between what users are intended to look at and what they actually see. The integration of eye tracking capability into HMDs would significantly improve display quality and user interface. In this project, the PIs will optimize the conceptual design of HMD-eye tracker integration from low-level optical configurations; the PIs expect to achieve by this means a more compact, comfortable, easy-to-use, and dependable system than would result from integration of off-the-shelf commercially available displays and eye trackers. The PIs will set up a comprehensive methodology to calibrate and quantitatively assess the testbed, and to quantify rendered and perceived depth\/size representations of virtual objects with and without eye tracking capability in the HMD; the PIs expect thereby to determine whether integration can significantly improve the performance of both eye tracking accuracy and display quality as it relates to accuracy and precision of registration of real and virtual objects in augmented environments. Finally, two pilot studies will be pursued. The first of these will explore the concept of a unique fovea-contingent display scheme which utilizes photonics technology to position a high resolution inset at the gaze point, innovatively with no moving parts, in order to address the trade-off between field of view and resolution existing in conventional HMDs. The second pilot study will investigate a \"pointing by looking\" visual interface in remote collaborative environments in which the focus of attention of a participant follows the point-of-regard of a remote collaborator, or vice versa.<br\/><br\/>Broader Impacts: This research will not only advance display quality and the user interface, but most importantly it will drive new and thrilling applications of augmented reality technology. In particular, the new HDM-eye tracker technology will lead to novel interactive interfaces for information retrieval, will provide more accurate eye-movement monitoring for human factors and vision research, will support improved assessment of behavior in virtual environments, and will afford new methods of interaction and communication for people with certain types of disabilities. The mixture of basic optical science and engineering, computer graphics, human factors, and hands-on experience with building a testbed will be an excellent interdisciplinary training ground for the graduate and undergraduate students involved.","title":"IIS\/HCI: Collaborative Research: Development and Assessment of Head-Mounted Fovea-Contingent Display Technology","awardID":"0307189","effectiveDate":"2003-05-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["561621"],"PO":["565227"]},"80297":{"abstract":"This project will develop of new control strategies for heating, ventilating, and air-conditioning (HVAC) systems that combine artificial intelligence and robust control theory. A primary objective of the work is to develop learning controllers, which provide (a-priori) guaranteed closed-loop stability even while the controller trains online. It is a follow-on project to NSF project 9804757, i8Robust Learning Control for Heating, Ventilating and Air-Conditioning Systems, it where several significant advancements in the state of the art were achieved.<br\/><br\/>The primary objectives of the proposed research are:<br\/><br\/>New analysis tools and algorithms, which allow for new theoretical approaches for learning including: Continuous learning algorithms; recurrent dynamic networks; and learned dynamic models.<br\/><br\/>New theoretical tools, including enhanced Integral Quadratic Constraints (IQCs) for improved speed and accuracy the more general classes of networks, and advanced systematic algorithms for tunneling, to facilitate navigation of the learning around regions of instability.<br\/><br\/>Design and test of more advanced robust reinforcement learning algorithms;<br\/><br\/>Extensive experimental study of the new tools being developed here for multi-input, multi-output (MIMO) robust reinforcement learning control, utilizing a recently developed experimental platform for heating, ventilating, and air-conditioning (HVAC) system control.<br\/><br\/>Disseminate in through conference and journal publications and by assisting colleagues at Korea Institute for Energy Research in conducting their own tests of these methods.<br\/><br\/>To accomplish these objectives, an interdisciplinary team has been formed consisting of a specialist in robust control from the Electrical & Computer Engineering Department, a specialist in reinforcement learning for neural networks from the Department of Computer Science, and a specialist in design, modeling and control of HVAC systems from the Mechanical Engineering Department.","title":"Robust Learning Control for Building Energy Systems","awardID":"0245291","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":[209137,"549818","506942"],"PO":["563109"]},"83135":{"abstract":"DMS-0310562<br\/>Yuanan Diao, Claus Ernst, Uta Ziegler<br\/><br\/>This is a CARGO incubation award made under solicitation <br\/>http:\/\/www.nsf.gov\/pubs\/2002\/nsf02155\/nsf02155.htm.<br\/>New applications of knot theory in biophysics and biochemistry have focused interest on <br\/>knotted molecules, that is, on physical knots of volume-occupying nature and particular <br\/>geometric shapes. A physical knot is modeled as a smooth closed curve with certain thickness. <br\/>The thickness of a smooth knot can be thought of, intuitively, as the radius of the rope <br\/>with which the knot is tied as tight as possible. In mathematical terms it is the largest <br\/>embedded normal tube around a smooth knot that does not intersect itself. The ropelength <br\/>of a (thick) knot is the quotient of its arc length over its thickness. The focus of this <br\/>proposed work is the challenging problem of finding good estimates of the minimum <br\/>ropelengths of various knots. For knots with small crossing numbers, computational <br\/>methods exist which estimate their ropelengths. The techniques used to obtain these <br\/>estimates cannot be extended to very large knots. Thus very few computational results <br\/>are available for knots with large crossing numbers. It is known that for any <br\/>nontrivial knot, its minimum ropelength is bounded above by a constant times its <br\/>crossing number squared. The PIs have recently improved this bound to a constant times <br\/>the crossing number (of the knot) raised to the three half power. However, <br\/>the PIs suspect that for most knots, their ropelengths are bounded by their <br\/>crossing numbers (times a constant) or less. So there seems to be a gap between <br\/>the proven bound and the actual minimal ropelengths of various knots. In this work, <br\/>the PIs will develop a computer program that is capable of computing a close estimate <br\/>of the minimum ropelengths of knots with large crossing numbers. This computer program <br\/>will make use of the algorithm used in establishing the upper bound of the three <br\/>half power mentioned above. <br\/><br\/><br\/>Some research in biophysics, chemistry and physics deals with long strings of molecules <br\/>that are knotted, for example, circular DNA or polymer chains. The type of knotting <br\/>often influences the properties and behavior of the molecules. To better understand the <br\/>properties of such molecules, this project proposes to examine the relationship between <br\/>the complexity of a knot and its physical length. This relationship can be formulated <br\/>into the following question: If one is given a rope of certain radius and wants to tie <br\/>a certain knot, how long does the rope have to be? For small knots, one can get a rough <br\/>idea by simply tying the knot and measuring how much rope it took. However for very <br\/>large knots that is not practical since it is not clear how to tie a knot with rope <br\/>in an optimal way. The proposed project involves the creation of a computer program <br\/>that - for many knots -checks lots of different ways how the same knot can be tied, <br\/>in order to find a close estimate to the minimum length of rope. The results of the <br\/>computer program will be used to hypothesize a general relationship between the <br\/>complexities and the lengths of knots.","title":"Computation of Rope Length of Large Thick Knots","awardID":"0310562","effectiveDate":"2003-05-01","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["450746","450745","450755"],"PO":["565211"]},"78405":{"abstract":"Demand for wireless communication services has been growing much faster than additional resources (such as bandwidth) are allocated. Besides scarce available bandwidth, wireless system designers have to deal with several unique challenges, not commonly found in wireline<br\/><br\/>networks, such as interference caused by transmissions and user specific time and frequency varying channels. Managing the limited resources through a harmonious design<br\/><br\/>of the physical and networking layers is a central problem in the design of wireless systems and a very relevant one. The intense research activity over the past decade addressing this issue can be<br\/><br\/>roughly dichotomized into two parts: the physical layer work focusing mostly on point to point communication and the networking layer work of resource allocation using an abstraction of the physical layer. Further, engineering design of wireless systems, for the most part, has centered around making individual point to point links reliable and developing a networking layer using an appropriate model of the physical layer. This project takes a fundamental physical layer view of the wireless network communication problems and sheds insight into novel design techniques<br\/><br\/>at both the physical and the networking layer, yielding a significant boost to the overall system capacity. One novel viewpoint is multiuser diversity, a form of diversity inherent in a wireless<br\/><br\/>network. In a system with many users whose channels vary independently, there is likely to be a user whose channel is near its peak at any one time. By scheduling transmissions only to users with<br\/><br\/>the best channel, multiuser diversity gain is harnessed. This form of \"opportunistic communication\" provides a sharp boost to the system throughput. Through the lens of multiuser<br\/><br\/>diversity, channel fluctuations are preferable, in sharp contrast to the point to point communication view. This project conducts a systematic study of the role of multiuser diversity: schemes to artificially induce and harness it. Other specific problems studied include a fundamental view of the multiple antenna downlink (broadcast) channel and an ad hoc networking model. Teaching is an integral part of this project and is partly carried out through the<br\/><br\/>development of four courses.","title":"CAREER: Opportunistic Communication: A Design Paradigm for Wireless Systems","awardID":"0237549","effectiveDate":"2003-05-01","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["523699"],"PO":["432103"]},"81980":{"abstract":"Energy-efficiency is vital for pervasive computing. Small, mobile<br\/>computers such as handhelds are battery powered. They must carefully<br\/>manage their limited energy supply in order to run demanding<br\/>applications for long periods of time. Pervasive computers are also<br\/>increasingly well-connected to the Internet by wireless networks.<br\/>However, connectivity is costly: communication is a large and growing<br\/>portion of their power budgets. Current data access mechanisms<br\/>exacerbate the problem---they substantially increase the energy cost<br\/>of communication because they are optimized for performance, not<br\/>energy-efficiency.<br\/><br\/>This research investigates how to build energy-efficient distributed<br\/>file systems for pervasive computing. The first step is building<br\/>measurement infrastructure that precisely captures the communication,<br\/>storage, and computation costs of data access. The next step is<br\/>characterizing the energy usage of existing distributed file systems<br\/>and identifying characteristics that increase energy-efficiency. The<br\/>final step is building a new, energy-efficient file system that<br\/>enables pervasive computers to maintain connectivity without<br\/>compromising battery lifetime. This research thus allows pervasive<br\/>computing devices to be incorporated into everyday activities. For<br\/>example, all-day battery life is essential for projects that deeply<br\/>integrate handheld computers into classroom activity.","title":"Energy-Efficient Data Access for Pervasive Computing","awardID":"0306251","effectiveDate":"2003-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["521047"],"PO":["560587"]},"82212":{"abstract":"Text classification is the automated assignment of text documents to pre-defined categories\/classes. Traditionally, a classifier is built using training documents labeled (often manually) with pre-defined classes. This classifier is then used to classify new documents into those classes. This classic model is called supervised classification because the training documents all have pre-labeled classes. Although this model is important, in practice it may not be applicable in some common situations. For example, given a set of documents of a particular class P (positive class) for training, one may want to classify a set M of mixed (unlabeled) documents that contains documents from class P along with other types of documents (negative documents) into documents from P and documents not from P. Since there are no labeled negative documents, the traditional classification techniques are inapplicable. This problem is called partially supervised classification (PSC). Existing methods for solving PSC are based on heuristics, which are prone to error. Researchers typically use the evaluation method for supervised classification to evaluate PSC techniques, which is inadequate because supervised classification approaches assume the availability of labeled negative documents. <br\/><br\/>The objectives of this project are to design a robust and principled technique to solve PSC, implement a system for PSC, devise a method to evaluate such techniques, and identify methods for determining the minimum number of labeled documents needed to achieve the optimal accuracy in order to reduce manual labeling efforts. The algorithms and systems developed by this project will be used in a graduate course and put on the Web for other researchers to use in their research and teaching. The results of this research should be widely useful because the identification of targeted information\/documents is of great value in this information age.","title":"On Partially Supervised Text Classification","awardID":"0307239","effectiveDate":"2003-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}}],"PIcoPI":["483410"],"PO":["565215"]},"83224":{"abstract":"This proposal is about pseudorandomness and its relationship with coding <br\/>theory and cryptography. A fundamental object in the study of <br\/>pseudorandomness is the extractor, introduced by Nisan and the PI. An <br\/>extractor is an algorithm which extracts high-quality randomness from a <br\/>low-quality random source, using a few auxiliary high-quality random <br\/>bits. Recently, the PI and co-authors have discovered interesting <br\/>connections between extractors and coding theory. Specifically, they <br\/>showed how to use Reed-Muller codes to build good extractors, and how <br\/>extractors yield good list decodable codes. While there have been <br\/>improvements in these methods, optimal extractors have not been <br\/>achieved, and the PI proposes to work towards that goal. The PI also <br\/>plans to work on related issues in coding theory.<br\/><br\/>In addition, the PI plans to work on using low-quality randomness in <br\/>cryptography, where less work has been done. Cryptography also <br\/>motivates the notion of deterministic extractors, which extract <br\/>randomness from low-quality sources without any auxiliary random bits. <br\/>While this is impossible for general low-quality sources, it is possible <br\/>with more specialized ones. For example, the PI and a student <br\/>constructed deterministic extractors for so-called oblivious bit-fixing <br\/>sources. This has applications to exposure-resilient cryptography, where <br\/>cryptographic primitives are made to work even if large portions of keys <br\/>are exposed. The PI proposes to improve previous results and work on <br\/>related issues.<br\/><br\/>Broader Impact<br\/><br\/>Many scientists use pseudorandom generators in Monte Carlo <br\/>simulations,and may get wrong answers without knowing it. Advances in <br\/>pseudorandom generators can therefore mean advances in other areas of <br\/>science. Advances in cryptography are also important to society, as <br\/>computer security becomes more relevant for national security. The <br\/>project also has educational benefits: the PI's research is integrated <br\/>with his teaching, especially in his mentoring of graduate students and <br\/>postdocs.","title":"Pseudorandomness, Codes, and Cryptography","awardID":"0310960","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518438"],"PO":["499399"]},"82455":{"abstract":"This is funding to support preliminary work related to the study of human-robot interaction (HRI) in safety-critical situations, such as urban search and rescue. The hope is that by bringing together researchers in HCI and Robotics, it will be possible for the PIs to perform well-designed and rigorous studies of HRI unlike any work that has been done in the past. The PIs will focus on the effectiveness of techniques for making human operators aware of pertinent information regarding the robot and its environment. By studying the best practices in HRI, they will enable the creation of better interfaces that provide decision support and reduce the workload of the operator. The PIs will validate their findings by creating new interfaces for safety-critical robot systems. They will also develop methods for testing and evaluating human-robot interaction, which will result in better metrics, and will further develop best practices and design guidelines for HRI in safety-critical applications, validated through the testing of new and revised interfaces. It is important to understand how to turn sensor data into information for decision support to reduce the workload of the human operator and the potential for error, even when the robot and its operator are physically separated.<br\/><br\/>Broader Impacts: The results of this work will allow the PIs to develop course modules for the Robotics II (undergraduate\/graduate) and Evaluation of Human-Computer Interaction (graduate) courses at the University of Massachusetts, Lowell. The research will be disseminated through conference and journal articles; collected data will be made available to interested researchers. All participants in the study will receive copies of the evaluations of their systems, and will have the opportunity to discuss the results with the PIs; it is expected that these systems will improve due to this feedback, and participants will be encouraged to participate in a future study phase to evaluate the revised interfaces. More generally, improving human-robot interaction will benefit society as a whole; for example, the results will be useful to the creation of better robotic systems for assistive technology and for search and rescue.","title":"Human-Robot Interaction in Safety-Critical Applications","awardID":"0308186","effectiveDate":"2003-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["526078","250214"],"PO":["565227"]},"82466":{"abstract":"For most computer users, the visual display provides the highest bandwidth of information throughput. However, the full potential of the visual display is often not achieved. Visual layouts are often poorly designed, minimally evaluated, and based primarily on the intuitions and introspection of the designer. Though some visual interface designers have developed a good sense for what works, most have a very limited understanding of human visual perception, the planning and execution of eye movements, and how visual design interacts with those processes. Part of the problem is that no empirically validated comprehensive theories of applied visual search have been developed. Visual search is rigorously studied in cognitive psychology and human factors, but typically one phenomena at a time; this leads to theories that are disjoint, disconnected from design guidelines, and that do not provide much practical guidance. No integrative theories are sufficiently well formed to provide useful explanations or predictions of how people search the visual layouts in web pages and computer software.<br\/><br\/>In this project, the PI will develop a predictive theory of visual search based on ecologically valid scenarios. The comprehensive theory will identify the interaction among visual-perceptual, cognitive, semantic, and oculo-motor processing during visual search of realistic computer screen layouts. The theory will be embodied in a computational cognitive model and integrate the core processes used in visual interaction. The PI will compile the theory into SimFind, a simulated human visual \"find\" command. SimFind will model and display the fundamental human processing that occurs when a search is triggered. This will be a software module that will stand alone, but which could be integrated into existing predictive tools to provide an accurate and robust human \"find\" within a larger human simulation. The module will implement the processing, components, and behaviors that are fundamental to visual search. The module will provide analytical predictions, as well as visualizations, of human-computer visual interaction -- the seemingly invisible processes that direct a user's attention across a layout. The PI will evaluate and refine the theory behind the simulated visual search with empirical studies that will include eye tracking. Empirical data will evaluate how the theory accurately captures the cognitive strategies motivated by the structure of the layout, and the shifts of attention that occur in response to the structure, visual features, and content encountered during the search.<br\/><br\/>Broader Impacts: This interdisciplinary project will synthesize psychological theory and engineering models to provide the research community with advanced integrative theory and the commercial world with a highly practical application. The project will illuminate the otherwise invisible processes that take place during visual interaction, and will be useful to visual interface designers, students of design, human factors researchers, and cognitive psychologists. It will illustrate and predict human behavior for searching web sites, online voting and census forms, and general-purpose human-computer visual layouts.","title":"Simulating the Human Visual \"Find\" Command","awardID":"0308244","effectiveDate":"2003-05-15","expirationDate":"2009-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["565362"],"PO":["565227"]},"83159":{"abstract":"DMS-0310642<br\/>Alan J. Saalfeld and Tamal K. Dey<br\/><br\/>This collaborative project funded under DMS-0310642 and <br\/>DMS-0310354 is a CARGO full team award made under solicitation <br\/>http:\/\/www.nsf.gov\/pubs\/2002\/nsf02155\/nsf02155.htm.<br\/><br\/>Geodesists and computational geometry specialists use different <br\/>mathematical tools for building surfaces from sampled points. One part of <br\/>this project (DMS-0310642) encompasses cross-fertilization of tool <br\/>development along with merging and extension of the underlying mathematical <br\/>theories. The mathematical development will address issues in statistical <br\/>adjustment theory, meshing and other computational geometry applications, <br\/>and modified polyhedral Morse theory. Another part of the project <br\/>(DMS-0310354) deals with exposing and equipping undergraduates to work on such <br\/>problems by offering courses and summer REU workshops. The mission is to <br\/>involve research at all levels, based on the interplay of fundamental <br\/>ideas, such as curvature, polyhedral geometry, graphs on surfaces, and <br\/>combinatorial topology, eventually leading to advanced topics such as noise <br\/>handling in geodetic data, Morse theory, mesh generation of surfaces, and <br\/>smoothing.<br\/><br\/>Using statistical adjustment methods, traditional geodesists fit smooth <br\/>surfaces to noisy surface data. Using computational geometry, our computer <br\/>scientists have begun developing and will continue to develop efficient <br\/>algorithms for finding meshed surfaces that are close to and provably <br\/>homeomorphic to densely sampled smooth surfaces. The interplay between <br\/>differential and discrete geometry has sparked a renewed interest among <br\/>mathematicians and theoretical computer scientists to find algorithms for <br\/>computing topological invariants and for examining properties of surface <br\/>decompositions and of graphs on surfaces. The research offers challenges <br\/>to graduate students, undergraduate students, and research faculty alike.","title":"Geodetic Surfaces: Understanding Their Geometry and Topology","awardID":"0310642","effectiveDate":"2003-05-01","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["549998",216725,216726],"PO":["565280"]},"84315":{"abstract":"This small planning grant will support efforts to launch the first international probabilistic planning competition, slated to be held in conjunction with the 2004 International Conference on Automated Planning and Scheduling (ICAPS-04). The competition is being organized as a parallel track of the Fourth International Planning Competition (IPC) at ICAPS-04. The IPC was first held in 1998 in conjunction with the Artificial Intelligence Planning and Scheduling conference (AIPS). Follow-up competitions were held in 2000 and 2002, and it is widely believed that the competitions have been enormously valuable to the planning community, spurring advances in algorithms and representations and rapidly disseminating them throughout the field.<br\/><br\/>The organizers of ICAPS-04 will be hosting the 4th IPC, which has focused exclusively on classical planning, involving sequential decision making when the effects of all decisions are deterministic. Over the past decade, as computers have become more and more integrated with the physical world, researchers have begun to study models that can represent the inherent uncertainty present in the effects of many decisions. In this setting, plans are evaluated by how likely they are to achieve desired outcomes. The dominant mathematical model in this community is the Markov decision process (MDP) model, and there are research groups all over the world studying MDPs for planning. However, progress in the field is inhibited by the lack of a unified metric for progress and little sharing of results between groups. A probabilistic planning competition could give the probabilistic planning community a much needed opportunity to come together and move forward. <br\/><br\/>This award will support adaptation of a plan validator program and travel to facilitate organizing of the competition. Its broader impacts include training a graduate student and improvement of computerized planning systems to plan many kinds of real-world activities.","title":"Creating the First International Probabilistic Planning Competition","awardID":"0315909","effectiveDate":"2003-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["550488"],"PO":["491702"]},"79849":{"abstract":"Institution: Auburn University<br\/>Proposal Number: EIA - 0243862<br\/>PI: Saad Biaz<br\/>Title: Collaborative Proposal: REU Site for Pervasive and Mobile Computing<br\/><br\/>Collaborator:<br\/><br\/>Institution: University of Alabama - Tuscaloosa<br\/>Proposal Number: EIA - 0244156<br\/>PI: Joel Jones<br\/><br\/>This project supports a collaborative effort of two Computer Science departments in two universities to establish an REU site in Pervasive and Mobile Computing. The collaboration supports 16 undergraduate students per year at the two campuses who would not be otherwise exposed to research. This Site builds on complementary expertise of the two institutions and on existing collaborative research projects in pervasive and mobile computing. One university contributes expertise in wireless systems and in minority student education, and the other will contributes expertise in emergency reporting. <br\/><br\/>The multi-university pervasive and mobile computing project is developing a system architecture for integrating information appliances such as PDA's and 3G mobile phones into first-responders' operations in emergency situations. The goal of the research in which the undergraduates participate is to define not a particular <br\/>system but a framework for public-sector mobile data systems based on empirical data derived from ongoing development of such systems.","title":"Collaborative Proposal: REU Site for Pervasive and Mobile Computing","awardID":"0243862","effectiveDate":"2003-05-01","expirationDate":"2008-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["489515","505916"],"PO":["564181"]},"83941":{"abstract":"EIA-0314195<br\/>Donna B. Stoddard<br\/>Jane Linder<br\/>Babson College<br\/><br\/>SGER: Silver Bullets in Digital Government<br\/><br\/>This proposal would conduct exploratory research to help lay the foundation for systematically understanding critical success factors for digital government research projects. Specifically, the PI proposes to:<br\/><br\/>1. Use a case study methodology, consistent with the exploratory phase of this research, to select three digital government projects that have succeeded beyond reasonable expectations.<br\/>2. The success criteria used with be 1) most striking results, 2) most generalizable, and 3) willingness to the principals to participate in the research.<br\/>3. Prepare a case study for each project based on interviews with the principle partners and stakeholders for the research project.<br\/>4. Develop a research proposal to extend this research to a broader set of projects.","title":"SGER: Silver Bullets in Digital Government","awardID":"0314195","effectiveDate":"2003-05-01","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":[218867,218868],"PO":["371077"]},"82435":{"abstract":"People with Muscular Dystrophy (MD) and certain other muscular and nervous system disorders such as Cerebral Palsy (CP) and ALS often lose their gross motor control while retaining fine motor control. The result is that they frequently have difficulty operating a mouse and keyboard. However, they typically retain the use of their fingers, and can control a pencil or stylus, and thus can use a handheld computer such as a Palm. Even people with motor impairments who can use a normal keyboard often tire easily, so having a variety of input techniques that they can switch among may allow the use of computers for longer periods. This project will develop techniques to enable people with a wide range of motor impairments to use a handheld computer as an interface to computers. The PI will invent new input techniques for entering text and controlling a mouse pointer that are optimized for use by people with motor impairments. He will measure and refine the user interfaces and input techniques through extensive formal and informal user testing that will highlight the conditions and impairments for which each input technique will be useful. He will determine which parameters best characterize a motor impairment with respect to a user's performance with a stylus and handheld user interface. He will develop novel software that runs on a handheld device and can be used by therapists and researchers to measure the performance parameters of individuals with motor impairments, and to automatically adjust parameters and selection of input techniques. Particular techniques to be investigated for handheld text input include adaptive word prediction and word completion designed for people with muscular difficulties (in particular, the distance the user's fingers must travel to select a word should be minimized), and new interaction techniques for specifying characters by using the edges of a handheld's screen (preliminary investigations suggest that the raised edges that are already part of handhelds, or an additional overlay guide, can help people with certain muscular disabilities such as tremors or spasms enter text more accurately). New techniques for entering mouse locations will include software filters. <br\/><br\/>Broader Impacts: As a consequence of this research, some people with muscular impairments who could not use a computer will be able to, and many of those who could use one will be able to do so more effectively and for longer periods of time. Furthermore, the elderly commonly suffer from motor-limiting conditions like arthritis, and a handheld interface may be an attractive non-aggravating option for computer access. The improved evaluation tools to be developed as part of this project will make it easier for therapists to determine the right interaction techniques for each individual, which will help to optimize each person's effectiveness. The PI plans to collaborate with the United Cerebral Palsy (UCP) Association, the Muscular Dystrophy Association (MDA), the University of Pittsburgh Medical Center (UPMC), and others, to ensure that the tools and techniques developed as part of this research will be deployed for real use by many people who will benefit. The knowledge gained will be disseminated through the usual research channels, as well as through the Rehabilitation Engineering Society of North America (RESNA) and other forums used by therapists, so as to impact as large an audience as possible.","title":"Using Handhelds to Help People with Motor Impairments","awardID":"0308065","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["548127"],"PO":["565227"]},"86626":{"abstract":"Proposal: 0326404<br\/>PI: Lynette Hirschman<br\/>Title: Evaluation Bioinformatics Technology<br\/><br\/>Abstract<br\/><br\/>The focus of this effort is to put in place an international \"challenge evaluation\" for text data mining, modeled after the successful CASP evaluations (Critical Assessment of Techniques for the Protein Structure Prediction). An evaluation will be implemented focused initially on two tasks: identification of biologically significant entities; and extraction of relation information such as interactions or identification of Gene Ontology terms in the literature. A gold standard of training and test corpora will be obtained by using expert annotated data from BIND, SWISS-PROT and other model organism databases. These data sets will be made available to a wide community through a website. Organizations in computational linguistics and information retrieval will also be involved. The overall strategy is to focus on problems of importance to working biologists, such as improved curation tools for biological databases, and better access to textual information in both the literature and in curated databases. This approach provides infrastructure and support to multiple research groups. It also supports creation of training and test corpora to support many machine learning and statistical pattern recognition experiments.","title":"Evaluating Bioinformatics Technology","awardID":"0326404","effectiveDate":"2003-05-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}}],"PIcoPI":["389934"],"PO":["565136"]},"87958":{"abstract":"This proposal is for two workshops on \"Management and Models for Cyberinfrastructure.\" The report, Revolutionizing Science and Engineering Through Cyberinfrastructure, provides a broad vision of the future of science and engineering research. The path forward that this report envisions - extensive cyberinfrastructure to enable all levels of science & engineering research and education, geographic and institution independence, cross-disciplinary sharing of data and insights, and technical depth in all dimensions - truly has the potential to revolutionize all fields of research and education. In addition to the sound advice offered in the report on the organizational issues that NSF may face in implementing the report's recommendations, there is also a need to examine the various models that might be relevant to the management and oversight of such large-scale, ubiquitous, comprehensive digital environments, which include distributed resources, federated facilities, people, data, information and tools. Input and lessons learned are needed from key stakeholders and other principals experienced in the management and oversight of such complex enterprises. The central objective of these workshops is to articulate the array of organizational models for large-scale, federated, distributed scientific organizations that NSF can consider employing for cyberinfrastructure. The benefits, detriments and possible innovations of each model should be analyzed from several points of view including 1) governance issues, 2) oversight potential, 3) operational effectiveness, 4) economic efficiency, and 5) knowledge production potential. In addition, several town hall meetings will be held to insure that all stakeholders are included.","title":"Workshop for Management Models for Cyberinfrastructure","awardID":"0334053","effectiveDate":"2003-05-15","expirationDate":"2004-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["551829"],"PO":["495796"]},"83239":{"abstract":"This project will investigate the complexity of problems in logics.<br\/>The focus will be on results that classify the complexity of an<br\/>infinite number of problems. The first such result dates from 1978,<br\/>when Schaefer proved his famous dichotomy theorem for generalized<br\/>satisfiability problems. He defined an infinite number of propositional<br\/>satisfiability problems (nowadays usually called Boolean constraint<br\/>satisfaction problems), showed that all these satisfiability problems are<br\/>either in P or NP-complete, and gave a simple criterion to determine<br\/>which of the two cases holds. In recent years, quite a few dichotomy<br\/>theorems have been shown about problems in logics. Almost all of<br\/>these problems have the following three properties in common: They<br\/>are variations of satisfiability, they are problems in propositional logic,<br\/>and they use Schaefer's constraint framework.<br\/><br\/>This project's goal is to extend the existing research in three<br\/>different directions, seeking dichotomy theorems for problems that<br\/>are not related to satisfiability, for problems in logics other than<br\/>propositional logic, and for frameworks other than Schaefer's<br\/>constraint framework.<br\/><br\/><br\/>Broader Impacts:<br\/><br\/>Through her school's commitment to, as voluntary cost-sharing,<br\/>reduce the proposer's teaching load by one course per year,<br\/>and through the direct support of her summer months,<br\/>this grant will have the broader impact of helping support<br\/>research at an undergraduate institution. This harmonizes<br\/>well with RIT's desire to become a more research-friendly<br\/>institution. The travel support will allow the proposer and<br\/>her students to attend conferences to develop professionally<br\/>via learning of new advances, and presenting their results to<br\/>the broader theory community.","title":"Complexity of Logics","awardID":"0311021","effectiveDate":"2003-05-01","expirationDate":"2007-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["478001"],"PO":["499399"]},"82118":{"abstract":"This grant will support a planning process to refine the scope of a larger effort to be submitted to NSF later in 2003. The research discipline is social science,and the collaboration will be with the U.S. State Department. The focus of the work will be to explore how the data integration aspects of web portals can enhance the dialog between agency and public in the area of public diplomacy. Challenges in the long run are technical to some degree, but the areas of richest possibility for new knowledge are in the less quantitative areas related to organization and legal\/political issues.","title":"How are we doing? Tracking Country Image in the Information Age","awardID":"0306803","effectiveDate":"2003-05-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}}],"PIcoPI":["410674","251075"],"PO":["371077"]},"83108":{"abstract":"DMS-0310446<br\/>John C. Hart, Michael T. Heath, Xiangmin Jiao, and John M. Sullivan<br\/><br\/>This collaborative project funded under DMS-0310642 and <br\/>DMS-0310354 is a CARGO full team award made under solicitation <br\/>http:\/\/www.nsf.gov\/pubs\/2002\/nsf02155\/nsf02155.htm.<br\/><br\/>Level sets represent a moving interface surface implicitly, which<br\/>naturally accommodates singularities and topology changes, but at the<br\/>expense of a wasteful volumetric Eulerian representation that provides no<br\/>control over the topology of the level set. Our project will develop new<br\/>methods for tracking interfaces using a more efficient Lagrangian surface<br\/>mesh. Through careful prediction of instabilities and topology changes,<br\/>we will address the numerical, geometric, and topological difficulties<br\/>that have plagued previous Lagrangian approaches to interface propagation.<br\/>The result will be faster and more compact simulations of the motion of<br\/>interface surfaces, as well as the ability to detect and control changes<br\/>in their topology.<br\/><br\/>Moving boundary or interface surfaces are an integral part of a wide<br\/>variety of physical phenomena, such as solidification, extrusion,<br\/>multiphase flow, and fluid-solid interaction. Numerical simulations of<br\/>such phenomena require reliable and efficient methods for propagating and<br\/>tracking such moving surfaces. The focus of our project is to develop<br\/>new methods that provide greater control over surface propagation while<br\/>also attaining greater computational efficiency than existing methods.<br\/>One specific application we will consider is the simulation of combustion<br\/>in solid propellant rocket motors, which is the primary focus of UIUC's<br\/>Center for Simulation of Advanced Rockets (CSAR). This work will result<br\/>in more efficient and more accurate virtual prototyping of rocket motor<br\/>designs, leading to safer and more efficient solid rocket boosters,<br\/>such as those powering the U.S. Space Shuttle.","title":"Robust Lagrangian Surface Propagation with Topological Control","awardID":"0310446","effectiveDate":"2003-05-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["434621","517378","340351","369489"],"PO":["565280"]},"81778":{"abstract":"EIA-0305444<br\/>Bruce R Donald<br\/>Dartmouth College<br\/><br\/>Project Summary<br\/>The expression patterns of many genes associated with circannual (yearly), circadian (daily), cell-cycle and other periodic biological processes are known to be rhythmic. Conversely, the expression profiles of genes associated with aperiodic biological processes (e.g., tissue repair) are not rhythmic. The functional significance of previously uncharacterized genes, therefore, may be inferred if they exhibit rhythmic patterns of expression synchronized to some ongoing biological process.<br\/><br\/>DNA microarray experiments are an effective tool for identifying rhythmic genes when a time-series of expression levels are collected. Unlike Northern blots and real-time PCR, which study one gene at a time, DNA microarray hybridization experiments can reveal the expression patterns of entire genomes. Chronobiologists are therefore able to assign putative functional properties to large numbers of genes based on the results of a single experiment. However, the large volume of data generated by hybridization experiments makes manual inspection of individual expression profiles impractical. Separating the subset of genes whose expression profiles are rhythmic from the thousands or tens of thousands that are not requires computer assistance. Ideally, the algorithms for providing such assistance should be efficient and have well-understood performance guarantees.<br\/><br\/>We propose to design and implement algorithms to identify and characterize the properties of rhythmic genes from DNA microarray hybridization time-series data. Our approach will build on our recent papers in {\\em The International Conference on Research in Computational Molecular Biology (RECOMB)}~\\cite{recomb02} and the {\\em IEEE Computer Society Bioinformatics Conference}~\\cite{csb02}. We will specifically addresses issues of computational complexity, statistical significance and morphological similarity. We hope our techniques will aid efforts in functional genomics, by developing new algorithmic techniques for the analysis of massively-parallel DNA microarray expression data.<br\/><br\/>We will develop a model-based analysis technique for extracting and characterizing rhythmic expression profiles from genome-wide DNA microarray hybridization data. Our approach, called {\\sc rage}<br\/>(Rhythmic Analysis of Gene Expression), decouples the problems of estimating a pattern's wavelength and phase. Specifically (I) we propose the {\\em autocorrelation} to render our search algorithm phase-independent, and (II) we propose the {\\em Hausdorff distance} to measure the similarity of the autocorrelated signals. By attacking the problem of microarray gene-expression time-series analysis using these new methods, we hope to strengthen the computational armamentarium of the chronobiologist. Our {\\sc rage} algorithm is linear-time in frequency and phase resolution, an improvement over previous quadratic-time approaches. Unlike previous approaches, {\\sc rage} uses a true distance metric for measuring expression profile similarity, based on the Hausdorff distance. This results in better clustering of expression profiles for rhythmic analysis. The confidence of each frequency estimate is computed using $Z$-scores. In preliminary results,{\\sc rage}performed better than competing techniques on synthetic and actual DNA microarray hybridization data. Employing results on combinatorial bounds for Voronoi diagrams~\\cite{Huttenlocher}, we can replace the discretized phase search in our method with an exact (combinatorially precise) phase search~\\cite{recomb02}, resulting in a faster algorithm with no complexity dependence on phase resolution. Thus, one emphasis of this proposal is the development of combinatorially-precise, provable algorithms for analyzing expression patterns.<br\/><br\/>Surprisingly, maximum entropy spectral analysis (MESA) has not been applied to massively-parallel gene expression time-series analysis before. Therefore, we will also develop a maximum entropy-based analysis technique for extracting and characterizing rhythmic expression profiles from DNA microarray hybridization data. This approach, called {\\sc enrage} (Entropy-based Rhythmic Analysis of Gene Expression), treats the task of estimating an expression profile's periodicity and phase as a simultaneous bicriterion optimization problem. Specifically, a frequency domain spectrum is reconstructed from a time-series of gene expression data, subject to two constraints: (a) the likelihood of the spectrum and (b) the Shannon entropy of the reconstructed spectrum. Unlike Fourier-based spectral analysis, maximum entropy spectral reconstruction is well-suited to signals of the type generated in DNA microarray experiments. The {\\sc enrage} algorithm is optimal, running in linear time in the number of expression profiles. Moreover, a preliminary implementation of our algorithm runs an order of magnitude faster than previous methods.","title":"SGER: Algorithmic Challenges in Computational Biology","awardID":"0305444","effectiveDate":"2003-05-15","expirationDate":"2006-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}}],"PIcoPI":[213293],"PO":["565223"]}}