{"81768":{"abstract":"Computer algebra (also known as symbolic computation) is an area of research involving both mathematics and the computer sciences. Computer algebra systems are widely used in many areas for research, education and practical problem solving. Research in computer algebra is the driving force for technological advances in commercially available computer algebra software. Its major goal is the development of highly efficient algorithms and automated software systems that can solve a wide variety of mathematical problems symbolically, numerically, or in a hybrid way.<br\/><br\/>The East Coast Computer Algebra Day (ECCAD) is one-day regional conference on computer algebra, its applications and related technological developments. Since 1994, ECCAD has been held annually at various North American locations on the East Coast. This meeting in the series is being held on Saturday, April 5, 2003, at Clemson University, Clemson, South Carolina. Three internationally recognized invited speakers will make featured presentations. There will be contributed poster\/software demo sessions, covering many aspects of computer algebra.","title":"East Coast Computer Algebra Day 2003","awardID":"0305420","effectiveDate":"2003-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["445138","541955"],"PO":["321058"]},"78481":{"abstract":"Caccamo<br\/>0237884<br\/><br\/>This CAREER project is a combined research and educational project in the area of resource management for highly dynamic real-time systems with physical constraints. The new millennium heralds the convergence of communication, computing, and intelligent control of the physical environment. The rapid advancement of computing and wireless technologies will enable us to employ cooperative real-time nodes that must operate without human intervention. These nodes frequently reside in hostile environments for accomplishing tasks ranging from space monitoring and surveillance to environmental protection. Under this challenging vision, there will be an extensive deployment of highly dynamic and physically constrained real-time node, connected together through communication networks. This project is aimed at the development of new resource management techniques for dynamic, constrained real-time systems. <br\/><br\/>The research follows four avenues: 1) Collaborative scheduling: Distributed rate adaptation and collaborative resource reclaiming techniques are explored to mitigate the effects of higly dynamic workloads in a distributed system with tightly-coupled real-time collaborative tasks running on different nodes. 2) Prioritized medium access control (MAC) with rate-adaptive messages: Traditional MAC protocols are not suitable for real-time nodes collaborating through wireless networks because messages exchanged inside the network are largely periodic and need guaranteed bounded delay. This research considers how to prioritize access to guarantee bounded delay, and how to implement distributed rate adaptation. 3) Power management: The research explores how to exploit the predictable schedule of the wireless channel as an effective way to limit power consumption using sleep mode. 4) Template design: Off-line template design will be explored for managing multiple physical constraints such as energy and thermal bounds in real-time CPU and network resource scheduling.<br\/><br\/><br\/>The broader impacts of this CAREER project are both technical and educational. The theory and techniques developed in this project will have a broad impact, as they enable a wide spectrum of critical real-time applications. The educational goals of the project are to transfer the research results to undergraduate and graduate courses, industry-sponsored workshops, and the national security and commercial sectors. The educational plan is aimed at providing undergraduate and graduate students knowledge and skills to ensure their technical leadership in the real-time community. This plan is realized by revising an existing undergraduate course and introducing a new graduate course, as well as developing widely-available Open Source toolkits and curriculum materials for research and educational use.","title":"CAREER: Adaptive Resource Management in Highly Dynamic Real-Time Systems with Physical Constraints","awardID":"0237884","effectiveDate":"2003-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["542023"],"PO":["561889"]},"78371":{"abstract":"This is a 5-year continuing award. This research effort will address the application of immersive virtual environments (VEs) to the architectural design and construction industries. Specifically, it aims to make immersive design applications - those in which the designer can create or modify a 3D space while immersed within it - possible. There are four components to this work. First, the PI will design and evaluate user-centered 3D interaction techniques specially targeted at design and construction tasks. He will then design and implement a high-level software framework that supports rapid prototyping and development of immersive design applications. Next, he will develop several proof-of-concept VE applications using the domain-specific interaction techniques and implemented in the software framework. Finally, the PI will educate students, both in HCI (through a new course and textbook on 3D interaction), and in the design disciplines (through the use in courses of the VE applications developed in this project). This research will have a significant impact in the VE and 3D interaction communities, leading to an increased understanding of how interaction techniques can be tailored to particular tasks and domains. The software framework will impact research in immersive design, allowing graphics and VE novices (domain experts) to build powerful interactive VE applications. The example applications the PI builds will impact the design and construction industries, providing a tighter design cycle and an increased understanding of difficult 3D problems. And there will also be a two-pronged impact in the classroom, where the PI will use VE technology as a learning tool in the design disciplines and introduce cutting-edge research in 3D interaction to graduate-level HCI students.","title":"CAREER: Domain-Specific 3D Interaction Techniques for Design and Construction Tasks in Immersive Virtual Environments","awardID":"0237412","effectiveDate":"2003-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["210005"],"PO":["565227"]},"78188":{"abstract":"This is a 5-year continuing award. Intelligent machines capable of recognizing and analyzing human actions will play an important role in next generation human-computer interfaces. This research effort will address development of a computational vision framework for recognizing dynamic human movements. The goal is to model the perceptual dynamics associated with human activities to automatically identify various action categories and action efforts. The PI will examine a key-feature approach within a three-mode principal components framework to learn the expressive features needed for the model to produce results qualitatively similar to human judgments of the actions. Experiments will be conducted using motion capture and video data of multiple people performing common activities at different efforts. Results at each stage will be compared to perceptual experiments and alternative non-expressive methods. To demonstrate the approach, an automatic surveillance and monitoring application will be implemented. If successful the research should have broad impact on human-computer interaction in numerous domains as diverse as ergonomic evaluation, sports analysis, and computer animation. In conjunction with the research, the PI will create an educational plan that integrates topics on computer vision, human perception, human-computer interaction, and computer animation into a new cross-disciplinary curriculum that combines classroom discussions with practical laboratory experience, and which fosters undergraduate research-related opportunities.","title":"CAREER: Computer Recognition of Human Activity","awardID":"0236653","effectiveDate":"2003-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["551341"],"PO":["565227"]},"80081":{"abstract":"ABSTRACT: EIA 0244604, Indiana Univ., Wm. Aspray, PI<br\/><br\/>The purpose of this project is to carry out a meta-analysis of the forty projects funded in NSF's Information Technology Work Force (ITWF) program over its three-year history. This analysis will compare, contrast, and consolidate the knowledge of the ITWF projects with other research and implementation projects in the IT workforce area. The final product is to be a report that provides analysis that is planned to help guide further research on these topics, as well as recommend actions to decision-makers (NSF and other local, state, and federal agencies; policymakers at local, state, and federal levels; professional societies; the academic community; and individuals desiring more productive careers in the IT area).","title":"Special Projects: Meta-Analysis of Information Technology Worker Research","awardID":"0244604","effectiveDate":"2003-03-15","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[208531],"PO":["289456"]},"78574":{"abstract":"This is a Faculty Early Career Development (CAREER) award. Its goal is to develop a multidisciplinary research and educational program for investigating the underlying theoretical and computational principles of how biological systems represent the natural environment. Biological sensory systems have evolved to survive in a sensory environment that is complex and dynamic, and even the simplest organisms can perform remarkable feats of signal processing. The motivation of the program is to advance our scientific understanding of biological sensory systems and to improve our design of artificial sensory systems.<br\/><br\/>The general aim of this research program is to gain theoretical insight into auditory sensory codes and processing using information theoretic models that have thus-far been applied primarily to vision. A further aim is to extend these theories to address some of their important limitations and deal with computational problems specific to audition. The research projects are designed (1) to determine if efficient coding of natural sounds predicts response properties and population characteristics of auditory nerve fibers; (2) to determine how different sounds classes, such as speech or music, influence the properties of the theoretically optimal code; (3) to determine if efficient coding theory capture non-stationary acoustic structures using a spike timing code; and (4) to extend the theoretical framework to incorporate gain control and noise level in order to account for important non-linear properties of auditory sensory coding. <br\/><br\/>If successful, this research will provide a fundamental theoretical understanding of the nature of the auditory code and its relation to the acoustic environment. This project aims to offer insights into the organization of the population of auditory nerve tuning and phase-locking properties, the acoustic cues for auditory stream segmentation, the neural representation of sounds such as musical notes and speech phonemes, and the role of feedback via the outer hair cells. These advances will also have impact beyond the auditory system and many of these results will also have application to theories of visual sensory coding. The results of this research will provide deeper insights into the information theoretic principles of sensory coding, and ultimately will contribute to the creation of functional and robust artificial sensory systems. <br\/><br\/>This CAREER award recognizes and supports the early career-development activities of a teacher-scholar who is likely to become an academic leader of the twenty-first century. The broader impacts of this project include development of interdisciplinary curriculum uniting computer science, neuroscience, and cognitive psychology. A new course will teach advanced undergraduates and graduates advanced aspects of perception, scene analysis, and recognition in both the visual and auditory modalities, concentrating on aspects that are essential for interacting with natural, complex environments. The scientific results of the research will contribute to improved computer technology capable of better recognizing sounds from the natural environment.","title":"CAREER: Representation of Natural Auditory Scenes","awardID":"0238351","effectiveDate":"2003-03-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["483749"],"PO":["387198"]},"78024":{"abstract":"This proposal will study a particular class of proteins, ion channels, by the tools of bioinformatics. The subclass of ion channels to be studied are potassium channels, that selectively permit the passage of passage of potassium ions. Traditionally, the detailed function of ion channels has been studied by biophysical means. This proposal will study the functioning of potassium channels with a different set of tools, the tools of sequence bioinformatics. Essentially, this project will correlate sequence data with knowledge about the structure and function of some members of the potassium channel family, and use that to extrapolate to a prediction of functional details for the very large number of potassium channel genes for which we have no direct structural and functional data. <br\/><br\/>This is very important in expanding our knowledge because it is now much quicker and cheaper to get sequence data than functional and structural data. Any advance that we can make in inferring function from sequence will therefore lead to big advances in functional knowledge. <br\/><br\/>This research clearly can have a large ultimate beneficial pay-off for biomedicine and biotechnology. In addition to disseminating results by the usual route of publishing and presentation at meetings, we will also develop for the general community use profiles and motifs that are specific for particular subclasses of potassium channels, and build them in the formats that are standard for motif\/profile databases such as BLOCKS, PROSITE, PFAM, and PRINTS. The findings from this research will be able to be seamlessly and easily used by other researchers with existing analysis software.","title":"Bioinformatics of Voltage-Gated Ion Channels","awardID":"0235792","effectiveDate":"2003-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1994","name":"BIOINFORMATICS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}}],"PIcoPI":["384292"],"PO":["563727"]},"78399":{"abstract":"It is proposed to develop a new framework for the distributed processing of images from networks of literally hundreds of cameras, for which no calibration is known in advance and in which cameras may freely appear, disappear, and move about. Conventional computer vision methods are not adequate for such networks, because they assume a small, fixed number of stationary cameras that can be centrally, simultaneously processed. We will study distributed solutions for both calibration (computing absolute and relative camera positions) and computer vision problems (such as view synthesis) in large dynamic camera networks.<br\/><br\/>This research has broader impacts in the design and effectiveness of the camera networks that will be ubiquitous in the city streets, airports, and battlefields of the 21st century. Such networks will be crucial for automatically monitoring and extracting information from environments where the safety and security of human lives are at stake. Our goal is to develop the models, algorithms, and applications that will form the foundations of the new field of dynamic camera networks.","title":"CAREER: Distributed Active Processing on Hundred-Camera Networks (DAPHNE)","awardID":"0237516","effectiveDate":"2003-03-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7339","name":"COMPUTER VISION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["522223"],"PO":["564318"]},"83382":{"abstract":"This project provides partial funding for the \"Genomic Approaches to Transcriptional Regulation Conference\", to be held at Cold Spring Harbor Laboratory, March 6-9, 2003. The meeting will focus on unraveling the regulatory information that controls the activation and repression of genes involved in developmental, metabolic, and environmental responses. Traditionally, investigators have studied this problem by analyzing the DNA-binding preferences of specific transcription factors, and\/or the cis-regulatory elements that control the expression patterns of single genes. These studies have tentatively identified DNA sequence motifs for around one hundred transcription factors, and have led to the idea that transcriptional regulation at the genome level involves a complex interplay between modular DNA sequence elements such as enhancers, silencers, insulators, and basal promoter elements. Despite this progress, there is still much to learn about the mechanisms that control the transcriptional repertoire within an individual cell. Because of the scope of this problem, researchers have begun to refine traditional experimental approaches and invent new ones. Many of these approaches involve a computational component in their design or interpretation. Other strategies have evolved from the availability of several complete genomic sequences and the prospects of many more to come. It is clear that effective collaborations between experimental and computational biologists will be required to grapple with this complex problem. Thus this meeting will be organized so as to permit a free cross-disciplinary exchange of existing ideas and expertise. It is hoped that this meeting will provide a mechanism for the establishment of new collaborations, and a forum for discussing new experimental and computational approaches.","title":"2003 Cold Spring Harbor Conference: Genomic Approaches to Transcriptional Regulation, March 6-9, 2003, Cold Spring Harbor Laboratory","awardID":"0311769","effectiveDate":"2003-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1112","name":"Genetic Mechanisms"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1080","name":"EVOLUTION OF DEVELOP MECHANISM"}}],"PIcoPI":["561880"],"PO":["261194"]},"78443":{"abstract":"CAREER: Understanding the Complexities of Animated Content<br\/>Abstract<br\/><br\/>As immersive graphics environments become more viable as useful training and education tools, we must be able to understand animated content well enough to provide naive content creators with the ability to create compelling synthetic scenes. This understanding requires that we answer the following questions. How do we create characters that perform natural motions based on high-level direction? How do we direct synthetic characters at a high level? How do we structure interactive spaces for spatial and temporal interactions between humans and synthetic characters?<br\/><br\/>To answer these questions, we will conduct research in the following areas: motion capture re-sequencing, character interfaces and character programming. We will restrict ourselves to a particular domain and build an interactive space in order to study the above research questions. We have chosen quarterback training for the sport of American football as the specific problem domain for the following reasons.<br\/> Quarterback training requires compelling 3D content in order to produce convincing training situations.<br\/> Quarterback training is a physical task and involves spatial and temporal interaction between the coaches and players (where players include the real quarterback and the synthetic characters).<br\/> Game preparation requires time-critical training content creation.<br\/> Quarterback training requires use by domain experts (coaches and players) who may be naive computer users.<br\/> We have access to domain experts in quarterback training through the Oregon State University football program.<br\/><br\/> Our research will result in algorithms for generating natural motion from motion capture data based on high level input, guidelines for classifying character interaction techniques, and methods for directing characters within the interactive space. We plan to evaluate our research through various quantitative measures and usability studies to determine the quality of content and the ability of naive content creators to create and interact with the content within our interactive space framework.","title":"CAREER: Understanding the Complexities of Animated Content","awardID":"0237706","effectiveDate":"2003-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["554552"],"PO":["532791"]},"83593":{"abstract":"This workshop will bring together a group of technical, policy and user experts to develop a strategy and action plan for increasing the public interest in digital rights management (DRM). The objectives are to 1) examine the current state of development of DRM systems, 2) assess the potential impact of these developments on public sector institutions, particularly research and educational institutions and libraries, and their users, and 3) explore options for increasing public sector involvement in the design of technical standards and specifications for DRM. A report will be produced that will be the basis for further discussion and action on the part of public interest organizations.","title":"A Workshop on Digital Rights Management in the Public Interest","awardID":"0312698","effectiveDate":"2003-03-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[217930],"PO":["564456"]},"77620":{"abstract":"Several applications over the Internet, such as script and cryptographic processing, database management, and multimedia processing, involve processing of secure, computation-intensive, multimedia, and high-bandwidth information. These applications require large-scale scientific computing, reliability, and high-bandwidth at the server nodes. This joint project between two campuses of the University of California (Davis and Riverside) develops a scalable distributed software system architecture, where the major functionalities required in the Internet servers are partitioned, and resources are allocated on the basis of their needs. The amount of computation and architectural requirements of these applications are determined through actual execution on servers. New techniques are developed to handle system-level issues like admission control, functionality distribution, content management, traffic management, and dynamic reconfiguration of resources, inter-process communication, and lightweight I\/O. They are implemented on a prototype system, which is built using a combination of the available off-the-shelf components and special-purpose devices. The outcome of the project will impact the development and management of future large-scale Internet servers. The project is conducted in collaboration with researchers at Intel Corporation, and would have a potential for future technology transfer.","title":"SOFTWARE: Collaborative Research: Scalable Software Systems for Large Internet Servers","awardID":"0233938","effectiveDate":"2003-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["550540"],"PO":["565272"]},"83165":{"abstract":"This workshop will bring together NSF grantees of the cross-agency Biodiversity and Ecosystem Informatics initiative to discuss progress in the past year and possibilities for further work in the area. Also attending will be representatives of interested Federal Agencies and interested NSF programs. The workshop will be held in the Washington, DC area February 10-11,2003.","title":"BDEI-PIs Workshop: Reporting Results and Research Prospects of Planning and Incubation Grants; February 11, 2003; Washington, DC","awardID":"0310659","effectiveDate":"2003-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["474015"],"PO":["371077"]},"86102":{"abstract":"This SGER grew out of an EU-US workshop held in Venice in October, 2002. The intent of that workshop was to bring together researchers from the US with those from the EU who were working on similar projects related to e-work and e-business and who would like to begin to collaborate together. This SGER will allow for US cooperation with the EU's STAR project, which involves the conduct of dozens of case studies mapping change in a variety of industries across member states of the EU. This project will focus on the home mortgage service sector, in particular real estate lenders, and will bring the US and one its industries into the collection. Case study protocols will be developed that will allow for cross-comparison with the EU case studies that have already been completed. In addition, travel to the EU will allow for a team meeting and coordination of project goals, methods, and analysis.","title":"SGER: Collaborative Research: Exploring the Integration of Electronic Commerce in Industry Value Chains: A Focus on the Home Mortgage Service Sector","awardID":"0323961","effectiveDate":"2003-03-15","expirationDate":"2004-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["483279"],"PO":["495796"]},"78567":{"abstract":"ABSTRACT<br\/>CCR-0238328<br\/>David Walker<br\/>Princeton University<br\/><br\/>This research develops advanced program analysis techniques that increase the security and reliability of component software systems. In particular, the researchers design, implement and analyze programming languages that contain both of the following complementary technologies.<br\/><br\/>1) Effective Type Refinements (ETR) that conservatively extend modern type systems. ETR allow programmers to specify fine-grained invariants about contents of component data structures and the ordering and effect of operations in a computation. ETR guarantee properties of programs when they are written and as they evolve through the software development cycle.<br\/><br\/>2) Run-time Program Monitors (RPM). RPM execute in parallel with an untrusted application, monitoring, auditing and modifying the untrusted application's actions so that it obeys critical security and resource usage policies. RPM complement ETR by enforcing those properties at run-time that cannot be enforced at compile-time.<br\/><br\/>Together effective type refinements and run-time program monitors provide a cohesive language-based framework for improving the reliability and security of large-scale software systems.","title":"CAREER: Programming Languages for Secure and Reliable Computing","awardID":"0238328","effectiveDate":"2003-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2802","name":"TRUSTED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["483683"],"PO":["564388"]},"77600":{"abstract":"Several applications over the Internet, such as script and cryptographic processing, database management, and multimedia processing, involve processing of secure, computation-intensive, multimedia, and high-bandwidth information. These applications require large-scale scientific computing, reliability, and high-bandwidth at the server nodes. This joint project between two campuses of the University of California (Davis and Riverside) develops a scalable distributed software system architecture, where the major functionalities required in the Internet servers are partitioned, and resources are allocated on the basis of their needs. The amount of computation and architectural requirements of these applications are determined through actual execution on servers. New techniques are developed to handle system-level issues like admission control, functionality distribution, content management, traffic management, and dynamic reconfiguration of resources, inter-process communication, and lightweight I\/O. They are implemented on a prototype system, which is built using a combination of the available off-the-shelf components and special-purpose devices. The outcome of the project will impact the development and management of future large-scale Internet servers. The project is conducted in collaboration with researchers at Intel Corporation, and would have a potential for future technology transfer.","title":"SOFTWARE: Collaborative Research: Scalable Software Systems for Large Internet Servers","awardID":"0233858","effectiveDate":"2003-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["516924"],"PO":["565272"]},"79679":{"abstract":"ABSTRACT: EIA 0243337, ACM, Barbara Ryder, PI <br\/><br\/>This award to the Association Computing Machinery (ACM) ) provides funds for \"Travel Grants for Faculty at Minority\/Female Institutions to attend FCRC'03\". The project supports faculty actively involved with the education of women and minorities to attend the constituent conferences of FCRC 2003, the primary technical conference incorporating the interests of many of the ACM special interest groups. The project incorporates a special panel and discussion session for the travel grant recipients on the issue of recruiting and retaining women and minorities in computer-related fields. Targeted schools include primarily undergraduate institutions, including HBCUs, women's colleges, and other colleges with large minority enrollments. An additional set of faculty is being similarly supported by the ACM SIG Project Fund as part of the overall effort.","title":"Special Projects: Travel Grants for Faculty at Minority\/Female Institutions to Attend FCRC'03","awardID":"0243337","effectiveDate":"2003-03-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}}],"PIcoPI":["438877","473711"],"PO":["289456"]},"75621":{"abstract":"This award provides funds to build a state of the art humanoid robot experimental facility at CMU's Robotics Institute. Developing humanoid robots pushes robotics and automation technology forward. Researchers build humanoid robots to test and explore their theories about how humans work. Humanoid robots are beginning to play an economically important role in the service segment of our society. Primarily, humanoid robots inspire. For example Japan is publicizing its humanoid robotics research to get more children interested in science and engineering, currently a major concern in the U.S.<br\/><br\/>The PIs will purchase an upper body humanoid from Sarcos Research Corporation as well as two smaller robots and an advanced interface device. Using the proposed equipment, the PIs will undertake a number of projects which fall into four broad classes: core robotics and vision research that substantially increases the capabilities and skills of robots (Atkeson, Hebert, Rizzi, Pollard), authoring tools that will make it easier for people who are not roboticists and perhaps even not programmers to develop new applications on robots (Hodgins, Hudson, Kuffner), application prototyping and assessment of humanoid robots in various application domains (Pausch, Kiesler), and unifying applications, which involve a large number of interdisciplinary researchers. In addition to the expected robotics researchers, the team includes researchers from HCI and sociology to work on how these robots might be made easy to use and how they will fit into society. Taken together, these projects will significantly expand the ability both to control humanoid robots and to develop applications on them. These projects will also increase fundamental understanding of the power of the human form in a robot, and our fundamental understanding of human motion. The PIs will encourage other researchers at CMU and in the U.S. to use the facility, taking advantage of strengths in vision, speech, and reasoning. <br\/><br\/>Finally, the PIs are using humanoid robots to explore computational models of how human behavior is generated. Using a humanoid robot as a research tool forces the researchers to deal with a complex physical apparatus and complex tasks. The knowledge required to recreate human motions will also serve to increase our understanding of how people move and may lead to advances in physical rehabilitation and sports medicine. In contrast to most biomechanical research, the PIs will attempt to refine scientific understanding of both the functional components of human motion such as locomotion and grasping and also the subtle stylistic components that make it appear normal, humanlike, and expressive. Combining these two components should make the models useful for analyzing the performance of aspiring athletes as well as diagnosing individual problems with locomotion and manipulation.","title":"Collaborative Research Resources: An Experimental Platform for Humanoid Robotics Research","awardID":"0224419","effectiveDate":"2003-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["438709","520920","249126","438708","560865"],"PO":["557609"]},"78536":{"abstract":"This research investigates design and implement a framework for autonomous multiple mobile robots localization\/navigation in a dynamic, partially known environment. The framework will integrate autonomous cooperative localization and navigation capabilities.<br\/><br\/>In particular, autonomous cooperative sensor-based navigation capabilities will be explored, which integrate; extrapolated artificial potential field based path planning; consecutive sensing based localization methods with the aid of techniques for computing uncertainty regions; robust, safe techniques for distributive control suitable for dynamic, partially known environments that facilitate efficient, on-line adjustment and re-planning in the presence of unknown or moving obstacles.<br\/><br\/>The mobile robots have variety of sensors and controllers to inform or take action in response to the environment. The ability to reconfigure sensors dynamically between data collection operations enables planning of sensing strategies. Each sensory action will improve knowledge of the environment; hence, each sensory action can be chosen utilizing a larger knowledge base than was available for previous actions. An immediate benefit from this work will be a direct use in sensor based control of mechanical systems. The approach will be a breakthrough in practical machine design and implementation.<br\/><br\/>The proposed cooperative, distributive, robust, and inexpensive multiple mobile robots will be used to many potential applications ranging from maintenance and repair of mechanical machinery, to clean up operations for accidents, to search and rescue operations, or to assisting the disabled or elderly around the home.<br\/><br\/>The project's education component focuses on developing new interdisciplinary undergraduate and graduate courses with an emphasis on robotics and mechatronics and involving undergraduate students in research. It also includes helping high school students understand technical concepts and principles, and providing students with a real-world engineering challenge offering students an academic experience that encourages abstract thought, self-directed learning, and decision-making through TexasBEST robot competition program.","title":"CAREER: An Unified Approach to Mobile Robot Localization and Navigation","awardID":"0238185","effectiveDate":"2003-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["218610"],"PO":["335186"]},"78569":{"abstract":"This project focuses on the development of anthropomorphic robots that interact with people using natural social cues. Socially-competent robots would have great practical impact; users could interact with these robots in a more natural and effortless way, could command them through social instruction, and could integrate them into daily life. This project seeks to address both the technical challenges involved in constructing these robots and the ways in which they can be used as tools to study human social development.<br\/><br\/>The technical challenges of building social robots are substantial. The design and construction of a robot that can produce gestures and utterances which can be easily interpreted by a human observer is a challenging mechanical design problem. A more difficult technical challenge will be to build machines that can recognize human social cues such as pointing gestures, direction of gaze, and tone of voice. Existing research succeeds in recognizing a few of these cues in structured situations, requiring visual scenes that have a constant background or audio signals that contain only the voice of a single speaker. This project proposes to build on existing work by integrating techniques from multiple sensory modalities and using models of human social development as a roadmap for constructing more complex social behaviors. A final engineering challenge will be the implementation of a computational infrastructure to support these algorithms.","title":"CAREER: Social Robots and Human Social Development","awardID":"0238334","effectiveDate":"2003-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["497125"],"PO":["403839"]},"81155":{"abstract":"The IEEE International Symposium on Information Theory (ISIT) is held yearly at <br\/>different locations in the world. The 2003 ISIT will be held from June 29 . July 4, 2003, <br\/>at the Pacific Convention Plaza, Yokohama, Japan. The expected attendance, based on <br\/>the experience of recent ISIT.s, is 750.850 technical delegates from more than 25 <br\/>countries. About one-third of these attendees are expected to be graduate students, and <br\/>many more will be recent graduates and new assistant professors. <br\/> <br\/>This proposal requests support for the travel expenses of ISIT participants from the U.S. <br\/>These participants would be individuals whose papers have been selected for presentation <br\/>at the Symposium, but who lack funds and would not be able to attend without travel <br\/>support. The total amount requested is $30,000, based on a total of 20- 30 grants of <br\/>$1000-$1500 each.","title":"Travel Grant for the 2003 IEEE International Symposium on Information Theory, June 29 to July 4, 2003, Yokohama, JAPAN","awardID":"0302716","effectiveDate":"2003-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["279563"],"PO":["223414"]},"77734":{"abstract":"This project will perform fundamental research in middleware for resource selection<br\/>in dynamically shared network environments such as computation grids.<br\/>The distinguishing feature of our approach is that it matches the application resource<br\/>requirements to the resources available on a network rather than selecting the \"best\"<br\/>nodes based on a fixed criterion. <br\/>The key challenge is to estimate how a given application will perform on a given set of nodes under given network conditions. The project will investigate two different approaches to address this challenge. The first one is based on a \"heterogeneous performance model\", which is a model to predict application execution time under different resource availability scenarios, such as<br\/>different speed processing nodes and network links and different competing loads and<br\/>traffic. The second is based on the concept of a \"performance skeleton program\",<br\/>which is a synthetically generated short running program that has the same fundamental execution characteristics as a given application. Under the same network conditions, the execution time of a performance skeleton program is expected to be a fixed small fraction of the expected execution time of the application it represents. The implementation of both these approaches is based on experimental measurement of the resources that an application uses during execution. The procedure is based on monitoring the processor, network and memory activity generated by an application during execution on a controlled testbed. <br\/>The project aims to develop a complete resource selection framework for grid computing environments based on matching these application information models to the network status information obtained from publicly available network measurement and prediction tools like the Network Weather Service.","title":"SOFTWARE: Automatic Resource Selection in Dynamic Networked Computation Environments","awardID":"0234328","effectiveDate":"2003-03-01","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["434716"],"PO":["565272"]},"87777":{"abstract":"Virtual reality (VR) aims to perceptually place the user in an artificial world through computer-generated sight and sound. VR thus offers a new human-computer interaction paradigm which can improve the user's understanding of and interaction with 3D information spaces in diverse applications domains such as design, data visualization, training, education, and medicine. Stereoscopic VR systems generate imagery by presenting a separate perspective image to each eye. As a result, the user perceives a single, true 3D image that appears to exist in front of and behind the physical display surface. While stereoscopic display is an important and common feature in VR systems, further research is needed because stereoscopic viewing raises concerns beyond those raised in monoscopic VR systems as the user travels through and manipulates the virtual environment. This is especially true for extended virtual environments where the scene contains rendered geometric detail at scales covering several orders of magnitude. In such environments, users need to zoom in and out to move between detailed and global views. This project will investigate techniques for maintaining good stereoscopic viewing conditions under such conditions. The PIs will focus on stereoscopic Head-Tracked Display systems such as the virtual workbench (as distinguished from head-mounted displays in which the display surface is mounted on the user's head). The expected impact of this project will be better understanding and implementations of head-tracked displays based on a thorough geometric and analytic analysis of false eye separation and head-tracking distortions; new and improved techniques for automatic view optics adjustments and automatic view position adjustments to maintain good stereoscopic viewing conditions; and a systematic study of the compatibility between the above methods and the relevant geometric attributes of VR applications.","title":"New Methods for Maintaining Good Stereoscopic Viewing During Interaction with Large-Scale Head-Tracked Displays","awardID":"0332923","effectiveDate":"2003-03-10","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["472831"],"PO":["565227"]},"76447":{"abstract":"ABSTRACT<br\/>0228920<br\/>Stanley Steinberg<br\/>U of New Mexico<br\/><br\/>We propose to organize a workshop: Mimetic Methods for Discretizing Continuum Problems.<br\/>There are several di.erent research groups and individual researchers that have rather<br\/>recently realized that they working on discretization methods that have many common features<br\/>that we refer here to as mimetic. This workshop will be the .rst organized to bring<br\/>this group of people together for the first time.<br\/>There are many powerful methods for discretizing problem in continuum mechanics:<br\/>finite element, di.erence and volume methods;sp ectral methods;along with various generalizations<br\/>and combinations of these. Typically, these methods start with a continuummechanics<br\/>problem described in terms of partial-differential, ordinary-differential, integral,<br\/>and algebraic equation and then discretize this description of the problem. Some methods<br\/>may instead start with an integral description in terms of conservation laws or start with<br\/>the problem described in terms of differential forms.","title":"Workshop on Mimetic Discretizations of Continuum Mechanics","awardID":"0228920","effectiveDate":"2003-03-01","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["485507"],"PO":["321058"]},"82201":{"abstract":"There is an increasing need for scientists\/researchers in the United States who are knowledgeable about cluster computing; however, there are few opportunities offered at geographically remote locations to acquire this knowledge easily. Interested faculty and graduate students throughout the EPSCoR states are building their own clusters--ranging from small (8 nodes) to large (128 nodes)--and teaching themselves as they proceed; this is a slow process.<br\/><br\/>The Linux Cluster Workshop will increase the research and development competitiveness of EPSCoR states by enabling computational scientists and engineers todevelop applications that achieve maximum performance and scalability on Linux clusters of all sizes; system administrators will learn about issues related to the administration of Linux clusters in support of secure, reliable, and high-performance computing.<br\/><br\/>Prospective users of Linux clusters will find the workshops to be a detailed and informative introduction to the process of configuring, acquiring, and using Linux clusters. LCI technical materials highlight the information that scientific application developers and systems administrators need but cannot readily find elsewhere.<br\/><br\/>This workshop will further the ambitious outreach and education efforts of the WESNet<br\/>group of seven western EPSCoR states that have been collaborating in an effort to<br\/>introduce EPSCoR researchers to high-performance cluster computing activities. This will be one more step to optimally exploit our national talent for science and engineering and develop excellent centers of research and learning in every state in the nation.<br\/>Students trained on these clusters will be better prepared to assume the role of<br\/>computational scientists in high-performance computing upon graduation.<br\/><br\/>The Linux Cluster workshop will promote high-performance computing among a diverse group of EPSCoR researchers in a long-term effort to stimulate new collaborations and scientific research opportunities. The home states of these individuals will be more competitive in terms of securing new research funding and providing intellectual and computational assistance to private sector activities.","title":"EPSCOR: Workshop: Linux Cluster Workshop","awardID":"0307194","effectiveDate":"2003-03-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["461236","493848"],"PO":["551992"]},"78604":{"abstract":"Conversational interfaces hold the promise of providing natural, easy, and universal access to information. This project targets two specific problems in conversational engineering under a unifying stochastic modeling framework: (1) dialog interaction modeling (2) user modeling in spoken dialog. These problems are related: user models are essential in designing optimal dialog strategies, while discourse state information is essential for user behavior modeling. Conversational participants -- humans or machines -- are modeled as stochastic dynamical systems, interacting with one another over a noisy communication channel. Noise in the channel may be due to errors in machine speech recognition, language understanding, or other machine\/user communication errors. Algorithms based on mathematical game theory and robust design are formulated for derivation of optimal mixed-initiative dialog control strategies. The approach to modeling user behavior is data-driven with an emphasis on behavior under error conditions and on the inclusion of automatic emotion tracking. Again, a unified statistical framework provides a way for integrating multiple sources of information (e.g., acoustic, lexical, nonverbal and discourse) based on information-theoretic principles. The research development will be based on annotated spoken language corpora from real human-machine dialogs from a variety of real application domains including air travel and call center applications and an immersive training system for military\/security applications being developed at the University of Southern California (USC).<br\/><br\/>The educational component creates a new curriculum in spoken language processing: a two-semester graduate sequence, developed for simultaneous offering both on campus and on USC ``Distance Education Network\" will target basic speech processing through the latest advances in speech recognition, speech synthesis, and spoken dialog. The courses are relevant to a wide range of programs, in addition to core electrical engineering, including computational linguistics, intelligent systems in computer science, integrated media and creative technologies, phonetics, and psychology. In addition, a unique interdisciplinary undergraduate course with a theme on human versus machine processing of spoken language will be developed and implemented. The research and education components are tightly integrated, with courses featuring the latest research results through demonstrations and hands-on projects, with an emphasis on `learning by doing'. Likewise, research serves as an effective vehicle for education in terms of enabling the training of both undergraduate and doctoral students. <br\/><br\/>This project in spoken language engineering is unique in terms of its scope and societal relevance, spanning both fundamental and applied aspects of spoken language research, including an industry perspective, and creating synergies with other activities within the university in multimedia, natural language processing, and agent technology. It will serve as a vehicle to promote cross-disciplinary graduate and undergraduate research and education.","title":"CAREER: Modeling and Optimizing User-Centric Mixed-Initiative Spoken Dialog Systems","awardID":"0238514","effectiveDate":"2003-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7274","name":"HUMAN LANGUAGE & COMMUNICATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["515830"],"PO":["565215"]},"77736":{"abstract":"Data-intensive applications such as data mining demand significant compute and I\/O resources. With the ubiquity of World Wide Web and the advances in clustering technologies, it becomes a reachable goal to bring these data-intensive applications to a large number of users in real-time. Online applications such as Internet services differ from their offline counterpart in the performance sensitivity to highly concurrent workload and the availability requirement. It is challenging to achieve high performance, reliability, and efficient resource management for these applications under highly concurrent workload.<br\/><br\/>This project addresses the system and programming-level issues in building<br\/>high performance and reliable runtime support for highly concurrent<br\/>network services and online applications. There are three main research<br\/>thrusts in this project. First, cluster-based system architectures are studied with a focus on overall system scalability\/availability as well as load balancing and data replication support. Secondly, this project investigates programming and runtime support to simplify the development and deployment of online applications that involve concurrent and parallel data manipulation on clusters. Thirdly, a cluster-based resource management framework will be developed with the combined goal of quality-of-service and overall resource<br\/>utilization efficiency. Throughout this project, efforts will be made to<br\/>examine data-intensive applications and validate the effectiveness of the<br\/>proposed work. Additional issues will be investigated as more experience<br\/>are gained through system development and application evaluation.<br\/>The developed software will be released in public for potential use of other<br\/>applications.<br\/><br\/>Since more and more data-intensive services are being made<br\/>available through intranets and the Internet, it is expected that the<br\/>developed results will have broad impacts. Research described in this proposal will directly benefit instruction improvement for undergraduate and graduate education at PIs' institutions and enhance students' experience in cluster-based<br\/>computing.","title":"SOFTWARE:\"Cluster-based Runtime Support for Data-Intensive Online Applications\"","awardID":"0234346","effectiveDate":"2003-03-15","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["486626","550397"],"PO":["565272"]},"78506":{"abstract":"The goal of this research and education plan is to broaden the participation of historically underserved groups in the information society by identifying cultural patterns, social networks and other socio-cultural factors that structure information technology access and use. The research approach will involve long-term partnerships and continuous interaction with the Belmont community in West Philadelphia, and will merge scholarship with ongoing programs in the community. Through reciprocal learning and sharing of expertise, researchers, university students, and community leaders will work together to identify the particular problems to be addressed, to define researchable questions, and to conduct research projects. Research findings and emergent theory will then be translated into culturally based, theory driven interventions aimed at increasing the technology capacity and sustainability of the community based organizations to better serve their clientele. The research results will also make broader scholarly contributions through the extension of midrange theory that explains the socio-cultural influences, differential impacts, and responses to information technology. In addition, the results will make practical contributions through the development of interventions such as educational opportunities and curricular resources, and recommendations for public policy and future research.","title":"CAREER: Broadening the Participation of Historically Underserved Groups in the Information Society","awardID":"0238009","effectiveDate":"2003-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["523742"],"PO":["564456"]},"81763":{"abstract":"Meta-computing was implemented by many projects among which GLOBUS is the most widely known. Experiments with large configurations and real applications have shown that the latency of wide area networks is prohibitively high and that substantial bandwidth can hardly be achieved. Our recent research on efficient algorithms for the meta-computing of Partial Differential Equations (PDEs) has shown that it is feasible to design efficient algorithm for meta-computing of unsteady combustion problems or elliptic solvers on three dimensional Cartesian grids. The development of such algorithms is (very)<br\/>difficult. For Poisson or Helmholtz operators, the speed of propagation of information in the spatial domain is infinite. However, (1) information that propagates at infinite speed can be damped in space relatively quickly according to Green function properties and (2) more than 90 per cent of the information carried in a practical computation is noise. We are designing a family of domain decomposition methods that can rigorously take advantage of both factors.","title":"ALGORITHMS: Efficient Algorithms for Metacomputing of Partial Differential Equations (PDEs)","awardID":"0305405","effectiveDate":"2003-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["540798"],"PO":["565272"]},"78519":{"abstract":"Cooperating underwater robots must coordinate their actions despite severe communication bandwidth limits that exist underwater. This proposed research addresses the coordination of underwater robots through the development of theoretically justified decentralized control laws that enable a platoon of autonomous underwater vehicles to cooperatively achieve a common goal while requiring minimal communication. Fully realistic field trials are a crucial adjunct to our analytic activities. In a collaborative effort with biologists and marine scientists, platoons of small, inexpensive, autonomous underwater vehicles will be deployed in a large coastal estuary to rapidly and adaptively map bio-active chemicals. Education and outreach will be integrated with the proposed research through both the development of a new course on the dynamics and control of underwater robots, and the creation of a new autonomous underwater vehicle contest for middle school and high school students in collaboration with colleagues at MIT and the Association of Unmanned Vehicle Systems International. The intellectual merits of the proposed research include the development of an improved toolbox of distributed control laws and an improved understanding of communication requirements for platoons of autonomous vehicles in unstructured, real-world environments. The broader impacts of this research effort include: the development of affordable technology that will enable ocean and marine scientists to conduct scientific investigations that are not otherwise possible; the development of curriculum, course materials, and laboratory projects for underwater robotics; and the creation of an autonomous underwater vehicle contest that is accessible to middle school and high school students.","title":"CAREER: Cooperating Underwater Robots: Theory and Practice","awardID":"0238092","effectiveDate":"2003-03-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["241019"],"PO":["387198"]},"77717":{"abstract":"Efficient numerical algorithms play an increasingly important role in computational sciences to make large scale computer simulations tractable. Solution of very large sparse matrices has been one of the most time-consuming parts of many large scale high performance computer simulation problems. One of the important tasks in high performance scientific computing is to identify which solver is suitable for what class of applications (sparse matrices), and which sparse matrix can be solved by what solver. We will use the techniques<br\/>and ideas in knowledge discovery and data mining to extract useful information and special features from unstructured sparse matrices and to design appropriate strategies to match sparse matrices and solvers.<br\/><br\/>The outcome of this exploratory study is some important preliminary data and database to demonstrate the feasibility of building a software environment for high performance scientific computing applications based on mining sparse matrices and extracting features.","title":"SOFTWARE: A Software Environment for High Performance Scientific Computing Applications","awardID":"0234270","effectiveDate":"2003-03-15","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["94260"],"PO":["551992"]},"84605":{"abstract":"EIA- 0317269<br\/> Hsinchun Chen<br\/>University of Arizona<br\/><br\/>Title: NSF Workshop: Symposium on Intelligence and Security Informatics<br\/><br\/>This NSF Workshop: Symposium on Intelligence and Security Informatics aims to provide an intellectual forum of discussions among previously disparate communities: academic researchers (in information technology, computer science, public policy, and social studies), local, state, and federal law enforcement and intelligence experts, and information technology industry consultants and practitioners. The workshop will bring together noted informatics, computer science, and policy researchers and progressive leaders in law enforcement and security communities to engage in productive dialogues and explore avenues of collaboration. The workshop will help identify promising computer science and informatics techniques and methodologies for national security applications, and help develop close and productive partnerships between researchers and local and federal law enforcement practitioners. The Symposium on Intelligence and Security Informatics will solicit high-quality research papers of relevance to intelligence and security research, which will be peer reviewed by both researchers and practitioners.","title":"Workshop: Symposium on Intelligence and Security Informatics","awardID":"0317269","effectiveDate":"2003-03-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["548216","387279"],"PO":["565136"]}}