{"20829":{"abstract":"Efficiently supporting shared memory on top of commodity hardware is one of the greatest challenges to widespread acceptance of parallel computing. Coherence is the central problem: data in a large-scale system must be replicated and kept near to the processors that use them, but changes must be communicated to all of the copies. This research addresses this problem through a distinctive combination of software and low-cost hardware, and through an active integration of \"behavior-driven\" coherence protocols with compiler-based program analysis. Applications to be studied include collaborative work with researchers in Economics, Biology, Radiology, Genetics, data mining, computer vision, and virtual reality. The hardware base for the research is a cluster of eight multiprocessors (32 processors total) acquired under a collaborative agreement with Digital Equipment Corporation, and connected by DEC's new Memory Channel network. By directly accessing remote memory, the network allows processors to interact two orders of magnitude faster than they can in comparable systems. Software coherence protocols can exploit this fast communication to maintain directories, implement synchronization, and avoid interrupting the work of remote processors. The ultimate goal of the research is to obtain supercomputer performance for both traditional and emerging applications on networks of commodity machines.","title":"Experimental Evaluation of Software Coherence for Next-Generation Networks","awardID":"9705594","effectiveDate":"1997-06-15","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["564815","556692","280792"],"PO":["179487"]},"19282":{"abstract":"This project focuses on three problem areas in the theory of computational complexity. The first part aims at showing that in the context of computations which operate in limited work space, the use of randomness does not significantly increase computational power, with the goal of increasing our overall knowledge about the role of randomness as a tool in computation. The second part aims at ascertaining the computational limitations of small boolean circuits, with the goal of better understanding the aspects of computational problems that require more computational resources. The last part aims at improving the best known algorithms for exact solution of the fundamental graph coloring problem, with the larger goal of developing tools that may be more broadly applicable to speeding up wider classes of hard computational problems.***","title":"Studies in Computational Complexity","awardID":"9700239","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518427"],"PO":["528421"]},"19870":{"abstract":"A central aspect of a natural language understanding (NLU) system is the creation and manipulation of complex symbolic structures that encode grammatical knowledge. However, equally important is the ability to weigh numeric influences, such as lexical frequencies, that determine the preferred interpretation of an ambiguous utterance. Traditional approaches to NLU have emphasized the symbolic aspects of language, while connectionist models have focused on the numeric aspects. In this research, a hybrid connectionist framework is developed that fully integrates the two types of knowledge within a uniform computational approach. Within an implemented prototype, symbolic feature passing encodes the rich grammatical structures of a recent linguistic theory, while competitive numeric processing captures the influences that disambiguate an utterance. This project involves a number of extensions to the model that necessitate significant developments in the integration of symbolic and numeric processing within a parallel network architecture. Novel algorithms are explored within distributed symbolic processing and the control of complex competitive dynamics, especially focusing on the structural and numeric influences of individual lexical information. The research also investigates the hypothesis that accurate numeric preference information can be extracted from large text corpora.","title":"CAREER: Modeling Linguistic Competence and Performance in a Hybrid Connectionist Framework","awardID":"9702331","effectiveDate":"1997-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["89656"],"PO":["564456"]},"14183":{"abstract":"Over the past few years, several robust algorithms have been developed for solving nonlinear mixed complementarity problems, along with software aimed at making these algorithms accessible to researchers with applications that employ the complementarity framework. This proposal aims to continue and extend this work by considering the complete solution process for complementarity modeling in an interdisciplinary setting. The emphasis of the proposal is on developing new practical computational methods that will robustly solve the large-scale engineering and economic problems that will be formulated as part of this proposal in consultation with application experts. In contrast to much of the algorithm work that has been carried out to date, the solvers will be augmented with special purpose techniques that will attempt to automatically convert models to algorithmically advantageous forms and to diagnose deficiences in a given model. This will enable much quicker solution of many applications, since the solution time of an algorithm is typically much less that the time taken to develop, modify and refine the underlying models. It will be ensured that the algorithms and tools being developed are general purpose, easy to use and as informative to the user of the algorithms as possible. A direct interaction with experts in several application areas will determine how various physical phenomenon can be succinctly modeled using the notion of complementarity. As well as providing an automatic translation mechanism to convert nonlinear programs into mixed complementarity problems. The project will address the use of the complementarity framework for integrated assessment models in economics and fracture problems in structural engineering.","title":"Applications, Algorithms and Extensions of Complementarity","awardID":"9619765","effectiveDate":"1997-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["520933"],"PO":["187585"]},"19430":{"abstract":"CDA-9700732 Mutka, Matt W. Rover, T. Diane Wey ,Chin-Long Cheng, Betty Michigan State Combined Research-Curriculum Development Program (CRCD) VESL: Visions for Embedded Systems Laboratories The VESL (Vision for Embedded Systems Laboratories) project addresses three needs in undergraduate computer engineering education: (1) providing students with hands-on, real-world experiences in embedded computer system development in an active, collaborative learning environment; (2) increasing accessibility of specialized laboratories to students to allow different learning paces and approaches and to support different contexts and types of interaction; and (3) sharing costly laboratory resources with other universities. The focus for the curriculum development is embedded computing systems. Research results in real-time computing, software engineering, and wireless systems, including such topics as ubiquitous computing, scheduling, monitoring and debugging, codesign, testing, and software prototyping, will be transferred to the instructional domain. Instructional modules will be developed according to the \"Open You I's\" paradigm, which views learning as a process of Introduction, Instruction, Illustration, Investigation, and Implementation. Laboratory development will impact introductory courses through senior design project courses via an array of laboratory experiences, including a radio-controlled cars project and industry-sponsored projects. Realistic design experiences will provide students with greater insight about the functionality, reliability, and other properties of an embedded system.","title":"Combined Research-Curriculum Development Program VESL: Visions for Embedded Systems Laboratories","awardID":"9700732","effectiveDate":"1997-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":["438098","550895","152237","543568"],"PO":["173164"]},"14140":{"abstract":"9619638 The research proposed focuses on algorithmic aspects of programming language theory and pragmatics, continuing the research agenda of the principal investigator. Further investigation is targeted on the area of optimal evaluation for lambda-calculus, concentrating on relevant cost models, the necessity of and possible improvements to bookkeeping for sharing, with applications to linear logic and game semantics. A long-range goal is to investigate optimal evaluation as a possible implementation technology for functional programming. In addition, work will be continued on syntactic approaches to parametricity and reasoning about polymorphic programs based on their types, on fixed-rank type inference, typed lambda-calculus as a venue for capturing complexity classes, and intensional properties of contraction of proofs to programs as a general technique for program synthesis. Some of the work will also be relevant to curriculum development, even at the undergraduate level. ***","title":"Programming Language Foundations of Computation Theory","awardID":"9619638","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["370683"],"PO":["150697"]},"19695":{"abstract":"The proposed research aims to intestigate models of dialogue that can support robust and flexible interaction between people and computer systems. When computers are used to teach users about a new topic or technique, users may have difficulty understanding the knowledge and reasoning behind the system's answers. To address this difficulty, this research will specify a computational theory and methods to allow systems to vary the presentation of material dynamically. Specifically, this project will address two important research issues. First, it will provide a specification and representation of the linguistic, intentional, and social information that influence people's understanding of an ongoing dialog and that allow for the detection of misunderstanding, if it should arise. Second, the research will provide methods for integrating and employing these information sources to produce relevant utterances and to identify and resolve communication problems as they arise. Evaluation of the approach will employ two tutoring systems that are under development: one that explains medical concepts and one that teaches general life skills, such as good nutrition and budgeting. Final evaluation of the proposed research will be based on testing with end-user populations, runtime performance, and technical correctness.","title":"CAREER: Integrating Multiple Knowledge Sources for Robust Human-Machine Communication","awardID":"9701617","effectiveDate":"1997-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["186932"],"PO":["193961"]},"14031":{"abstract":"This project continues a long-term effort in the area of language learning, a problem of great scientific and applied importance. The same formalisms that are used to describe natural languages such as English are being applied in a wide range of areas from physics to biology enhancing the general applicability of results. A characteristic of these language-like formalisms is that their learning takes place on both a structural syntactic plane and a semantic plane, and these are both integral to the system. Although this research started from first principles in biology, linguistics and computation, intermediate results of practical importance are being produced. The research now seeks to overcome some of the limitations that have been uncovered in the original problem formulation, using a more utilized previously. A new approach to meaning representation involves active components, in combination with the more static visual scenes previously used. If successful, this continuing project will provide the first scientifically coherent theory of human concept formation and language learning that covers the full range of essential issues.","title":"Language Learning and its Applications","awardID":"9619293","effectiveDate":"1997-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":[35637,35638],"PO":["565227"]},"19311":{"abstract":"The thrust of this project is to extend the underlying theory, enhance, perfect, test, and write applications for the Octopus System which was developed by the PI during 1994-96. Octopus is a uniquely novel software layer that harnesses together the computing power of clustered workstations or PC boards to produce a fault-tolerant, scalable system which provides high throughput and fast turnaround for large parallel computations. Octopus is based on and realizes previous and current fundamental work and is a prime example for theory translated into an actual system. The project continues the fundamental work side by side with the system building work, to the mutual benefit of both, and investigates further applications of randomization. Over the past four years the PI has innovated, in collaboration with others, a theory of asynchronous parallel computations. The Asynchronous Parallel System (APS), consists of a number of processors executing at possibly different rates and addressing a logically (but not necessarily physically) shared memory. The theory showed how to efficiently simulate the execution of parallel programs written for synchronous parallel computers without faults on realistic asynchronous parallel systems in which processors may also fail. The most efficient simulations were developed for large-grained n-thread parallel programs. In such a program most threads execute a substantial block of instructions within each parallel step, and the program variables comprise a large number of memory words (examples are: a row of a large matrix, or a string of keys in a parallel merge-sort). A cluster of workstations or PC boards connected by a high bandwidth switch is one realization of the APS model. The asynchrony arises from the absence of a common driving clock and the fact that each node may be multi-programmed. The Octopus System consists of such a cluster managed by the Octopus layer. The system is up and running and realizes the control, loa d distribution, and fault-tolerance properties of Octopus.","title":"Theory and System Building for Asynchronous Parallel Computing","awardID":"9700365","effectiveDate":"1997-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["184097"],"PO":["150516"]},"19234":{"abstract":"Finite-model theory is the study of first-order logic and its extensions on classes of finite structures. In recent years, several extensions of first-order logic have been investigated in the context of finite-model theory. Fixpoint logic and the finite-variable infinitary logic IL have turned out to be of particular importance. The study of fixpoint logic generated interactions with both database theory and complexity theory, while the finite-variable infinitary logic IL proved to be a useful tool for analyzing the expressive power of fixpoint logic. In addition to being a proper extension of fixpoint logic, IL enjoys a game- theoretic characterization and possesses interesting structural properties, such as the 0-1 law. This project studies variable-confined logics, that is, logics with a fixed finite number of variables. This is motivated by the fact that the number of variables is considered a logical resource in descriptive complexity theory and has computational implications also in the evaluation of database queries and in program verification. Various aspects of variable-confined first-order, fixpoint, and infinitary logics, ranging from expressive power, algorithms for deciding truth and validity, and asymptotic probabilities, are studied.***","title":"Variable-Confined Logics in Finite-Model Theory","awardID":"9700061","effectiveDate":"1997-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565263"],"PO":["528421"]},"19873":{"abstract":"This award supports an integrated multidisciplinary program of education and research in computer engineering that addresses the real-time computational requirements of multimedia systems. The approach is based on parallel, fine grain hybrid analog-digital computing, using adaptation inspired by neuromorphic engineering to compensate for inaccuracies in the analog implementation. Research in this program is coordinated with classes, projects, and workshops in the curriculum of the university. At the graduate level, projects will include focal-plane arrays, speech classifiers, and A\/D converters. At the advanced undergraduate level, classes include experimental projects on a smaller scale.","title":"CAREER: Engineering Research and Education in Analog VLSI Parallel Computational Systems","awardID":"9702346","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["549477"],"PO":["549626"]},"20060":{"abstract":"This research pursues the design and analysis of multiuser optical communication systems to increase the performance, distance, and capacity of existing and future systems. The focus is on the physical layer - i.e., the actual single fiber links that connect the nodes of large. The intense demand for more data, voice, and video in and out of every home and office has led to multiuser systems that are typically broadband and high power, sometimes leading to severe linear and nonlinear degradation in the signal due to properties inherent to the fiber. Mastering these physical limitations can translate into a hundred to thousand fold increase in capacity of existing infrastructure, with a potential savings of billions of dollars. The goal of this research project is to identify, characterize, and combat signal degradation in fibers, and to use this information to design the highest capacity multiuser systems. While the physical properties of fibers have been broadly measured and defined, the proper design of fiber systems to optimize signal properties for communications has not been fully considered. A tool has been developed that provides a method of obtaining an analytical closed-form solution of a nonlinear differential equation describing the propagation of optical signals through silica fiber. The result is a Volterra model for the fiber which can be used to both quantify the signal degradation due to the fiber and to design algorithms and devices to combat this effect. The model will be used to analyze the performance of optical TDMA, CDMA, and WDMA networks including realistic distortions such as intermodulation products, intersymbol interference, and multiple user interference. This same model will then be used to define signal processing algorithms and corresponding nonlinear devices to combat signal degradation. The possibility of creating a communication system that uses the soliton waveform in multiuser systems will be studied. Solitons are hi ghly desirable in that they take advantage of the nonlinear fiber effects to cancel pulse dispersion caused by linear effects. Finally, effects such as nonlinear polarization on coherent light communication systems will be analyzed using a modification of our Volterra model. The education portion of this study includes three new courses for improving the instruction of undergraduates and graduates in optical communications and multiuser communication at the University of Virginia. Two courses emphasize development of the optical communication system from the ground up (without relying on the usual RF analog), followed by a third course in multiuser communication, tied directly to this and related research. The primary goal of an educational institution to prepare the new generations for tomorrow can be accomplished only if the institution responds to the needs of the current and future students. One important aspect of this goal is to respond to the increased interest of women in the field of engineering. Following her hypothesis that women are socialized to find importance in issues of human and social concern, this researcher will be active in modifying the current methods of teaching engineering to show the link between technical methodology and the resulting products and services. Students will be encouraged to work within well defined groups that echo the work place environment. Being a female in a field that is in transition from being male dominated carries the responsibility of being a role model. Female engineering students will be especially encouraged to participate in a mentoring program instituted to promote success, a sense of belonging and strong self esteem. World-Wide Web Link: http:\/\/watt.seas.Virginia.EDU\/~mb9q\/","title":"CAREER: Optimizing Fiber-Optic Communication Systems Through Analytical Modeling of Linear and Nonlinear Signal Degradations","awardID":"9703347","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}}],"PIcoPI":["523508"],"PO":["150411"]},"20072":{"abstract":"The process of creating a virtual environment or object in computer graphics typically begins with modeling the geometric and surface attributes of the objects in the environment along with any lights. Great effort has been expended to develop computer aided design systems that allow the specification of complex geometry and material attributes. Similarly, a great deal of work has been undertaken to produce systems that simulate the propagation of light through virtual environments to create realistic images. Despite these efforts, it has remained difficult or impossible to recreate much of the complex geometry and subtle lighting effects found in the real world. The modeling problem can potentially be bypassed by capturing the geometry and material properties of objects directly from the real world using some combination of cameras, structured light, range finders, and mechanical sensing devices. When successful, the results can be fed into a rendering program to create images of real objects and scenes. Unfortunately, these systems are still unable to completely capture small details in geometry and material properties. Existing rendering methods also continue to be limited in their capability to faithfully reproduce real world illumination, even if given accurate geometric models. This project will develop techniques for using a representation of light (radiance) as a basic primitive for computer graphics. This primitive will augment the traditional geometry-based primitives used in computer graphics. This framework will provide a unified method for encoding the complete appearance of a complex model, and allow the rerendering of an object at speeds independent of the its geometric or lighting complexity. Moreover, this framework will allow one to use a video camera to sample the radiance information of a real world scene or environment. This sampled information can then be organized properly to allow for redisplay of the scene interactively from any virtual camera at any viewpoint. The research is fundamental in that it explores an entirely novel primitive for computer graphics. This primitive is one of the most natural ways to represent the complicated visual information present in a scene. The research will facilitate the interactive viewing of captured real world scenes. No other known method has the ability to directly represent the information captured by a video camera, and use this information for interactive generation of new realistic images. The success of this project will have impact in such diverse fields as simulation, interactive virtual environments computer education, the visual archival of objects, and the transmittance of the appearance of objects in 3D catalogs.","title":"CAREER: Light: A Fundamental Primitive for Computer Graphics","awardID":"9703399","effectiveDate":"1997-06-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["183052"],"PO":["179846"]},"16365":{"abstract":"The project is oriented to demonstrate the use of a lexical-based parametric framework to accommodate automatic dictionary construction and to support a broad range of cross-linguistic phenomena. This effort not only provides a viable solution to resolving cross-linguistic distinctions in the context of a large-scale MT effort, capturing spatial, temporal, and aspectual knowledge, but also reduces the time for the development of large scale machine translation (MT) systems. The first task consists of determining the procedures for the automatic dictionary support for MT, with demonstration of its use to languages other than English such as Arabic and Korean. A second task consists of the extension of an existing MT model to include a broader range of different linguistic phenomena through an interlingua which accommodates the compositional derivation of spatial relations. A final task is the extension of current lexical-semantic representation to include temporal and aspectual knowledge.","title":"Presidential Faculty Fellowship\/Presidential Early Career Awards for Scientists and Engineers (PFF\/PECASE)","awardID":"9629108","effectiveDate":"1997-06-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["334102"],"PO":["565227"]},"20061":{"abstract":"This research explores sensor management in intelligent motion control systems with the main objective of describing and evaluating a mathematical model of what it means to pay attention to a sensor. A system model and control topology that reflects properties of the hardware, such as computation delays and communication limitations, is used. The amount of attention devoted to a device can be interpretated through the selection of feedback gains and the degree of communication bus access allocated to the device. Control synthesis with this model will address questions such as which sensors should be used for a task, what degree of coordination between devices is required, and is the system stable? The control design methodology will be applied to robotic applications. Successful completion of this research will enable designers of complex robotic systems to utilize a formal procedure in selecting sensors and in determining the required, or sufficient, coordination between motor subsystems, while still ensuring system stability. The other objective of this project is to develop curriculum in the area of intelligent machines, providing mechanical engineers with interdisciplinary skills and improving students' engineering problem solving skills. Both goals will be addressed through a hands-on undergraduate course in Robotics using a problem based learning (PBL) teaching methodology. Using PBL, students identify the theory required to solve a problem, learn the theory, and apply it. Thus students explore the relevant subjects as they see the need for them. A robotics course, with material from multiple disciplines, is suited to this approach. A graduate level Intelligent Systems course will also be developed.","title":"CAREER: Sensor Management in Intelligent Motion Control Systems and Learning About Intelligent Machines Using a Problem Based Approach","awardID":"9703352","effectiveDate":"1997-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["555023"],"PO":["234178"]},"19864":{"abstract":"This research investigates optimization methods for constructing higher-order learning machines to solve very large classification problems such as those found in data mining and character recognition. In higher-order learning machines, the input vectors are mapped nonlinearly into a higher-dimensional space and then a linear discriminant is constructed in the higher- dimensional space. The resulting discriminant function may be a polynomial, neural network, radial basis function classifier, or decision tree. Vapnik's Statistical Learning Theory is used within the problem formulation to avoid over-fitting or over- parameterizing the discriminant function. To solve the resulting minimization problem, innovative optimization methods are developed. This work will have both an educational and research impact. The optimization methods for classification problems will also be used within computer-based course materials for teaching concepts of mathematical programming and as a basis for research projects for undergraduates. The research impact will be the development of novel, fast, and accurate classification methods based on statistical learning theory. These methods will be applied to very large practical applications in a diverse set of fields, for example: character recognition in engineering, cancer diagnosis in medicine, database marketing in business, and prediction of mortgage prepayment in finance.","title":"CAREER: Optimization Methods for Higher-Order Learning Machines","awardID":"9702306","effectiveDate":"1997-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["554109"],"PO":["564456"]},"19644":{"abstract":"Parallel computing is becoming increasingly important to scientific advancement and economic development. For parallel computation to succeed we need to build machines that deliver high performance on real-world applications. This project attempts to measure application performance on networks of workstations and to implement applications to tolerate the high latencies in such networks. The initial applications under study come from computational biology and from geographic information systems. The integration of software, architectural, and applications topics will be emphasized both in research and in courses developed in this project.","title":"CAREER: Realizing Cost-effective Parallel Systems Using an Application-driven Approach","awardID":"9701475","effectiveDate":"1997-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["542015"],"PO":["197478"]},"19237":{"abstract":"Rewrite systems are sets of equations used to substitute equals for equals from left-to-right only. They have important applications to programming languages, since they represent a simple and intuitive functional language, and in automated deduction, where they play an important role in improving the efficiency of reasoning about equations. Termination of a system means that the equations cannot be used infinitely often, without reaching a term that does not contain an instance of a left-handed side. Proving termination can be difficult. (It is, of course, undecidable in general.) Under past support, a number of methods for proving termination were devised which have proved useful. New aspects of this subject are now being investigated with an emphasis on semantic methods for structured (hierarchical) systems and extensions of rewriting to handle conditional equalities, associative- commutative functions, higher-order rewriting, and a logic programming style. Since establishing termination is an essential component of many automated deduction and program verification systems, this project will also invest effort in implementations.","title":"Termination of Rewrite Systems","awardID":"9700070","effectiveDate":"1997-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[48787,"451105","77846"],"PO":["187585"]},"23780":{"abstract":"This award funds an initial exploration of a theoretical basis for visual image structure, to aid in supporting queries to image archives. Digital image archives are proliferating, which raises the question of how to retrieve specific images from them. However, while queries are naturally posed in high-level, functional terms, the realizations of such queries are based on low-level image operators. An intermediate-level theory of visual structure is necessary to close this gap, which is precisely what this research addresses. Based on an interpretation of edge elements as tangent estimates, it is derived from geometric measure and complexity theory. Viewed from below, the theory provides an organization for edge elements according to dimension. They are either bound into extended (1-dimensional) groups, into (2-dimensional) structural classes that abstract different types of texture, or (0-dimensional) orientation discontinuities. Viewed from above, the representation induces equivalence classes of structure, such as bounding contours, texture flows for hair and grass patterns, and ``T''-junctions for points of occlusion. Thus queries involving forests can be differentiated from those involving fur patterns or turbulent water, and multiple, overlapping objects can be separated into components. Furthermore, images and drawings can be segmented from pages of text.","title":"SGER: Intermediate-level Structural Categories from Visual Complexity Analysis","awardID":"9714331","effectiveDate":"1997-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["560901"],"PO":["475621"]},"22581":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. This project will provide partial support to expand the Georgia State University and the Georgia Institute of Technology's network infrastructure and implement a OC-3 ATM connection to be NSF supported the Very High Performance Backbone Network Service (vBNS). This proposal augments a previous award made under this program to Georgia Tech. Applications include: - Advanced Photon Source project - High Energy Physics - Astrophysics - Grand Challenge computational fluid dynamics - scalable libraries - meta-computing research - high speed image and video processing - coastal waterways simulation Collaborating with: - Air Force Rome Laboratories - Argonne National Laboratory - Army Waterways Experiment Station - Brookhaven National Laboratory - Cornell Theory Center - Fermilab - Illinois Institute of Technology - Lawrence Berkeley Laboratory - Lawrence Livermore National Laboratory - Maui High Performance Computing Center - Northwestern University - Old Dominion University - Purdue University - Stanford Linear Accelerator Center - Texas Institute for Computational and Applied Mathematics - University of Colorado - University of Florida - University of Washington The award provides partial support of the project for two years.","title":"vBNS Addition to the GCATT Broadband Internet","awardID":"9710442","effectiveDate":"1997-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[56716],"PO":["121202"]},"19656":{"abstract":"Knowledge-based learning environments can provide highly customized problem-solving experiences that are tailored to the individual needs of each student. This project creates the technology for a new generation of knowledge-based learning environments by developing real-time multimedia explanation generators with animated pedagogical agents. Prominently featured in learning environments, animated pedagogical agents can observe students' progress, provide them with visually contextualized problem-solving advice, and play a powerful motivational role. The project has three major thrusts: (1) developing a computational model of real-time multimedia explanation planning for dynamically creating customized multimedia explanations; (2) developing a computational model of animated pedagogical agents; and (3) conducting empirical evaluations of the pedagogical effectiveness of these models. In addition, the project also develops a teaching laboratory for multimedia technology and initiates a new multidisciplinary course on Knowledge-Based Multimedia Learning Environments. This work significantly advances the state-of-the-art in knowledge- based learning environments and human-computer interaction. Coupled with rapid advances in affordable multimedia hardware, the successful deployment of these technologies will have a deep and lasting impact on students at all levels. By achieving significant gains in learning effectiveness, these technologies will bring about fundamental improvements in both the classroom and the workplace on a broad scale.","title":"CAREER: Multimedia Explanation Generation for Knowledge-Based Learning Environments","awardID":"9701503","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["561013"],"PO":["565227"]},"19469":{"abstract":"CDA-9700828 Aggarwal, Sudhir Ghose, Kanad Gupta, Vipul Phatak, Dhananjay SUNY-Binghamton CRCD: High Speed Local Area Networks: Systems and Application Technological advances in microelectronics have made it possible to implement low latency and high bandwidth links for local area networks (LANS) but this does not automatically translate into high speed communication at the application level. Bottlenecks arise due to the protocol stack, operating system and the I\/O-network-memory subsystem. It is also necessary to understand how novel applications make use of tight coupling and how mobile applications exploit the capabilities of high speed LANs for their computing needs. This award will help to develop a two-semester course sequence, with appropriate laboratory exercises, that integrates into the curriculum new results relating to the design, implementation and use of high speed LANs. In the traditional computer science and engineering curricula, the requisite information is only partially covered in a number of separate courses, making it difficult to understand the tradeoffs in the systems and applications design. The main thrust in this project will be to abstract out and convey the key concepts, reinforcing them with a series of laboratory exercises that involve the design of key hardware and software systems components that lead to a full working high speed LAN supporting one or more targeted applications. Relevant topic will be gleaned from recent advances in the industry as well as the recent research literature.","title":"Combined Research-Curriculum Development Program High Speed Local Area Networks: Systems and Applications","awardID":"9700828","effectiveDate":"1997-06-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}}],"PIcoPI":["456348","494776","179836",49397],"PO":["297837"]},"19823":{"abstract":"This is a five year study for the development of a dependability evaluation framework and the tools for evaluating the dependability of computer systems. Tools being developed as part of this project include a portable dependability measurement tool to identify failure modes in Unix and Windows NT, a cyclotron- based transient fault injector, and a transient emulator that uses field- programmable gate arrays for fault simulation. Education plans include the development of courses at both the undergraduate and graduate level that introduce design and analysis for dependability. Also an interactive laboratory for student access to dependability analysis tools will be developed.","title":"CAREER: Measurement and Experimental Analysis of Computer Dependability","awardID":"9702111","effectiveDate":"1997-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":[50196],"PO":["549626"]},"19856":{"abstract":"Networks of workstations have been proposed for parallel computation, but slow and unpredictable communication has made performance worse than expected. This project is developing a network interface that reduces the cost of sending messages, to guarantee fast, fair, and predictable performance. The essential idea is to provide a virtual network interface for each user process, with registers for message buffering and with a simplified process to process communication path. The project is investigating several design issues within such an interface, including efficient user-level access to the interface, lazy swapping of interface state, access control, interactions with the operating system kernel, and network fairness. The educational portion of this project updates the computer engineering curriculum. At the undergraduate level this includes course material on processor architecture and pipelining. At the graduate level a course in advanced computer architecture is being developed, to span computer architecture from technological constraints through operating systems requirements. In addition to course work, students will be involved in hands-on digital design.","title":"CAREER: Fast Networking for Off-the-Shelf Multi-User Computers","awardID":"9702281","effectiveDate":"1997-06-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[50266],"PO":["197478"]},"19988":{"abstract":"The goal of this research is to investigate the use of critical-path length to accurately predict performance in several domains, including wide-area multithreading, microprocessor architecture, and high-performance filesystems. For wide-area multithreading, the strategy is to develop conservative work scheduling algorithms for a distributed-RAM model of computation, and to demonstrate that the critical-path length can be used to predict the performance of the resulting system. For microprocessor architecture, the strategy is to gain a fundamental understanding of the average parallelism of ordinary serial C programs by compiling them into dataflow graphs and measuring their critical-path length. Given that understanding, the effectiveness of hardware mechanisms can be evaluated. For high-performance filesystems, the strategy is to use critical-path length to measure the average parallelism of a filesystem workload. The educational component of this project includes teaching how to measure and achieve high-performance using a critical-path length methodology. A new course in advanced computer architecture is being developed which will focus on microprocessor performance, and a senior\/graduate-level operating systems course will be reoriented to emphasize performance. Eventually, a course on algorithmic parallel computing will be developed.***","title":"CAREER: Using Critical Path Length as a Practical Peformance Metric","awardID":"9702980","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["471720"],"PO":["250083"]},"22793":{"abstract":"This is a one year project to generate software and a pilot infrastructure for measuring Internet performance. The project could lead to positioning probe machines throughout the Internet to collect data to assist in identifying current and long-term performance characteristics of portions of the Internet and the overall system. The project is patterned after Network Probe Daemon (NPD), a prototype by one of the co-PIs which instrumented 37 Internet sites to perform the first large-scale measurements of end-to-end Internet behavior regarding routing and connection dynamics. This project also will establish the framework for producing a national Internet profile to record the network's performance over time.","title":"Creating a National Internet Measurement Infrastructure","awardID":"9711091","effectiveDate":"1997-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["562327","459054","94844","560044"],"PO":["121202"]},"20066":{"abstract":"This project is developing new InterSymbol Interference (ISI) and InterChannel Interference (ICI) cancellation methods in communication systems by using pre\/post coding via nonmaximally decimated multirate filterbanks. It will also provide up to date information in ancillary areas via several undergraduate and graduate courses. These include digital communication systems, error control coding, information theory and data compression, wireless digital communications, and multirate filterbanks and wavelets. It is of utmost importance that students are well trained in the rapidly growing multimedia communications area. It has been shown that any finite tap ISI that may have spectral-nulls (or frequency-selective fading) characteristics can be eliminated completely by using nonmaximally decimated finite impulse response multirate filterbanks in pre\/post coding. Moreover it has been shown that the precoding may be independent of the ISI channels and therefore feedback may not be necessary. In this research, not only the ISI but also random channel noise in communication systems is being considered as a whole. In particular, the multirate filterbank pre\/post coding for eliminating ISI, and the traditional error protection coding for correcting random errors, are being combined to achieve better performance that existing techniques. This pre\/post coding technique will also be applied to mitigate ICI in multiple-user communication systems, such as wireless mobile communication systems.","title":"CAREER: Intersymbol\/Interchannel Interference Cancellation Using Multirate Filterbanks","awardID":"9703377","effectiveDate":"1997-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["438661"],"PO":["564898"]},"19418":{"abstract":"EEC-9700702 Abstract The award provides funding to the University of Notre Dame under the direction of Dr. Michael M. Stanisic, for the support of a Combined Research-Curriculum Development project entitled, \"Vision-Based Control of Dextrous Manipulators in High Precision Tasks.\" This project will develop a four-course sequence for upper-level undergraduate and entry-level graduate students at the University of Notre Dame. The sequence will teach students about the design and control of a new class of dextrous manipulators, capable of manufacturing tasks which are prohibitively difficult or costly to achieve with existing technology. The capstone course in the sequence involves students programming a dextrous manipulatory to perform such manufacturing tasks, tasks drawn from an Industrial Advisory Panel, which is a key element of this project. The research aspect of the proposal extends the technologies involved, developing a new type of singularity-free manipulator, as well as extending the calibration-free, vision-based control algorithm to an easily used \"point-and-click\" means of task programming.","title":"Vision-Based Control of Dextrous Manipulators in High Precision Tasks","awardID":"9700702","effectiveDate":"1997-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1360","name":"HUMAN RESOURCES DEVELOPMENT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1480","name":"ENGINEERING RESEARCH CENTERS"}}],"PIcoPI":["139185",49243],"PO":["560483"]},"23137":{"abstract":"Modern cryptography relies heavily on assumptions about the asymptotic intractability of certain number-theoretic problems. However, at the implementation level, assumptions about the concrete complexity of problems of a fixed size must be made (e.g. the intractability of factorization assumption in practice is \"factoring 1024-bit cryptographic numbers is impossible\"). Determining what \"small-size\" is too small to be secure is the focus of this project: to design and implement algorithms which solve, in practice, those number-theoretic problems which are the pillars of modern cryptography. These problems which are vital to modern cryptography are i) the discrete logarithm problem; ii) deciding quadratic residuosity modulo a composite number; iii) factorization of cryptographic numbers. These three problems will be central to this project. The project will also consider a host of problems peripheral to these three: primality testing, fast arithmetric with large numbers, diophantine approximation, rapid factorization of small numbers, factorization of random numbers, and other problems that will surely arise as research progresses.***","title":"SGER: Concrete Complexity of Number-Theoretic Problems of Importance to Cryptography","awardID":"9712109","effectiveDate":"1997-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["139885"],"PO":["150516"]},"14249":{"abstract":"Sensor based planning incorporates sensor information into a robot's planning process, in contrast to classical planning which assumes the robot already has full knowledge about its environment. Many classical planners are complete, in that they can find a path in finite time or determine no such path exists. Most sensor based planners are heuristic algorithms that work well in a variety of environments, but have no proofs of correctness to guarantee a path can be found. Furthermore, they have no thresholds for when the heuristics fail. Typical complete sensor based planners do not consider real world issues such as sensor error. Moreover, they assume sensors have unlimited range and infinite resolution. The purpose of this research is to include ``real world'' issues into a complete sensor based planner. Such real world issues include dead reckoning, sensor limitations, and sensor error. This research will exploit properties of a geometric structure, termed a roadmap, to consider these issues. Although current work uses mobile robots as a test-bed, the results of this work can also be applied to highly articulated robots.","title":"Complete Sensor Based Planning in the Real World","awardID":"9619951","effectiveDate":"1997-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["553216"],"PO":["475621"]},"19859":{"abstract":"Toward the long term goal of developing computational tools for dealing efficiently with the complexity and the constraints of physical tasks, the research targets the solution of several well defined robotics problems and the improved understanding of algorithmic techniques that are useful for applications arising in the physical world. The core areas of research include the application of randomized methods to geometric problems, the incorporation of physics-based models and techniques in geometric frameworks, and the development of data structures for storing\/searching geometric data and for supporting continuous motion. A few key problems have been identified to guide and inspire research in the above domains. These are: assembly with emphasis on virtual prototyping for maintainability studies involving rigid and flexible parts, path planning in cluttered environments, and manipulation with emphasis on part orientation. Practical solutions will be sought for the above problems. The proposed research plan thoroughly integrates educational activities at Rice University. The main focus of these activities will be (a) the immersion of students, and especially undergraduates, into research projects, (b) the introduction of a course in robotics and the restructuring of basic theory courses to include algorithmic techniques that have been proven useful in graphics and robotics, (c) the mentoring of women students, and (d) the promotion of industrial and interdisciplinary training for Ph.D. students.","title":"CAREER: Robot Algorithms for the Physical World","awardID":"9702288","effectiveDate":"1997-06-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["557516"],"PO":["234178"]},"22752":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for two years for a DS-3 connection to the vBNS. Applications include Space Science and Engineering Center programs: Unidata, Geostationary Satellite Archive System and Remote Visualization; Biological Magnetic Resonance Data Bank; high energy physics; Integrated Microscopy Resource; Condor Flocks of Loosely Coupled Computers; Space Astronomy Laboratory; Virtual Designing in a Distributed Environment; and instructional video delivery. Collaborating institutions include the over 100 research institutions participating in the Unidata program, as well as Argonne National Laboratory, Fermilab, the University of Indiana and Yale University.","title":"Connection to the vBNS for the University of Wisconsin","awardID":"9710977","effectiveDate":"1997-06-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[57139,57140,57141],"PO":["182196"]},"23973":{"abstract":"This award supports a workshop to identify new challenges and future directions of research in computing systems, to be held in St. Louis on July 31 and August 1,1997. The objective of this workshop is to explore new paradigms in computing systems research by establishing synergy among different subareas of systems such as operating systems, computer architecture, compilers, networking, multimedia, and security. The goal of this workshop is to bring together leading experts from these areas to identify grand challenge problems in systems research, and identify potential quantum leaps that can be achieved by fostering a closer and focused collaboration among different areas. The workshop also plans to address the issue of building a national level infrastructure for systems research.","title":"A Workshop on New Challenges and Directions for Systems Research; St. Louis, Missouri, July 31 - August 1, 1997","awardID":"9714873","effectiveDate":"1997-06-15","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["13545","110629"],"PO":["250083"]},"22664":{"abstract":"Webster University will use this grant to connect eighteen of it's extended campus sites to the Internet. Webster University is a private college which it's main campus in St. Louis, MO and professionally staffed campuses in the US, Europe and Asia. Campus sites to be connected as part of this grant include: - Altamonte Springs, FL - Little Rock, AR - Bolling AFB, Washington DC - McConnell AFB, Wichita, KS - Colorado Springs, CO, - Northwest Plaza, St. Louis, MO - Denver, CO - Orlando-South, FL - Downtown St. Louis, MO - Pope AFB, NC - Greenville, SC - San Antonio, TX - Jeffersonville, IN - San Diego, CA - Kansas City, MO - Santa Teresa, NM - Las Vegas, NV - Space Coast, FL The University campus sites need the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the project for two years.","title":"Internet Connections for Webster University Extended Campus Sites","awardID":"9710644","effectiveDate":"1997-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[56926],"PO":["121202"]},"22830":{"abstract":"This award supports a two day workshop held April 24-25, 1997 at Northwestern University to address the technical issues of the wide area high performance networking infrastructure required for the Nation's research community. Participants primarily are representatives of the institutions with NSFNET Program high performance connections awards. The workshop is a follow-on to the November 1996 workshop at the University of Colorado which addressed the campus infrastructure necessary to interface properly with high performance connections.","title":"Workshop on High Performance Digital Communications and vBNS","awardID":"9711189","effectiveDate":"1997-06-15","expirationDate":"1997-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["320720"],"PO":[57343]},"22500":{"abstract":"9710233 Kopec, Richard L. St. Edwards University CISE\/GOALI: An Extended Visit to IBM GOALI(Grants Opportunities Liaison with Industry) funding of $16,795 has been awarded to St. Edward's University as partial support for Dr. Kopec on a sabbatical leave visit to IBM Corporation during the Fall Semester, 1997. Dr. Kopec is completing his term as Dean of the School of Natural Sciences at S.Edward's University and will be re-focussing on teaching and research in computer science(CS). He has arranged to join IBM's AIX development group where he will work on a number of projects related to the development of the AIX operating system. The GOALI initiative has a number of objectives, one of which is to support a faculty member in the development of creative modes of collaborative interactions with industry. Dr. Kopec will be strengthening an existing relationship with IBM AIX development system specialists, creating RISC laboratory application for CS courses, and implementing an undergraduates CS research program.","title":"GOALI: An Extended Visit to IBM","awardID":"9710233","effectiveDate":"1997-06-15","expirationDate":"1997-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["441289"],"PO":["297837"]},"19905":{"abstract":"The emergence of patterns as an organizational and design tool can help abate what Brooks calls the accidental complexity of software development. This project addresses practical and pedagogical concerns of the computer science and software engineering communities with an integrated approach to the use, learning, and teaching of patterns. Work in Design Patterns to date has focused on the recognition, cataloging, and finding of patterns with little attention to the use of patterns by experienced software practitioners and particularly by students and practitioners not well-versed in object-oriented technologies. The foundation of the project is the design, development, and delivery of a layered support structure for design patterns. The first layer focuses on how to use catalogs of patterns, idioms, and architectures accessible to those without a deep background in object-oriented programming and methodologies. The second layer builds on this catalog by developing methods for using patterns based on heuristics for recognizing when specific patterns are applicable and relevant. As part of both layers, the project bridges the gap between novice and expert designers by developing resources to aid in the recognition and discovery of patterns.","title":"CAREER: Using and Developing Design Patterns in Undergraduate Computer Science Courses","awardID":"9702550","effectiveDate":"1997-06-15","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7410","name":"DUE COURSE & CURRICULUM PROG"}}],"PIcoPI":["531300"],"PO":["564388"]},"11534":{"abstract":"This project is cooperative between the University of Michigan (Papaefthymiou) and the University of Rochester (Friedman). It is exploring electronic design automation methods for optimizing high performance, high complexity VLSI\/ULSI circuits. The focus is on retiming and clock scheduling, two complementary circuit optimization strategies that have attracted significant attention. Retiming is an architectural-level transformation method that speeds up a synchronous digital design. Clock scheduling is a circuit-level optimization that increases the operating speed of a digital design. The approach is to merge these two methods into a single powerful optimization process that will handle comprehensive delay models. Problems being investigated are: (1) Finding enhanced circuit models that consider physical and electrical issues related to submicrometer technologies; (2)Developing a theoretical yet practical framework for simultaneous retiming and clock scheduling based on these physical & electrical models; (3) Designing and evaluating polynomial-time approximation algorithms for integrated retiming and clock scheduling. Software developed during the project is being widely distributed.","title":"Synchronous VLSI Circuit Optimization via Integrated Retiming and Clock Skew Scheduling","awardID":"9610108","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["550681"],"PO":["564898"]},"20499":{"abstract":"This research deals with issues related to the efficient use of parallel I\/O systems. These include problems of data placement, caching, and prefetching and their interaction in determining system performance. The project involves the development of robust parallel I\/O models that incorporate these requirements, and designing new algorithms to obtain desired performance levels. This includes identifying the appropriate policies for resource management in the context of both single and multiple interacting computational and I\/O streams, and the development of suitable algorithmic strategies. The focus is on on-line buffer management and prefetching algorithms with bounded lookahead. The use of randomization in data placement and replacement, and issues arising in their implementation are under consideration. Theoretical analysis of the algorithms is based on a competitive framework to compare different on-line methods, and identify promising candidates. Suitable candidates will be implemented and their performance validated empirically. The areas of impact include, though are not restricted to, data-intensive applications like modern database and multimedia systems.","title":"Buffer Management for Parallel I\/O Systems","awardID":"9704562","effectiveDate":"1997-06-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["410022"],"PO":["250083"]},"22953":{"abstract":"Information visualization is an increasingly important research and development area, crucial for the success of the information revolution. This workshop focuses on visualizing information and how users interact with digital information. Co-chaired by Nahum Gershon (The MITRE Corp.) and Jacques-Emile Dubois (CODATA International) it has an international committee of visualization experts from nine countries. The goals of the workshop are to bring together researchers and developers in information visualization from Europe, United States, and Canada for intensive brain-storming to accomplish the following: survey current activity in information visualization in Europe and the United States; identify research and development issues in visualization; and forge research collaborations between the United States and Europe. Although there has been a great deal of development of methods for visualizing diverse types of data and information, few algorithms and methods have been implemented to solve real-world problems, especially in North America. Since more research and development have been targeted at solving real problems effectively in Europe, they are ahead of U. S. research and development in applying visualization to operational environments. The focal point of this workshop is implementing visualization methodology. Combining the North American and European expertise is expected to result in enhanced effectiveness of visualization, enabling better communication of information and more effective use of the information highways, reducing the number of documents end users such as journalists must access.","title":"Paris Workshop on Visualization of Information and Data","awardID":"9711509","effectiveDate":"1997-06-01","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["246152"],"PO":["183208"]},"13647":{"abstract":"The key impediment to the widespread use of 3D layered fabrication like Shape Deposition Manufacturing (SDM) and micro-electromechanical systems (MEMS) processes is not the limitations of the processes themselves, but the ability of engineers to explore and master the expanded design space they enable. A design interface comprising an exchange format and an accompanying suite of services is proposed for these processes. This interface is based on formal representations of process-related constraints expressed in terms of three-dimensional design features with associated rules to ensure manufacturability. The interface specification will be build in collaboration with process developers at Stanford, Carnegie Mellon University and other institutions, and will build upon emerging standards for exchanging product specifications and representing manufacturing processes. In addition, the supporting communication infrastructure for exchanging design features, constraints, process capabilities and manufacturing analyses over the Internet will be developed. A series of design exercises are also proposed. The exercises will explore the ability of designers to construct libraries of re-usable elements to be scaled and miniaturized to take advantage of MEMS technology, and will explore the feasibility of integrating designs and processes from different institutions to create miniature electromechanical systems.","title":"A Design Interface for 3D Manufacturing","awardID":"9617994","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1463","name":"INTEGRATION ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"Z791","name":"ARPA-SOW-CODIFYING KNOWLEDGE"}}],"PIcoPI":["508165"],"PO":["564898"]},"23405":{"abstract":"There is a fundamentally new intersection of computer scientists, mathematicians and molecular biologists working in an area loosely known as DNA computation, in which the basic set of questions are in the process of being defined. The field was born in 1994 when Len Adleman (USC) showed how to solve a version of the traveling salesman problem using DNA (Molecular Computation of Solutions to Combinatorial Problems. Science, 266, 1021-1024, 1994). Adleman's paper had a catalytic effect on the scientific imagination even though it admittedly solved only a \"toy\" problem that could easily be solved using pencil and paper, let alone a teraflop supercomputer. By clearly articulating the principles of his computation, the massive parallelism inherent in DNA reactions, the energy efficiency of these reactions, and the enormous storage capacity of DNA, he challenged the community to discover the limitations of this approach. Furthermore, it is widely believed that, if these principles are scalable, the potential of DNA computation would be truly spectacular. Richard Lipton (Princeton) published a paper a few months later in Science (DNA Solution of Hard Computational Problems. Science 268, 542-545, 1995) generalizing Adleman's result to a fundamental problem in the class of problems known as NP complete. The objectives of the Third DIMACS Workshop on DNA Based Computers will be to present new work in the field and to disseminate in printed and electronic form, information in all areas that relate directly to computing with DNA including: algorithms, applications, techniques, architectures, practical obstacles to DNA based computers, proposed solutions to such obstacles, computational processes in vivo, and relevant ideas regarding biological evolution. We will encourage papers reporting experimental results. The Organizing Committee is composed of a diverse group of individuals from around the United States. The Committee has made a commitment to make sure that st udents and investigators with various and diverse backgrounds will attend the meeting. We expect approximately 200 individuals will attend. DNA Computation, is a relatively new field, without an established Journal. The June International Meetings are the focus for the field. The Conference will be held at The University of Pennsylvania, Philadelphia, Pennsylvania on June 23-25, 1997. The meeting will be announced in several scientific journals as well on as on a dedicated web site. There will be three days of talks with time for informal sessions and impromptu presentations. The Proceedings of the Conference will be disseminated, as before, by AMS- DIMACS.","title":"Workshop: Third DIMACS Workshop on DNA Based Computers, in Philadelphia, PA, June 23-25, 1997","awardID":"9713014","effectiveDate":"1997-06-15","expirationDate":"1998-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1107","name":"COMPUTATIONAL BIOLOGY ACTIVITI"}}],"PIcoPI":["461485"],"PO":["125630"]},"13209":{"abstract":"This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for two years to connect three schools in the school district to the Internet using wireless techniques.","title":"Massillon Connections Phase I","awardID":"9616780","effectiveDate":"1997-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[33433,33434],"PO":["121202"]},"22702":{"abstract":"Mercy College requested support from NSF to connect three of it's remote campus sites to the Internet. Mercy College will use this grant to connect its Bronx campus, White Plains campus and Yorktown campus to the Internet using a Manhattan based ISP called Panix. Mercy is a growing liberal arts college located in Westchester County, New York. It specializes in providing educational opportunities for under served populations. The remote campus sites to be served by the new Internet connections represent a current enrollment of approximately 2400 students. The campuses needs the Internet connection to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of this institution as well as the community in general. The award provides partial support of the projeat for two years.","title":"INTERNET Connections for Three Mercy College Branch Campuses","awardID":"9710777","effectiveDate":"1997-06-01","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["123495",57020,57021],"PO":["121202"]},"22944":{"abstract":"This project will study the use of integer programming for register allocation and for important compiler optimizations that interact with register allocation. The project will build on the preceding work which shows that integer programming can produce optimal or near-optimal register allocations in reasonable time, providing significant reductions in register allocation overhead. The project's first objective is to achieve order of magnitude speedup in integer-programming-based register allocation by discovering and implementing more efficient integer-programming formulations. The project's second objective is to extend the scope of the integer programming formulation to include other compiler optimizations that directly interact with register allocation, such as common subexpression elimination and loop-invariant code motion. The extended formulation will allow register allocation and these interacting optimizations to be done simultaneously, eliminating the traditional phase ordering problem. It is expected that the extended integer programming formulation will provide significant code quality improvements, and that the new optimization can be done in reasonable time.","title":"A Framework of Modulo Scheduling Based on Finite State Automation","awardID":"9711477","effectiveDate":"1997-06-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["475422"],"PO":["250083"]},"20766":{"abstract":"Multirate digital systems have important applications in communication and signal processing including resampling, interpolation, narrow band filtering, fax systems, subband coding, transmultiplexing, multiresolution analysis, and waveletts. This research is developing algorithms for the systematic design of multirate signal processing systems based on a model-matching approach where an ideal system (model) is approximated by a practical multirate system consisting of components such as digital filters, modulators, and upsamplers\/downsamplers. The problem is to choose the parameters of the practical system so that the performance of the system is as close as possible to the ideal system. The measurement of the difference between systems used in this research is based on the difference in outputs of the two systems for all possible inputs. System parameters are chosen to minimize the maximum energy of the difference between output signals for all bounded energy input signals. This error measure gives systems where the quality of the approximation is insensitive to the particular type of input to the system. The most significant improvements over conventional designs are expected in complicated systems where intuitive design methods are limited, such as in the design of cascaded multirate systems.","title":"A Model Matching Approach to Multirate System Design","awardID":"9705349","effectiveDate":"1997-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["425835"],"PO":["564898"]},"11614":{"abstract":"Human intellectual capacity to manage complex design processes is continually thwarted by advances in scale and variety of VLSI technologies, increasing sophistication of synthesis and verification tools, and escalating time-to-market pressures. This research focuses on reasoning support tools for decomposing high-level system specifications into synthesizable components. The underlying format is rigorous enough to support, and in some cases supplant, formal verification tasks. Human interaction centers on a novel tabular notation developed by the PI, whose synchronous semantics matches the intended models in high level synthesis. Resulting software includes a system for animating behavior tables and mapping them to existing synthesis languages, a graphical interface for interactively building and manipulating behavior tables, and an integrated formal system for transforming and reasoning about them. These components can be used individually or in combination. The software is widely and freely distributed and is part of a repository of Scheme-based modeling tools.","title":"Hardware System Design with Behavior Tables","awardID":"9610358","effectiveDate":"1997-06-15","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["508374"],"PO":["564898"]},"22615":{"abstract":"This project supports the 27th annual Frontiers in Education Conference to be held in Pittsburgh, Pennsylvania in November 1997. The FIE Conference is co-sponsored by the IEEE Education Society, and the Education and Research Methods Division of the American Society of Engineering Education (ASEE). A primary goal of the FIE conference is to promote the widespread dissemination of innovation in teaching and learning in undergraduate engineering education. Presentations in technical sessions represent work at the \"frontier\" of education, and the format of the conference is designed to promote dialog between presenters and attendees. Funding from NSF has played a major role in increasing the quality of the conference in the last several years. Continued funding will support the \"NSF Project Showcase\" to feature successful NSF sponsored projects, including the successful Research Experiences for Undergraduates (REU) program. *","title":"1997 Frontiers in Education Conference","awardID":"9710521","effectiveDate":"1997-06-15","expirationDate":"1999-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7410","name":"DUE COURSE & CURRICULUM PROG"}}],"PIcoPI":["507372","549458","539293"],"PO":["119795"]},"22769":{"abstract":"This award is made under the high performance connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It provides partial support for the installation and operation of a DS-3 ATM connection to the nearest MCI POP for access to the Very High Performance Backbone Network Service (vBNS). Applications include: - Reliable Multicast: TMTP Protocol - The Unify System - Computational Materials Science Research - Materials Engineering Research - Molecular Dynamics Study of Large Scale Real Materials - Computational Particle Physics - Computational Fluid Dynamics - Numerical Analysis of Infrared Spectrometry for Medical Diagnosis Collaborating with: - Oak Ridge National Lab - National Energy Research Supercomputer Center - National Center for Supercomputing Applications The award provides partial support of the project for two years.","title":"University of Kentucky Request for High Performance Connection to vBNS","awardID":"9711020","effectiveDate":"1997-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1083","name":"DOMAIN NAME FUNDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["95769","530999","544789"],"PO":["121202"]},"13904":{"abstract":"If \"to err is human,\" then understanding the origin, nature, detection, and correction of errors should be an important goal for those engaged in the study of human-computer interaction. There are many ways in which we may err; the current proposal tackles one of the most modest, least studied, but most pervasive types of human errors: errors in performing simple, rule-based tasks. Rule-based tasks include tasks such as getting money from an ATM, programming a VCR to record a show, or using a browser to surf the web. Such tasks involve following a limited set of rules (i.e., well described procedures) to achieve limited, but well defined goals. They do not involve problem solving or creativity. Though seemingly modest in terms of their demands upon human cognition, the prevalence of errors in such tasks seems constant and high even with experienced users. The increasing number of such tasks at home (e.g., programmable voice-mail, thermostats, and bike odometers) and work (e.g., flight management computer on advanced commercial aircraft, routine use of spreadsheets or databases, and email systems) suggests that an indepth understanding of errors in these tasks could significantly improve the design of many simple but important interactive tools.","title":"The Origins of Errors in Rule-Based Programming Tasks","awardID":"9618833","effectiveDate":"1997-06-01","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["505248"],"PO":["565227"]},"20009":{"abstract":"An integrated program of research will develop techniques for building concurrent software and techniques for specifying properties of and validating concurrent software. The construction of concurrent software is supported by engineering coordination abstractions that capture common patterns of communication, synchronization and process inter- connectivity. This work focuses on development of abstractions that satisfy the needs of a class of real-world problems, specifically scientific computing problems. The effectiveness of these abstractions is evaluated by applying them to the solution of real-world problems. Measurement of development costs for solutions developed using abstractions and alternative concurrent programming technologies will form the basis of empirical evaluation to characterize the relative merits of coordination abstractions. The validation of specifications of correctness properties of concurrent software is investigated using a program flow analysis called FLAVERS. This work focuses on incorporation of abstractions in FLAVERS to increase both the speed of analysis and the accuracy of analysis results. Evaluation of the effectiveness of FLAVERS is assessed by applying it to the verification of common classes of correctness properties and to real-world concurrent applications, such as those built with coordination abstractions.","title":"CAREER: Engineering High-Quality Concurrent Software","awardID":"9703094","effectiveDate":"1997-06-15","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["561782"],"PO":["397849"]},"10938":{"abstract":"This three-year award for U.S.-France cooperative research in mathematics involves Robin Thomas of Georgia Institute of Technology, Paul Seymour of Princeton University, G. Neil Robertson of Ohio State University and the research group of Bruce Reed of the University of Paris VI. The award provides travel support and living expenses to the three U.S. researchers. They intend to develop a theory of digraph minors with particular emphasis on tree decompositions. This theory will be analogous to graph minor theory which has led to efficient algorithms. The project takes advantage of French expertise in graph minor theory and will contribute towards a new structural theory.","title":"U.S.-France Cooperative Research: Digraph Minors","awardID":"9603321","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}}],"PIcoPI":["540248","240847","537839"],"PO":["323582"]},"11928":{"abstract":"In the past 15 years, there have been several major conceptual and practical advances in coding, modulation, and signal processing for digital data transmission and storage. These have resulted in the realization of data rates approaching theoretical limits for voiceband data modems; areal densities approaching one gigabit per square inch in disk-drives for desk-top computers; and, most recently, end-to-end data transfer reliability achieved at signal-to-noise ratios only slightly beyond the Shannon lower bound. These advances include: the development of trellis-coded modulation for bandwidth-limited channels; the application of communication theory to digital recording channels ; the emergence of a theory of code design for input-constrained channels; and the development of iterative, \"turbo\"- decoding techniques for long \"random\" codes. Despite this progress, there remain many fundamental and practical problems that must be addressed, both to better our understanding of existing approaches and their applicability, as well as to offer new tools for use in building future data communications and storage and communication systems. This project will focus on problems in coding and modulation, particularly for application to high density digital recording and multi-user wireless communications. The objective is to develop coded-modulation techniques for efficient data storage and transmission in the presence of various channel impairments, including: input constraints, inter-symbol interference (ISI), co-channel interference (CCI), additive noise, and signal fading. A component of the research will be the investigation of the complexity of algorithms and architectures that implement these techniques. Another goal of the project is to enhance the educational infrastructure by integrating the research results and relevant background material into existing and new engineering courses at UCSD. Courses will be developed on the topics of 1) Coded-Modulation for Data Transmission and Storage, and 2) Symbolic Dynamics and Constrained Coding. --","title":"Coding and Modulation for Digital Recording and Communications","awardID":"9612802","effectiveDate":"1997-06-01","expirationDate":"2001-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["522738"],"PO":["150411"]}}