{"49390":{"abstract":"","title":"SGER: Designs for High-Performance Fault-Tolerant Disk Arrays","awardID":"9996375","effectiveDate":"1999-06-15","expirationDate":"2000-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[126299],"PO":[126300]},"38192":{"abstract":"9875324 Chakrabarty, Krishnendu<br\/>Embedded cores are being increasingly used in large system-on-a-chip (SOC) designs. These complex, pre-designed functional blocks facilitate design reuse, allow greater on-chip functionality, and lead to shorter product development cycles. However, the increased use of cores has greatly exacerbated the testing problem. This research is directed at several fundamental issues in core testing using precomputed tests. In order to maintain intellectual property, core vendors do not reveal implementation details; instead they only provide precomputed test sets, which must be effectively utilized by the system designer. Research activities being carried out under this grant include: (1) Built-in generation of precomputed test sets for at-speed core testing; (2) Synthesis techniques for increasing transparency and test access, and the design of transparent space compactors for non-modeled faults; (3) Design of efficient test access architectures and optimal test scheduling for core-based systems.","title":"CAREER: Testing Core-Based Systems Using Precomputed Test Sets","awardID":"9875324","effectiveDate":"1999-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["506171"],"PO":["562984"]},"38084":{"abstract":"Abstract <br\/><br\/>IIS-9874781 <br\/>Rowe, Timothy <br\/>University of Texas, Austin<br\/>$158,510 - 12 mos.<br\/><br\/>DLI-PHASE 2: A Digital Library of Vertebrate Morphology, Using High-Resolution <br\/>X-ray CT <br\/><br\/>This is the first year funding of a three year continuing award. This project is an intensive application of high-resolution X-ray Computed Tomography scanning (X-ray CT) to the study of the vertebrate skeleton. The instruments are derived from of medical diagnostic CT scanners, and enable the non-destructive inspection of tiny 3-dimensional objects in extremely fine detail. This project is a collaboration among 24 researchers at leading research universities and natural history museums around the world. The investigators will build a novel digital library of high-resolution X-ray CT images and 3-D models. The library will enable more detailed and comprehensive analyses of vertebrate structure than previously possible and be accessible to a globally networked audience of researchers, educators, and students. The project will study the skeleton in all of its forms, from fossils to embryos and adults of living species. The study will include broad taxonomic diversity of important laboratory and research species, and sample the smallest four orders of vertebrate size-magnitudes.","title":"DLI-Phase 2: A Digital Library of Vertebrate Morphology, Using High-Resolution X-ray CT","awardID":"9874781","effectiveDate":"1999-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["536900"],"PO":["433760"]},"38360":{"abstract":"CCR-9876073<br\/>CAREER: Collaborative Memory<br\/>PI: Vincent W. Freeh<br\/><br\/>Latency to memory is ever-increasing and has reached the point where<br\/>conventional computer architectures are hitting a performance \"wall.\"<br\/>Concurrently, several emerging technologies combine processing and<br\/>memory in a single device. It is expected that in the near future<br\/>nearly all integrated circuits will have both logic and memory, called<br\/>\"processing in memory.\" This research creates \"collaborative memory\"<br\/>an active memory system that abstractly provides processing in memory.<br\/>It increases the end-to-end performance of applications and exposes<br\/>additional parallelism, and mitigates the effect of memory latency.<br\/>This research builds on the Modify-on-Access (MonA) file system, an<br\/>active file system that performs operation on behalf of an<br\/>application, which has been develop under the direction of the PI.<br\/>The research extends the MonA file system in two ways. One way is<br\/>closer to the microprocessor, in the virtual memory system, through<br\/>fine-grain collaborative memory operations visible to an application.<br\/>The other way is farther from the microprocessor, in an intelligent<br\/>peripheral device. This offloads computation from the main<br\/>microprocessor to the peripheral microprocessor. Together the two<br\/>extensions create a system that increases performance, exposes<br\/>implicit parallelism, and tolerates memory latency without new<br\/>advances in compiler technology or programming languages.","title":"CAREER: Collaborative Memory","awardID":"9876073","effectiveDate":"1999-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["434617"],"PO":["241298"]},"49330":{"abstract":"","title":"Career: Properties of Typical Computable Languages","awardID":"9996310","effectiveDate":"1999-06-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["409161"],"PO":["150516"]},"38451":{"abstract":"9876441<br\/>Mahgoub, Imadeldin O.<br\/>Hsu, Sam<br\/>Florida Atlantic University<br\/><br\/>Infrastructure for Research in Mobile Computing:<br\/>Bandwidth Conservation Schemes and Protocols<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Implementation and Measurement of Delta Service in a Mobile File System Client Cache,<br\/>- Two-Layer Protocol Infrastructure for Wireless Local Area Network Applications, and<br\/>- Graduate Courses in Mobile Computing.<br\/><br\/>This award contributes to the support of a research facility at the Department of Computer Science and Engineering of Florida Atlantic University enabling experimental research in mobile computing. The experimental facility requested includes a wireless network consisting of one primary server, one backup server, and ten mobile clients. The research topics to be explored include bandwidth conservation schemes and wireless communications protocols. The following major research projects, among others, will benefit from the real-world mobile computing environment that will be provided by the proposed instrumentation: 1) Design, implementations, and evaluation of delta service extension to a mobile file system cache proposed to enhance bandwidth conservation by minimizing the amount of data transferred over wireless communications links. Bandwidth conservation is an important research direction, since network bandwidth stands as one of the resource limitations impacting the design of mobile computer applications; 2) Design, implementations, and evaluation of communication protocols for Ad Hoc Wireless Local Area Networks. Applications of such networks include mobile classroom, corporate meetings, press conferences, disaster avoidance and disaster recovery situations. Such networks will pave the way for enhanced communications capabilities in situations where the cost of having fixed wired networks is not justifiable.","title":"CISE Research Instrumentation: Infrastructure for Research in Mobile Computing: Bandwith Conservation Schemes and Protocols","awardID":"9876441","effectiveDate":"1999-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["522461","522462",97630,"173346"],"PO":["557609"]},"35350":{"abstract":"Abstract <br\/><br\/>IIS-9817484 <br\/>Crane, Gregory <br\/>Tufts University <br\/>$374,316 - 12 mos. (Jointly funded with SBE\/S&T Studies of the amount of $200,000 which totals the award to $574,316)<br\/><br\/>DLI Phase 2: A Digital Library for the Humanities<br\/><br\/>This is the first year funding of a five year continuing award. This project is focussing on developing the foundations of a scalable, broad-based, interdisciplinary digital library for the humanities. The principal investigators for this project include not only humanists but also specialists in computer-human interface design and in cognitive science. The goals are to both to improve the ways that humanists can perform their intellectual work and to design materials that are more accessible to the vastly expanded audience already reached by the World Wide Web. Digital libraries allow us to improve traditional teaching and learning; they also challenge us to redefine the relationship between the humanities and society as a whole. To achieve the goals, new document models must be developed to serve a more complex audience and which are designed to interact at various levels in diverse human and electronic contexts; that is, as part of a scalable, integrated digital library that can be maintained over time. Building on twelve years of development with the Greco-Roman world, the project team will create a digital library that includes a wide range of materials, ranging from ancient Egypt through nineteenth century London.","title":"DLI-Phase 2: A Digital Library for the Humanities","awardID":"9817484","effectiveDate":"1999-06-15","expirationDate":"2007-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1353","name":"Hist & Philosophy of SET"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"7444","name":"NATIONAL SMETE DIGITAL LIBRARY"}}],"PIcoPI":["467058","484739","519872","306548",88878],"PO":["433760"]},"35372":{"abstract":"Abstract <br\/><br\/>IIS-9817572 <br\/>Palakal, Mathew <br\/>Indiana University<br\/>$101,604 - 12 mos.<br\/><br\/>DLI Phase 2: A Distributed Information Filtering System for Digital Libraries<br\/><br\/>This is the first year funding of a three year continuing award. The proposed research is aimed at designing and developing a distributed intelligent information distribution and filtering system that provides personalized information services to the user while minimizing direct user involvement. The system is intended to traverse the internet to retrieve the most relevant information of interest to the user. Information filtering will be realized using a information agents, and will involve integration of advanced concepts and techniques from the domains of artificial intelligence, information retrieval, and distributed object computing. The agents will contain models of network-based dynamic information resources and will have the capability to learn changing patterns of an individual user's interest. <br\/><br\/>Four key basic research areas to be addressed are: methods for adapting various knowledge structures associated with an agent <br\/>new and robust agent architectures <br\/>agent collaboration protocols based on a natural or artificial economic framework <br\/>agent-driven information service operations","title":"DLI-Phase 2: A Distributed Information Filtering System for Digital Libraries","awardID":"9817572","effectiveDate":"1999-06-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["496785","449790","486226","139929"],"PO":["433760"]},"46273":{"abstract":"","title":"WORKSHOP: Component-based, Evolving Distributed Systems on October 4-7, 1999 in Santa Margherita Ligure, Italy","awardID":"9978580","effectiveDate":"1999-06-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["78952"],"PO":["150697"]},"39751":{"abstract":"The project is aimed at providing a better understanding of the geometry of the central paths for linear programming problems, the paths that are followed by interior-point methods. The motivation for better understanding the geometry is the hope that it might be useful in resolving a major open problem in optimization, namely, whether or not a genuinely polynomial algorithm exists. It might be possible to design such an algorithm by extending interior-point ideas, the extensions requiring a deeper understanding of the geometry than presently exists.<br\/><br\/>Another aim is to develop an efficient symbolic method for making queries regarding the exact optimal solutions of semi-definite programming problems. Interior-point methods only approximate the optimal solutions, so in general do not suffice to answer such queries.<br\/><br\/>The research is expected to make the most mathematical interior-point method theory (for general convex optimization) more cohesive, as well as more accessible to researchers in related areas. It is hoped that by focusing on the geometry underlying interior-point methods --- in particular, focusing on the inner products induced by the barrier functions --- the advanced theory can be made more transparent and better motivated to Ph.D. students and outside researchers.","title":"A Deeper Understanding of the Geometry of Interior-Point Methods","awardID":"9901941","effectiveDate":"1999-06-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["258654"],"PO":["201974"]},"34075":{"abstract":"9813854<br\/>Naumann<br\/><br\/>This US-Brazil collaborative research award to Dr. David A. Naumann, Sevens Institute of Technology, New Jersey will permit a two-year study of practical calculus of Object-Oriented Programming with Professor Ana Cavalcanti, Universidade Federal de Pernambuco (UFPE), Recife, Brazil.<br\/><br\/>This research is expected to produce a calculus for development of object-oriented programs. The calculus will include laws for program derivation and optimization as well as object-oriented class design and class structuring. Given the predominance of object-oriented languages in current industrial practice, and the increasing attention being given to rigorous validation of system properties like security, the importance of improved development methods is critical. This work will help bridge the gaps between recent work in programming methods (restricted languages, simple methods, impressive applications) and semantics (rich languages even beyond those used today, but concentrating on type structures rather than reasoning.)<br\/>***","title":"U.S.-Brazil Cooperative Research: Towards a Practical Calculus of Object-Oriented Programming","awardID":"9813854","effectiveDate":"1999-06-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5977","name":"AMERICAS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["521696"],"PO":["149151"]},"38354":{"abstract":"CCR-9870652<br\/>CAREER - A Framework for Fault-Tolerant and Secure Agents<br\/>Rida A. Bazzi<br\/><br\/>The research considers agent-based systems, and develops techniques <br\/>to support the development of reliable agent-based applications<br\/>in large and open distributed systems. Such applications are <br\/>important for the growth of electronic commerce, and Internet <br\/>computing.<br\/><br\/>The main goals of the research is to provide a framework for secure, <br\/>fault-tolerant, and heterogeneous agents and to study fundamental<br\/>limitations on such a framework. The desired agent characteristics <br\/>are achieved automatically with little or no modification to the <br\/>source code. The research uses compiler techniques to provide the <br\/>ability for applications to save and restore their execution states <br\/>in a heterogeneous environment. Code hiding techniques are <br\/>developed to provide secure agent execution in hostile environments <br\/>without compromising source code or execution results. Compiler<br\/>techniques are also used to provide fault tolerance, and new techniques<br\/>are developed for tolerating failures in heterogeneous environments.<br\/><br\/>The research is complemented by an educational component, the main <br\/>goal of which is to attract undergraduate students to do research <br\/>in computer science.","title":"CAREER: A Framework for Fault-Tolerant and Secure Agents","awardID":"9876052","effectiveDate":"1999-06-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["393307"],"PO":["309350"]},"39146":{"abstract":"Abstract<br\/><br\/><br\/>IIS-9900297<br\/>Badler, Norman I.; Joshi, Aravind, K.; & Palmer, Martha<br\/>University of Pennsylvania<br\/>$178,712 - 12 mos.<br\/><br\/>The Actionary: A Dictionary that Portrays Natural Language Expressions as Context-Sensitive Simulations of Human Actions<br\/><br\/> The `Actionary' is an action database that associates natural language expressions with context-sensitive graphical simulations acted out by ``smart'' virtual human agents. It rests on a foundation of Parameterized Action Representations (PARs) that explicitly link Lexicalized Tree-Adjoining Grammar structures to the Parallel Transition Networks that drive virtual human motion generators. PARs provide a conceptual representation of different types of actions: changes of state, changes of location (kinematic), and exertion of force (dynamic). To date, only change of state actions have been addressed by natural language processing systems. It is known that there are no linguistic distinctions between `running,' `jogging,' or `loping,' and that these can only be distinguished by making reference to visual models and context. The Actionary approach defines actions involving continuous changes or process execution with reference to situated concrete models suitable for a visualized performance. The Actionary will facilitate: Translation of human action instructions into different languages for sample action execution for education (e.g., foreign language learning) and training (e.g., machinery operation and repair). Low bandwidth communication of multi-person activities: by transmitting compact textual instructions locally interpreted via the Actionary, smart agents can execute instructions for potential applications in remote skill training, virtual video-conferencing, and 3D virtual communities.","title":"The Actionary: A Dictionary that Portrays Natural Language Expressions as Context-Sensitive Simulations of Human Actions","awardID":"9900297","effectiveDate":"1999-06-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["472144","397034","511542"],"PO":["246649"]},"39267":{"abstract":"This project aims to develop a general theory of fault-tolerant adaptive and minimal routing in k-ary n-dimensional meshes. This theory can be extended to k-ary n-dimensional hypercubes, which are meshes with wraparounds. The theory is based on a new fault model and an information model. Unlike many existing fault models, the proposed fault model can handle boundary faulty nodes easily without disabling too many non-faulty nodes. As opposed to some existing fault-tolerant routing approaches where fault information is carried by the header of the routing message, the proposed approach is based on coded neighborhood information maintained at each processor. Each node in a mesh-connected multicomputer collects and distributes fault information concurrently but in a decentralized way. This collection and distribution process exhibits desirable properties of self-stabilizing, self-optimizing, and self-healing. Unlike many existing information models that require each node to have knowledge of the entire system, the coded fault information associated with each node represents limited-global information by exploring locality of disturbances in the system. Locality of fault information also ensures the scalability of the proposed approach. Insights gained in this project will shed new light on constructing new fault-tolerant, adaptive, minimal, and deadlock-free routing in mesh-connected multicomputers.","title":"A Theory of Fault-Tolerant Adaptive and Minimal Routing in Mesh-Connected Multicomputers","awardID":"9900646","effectiveDate":"1999-06-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["7594"],"PO":["113883"]},"38401":{"abstract":"CCR-9876248<br\/>CAREER: Architectures and Compilers for Tiger Machines<br\/>Seth Copen Goldstein<br\/><br\/>This proposal investigates a new class of processors and their<br\/>associated compilers, Tiger processors, which TIghtly couple a<br\/>GEneral-purpose processor with a Reconfigurable function unit (RFU).<br\/>The RFU can be configured, at run-time, to implement a function as a<br\/>hardware circuit. Tiger processors offer the flexibility of a<br\/>general-purpose microprocessor with the performance of a custom<br\/>circuit.<br\/><br\/>Tiger processors offer high performance and efficiency because they<br\/>contain an RFU, which, when needed, can be configured to implement<br\/>hardware matched to any individual application. Tiger processors can<br\/>realize an application's parallelism on all levels: MIMD, SIMD,<br\/>instruction-level, pipeline, and bit-level.<br\/><br\/>The two requirements to realizing the potential of these processors,<br\/>investigated in this proposal, are (1) developing robust compilers<br\/>which quickly produce efficient executables from any high-level<br\/>programming language, and (2) investigating the proper interface<br\/>between the RFU and the general-purpose processor.<br\/><br\/>The objective of this research is to allow programs to obtain<br\/>performance approaching that of custom hardware from a general-purpose<br\/>device. Tiger processors will both increase performance and reduce<br\/>the cost of systems because there will be no need to augment systems<br\/>with custom hardware and its associated design overhead.","title":"CAREER: Architectures and Compilers for Tiger Machines","awardID":"9876248","effectiveDate":"1999-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["332333"],"PO":["551992"]},"38599":{"abstract":"The goal - so far not entirely realized - of synthetic environments is to<br\/>provide a realistic experience for their users. In particular, these<br\/>environments can be used for active collaboration on engineering designs<br\/>and medical applications. This project attacks some of the most important<br\/>outstanding problems in the field of real-time synthetic environments:<br\/><br\/>1) Develop a scalable system to achieve real-time walkthrough of very large<br\/>CAD models with high-accuracy rendering of spatial arrangements.<br\/><br\/>2) Develop parallel rendering algorithms that take into account emerging<br\/>graphics architectures with multiple graphics pipelines and general-purpose<br\/>processors.<br\/><br\/>3) Develop incremental algorithms to allow interactive updates to large<br\/>dynamic environments, allowing objects to be moved, added, and removed in<br\/>realistic manners.<br\/><br\/>Among the algorithms that the project will explore are visibility culling,<br\/>multi-resolution methods, model simplification, image-based rendering,3-D<br\/>image warping, multi-pass rendering, and efficient updates for model<br\/>hierarchies, occlusion databases, and level-of-detail generation. These<br\/>advances will be tested on real-world models, including a 13<br\/>million-element polygonal model of an electric generating station.","title":"Real-Time Walkthroughs of Serious Synthetic Environments","awardID":"9876914","effectiveDate":"1999-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["561957","543535","332385"],"PO":["551992"]},"36576":{"abstract":"This award supports the use of agent-based models to study the emergence of multi-agent institutions in society and to test these models against data. The computational approach taken here departs from perfectly rational models in favor of boundedly rational models and non-equilibrium dynamics. The models are inherently concerned with social interactions and the ways in which institutions (and social norms and conformity effects) emerge out of those interactions. Five models will be developed including: the Long House Valley Anasazi from 800 AD to their disappearance in 1300 AD; crime rates; retirement decision-making; the distribution of firm sizes; and institutions of governance. These models will advance scientific knowledge about multi-agent systems, simulation and anthropology as well as contribute to policy-making about criminal, retirement and organizational behaviors.","title":"Agent-Based Models of Social Interaction and the Emergence of Multi-Agent Institutions","awardID":"9820872","effectiveDate":"1999-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["434360","348245"],"PO":["495796"]},"35498":{"abstract":"INT 9817956<br\/>Roberts<br\/><br\/><br\/>This U.S.-Czech cooperative effort supports a limited exchange of students from the United States and the Czech Republic within the basic context of the National Science Foundation's Research Experiences for Undergraduates Program (REU). The U.S. organizer is Fred S. Roberts of Rutgers University's Center for Discrete Mathematics and Theoretical Computer Science (DIMACS). His counterpart is Jaroslav Nesetril of Charles University's Center for Discrete Mathematics, Theoretical Computer Science and Applications (DIMATIA) in Prague. The planned REU program for undergraduate students: 1) features combinatorics, logic and complexity theory, and computational geometry and 2) involves U.S. and Czech faculty mentors who oversee junior participant's directed study and research. This award permits three international REU sessions, one held each summer during 1999, 2000 and 2001. Both sides share costs.<br\/><br\/>Collaboratively, Roberts, Nesetril, and appointed faculty program coordinators will manage a DIMACS-based international REU program that accommodates five U.S. students for a total of nine weeks. To facilitate project definition and research initiation, paired mentors and students begin communication via Internet prior to each REU session. During the first six of nine weeks, Czech faculty and two Czech students participate at the Rutgers site in DIMACS' domestic RUE program. Next, five U.S. students who have been selected competitively for this international \"research experience for undergraduates,\" go with the DIMACS mentor to spend three weeks in Prague for the DIMATIA-hosted phase of the program. There the U.S. participants join Czech mentors and student counterparts to work on predetermined projects and attend tutorials as well as a special midsummer workshop. Results should produce a number of jointly authored scientific papers, student presentations suitable for scientific meetings, and potentially long-lasting professional networks. <br\/><br\/>The overall intent of this U.S.-Czech undergraduate exchange is to add an international dimension to the standing objectives for REU programs which encourage career choices in math, science and engineering. Success will mean that the future careers of these junior participants are enhanced by exposure to research excellence abroad and early experience with collaboration in an increasingly global research enterprise.<br\/><br\/>Such international research experience for undergraduates, anchored by two centers of excellence, fulfills the program objective of advancing scientific knowledge by enabling experts in the United States and Central Europe to combine complementary talents and share research and education resources in areas of strong mutual interest and competence.","title":"U.S.-Czech Research Experiences for Undergraduates Program in Discrete Mathematics and Theoretical Computer Science","awardID":"9817956","effectiveDate":"1999-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5979","name":"CENTRAL & EASTERN EUROPE PROGR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["264120"],"PO":["561352"]},"39403":{"abstract":"9901030 Paul Ammann<br\/>With software, and software failures, ever more a part of everyday life, quality software at acceptable cost is a significant concern. The objective of the proposed research is to help developers produce better software. To achieve this objective, the proposed research combines three important software engineering threads: system testing, formal methods, and mutation analysis. System testing consumes considerable resources in commercial projects, but much of the activity is ad-hoc and unformalized. The proposed research will provide methods to generate system test cases with respect to a given model, and also the means to evaluate existing system test cases. Formal methods have enjoyed recent success through advances in model checking. Model checkers are well suited to generating counter examples, which can be interpreted as test cases. The proposed research will provide mechanisms that generate and evaluate system test cases with respect to a model checking specification. Mutation analysis is a method to generate and evaluate tests with respect to the ability of the tests to distinguish a given artifact from a series of minor variations, or mutants, of the artifact. The proposed research seeks to automate mutation analysis for specifications through the use of model checkers.","title":"System Testing Via Mutation Analysis of Model Checking Specifications","awardID":"9901030","effectiveDate":"1999-06-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["186658"],"PO":["564388"]},"38226":{"abstract":"IIS-9875469<br\/>Lynch, Kevin<br\/>University of Rochester<br\/>$50,000.00<br\/><br\/>CAREER: Physics-Based Robotic Manipulation Planning and Control<br\/><br\/>This is the first year flitiding of a four-year continuing award. The goal of this research is to develop robot manipulation planners and controllers which exploit task mechanics. The effective use of friction, gravity, and dynamic forces can substitute for extra actuators, allowing the development of inexpensive, minimalist robots. The ideas will be applied to problems in (1) industrial parts feeding, where the manipulation planner will allow a simple two-joint robot which can push and roll parts to position and orient three-dimensional parts on a conveyor, and (2) motion planning for human-robot collaborative manipulation. A collaborative robot is a passive programmable constraint machine which sets up virtual guiding surfaces to assist a human in manipulation tasks. The problem is to find \"ergonomically correct\" guides --- of all the guides that lead the object to the goal configuration, which makes the task easiest for the human? It will be investigated in the context of repetitive tasks in auto assembly. This work toward accessible, minimalist robotics will be complemented by the development of two new courses. The first is a fresbman\/sophomore-level mechatronics design course which will make use of the mechatronics design lab currently under development. This course and the lab will allow undergraduates to get involved in research and independent projects early in their careers. The second course is a senior\/graduate-level course on mechanics and algorithms for robotic manipulation and industrial automation.","title":"REU: CAREER: Physics-Based Robotic Manipulation Planning and Control","awardID":"9875469","effectiveDate":"1999-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["522422"],"PO":["234178"]},"38216":{"abstract":"The goal of this research is to provide seamless access to the networked computational and information resources from mobile, wirelessly connected systems. Such systems will be an integral component of the National Information Infrastructure (NII). Some of the current obstacles in building such a ubiquitous access system on mobile platforms include their limited compute power, disks, battery life etc., as well as the limited and variable bandwidth of the wireless networks. Moreover, the next generation of radio communication hardware will engender ad-hoc networks which current proxy based mobile access models cannot handle. The approach in this research is to create agent oriented middleware which overcomes the limitations of the mobile hosts as well as wireless networks, and helps integrate them into the high performance computer and communication systems that form the backbone of the NII. The middleware transcodes (multimedia) data streams to enable weakly connected access, and integrates software component based systems to provide computational power to mobile hosts. This allows the systems to create information from available data to respond to queries, which is useful when the queries are in non-trivial domains (e.g. scientific information, electronic commerce). Moreover, the system provides disconnection management, and integrates techniques for cooperative information filtering. The system supports both proxy based and end-end data management approaches and their relative efficacy is compared. It is expected that this work will lead to the development of software systems needed to support mobile information access in complex, real world applications, and allow the NII to handle the diversity of scale presented by mobile clients connected over low bandwidth wireless (ad-hoc) networks to the high bandwidth network backbone and powerful servers. The educational component of this proposal has two aspects. One focuses on creating courses in the area of the proposed research work and training undergraduate and graduate students. The other leverages the proposed research to create adaptive electronic notebooks for science and engineering education which use (existing) courseware, digital libraries and other data repositories. It is expected that the electronic notebook software will be used by non-traditional students in continuing education programs who use low bandwidth dial-in or wireless connections. http:\/\/www.cs.umbc.edu\/~ajoshi\/career\/","title":"CAREER: MultiAgent Systems to Support Mobile Information Access","awardID":"9875433","effectiveDate":"1999-06-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["533183"],"PO":["563751"]},"41461":{"abstract":"The Information and Data Management Program (IDM) workshop on Data Visualization, to be held at the University of Memphis on June 18 and 19, 1999 has the objective to bring together some PIs and co-PIs currently funded along with researchers from related disciplines in cognitive science and ergonomics in order to: <br\/><br\/>1) Identify the problems that are fundamental in making progress towards organizing and visually presenting user-understandable visual display of complex, distributed, and massive amounts of data, <br\/>2) Specify areas where major breakthroughs appear possible,<br\/>3) Identify research infrastructures needed to meet current and future challenges.<br\/><br\/>This workshop aims at enabling communication and future collaboration among researchers from the different communities involved in the IDM program, including database, multi-media data, and methods for integration of complex data for easy human comprehension. Further, the workshop provides an opportunity to examine the current research efforts and to learn more about successes of the researchers funded not only the IDM program, but from other agencies and companies.","title":"1999 NSF Information and Data Management Program Workshop on Data Visualization","awardID":"9907299","effectiveDate":"1999-06-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["543540",104942],"PO":["563751"]},"39207":{"abstract":"Most children are not programmers but would like to create software that is similar to their favorite commercial applications, such as games and educational applications. Today's programming environments make this too difficult. The goals of this project are to study how children (fifth grade and older) reason about programming concepts, and then to create a new general-purpose programming language and environment for children that takes advantage of these findings. All aspects of the new system will be thoroughly analyzed with usability techniques such as Cognitive Dimensions and user tests with children. The language will be general-purpose, in that it will not be limited to creating a particular kind of program. It will be extensible, modular, scalable, and well-structured, so students can easily write programs that range from one line all the way up to many thousands of lines. Unlike most current environments for children, the system will support the creation of complete and sophisticated programs. The PI will exploit modern technologies to simplify the programming process, including direct manipulation and demonstrational techniques, programming environment technologies like structure editors, and mechanisms for extending programs by harnessing and reusing existing components. There has not been a successful new programming language for children in many years. Since the PI's system will be based on empirical studies of how children think, it should have an excellent chance of allowing the majority of children (and, by extension, the general public) to create interesting and useful applications<br\/>http:\/\/www.cs.cmu.edu\/~NatProg","title":"A More Natural Programming Language for Children","awardID":"9900452","effectiveDate":"1999-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}}],"PIcoPI":["548127","405986"],"PO":["564456"]},"45576":{"abstract":"This proposal will develop next generation data delivery techniques for the Web and other on-demand data delivery systems that contain large, popular, widely shared data files. The project includes several research efforts. One key goal is to design improved (or optimized) delivery architectures that provide immediate service at reduced (or minimal) server bandwidth. Another key goal is to develop tractable models to compute the regional cache contents that minimize delivery cost for systems with diverse object lengths and delivery rates, and with heterogeneous regional server capabilities and client loads. A third goal is to derive basic system design principles by using the optimized cache content calculations to determine how delivery cost and the optimal caching strategy are influenced by key system and workload parameters. A fourth goal is to develop extensions to the dynamically scheduled delivery architecture to optimize support of (encoded) variable bit rate data streams. Finally the project will address several implementation issues, including server disk layout for the dynamically scheduled data segments, methods for informing clients of scheduled and reassigned multicast segment deliveries, and methods for coordinating shared data delivery between the (remote) information source server and the regional\/proxy server. The results of this research are being incorporated in a prototype on-demand data delivery system to demonstrate implementation feasibility and to validate the projected performance improvements.","title":"On-Demand Delivery of Large Popular (Multimedia) Data Files","awardID":"9975044","effectiveDate":"1999-06-01","expirationDate":"2002-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["410040"],"PO":["209879"]},"35347":{"abstract":"Abstract<br\/><br\/>IIS-9817444<br\/>Buneman, Peter <br\/>University of Pennsylvania<br\/>$174,951<br\/><br\/>DLI Phase 2 - DATA PROVENANCE<br\/> <br\/>This project will address issues associated with data provenance. Provenance is concerned with how information has arrived at the form in which appears -who produced it, who has corrected it, how old it is, it was originally produced, and so forth . Understanding provenance has occupied scientists, historians, textual critics and other scholars for centuries.<br\/><br\/>The provenance of data in databases is a newer and larger problem, because one is interested in data at all levels of granularity - from a single pixel in a digital image to a whole database. Just as scholars comment on documents by attaching annotations (marginalia) to text, part of the solution to recording provenance is the attachment of annotations to components of databases. Database researchers have recently considered<br\/>loosely structured forms of data and have developed software systems for querying and storing such data. This work is closely related to new formats that have been developed for structured documents on the Web. It is expected that this technology will provide the substrate for recording and tracking provenance by advancing new data models, new query languages and new storage techniques.","title":"DLI Phase-2: Data Provenance","awardID":"9817444","effectiveDate":"1999-06-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":["541878","541876","541877"],"PO":["433760"]},"46249":{"abstract":"This proposal requests support for a workshop to be held in Berkeley, California, on May 26, 1999 to explore the need for and advantages of an American National Corpus of lexical and linguistic resources. The workshop will be attended by university researchers, representatives of the publishing community, and others interested in research in lexical and linguistic topics. The need for this workshop is critical to advance and coordinate resources needed in the rapidly growing area of natural language research in the United States.","title":"American National Corpus: Planning and Exploration Workshop","awardID":"9978422","effectiveDate":"1999-06-01","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["501442"],"PO":["565227"]},"42047":{"abstract":"This award supports a two-day interdisciplinary workshop on mobile computing and networking systems. The workshop will be held on June 13-14, 1999 at the University of Cincinnati. Twenty-five to thirty experts are invited to give special lectures, serve on panels and engage in general discussion about future directions in this important research area. The workshop will result in a report on the future directions of mobile computing and networking systems.","title":"Workshop: Future Directions in Mobile Computing and Networking Systems; June 1999; Cincinnati, OH","awardID":"9908948","effectiveDate":"1999-06-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["402054"],"PO":["150490"]},"36229":{"abstract":"EIA-9819945<br\/>Carr, Daniel<br\/>George Mason University<br\/><br\/>Digital Government: A Planning Proposal: Quality Graphics for Federal Statistical Summaries<br\/><br\/>This grant will support the planning and coordination between the PI and potential partners in Federal statistical agencies, vendors, and industry to explore the development of a full proposal in the area of graphical representation of statistical data. Included will be perceptual and cognitive issues and usability testing, aimed toward improving the communication abilities of tabular data to make it more useful to a broader segment of the public. Java will be the programming language used to construct broadly distributable applications and applets.","title":"Digital Government: A Planning Proposal: Quality Graphics for Federal Statistical Summaries","awardID":"9819945","effectiveDate":"1999-06-01","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["352325"],"PO":["371077"]},"44512":{"abstract":"9971157<br\/><br\/>The principal investigator and his colleagues, Richard Pollack (Courant Institute, New York University) and Emo Welzl (ETH Zurich) organize a research conference on discrete and computational geometry, which will take place during the week of June 27, 1999 through July 2, 1999 at the ETH Zurich seminar center in Monte Verita, Ascona, Switzerland. This is the third in a series of international conferences on discrete and computational geometry going back to 1986. Areas to be discussed include enumerative properties of arrangements, k-sets, geometric transversal theory, the complexity of Betti number computation, a new proof of the bellows conjecture, and the recently-announced proof of the Kepler conjecture, among many others.<br\/><br\/>The fields of discrete (or combinatorial) geometry and of computational geometry both deal with configurations of points, lines, planes, balls, polyhedra, etc. in 2- and 3-dimensional space, as well as in higher dimensions; i.e., with fundamental questions about simple (but usually many) geometric objects. Discrete geometry seeks a basic understanding of such geometric structures, while computational geometry investigates the inherent complexity (difficulty) of algorithmic problems. Many questions in applied areas can be reduced to problems about discrete configurations of many geometric objects. Hence advances in mathematical understanding of the geometric structures and in computational methods for dealing with them can have significant consequences for applications. Such applications arise, for example, in computer aided design and manufacturing, solid modeling, textile layout, medical imaging, computer vision, optimization, computer graphics and virtual reality, robot motion planning, geographic information systems, and molecular biology.","title":"Conference on Discrete and Computational Geometry","awardID":"9971157","effectiveDate":"1999-06-15","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1265","name":"GEOMETRIC ANALYSIS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[113154],"PO":["562372"]},"34502":{"abstract":"The tremendous growth in demand for wireless communications capacity has created a need for new modulation, coding and detection methods that more efficiently use the multipath fading channels encountered in mobile radio. Since the channel changes rapidly, the transmitter and receiver are not generally optimized for current channel conditions, and thus fail to<br\/>exploit the full potential of the wireless channel. The shorter<br\/>wavelengths proposed for future mobile radio will only serve to aggravate these problems. This research focuses on joint utilization of adaptive modulation and coding techniques, transmitter diversity methods and fading prediction algorithms suitable for rapidly varying multipath fading channels.<br\/><br\/>In this research, a new approach to communication over fast-fading channels is exploited. The unifying idea is to predict future fading conditions at the receiver, and to feed these predictions to the transmitter for the optimization of the transmitted signal. This research is an interdisciplinary effort in communication theory, physics, and signal processing that encompasses novel physical models for multipath fading,<br\/>channel prediction and tracking methods, and adaptive modulation, coding and power-control algorithms. The ultimate goal of this work is to more fully exploit the potential capacity of wireless communication channels, and in the process reduce the associated power and bandwidth requirements.","title":"Joint Transmitter and Receiver Optimization for Fast Fading Mobile Radio Channels Using Deterministic Channel Modeling","awardID":"9815002","effectiveDate":"1999-06-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["560179","451742","476274"],"PO":["188393"]},"46206":{"abstract":"EIA-9978209<br\/>Hill, Linda L.<br\/>Goodchild, Michael F.<br\/>University of California Santa Barbara<br\/><br\/>Digital Government: Digital Gazetteer Information Exchange (DGIE)<br\/><br\/>This proposal will support a workshop in the Fall of 1999 covering the area of geographic naming protocols. Discussion will include both policy and technical issues. Attendees will include experts in geographic digital libraries and geographic information systems drawn from universities, professional organization, Federal agencies, and museums. The workshop will be hosted by the Smithsonian Institution.","title":"Digital Government: Digital Gazetteer Information Exchange (DGIE)","awardID":"9978209","effectiveDate":"1999-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1352","name":"GEOGRAPHY AND SPATIAL SCIENCES"}}],"PIcoPI":["515614",117853],"PO":["371077"]},"34647":{"abstract":"9815343<br\/>Boardman<br\/><br\/>This award supports a one year collaborative research project between Professor J. Michael Boardman of Johns Hopkins University in Baltimore and Professor Goro Nishida of Kyoto University in Japan. The researchers will be undertaking a study of the recent progress is homotopy theory. One focus of the program will be recent advances in homological algebra in the category of spectra and their interaction with the chromatic program, but it is also an opportunity to review recent developments in the field as a whole. The program will sponsor weekly seminars during the academic year, culminating in a conference and workshop in March, 2000. This decade has seen revolutionary developments in homotopy theory, and this program is an opportunity to review, evaluate, and rationalize this work. Problems with the foundations of the theory of ring-spectra and their modules, which have blocked the development of the subject for two decades, have been solved by sophisticated generalizations of classical techniques from homological algebra. A goal of this program is to bring these developments to the attention of the wider mathematical community. <br\/><br\/>This project brings together the efforts of two laboratories that have complementary expertise and research capabilities. Results of this research would provide a forum for informing researchers, in the area of homotopy, of the latest developments and, therefore, enabling them to expand the scope of their own research projects. This research advances international human resources through the participation of a younger scientist and graduate students. Through the exchange of ideas and technology, this project will broaden our base of basic knowledge and promote international understanding and cooperation. The researchers plan to publish a volume that contains the works presented in the year-long seminar.<br\/>***","title":"U.S.-Japan Cooperative Science: Recent Progress in Homotopy Theory","awardID":"9815343","effectiveDate":"1999-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5983","name":"JAPAN AND KOREA PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0507","name":"Division of SCIENCE EDUCATION RESOURCES IM","abbr":"SER"},"pgm":{"id":"1267","name":"TOPOLOGY"}}],"PIcoPI":["320519","366850","212567"],"PO":["449696"]},"34768":{"abstract":"9815731<br\/>Scedrov<br\/><br\/>This award supports a three year collaborative research project between Professor Andre Scedrov of the University of Pennsylvania and Professor Mitsuhiro Okada of KeioUniversity in Tokyo, Japan. The researchers will undertake a study of the logical methods for formal verification of software, with an emphasis on logical methods. The research effort will involve applying logical notions and methods to various aspects of software specification and verification. The main research themes are: 1) linear logic as a specification language and the related automated environments; 2) protocols, games, security and logic; 3) program analysis, security and logic; and 4) concurrent constraint programming. Planned research topics include: 1) proposed proof-based state exploration and verification techniques and decision procedures with applications to real-time and hybrid system specification and verification; 2) applications to protocol analysis and threat analysis; 3) Java bytecode verification and array-bound checking; <br\/>4) extensions of proof-carrying code methodology for safety and security properties of untrusted code to properties involving state; 5) type systems for mobile computation and communication; and 6) the design and implementation of programming languages for the domain of software systems that include concurrency and distribution.<br\/><br\/>This project brings together the efforts of two laboratories that have complementary expertise and research capabilities. Results of this research would provide for more predictable, reliable software. This, in turn, would provide for more reliable computing systems. This research advances international human resources through the participation of younger scientists. Through the exchange of ideas and technology, this project will broaden our base of basic knowledge and promote international understanding and cooperation. <br\/>***","title":"U.S.-Japan Cooperative Science: Logical Methods for Formal Verification of Software","awardID":"9815731","effectiveDate":"1999-06-01","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5983","name":"JAPAN AND KOREA PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["381704"],"PO":["449696"]},"41831":{"abstract":"This workshop is to explore and assess the state-of-the art in electronic system design, and identify the research needed by this field in light of exponentially growing complexity and functionality. Topics covered include CAD tools; hardware-software co-design; architecture simulation (functional and behavioral); verification of functionality, timing, and communication protocols; optimizing compilers; and operating systems. Additionally, the idea of fostering design methodologies that encourage reuse of components<br\/>not only at the physical or logic design levels but also at the functional levels will be explored. The workshop report includes: (1) a statement of the most pressing problems to solve within the next decade, (2)<br\/>recommendations regarding the style and kind of research to be conducted and suggestions to the community as to how to implement these recommendations.","title":"NSF Workshop on Research Directions for Next-Generation Systems Design and Integration","awardID":"9908421","effectiveDate":"1999-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["133935","483628"],"PO":["321058"]},"41413":{"abstract":"This proposal is seeking support for students attending the ACM 1999 Java Grande Conference (formerly ACM Workshop on Java for High-Performance Network Computing). Java and Web technology have become very important for the development of new distributed applications and emerging electronic commerce systems. Likewise, we expect Java to play an increasingly important role in the broad area of high-performance computing; including engineering and scientific computing, simulations, parallel and distributed computing, data-intensive applications, and other applications that combine communication and computing. This area of high performance network computing is the focus of the conference. The conference is aimed at getting a broad perspective of community interests and views, as well as more technical discussions. The goal is to provide feedback to users and language developers on what is required to successfully deploy Java in scientific and high-performance computing environments.","title":"Next Generation Software: ACM 1999 Workshop on Java for High-Performance Network Computing","awardID":"9907140","effectiveDate":"1999-06-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X089","name":"DARPA-JAVA FOR HIGH PERF COP"}}],"PIcoPI":["194103"],"PO":["301532"]},"44438":{"abstract":"9970909 Robert A. Paige<br\/>The objectives of this research are to improve software productivity, reliability, and performance of complex software systems. The approach uses program transformations to turn very high level<br\/>perspicuous problem specifications into efficient implementations. The transformations to be used include dominated convergence (for implementing fixed points efficiently), finite differencing (for replacing costly repeated calculations by less expensive incremental counterparts), data structure selection (for simulating associative access on a RAM in real time), and partial evaluation (for eliminating interpretive overhead and simplification). These transformations are to be implemented in a transformational system, which itself is to be transformed from an executable specification into efficient C code. Experiments to be conducted are expected to demonstrate how earlier results showing a five-fold increase in the productivity of efficient algorithm implementation in C in comparison to hand-coded C for small-scale examples can be extended to large-scale examples of C programs that might exceed 100,000 lines. If successful, the results are expected to have important scientific and economic impact on the development of algorithmic software with particular application to program analysis and transformation.","title":"Automated Development of Software for Program Analysis and Transformation","awardID":"9970909","effectiveDate":"1999-06-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["293422",112992],"PO":["150697"]},"36408":{"abstract":"9820440<br\/>Shirazi, Behrooz<br\/>University of Texas, Arlington<br\/><br\/>CISE REU: Research Experiences for Undergraduates in Dynamic Distributed Real-Time Systems<br\/><br\/>This Research Experiences for Undergraduates (REU) Site project supports six students per year in programs carried out during the summers for three years. The students work on projects in the area of dynamic distributed real-time systems including aspects of Quality of Service specification and management and benchmarking of such systems. Although the students are recruited nationwide, the program focuses on students from minority and women's institutions and from institutions lacking research facilities in the southwest region of the country. The student projects are related to a large, multi-year DARPA-funded research project. However, in addition to their participation in these projects, the students will be involved in literature searching, technical writing and making technical presentations.","title":"Research Experiences for Undergraduates in Dynamic Distributed Real-Time Systems","awardID":"9820440","effectiveDate":"1999-06-01","expirationDate":"2002-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["559679","547675"],"PO":["329035"]},"44824":{"abstract":"The rapidly growing disparity between processor and I\/O performance must be addressed. Two intriguing trends in storage systems are the appearance of new technologies that suffer from asymmetric read-write performance, and the widening gap between data transfer rate and access time. A current example is a tertiary storage system with an automated library mechanism. Such a system exemplifies the wide performance gap between data transfer rate and access time due to mechanical media handling.<br\/><br\/>The goal of this work is to address these issues through the development of techniques for high-performance integration of automated tertiary storage libraries. These issues include:<br\/><br\/>1. Addressing the issue of read-write performance asymmetry, though the use of a log-structured, write-buffered architecture.<br\/><br\/>2. The minimization of mechanical access delays, by pre-grouping related data on the same media volume, as it is migrated from local storage.<br\/><br\/>This research will be of direct benefit to today's growing storage needs by allowing high-performance access to vast storage. It addresses the important issue of latency reduction in cases where data rate far exceeds access speeds. It also enables the efficient general-purpose adoption of emerging storage technologies, such as magneto-optical and volume holographic, by alleviating problems of read-write performance asymmetry.","title":"High Performance Integration of Advanced Tertiary Stores","awardID":"9972212","effectiveDate":"1999-06-15","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["540846"],"PO":[113883]},"41936":{"abstract":"In coherent imaging systems the transmitted and\/or received coherent signals are spread over a spatially extended coherent aperture. Here, the definition of coherence relates to signals that exhibit a stationary phase relationship over the aperture. Coherent imaging uses an extended coherent aperture to enhance the resolution and reduce the signal to noise ratio of the desired images. Coherent apertures can either be continuous, such as a lens in an optical system, or discrete, spatially sampled apertures, often referred to as phased arrays. Some examples of phased array systems are electromagnetic-microwave surveillance and synthetic aperture imaging radars, and ultrasound transducers in medical ultrasound. <br\/><br\/>This workshop will bring together a group of distinguished scientists and engineers from academia, government and industry for the purpose of exploring the role of advanced digital signal processing techniques in (discrete, spatially sampled) coherent imaging systems. The workshop will meet for two and a half days to assess and document current advances and recommend potential future research and development opportunities.","title":"Workshop on DSP for Sampled Coherent Aperture Systems: Challenges, Synergies, and Extensions","awardID":"9908652","effectiveDate":"1999-06-01","expirationDate":"2000-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["186645","328588"],"PO":["564898"]},"34918":{"abstract":"The Pflops-2 workshop, unlike its predecessor, will be a conference style meeting involving a large attendance (approximately 200) of experts in related fields. Attendance will be open and a call for papers will be issued and disseminated widely. There will also be invited participants and recognized leaders within their respective disciplines including technologies, architecture, system software, applications, and algorithms. Findings from previous in-depth workshops and studies will be summarized. Focus groups will provide detailed descriptions of complete systems approaches and the issues requiring resolution prior to implementation. The call for papers will invite presentations on all aspects of petaflops-scale computing. There will be invited talks on the areas that have been studied since the February 1994 workshop. In addition, presentations will be solicited in a few areas not yet considered by the Petaflops initiative, as well radically new approaches such as Quantum Computing , Quantum Dots, Nanotechnologies, Continuum Computing, and Metacomputing. While these are incipient in development, their potential for future very high performance computing warrants attention. Participants will work together to assess the relative risk and opportunities of alternative approaches and expose additional possible problems. One area to be discussed will be reliability for systems of sufficient complexity to achieve a petaflops and will involve reliability enhancement, fault tolerance, and packaging issues. <br\/><br\/>Pflops-2 will be held in Santa Barbara, California. A formal report will be developed by the workshop leaders and editorial staff shortly after the conclusion of the workshop. This workshop will concluded the formal Petaflops workshop series will provide a strong foundation of information for the computer science community and government program managers to establish new directions in high end computing research.","title":"WORKSHOP: The 2nd Workshop on Enabling Technologies for Peta(fl)ops Computing to be held February 15-19, 1999 in Santa Barbara, CA at the Doubletree Hotel","awardID":"9816114","effectiveDate":"1999-06-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X020","name":"NIH-CONF ON ENABLING TECH FOR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X057","name":"ENERGY-SECOND WORKSHOP ON ENAB"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X090","name":"DARPA-NEW TECHNOLOGIES PROG"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"X143","name":"ENERGY-2ND WORKSHOP ON ENABLIN"}}],"PIcoPI":["563330"],"PO":["179296"]}}