{"141185":{"abstract":"The International Society for Computational Biology is awarded a grant to support student and select presenter participation in the annual meeting of the International Society for Computational Biology on \"Intelligent Systems for Molecular Biology\". The conference will be held in Toronto, July 19-23, 2007. The conference will hold thematic sessions for invited presentations, tutorial programs on related subjects, and special interest group workshops. Biological areas presented at the conference will include molecular structure, genomics, molecular sequence analysis, evolution and phylogenetics, molecular interactions, metabolic pathways, regulatory networks, developmental control, molecular biology generally and human health. Results will be disseminated as published proceedints indext in MEDLINE and Current Contents, and video recordings of selected presentations will be available online.","title":"ISMB 2008 Conference Support for Students & Young Scientists, Toronto, July 2008","awardID":"0820858","effectiveDate":"2008-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":[375319],"PO":["561879"]},"144287":{"abstract":"The Workshop on the Question Generation Shared Task and Evaluation Challenge aims at establishing a community consensus with respect to various issues related to offering a shared task on Question Generation, including a clear definition of the main task and subtasks, data collection and annotation processes, data annotation schema, type of evaluation and evaluation metrics. The Natural Language Generation community has currently identified shared tasks as a potential venue to provide a focus of research in the field and increase the visibility of Natural Language Generation research in the wider Natural Language Processing\/Computational Linguistics community. This award contributes to this effort by defining a novel shared task, the Question Generation task. The workshop organization is guided by the Desiderata for Evaluation of Natural Language Generation outlined at the recent NSF\/SIGGEN Workshop on Shared Tasks and Comparative Evaluation in NLG held in 2007. The goal of a representative group of researchers from various areas of research (Natural Language Generation, Intelligent Tutoring Systems, Artificial Intelligence in Education) participating in the workshop discussions is to produce a to-do list for preparing and offering a Question Generation task at Generation Challenges 2010. A post-workshop report will outline the discussions and decisions of the workshop and will be made available to the research community. Due to the importance of Question Generation in learning technologies such as Intelligent Tutoring Systems, the workshop will have broader impact on improving the teaching and learning of STEM disciplines through improved educational software applications.","title":"Workshop on The Question Generation Shared Task and Evaluation Challenge","awardID":"0836259","effectiveDate":"2008-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["482198","446709"],"PO":["565215"]},"134497":{"abstract":"The goal of this research project is to design and develop an efficient, robust RFID stream processing system that addresses the challenges in emerging RFID deployments, including the data-information mismatch, incomplete and noisy data, and high data volume, and enables real-time tracking and monitoring. This project has two main contributions. The first contribution is a low-level interpretation and compression substrate over RFID streams. This substrate offers accurate interpretation of incomplete and noisy raw data; it infers locations of unobserved objects and inter-object relationships using probabilistic algorithms. To handle high data volume, it performs online interpretation, enabling online compression by identifying and discarding redundant data. The second contribution is higher-level complex event processing that addresses the data-information mismatch by encoding application information needs as event patterns and evaluating these patterns continuously over event streams. This project offers a foundation for complex event processing with a compact, expressive event language, theoretical underpinnings, automata-based mechanisms for efficient pattern evaluation over event streams, and techniques for robust processing over event streams that result from low-level interpretation and compression. This project integrates research and education through curriculum development and teaching and research lab development, and enables broader participation of women and minorities in research through college outreach and CRA?s distributed mentor program. This project will have broader impacts including release of source code, simulators, datasets, and benchmarks to the research community via the project's Web site (http:\/\/rfid-streams.cs.umass.edu\/) and technology transfer with potential applications in supply chain management, healthcare, pharmaceuticals, library management, etc.","title":"CAREER: Efficient, Robust RFID Stream Processing for Tracking and Monitoring","awardID":"0746939","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518346"],"PO":["563751"]},"136587":{"abstract":"A challenge in machine learning is to devise methods that allow incorporating human insight into the automated learning process. Current learning methods employ representations that make it difficult to encode simplification and specific examples, and learning is based on random exploration that is difficult to direct. NEAT is a learning system where the learned decision policy is represented in neural networks and learned through evolutionary optimization, i.e. genetic algorithms. NEAT evolves network structure as well as weights, which makes it possible in principle to incorporate human guidance in three ways: (1) building a gradually more complex network structure through shaping from simple to more complex tasks, (2) training networks with examples of human behavior, and (3) converting human-designed rules into network structures. These techniques will be developed and evaluated in the domain of designing complex behaviors for autonomous agents in the NERO 3D simulation environment. In a series of human subject experiments, the solutions designed through human-guided neuroevolution will be compared to those designed by human engineers and to those discovered by neuroevolution alone, verifying that (a) the human-guided approach results in better solutions, and (b) those solutions are more creative. The result of this project is a machine learning approach will allow engineers to generate creative designs to many real-world sequential decision problems. Applications of this approach will lead to safer and more efficient vehicle, traffic, and robotic control, improved process and manufacturing optimization, and more efficient computer and communication systems. It will also make the next generation of video games possible, with characters that exhibit realistic and adaptive behaviors; such technology should lead to more effective educational and training games in the future.","title":"Pilot: Leveraging Human Creativity with Machine Discovery","awardID":"0757479","effectiveDate":"2008-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["408627"],"PO":["424970"]},"142880":{"abstract":"The Hispanic Association of Colleges and Universities (HACU) is the recipient of an award for summer internship support. HACU, a national, non-profit organization, has a long and distinguished record of providing summer internship opportunities through the organization?s National Internship Program (NIP). Through the NIP academically prepared students throughout the US and Puerto Rico have received quality internship assignments with various federal government agencies. Students who participate in the NIP are exposed to various career options in the Federal sector that serve to assist them in making informed career choices and solidify career objectives. By partnering with the Federal government, HACU has been able to successfully place over 7,000 students in internships since NIP commenced in 1992. In an effort to continue its collaboration with HACU, the National Science Foundation, a participating government agency for the last six years, will offer challenging assignments that will broaden the exposure of students pursuing careers in science, technology, engineering and mathematics (STEM). These internships create a unique opportunity to assist in the fulfillment of goals aligned with the America Competes Act, and allow the Foundation to actively participate in developing the intellectual capital needed to achieve excellence in STEM education.","title":"NSF\/HACU National Internship Program 2008-2010","awardID":"0829172","effectiveDate":"2008-06-15","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"068P","name":"INTERNSHIPS PROGRAM"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"1642","name":"SPECIAL INITIATIVES"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0106","name":"Office of INTEGRATIVE ACTIVITIES","abbr":"OIA"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7731","name":"OTHER GLOBAL LEARNING & TRNING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0602","name":"Division of DIV ATMOSPHERIC & GEOSPACE SCI","abbr":"AGS"},"pgm":{"id":"4202","name":"UPPER ATMOSPHERIC FACILITIES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7396","name":"NEES RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"5342","name":"Gen & Age Rel Disabilities Eng"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1575","name":"EDUCATION AND HUMAN RESOURCES"}}],"PIcoPI":[380368,"493842"],"PO":["552354"]},"134421":{"abstract":"American Sign Language (ASL) is the primary means of communication for about 500,000 people in the United States. ASL is a distinct language from English; in fact, a majority of deaf U.S. high school graduates have only a fourth-grade (age 10) English reading level. Consequently, many deaf people find it difficult to read English text on computers, in TV captioning, or in other settings. Software to translate English text into an animation of a human character performing ASL would make more information and services accessible to deaf Americans. Unfortunately, however, essential aspects of ASL are not yet modeled by modern computational linguistic software. Specifically, ASL signers associate entities under discussion with 3D locations around their bodies, and the movement of many types of ASL signs changes based on these locations: pronouns, determiners, many noun phrases, many types of verbs, and others. When do signers associate entities under discussion with locations in space? Where do they position them? How must ASL sign movements be modified based on their arrangement? Creation of robust software to understand or generate ASL requires answers to questions such as these. The PI's goal in this research is to discover techniques for generation of ASL animations that automatically predict when to associate conversation topics with 3D locations, where to place them, and how these locations affect ASL sign movements. To these ends, he will create the first annotated corpus of ASL movement data from native signers (in a motion-capture suit and gloves), annotate this corpus with features relating to the establishment of entity-representing locations in space, use machine learning approaches to analyze when\/where these locations are established and how 3D motion paths of signs are parameterized on those locations, incorporate the models into ASL generation software, and recruit native ASL signers to evaluate the 3D animations that result. This work will advance our linguistic knowledge relating to little-understood yet frequent ASL phenomena, and so will lay the foundation for software to produce a huge variety of ASL signs and constructions that are beyond the ability of current techniques to generate. This will in turn lead to ASL generation systems that produce higher quality animations that are more grammatical and understandable to deaf users, which will greatly benefit accessibility applications for deaf users and ASL machine translation. <br\/><br\/>Broader Impact: The ASL motion-capture corpus and an ASL generator that automatically handles spatial phenomena will enable more computational linguistic researchers to study ASL. This research also has applications for sign languages used in other countries (most with similar phenomena), and for the generation of animations of human gestures (for which empirical techniques developed in this work will apply). The PI is committed to finding ways to encourage deaf high school students to pursue science careers, and to creating Ph.D. research opportunities for deaf students. He will give presentations in ASL at local deaf high schools about computing research, make available summer research experiences for deaf high school students (using ASL skills to annotate the corpus, conduct evaluation studies, and inform the Deaf community about computing), recruit native ASL signers as Ph.D. and undergraduate researchers, and create courses on people-focused computer science research and careers (to attract diverse students to the field) and on assistive technology research (to interest and train Ph.D. students). These educational activities will be enabled by the PI's conversational ASL skills, by the research's relevance to deaf students, and by the Queens College's unique proximity to five local high schools for deaf students.","title":"CAREER: Learning to Generate American Sign Language Animation through Motion-Capture and Participation of Native ASL Signers","awardID":"0746556","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["475201"],"PO":["565227"]},"144101":{"abstract":"SGER: Reconstructing the Tower of Babel: Cross-lingual Language Learning<br\/><br\/>Today, there are more than 6,000 living languages in the world. It is widely agreed among linguists that human languages share substantial similarity at all the levels of linguistic structure. The study of this connection has made possible major discoveries about human communication: it has revealed the evolutionary history of languages, facilitated the reconstruction of proto-languages and led to understanding language universals. The goal of <br\/>cross-lingual learning is to capitalize on the deep connection between human languages to improve automatic language processing. This exploratory research effort focuses on the use of hierarchical Bayesian models that jointly induce linguistic structure for each language and at the same time identify cross-lingual correspondence patterns. The cross-lingual learning is studied in several tasks ranging from morphological to syntactic analysis.<br\/><br\/>The expected benefits of this approach are three fold. First, the performance of cross-lingual learning could yield substantial improvement over state-of-the-art unsupervised approaches across a range of tasks. Second, cross-lingual learning is applicable to hundreds of human languages with no annotated resources which are currently out of reach for existing text processing methods. Finally, tools developed in the course of this project will provide powerful comparative analysis methods for researchers in fields such as linguistics, history, and anthropology.","title":"SGER: Reconstructing the Tower of Babel: Cross-lingual Language Learning","awardID":"0835445","effectiveDate":"2008-06-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1311","name":"LINGUISTICS"}}],"PIcoPI":["401949"],"PO":["565215"]},"135411":{"abstract":"Advanced computing capabilities are now essential to solve complex problems in science and engineering. Computer models have become fundamental to basic research. They are increasingly useful in addressing, in realistic detail, the subtle parameters of the physical systems being modeled. Underlying this increasing relevance of computer models is the enormous, and relatively recent, increase in available low-cost compute power. These advances in computing power and hence in computer modeling and simulation have brought about the emergent field of scientific computing, in which scientists and engineers from multiple disciplines collaborate in understanding a variety of complex systems not approachable only a few years ago.<br\/><br\/>This infrastructure project proposes the establishment of a high-performance GPU-based computing cluster at the Scientific Computing and Imaging Institute (SCI Institute) at the University of Utah. In contrast to the standard approach of using CPUs for computation and GPUs for graphics and visualization tasks, this project aims to explore the power of GPUs for general computations. Our goal is to obtain substantially higher performance per node than what can currently be accomplished with a CPU-based computing cluster. With multiple GPUs per node, this unique computational resource enables scientists to efficiently carry out increasingly complex scientific computations. The proposed infrastructure also includes a high-resolution display wall to be used for visualization, and database and Web servers.<br\/><br\/>The infrastructure enables research in efficient execution of simulations; streamlining the creation of complex data products; producing high-quality visualizations; and scientific workflows leading to simplifying the process of designing simulations and analyzing their results. This project has the potential to impact a variety of applications where computation, visualization, and management of scientific data are currently the bottlenecks. Through our interdisciplinary collaborations, this project will have immediate impact in helping improve the scientific discovery process. The involvement of graduate and undergraduate students in the project will provide mentoring opportunities. New courses will be offered that are tightly integrated with the goals of the project, including courses on parallel programming using GPUs and on scientific data management. The PIs are committed to recruiting minority students.<br\/><br\/>The results of this project will be disseminated as research papers and as freely available tools in the project website (http:\/\/www.cs.utah.edu\/~csilva\/projects\/NSF-IIS-0751152\/).","title":"CRI: IAD: A Service-Oriented Architecture for The Computation, Visualization, and Management of Scientific Data","awardID":"0751152","effectiveDate":"2008-06-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["521992","521991","552996",359729],"PO":["563751"]},"148974":{"abstract":"Background. One of the greatest contrasts between the biological organisms and human technology lies in how they are constructed. Plants and animals grow from the inside out, often from a single cell to an organism containing billions of cells, each of which is built from molecular components that are manufactured with atomic precision within the cell. In contrast, mankind's greatest engineering marvels, such as airplanes and skyscrapers and computers, are put together from the outside in, with components being manufactured in factories and assembled piece by piece. This distinction is often referred to as \"bottom-up\" vs \"top-down\" assembly in the biological \"bottom-up\" approach, the assembly process is guided by the components themselves, while in the engineering \"top-down\" approach, there is an entity conceptually above the object being built that supervises and guides the manufacturing process. Human engineering has mastered top-down methods to create systems of great complexity (but has not extended them to the atomic and molecular scale) and has exploited bottom-up methods for the synthesis of diverse molecular, polymeric and crystalline structures (but has not created information-rich structures of great complexity). <br\/>Project Goals. Our goal is to demonstrate how bottom-up techniques can create complex atomically-defined structures, as biology does, by embedding information and computational processes within the molecules themselves. In biological development, a program (the genome) uses biochemistry to guide the growth process and determine the ultimate form of the organism. In the parlance of computer science, a system that can be programmed to accomplish any task that can be accomplished is called a \"universal\" system. A universal computer can be programmed to perform any computation, while a universal constructor can be programmed to carry out any construction task. Recent work has theoretically shown that universal molecular self-assembly is possible and has experimentally demonstrated that the approach shows promise, using DNA as a construction material to create functional molecular devices so-called \"DNA nanotechnology\". In this proposal, we aim to bring DNA nanotechnology to the point where universal bottom-up self-assembly can be achieved well enough that immediate technological applications can be demonstrated. <br\/>Specific Aims. We aim to make major advances both in our ability to program complex self-assembly logic and in our ability to interface the DNA structures to chemically-, optically-, and electronically-relevant materials. We will focus on four main goals, which span the range from long-term fundamental work to near-term development: (1) self-assembly of a template for a complex molecular-scale electronic circuit; (2) programming the behavior of molecular walking motors to transport components in nanofabrication tasks; (3) attaching carbon nanotube wires to create small nanoscale electronic circuits; and (4) integrating bottom-up and top-down fabrication by placing and orienting self-assembled components at target locations on silicon wafers with functional electrical contacts. <br\/>Uniquely, the aims of this research require simultaneously development of two novel computing systems: the first, inspired by biological self-assembly and development, operates at the level of molecular machines and biochemistry, and will be programmed to construct the second, composed of carbon nanotubes assembled into nanoscale circuits, which operates at the electrical level like conventional computing devices.<br\/>Broader Impact. An important aspect of this project will be the training of young scientists (undergraduates, graduate students, and postdocs) capable of spanning the interdisciplinary subjects involved in this work.","title":"Nano: Collaborative Research: EMT : Toward Universal Bottom-Up Nanofabrication with DNA","awardID":"0855212","effectiveDate":"2008-06-23","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7353","name":"EMERGING MODELS & TECHNOLOGIES"}}],"PIcoPI":["449857"],"PO":["565223"]},"133024":{"abstract":"The University of South Dakota (USD), partnering with Sinte Gleska University (SGU) and the U.S. Geological Survey?s Center for Earth Resources Observation and Science (EROS), proposes to engage more Native Americans in computing through the Getting American Indians to Information Technology (GAIN-IT) project. The project will focus on the Lakota people of the Rosebud Indian Reservation and it will implement and test a a range of mechanisms to increase their participation in computing. The project will develop and implement a community-based summer camp for families to provide them with opportunities to explore context-based computing activities focused on Lakota language skills development and land resources exploration. In addition, it will provide a summer background preparation program (with school-year follow-up) for high school students to prepare them for computing majors in college, a computing-major readiness program for SGU freshmen and sophomore students, distance-education and web-based USD computing courses to help SGU students complete undergraduate degrees in computing, a 3-2 B.S.\/M.S. transfer program in computing for SGU students, and a faculty development program for SGU faculty members to obtain master?s and\/or Ph.D. degrees in computing at USD.","title":"Getting American Indians to Information Technology (GAIN-IT)","awardID":"0739320","effectiveDate":"2008-06-01","expirationDate":"2013-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[353798,353799,353800,"558486",353802,353803],"PO":["561855"]},"136599":{"abstract":"The growing power and flexibility of information technology has allowed developers to build increasingly creative tools; however that same capacity has often led to tools whose use is beyond any but the most expert power-user. One area of creative endeavor of great cultural and economic importance is music. In recent decades, a vast variety of audio production tools have been introduced to enhance and facilitate music creation. Unfortunately, since the tools come from software developers more familiar with Java than musical creativity, many of these tools are extremely complex and use concepts and controllers very different from those that musicians are accustomed to and comfortable with. Since the tools are complex, and interfaces to software suites change every few years, musicians may fail to embrace them or only ?half- learn? them, inhibiting creativity and limiting the range of possible works produced, and the ultimate capacity that powerful technology has to enhance musical creation. Many musicians think about sound in individualistic terms that may not have known mappings onto the controls of existing audio production tools. For example, a violinist may want to make the recording of her violin sound shimmery. While she has a clear concept of what a shimmery sound is, she may not know how to articulate it in terms that let a producer map shimmery onto the available audio tools (such as reverberation and equalization). This project develops a computational tool that works alongside the musician to quickly learn how acoustic features map onto an audio concept, and creates a simple controller to manipulate audio in terms of that concept. In the case of the violin player, the tool would learn what shimmery means to her, and then create a knob that would let her make a sound more or less shimmery. This project uses a user-centered design approach to the development of audio production tools that automatically adapts to the user?s work style, rather than forcing the user to adapt to the tools. The result will be and example of how audio tools can enhance creativity, and more broadly, how affective concepts can be automatically mapped to more discrete parameters associated with digital media production.","title":"Collaborative Research: Pilot: Personalized Tools to Enhance Musical Creativity","awardID":"0757544","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["562931","485732"],"PO":["565227"]},"141011":{"abstract":"Proposals 0820217\/0819987<br\/><br\/>Enhancing the Reliability of Bioinformatics Software by Correlating User Feedback and Execution Data<br\/><br\/>PIs: Andy Podgurski and Wassim Masri<br\/><br\/>A neglected consequence of the proliferation of scientific data sets and computational services on the Internet is that the scientific community is becoming increasingly dependent on the quality of shared data sets and the reliability of the software used to analyze them. To make it easier for developers of bioinformatics software to ensure its reliability, this research seeks to develop, evaluate, and refine automated techniques to help developers discover emergent reliability problems with deployed software, understand their nature and significance, and diagnose their causes. The approach is based on eliciting structured feedback from users about the problem symptoms observed and then automatically correlating this feedback with far more detailed information about internal program dynamics and input-output mappings. Advanced data mining techniques will be employed in tandem with dynamic program dependence analysis to: pool problem reports from different users; corroborate individual reports; group failures according to their symptoms and causes; and help diagnose the causes of failures. The proposed work has the potential to significantly improve the reliability of bioinformatics applications used by thousands of scientists.","title":"Collaborative Research: Enhancing the Reliability of Bioinformatics Software by Correlating User Feedback and Execution Data","awardID":"0820217","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7724","name":"SOFTWARE FOR REAL-WORLD SYSTMS"}}],"PIcoPI":["448583","460483","502559"],"PO":["564388"]},"144333":{"abstract":"There is a significant and growing concern that current and future computing professionals, as they enter the workforce upon graduation, are under-prepared for careers in the development and maintenance of software applications that support web-scale data intensive computing. Large scale cluster computing is a response to the increasing demands for high availability, fault tolerant, decentralized, and very large data retrieval needs in our country. Given the engineering and other constraints involved, optimal utilization of such resources will always be a concern for computing graduates, and thus for the colleges and universities that prepare them. This field requires expertise in a cross-section of engineering and computing disciplines.<br\/><br\/>This 2.5 day workshop in large-scale cluster computing provides material and curricular support for undergraduate teaching institutions. This initial workshop, to be conducted July 16-18, 2008, will invite professors in computer science and software engineering to a workshop at the University of Washington, where such a course has previously been conducted successfully. The goal is to encourage other institutions to adopt some or all of the curricular materials and initiatives into their courses, thus preparing a greater number of computing graduates for careers in web-scale data intensive computing.<br\/><br\/>The explicit goal of this workshop is to reach a large and diverse of group of computing professors, and in turn their students, to increase the likelihood that university graduates are able to step into their careers in such fields as grid and cloud computing and be able to contribute as quickly and effectively as possible now and throughout their careers. We expect this workshop to inform future similar events to further increase the impacts.","title":"Preparing Students and Teachers for Large-Scale Cluster Computing","awardID":"0836525","effectiveDate":"2008-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7782","name":"CLUSTER EXPLORATORY (CLuE)"}}],"PIcoPI":["530092","518494"],"PO":["563727"]},"144355":{"abstract":"information such as facts or pointers to rich information resources are well met. However, support for the more difficult challenges of information seeking is not provided by the current search engines. There are only a few models of human behavior or practical support tools for open-ended, exploratory, discovery-oriented, or recall-oriented tasks that depend as much on results examination and interpretation as on query specification. Meeting the needs of people who seek information to discover and learn is a grand challenge, and the tools and services needed to meet this challenge will be fundamental to the emerging cyberinfrastructure. The time and conditions are right to develop the theory, techniques, and tools to support such information seeking needs. This two-day workshop aims to bring together leaders in information retrieval, library and information science, and human-computer interaction to shape the short- and long-term agenda for research to support information seeking. In particular the workshop focuses on the following three themes: (i) Understanding \/ modeling exploratory search behavior; (ii) Providing system support for exploratory search; and (iii) Evaluating systems to support exploratory search. <br\/><br\/>This workshop will have impact on the emerging information seeking research and development community by defining directions for short, mid, and long-term research. Workshop results will be widely disseminated via the workshop website (http:\/\/www.ils.unc.edu\/ISSS_workshop\/). It can be foreseen that general population of WWW users will benefit from this effort, as better tools and services to support information needs for ongoing work and learning will be developed. These results will also impact diversity in the IT research and development area by opening up this area to underrepresented students, researchers and practitioners.","title":"Information Seeking Support Systems (IS3) Workshop","awardID":"0836616","effectiveDate":"2008-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["531548"],"PO":["563751"]},"144014":{"abstract":"German-USA Collaborative Symposium, Munich, June 8-11, 2008<br\/><br\/>This proposal concerns the organization of a binational meeting of researchers in the field of computational neuroscience from the USA and from Germany, to be held in Munich, June 8-11, 2008. The meeting will combine the exchange of current scientific ideas in the field with an exploration of possibilities for strengthening collaboration between researchers from the two countries. The meeting will be attended by US and German researchers, and representatives from private and governmental German and US funding organizations.","title":"German-USA Collaborative Symposium - Growing Connections in Computational Neuroscience","awardID":"0834442","effectiveDate":"2008-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":[383901],"PO":["564318"]},"139922":{"abstract":"Bench-top fluorescence emission signature analysis instruments are commonly used for environmental and biomedical diagnostics in counter-bioterrorism, DNA\/protein identification and classification, agricultural sciences, and many other applications requiring excellent selectivity and sensitivity. Phoyonic crystal-based biosensors that operate within the visible spectrum are well suited to provide integrated optical sensing solutions that can be employed to increase the utility and portability of analytical instruments that perform fluorescence emission signature detection. The overall objective is to develop an integrated optofluidic biosensor that employs photonic crystals for resonance-enhanced fluorescence emission detection of single-molecule event signatures in the visible spectrum. By employing PhC point defects fabricated in a GaN photonic crystal slab waveguide as flow channels for analytes containing low concentrations of fluorescing molecules that are produced by upstream chemical and\/or biochemical processes new environmental detectors will be produced. The geometry of the point defect flow channel fabricated within the 2-D air lattice will be engineered to act as an optical resonant cavity for fluorescent emission wavelengths, enhancing emission intensity up to 15x and a providing a bandpass filter with <2nm full width half maximum bandwidth, effective at rejecting most background fluorescence noise sources. The educational aspect of the proposed program addresses the 2007 American Competitiveness Initiative report that calls for increasing the number of STEM professionals to improve future American economic competitiveness. The proposed work will directly support one (1) postdoctoral researcher and (2) graduate students. Well-established undergraduate research programs, a central goal of which is to increase the participation of underrepresented minorities and women in nanoscience and engineering will be utilized to provide opportunities for undergraduate student involvement.","title":"Integrated Optofluidic Photonic Crystal (PhC) Resonant Fluorescence Enhancement Biosensors - 06U08WVUdaws","awardID":"0813552","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H187","name":"DEFENSE INTELLIGENCE AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H188","name":"DEFENSE INTELLIGENCE AGENCY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"I331","name":"Defense Intelligence Agency"}}],"PIcoPI":["476067",371821,371822],"PO":["565136"]},"134389":{"abstract":"A fundamental question in the net neutrality debate is the extent to which network operators should be allowed to discriminate among Internet packet streams. Unfortunately, the state of affairs in reality has dramatically surpassed academic debating at various levels. Rough competition among Internet service and content providers, as well as huge monopoly potentials, are radically increasing the scale of discriminatory acts in the Internet. The principal investigator (PI) will build Internet Audit: a system capable of monitoring network or content delivery network (CDN) services and elements, revealing their behavior and policies, and accurately detecting and exposing biased or discriminatory network practices. The research efforts will be focused on devising novel distributed end-host-based auditing methodologies and tools. The PI will systematically study a number of threat models, ranging from open DoS attacks to more sophisticated methods in which ISPs are adding jitter or using differentiated services in destructive ways. <br\/><br\/>Intellectual Merit: This research will address fundamental questions that are key to developing and deploying the Internet Audit services. The researcher will apply elements of the info-gap decision theory to devise and evaluate novel monitoring algorithms and enable the Internet Audit effectively operate in uncertain Internet environments. <br\/><br\/>Broader Impact: By enabling clients to know how ISPs and CDNs behave, the auditing system will enable fair competition, preclude monopolies, oligopolies, or collusions, eventually helping clients get better services at fair prices. By exposing discriminatory network behavior, the system will help reduce the alarming scale of discriminating acts happening in today's Internet, ultimately facilitating the development of free and open society.","title":"CAREER: Internet Audit: A Theory, Toolset, and Applications for a World without Net Neutrality","awardID":"0746360","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["550250"],"PO":["564993"]},"136578":{"abstract":"Curriculum standards for Computer Science (CS) education typically lack creative approaches to Software Engineering, focusing on technological solutions rather than innovative design. Software Engineering is a highly creative endeavor that challenges CS student abilities to establish an innovative vision and to craft an outstanding product. Accountability for and contribution to creative initiatives are not part of grading methods in typical Software Engineering course. This project develops a collaborative framework that encourages and captures the creative discourse of a software project team as they form a vision, acquire useful technology, and implement a non-trivial product to satisfy customer requirements using the definition and analysis of an idea network. Generating and manipulating the network based on ideas as the core creative concept will provide both a visual feedback and a peer response to the creative discourse needed within the software development process. Reinforcement learning techniques are adapted for generating incremental rewards during software development to motivate, recognize, and require creativity, using the idea network as a communication and exploration medium. Real life situations often require learning from environmental feedback or reinforcements, with or without the presence of knowledgeable supervisors who can prescribe the best course of action. This project develops an approach to encouraging and rewarding creativity in a collaborative process that will be applicable to a broad range of collaborative and learning environments.","title":"An Instructional Tool to Foster Creativity in the Software Engineering Process","awardID":"0757434","effectiveDate":"2008-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":[362926,362927,362928,"557926"],"PO":["424970"]},"139317":{"abstract":"Proposal Number: NSF Proposal 0810879<br\/><br\/>Title: Automatic Quality Assessment: Exploiting Knowledge of the Business Case<br\/><br\/>PIs: Tim Menzies, Bojan Cukic<br\/><br\/>Fault prediction models are very useful, as they allow software project managers to guide the allocation of quality assurance resources to artifacts which need them the most. Recent results now indicate that this research area has reached its limits. All data miners hit a performance ceiling effect when they cannot &#64257;nd additional information that better relates software quality measures with fault occurrence. To build better quality predictors that break through ceiling effects, more topology must be introduced into the search space. Standard machine learning algorithms lack the business knowledge which characterizes software projects. To add that business knowledge, it is proposed to investigate which business level project concerns will be the most promising so they can provide guidance for automated fault prediction models. Human-in-the-loop rule elicitation and maintenance environments will be combined with automated rule inference.<br\/><br\/>It is expected that this approach will allow software managers to safely focus on the application of quality assurance techniques of choice, confident that automated quality predictors will raise alerts about the artifacts in which quality issues actually exist.","title":"CPA-SEL: Automated Quality Prediction: Exploiting Knowledge of the Business Case","awardID":"0810879","effectiveDate":"2008-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["541880","560285"],"PO":["564388"]},"134511":{"abstract":"Proposal Number: 0747041<br\/><br\/>TITLE: The Automata Theoretic Method in Software Verification<br\/>PI: Madhusudan Parthasarathy<br\/>Correct programs are hard to write. Tools that find errors automatically and reliably are essential to ensure engineering of correct software. Automata theory has had a great impact in hardware verification, where it forms the basis of model-checking systems against temporal logics. This project leverages automata-theoretic methods to the field of software verification. Automata theory provides several strikingly new mechanisms for verifying software, including handling of complex control flows of recursion and concurrency, and bridging logical specifications to verification algorithms.<br\/>The project will develop these mechanisms and apply them to solve key problems in the following areas of software verification:<br\/>- Developing temporal logics for specifying complex event sequence properties of recursive programs;<br\/>- Checking atomicity violations in concurrent programs using automata-based monitoring; and<br\/>- Verifying heap properties of programs manipulating dynamic data, using a novel automata based abstraction.<br\/>In addition, two tools will be developed: one monitors concurrent programs for atomicity violations, and the second implements an abstraction framework to verify heap-intensive programs. The techniques developed will pave innovative pathways into the fundamental problems of analyzing software. The techniques will have immediate impact on analysis tools built and used in the software industry, and significantly advance the landscape of software verification.","title":"CAREER: The Automata Theoretic Method in Software Verification","awardID":"0747041","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["497077"],"PO":["565264"]},"134445":{"abstract":"Wireless Internet streaming is hindered by a number of obstacles that are rooted from limited available resources on wireless devices. Existing solutions commonly demand additional infrastructure support or seek a trade-off between user perceived streaming quality and resource consumption on wireless devices. In contrast, there are fast growing Internet resources that are not fully and well utilized.<br\/><br\/>The main objective of this CAREER project is to layout scientific foundations on resource management in Internet and wireless networks. Specifically, algorithms will be designed and systems will be implemented to effectively utilize the existing abundant under-utilized or idle Internet resources to improve the streaming performance on wireless devices for both server-based and P2P-based on-demand and live streaming. For this purpose, the under-utilized Internet resources (e.g., bandwidth) and application communication patterns are being leveraged to minimize data transmission power without degrading the application's performance. Furthermore, idle peer computing resources are being utilized and novel distributed online content adaptation schemes are being designed to address multi-dimensional heterogeneity of wireless devices. In addition, the unused covert communication channel and application characteristics are being exploited to design a set of new security protection schemes to satisfy the demand of future wireless Internet streaming services.<br\/><br\/>The efficient Internet resource management techniques to be developed through this CAREER project are expected to address these critical issues in wireless Internet streaming and to enable pervasive and high-quality wireless Internet streaming accesses a reality.","title":"CAREER: Internet Resource Management to Deliver High Quality Live and On-demand Streaming for Wireless Clients","awardID":"0746649","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["486233"],"PO":["565303"]},"134456":{"abstract":"Abstract<br\/>Acquiring Computer Graphics Models of Human Shape and Motion<br\/>James Davis, UC Santa Cruz<br\/><br\/><br\/>This research is developing algorithms to measure human body shape and motion to 1mm and 1deg accuracy without placing \"fiducials\" (i.e., markers) on the person's body. The major advances in this research over previous efforts to do accurate human motion tracking are replacing traditional cameras with high accuracy 3D shape measurement devices and utilizing a carefully constructed body model. Improved technology for the reliable and accurate measurement of human movement will ultimately enable new applications in ergonomics, smart spaces, fashion, surveillance, surgery, security, health, user interfaces, and art. The project uses two specific application areas for evaluation of the scientific goals: improving knowledge about the causes and remedies of athletic injuries through direct measurement of motion and archiving dance performances as an educational resource.<br\/><br\/>This research transforms human shape and motion tracking from a problem of optimization to a problem of human shape priors and real-time, 3D shape measurement. This requires 3D shape sensors which are accurate, work with moving subjects, and can support multiple simultaneous viewpoints. Existing structured light triangulation and time-of-flight sensors do not support these requirements; however, they do have complementary qualities and deficiencies. The investigators study two novel designs that combine these modalities to achieve the improved accuracy. The method requires a prior model consisting of a very detailed and accurate model of human surface shape as a function of pose and identity. This model is constructed initially from full body laser scans of a variety of people with different body types in a variety of different poses. When the highly accurate real-time 3D data measurement system has been fully developed, a much larger training data set will be captured. Improvements in data measurement and prior models will provide a better conditioned optimization space with fewer local minima, allowing for more robust and accurate estimation.","title":"CAREER: Acquiring Computer Graphics Models of Human Shape and Motion","awardID":"0746690","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["551341"],"PO":["532791"]},"134588":{"abstract":"The main thrust of this research is the development of innovative new techniques for the transmission and storage of digital information. The storage and transmission of digital information is now so ubiquitous in our society, that improving the state of the art in this area has a ripple effect that can enable advances in many other fields. As this technology is pushed to its limits, increasingly complex models are required to represent communication systems accurately. To this end, this research focuses on advanced system models whose properties depend on previous inputs and outputs from the system. Hard disk drives are a good representative of these complicated systems and this research should help improve the capacity and reliability of future magnetic storage systems.<br\/><br\/>The unifying theme of this research theme is a class of communication channels (with memory) known as finite-state channels (FSCs). FSCs are a very general class of channels that are used to model complex channels including correlated fading channels, inter-symbol interference channels, and magnetic recording channels. The first part of this research considers the practical computation of information-theoretic quantities, such as the capacity and the error exponent, that are important for the design of magnetic storage devices with very low failure rates. The second part involves the joint iterative decoding for FSCs and low-density parity-check (LDPC) codes. In particular, this work considers a pseudo-codeword analysis for joint decoding that can be used to optimize codes for finite block lengths. The third part studies the rate-distortion (RD) problem for finite-state sources; characterizing this RD curve for large distortions has long been an open problem in information theory.","title":"CAREER: Information Theory and Iterative Decoding for Channels With Memory","awardID":"0747470","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["551056"],"PO":["564924"]},"134357":{"abstract":"The nonlinear underactuated systems represent an important and general<br\/>class of problems in robotics which have proven mostly intractable for<br\/>analytical and numerical control design paradigms. Machine learning<br\/>approaches to underactuated control, which employ approximations to<br\/>make numerical optimal control techniques tractable, will have broad<br\/>applications from walking robots to the control of aerial vehicles and<br\/>fluid systems. Here we pursue a careful analysis of the algorithms<br\/>applied to linear time-invariant (LTI) systems. This will contribute<br\/>fundamental results on the convergence rate of different learning<br\/>algorithms, and the design of robot mechanisms and input-output<br\/>\"features\" which maximize the rate of convergence. Theoretical<br\/>results are coupled with experiments on a strongly nonlinear control<br\/>problem - a two-link bipedal robot walking over rough terrain.<br\/>Acquiring a near optimal feedback policy for this robot would produce<br\/>a result that is surprising and compelling (because a simple robot<br\/>will be traversing more complicated terrain than has been demonstrated<br\/>by any humanoid), but also clear and revealing (because the simplicity<br\/>of the robot exposes the fundamental problems in walking and nothing<br\/>more). Both theory and experiment allow us to perform a careful<br\/>comparison between machine learning control and more mature control<br\/>approaches from modern control.","title":"CAREER: Machine Learning Control of Underactuated Mechanical Systems","awardID":"0746194","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["508267"],"PO":["491702"]},"138845":{"abstract":"Title: Uncertainty-Aware Data Transformation for Collaborative Reasoning<br\/>PI: Kwan-Liu Ma, University of California at Davis<br\/><br\/>Abstract:<br\/><br\/>The ability to obtain insight from massive, dynamic, and likely incomplete digital data is absolutely essential to those who collect these data for time-critical decision-making. This research is developing mathematical formulations for the quantification, propagation, and aggregation of such data to support collaborative reasoning using visual means. The fundamental importance of this research is to give analysts a more trustworthy view of data with the consideration and incorporation of uncertainty due to data transformations and the propagation of that information to the reasoning stage.<br\/><br\/>The process of visual analytics can be viewed as a series of data and visual transformations. The investigators are studying the transformations that help analysts discover structural relationships in large data repositories. These relationships can express aspects of the data such as membership, inclusion, overlapping, and bijective mappings between different data elements. Both data collection and transformation steps, however, incur certain degrees of uncertainty, some due to the transformations, and others inherently present in the source data. Uncertainty can degrade the quality of the information. Understanding and quantifying this uncertainty is crucial to collaborate reasoning, which is the product of the aggregation of confidence levels from several analysts. This research models such transformations and uncertainties as a Bayesian network. Nodes in this network represent the transformations and their associated uncertainty, and also represent the confidence levels of different collaborating analysts. Aggregation of uncertainty between transformations and among analysts is modeled using propagation laws and conditional probabilities. Such a model results in a visual analytics framework providing an explicit representation of uncertainty to enable analysts to assign confidence levels to the gained insight. This framework effectively helps alleviate the complexity of sense-making and visual reasoning.","title":"Uncertainty-Aware Data Transformations for Collaborative Reasoning","awardID":"0808896","effectiveDate":"2008-06-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"H194","name":"U.S. Department of Homeland Se"}}],"PIcoPI":["552243"],"PO":["532791"]},"143950":{"abstract":"This Small Grant for Exploratory Research (SGER) supports a pilot study at New York University<br\/>(NYU), under which computer science (CS) is being taught to math and music savvy children in<br\/>grades 7-12. They are learning how CS principles apply to music, a technical field with known<br\/>computational applications including sound manipulation, music information retrieval, and musicrelated<br\/>artificial intelligence. The focus is on fundamental scientific concepts like algorithms and<br\/>data structures and how they apply to technical problems. This contrasts with previous approaches<br\/>to teaching pre-college CS, e.g., AP computer science classes focus on a currently popular computer<br\/>language (JAVA) and other classes focus on currently popular computer applications (word<br\/>processing, spreadsheets, etc.). Follow up studies are anticipated for teaching other computational<br\/>domains, such as robotics and artificial intelligence approaches to solving games. Again, the focus<br\/>will be on formal computational problem solving, rather than the use of currently popular computer<br\/>languages and applications.<br\/>This study explores the incorporation of basic CS into the middle\/high school curricula, a<br\/>significant question for the educational and scientific research communities. The ubiquitousness<br\/>of computational thinking in current intellectual thought makes this an extremely significant line<br\/>of research.<br\/>The teaching materials created in this pilot study will be available on the world wide web and<br\/>results will be submitted for publication. This pilot study is intended as a stepping stone to a real<br\/>computer science curriculum for pre-college students, which should prove essential to the future<br\/>economic and intellectual development of the United States.","title":"Computer Science and Computational Approaches to Music for Middle School and High School Students","awardID":"0834034","effectiveDate":"2008-06-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["429881"],"PO":["565215"]},"144973":{"abstract":"A computer program is written in a high-level *programming* *language*,<br\/>but to be run, it must be translated into a *machine* *language*.<br\/>A translator is difficult and expensive to build, and using today's<br\/>techniques, each programming language needs its own translator. For<br\/>example, it is nearly impossible to use the same translator for both Java<br\/>and C++. The project is developing techniques by which a ``back end,''<br\/>which understands machine language, can serve many different ``front<br\/>ends,'' each of which understands a different programming language.<br\/>Combining such front and back ends can produce a translator much more<br\/>cheaply than is possible at present. The major new idea is to use<br\/>*three* interfaces. The C-- language is an interface that enables<br\/>the front end to tell the back end what a program should do. The C--<br\/>run-time interface reveals decisions made by the back end so that the<br\/>front end can support such services as garbage collection and threads.<br\/>The Cobalt language is an interface that enables the front end to tell the<br\/>back end what special translation techniques are needed for efficiency in<br\/>a particular language. These interfaces are supported by new, automatic<br\/>techniques for eliminating potential errors in translation.","title":"ITR Collaborative Research: A Reusable, Extensible, Optimizing Back End","awardID":"0838899","effectiveDate":"2008-06-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[386750],"PO":["564388"]},"145842":{"abstract":"Large-scale Internet attacks such as worms and Distributed Denial-of-Service (DDoS) attacks are increasing in scale and sophistication, and are posing an escalating threat to our society, government, economy, and critical infrastructures. Designing defenses against worm and DDoS attacks is thus one of the most urgent research challenges. This research proposes novel approaches and techniques to defend against these large scale Internet attacks.<br\/><br\/>First, this research proposes a new approach for automatic defense against worms. By designing novel automatic methods to detect software exploit attacks quickly and accurately, and to generate and disseminate accurate filters\/signatures, this approach aims to protect vulnerable hosts and provide an easy-to-deploy and effective defense against devastating new worm outbreaks, including zero-day exploit attacks.<br\/><br\/>Second, this research proposes to design a DDoS-resilient Internet infrastructure. This research will investigate the design characteristics and security mechanisms necessary to prevent DDoS attacks not only in the current Internet, but more importantly, in the next generation Internet.<br\/><br\/>This project will provide fundamental new techniques for defending against large-scale Internet attacks, and will have broad impact in providing foundations for building an attack-resilient communication infrastructure.","title":"CAREER: Exterminating Large Scale Internet Attacks","awardID":"0842694","effectiveDate":"2008-06-01","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["526903"],"PO":["529429"]},"134512":{"abstract":"One of today?s most challenging design issues is the threat of radiation-induced soft errors in CMOS digital systems. In nanometer technologies, the frequency of soft errors affects the markets of consumer electronics and networking, not just aerospace or military applications. This research aims to develop mitigation strategies that reduce the overall soft error rate while minimizing traditional cost metrics such as silicon area, power consumption, and performance degradation. Both technology scaling and system complexity have motivated designers to rely upon cell libraries and reusable cores in their design flow. This work investigates the fundamental fault generation and fault transport of radiation-induced soft errors within those building blocks. By identifying the fundamental characteristics of soft errors, design principles can be developed to improve the starting point for reliability of all types of integrated circuits, from avionics and space applications to enterprise servers, network routers, and control systems. This work includes simulation of irradiated individual circuits as well as experimentation to analyze the full hardware implementation of a microprocessor. The research leverages and integrates traditional domains such as computer architecture, VLSI design, fault tolerance, and radiation effects. Another critical component of this effort is the recruitment and retention of students in science and engineering from traditionally underrepresented groups. The PI has partnered with the Tennessee Louis Stokes Alliance for Minority Participation program at Vanderbilt University to provide summer undergraduate research opportunities and professional development seminars to help students prepare for and succeed in graduate school.","title":"CAREER: An Integrated Approach to Soft Error Mitigation in CMOS Digital Systems","awardID":"0747042","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["549985"],"PO":["366560"]},"136602":{"abstract":"The growing power and flexibility of information technology has allowed developers to build increasingly creative tools; however that same capacity has often led to tools whose use is beyond any but the most expert power-user. One area of creative endeavor of great cultural and economic importance is music. In recent decades, a vast variety of audio production tools have been introduced to enhance and facilitate music creation. Unfortunately, since the tools come from software developers more familiar with Java than musical creativity, many of these tools are extremely complex and use concepts and controllers very different from those that musicians are accustomed to and comfortable with. Since the tools are complex, and interfaces to software suites change every few years, musicians may fail to embrace them or only ?half- learn? them, inhibiting creativity and limiting the range of possible works produced, and the ultimate capacity that powerful technology has to enhance musical creation. Many musicians think about sound in individualistic terms that may not have known mappings onto the controls of existing audio production tools. For example, a violinist may want to make the recording of her violin sound shimmery. While she has a clear concept of what a shimmery sound is, she may not know how to articulate it in terms that let a producer map shimmery onto the available audio tools (such as reverberation and equalization). This project develops a computational tool that works alongside the musician to quickly learn how acoustic features map onto an audio concept, and creates a simple controller to manipulate audio in terms of that concept. In the case of the violin player, the tool would learn what shimmery means to her, and then create a knob that would let her make a sound more or less shimmery. This project uses a user-centered design approach to the development of audio production tools that automatically adapts to the user?s work style, rather than forcing the user to adapt to the tools. The result will be and example of how audio tools can enhance creativity, and more broadly, how affective concepts can be automatically mapped to more discrete parameters associated with digital media production.","title":"Collaborative Research: PILOT: Personalized Tools to Enhance Musical Creativity","awardID":"0757552","effectiveDate":"2008-06-15","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":[362991],"PO":["565227"]},"134567":{"abstract":"Abstract<br\/><br\/>Title: Scalable Image Search and Recognition: Learning to Efficiently Leverage Incomplete Information<br\/>PI: Kristen Grauman<br\/>Institution: The University of Texas at Austin<br\/><br\/><br\/>As it becomes increasingly feasible to capture, transmit, and store image and video content on a large scale, the need for machine vision algorithms capable of interpreting it is undeniable. The opportunities appear vast, but progress towards large-scale visual recognition hinges on the development of computationally efficient methods that can effectively leverage minimal supervision. The proposed research considers how informative but incomplete cues can contribute to the learning process, with the goal of enabling large volumes of visual data to be efficiently organized and queried, and a greater number of visual categories to be recognized.<br\/><br\/>This project intends to advance the scale of the recognition problem by using fragments of supervision, even when they are inexact or dynamic. The PI and her team will develop methods to allow very large image databases to be searched according to distance functions inferred from sparse similarity constraints. They will consider visual category learning scenarios where the system itself actively requests only the most useful information, and integrates ambiguous cues from external modalities such as text. As knowledge about an image collection evolves over time, so must the associated search structure. The PI will investigate ways to adapt image indexing techniques according to dynamic constraints. The proposed technical plan calls for a combination of ideas from vision, learning, and algorithms. Scalable recognition and image search will affect the extent to which visual data can be accessed and mined, making this work relevant to other scientific disciplines where images capture vital information but currently lack proper tools for large-scale analysis. The project also entails complementary educational and outreach activities aimed at engaging students in research, furthering communication across related areas, and encouraging young students to consider studying computer science or engineering.<br\/><br\/>Updates will be available from: http:\/\/www.cs.utexas.edu\/¡­grauman\/","title":"CAREER: Scalable Image Search and Recognition: Learning to Efficiently Leverage Incomplete Information","awardID":"0747356","effectiveDate":"2008-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["543538"],"PO":["564316"]},"142587":{"abstract":"There is great need for accessible and effective intelligent tutoring systems that can improve learning by children and adults. In this project, the PI will investigate the role of facial expressions and head movements produced by a lifelike animated character with the goal of indicating important information in a story or the emotions of the characters. The PI's hypothesis is that stories in which the virtual storyteller emulates natural head movements and emotions will lead to increased engagement by subjects, more positive ratings of the storyteller, and better comprehension of the stories. To validate the hypothesis, the PI will conduct experiments in which she manipulates the head movements and facial emotions of a virtual storyteller, so as to emphasize specific speech intervals or to provide emotional expression through the storyteller?s voice. She will analyze videotapes of subjects listening to and looking at the storyteller to assess how attentive they are, and she will also employ questionnaires to measure the subjects? impressions of how believable, credible and human-like the virtual storyteller appears to be. She will further ask subjects to summarize the stories they heard, and will then analyze the summaries both for comprehension and for recollection of emotional content. By these means the PI expects to lay the foundation for a powerful new experimental approach for investigating engaging and effective communication by lifelike animated characters through speech, head movements and facial expression of emotions, and to derive important new insights about how voice and facial expressions can be combined in optimal ways to enable pedagogical agents to provide more believable and effective communication experiences.<br\/><br\/>Broader Impacts: This exploratory research will provide new insights and knowledge about the role of face and head gestures, and facial displays of emotion, on engagement and learning in intelligent tutoring programs that use lifelike pedagogical agents. Project outcomes will inform the design of pedagogical agents that can produce more engaging and natural dialogs and narrations, which in turn will ultimately lead to more effective technology that benefits diverse learner groups across a wide range of application domains.","title":"SGER: Research to Improve Communication by Pedagogical Agents","awardID":"0827188","effectiveDate":"2008-06-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["542455"],"PO":["565227"]},"143357":{"abstract":"The project kick-starts an international symposium series on the topic of heuristic search. Currently, work in this area appears scattered across many conferences in several fields. The intellectual merit of this project stems from the sharing of new results, ideas, and problems across the many areas in AI and robotics where heuristic search is used. Broad impact comes not only from this intermixing but from having a single locus of activity for efforts in heuristic search, one that we expect to become known in the wider community as the place to look when one wants a snapshot of the latest developments in the area. The first symposium will be held as a AAAI workshop in 2008. NSF funding supports student participation and invited speakers, and there is the expectation that the symposium series will be self-sustaining by 2010.","title":"A Symposium Series on Heuristic Search and Its Applications","awardID":"0831035","effectiveDate":"2008-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["460643","502353","394475","97552"],"PO":["387198"]},"136603":{"abstract":"This project develops a creativity enhancing tool for innovative education by building an electronic laboratory notebook application for a tablet PC in which students can combine graphical and handwritten notes in electronic form. The graphical diagrams are understood by sketch recognition systems built by the students and their teachers. Students take their electronic laboratory notebooks from class to class; the application studies the user's context to determine the most likely domain in which the student is drawing. This new model of active visualization will increase students' understanding of the graphical material. This tool allows students to draw free-hand drawings, just as they would on paper into a tablet PC, that are automatically recognized by the computer using sketch recognition system that provides simulation, feedback, and search capabilities. The tool will be evaluated by observation and interview to determine if the students are more creative when using the sketching tool. This work will aid the learning process through a new visualization model for real-time simulation of the students' hand-drawn sketches, ultimately being used to teach students at all levels from kindergarten to graduate students.","title":"Pilot: Let Your Notes Come Alive: The SkRUI Classroom Sketchbook","awardID":"0757557","effectiveDate":"2008-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["398464","492700"],"PO":["565227"]},"144226":{"abstract":"Workshop: Issues in Teaching Computational Linguistics,at the ACL:HLT 2008 Conference<br\/><br\/>The Association for Computational Linguistics<br\/>(ACL) is the primary international organization in the field of<br\/>natural language processing and language engineering.<br\/>The ACL's annual conference is the major international meeting in the field. <br\/><br\/>NSF support subsidizes travel,conference, and housing expenses of researchers selected<br\/>to participate in The Third Workshop on Issues in Teaching<br\/>Computational Linguistics, held during the joint ACL on 19th to 20th June<br\/>2008 in Columbus, Ohio. <br\/><br\/>Intellectual merit<br\/><br\/>The primary challenge addressed in this workshop is that of working<br\/>out what is necessary in order for computational linguists to<br\/>communicate and collaborate effectively across disciplinary<br\/>boundaries, and then to articulate principles for the design of<br\/>curricular materials and pedagogical strategies for fostering this<br\/>collaboration in the classroom. Participants will discuss these<br\/>issues at the workshop, and carry the results back to their home<br\/>instititutions for practical validation.<br\/><br\/><br\/>Broader impacts<br\/><br\/>The workshop contributes to the maintenance and development of a<br\/>community of scholarship about teaching in Computational Linguistics<br\/>and Natural Language Processing. The panel sessions and paper<br\/>presentations are designed, in part, to disseminate experiences about<br\/>the strategy and tactics of teaching to the audience that will be most<br\/>able to use them, in part, to elicit suggestions from industrial,<br\/>government and academic employers about the unmet needs they perceive<br\/>for training and education.","title":"Third Workshop on Issues in teaching Computational Linguitsics","awardID":"0835996","effectiveDate":"2008-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[384542],"PO":["565215"]},"134447":{"abstract":"Small and mini uninhabited aerial vehicles (UAVs) are ideal for many missions which are too risky or infeasible for larger vehicles. However, small size results in performance limitations: there is reduced capacity for on-board energy storage and sensing payload, and viscous forces are a large contributor to drag, making design of efficient vehicles difficult. Birds and insects are faced with similar problems, and they have evolved flight strategies to overcome the challenges associated with small size.<br\/><br\/>This research aims to develop planning and control algorithms that will enable small and mini UAVs to extract energy from the surrounding atmosphere: like birds and human glider pilots, they will be able to soar. There are three aims: (1) the development of planning algorithms that can account for the complex effects of vehicle kinematics\/dynamics and environmental factors such as wind on the feasibility and costs of a trajectory; (2) the development of a vehicle that uses intelligent planning and control algorithms to overcome the challenges associated with its physical constraints; (3) enabling novel science missions. Further, the planning techniques developed here will be applicable to other instances of robot planning under complex dynamic and environmental conditions.<br\/><br\/>The ultimate goal of this research is to enable a robotic aircraft to track a migrating raptor over extended distances and time. Recognizing that this is an ambitious goal, requiring advances in other areas of robotics research as well as intelligent planning and control, this research identifies several science missions that are enabled in the short and medium term by a soaring-capable mini-UAV. These science missions will be undertaken in collaboration with researchers at Penn State's meteorology department and researchers at the Acopian Center for Conservation Learning at Hawk Mountain Sanctuary.","title":"CAREER: Theory and Practice of Autonomous Soaring for Aerial Robots","awardID":"0746655","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["475209"],"PO":["562760"]},"136559":{"abstract":"Puppet choreography is a highly-developed language for controlling mechanically complex marionettes. It has evolved over centuries into a largely standardized form that allows puppeteers to address issues that arise as a result of the complex systems with which they are working. The project looks at how puppeteers address complex tasks in their choreographic descriptions of plays and using that understanding to solve questions of importance to computer science and engineering. These goals will be achieved by creating an automated puppet play, which will use insights about puppet choreography to implement embedded control of mechanically complex marionettes engaged in complex coordination tasks.<br\/><br\/>This work will impact a broad spectrum of activities, including integrating the choreographic structure of programming into two innovative classes, introducing puppeteers to technical computer science and engineering problems, and the introduction of puppetry as programming to children involved in a local YMCA. Students in these classes will also be statistically assessed for their ability to transfer the choreographic techniques to novel problems as well as the puppeteers? ability to apply their expertise to high-level engineering problems in order to gain insight into educational aspects of the creative process.","title":"Collaborative Research: Major: Puppet Choreography and Automated Marionettes","awardID":"0757317","effectiveDate":"2008-06-01","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["553540"],"PO":["564456"]},"140135":{"abstract":"","title":"Executive Secretariat Services for the Interagency Working Group (IWG) on Digital Data","awardID":"0814486","effectiveDate":"2008-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[372384],"PO":["565255"]},"143677":{"abstract":"This is an exploratory study of the convergence of play and creative collaboration in the University of There (UOT), a formal learning environment conceived, created, and run entirely by players within the virtual world There.com. With 147 instructors, 27 staff members and 1869 registered members of its Student Union, UOT is both a large-scale collaborative project and a distributed learning environment. Fieldwork will be conducted primarily in-world through participant observation, interviews, analysis of player-created virtual artifacts, and extra-virtual collaboration environments and tools such as forums, as well as a survey instrument. <br\/><br\/>This project builds on the investigator's previous research, which identified the phenomena of \"emergent authorship\" and \"productive play.\" Contrary to prior assumptions that games were inherently unproductive, this research found that highly engaged players could become motivated to transition into a mode of creativity and productivity, especially those inspired by a strong connection to their communities. Thus engaged in a process of cultural production, players were motivated to embark on often complex and challenging collaborative, creative endeavors. This research will use a mixed-methods approach, including qualitative and quantitative data collected from administrators, instructors and students, to analyze specific ways that players initiate and maintain creative collaboration in online virtual worlds and how players leverage, subvert and augment networked play software for work-related tasks.<br\/><br\/>This exploratory research will provide insight for researchers in computer-supported collaborative work and related fields in order to understand the synergies between play and work and how those might be applied in work-related collaboration tasks. This will include how to use techniques and tools from networked play software for enhancing creative collaboration and knowledge sharing in the workplace. Outcomes will include a preliminary set of design guidelines and hypotheses upon which larger-scale research could be based in future.","title":"Creative Collaboration in Online Virtual Worlds","awardID":"0832803","effectiveDate":"2008-06-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["561204"],"PO":["564456"]},"143920":{"abstract":"NSF is providing partial financial support for a Student Research Workshop <br\/>at the AMTA-2008 conference in Waikiki, Hawaii. The Association for Machine<br\/>Translation in the Americas (AMTA) is a non-profit professional organization<br\/>in the area of Machine Translation (MT) in the US and the American continent.<br\/>The main mission of AMTA is to facilitate and promote the exchange of<br\/>knowledge and information between the communities of researchers, developers<br\/>and users of Machine Translation and related translation technologies. In its<br\/>effort to foster the professional growth of the next generation of MT<br\/>researchers, AMTA-2008 is featuring a new Student Research Workshop, embedded<br\/>as an integral part of the research program at the conference. Students at<br\/>all levels of study (undergraduate, graduate and post-graduate) are invited to<br\/>submit papers describing their research work. NSF is providing funding to<br\/>subsidize travel, conference and accommodation expenses for up to 10 students<br\/>that have been selected to present their research work at the workshop.<br\/><br\/>The AMTA-2008 Student Research Workshop will greatly facilitate professional<br\/>growth for the brightest young researchers in the field of MT, in the early<br\/>stages of their professional career. The workshop will contribute to the<br\/>professional development of a skilled and diverse workforce in the area of<br\/>Machine Translation and computational processing of natural language. MT and<br\/>other language processing applications are becoming vital technologies in the<br\/>global information age. Strength in these areas is crucial to American<br\/>competitiveness in the global economy of the 21st century.","title":"Workshop Proposal: Student Research Workshop at AMTA-2008","awardID":"0833809","effectiveDate":"2008-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["502549"],"PO":["565215"]},"142734":{"abstract":"This project supports a Doctoral Student Symposium at the Third International Conference on Design Computing and Cognition. The goals of the main conference is to describe and discuss (1) state-of-the-art research on computational, artificial intelligence, and cognitive science theories and models of design, and (2) cutting-edge intelligent, interactive, and human-centered information technologies for supporting design. The goal of the interdisciplinary doctoral student symposium is to encourage, expand and guide the participation of young researchers starting research in design computing and cognition.","title":"HCC: Doctoral Student Symposium at The Third International Conference on Design Computing and Cognition","awardID":"0828035","effectiveDate":"2008-06-01","expirationDate":"2008-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["539354"],"PO":["565227"]},"145627":{"abstract":"ABSTRACT<br\/>0448275 <br\/>Aaron D. Stump<br\/>Washington University<br\/><br\/>CAREER: Semantic Programming, Aaron Stump. <br\/><br\/>Correct software has never been more societally important, yet approaches to developing correct software remain too costly for widespread use. This project aims to make a fundamental alteration to the programming paradigm, to enable the creation of provably correct code at a reasonable cost. The project proposes to develop new programming languages where programs can be written with tightly integrated formal proofs of correctness. Proofs are data in the programming language, just like booleans or strings. Type checking ensures that if a function requires a proof of some fact (e.g., a pointer is not null) in order to operate correctly, such a proof is indeed supplied where the function is called. Functions may also produce proofs as part of their output. Technical problems that must be solved arise in supporting programming with proofs in the presence of mutable state (i.e., program variables whose values can change) and other effects. <br\/>Broader impacts of the proposed work include developing new languages for correct programming, together with publicly available prototype implementations; and the creation of new courses for graduate students<br\/>and advanced undergraduates incorporating the ideas of the research. The proposal also includes a K-12 outreach component.","title":"CAREER: Semantic Programming","awardID":"0841554","effectiveDate":"2008-06-18","expirationDate":"2011-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["532995"],"PO":["564388"]},"134869":{"abstract":"For the majority of the world's languages, the amount of linguistic resources (e.g., annotated corpora and parallel data) is very limited. Consequently, supervised methods and many unsupervised methods cannot be applied directly, leaving these languages largely untouched and unnoticed. Another crucial issue, which has received little attention from the natural language processing (NLP) community, is that to date there have been very few studies that examine a large number of languages and incorporate cross-lingual information into NLP systems. As a result, languages are researched and processed in isolation rather than being looked at as part of a big language family.<br\/><br\/>This proposed research has two intertwined goals. The first goal is to create a framework that allows the rapid development of resources for resource-poor languages. This goal will be accomplished by bootstrapping NLP tools with initial seeds created by projecting syntactic information from resource-rich languages to resource-poor ones. The second goal is to use the automatically created resources to perform cross-lingual study on a large number of languages to discover linguistic knowledge. The knowledge will not only deepen our understanding on languages, but also provide additional information that can be incorporated into the bootstrapping module to produce better NLP tools. The research explores two key ideas: The first idea is to take advantage of resource-rich languages by using them to create seeds for bootstrapping NLP tools. The second idea is to identify the relation between languages and use this information to help machine learning. Both ideas point to the same direction; that is, languages are related to one another and should be treated as such.","title":"CAREER: Information Engineering and Synthesis for Resource-poor Languages","awardID":"0748919","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["507284"],"PO":["565215"]},"134209":{"abstract":"Device drivers are a major source of complexity, unreliability, and cost for modern operating systems. The objective of this NSF CAREER research project is to improve device drivers by (1) reducing the complexity and cost of implementing device drivers, (2) improving the fault tolerance of device drivers, and (3) improving the performance of device drivers on modern hardware and software architectures.<br\/><br\/>Given the large body of existing drivers, this research seeks to develop systems and tools that improve legacy driver code for simplicity and fault tolerance. First, it is creating tools that simplify driver development by factoring drivers into a performance sensitive but small portion that executes in the kernel and a large portion that executes in user mode. Second, it develops tools that automatically improve driver tolerance of device failures by identifying code that depends on correct device behavior and then inserting failure detection and recovery code.<br\/><br\/>While legacy code is important, recent technologies open the path for new driver architectures. Many-core processors, virtual machines monitors, and languages for concurrent systems programming all change the platform upon which drivers execute. This research seeks to improve performance on virtualized many-core processors by developing a new driver architecture that removes the guest OS kernel from the I\/O path.<br\/><br\/>The educational focus of the project is to augment today's systems curricula with a modern, hands-on systems programming component, to improve outreach through successful transfer programs, and to enhance the skills of students in technical communication.","title":"CAREER: Improving the Quality and Performance of Device Drivers","awardID":"0745517","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["559530"],"PO":["561889"]},"141019":{"abstract":"Proposal Number: 0820251<br\/><br\/>Title: Studying Design Intent for Software Evolution and Maintenance<br\/><br\/>PI: Dewayne Perry<br\/>Co-PIs: Randolph Bias<br\/><br\/>The goal of this research project is to develop an understanding of the documentation needs of maintenance designers for software systems and to build a model of how these maintenance designers interact with knowledge about legacy designs. Managing evolution is one of the fundamental challenges of software engineering. During the design process many design decisions and trade-offs concerning functional and non-functional requirements must be considered. The process of abstracting requirements into models and converting those models into code yields design artifacts where decisions are documented?if at all?informally. To preserve design decisions through maintenance, the current research approach is to annotate architecture models with explicit representations of design decisions as first-class entities. Unfortunately, it is clear that we lack the instruments for evaluating the effectiveness of design decision modeling systems, for comparing these systems to each other, and for using these analyses to drive future research. To accomplish our research goals, we propose a course of empirical study that uses surveys, expert interviews, and talk-through protocol analysis as the basis for formulating a theory of maintenance design. The theory will be tested using experimentation by protocol analysis and validated through ethnography in real-world industrial contexts.","title":"Studying Design Intent for Software Evolution and Maintenance","awardID":"0820251","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7724","name":"SOFTWARE FOR REAL-WORLD SYSTMS"}}],"PIcoPI":["486519",374822],"PO":["564388"]},"135409":{"abstract":"The proposed infrastructure acquisition and development will provide computing resources to enhance the ability of faculty and students in the PI's department to do computationally instensive research projects. A cluster of 32 computers will provide high throughput for tasks arising from compiler and computer architecture research done on in the area of branch prediction. Accurate branch prediction enables a processor to anticipate and respond to future events in order to improve performance while keeping energy consumption due to wrong-path speculation low. The infrastructure will allow the performance and energy of programs running on multicore processors to be measured and enable the modeling of compiler, processor microarchitecture and various branch predictor schemes which can best respond to changes occuring in program execution.","title":"CRI: IAD Resources for Branch Prediction Research","awardID":"0751138","effectiveDate":"2008-06-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["554979"],"PO":["565272"]},"140338":{"abstract":"The East Coast Computer Algebra Day (ECCAD) 2008 is a one-day session held at Shepherd University on May 10, 2008. The conference is endorsed by ACM SIGSAM and SIAM and includes four invited speakers, more than one dozen poster presentations and software demonstrations. There are more than 80 participants, from a region roughly bounded by New York, Maryland, Pennsylvania, Virginia, West Virginia, North Carolina, Florida, Texas and Ohio. A moderated panel discussion on hybrid numeric-symbolic computing is included. A pre-conference tutorial workshop on using computer algebra systems in K-12 classroom is held on May 9, 2008, which is aimed at high school teachers seeking to bring technology into their classrooms.<br\/><br\/>The conference aims at dissemination and discussion of research in the area of Computer Algebra systems. Modern day problems require sophisticated computer algebra systems that can efficiently emulate numerical and symbolic calculations with a high accuracy and speed. The need for such systems is motivated by the desire to solve mathematical models which provide an accurate representation of real life systems, the solution of which predicts their behavior in a simulated environment. The conference stimulates interest in the technical aspects of computer algebra, including Algebraic Algorithms, Hybrid Symbolic-Numeric Computation, and Computer Algebra Applications in Engineering, Economics and Education area.","title":"East Coast Computer Algebra Day 2008","awardID":"0816712","effectiveDate":"2008-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[372948],"PO":["399214"]},"143858":{"abstract":"Museums, science centers, zoos, and aquaria are in the business of educating and entertaining the visiting public. However, as such institutions strive to become more accessible to people with disabilities, they must find ways to accommodate an increasingly diverse visitor population with varying physical and sensory needs. Facilities that rely primarily on the visual experiences of their exhibits to promote educational and entertainment goals, for example, often find it challenging to enable meaningful participation by the millions of people who are blind or visually impaired. When exhibits are dynamic the problems are compounded, as movements and changes are often difficult to describe, and interactions hard to afford, to individuals who lack normal vision. The behavior of fish in an aquarium, the play of chimpanzees or lion cubs in a zoo habitat, and the cosmic dance of the planets in a science center?s model of the solar system are examples of dynamic exhibits that have until now been inaccessible to visitors with vision impairments. The ultimate goal of the PI in the Accessible Aquarium Project is to make such dynamic exhibits accessible and engaging for visitors with vision impairments, by providing real-time interpretations through the use of innovative tracking and audio technologies. The PI and his team hope to eventually develop cutting edge bio-tracking and behavior analysis techniques that can provide input for sophisticated, informative, and compelling multimedia auditory displays and sonifications (sounds used for the purpose of conveying information about some kind of data to a listener). Virtually every exhibit in an aquarium is dynamic; furthermore, the aquatic nature of these exhibits provides unique and interesting challenges to the use of typical sensing technologies and techniques for tracking. As a result, considerable innovation and new science will be required for the project to succeed. In this exploratory project the PI will assemble an end-to-end proof-of-concept system that involves a research aquarium with live fish, a camera-based bio-tracking system, an algorithmic music generation system, and a method\/interface for users to interact with the resulting audio service. Tracking and sonification algorithms will be developed and integrated, so that the movements of the fish can be used to generate music and other audio annotations. The resulting audio output will be presented to a range of sighted and visually impaired participants, and both objective performance and subjective data will be collected. An iterative design-evaluate-redesign process will allow the PI to rapidly and effectively improve the basic system, and provide a solid proof of concept. This will lead to a complete research platform that can later be used for more in-depth research in all of the constituent fields. The project will draw on the talent of efforts of, and derive inspiration from, a diverse group of researchers, students, and expert members of the community, including a great number of persons with visual impairments.<br\/><br\/>Broader Impacts: This project will advance knowledge in bio-tracking, behavior analysis, sonification, auditory displays, and computer music. While these advances will each be important in their respective fields, the synergy of the advancements in these various areas will open up a whole new world to people with vision impairments: the complex natural choreography of a dynamic aquatic environment. The findings will be applicable beyond aquaria to other kinds of facilities such as zoos and museums, and also beyond individuals with vision impairments to other groups of people such as seniors or those for whom mobility, height, or other problems make it hard to see traditional signage. Indeed, all visitors will benefit from an audio enhancement that allows them to learn about an exhibit while keeping their visual attention on the exhibit itself.","title":"SGER: Prototype Accessible Aquarium: Exploration of Advanced Bio-Tracking and Adaptive Sonification Infrastructure","awardID":"0833379","effectiveDate":"2008-06-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["436270","529975","561054",383396],"PO":["565227"]},"144606":{"abstract":"The High Performance Database Research Center at Florida International University is leveraging the Hadoop framework, which implements Google's computational paradigm MapReduce and provides distributed file system services, for serving geospatial imagery and to execute spatial queries with heterogeneous predicates. This work is laying the foundation for high-performance geospatial querying. For instance, queries such as \"the percentage of Florida state's land-mass that has vegetation\" can be computed using basic image processing (map operation) at each image tile, followed by a simple summation (reduce operation) across tiles that comprise the aerial imagery of the Florida land-mass. A potentially infinite number of such semantic queries can thus be computed using the MapReduce paradigm and a large-scale raster imagery dataset. This exploratory work is providing a bridge between geospatial Web services and the MapReduce platform which has demonstrated success in other data-intensive applications.<br\/><br\/>This work is expected to produce a major impact on the field of geospatial data management and especially decision support based on geospatial data, by enabling decision support queries which were not previously practical. This will provide a foundation to enable critical decision support applications in fields such as disaster mitigation and environmental protection.This work is also providing a uniquely comprehensive collection of geospatial data to a broad research community.","title":"Investigation of Geospatial Data Management on MapReduce Platform","awardID":"0837716","effectiveDate":"2008-06-15","expirationDate":"2011-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7782","name":"CLUSTER EXPLORATORY (CLuE)"}}],"PIcoPI":["558108","550842","516939"],"PO":["427499"]},"140998":{"abstract":"NSF Proposal 0820152<br\/><br\/>A Decentralized and Rule-Based Approach to Data Dependency Analysis and Failure Recovery in a Service-Oriented Environment<br\/><br\/>PI: Susan D. Urban <br\/><br\/>The objective of this research is to develop a decentralized approach to data dependency analysis and failure recovery among concurrently executing processes in a loosely-coupled service-oriented environment. The approach involves monitoring externalized data changes of individual service executions. Peer-to-peer, decentralized communication among process execution agents is then used to discover data dependencies among concurrently executing processes that may lead to data inconsistencies during the recovery of a failed process. Process interference rules of dependent processes are used to test user-defined semantic conditions to determine if 1) critical data conditions have been affected by the recovery of a failed process and 2) recovery procedures should be invoked for dependent processes. The research includes the development of a methodology for using process interference rules. The correctness and efficiency of decentralized data dependency analysis and rule-based recovery procedures are also demonstrated for concurrent processes in the context of a service composition model that supports compensation, contingency, rollback, and retry techniques. This research provides a new way of thinking about traditional transaction recoverability concepts, providing a dynamic approach to discovering data dependencies and responding to failures in a manner that guarantees user-defined correctness conditions for concurrent processes that execute without isolation guarantees.","title":"SRS: A Decentralized and Rule-Based Approach to Data Dependency Analysis and Failure Recovery in Service-Oriented Environments","awardID":"0820152","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7724","name":"SOFTWARE FOR REAL-WORLD SYSTMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["553593"],"PO":["564388"]},"140977":{"abstract":"Proposal Number: 0820060<br\/><br\/>Title: SASSY: Self-Architecting Software Systems<br\/><br\/>PI: Daniel Menasce<br\/>Co-PIs: Hassan Gomaa, Joao Sousa, Sam Malek<br\/><br\/>This research proposes a framework for Self-Architecting Software Systems (SASSY), a significant paradigm shift in architecting large-scale real-world software systems. Focusing on service-oriented architectures, SASSY includes: 1) Self-architecting: given the service and Quality of Service (QoS) requirements, an optimal architecture is automatically generated with the aid of design patterns. The merit of architectural alternatives is evaluated with the aid of multivariate utility functions. 2) Activity-based specification: behavioral requirements are expressed as activity schemas annotated with QoS requirements and domain ontology. 3) Unification of evolution and adaptation: both the evolution of requirements and changes on monitored run-time conditions and QoS trigger the revaluation of architectural alternatives, and, to the extent possible, the automatic reconfiguration of systems. The intellectual merit lies in the development of a novel framework that advances the representation of software architecture and mixed-initiative activities, while integrating optimization theory and analytic models of QoS. The broader impact includes 1) improved productivity in the software industry, due to significant automation; 2) the open-source availability of the tools developed to support and validate this research; and 3) improved software engineering education by incorporating results of this research into graduate and undergraduate courses at George Mason University and publication at educational forums.","title":"SASSY: Self-Architecting Software Systems","awardID":"0820060","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7724","name":"SOFTWARE FOR REAL-WORLD SYSTMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[374686,374687,374688,"534008"],"PO":["564388"]},"143936":{"abstract":"Abstract<br\/><br\/>Fourth International Symposium on 3D Data Processing, Visualization and Transmission (3DPVT '08)<br\/><br\/>The Fourth International Symposium on 3D Data Processing, Visualization and Transmission (3DPVT) will be held in Atlanta, Georgia, between the 18 and 20 of June. The goal of the symposium is to bring together leading researchers from the different communities that work with 3D data, students and representatives of the industry to present their research and discuss the state of the art in the processing, visualization and transmission of 3D data. The scope includes the fields of 3D sensor technology, computer vision, computer graphics, augmented and virtual reality, medical imaging, video and geometry compression, haptics, 3D television, games and entertainment. <br\/>The organizing committee is lead by the general chairs Frank Dellaert (the PI) and Jarek Rossignec, both at the Georgia Institute of Technology, and the program co-chairs Stefan Gumhold (University of Technology Dresden), Jana Kosecka (George Mason University), and Oliver Staadt (Institute of Computer Science, University of Rostock).<br\/>With the recent advances in sensor technology and processing capabilities, 3D data in various forms have begun playing a bigger role in numerous fields of science and everyday life. 3DPVT is a venue for the presentation and publication of high-quality research and application papers in both its refereed and invited programs. While diverse, its topic areas present considerable opportunities for productive collaborations. In addition, the organizing committee has confirmed three distinguished researchers to participate as keynote speakers, who will illustrate the progress and the challenges in each area and promote multi-disciplinary research and collaboration. In summary, the goal for 3DPVT is to contribute in the spreading of ideas and establish itself as a leading conference in a multi-disciplinary context, leading to new research in hitherto unexplored directions.<br\/>An important broader aspect of the conference is the increased student participation made possible through NSF funding. Attending multidisciplinary conferences is a valuable educational experience for junior researches, who have arguably more to gain by being exposed to work that is directly related to their own but comes from potentially very different disciplines. In order to achieve this, the organizing committee has strived to keep student registration costs as low as possible and we will not burden students with the cost of the invited program. In addition, two mechanisms are intended to further increase student participation: (1) travel awards will be given to US student authors of outstanding papers, chosen by the program chairs. (2) US students will be able to apply for the registration fee waiver, in the hope of drawing in US students that might otherwise not be able to attend. Selection will be done by the general chairs and will be done with an eye towards broadening participation from underrepresented groups as well as those having to travel further to attend the symposium.","title":"Fourth International Symposium on 3D Data Processing, Visualization and Transmission","awardID":"0833955","effectiveDate":"2008-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["485377"],"PO":["564316"]},"141605":{"abstract":"This proposal will enable US students to attend an important international forum for intellectual exchange in the robotics community, namely the fourth Robotics: Science and Systems conference. Exposure to the state-of-the-art in global research and to the leading ideas in the field is important for the training and education of tomorrow?s leading scientists. The single-track structure of this forum will enable students to personally interact and establish connections with the international leaders in the field. Attendance at this conference can be expected to positively affect the research of many US students. The exposure to state-of-the-art research and interactions with world leaders in robotics will be inspirational and provide new intellectual impulses to the research conducted at academic institutions in the US.","title":"Student Travel Support for Robotics: Science and Systems 2008","awardID":"0822566","effectiveDate":"2008-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[376899,"534411"],"PO":["403839"]},"141739":{"abstract":"This grant provides partial support for a Summer School covering current research focused on integrating expressive logical systems and powerful theorem-proving assistants into the design, definition, and implementation of programming languages. Speakers will present material covering foundational theory, advanced techniques, and applications. The goal is to help graduate students and researchers from academia or industry understand the critical issues and open problems confronting the field. The broader impacts of the summer school include building a community of researchers around these topics, including expected international attendance. NSF funds provide support for US-based students and emphasize participation from underrepresented groups.","title":"WORKSHOP: Logic and Theorem Proving in Programming Languages","awardID":"0823107","effectiveDate":"2008-06-01","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["422657","475259"],"PO":["564388"]},"140959":{"abstract":"Proposals 0820217\/0819987<br\/><br\/>Enhancing the Reliability of Bioinformatics Software by Correlating User Feedback and Execution Data<br\/><br\/>PIs: Andy Podgurski and Wassim Masri<br\/><br\/>A neglected consequence of the proliferation of scientific data sets and computational services on the Internet is that the scientific community is becoming increasingly dependent on the quality of shared data sets and the reliability of the software used to analyze them. To make it easier for developers of bioinformatics software to ensure its reliability, this research seeks to develop, evaluate, and refine automated techniques to help developers discover emergent reliability problems with deployed software, understand their nature and significance, and diagnose their causes. The approach is based on eliciting structured feedback from users about the problem symptoms observed and then automatically correlating this feedback with far more detailed information about internal program dynamics and input-output mappings. Advanced data mining techniques will be employed in tandem with dynamic program dependence analysis to: pool problem reports from different users; corroborate individual reports; group failures according to their symptoms and causes; and help diagnose the causes of failures. The proposed work has the potential to significantly improve the reliability of bioinformatics applications used by thousands of scientists.","title":"Collaborative Research: Enhancing the Reliability of Bioinformatics Software by Correlating User Feedback and Execution Data","awardID":"0819987","effectiveDate":"2008-06-15","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7724","name":"SOFTWARE FOR REAL-WORLD SYSTMS"}}],"PIcoPI":[374625],"PO":["564388"]},"134370":{"abstract":"Functional verification is widely acknowledged as a major bottleneck in System-on-Chip (SOC) design methodology. The verification complexity is expected to increase further due to the combined effects of increasing design complexity and recent paradigm shift from single processor SOC designs to heterogeneous multicore SOC (HMSOC) architectures, which are expected to receive wide use in future embedded systems. A significant bottleneck in the verification of HMSOC architectures is the lack of a \"golden reference model\" and associated design automation techniques. The central objective of this project is to develop automated tools and techniques to drastically reduce the functional verification effort for future embedded systems. The core of this NSF CAREER research is the synergistic integration of three innovative concepts to enable top-down validation using a single specification: i) a unified specification language that can capture a wide variety of multicore SOC architectures, ii) validation of static and dynamic behaviors of the specified architecture, and iii) coverage-directed functional test generation for implementation validation using a combination of simulation-based techniques and formal methods. This integration has potential for substantially advancing the state of the art in verification of complex and heterogeneous embedded systems. The development of top-down validation methodology can drastically reduce the overall verification effort and enable generation of efficient and cost-effective embedded systems -- low cost everyday appliances for the public and improved accuracy for safety-critical devices. This project seeks broad educational impact and integration of research and education through two venues: i) development of embedded systems courses for undergraduate and graduate students, and ii) involvement of undergraduate students and outreach through UF University Scholars and NSF-sponsored SEAGEP programs.","title":"CAREER: New Directions in Functional Verification of Heterogeneous Multicore Architectures","awardID":"0746261","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518389"],"PO":["561889"]},"135382":{"abstract":"Compared to the development of visual data acquisition technology and the explosive collection of acquired datasets, computational techniques for knowledge discovery and learning from very large, diverse, heterogeneous visual datasets have only evolved modestly, ultimately impeding the more effective utilization and better understanding. The project aims to bridge the aforementioned gaps and foster a strong research program in geometry-guided knowledge discovery in multimodality visual data, with an emphasis on neuroimaging applications. Specifically, the project focuses on: (1) exploring new tools based on Riemannian geometry for computing geometric structures of 3-manifolds and developing a novel volumetric mapping with geometric flow; (2) developing a rigorous mathematical foundation for semi-supervised data clustering; and (3) extending our approaches on geometric mapping and semi-supervised learning to (high-order) heterogeneous volumetric visual data analysis. Once developed, these novel algorithms are applied to computer assisted diagnosis of various important brain diseases, such as tumors and brain functional disorder. This project can help with identifying disease patterns in human brain, and thus possibly provides both clinical and social benefits to a large sector of the population. Moreover, the project can immediately help to elevate the existing resources and on-going research to a unified, systematic level and strengthen computer science education. The research results will be widely disseminated to both computer science and medical communities through free Web access of the software tools (including source codes), and the set of sample data (including raw neuroimaging data and processed ones such as high-resolution brain surface meshes) via the project Web site (http:\/\/www.cs.wayne.edu\/~mdong\/NSF_CRI.html).","title":"CRI: IAD: Acquisition of Research Infrastructure for Knowledge-enhanced, Large-scale Learning of Multimodality Visual Data","awardID":"0751045","effectiveDate":"2008-06-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["425921",359637,"424417",359639],"PO":["563751"]},"147394":{"abstract":"DDDAS-TMRP (COLLABORATIVE RESEARCH): AN ADAPTIVE CYBERINFRASTRUCTURE FOR THREAT MANAGEMENT IN URBAN WATER DISTRIBUTION SYSTEMS<br\/><br\/><br\/>Contamination threat management in drinking water distribution systems involves real-time characterization of the contaminant source and plume, identification of control strategies, and design of incremental data sampling schedules. This requires dynamic integration of time-varying measurements of flow, pressure and contaminant concentration with analytical modules including models to simulate the state of the system, statistical methods for adaptive sampling, and optimization methods to search for efficient control strategies. For realistic distribution systems, the analytical modules are highly compute-intensive, requiring multi-level parallel processing via computer clusters. While data often drive the analytical modules, data needs for improving the accuracy and certainty of the solutions generated by these modules dynamically change when a contamination event unfolds. Since such time-sensitive threat events require real-time responses, the computational needs must also be adaptively matched with available resources. Thus, a software system is needed to facilitate this integration via a high-performance computing architecture (e.g., the TeraGrid) such that the measurement system, the analytical modules and the computing resources can mutually adapt and steer each other. The goal of this multi-disciplinary research is to develop a cyberinfrastructure system that will both adapt to and control changing needs in data, models, computer resources and management choices facilitated by a dynamic workflow design. Using virtual simulation and a field study, this cyberinfrastructure will be tested on illustrative scenarios for adaptive management of contamination events in water distribution systems.<br\/><br\/>Urban water distribution systems are vulnerable to accidental and intentional contamination incidents that could result in adverse human health and safety impacts. The pipe network in a typical municipal distribution system includes redundant flow paths to ensure service when parts of the network are unavailable, and is designed with significant storage to deliver water during daily peak demand periods. Thus, a typical network is highly interconnected and experiences significant and frequent fluctuations in flows and transport paths. These design features unintentionally enable contamination at a single point in the system to spread rapidly via different pathways through the network, unbeknown to consumers and operators. When a contamination event is detected via the first line of defense, e.g., data from a water quality surveillance sensor network and reports from consumers, the municipal authorities are faced with several critical questions as the contamination event unfolds: Where is the source of contamination? When and for how long did this contamination occur? Where additional hydraulic or water quality measurements should be taken to pinpoint the source more accurately? What is the current and near future extent of contamination? What response action, such as shutting down portions of the network, implementing hydraulic control strategies, or introducing decontaminants, should be taken to minimize the impact of the contamination event? What would be the impact on consumers by these actions? Real-time answers to such complex questions will present significant computational challenges. This project will address these challenges by developing an adaptive cyberinfrastucture that will enable real-time processing and control through dynamic integration of computational components and real-time sensor data. This system will be evaluated using contamination scenarios based on field-scale data from a large metropolitan area.","title":"DDDAS-TMRP (Collaborative Research): An Adaptive Cyberinfrastructure for Threat Management in Urban Water Distribution Systems","awardID":"0849064","effectiveDate":"2008-06-15","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7581","name":"ITR-DYNAMIC DATA DRIV APP SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7481","name":"DYNAMIC DATA DRIVEN APPL SYSTS"}}],"PIcoPI":["554770",392669],"PO":["411536"]},"134481":{"abstract":"CCF-0746856<br\/>CAREER: Systematic Software Testing Using Test Abstractions<br\/>Darko Marinov<br\/><br\/>Software testing is important for increasing software reliability, but expensive and can account for more than half of the software development cost. Automated testing can significantly help programmers to develop and maintain reliable software. However, test automation is mainly limited to test execution, while test generation remains manual and mostly ad hoc, which not only makes it hard to develop tests initially but also to maintain and reuse tests.<br\/><br\/>To reduce the cost of developing, maintaining, and reusing tests, this project investigates a novel approach to automated testing based on test abstractions. Conceptually, each test abstraction provides a high-level description of a desired test suite: programmers do not need to manually write large suites of individual tests but instead write only test abstractions from which tools automatically generate individual tests. This project investigates five aspects of test abstractions: (1) What languages to use for writing test abstractions? (2) Which tests to generate from test abstractions? (3) How to automatically generate tests from test abstractions? (4) How to determine whether the code under test passed or failed? (5) How to determine which failing tests are caused by the same code error?","title":"CAREER: Systematic Software Testing Using Test Abstractions","awardID":"0746856","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["518574"],"PO":["564388"]},"136582":{"abstract":"This project expands the capability of man-and-machine design through a creativity enhancing tool which amplifies the human design process by a novel fusion of interactive design with generative coevolution. The project involves the development of a Web-based, Interactive Evolutionary Algorithm to enhance the creativity of human users in designing complex three-dimensional forms, such as tensegrity architecture. A Co-Evolutionary User Modeling Algorithm capable of generating and maintaining a population of user models will serve as critic and collaborator for the human user. By learning the user's implicit goals and cognitive style we can accelerate the creative design process. A creativity-enhancing generative representation capable of encoding families of designs will capture underlying design dimensions. The design engine will be responsible for integrating the information from the evolved user models in order to automatically generate both surprising (critical) and predictable (collaborative) candidate designs for the human designer. The project develops measures of the creativity of the human-computer design system as a whole, by measuring the complexity and novelty of designs produced by the human user. The ability to enhance a user's creativity, and the ability to rapidly synthesize the demands of a large set of users, has immediate applications in several design domains outside of engineering and architecture. The enhancement of educational software, the design of consumer packaging, and artistic endeavors, among many others, all have much to gain from an open ended framework capable of collaborative discovery.","title":"Collaborative Research: Major: Co-evolution of Designers and Critics for Fast Exploratory Form-Finding","awardID":"0757452","effectiveDate":"2008-06-15","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":[362937],"PO":["564456"]},"156174":{"abstract":"Abstract<br\/><br\/>Program: NSF 04-588 CISE Computing Research Infrastructure<br\/>Title: CRI: Acquisition of Research Instrumentation Infrastructure for Next-Generation Broadband Communication Systems <br\/><br\/>Lead Proposal: CNS-0551686<br\/>PI: Henderson, Thomas R.<br\/>Institution: University of Washington<br\/><br\/>Proposal: : CNS-0551378 <br\/>PI : Riley, George F.<br\/>Institution: Georgia Tech Research Corporation - GA Institute of Technology <br\/><br\/>Proposal: : CNS-0551706<br\/>PI : Floyd, Sally<br\/>Institution: International Computer Science Institute<br\/><br\/><br\/>Investigators at the University of Washington, the Georgia Institute of Technology and the International Computer Science Institute will re-design, enhance and maintain the Network Simulator to address research and education challenges for the next generation of data networks. Improvements will include a new simulator architecture, new models for wireless networks, provide for software encapsulation, and integration of the tools with virtual network testbeds. The changes will enhance scalability, extensibility, and new application program interfaces that open the simulator to open source networking software. Emulation capability will be improved to allow integration with testbeds.Wireless modules will be rewritten to track advances in wireless networking. Educational scripts will be facilitated in the enhanced version. The Network Simulator is heavily used in research; these improvements will allow it to continue to be a leading resource for","title":"CRI: Collaborative Proposal: Developing the Next-Generation Open-Source Network Simulator (ns-3)","awardID":"0924385","effectiveDate":"2008-06-01","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[416473,"529904"],"PO":["564778"]},"136594":{"abstract":"The objective of this Game2Learn project is to develop and evaluate innovative computing curricula that enhance creativity and learning, through applying problem-based learning and design studio teaching approaches. The educational approach will increase students? ability in computing through problem-based learning, cultivate student creativity through design studio teaching methods, and situate student learning in an authentic community of practice, including faculty and peers. A broader impact of this project is an anticipated increase in student recruiting and retention by providing innovative outlets and products that allow students to be creative in their study of computing. A secondary goal is that the products created by students in Game2Learn will be effective in supporting learning in introductory computing courses. The intellectual focus of the project is to develop a Game2Learn course that combines creative processes with learning computing and learn from this course how we might inject creativity into other computing courses. The educational games developed will be evaluated based on: effectiveness for learning, creativity in implementation, creativity afforded to players, and impact on the attitudes of players toward computing. The intellectual merit of this project has two parts: the contributions to computing education through the development of teaching innovations that reward creativity, and the creation of new instructional technologies for computing. We also expect that our evaluation of student creativity in producing new educational technologies will also inform efforts to understand the impact of creative processes on learning and motivation.","title":"Pilot: Game2Learn: Creative Computing Education","awardID":"0757521","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["561854"],"PO":["562669"]},"139443":{"abstract":"Proposal Number P0811284<br\/>TITLE: CPA-SEL: Testing Systems with Large and Complex Test Spaces: Techniques, Tools and Empirical Studies<br\/>PI: Adam Porter<br\/><br\/>Today's software systems are often implicitly organized around enormous and complexly-structured design, construction, and usage spaces. This research focuses on defining, creating, and analyzing explicit models that link development spaces to the resulting test spaces underlying software development projects. The research will create and evaluate a new framework for testing systems with large and complex test spaces that (1) explicitly models a system's test space(s), (2) creates sophisticated algorithms that aggressively sample points in the test space, (3) coordinates the test process to test those points in parallel across a powerful virtual grid of computing resources, and (4) merges and analyzes incremental results to steer test processes in ways that improve its effectiveness and efficiency. This research has the potential to transform software development by enabling developers to formulate and apply powerful testing algorithms and by generating rich sources of data that could be analyzed and fed back to projects to drive ongoing development decisions.","title":"CPA-SEL: Testing Systems with Large and Complex Test Spaces: Techniques, Tools and Empirical Studies","awardID":"0811284","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["485900"],"PO":["564388"]},"143570":{"abstract":"This is funding to support travel by 25 students currently enrolled in PhD programs in the United States to participate in the ITS (Intelligent Tutoring Systems) Doctoral Student Consortium, at the upcoming International ITS Conference, to be held June 23rd-27th 2008, in Montreal, Quebec. The ITS International Conference is the premier biennial event for promoting promotes rigorous research and development of interactive and adaptive learning environments for learners of all ages; ITS will be the 9th event in the series. The interdisciplinary areas that ITS represents, comprising cognitive science, computer science, and educational technology, are critical research domains that enhance the effectiveness and usability of software learning systems. Active participation of young researchers in this conference is very important, both for the health of the field and for the researchers themselves. The ITS 2008 Young Researcher's Track (YRT) provides a unique opportunity for PhD students partway through their dissertation research to receive valuable feedback and individual mentoring from top researchers in the field. The YRT officially takes place on June 25-27, 2008 during the three days of the conference that follow the pre-conference workshops and tutorials. The program format dedicated to the students will include three 1.5 hour structured poster sessions open to all conference participants. Students will be paired-up with a senior member of the ITS community who serve as a mentor during the conference. The PI holds an active leadership roles within ITS 2008, and personally holds over $1.5 million of NSF grants in the areas of advanced learning technologies and intelligent tutoring systems. <br\/><br\/>Bringing young and creative researchers to ITS 2008 will help advance an important and socially valuable interdisciplinary research field. For many graduate students, the cost of attending the conference exceeds their travel budget. Thus, NSF funding will significantly impact the careers of the next generation of ITS researchers, by enabling a number of them to take part in an important event they would otherwise have to miss; in particular, those who lack funding from other sources (e.g., advisor's grants). The students will have an opportunity to gain wider exposure in the community for their innovative work, and to obtain feedback and guidance from senior members of the research community. Participation will also help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. The PI and co-PI have indicated that they will act to assure participation by members of traditionally under-represented institutions, and will pay close attention to inclusion of minorities and women.","title":"Support for Young Researchers at the 2008 Intelligent Tutoring Systems Conference","awardID":"0832250","effectiveDate":"2008-06-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["552841"],"PO":["564456"]},"139500":{"abstract":"The internet today provides a wide range of services associated with web sites; examples include getting a stock quote, making an airline reservation, compressing a file or inverting a matrix. Each service may be likened to a basic operation in a computer, the internet computer. An application is a program written over the basic services, i.e., an orchestration of the services. This research is directed toward designing, implementing and studying an appropriate model of orchestration that would allow us to develop wide-area applications succinctly.<br\/><br\/>Just as structured programming gave programmers effective tools to organize the control flow of sequential programs, this research introduces mechanisms to organize the communication, synchronization and coordination in programs that run on wide-area networks. The objective is to develop a robust model of structured wide-area programming, which has constructs to orchestrate the concurrent invocation of services to achieve a goal -- while managing time-outs, priorities, and failure of sites or communication. Specific research goals include enhancing the model to support transactions and extensible data formats, evaluating our model's effectiveness in coding and verifying sizable applications, developing the theoretical foundations for a process algebra for the internet, and designing implementations on distributed platforms with integration to existing languages.","title":"Structured Wide-Area Programming","awardID":"0811536","effectiveDate":"2008-06-15","expirationDate":"2012-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":[370809,"379633"],"PO":["523800"]},"136596":{"abstract":"This project expands the capability of man-and-machine design through a creativity enhancing tool which amplifies the human design process by a novel fusion of interactive design with generative coevolution. The project involves the development of a Web-based, Interactive Evolutionary Algorithm to enhance the creativity of human users in designing complex three-dimensional forms, such as tensegrity architecture. A Co-Evolutionary User Modeling Algorithm capable of generating and maintaining a population of user models will serve as critic and collaborator for the human user. By learning the user's implicit goals and cognitive style we can accelerate the creative design process. A creativity-enhancing generative representation capable of encoding families of designs will capture underlying design dimensions. The design engine will be responsible for integrating the information from the evolved user models in order to automatically generate both surprising (critical) and predictable (collaborative) candidate designs for the human designer. The project develops measures of the creativity of the human-computer design system as a whole, by measuring the complexity and novelty of designs produced by the human user. The ability to enhance a user's creativity, and the ability to rapidly synthesize the demands of a large set of users, has immediate applications in several design domains outside of engineering and architecture. The enhancement of educational software, the design of consumer packaging, and artistic endeavors, among many others, all have much to gain from an open ended framework capable of collaborative discovery.","title":"Collaborative Research: Major: Co-evolution of Designers and Critics for Fast Exploratory Form-finding","awardID":"0757532","effectiveDate":"2008-06-15","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":[362974],"PO":["564456"]},"134562":{"abstract":"As processor microarchitecture has evolved over the past 30 years, both the complexity of the design and the number of transistors used in its realization have escalated. This complexity makes guaranteeing correct operation under all corner cases (logical as well as electrical) an ever more challenging task. This, in turn, translates in to higher and higher practical barriers for microarchitectural innovation for performance optimization as correctness is an overriding consideration. The goal of this CAREER proposal is to explore a new design model called Performance-correctness Explicitly-decoupled Architecture. From ground up, an explicitly-decoupled architecture is designed such that performance optimization circuitry is an independent entity separate from the circuitry guaranteeing functionality and correctness. This explicit separation allows performance optimization to be truly considered in a common-case-only manner, allowing the use of probabilistic techniques considered impractical or even incorrect in a conventional monolithic microarchitecture. This project seeks to develop insights to better understand this design model and develop complexity-effective microarchitectural and software mechanisms for performance optimization.","title":"CAREER: Understanding and Exploring Performance-Correctness Explicitly Decoupled Architecture","awardID":"0747324","effectiveDate":"2008-06-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["548271"],"PO":["366560"]},"136586":{"abstract":"This project expands the capability of man-and-machine design through a creativity enhancing tool which amplifies the human design process by a novel fusion of interactive design with generative coevolution. The project involves the development of a Web-based, Interactive Evolutionary Algorithm to enhance the creativity of human users in designing complex three-dimensional forms, such as tensegrity architecture. A Co-Evolutionary User Modeling Algorithm capable of generating and maintaining a population of user models will serve as critic and collaborator for the human user. By learning the user's implicit goals and cognitive style we can accelerate the creative design process. A creativity-enhancing generative representation capable of encoding families of designs will capture underlying design dimensions. The design engine will be responsible for integrating the information from the evolved user models in order to automatically generate both surprising (critical) and predictable (collaborative) candidate designs for the human designer. The project develops measures of the creativity of the human-computer design system as a whole, by measuring the complexity and novelty of designs produced by the human user. The ability to enhance a user's creativity, and the ability to rapidly synthesize the demands of a large set of users, has immediate applications in several design domains outside of engineering and architecture. The enhancement of educational software, the design of consumer packaging, and artistic endeavors, among many others, all have much to gain from an open ended framework capable of collaborative discovery.","title":"Collaborative Research: Major: Co-evolution of Designers and Critics for Fast Exploratory Form-finding","awardID":"0757478","effectiveDate":"2008-06-15","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["458140"],"PO":["565227"]}}