{"175791":{"abstract":"This travel award will support student participation in the IEEE International Conference on Pervasive Computing and Communications (PerCom) to be held from March 21st to March 25th, 2011, in Seattle, Washington. This is the flagship conference of the pervasive computing community. The conference offers a valuable opportunity to present research results, to learn about the state of the art in pervasive computing, and to train doctoral students through the PhD forum. Of particular value to participating students will be the PhD Forum. In addition to a traditional PhD Forum that consists primarily of poster presentations, the 2011 conference will extend the forum to include a more concrete benefit to student participants. In particular, the PerCom 2011 PhD Forum will include a closed session for participants that will take place one day before the conference starts. The students and the Forum committee members (approximately 6 individuals) will come together for a working session to discuss concerns related to performing PhD research and building a post-dissertation career. Specifically, topics discussed in the Forum will include discussions on how to formulate and follow through on research questions, discussions and critiques of presenting research ideas and solutions, discussions and demonstrations on providing evidence to support research, and a panel focused on how to launch and sustain a research career. The travel awards will focus on particularly recruiting women and minority students to attend the conference by advertising the support opportunity on the PerCom web page and on web sites targeted toward women and minority students, including NSF-sponsored IGERT and REU web sites.","title":"IEEE PerCom 2011 Student Travel Support","awardID":"1057724","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["559679","547675"],"PO":["565090"]},"173030":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042360","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["542301"],"PO":["561855"]},"173041":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042466","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["554887"],"PO":["561855"]},"174185":{"abstract":"Currently, most SNP assay data is made available from genome-wide association studies (GWAS), which proceed by identifying a number of individuals carrying a disease or a trait and comparing them to those that do not or are not known to carry the disease\/trait. Both sets of individuals are then genotyped for a large number of single-nucleotide polymorphism (SNP) genetic variants that are then tested for association to the disease\/trait. GWAS studies using tens of thousands of individuals are becoming commonplace and are increasingly the norm in the association of genetic variants to disease. These studies generally proceed by pooling large amounts of genome-wide data from multiple studies, for a combined total of tens of thousands of individuals in a single meta-analysis study. It can be expected that hundreds of thousands, if not millions, of individuals will soon be studied for association to a single disease or trait. Although SNPs are the most abundant form of variation between two individuals, other forms of variation exist, such as copy-number variation ? large-scale chromosomal deletions, insertions, and duplications. These variations, which have been shown to be influential factors in many diseases, are not probed using the current technology of SNP arrays. An emerging trend in accounting for ?missing heritability? is ?parent-of-origin? effects, where genetic variants confer risk only when inherited from a specific parent. Long-range haplotype phasing is key to identifying the association of the haplotype pattern to the specific parent of origin.<br\/><br\/>The premise of this research is that long tracts are unlikely (to be shared) unless the haplotypes are identical by descent (IBD), in contrast to short shared tracts, which may be identical by state (IBS). A difficult algorithmic challenge is that of tract finding in genotype matrices of a sample of m people genotyped at n SNPs. The premise of our research is that long tracts are unlikely (to be shared) unless the haplotypes are identical by descent (IBD), in contrast to short shared tracts, which may be identical by state (IBS). A difficult algorithmic challenge is that of tract finding in genotype matrices of a sample of m people genotyped at n SNPs. To apply such a long-range phasing algorithm to the U.S. population, it is estimated that 2 million individuals must be genotyped. Algorithmic strategies proposed here show promise that the combinatorial structure of Clark Consistency Graphs can provide the basis for powerful algorithms that will decrease this number substantially. The primary output of this project will be new long-range phasing software, documentation, and source code, all to be immediately and continually available to the scientific community as open-source for research and education.","title":"EAGER: Haplotype Phasing Algorithms and Clark Consistency Graphs","awardID":"1048831","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["551092"],"PO":["565136"]},"183590":{"abstract":"Proposal No: 048558 <br\/>PI name: Massoud, Yehia <br\/>Inst.: William Marsh Rice Univ <br\/>Title: Integrated Automation Strategy for Interconnect Design: A New Paradigm for Mixed-Signal Nanoscale Integrated Circuits<br\/><br\/>Abstract<br\/><br\/>Due to aggressive technology scaling and increasing operating frequencies, interconnect has become the main performance limiting factor in integrated circuits. Consequently, interconnect synthesis plays a vital role in facilitating today's mixed-signal designs, but current design automation techniques fail to include deep sub-micron interconnect effects directly into the synthesis process, resulting in costly redesign. To promote synthesis strategies that handle the increased complexity of mixed-signal nanoscale integrated circuits, the PI proposes a new interconnect synthesis paradigm that evaluates the circuit signal integrity and performance during interconnect synthesis. Under this new paradigm, interconnect in mixed-signal systems is modeled, optimized and synthesized taking all aspects of the system's interconnect into account. This includes analog interconnect structures and integrated components as well as interconnect in digital portions of the design. To facilitate and develop our new system-oriented interconnect synthesis paradigm for mixed-signal nanoscale ICs, the PI will research and create: (i) analytical modeling, optimization and synthesis methodologies that facilitate generalized design automation in integrated mixed-signal and system-on-chip designs; (ii) system-oriented interconnect synthesis strategies utilizing statistical modeling methodologies incorporating inductance to produce layout that meets design constraints. To further prepare students for mixed-signal interconnect design, the PI will employ dynamically changing computer engineering curriculum in both his graduate class, which utilizes innovative semester-long projects emphasizing original research, and his undergraduate class, which stresses the fundamentals of the VLSI design process and provides students with an intuitive understanding of critical concepts.","title":"CAREER: Integrated Automation Strategy for Interconnect Design: A New Paradigm for Mixed-Signal Nanoscale Integrated Circuits","awardID":"1128939","effectiveDate":"2011-01-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[492331],"PO":["562984"]},"173020":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042332","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["542298","496333"],"PO":["561855"]},"173042":{"abstract":"The University of North Carolina at Charlotte (UNC Charlotte) proposes a second extension to the STARS (Students & Technology in Academia, Research, and Service) Alliance. STARS is a national community that uses regional partnerships to broaden the participation of women, under-represented minorities, and persons with disabilities in computing. Its signature and catalyzing program is the STARS Leadership Corps, which provides students with mentoring, professional development and opportunities for research and service, resulting in higher computing student diversity, enrollments, and graduation rates. The extension will scale the Alliance from its current size of 20 universities and colleges to 50, each the center of their own regional alliance of K-12 schools, community colleges, industries, and community organizations. The scaled alliance will focus on <br\/><br\/>- Institutionalizing the STARS Leadership Corps (SLC) as a multi-year curricular program that catalyzes regional partnerships through the tiered participation of students, professionals, and educators in research and civic engagement. <br\/>- Enhancing the STARS Celebration, a national forum to connect regional communities for collaboration on the SLC, STARS demonstration projects, and other BPC initiatives. <br\/>- Creating the STARS Social Network with pioneering technology to support a vibrant community of practice integrated with mobile games and CONNECT technology. <br\/>- Demonstrating a new Tiered Research Experiences for Undergraduates (TREU) program<br\/>- Scaling the STARS Mentoring and Pair Programming demonstration projects <br\/>- Creating an SLC Practices Collection within the BPC Digital Library at BPCPortal.org <br\/><br\/>Finally, the extension will spawn the STARS Institute, a nonprofit that will sustain the annual STARS Celebration and Community Meeting.","title":"BPC-AE: Scaling the STARS Alliance: A National Community for Broadening Participation through Regional Partnerships","awardID":"1042468","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"L122","name":"National Security Agency"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["530659","561854","550118",464128],"PO":["561855"]},"175110":{"abstract":"Complexity and nano-scale non-idealities of modern electronic systems make it hard to achieve a high degree of validation before fabrication. Post-silicon debug of malfunctions is further complicated due to the limited chip interface with the outside world. The existing debug process is predominantly manual, time-consuming, and involves expensive equipments. Consequently, time-to-market and profit are directly at stake.<br\/><br\/>This proposal proposes a methodology for automation of the post-silicon debug process. It relies on embedding and measuring special design structures to verify the \"health\" of the system, and on analysis methods using these measurements, to debug the cause of errors. Specifically, the attention is towards those malfunctions that manifest themselves in the form of timing errors, which cause setup and hold time violations in logic, and are the most cumbersome type of error to analyze. The proposed methodology identifies on-chip measurement sites of combinational and sequential logic, and analysis methods which are either real-time and workload-dependent, or static and based on guard-band computation, at both design and post-silicon stages.<br\/><br\/>The education goals are improving teaching, diversity, and preparation of undergraduate and graduate students for the engineering practice and research. The following three tasks are proposed: 1) developing and teaching a case study based on the \"One Laptop Per Child\" project in an inter-disciplinary freshmen-level course; 2) engaging undergraduate students and developing programming assignments to enhance teaching in the VLSI-CAD area; 3) utilizing various resources to recruit women and minorities, and to train undergraduate and graduate students.","title":"CAREER: Automation Tools for Post-Silicon Debug of Timing Errors in Integrated Circuits","awardID":"1053496","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":[469654],"PO":["562984"]},"177442":{"abstract":"Medical devices historically have been monolithic units -- developed, validated, and approved by regulatory authorities as stand-alone entities. Yet modern medical devices increasingly incorporate connectivity mechanisms that offer the potential to integrate devices via network\/middleware technology into larger systems of cooperating devices. This NSF-FDA Scholar In Residence research project supports interaction by this NSF-supported academic research team with the FDA Center for Device and Radiological Health (CDRH), as well as with a team from the Center for Integration of Medicine and Technology and a team from the University of Pennsylvania on this problem. The goal is to move beyond early industrial medical device integration efforts that focus on streaming device data into electronic health records and integrating information from multiple devices into single customizable displays. The objective of the project is to support frameworks that coordinate the actions of groups of cooperating devices to potentially realize \"closed loop\" scenarios. This work is expected to automate clinical workflows by controlling networked devices as they perform cooperative tasks. The project builds on an open source Medical Device Coordination Framework (MDCF) that has been developed under prior NSF funding. The MDCF includes (a) middleware for integrating medical devices and EHRs and (b) a model-based development environment that could be used to quickly implement medical device coordination applications enabling a \"systems of systems\" paradigm for medical devices as described above. The MDCF already includes support for rapid development of component interfaces for medical devices, displays, coordination logic, and clinical decision support modules. This study extends the MDCF for rapid development of requirements documents, hazard analysis, and correctness claims associated with quality assurance techniques including testing, static analysis, and formal verification of coordination applications and their components. The FDA currently classifies conventional medical devices according to their criticality, but no such scheme exists for device coordination applications. This study is developing a criticality classification scheme for device coordination applications that will provide a structure for regulatory oversight. The study also is providing infrastructure for rapid development of coordination application assurance cases using safety cases an approach that uses semi-formal notations for structured arguments to document and provide evidence that safety claims for a system are satisfied.","title":"An Integrated Development and Certification Environment for a Medical Device Coordination Framework","awardID":"1065887","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["528451",475718,"563763","563764",475721],"PO":["561889"]},"189542":{"abstract":"Our research involves the development of a syntactic approach for<br\/>statistical machine translation that extends a tree adjoining grammar<br\/>(TAG) formalism to the translation problem, and frames translation<br\/>directly as a parsing problem. The model imposes no constraints on<br\/>entries in the phrasal lexicon, thereby retaining the flexible lexical<br\/>entries of phrase-based translation systems; it allows straightforward<br\/>incorporation of a syntactic language model. The operations used to<br\/>combine tree fragments into a complete parse tree are generalizations<br\/>of standard parsing operations found in TAG; specifically, they are<br\/>modified to be highly flexible, potentially allowing any possible<br\/>permutation (reordering) of the initial fragments. This allows the<br\/>model a great deal of freedom in capturing differences in word order<br\/>between source and target languages.<br\/><br\/>The use of flexible parsing operations raises a couple of challenges<br\/>that are a major focus of our research. First, efficient decoding<br\/>algorithms are required for the models. Second, flexible parsing<br\/>operations allow the model to capture complex reordering phenomena,<br\/>but in addition introduce many spurious possibilities. We are<br\/>investigating the use of learned, probabilistic constraints based on<br\/>information in the source-language sentence, or in a parse tree for<br\/>the source-language sentence, thereby incorporating syntactic<br\/>information from the source language.<br\/><br\/>The end goal of the project is to develop new models for translation<br\/>that improve the fluency or grammaticality of translations, improve<br\/>the degree to which semantic information (e.g., predicate-argument<br\/>structure) is preserved in translation, and improve the treatment of<br\/>differing word orders between source and target languages.","title":"RI: Small: Statistical Machine Translation Through a Tree Adjoining Grammar with Flexible Parsing Operations","awardID":"1161814","effectiveDate":"2011-01-01","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[508222],"PO":["565215"]},"174054":{"abstract":"PROJECT ABSTRACT <br\/>\"Counting Van Gogh and Vermeer\"<br\/><br\/>Automated thread counting algorithms, in development since 2007 by Professors Rick Johnson (Cornell University) and Don Johnson (Rice University), are poised for a profound impact on the practice of technical art history. This work is a pioneering effort in the emerging application of signal and image processing to the analysis of paintings. The approach is based on the utilization of spectral analysis of x-rays of paintings. X-rays can display the periodic intensity pattern due to the greater thickness of the lead white ground between the canvas threads. With the addition of innovative application-speci&#64257;c signal processing, local peaks in the spectrum of the x-ray data can reveal the numbers of threads per centimeter, i.e. a thread count, separately for (nearly) vertically and (nearly) horizontally oriented threads. Such thread counts have been used previously, but their manual acquisition proved too costly to be done thoroughly. The introduction of the capability to assemble previously unthinkable thread density and angle pattern maps of high detail across the entire surface of a painting leads to correlation-based identi&#64257;cation of canvases sharing the same pattern in thread density variations. Such weave maps and matches can now be assembled across all of the paintings on canvas of a single artist or school, thereby significantly extending the art historian's capabilities in, for example, dating and attribution. The scale, breadth, and depth of such thread-counting projects represent a bold leap in the capabilities of technical art history. This grant supports the analysis phase of the projects of such grand scope: the thread counting and subsequent weave matching among (i) all of the paintings by Vincent van Gogh (for which data can be obtained by the end of 2010) and (ii) all of the paintings by the Delft School during the career of Johannes Vermeer (for which data can be obtained by the end of 2010). This grant places Professors Rick and Don Johnson in the center of the data fusion, data analysis and database creation activities that are scheduled to occur in Amsterdam during the spring of 2011. The archives being established of thread count reports, including weave density maps providing fingerprints for weave matching and angle maps for characterizing cusping, form a groundbreaking resource at a time when museums are just beginning to address the technological and cultural barriers to technical data sharing among museums and collaborating researchers outside the museum. This project is part of a long-term effort that aims to expand the utility of thread counting from x-rays to all suitable oil paintings on canvas, and to photos of unlined backs of old master paintings and of the raw canvas, for example, of the modern colorfield painters and of densely-woven, multi-pattern fabrics prominent in the design and decorative arts.","title":"Counting Van Gogh and Vermeer","awardID":"1048352","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[466890],"PO":["564898"]},"175396":{"abstract":"Data clustering is a widely used tool for organizing data into coherent groups that correspond to the underlying structure in data. In many applications, incorporating domain knowledge into clustering can help enhance both the quality and the utility of the results of clustering. Unfortunately, users who are not data mining experts currently lack effective means of providing such input to guide clustering. Against this background, Dr. Xiaoli Fern of Oregon State University seeks to develop a novel class of algorithms that take advantage of active learning strategies to interactively elicit information from users to drive clustering. <br\/><br\/>An important aim of this work is the identification of types of input e.g., in the form of must-link and cannot-link constraints, that are both informative and easy to interactively elicit from users to improve the quality and utility of the results of clustering. The study is driven by and evaluated using exploratory data analysis tasks that arise in several application domains (1) ecosystem informatics e.g. exploratory analysis of in-field bird recordings; (2) human-computer interaction (HCI) e.g., analysis of HCI data to understand user behavior; and (3) plant genomics in collaboration with scientists with expertise in each of these domains. <br\/><br\/>Improved tools for interactive exploratory data analysis benefit a broad range of applications including most areas of science in which such analysis is beginning to play an increasingly important role in extracting knowledge from data. For example, in ecological informatics, such tools can help scientists to better understand the impact of environmental changes on bird species which in turn can help develop better methods for managing ecosystems. Research-based education and training opportunities offered by this project help prepare a new generation of researchers and practitioners in exploratory data analysis as well as the emerging area of Ecosystem Informatics at Oregon State University. Dr. Fern's outreach efforts are aimed at helping draw female undergraduates and K-12 students from under-represented groups to careers in computer science and engineering. Further information on this project can be found at http:\/\/web.engr.oregonstate.edu\/~xfern\/CAREER","title":"CAREER: Active Learning for Exploratory Clustering","awardID":"1055113","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["551066"],"PO":["565136"]},"175165":{"abstract":"The multi-radio multi-channel (MR-MC) networking provides a generic computing platform for a wide range of next-generation wireless networks. However, the capacity of MR-MC networking has been underexplored, due to the lack of effective computing methodologies to address the complex multi-dimensional resource allocation. The current state of the art of MR-MC network capacity analysis is limited to heuristic algorithms and loose capacity bound analysis.<br\/><br\/>This project targets at breakthrough studies on optimal resource allocation and low-complexity algorithm development for MR-MC networks. The proposed research activities weave up optimization theory, graph theory, stochastic control, and asymptotic scaling law analysis, to reveal the underpinning factors that distinguish the MR-MC network optimization from the single-radio single-channel (SR-SC) counterpart, develop low-complexity algorithms with theoretically provable performance, and exploit the particular advantages of MR-MC networking in incorporating new techniques for further capacity enhancement. <br\/><br\/>This project will develop a set of novel theoretical tools to fundamentally address the capacity optimization and computational complexity in a multi-dimensional resource space. On the education front, this interdisciplinary research will not only provide various training projects to undergraduate and graduate students, but also inspire students (particularly PhD students) to pursue high-quality research with a creative, open-minded, and cross-disciplinary perspective. On the industry front, the capacity planning and dynamic network control techniques developed in this project are of critical importance to practical wireless network design, and have the potential to be transformed into practical network protocols with low complexity and provable efficiency.","title":"CAREER: Exploring the Underexplored: A Fundamental Study of Optimal Resource Allocation and Low-Complexity Algorithms in Multi-Radio Multi-Channel Wireless Networks","awardID":"1053777","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["549772"],"PO":["565303"]},"173043":{"abstract":"Harvey Mudd College proposes to address student misconceptions about computing by engaging middle school students in a semester-long software development project carried out by college students. The goal of the software project is one of those 21st century computer science artifacts that middle school students can relate to: an educational computer game. The proposed collaborations also works to serve existing needs of college and middle school faculty, facilitates teaching and enhances learning at both levels with very little overhead. For college faculty teaching game design and development, the project aims to fix the gender dynamics of gaming. Through the program, middle school teachers, regardless of technical competency, can engage their students in devising technological tools for their own learning. It also provides a context for authentic communication between middle school and college students, which may motivate and improve foundational literacy as well as content-related vocabulary. In short, the program delivers concrete benefits to middle school and college faculty and students, benefits that are unrelated to computer science recruitment, while at the same time fostering interest in the field.","title":"The Games Network: Games for students, games by students","awardID":"1042472","effectiveDate":"2011-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464130,"527995"],"PO":["561855"]},"178983":{"abstract":"This project will support students to attend IEEE International Symposium on Workload Characterization (IISWC) which is to be held December 2-4, 2010 in Atlanta, GA. The workshop covers all aspects of workload characterization and will help provide students an opportunities to learns about this important area. The students will be asked to write a two page summary of their observations about the topics discussed.","title":"IEEE International Symposium on Workload Characterization (IISWC) Student Subsidy Proposal","awardID":"1104542","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518642"],"PO":["535244"]},"177443":{"abstract":"This is funding to support a Doctoral Consortium (workshop) of approximately 15 promising graduate students from the United States and abroad, along with a panel of about 6 distinguished research faculty mentors. The event will take place in conjunction with the ACM 2011 Conference on Human Factors in Computing Systems (CHI 2011), which is sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI) and will be held May 7-12 in Vancouver, British Columbia, Canada. This is the leading international forum for the presentation and discussion of human-computer interaction (HCI) research and practice, and is attended by approximately 2,500 HCI professionals from around the world. Research reports published in the CHI Conference Proceedings and the CHI Extended Abstracts are heavily-refereed and widely cited; they are among the most scientifically respected and impactful research publications in the field of HCI. CHI 2011 will focus on leveraging our diversity and connecting people, cultures, technologies, experiences, and ideas. More information about the conference is available at http:\/\/www.chi2011.org.<br\/><br\/>The Doctoral Consortium is a research-focused meeting that has taken place annually at the CHI conference since 1986, and has helped to launch the careers of many outstanding HCI researchers. Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their research during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on May 7-8, with follow up activities planned during the technical program of the conference. Extended abstracts of the students' work will be published in the CHI 2011 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results will be made available to the organizers of future consortia. The CHI doctoral consortia have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars; many of today's leading HCI researchers participated as students in earlier consortia.<br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Applications are encouraged from all doctoral students whose research is HCI-related, regardless of the fields in which they are earning their degrees. While NSF funds will be used chiefly to support participation by students enrolled in graduate programs in the United States, some international participants may be supported as well in recognition of the fact that the HCI field embraces educational and cultural traditions that vary in different parts of the world. The organizers will try explicitly to identify and include the broadest possible group of highly qualified participants, and in particular will consider gender in the participant selection process with a target of a 50\/50 split. To further broaden the impact of the event, the organizers have undertaken to use NSF funds to support participation by no more than one student from any given institution. As a consequence of these steps, the student and faculty participants will constitute a diverse group across a variety of dimensions, which will help broaden the students' horizons to the future benefit of the field.","title":"Workshop: ACM CHI 2011 Doctoral Research Consortium","awardID":"1065888","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["549540"],"PO":["565227"]},"173011":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE:Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042306","effectiveDate":"2011-01-01","expirationDate":"2013-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["531513",464036],"PO":["561855"]},"175222":{"abstract":"This project develops a novel framework for jointly understanding the 3D spatial and semantic structure of complex scenes from images. The state-of-the-art computer vision methods deal with these two tasks separately. Methods for object recognition typically describe the scene as a list of class labels, but are unable to account for the 3D spatial structure. Methods for scene 3D modeling produce accurate metric reconstructions but are unable to infer the semantic content of its components. This project seeks to fill this gap and creates the foundations for a new framework for coherently describing objects, object components and their 3D spatial arrangement in the scene's physical space. The research of this project makes two main contributions. First, novel models for representing the intrinsic multi-view nature of object categories and for measuring critical object geometrical attributes are explored. Second, a new coherent probabilistic formulation that is capable to use these measurements for simultaneously estimating the most likely 3D configuration of scene elements and the critical semantic phenomena of the scene are investigated. This research has potential to play a transformative role in many strategic areas such as autonomous navigation, robotics, and 3D automatic modeling of urban environments. Moreover, it is crucial in designing technology for assisting people with reduced functional capabilities. The project integrates research and education by involving undergraduates or high school students in projects whose primary application goal is to develop technology for people with disabilities.","title":"CAREER: Toward Discovering the 3D Geometrical and Semantic Structure of Objects and Scenes","awardID":"1054127","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["507875"],"PO":["564316"]},"175343":{"abstract":"The project focuses on the development and performance evaluation of resource allocation algorithms for wireless networks composed of nodes with rechargeable energy sources. Recent advances in energy harvesting and ultra-low-power wireless communications will soon enable the realization of such networks that will be used in disaster recovery, supply chain management, industrial control, and health care applications. <br\/>Energy harvesting shifts the essence of resource allocation from prolonging the finite lifespan of a device to enabling perpetual life, thereby posing fundamentally new problems. To solve these problems, an energy management module that determines the energy consumption level is being developed. It is based on solutions to new theoretical utility maximization problems under various settings resulting from different hardware characteristics (e.g., battery and capacitor) and different harvesting environments. It will provide important inputs to protocols responsible for sleep-wake, power control, routing, and scheduling.<br\/>To enable the development of the module, the goals of the project are: (i) experimentally characterize energy availability in various environments; (ii) design resource allocation algorithms for predictable, partially-predictable, and random energy sources; and (iii) study the tradeoffs between the communication and computation complexities of the algorithms, and experimentally evaluate their performance. <br\/>The project will provide fundamental understanding of the design tradeoffs in networks of rechargeable devices and will bridge the gap between distributed algorithms and wireless network optimization, and the emerging field of energy harvesting. It will facilitate the operation of self sustainable networks that will have tremendous societal impacts in areas such as environmental monitoring and disaster recovery.","title":"CAREER: Networking Rechargeable Wireless Devices - Modeling and Resource Allocation","awardID":"1054856","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[470173],"PO":["557315"]},"173044":{"abstract":"New Mexico State University, in collaboration with East Stroudsburg University of Pennsylvania, proposes a three-year program to increase the participation of individuals with mobility disabilities in computing. Persons with mobility disabilities are one of the largest groups of individuals with disabilities; however, they are not often targeted by educational programs because of the difficulty of accessing their community and the lack of academic role models to serve as advocates for them. The proposed project, ENABLE, is a comprehensive program that targets individuals with mobility disabilities who are in high school, post-high school, or early college years and have not yet chosen a career path. It will provide them with the knowledge, technology, and support they need to address the barriers to full participation in computing. ENABLE will run short workshops to expose participants to computing as an educational and career path, in order to demonstrate its feasibility and to motivate and excite the students. It will also provide appropriate assistive technology to its participants, and it will support their success through mentoring and interaction with role models. In addition, the project will investigate various interactive video conferencing strategies for delivering its programs; this could lead to a model for institutions of higher education to use in more effectively serving this population. Partnerships with existing programs such as Reaching the Pinnacle and AccessComputing will serve to strengthen the quality of the ENABLE programs.","title":"BPC-DP-Project ENABLE: Enabling Individuals with Disabilities Greater Participation in Computing Through Knowledge, Technology, and Mentoring","awardID":"1042507","effectiveDate":"2011-01-15","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["557314",464134],"PO":["561855"]},"175233":{"abstract":"This project will examine temporal, social, and geographic patterns in large-scale social awareness streams (SAS) data for local communities. SASs, such as Twitter and Facebook, are radically altering our society's information fabric. These new communication platforms are used by millions of people to share brief status messages in socially connected public forums. These messages expose vast amounts of data from, and about, local geographic communities -- data that reflect people's activities, interests, and attention, in thousands of localities worldwide. Using this vast and still emerging sources of data, this research program will make SAS into a viable and significant source of information with capacity to transform our understanding of local communities.<br\/><br\/>As a first activity, the research will adapt algorithms from other fields to identify temporal patterns in SAS data that are stable across multiple communities. Importantly, the work will reason about how and when these patterns break. For example, SAS data may expose sleeping patterns in a community, and help identify mass anxiety when these patterns break. Further, the project will develop methods to identify differences in SAS patterns between local communities, and connect these findings to other sources of data. Next, the research will develop methods to compare how different groups (e.g., by age or ethnicity) use specific neighborhoods and cities. Finally, the work will examine the relations between local communities and network ties as reflected in SAS data. The findings will form the basis for developing novel models of computation for SAS systems, and inform the creation of tools and applications geared to re-imagine SAS as reliable information systems for local communities.<br\/><br\/>The project is rooted in social computing and in human-centered approaches to development of new technology. As such, the work entails interdisciplinary investigation using methods and research questions drawing on fields as diverse as information and computer science, sociology, and communication. The project will tackle significant information challenges that these SAS and other social computing platforms present, such as the scale, bias, and the increasing amount of noise and spam, as well as the brevity and lack of context of posted messages. The research will develop novel methods and approaches to using these new information sources to extract knowledge about, and for, local communities.<br\/><br\/>The research focus on social media and local communities lends itself well to outreach and education activities. The outreach efforts will enhance the connection of public libraries to the communities they serve, and relate the social media experiences of people?s everyday lives to scientific challenges. Participatory design workshops and visits to select educational institutions will engage individuals currently underrepresented in the sciences. An interdisciplinary education program will prepare a diverse set of students at all levels to lead the next generation of innovation, research, and education in socio-technical systems.<br\/><br\/>Finally, this project will have a significant impact on our society. By leveraging SAS as novel sources of information, the research will lay the foundation for new studies about local communities. The resulting technologies and insights will inform and transform the work of local governments, news organizations, planners, and researchers, as well as local residents and activists, allowing them to take full advantage of these new repositories of human expression and thought with relevance to such diverse social challenges as emergency response, resource planning, and public health.","title":"CAREER: Novel Approaches for Reasoning about Local Communities from Social Awareness Streams Data","awardID":"1054177","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["529950"],"PO":["564456"]},"178786":{"abstract":"The Doctoral Consortium funded by this project is a three-day event to be held in conjunction with the IEEE International Conference on Automatic Face and Gesture Recognition to be held on March 21-23, 2011, in Santa Barbara, California. Attendees include graduate students nearing completion of their dissertations who have been accepted to the consortium. Each recent Ph.D. graduate or soon to be graduate chosen to participate in the consortium is paired with a senior researcher who serves as his\/her mentor during the conference. Each participant also presents his\/her research at a doctoral Consortium luncheon open to participants and mentors and also presents his\/her research in a poster session open to all attendees of the conference. Participants also have a travel budget to defray all or part of their expenses incurred in attending the conference and consortium. The consortium provides talented young researchers the opportunity to discuss their work formally and informally with both their peers and senior researchers. These interactions with others coming from different research labs with different viewpoints typically strengthen the ability of young researchers to communicate the value of their own work and to set their work more clearly in the broader context of the research field as a whole.","title":"Face and Gesture 2011 Conference Doctoral Consortium","awardID":"1103817","effectiveDate":"2011-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[479306],"PO":["564316"]},"175288":{"abstract":"Geometric objects called lattices have had countless essential applications in mathematics and the sciences. Recently, they have emerged as a new and very appealing foundation for cryptography, offering asymptotic efficiency, worst-case hardness guarantees, and apparent resistance to quantum computers.<br\/><br\/>This project is dedicated to a broad study of lattices in cryptography and related areas. Specifically, it addresses three main directions: (i) a foundational investigation into the worst-case and average-case complexity of lattice problems, and connections with number-theoretic problems such as factoring; (ii) constructions of essential cryptographic notions such as proof systems and pseudorandom objects; (iii) the design of efficient, practical algorithms supporting fast implementations of lattice-based schemes. Results from this project may one day lead to wide adoption of faster and more secure cryptography in a wide variety of computing and networking applications.<br\/><br\/>At the heart of any cryptographic protocol are assumptions about the scheme's operating environment and the attacker's interactions with it --- but more fundamentally, about the amount of computing resources required to break it. The past few decades have seen tremendous success in using an area of mathematics called \"number theory\" to build cryptography that provides rich functionality while withstanding very strong attempts at breaking the schemes. For instance, today's widely used cryptosystems are believed to be secure for hundreds of years, even when attacked by the most powerful computers ever designed. However, this security comes at a price: the systems are not especially efficient on today's (or tomorrow's) computing platforms. A further worry is that \"quantum computers\" can, in principle, completely break many of today's most widely used cryptosystems. While quantum computers have so far only been demonstrated at very small scales, their long-term possibility necessitates new approaches in cryptography.<br\/><br\/>Geometric objects called \"lattices\" have recently emerged as an entirely different, and very attractive, mathematical foundation for cryptography. Lattice-based schemes offer significant utility and efficiency, especially on highly parallel machines, and appear to be secure even in the face of quantum attacks. Due to their novelty, however, many basic questions are unanswered or entirely unexplored. This project conducts a broad study of lattices in cryptography, ranging from a foundational investigation of their hard problems and connections to other number-theoretic problems, to new designs of essential cryptographic objects and studies of their concrete efficiency and security.","title":"CAREER: Lattices in Cryptography","awardID":"1054495","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}}],"PIcoPI":[470062],"PO":["565157"]},"175299":{"abstract":"Functionalized end effectors are built from nanosystems to support intelligent nanorobotic manipulation. This is achieved using segment-nanostructure-based nanoelectromechanical systems (NEMS) and nonophotonic systems. Internal electron tunneling and optical coupling are used as the common base of these end effectors for achieving high resolution while keeping to nano scale. Specific problems investigated include (1) the internal electron tunneling and optical coupling between the segmented elements in a nanostructure such as carbon nanotube shells, peapod nanowires, head-to-head positioned nanotube tips and dimmer nanospheres, (2) the development of sub-nanometer position\/displacement sensors, picoNewton force sensors, and attogram mass detectors using the segmented nanostructures, (3) integrating these sensors onto transmission electron microscope compatible chips, atomic force catilevers, and rolled up helical nanobelts, and (4) the application of these systems.<br\/><br\/>The project impacts the development of new nanotechnology for nanorobotics including theory and processes for actual construction of systems. This leads to new tools for manufacturing and other technology fields such as the electronics and microscopy industries. Optical nanoantennas have the potential to remarkably enhance energy adsorption for solar cells. Applications are found in single molecule manipulation in biology, material characterization and inter-molecule interactions in supramolecular chemistry. General applications include the potential application of intelligent nanosystems in health care. Broad outreach is achieved through lectures, workshops, courses and websites for K-12 students and teachers, as well as for the public who have an interest in this emerging field.","title":"CAREER: Nanosystems Enabled Intelligent End-effectors for Nanorobotic Manipulation","awardID":"1054585","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["541569"],"PO":["564069"]},"175189":{"abstract":"Two-way communication, where clients\/parties A and B wish to exchange a stream of information, is a natural form of communication of great relevance in present and future wireless networks. Applications include two-way high data-rate tele-medicine, video-conferencing, the synchronization of data among terminals, and communication between a base station and clients. The investigator seeks to establish a fundamental understanding of how best to communicate two-way exchanges of information over networks, of immediate relevance as 1) communication is intrinsically a two-way endeavor but has mainly been treated as two one-way links, 2) new techniques have led to significant progress towards the elusive capacity of a network, and 3) recent results have shown that techniques which exploit the two-way nature of the data can outperform and differ markedly from straightforward extensions of one-way methods to two-way communications. The research will be integrated with practice and education through partnering with Motorola, existing UIC Women in Science outreach programs, and the investigator-led UIC Software-Defined Radio Lab.<br\/><br\/>The intellectual merit lies in the development of novel theoretical foundations able to explain, predict and analyze optimal two-way communication strategies over wireless networks. The investigator focuses on three integrated thrusts: 1) the introduction of a framework for two-way communications to understand two-way networks with and without relays under different channel models and assumptions on two-way adaptability, 2) the derivation of exact, and alternative performance guaranteeing capacity characterizations for increasingly complex subsets of the two-way framework, and 3) the determination of when separation is optimal and derivation of joint source-channel rate distortion regions for the transmission of correlated sources over noisy two-way networks.","title":"CAREER: Foundations of Two-Way Communication Networks","awardID":"1053933","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["517407"],"PO":["564924"]},"175322":{"abstract":"Network resource allocation deals with efficiently managing the<br\/>scarce resources available with the objective of providing us<br\/>with practical algorithms to achieve high performance in<br\/>wireless networks. On the other hand, network information<br\/>theory develops conceptual tools to build new mechanisms to<br\/>exploit the full capacity of wireless networks. Currently there<br\/>is a significant gap between the information theoretic<br\/>capacities of wireless networks and the performances achieved<br\/>by existing resource allocation schemes.<br\/><br\/>This project aims to bridge these two separate perspectives to close<br\/>this performance gap. To that end, it develops practical network<br\/>algorithms over an underlying infrastructure of multiuser channels<br\/>along with the appropriate information theoretic mechanisms. To achieve<br\/>this task, it proceeds along the following main research thrusts: (1)<br\/>network design, which involves the optimal construction and dynamic<br\/>update of multiuser channels; (2) network control, based on joint<br\/>optimization of physical and the network layers and the development of<br\/>the necessary stochastic optimization tools; (3) design of<br\/>low-complexity multiuser channel schedulers with a near-optimal<br\/>performance; (4) performance evaluation of the developed algorithms<br\/>through real link-level measurements.<br\/><br\/>The outcome of the research has the potential to give us performance<br\/>gains by more than an order of magnitude, which will enable the design<br\/>and implementation of faster, more reliable, and more robust wireless<br\/>networks operating under a variety of conditions. Dissemination of the<br\/>research will be achieved by submitting the results for publication in<br\/>refereed scholarly journals, presentation in conferences and symposia,<br\/>and lectures and workshops in academic and industrial settings.","title":"CAREER: Design and Control of Wireless Networks on Network-Information-Theoretic Foundations","awardID":"1054738","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["506208"],"PO":["557315"]},"173034":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042376","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464101],"PO":["561855"]},"173045":{"abstract":"New Mexico State University, in collaboration with East Stroudsburg University of Pennsylvania, proposes a three-year program to increase the participation of individuals with mobility disabilities in computing. Persons with mobility disabilities are one of the largest groups of individuals with disabilities; however, they are not often targeted by educational programs because of the difficulty of accessing their community and the lack of academic role models to serve as advocates for them. The proposed project, ENABLE, is a comprehensive program that targets individuals with mobility disabilities who are in high school, post-high school, or early college years and have not yet chosen a career path. It will provide them with the knowledge, technology, and support they need to address the barriers to full participation in computing. ENABLE will run short workshops to expose participants to computing as an educational and career path, in order to demonstrate its feasibility and to motivate and excite the students. It will also provide appropriate assistive technology to its participants, and it will support their success through mentoring and interaction with role models. In addition, the project will investigate various interactive video conferencing strategies for delivering its programs; this could lead to a model for institutions of higher education to use in more effectively serving this population. Partnerships with existing programs such as Reaching the Pinnacle and AccessComputing will serve to strengthen the quality of the ENABLE programs.","title":"BPC-DP-Project Enable: Enabling Individuals with Disabilities Greater Participation in Computing","awardID":"1042508","effectiveDate":"2011-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464136],"PO":["561855"]},"178501":{"abstract":"The Association for Computational Linguistics (ACL) is the primary international organization in the field of natural language processing. The ACL's annual conference is the major international conference in this field. This project is to subsidize travel, conference, and housing expenses of students selected to participate in the 49th Annual Meeting of the Association for Computational Linguistics: Human Language Technologies Student Session. This session is part of the ACL HLT conference to be held on June 19-24, 2011 in Portland, Oregon, USA. The Student Session includes two separate categories of submissions: thesis proposals and research papers. The goal is to provide a forum for students at different stages in their research. <br\/><br\/>The Student Session provides a valuable opportunity for the next generation of natural language processing researchers to enter the computational linguistics community. It allows the best students in the field to take their first important step toward becoming professional computational linguists by receiving critical feedback on their work from external experts, and by making contacts with other students and senior researchers in their field. The students who are involved in running and selecting papers for the session also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The Student Session contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing research community.","title":"ACL-HLT 2011 Student Session","awardID":"1102435","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562856"],"PO":["565215"]},"177577":{"abstract":"OISE-1066733 <br\/>Choset<br\/>Summary: The proposal is for support of a planning visit to develop a project on: Robotic Exploration of Mersa\/Wadi Gawasis Archeological Sites, Hurghada, Egypt. The PI seeks to establish a long-term collaboration with Dr. Mohamed Abd El-Maguid, marine archeologist at the Egyptian Supreme Council of Antiquities, to use robots to inspect regions of archeological interest that are too dangerous for people to enter. The specific area of interest lies in the Mersa\/Wadi Gawasis region that contains many man-made caves that were used to store pieces of ancient ships. This region has now gained considerable interest by Egyptologists. Dr. Kathryn Bard of Boston University and Rodolfo Fattovich of the University of Naples \"l'Orientale\" are active in this area, and Abd El-Maguid has joined with them to assist in excavations and in determining historical significance. They have identified two specific caves that contain artifacts of great interest and are looking at another location for a man-made storage facility. These areas are not safe for people to enter. The PI has developed robots, called snake robots, because they articulate and maneuver through cluttered spaces, much in the same ways biological snakes do. They are to be explored for use in these sites. <br\/><br\/>Intellectual merit: Snake robots are expected to identify and even retrieve items from archeological caves. This trip will allow the PI to inspect the cave entrances which hopefully will be followed up by an expedition with the robots. The PI also will work with Dr. Majd Sakr, another Carnegie Mellon faculty, using efforts in cloud computing to disseminate the results of their excavations with the robots. <br\/><br\/>Broader Impact: The PI and his Egyptian collaborator expect this work to lead to future expeditions of robotics in archeology in confined spaces. Already, robots have been used once in the great pyramid and under water. In this new field of robotics, archaeologists can use robots as tools to explore and investigate important archaeological sites without disturbing the surrounding areas, which often happens when people enter such locations. While exploring such regions, the robot is able to construct a map of the site, which in turn can be viewed by others. This map will provide a three-dimensional view of the location, allowing anyone, both archaeologist and non-specialist alike, to remotely and virtually visit a location of great national interest. The PI plans to visit schools around Pittsburgh to talk about robotics, drawing on the application of archeology for subject matter. Snake robots looking for artifacts of historical significance is one of the more compelling stories one can tell a middle school student to raise interest in science and engineering. Choset will also develop lab modules for the undergraduate robotics with the theme of looking for artifacts in dangerous environments. This project is funded by the Division of Information and Intelligent Systems and the Office of International Science and Engineering.","title":"International Planning Visit: Robotic Exploration of the Mersa\/Wadi Gawasis, Hurghada, Egypt","awardID":"1066733","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["553216"],"PO":["540599"]},"174079":{"abstract":"This project will demonstrate that creativity enhancing tools developed initially for advanced integration of computer technology with the performing and visual arts can be effectively oriented towards demanding scientific visualization applications. Field is a software development tool developed and used by the digital art collective the OpenEnded Group in collaboration with several noted choreographers and visual artists in the integration of advanced computer technology and the performing arts. Field is a meta-authoring environment. It is an open-source programming environment that has been architected in such a way to support interdisciplinary projects that call upon domain-specific tools, libraries, and languages that has a minimal core and a powerful plug-in system. Field was created in the context of widely divergent interdisciplinary projects; its aim is to give its users not only the ability to work rapidly, but to shape their Field environment extensively and flexibly for their own demands. <br\/><br\/>In this project Field software development environment will be amended to support data visualization research from the Tetherless World Constellation group in collaboration with the Curtis R. Priem Experimental Media and Performing Arts Center (EMPAC) at Rensselaer Polytechnic Institute. This project will benefit scientists, digital artists, and humanity scholars. Scientists will gain a powerful tool for the dissemination of scientific and technological information in areas of vital interest and thus of benefiting the public at large. By enabling better visualizations of very large-data sets, the project will help make those data-sets far more accessible and comprehensible to citizens. Since Field makes it far easier to create interactive visualizations, citizens may actively explore these complex models rather than passively receive a pre-selected set of results. Digital artists will gain a tool that provides new subject areas and canvas for making works that incorporate very large data-sets such as those of interest to the sciences and humanities including economics, scientific, demographics, medical and environmental.","title":"EAGER: Field: A New Tool for Creative, Interdisciplinary Visualization of Data","awardID":"1048440","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["522219","527613"],"PO":["565227"]},"176268":{"abstract":"This project is creating a novel modular, distributed, and highly scalable computational\/physical system for multi-disciplinary research and applications in micro-manufacturing. The approach is a robotic-agent-based distributed information architecture of a type not found in industry today. The distributed nature of the agent-based system requires neither centralized control nor a centralized database for its operation, thereby avoiding communication and code complexity bottlenecks. The goals are to 1) dramatically reduce design, program, and deployment times compared with state-of-the-art systems, 2) greatly increase mechanical precision over existing methods, and 3) greatly reduce floor space requirements. <br\/><br\/>Intellectual Merit<br\/><br\/>The architecture is highly generic, and is applicable to multi-step flow-through production systems for domains such as micro-fabrication of small parts, assembly of meso- and micro-scale products, synthesis of discrete amounts of chemicals, and analysis of biological materials. The system addresses several difficult human-computer interface issues making the system more accessible to researchers and students and much easier to use compared with conventional approaches. In this work, collections of computational\/physical agents are designed and programmed through a virtual 3D representation that is registered in space and synchronized in time with the actual micromanufacturing system. The system includes several automatic procedures such as calibration and multi-agent coordination which reduces programming tedium. We expect the developed system to be a suitable research platform where multiple, concurrent experiments can be run by faculty and students. The intention is also to provide a working system which can serve as an example for industry. The team has great expertise in this area, and their research will benefit both the research community through the development of new manufacturing techniques, but will also contribute to the field by expanding its scope of applicability.<br\/><br\/>Broader Impacts<br\/><br\/>This project provides a vision of compilable factories, and if broadly realized, represents a transformative breakthrough in automated assembly. This includes automated assembly of optical systems, mass spectrometers, 3D devices formed from metal parts, and mass replication of intelligent micro-robots for environmental monitoring. Moreover, education is a vital component of the proposed project. The enhanced minifactory provides a new learning environment for multi-robot programming and cooperative robotics. There is also a close interaction closely with manufacturing engineering faculty and students at Walla Walla University in Washington State. We also continue the fruitful<br\/>student exchanges with micro-manufacturing laboratories at Technical University of Munich and the Swiss Federal Institute of Technology. As always, undergraduate students engage in the research and add a valuable and vital contribution to the work.","title":"A Distributed Computational\/physical System for Micromanufacturing","awardID":"1059860","effectiveDate":"2011-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["524687"],"PO":["543539"]},"173672":{"abstract":"Recent technological advances have enabled digital applications to move away from purely desktop and office settings to gain greater relevance in our everyday lives and spaces: homes, classrooms, public and cultural places, scientific laboratories and beyond. This has given rise to an increasing number of creative practices and research areas that seek to overcome the long-standing separation between the physical and digital worlds. The ACM Conference on Tangible, Embedded and Embodied Interaction (TEI) serves as a gathering place for the interdisciplinary community of researchers, practitioners and theorists who work in this emerging field. This award is in support of the second annual TEI 2011 GSC, to be held at the TEI 2011 conference in Madeira, Portugal in 2011. The TEI 2011 GSC serves to hone the research and design skills of a new generation of scientists, engineers, and designers who will shape the technological and socio-cultural landscape of the future as computing integrates more and more tightly into physical objects and spaces. The consortium program aims to increase participation in the tangible, embedded and embodied interaction academic community by providing mentorship for young scientists, researchers, and designers in this field, and by giving them the opportunity to meet and engage with more senior TEI researchers at the conference.<br\/><br\/>Building on the success of the 2010 GSC the 2011 GSC will help to promote national and international collaborations that happen at the intersection of diverse fields and creative practices, from science and engineering, to social and cultural studies, to arts and design. The TEI 2011 GSC will bring together students from a range of fields, including industrial design, arts, digital media, human-computer interaction and computer science, and opened their perspectives to each other's different practices and methods. The aim of the GSC is to encourage students to take a broad perspective on creativity and research that bridges the physical and digital worlds in the growing field of tangible embedded and embodied interfaces. During the TEI 2011 GSC, students will be invited to present their work, and will have the opportunity to receive constructive criticism from diverse viewpoints by a panel of faculty mentors. In addition to this, they will also present their work in posters at the main conference, and their short papers will be included in the conference Proceedings and in the ACM Digital Library.","title":"WORKSHOP: Graduate Student Consortium at the 2011 Tangible, Embedded and Embodied Interaction (TEI'11) Conference","awardID":"1045671","effectiveDate":"2011-01-01","expirationDate":"2012-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550811"],"PO":["565227"]},"175169":{"abstract":"This CAREER proposal aims to improve the energy efficiency of computer chips by developing circuits and automated design tools to recycle the energy in the power-hungry clock network that synchronizes events on most computer chips. Much like a hybrid car stores the kinetic energy during breaking into a battery for later use, the proposed resonant clocking stores the energy of the largest on-chip signal into on-chip inductors for later use. The proposed techniques combine knowledge from digital, analog, and radio-frequency (RF) circuit design and will integrate with existing low-power digital design methods and be manufactured using existing semiconductor processes. In addition to the circuits, the PI also proposes tools and design methods that will enable digital chip designers to easily include the proposed circuits by abstracting the previous broad knowledge base. This will accelerate the adoption of the proposed techniques for maximum pervasiveness and impact.<br\/><br\/><br\/><br\/>The broader impact of the proposed research will be to increase power efficiency in computer chips and enable designers to include resonant clocks in chips ranging from mobile phones to large commercial servers. The previously unattainable power gains can then be used to improve battery lifetimes in mobile systems, decrease operational costs in commercial data centers, provide green computing by lessening the energy burden on our environment and improve computing performance which will enable new applications of computer systems. The PI will also pursue several educational and outreach efforts that focus on under-represented and under-privileged students in the local community through a series of seminars and summer internships.","title":"CAREER: Design Automation and Circuits for Energy Efficient Computing using Resonant Clocking","awardID":"1053838","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["511551"],"PO":["562984"]},"172991":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042224","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[463978,"463980",463980],"PO":["561855"]},"175159":{"abstract":"CAREER: Algorithms for Next-Generation Genomics<br\/>The objective of this project is to develop algorithms for new and emerging high-throughput DNA sequencing technologies. These technologies are lowering the cost of DNA sequencing by orders of magnitude and thereby enabling a variety of new applications. These new applications, combined with the varying characteristics of the DNA sequences produced by these technologies, are increasing demand for efficient algorithms to interpret the resulting large volumes of DNA sequence data. The PI will develop a new class of robust algorithms for genome assembly and discovery of DNA sequence variants. Some of these algorithms will rely on the availability of a closely related reference genome sequence, while others will operate de novo directly from the individual DNA sequences (i.e. reads) produced by a DNA sequencing machine. In the latter case, the PI will design algorithms that exploit longer range DNA sequence information available in newer single-molecule and nanopore sequencing technologies. These algorithms will retain high sensitivity and specificity while scaling to billions-trillions of nucleotides and thousands of genomes. Finally, the PI will introduce combinatorial algorithms for the study of genome rearrangements in heterogeneous mixtures of DNA sequences. Such mixtures arise in metagenomics or cancer genomics, where the DNA that is sequenced is a mixture of genomes from different species, or from cells harboring different mutations, respectively. The PI collaborates closely with biologists and technology developers to ensure relevance and applicability of the algorithms. At the same time, some of algorithms and techniques from graph theory, combinatorial optimization, and probability that are developed in the proposal are applicable to problems outside of biology. <br\/>Broader Impact<br\/>The proposed research will be integrated with an educational component that includes the development of undergraduate seminar in personal genomics, a summer research experience in computational biology for high-school students, and the incorporation of a computational biology module into a summer computing camp for 9th grade girls. The PI will continue to actively mentor and recruit undergraduate and graduate students, including women and underrepresented minorities. Finally, software implementing the algorithms will be freely distributed to the scientific community through a public webserver.","title":"CAREER: Algorithms for Next-Generation Genomics","awardID":"1053753","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["531609"],"PO":["565223"]},"175237":{"abstract":"With the growth of online communities, the Web has evolved from networks of shared documents to networks of knowledge-sharing groups and individuals. A vast amount of heterogeneous yet interrelated information is being generated for which existing information analysis techniques are inadequate. Current tools often neglect the actual creators and consumers of information, and as a result, the findings are only useful to data analysts. <br\/><br\/>The user-centric Foreseer is the next generation of information analysis for online communities. It represents a new paradigm of study through the four \"C's\": content, context, crowd, and cloud. Information analysis of content is put into the context of the users' daily lives to benefit the communities (crowd) that generate information residing in the cloud. This project provides integrative and in situ analysis of information generated in online communities that is of the people, by the people, and for the people. Research of Foreseer consists of formal community models, efficient data analysis tools, advanced solutions of real applications, and novel information systems.<br\/><br\/>Making the results available to everyday Web users, not just data analysts, will result in improved dissemination of ideas, shared public opinions, and wise decision-making in online communities. Novel Web-based information systems will form prototypes that can be used in online social and health communities. The research will enhance the current information analysis and retrieval curricula and lead to a number of new classes in information science and health informatics. Research results will also be published on the project Web site (http:\/\/www-personal.umich.edu\/~qmei\/foreseer\/).","title":"CAREER: Eyes of the Foreseer - Integrative and In Situ Information Retrieval and Mining in Online Communities","awardID":"1054199","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["483366"],"PO":["563751"]},"175248":{"abstract":"Project Abstract<br\/>Removing Energy Barrier towards Capacity-Approaching Information Transmission and Storage<br\/>The objective of this research is to cut the total energy of achieving near Shannon capacity information transmission and storage. While it is common to use channel coding to save transmit energy for a reliable delivery, the decode energy of some of the best capacity-approaching codes can be prohibitive due to circuit complexities and overtake transmit energy. Many capacity-approaching codes are not guaranteed to work well either, as they often give up their effectiveness at low error rates, requiring extra transmit energy to maintain their performance. The rising energy for both transmit and decode poses obstacles to future high-performance applications, such as optical and wireline communications, due to the escalating cost of operating closer to the ultimate channel capacity. More severe impediments are placed on low-energy applications, such as battery-powered portable devices and sensors, in their path of acquiring more robust communication and storage capabilities.<br\/>This research advances state-of-the-art coding algorithms and techniques by addressing two research frontiers of near-capacity low-density parity-check (LDPC) codes: (1) the intrinsic weakness of LDPC codes that is manifested as error floors; and (2) the high decode energy due to interconnection complexity and memory inefficiency. The approaches span coding theory and integrated circuits, and their novelties are threefold: (1) creation of a universal, low-cost local search algorithm to overcome error floors; (2) creation of transient memory to exploit data access pattern for low energy; and (3) new techniques to improve the achievable performance of non-binary LDPC codes while reducing interconnection complexity. This project trains students in both coding theory and integrated circuits and draws broad participation of students, professional colleagues, and industrial partners in collaborative research and education.","title":"CAREER: Removing Energy Barrier Towards Capacity-Approaching Information Transmission and Storage","awardID":"1054270","effectiveDate":"2011-01-15","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["550682"],"PO":["564924"]},"173016":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042320","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464050,"560704"],"PO":["561855"]},"173038":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042446","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464114],"PO":["561855"]},"173017":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042322","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["551205","502937"],"PO":["561855"]},"180189":{"abstract":"Workshop: 2011 NSF CAREER Proposal Writing Workshop<br\/><br\/>Abstract<br\/>An NSF CAREER Proposal Writing Workshop will be held on April 15, 2011 (tentative), at Old Dominion University, Norfolk, VA. The objective of this workshop is to enable future CISE proposal submitters to prepare competitive CAREER proposals. The major components of the workshop include presentations on NSF proposal guideline and proposal writing, experience sharing, mock panels, and proposal clinic. The workshop intends to provide young faculty with skills in proposal writing, panel review experience, and opportunities to interact with NSF program directors and recent NSF CAREER awardees. This workshop will also provide travel support to encourage junior faculty members at HBCU\/MEI to participate the NSF CAREER proposal writing practice.<br\/>Intellectual merit<br\/><br\/>Major activities of the workshop include: presentations by NSF program directors, invited speakers, and recent NSF CAREER awardees; mock panel review sessions; interactions among workshop participants, NSF program directors, and recent NSF CAREER awardees; and proposal clinic. The workshop materials will be available in workshop website and the presentations in the workshop will be podcasted via the internet.<br\/><br\/>Broader impacts<br\/><br\/>The workshop will be open to participants from U.S. national universities (including HBCU\/MEI). About 100 junior faculty members (about 16 or more of them are from HBCU\/MEI) across the nation are expected to attend the workshop. They will learn the guidelines and obtain experience of writing a competitive NSF CAREER proposal. This will positively affect these young faculty members at their early career stage to develop their academic career as outstanding researchers and educators.","title":"Workshop: 2011 NSF CAREER Proposal Writing Workshop","awardID":"1110356","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["527258",482837,482838],"PO":["565223"]},"173018":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042324","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464056],"PO":["561855"]},"172985":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042201","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["527412",463964],"PO":["561855"]},"172358":{"abstract":"Dr. Schulman's research will tackle two problems of central importance in computer science: (1) Linear programming in strongly polynomial time and (2) Matrix pre-conditioning by diagonal balancing. A strongly polynomial-time algorithm for linear programming would be a breakthrough in complexity theory over the real field. It may lead to improved algorithms for harder types of<br\/>convex programming (e.g., semidefinite) which (albeit in polynomial time) are currently prohibitively slow. Better algorithms for matrix preconditioning have the potentially to significantly improve linear algebra software packages.","title":"AF: EAGER: Algorithms in Linear Algebra and Optimization","awardID":"1038578","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["550549"],"PO":["565157"]},"173019":{"abstract":"Hampton University, in collaboration with Carnegie-Mellon University, Florida Agricultural and Mechanical University, the University of the District of Columbia, Norfolk State University, Winston-Salem State University, Morgan State University, Jackson State University, Elizabeth City State University, Duke University, the University of Alabama Tuscaloosa, and the University of Michigan, proposes the ARTSI Alliance (Advancing Robotics Technology for Societal Impact). ARTSI is a consortium of Historically Black Colleges and Universities (HBCUs) and major research universities (R1s) working together to increase African American participation in computer science, with a focus on robotics. This extension proposal will expand ARTSI to seventeen Historically Black Colleges and Universities (HBCUs) and roughly 10 major research universities (R1s). Hampton University is the new lead institution; Carnegie Mellon University remains the lead R1 school. The extension introduces three new initiatives that (1) improve the quality and uniformity of robotics instruction by developing robotics curriculum modules specific to the needs of HBCUs, (2) pilot a program to attract STEM (Science, Technology, Engineering, and Mathematics) students to HBCUs by offering robot programming activities in local high schools, and (3) pilot skill-building program for rising sophomores to better prepare them to become involved in robotics research. The extension also includes new collaborations with the Caribbean Center for Computing Excellence (a BPC Alliance in Puerto Rico and the US Virgin Islands) and the Defense Advanced Research Projects Agency.","title":"BPC-AE: Collaborative Research: The ARTSI Alliance: Advancing Robotics Technology for Societal Impact","awardID":"1042326","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[464058,464059],"PO":["561855"]},"172986":{"abstract":"Worcester Polytechnic Institute, together with Brown University, and Northeastern University, proposes Bootstrap, a program to excite students, particularly those from under-represented groups, about computing before they make career-limiting academic choices in high school. Under-represented students frequently have little access to computing education, much less one that bridges to other courses in computing or its supporting disciplines. Bootstrap is a computing curriculum that engages students with animation, targets core skills in algebra and coordinate geometry, and is vertically integrated from middle-school through college-level computing. The latter two features--deep connection to mathematics and a migration path to advanced curricula--distinguish Bootstrap from other introductory computing programs aimed at pre-college students.<br\/><br\/>Bootstrap's algebraic connections lie in its programming model, which differs from that of other introductory programming projects. By tying programming to algebra, Bootstrap reinforces essential material that underlies a wide array of STEM and computing careers and has the potential to integrate into a conventional middle-school curriculum. Bootstrap is currently deployed to under-represented middle-school students through partnerships with national and regional after-school organizations (such as Citizen Schools and AfterZones) with the help of volunteer teachers from companies such as Google, IBM, Thompson Financial, and Rockstar. In the last four years, over 450 students (70% minority, 70% receiving free or reduced lunch) have taken the program; after just nine class meetings, most have used algebra to create a running computer game of their own design. This proposal has three broad goals: (1) to further deploy the middle-school program, (2) to distill, deploy, and test an advanced (high-school level) course in the extra-curricular format, and (3) to develop software infrastructure needed to both sustain the program and extend its reach to programming games for cellphones. During the proposal period, Bootstrap will be offered to 700 students and the PIs will gather valuable data on how Bootstrap impacts students' academic choices and perceptions of algebra and coordinate geometry.","title":"BPC-DP: Deploying a Vertically-Integrated Computing Curriculum to At-Risk Students","awardID":"1042210","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["485803"],"PO":["561855"]},"174306":{"abstract":"One of the central algorithmic problems in public key cryptography is the so-called discrete logarithm problem for elliptic curves; the assumed hardness of this problem lies at the heart of major cryptographic schemes. While no efficient (polynomial time) solution on classical hardware is known, for quantum computers an efficient algorithm to compute discrete logarithms is available. In view of the notorious hardness of controlling large-scale quantum systems, the availability of an efficient \"quantum attack\" does not seem to pose an immediate cryptanalytic threat, but it remains difficult to predict what is feasible to implement within a few years. Especially for cryptographic schemes requiring extreme parameter choices, like implementations on low-cost devices, it would be desirable to have a better understanding of the potential of attacks relying on quantum circuits.<br\/><br\/>Quantum circuits involving just a few qubits are the most likely to be available in the short-term, and this project explores the cryptanalytic use of such circuits, the main focus being on the discrete logarithm problem for elliptic curves. Some years ago a new representation of elliptic curves has been identified, and this led to interesting algorithmic improvements for classical architectures. For quantum computers one may hope that this new representation enables relevant implementation improvements as well. Looking at algorithmic questions in the context of elliptic curves, one has to deal with computations in another algebraic structure: finite fields. Accordingly, this project also explores quantum cicuits for finite fields with cryptanalytic significance.<br\/><br\/>It is planned that small-scale quantum circuits that are identified in this project will be made available through a web site, providing a collection of candidate algorithms for experiments in quantum computing.","title":"EAGER: Small-Scale Quantum Circuits with Applications in Cryptanalysis","awardID":"1049296","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7928","name":"QUANTUM COMPUTING"}}],"PIcoPI":[467624],"PO":["565157"]},"180149":{"abstract":"This research develops a data set of postings on Craigslist during the mid-November to late December 2010 time period. The purpose of the data set is to support subsequent analysis for evidence of \"scams\" -- fraudulent postings. The dataset will provide a basis for testing algorithms for automatic scam identification. Such scams are expected to be most common during the high volume period targeted for collection.","title":"RAPID: Understanding and Preventing Scam on Craigslist","awardID":"1110079","effectiveDate":"2011-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["491568"],"PO":["497499"]},"184804":{"abstract":"In this project we will focus on four important aspects (requirements)<br\/>of an end-to-end software environment for performing multiple parallel<br\/>non-rigid registrations over the Grid. Our application is Image Guided<br\/>Neurosurgery (IGNS). IGNS is an important tool for neurosurgical<br\/>resection which is a common therapeutic intervention in the treatment<br\/>of malignant brain tumors.<br\/><br\/>The four requirements we will study in this project are: (1) the<br\/>high-performance of the parallel and distributed non-rigid<br\/>registration code by dynamically balancing the processors work-load,<br\/>(2) the ease-of-use from medical doctors (radiologist) of a<br\/>web-service by developing a Graphical User Interface (GUI) for clients<br\/>of our web-service (3) the portability of the code to run from a<br\/>single high-end workstation to more than one clusters of workstations<br\/>within the local and wide area networks available to research<br\/>hospitals and medical centers, (4) the reliability by guaranteeing<br\/>that part of the system will complete the computations for the image<br\/>registration and by making sure we meet the time constrains by<br\/>acquiring and re-configuring the system at runtime to compensate for<br\/>lost (faulty) computing resources.<br\/><br\/>The end-product will be a prototype of an IGNS web-service. However,<br\/>this project will have broader impact to image guided therapy because<br\/>the same framework (but different modalities and finite element<br\/>approximation models) can be used in prostate biopsy and treatment,<br\/>and liver cryotherapy.","title":"CSR-CSI: Software Environment for Real-Time Non-Rigid Registration using Commodity and Grid Computing","awardID":"1136536","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["561580"],"PO":["565255"]},"196915":{"abstract":"This award provides partial support for the Computational Neuroscience meetings, CNS*2009, 2010, and 2011, to be held in Berlin, Germany; San Antonio, Texas; and Stockholm, Sweden. The conferences will bring together a large body of international scientists working across scales (molecular to systems) and disciplinary perspectives (e.g., biology, computer science, engineering, mathematics) on various aspects of computational and theoretical understanding of the nervous system. This award will contribute to an expanded tutorial program, a new Frontiers in Computational Neuroscience Lecture, and travel support for women and minorities.","title":"Knowledge Transfer in Computational Neuroscience","awardID":"1241456","effectiveDate":"2011-01-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[528245],"PO":["564318"]},"184805":{"abstract":"The goal of this research involves the study of high-end parallel finite element mesh generation software capable to deliver and sustain concurrency which will fully utilize current Teraflop and next generation Petaflop high-end architectures. Other than the direct impact to supercomputing this research will have a broader impact to many (bio-) engineering applications that can benefit from scalable field solvers and Teraflop\/ Petaflop supercomputers. Such software can also provide challenging and realistic benchmarks which can help to understand the behavior of end-to-end dynamic applications on multi-layered architectures, and thus will be invaluable for the performance evaluation community and design of new supercomputers.<br\/><br\/>The expected outcome of this research is an effective and efficient implementation of adaptive finite element mesh generation and refinement on high-end parallel architectures. However, parallel mesh generation belongs to the broader class of adaptive and irregular applications which are challenging and labor intensive to develop and maintain. As a result, parallel mesh generation is one of the last applications to be installed on parallel architectures. This research will remedy this problem for high-end architectures by focusing on the following objectives. Develop a runtime system for multi-layered parallel adaptive and irregular applications that can efficiently orchestrate intra- and inter-layer data movement and load balancing. Use the runtime system to design an evolutionary approach for developing multi-layered parallel mesh generation software capable of exposing concurrency from the very beginning of the execution and sustaining up to one quadrillion concurrent work units.","title":"A Multi-Layered Finite Element Application and Runtime System for Scalable High-End Computer Architectures","awardID":"1136538","effectiveDate":"2011-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7583","name":"ITR-HECURA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["561580"],"PO":["565272"]},"175290":{"abstract":"Energy efficiency is a critical goal for modern computing: power consumption represents a significant portion of operational cost for data centers and cloud computing providers; wireless sensor networks are only effective when individual nodes do not deplete their power quickly after deployment; increasing battery life is high on the wish list of millions of laptop and smartphone users. Prior research on energy-efficient computing is largely focused on innovations in VLSI, architectures, operating systems, and compiler optimizations.<br\/><br\/>This project explores how innovations in programming models can contribute to energy-efficient computing. A focus on programming models has the distinctive benefits of promoting application-specific energy reduction, ensuring high portability in heterogeneous computing platforms, and facilitating the development of maintainable green software. The project centers around the design of a novel programming system where characteristics in energy-aware programming--such as power modes--can be declared or inferred as types, over which a type system can reason rigorously and compositionally. Types can further guide standard energy reduction techniques such as dynamic voltage and frequency scaling, and be exploited for certifying program energy characteristics in the Internet era. The outcome of the project includes the design of an energy-aware language and a compiler with novel features for energy reduction and certification. The project also brings the awareness of energy efficiency into computer programming classes and fosters next-generation green-conscious programmers--the contributors of a more sustainable society.","title":"CAREER: Programming Models for Green Software","awardID":"1054515","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[470066],"PO":["564588"]},"178062":{"abstract":"This research studies new mechanisms for enabling the consumer of the service to reduce the visibility of consumer computations to the service provider and thereby reduce the trust that the consumer places in the provider. At the same time, the mechanisms allow security of the cloud computing environment to be monitored by a trusted third party. The work also develops a quantified method to evaluate the degree to which a user's privacy is disclosed and tools for monitoring causality relationships.","title":"TC: EAGER: New Privacy Preserving Architecture for Security Monitoring in Cloud Computing","awardID":"1100221","effectiveDate":"2011-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["559867"],"PO":["562974"]},"175391":{"abstract":"In a decade feature sizes of integrated circuits are expected to shrink from present day 45nm to 12nm, increasing soft error rates from once-per-year to once-per-day. The International Technology Roadmap for Semiconductors (ITRS) report recognizes reliability as one of the most important challenges for the next decade, and points out that soft errors are the primary threat. Soft errors are transient faults, caused mostly by cosmic radiations and can lead to incorrect results or total system failure. The impact of soft errors on terrestrial systems can be both dire and sweeping, with targets including financial systems, health-care databases, power-grid, and communication infrastructure. Although much work has been done towards protecting computing systems from soft errors, the need for even more power, performance and area-efficient schemes for protection against soft errors is undeniable.<br\/><br\/>This research builds upon existing hardware and microarchitectural schemes to provide even more power-efficient protection from soft errors, and will primarily be achieved by better application analysis. This research involves developing application analysis, and transforming the way application uses microarchitectural components to maximize protection from soft errors. Key components of this project are to: Develop analytical techniques to model vulnerability of i) L1 data cache, ii) register file, and iii) pipeline latches, and use the vulnerability estimates to drive compiler, microarchitectural, and hybrid techniques to provide power-efficient protection of the components. iv) Synergistically combine component-level protection to provide power-efficient, system-level protection. v) Develop techniques for dynamically trading off power and performance for reliability. vi) Develop schemes for power-efficient multi-core protection. Keeping computation reliable, and yet power, performance and cost efficient is crucial in<br\/>maintaining the pace of technological advancement, securing national interests, and ultimately in improving the quality of life. PI plans to make public release of RP2Explore: a compiler-microarchitecture toolkit for quantitative study of power, performance, area, reliability, and thermal trade-offs in programmable platforms based on GCC for easy adaptability and maximal impact.","title":"CAREER: Compiler Techniques for Power-Efficient Protection Against Soft Errors","awardID":"1055094","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["560263"],"PO":["565272"]},"175182":{"abstract":"Recently, the digital world has moved to a \"cloud\" computing and storage model, where businesses are offering storage space, computing power, and access to applications for rent. While this new model presents numerous opportunities, consumers of cloud services will face new challenges in data privacy and integrity.<br\/><br\/>New practical cryptographic schemes for the cloud environment are the expected direct outcomes of this research. On the data privacy front, the goal is to use rental services to efficiently compute on sensitive data without exposing it to the server performing the computation. As a special case, schemes are needed for delegating sensitive capabilities to a partially trusted server. The server will only be able to perform actions allowed by the capability. For example, a user might grant her mail server the right to forward her encrypted email to a colleague without allowing the mail server to read her email. On the data integrity front, the goal is to develop techniques for digitally signing data so that any portion of the data may be quoted or redacted in an authenticated manner. A final goal is to study related foundational questions regarding circular encryption and the limitations of bilinear groups in cryptography.<br\/><br\/>This research develops ideas and implementations for the efficient use of computing resources for rent. Its broader impact is in protecting data privacy and integrity for all users of these popular services.","title":"CAREER: Practical Cryptography for the Cloud","awardID":"1053886","effectiveDate":"2011-01-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["521326"],"PO":["497499"]},"179384":{"abstract":"In the past, speech research training was only available to students and researchers associated with major research universities and large centers where dedicated software development was joined with mentoring and expert technical support. In the current environment, inexpensive computers, electronic distance communication, and specialist freeware, have expanded the opportunities for dissemination of research and knowledge outside of such large centers. On the one hand, this is an exciting development, because it reduces barriers to entry for a wider and more diverse set of students and researchers. On the other, hand, the laboratory software for visualizing and manipulating acoustic signals is either prohibitively expensive for institutions to buy, or else discouragingly inefficient for students at introductory levels. Other software is easy to use but doesn't teach the fundamental scientific principles that underlie the manipulations allowed.<br\/><br\/>In order to meet this opportunity for expanded access, this award supports a conference workshop, \"Software To Empower Learning And Research In Speech (STELARIS),\" for scientists, students and software developers. The theme of the workshop is to identify the best existing platforms and develop standards for future developments that minimize technical barriers to data exchange, while maximizing use as a teaching and research tool.","title":"Software to Empower Learning and Reseach in Speech (STELARIS): A Workshop for Developers and Teachers","awardID":"1106472","effectiveDate":"2011-01-15","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1311","name":"LINGUISTICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[480852],"PO":["563458"]},"174051":{"abstract":"PROJECT ABSTRACT <br\/>?Counting Van Gogh and Vermeer? <br\/><br\/>Automated thread counting algorithms, in development since 2007 by Professors Rick Johnson <br\/>(Cornell University) and Don Johnson (Rice University), are poised for a profound impact on the <br\/>practice of technical art history. This work is a pioneering effort in the emerging application of <br\/>signal and image processing to the analysis of paintings. The approach is based on the utilization <br\/>of spectral analysis of x-rays of paintings. X-rays can display the periodic intensity pattern due <br\/>to the greater thickness of the lead white ground between the canvas threads. With the addition <br\/>of innovative application-speci&#64257;c signal processing, local peaks in the spectrum of the x-ray data <br\/>can reveal the numbers of threads per centimeter, i.e. a thread count, separately for (nearly) ver- <br\/>tically and (nearly) horizontally oriented threads. Such thread counts have been used previously, <br\/>but their manual acquisition proved too costly to be done thoroughly. The introduction of the <br\/>capability to assemble previously unthinkable thread density and angle pattern maps of high de- <br\/>tail across the entire surface of a painting leads to correlation-based identi&#64257;cation of canvases <br\/>sharing the same pattern in thread density variations. Such weave maps and matches can now be <br\/>assembled across all of the paintings on canvas of a single artist or school, thereby signi&#64257;cantly <br\/>extending the art historian?s capabilities in, for example, dating and attribution. <br\/>The scale, breadth, and depth of such thread-counting projects represent a bold leap in the <br\/>capabilities of technical art history. This grant supports the analysis phase of the &#64257;rst projects <br\/>of such grand scope: the thread counting and subsequent weave matching among (i) all of the <br\/>paintings by Vincent van Gogh (for which data can be obtained by the end of 2010) and (ii) <br\/>all of the paintings by the Delft School during the career of Johannes Vermeer (for which data <br\/>can be obtained by the end of 2010). This grant places Professors Rick and Don Johnson in <br\/>the center of the data fusion, data analysis and database creation activities that are scheduled <br\/>to occur in Amsterdam during the spring of 2011. The archives being established of thread <br\/>count reports, including weave density maps providing &#64257;ngerprints for weave matching and angle <br\/>maps for characterizing cusping, form a groundbreaking resource at a time when museums are <br\/>just beginning to address the technological and cultural barriers to technical data sharing among <br\/>museums and collaborating researchers outside the museum. This project is part of a long-term <br\/>effort that aims to expand the utility of thread counting from x-rays to all suitable oil paintings on <br\/>canvas, and to photos of unlined backs of old master paintings and of the raw canvas, for example, <br\/>of the modern color&#64257;eld painters and of densely-woven, multi-pattern fabrics prominent in the <br\/>design and decorative arts.","title":"Counting Van Gogh and Vermeer","awardID":"1048344","effectiveDate":"2011-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["142498"],"PO":["564898"]},"175350":{"abstract":"Data of growing complexity come from multiple sources with multiple aspects. These data present us with unprecedented opportunities to integrate them with predictive models to extract complex relationships among natural and man-made objects.<br\/><br\/>The PI brings together models and techniques encountered in various areas, such as Bayesian statistics, computational science, and systems biology, to develop new methodologies and tools for multi-source and multi-aspect data analysis. The intellectual merit includes (i) new constrained sparse Bayesian models to make interpretable predictions in their application domains, (ii) nonparametric multi-view and multi-way models to reveal unknown complex relationships between different data sources and aspects, and (iii) scalable inference to make advanced Bayesian methods practical data analysis tools.<br\/><br\/>The PI collaborates with domain experts to model online user behavior, facilitate neurologists to elucidate brain functions and help pharmaceutical researchers identify key biomarkers for drug discovery. The PI incorporates the research results into new courses he teaches, organizes workshops, and recruits graduate and undergraduate students to conduct research for this project.<br\/><br\/>For further information see the project web site at the URL: http:\/\/www.cs.purdue.edu\/~alanqi\/projects\/learning-multi-source-aspect-data","title":"CAREER: Scalable Bayesian learning for multi-source and multi-aspect data","awardID":"1054903","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["547294"],"PO":["563727"]},"175394":{"abstract":"The complex analytical queries characterizing decision support applications can be very expensive to compute, and the value of such applications is directly correlated to the speed at which answers can be returned to the user. Typically, once queries have been answered, database systems simply discard the results. However, a huge optimization opportunity is missed by doing this: there is tremendous latent energy in the discarded query results, if we only knew how to recycle them to help answer subsequent related queries. The goal of the project is to develop Scrapple, a principled database management system that aggressively reuses old query results to speed up the answering of new queries, resulting in potentially dramatic performance gains for a large class of decision support applications.<br\/><br\/>Scrapple's basic strategy is to view cached query results (and their intermediate subresults) as materialized views, and then employ advanced techniques for optimizing queries using materialized views to answer subsequent queries. To execute this strategy, the project develops: (1) a novel and comprehensive theory of differential reformulation strategies; (2) a set of unifying principles connecting incremental view maintenance and optimization of queries using materialized views; (3) a novel and comprehensive theory of data provenance for aggregate queries; and (4) practical implementation techniques for recycling cached results via cost-based search strategies. By using fully automated techniques, Scrapple will dramatically reduce the total cost of ownership of a typical data warehouse. Moreover, the techniques at the heart of our approach have wide application in areas such as data integration, data exchange, view maintenance, and data provenance. The research will also be used to develop lecture and project materials for new course modules. These educational materials, along the Scrapple source code and publications, will be made freely available at the project Web site, http:\/\/www.cs.ucdavis.edu\/~green\/scrapple.","title":"CAREER: Scrapple: Fast Analytical Query Evaluation via Advanced Query Recycling Techniques","awardID":"1055107","effectiveDate":"2011-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["486620"],"PO":["563727"]},"176263":{"abstract":"This proposal requests NSF support to broaden participation in the Sixteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS?10), to be held in Newport Beach, California on March 5?11, 2011. ASPLOS is the premiere forum for research involving the interaction of computer architecture, compilers, and operating systems. It brings together leading researchers from these diverse communities to one conference offering opportunities to interact across traditional disciplinary boundaries.<br\/>This proposal aims to increase the impact of this conference by enabling participation by additional students and faculty for whom travel support would otherwise preclude their attendance, priority for these funds will be given to defray the travel expenses of under-represented minorities and faculty from non-Ph.D.<br\/>granting institutions.","title":"WORKSHOP: Support for the Sixteenth International Conference on Architectural Support for Programming Languages and Operating Systems (ASPLOS), 2011","awardID":"1059827","effectiveDate":"2011-01-15","expirationDate":"2011-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["549718","562983"],"PO":["565272"]}}