{"144551":{"abstract":"Loyola University, in collaboration with the University of Illinois at Chicago, the University of Illinois at Champaign-Urbana, proposes a planning project for an effort to broaden participation in computing among students in the densely populated Chicago metropolitan area. Proposed activities will focus on a coordinated effort at high school outreach: extensive metro-wide outreach to high schools growing out of a rich network of connections among college and high school students, faculty, and staff that includes an emphasis on interdisciplinary work as well as exposure to varied career paths, and community-building activities. Proposed activities are designed not only to cultivate a larger, stronger, and more diverse corps of computing professionals but also one that is more outward-looking and more service-oriented. This project is seen as the first step in building a larger Alliance.","title":"Collaborative Research: BPC-A: Improving Metropolitan Participation to Accelerate Computing Throughput and Success","awardID":"0837495","effectiveDate":"2008-12-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["560175","550730","460574",385551],"PO":["561855"]},"144595":{"abstract":"The Georgia Institute of Technology, in collaboration with Morehouse College and the Georgia Computes! BPC Alliance, proposes the creation of the Tester to Techie (TtT) program to engage low-income African American youth in computing. The program will leverage teenage boys? love of video games to encourage their participation in computing education and to introduce them to technical careers. It will offer teens an apprenticeship as game testers, providing them with an authentic experience beta testing games for real game companies. In addition, it will provide them with a contextualized computing curriculum focused on games and game testing. The program will introduce them to the game industry, not to create future game testers, but to exploit their interest in video games, so that they can look inside the black box of the games to see the power and potential of computation.","title":"Collaborative - BPC-DP: Testers to Techies: Culturally Aware and Authentic Computing Education through Game Testing","awardID":"0837650","effectiveDate":"2008-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["527501",385698],"PO":["561855"]},"150063":{"abstract":"This Small Grant for Exploratory Research (SGER) project investigates the emergent processes being developed by public information officers as they make use of disaster-relevant information available through new social media. Peer-to-peer communication, through mobile and online technologies and the activities of citizen journalists and other networked members of the public, have made possible the ability of government officials to tap into public communications in near-real time. Processes to facilitate information access, retrieval, interpretation, verification, and validation are being defined as decision makers and public servants recognize the potential value of new social media in disaster response. To study these emergent processes, we will conduct field observations within a Joint Information Center during the Democratic National Convention, collect relevant documents such as Media Monitoring and Analysis reports, and conduct face to face interviews with key informants who supported DNC media monitoring activities or were actively engaged in policy and agenda setting for new social media during the DNC response. Analysis following from observations, interviews, and secondary document analysis will provide theoretical developments in the areas of public policy, information and communication technology-enabled warnings and risk communication for extreme events, and contribute to knowledge on the nature of emergent practices around the uses of new social media for crises and disaster.<br\/><br\/>Due to the groundswell of technology development, the increase in public participation in new social media, and the resulting questions about effective, and appropriate, ways to access and utilize information flowing peer-to-peer in disaster, this research will have direct benefits to emergency managers and public officials tasked with ensuring safety and security to the public at risk. Investigation into these emergent processes will have direct effects on the development of plans and policy for future disaster events among all levels of government.","title":"SGER: Public Information and Peer-to-Peer Communication as Complementary Processes?: Understanding How Public Information Officers Use Social Media During the Democratic National","awardID":"0902097","effectiveDate":"2008-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1638","name":"INFRAST MGMT & EXTREME EVENTS"}}],"PIcoPI":["497022"],"PO":["564435"]},"151032":{"abstract":"This award funds travel fellowships to assist<br\/>graduate student and postdoc attendees to the<br\/>Sixth Rocky Mountain Regional Bioinformatics Conference<br\/>to be held Dec. 5-7, 2008 at Snowmass, Colorado.<br\/><br\/>The Rocky Mountain Regional Bioinformatics Conference<br\/>encompasses a variety of topics in bioinformatics<br\/>and computational biology including biological<br\/>sequence comparison and analysis, metabolic and<br\/>other biological networks, genetics, phylogeny,<br\/>etc.<br\/><br\/>For further information on the Sixth Rocky Mountain<br\/>Regional Bioinformatics Conference see the URL:<br\/>http:\/\/www.icsb.org\/rocky08\/","title":"Rocky Mountain Regional Bioinformatics Conference Support","awardID":"0905546","effectiveDate":"2008-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["512840"],"PO":["563727"]},"137667":{"abstract":"The research proposes to integrate theories and methods from computer-supported collaborative work and learning (CSCW and CSCL) to promote better human-computer intercultural interactions. The research will consist of three phases: 1) identify and categorize intercultural communication problems and determine how they impact group outcomes; 2) apply machine learning to automatically recognize recognize when communication problems arise (or are likely to arise); and, 3) develop and test interventions for improving intercultural communication that could be triggered based on the automatic analysis. <br\/><br\/>This work has the potential to improve the design of global on-line classroom experiences and business collaborations. At the societal level, the research will help improve intercultural communication and the effectiveness of intercultural teams. This work will also advance the emerging field of automatic collaborative process analysis, which until now has focused only on English-speaking collaborations.","title":"HCC-Medium: Collaborative Research: Dynamic Support for Computer-Mediated Intercultural Communication","awardID":"0803482","effectiveDate":"2008-12-15","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["550147","554179","517608"],"PO":["564456"]},"144631":{"abstract":"San José State University (SJSU) proposes a planning effort leading to a larger initiative, that will be called Expanding Paths to Computing ? Leveraging Students? Personal Interests. Ultimately the alliance will recruit and retain Latino\/a students into computing by tapping into their personal interests, both social and relational. It will develop study paths that link students? personal interests to computing during their high school and college freshman years; progressive involvement will inspire students to pursue college majors in computing. This proposal begins the project with a pilot of the high school outreach, Hispanic Computing Brigades (HCB). The HCB will be tested in two local high schools, inspiring and engaging Hispanic students through IT service learning projects. The high school students will begin the program with the summer camp, continue to learn and engage computing throughout the year with community service learning, and end with a local competition where they will showcase their computing projects with high school faculty, SJSU faculty, parents\/guardians, and the community. Students will learn computer and programming skills and processes in weekly meetings with the help of advisors and mentors. Through assessment, the project expects to determine whether the approach of IT service learning is a strong motivator for Hispanic students.","title":"BPC-A: Expanding Paths to Computing - Leveraging Students? Personal Interests","awardID":"0837821","effectiveDate":"2008-12-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["439804",385830,"517683",385832,385833],"PO":["561855"]},"144611":{"abstract":"The Georgia Institute of Technology, in collaboration with Morehouse College and the Georgia Computes! BPC Alliance, proposes the creation of the Tester to Techie (TtT) program to engage low-income African American youth in computing. The program will leverage teenage boys? love of video games to encourage their participation in computing education and to introduce them to technical careers. It will offer teens an apprenticeship as game testers, providing them with an authentic experience beta testing games for real game companies. In addition, it will provide them with a contextualized computing curriculum focused on games and game testing. The program will introduce them to the game industry, not to create future game testers, but to exploit their interest in video games, so that they can look inside the black box of the games to see the power and potential of computation.","title":"Collaborative - BPC-DP: Testers to Techies: Culturally Aware and Authentic Computing Education through Game Testing","awardID":"0837733","effectiveDate":"2008-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["521278","517101"],"PO":["561855"]},"144622":{"abstract":"Loyola University, in collaboration with the University of Illinois at Chicago, the University of Illinois at Champaign-Urbana, proposes a planning project for an effort to broaden participation in computing among students in the densely populated Chicago metropolitan area. Proposed activities will focus on a coordinated effort at high school outreach: extensive metro-wide outreach to high schools growing out of a rich network of connections among college and high school students, faculty, and staff that includes an emphasis on interdisciplinary work as well as exposure to varied career paths, and community-building activities. Proposed activities are designed not only to cultivate a larger, stronger, and more diverse corps of computing professionals but also one that is more outward-looking and more service-oriented. This project is seen as the first step in building a larger Alliance.","title":"Collaborative Research: BPC-A: Improving Metropolitan Participation to Accelerate Computing Throughput and Success","awardID":"0837769","effectiveDate":"2008-12-01","expirationDate":"2011-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["496796",385797,"464068",385799,"502042"],"PO":["561855"]},"156436":{"abstract":"This research is to design and evaluate an Internet architecture that is resistant to Denial-of-Service (DoS) flooding attacks of any scale. DoS attacks have become an increasing threat to the reliability of the Internet. These attacks are capable of knocking any user, site, and server right off the Internet. This research targets the root cause of the DoS flooding problem: the network's inability to intelligently handle overload. When DoS attacks occur, the network drops legitimate traffic and attack traffic alike, leading to heavy losses of legitimate traffic, which in turn triggers the TCP-friendly backoff of legitimate clients, further reducing the volume of legitimate traffic. One approach to robustly distinguish legitimate and attack traffic is network capabilities. Capabilities are short-term authorizations that senders request from receivers and stamp on their packets. They allow a destination to classify traffic into two broad categories: authorized traffic and unauthorized traffic. With capabilities, the network is able to discard unauthorized traffic in favor of authorized traffic, and protects authorized communications from unauthorized attempts. This research will design and evaluate a DoS-resistant network architecture that builds on the concept of capabilities. It will also compare the costs and benefits of this solution with solutions that build on other primitives, such as black-list filters.","title":"CT-ER: A DoS-resistant Internet Architecture","awardID":"0925585","effectiveDate":"2008-12-04","expirationDate":"2010-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["462629"],"PO":["529429"]},"144589":{"abstract":"Loyola University, in collaboration with the University of Illinois at Chicago, the University of Illinois at Champaign-Urbana, proposes a planning project for an effort to broaden participation in computing among students in the densely populated Chicago metropolitan area. Proposed activities will focus on a coordinated effort at high school outreach: extensive metro-wide outreach to high schools growing out of a rich network of connections among college and high school students, faculty, and staff that includes an emphasis on interdisciplinary work as well as exposure to varied career paths, and community-building activities. Proposed activities are designed not only to cultivate a larger, stronger, and more diverse corps of computing professionals but also one that is more outward-looking and more service-oriented. This project is seen as the first step in building a larger Alliance.","title":"Collaborative Research: BPC-A: Improving Metropolitan Participation to Accelerate Computing Throughput and Success","awardID":"0837636","effectiveDate":"2008-12-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["451105"],"PO":["561855"]},"144601":{"abstract":"Auburn University proposes the African American Researchers in Computing Sciences (AARCS) program to broaden African American participation in tenure track faculty and research scientist positions within the education pipeline. African American undergraduate students across the nation will be exposed to role models, research, and graduate school opportunities that are specifically designed to address disbeliefs, concerns, and misunderstandings about computing sciences faculty and research. This will be accomplished through targeted presentations by African American computing science faculty and graduate students, a Future Faculty\/Research Scientist Mentoring program, and an annual AARCS mini-conference. The AARCS program will serve as an empirically-based and tested model that can be incorporated into larger Alliance projects. In addition, it will serve as a model that can be used to target other underrepresented groups.","title":"Collaborative Research: BPC-DP: African-American Researchers in Computing Sciences (AARCS)","awardID":"0837675","effectiveDate":"2008-12-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["489515","542299","542300","542300"],"PO":["561855"]},"143556":{"abstract":"The large amount of unlicensed and semi-unlicensed bandwidth available for millimeter (mm) wave communication enable multi-Gigabit wireless networking that can potentially transform the telecommunications landscape. <br\/><br\/>Intellectual Merit: This research investigates the use of the unlicensed 60 GHz ``oxygen absorption'' band for providing a quickly deployable broadband infrastructure based on multi-Gigabit outdoor mesh networking. Millimeter wave links are inherently directional: the directionality is required to overcome the increased path loss at higher frequencies, and is feasible for nodes with compact form factors using antenna arrays realized as patterns of metal on circuit board. This project addresses the cross-layer design of mesh networks with such highly directional links, in which implicit coordination using carrier sense mechanisms cannot be relied on, and there is no omni-directional mode for explicit coordination. In addition, the research will investigate new design principles for directional medium access control, with the challenge being to coordinate nodes despite the deafness induced by directionality, while taking advantage of the drastically reduced spatial interference. The project will also study methods for network discovery and topology updates, the interactions between scheduling and routing; and the impact of oxygen absorption on network capacity and protocol design\/performance.<br\/><br\/>Broader Impact: The principal investigators will develop publicly available mm wave network simulation tool, intended to engage a larger research community in this emerging field. The investigators will also explore other mechanisms for broader impact including technology transfer, undergraduate research, and curriculum updates featuring mm wave communication.","title":"XPLR: MultiGigabit millimeter wave mesh networks: Cross-layer design and experimental validation","awardID":"0832154","effectiveDate":"2008-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":["489899","549356","560332"],"PO":["565303"]},"144613":{"abstract":"The University of Massachusetts proposes an expansion of the Commonwealth Alliance for Information Technology Education (CAITE). CAITE ? an alliance of three campuses of the University of Massachusetts and six community colleges, that aims to increase participation and retention along the high-school-to-community-college-to-four-year-to-graduate-school pipeline. Much of the focus is on community colleges because of the central role they play in reaching out to underserved populations and in serving as a gateway to careers and further higher education. CAITE aims to make academic IT pathways attractive and nurturing, and to ensure that students -- particularly women and underrepresented minorities -- are adequately prepared to enter them. This extension brings in a fourth region and new regional partners. In addition, it strengthens and re-focuses the work of the existing CAITE Alliance, forging stronger direct ties to other BPC projects, modifying outreach and pathway strategies based on lessons learned from the original grant, and developing new interventions designed to increase participation and retention. The extension of CAITE will be data-driven, informed by best practices developed locally and nationally, and focused on replication and dissemination.","title":"BPC-AE: Commonwealth Alliance for Information Technology Education Extension","awardID":"0837739","effectiveDate":"2008-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["558309","536735","533875",385767,"424075"],"PO":["560704"]},"144547":{"abstract":"Loyola University, in collaboration with the University of Illinois at Chicago, the University of Illinois at Champaign-Urbana, proposes a planning project for an effort to broaden participation in computing among students in the densely populated Chicago metropolitan area. Proposed activities will focus on a coordinated effort at high school outreach: extensive metro-wide outreach to high schools growing out of a rich network of connections among college and high school students, faculty, and staff that includes an emphasis on interdisciplinary work as well as exposure to varied career paths, and community-building activities. Proposed activities are designed not only to cultivate a larger, stronger, and more diverse corps of computing professionals but also one that is more outward-looking and more service-oriented. This project is seen as the first step in building a larger Alliance.","title":"Collaborative Research: BPC-A: Improving Metropolitan Participation to Accelerate Computing Throughput and Success","awardID":"0837480","effectiveDate":"2008-12-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["528421","496827","533275","539435"],"PO":["561855"]},"144569":{"abstract":"The University of Texas - El Paso (UTEP) proposes an Extension to the Computing Alliance of Hispanic-Serving Institutions (CAHSI). CAHSI is an alliance of some of the leading producers of Hispanic science and engineering graduates: California State University-Dominguez Hills, Florida International University, New Mexico State University, Texas A&M-Corpus Christi, University of Huston-Downtown, University of Puerto Rico-Mayaguez, and UTEP. Its goal is to create a unified voice in order to increase the number of Hispanic students who pursue and complete baccalaureate and advanced degrees in computing. It uses a three-fold strategy that promotes interventions addressing recruitment, retention, and advancement, as well as social science research, and dialogue that leads to collaborations and consolidated efforts. In the initial phase of its funding, CAHSI built an effective organization with well-defined communication strategies. CHSI has transferred effective-practice interventions to adopting institutions, and established collaborations with key professional organizations. This Extension builds upon CAHSI?s field-tested interventions -- including curriculum development, introduction of undergraduates into research early in their career, and student activities that build leadership skills -- with a focus on mentoring across the academic pipeline from the undergraduate level to the professoriate, developing a resource infrastructure, and continuing establishment of partnerships with industry, professional organizations, and other entities.","title":"BPC-AE: CAHSI: Computing Alliance of Hispanic-Serving Institutions","awardID":"0837556","effectiveDate":"2008-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["444649","479700","559621",385617,"528389"],"PO":["560704"]},"137618":{"abstract":"The research proposes to integrate theories and methods from computer-supported collaborative work and learning (CSCW and CSCL) to promote better human-computer intercultural interactions. The research will consist of three phases: 1) identify and categorize intercultural communication problems and determine how they impact group outcomes; 2) apply machine learning to automatically recognize recognize when communication problems arise (or are likely to arise); and, 3) develop and test interventions for improving intercultural communication that could be triggered based on the automatic analysis. <br\/><br\/>This work has the potential to improve the design of global on-line classroom experiences and business collaborations. At the societal level, the research will help improve intercultural communication and the effectiveness of intercultural teams. This work will also advance the emerging field of automatic collaborative process analysis, which until now has focused only on English-speaking collaborations.","title":"HCC Medium: Collaborative Proposal: Dynamic Support for Computer-Mediated Intercultural Communication","awardID":"0803225","effectiveDate":"2008-12-15","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[365803],"PO":["564456"]},"151863":{"abstract":"This international travel award will allow six researchers from the US network science and engineering community to travel to Madrid, Spain in early December 2008 to participate with their European Union counterparts in the 1st FIRE-GENI Workshop, which is hosted by the European Commission. The goal of the meeting is to discuss possible interconnection of the control planes of the various suites of infrastructure (e.g., GENI, DANTE, GEANT, FEDERICA, etc.) It is now clear that there could be substantial benefit to both the US and the European Union to work out interconnections issues now. NSF and the EC have each agreed to host a number of meetings in order to achieve this interconnection. Bringing together researchers from multiple technical communities in the US and Europe will contribute to identifying opportunities for international collaboration and coordination. This meeting (and any subsequent ones on this topic) will improve the capabilities of future network research infrastructure through increased commonality, sharing and community building.","title":"EU-NSF Travel Grant","awardID":"0908343","effectiveDate":"2008-12-01","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["458851"],"PO":["495796"]},"144626":{"abstract":"Auburn University proposes the African American Researchers in Computing Sciences (AARCS) program to broaden African American participation in tenure track faculty and research scientist positions within the education pipeline. African American undergraduate students across the nation will be exposed to role models, research, and graduate school opportunities that are specifically designed to address disbeliefs, concerns, and misunderstandings about computing sciences faculty and research. This will be accomplished through targeted presentations by African American computing science faculty and graduate students, a Future Faculty\/Research Scientist Mentoring program, and an annual AARCS mini-conference. The AARCS program will serve as an empirically-based and tested model that can be incorporated into larger Alliance projects. In addition, it will serve as a model that can be used to target other underrepresented groups.","title":"Collaborative Research: BPC-DP: African-American Researchers in Computing Sciences (AARCS)","awardID":"0837781","effectiveDate":"2008-12-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7625","name":"REESE"}}],"PIcoPI":["530190"],"PO":["561855"]},"156418":{"abstract":"Proposal Number: 0627166<br\/>PI: Xiaowei Yang<br\/>Institution: University of California, Irvine<br\/>Title: NeTS-FIND: An Internet Architecture for User-Controlled Routes<br\/><br\/><br\/>Abstract<br\/><br\/>This project is developing an Internet architecture that enables users or their end-systems to select the paths their packets take through the network. Such user-controlled routes are desirable for both economic and technical reasons. Economically, user-controlled routes are a key factor in maintaining the competitiveness of the ISP marketplace, just as long distance carrier selection has had a lasting impact on telephony. Technically, user-controlled routes provide a fundamental means for improving the performance and reliability of network communications. This is because they allow end systems to use multiple diverse paths concurrently and reduce the dependence on a single network path that has undesirable characteristics. The key technical difficulties associated with user controlled routes lie in the areas of scalability and robustness. This project directly addresses these issues. It involves the development of the following components: 1) a scalable inter-domain routing protocol that distributes policy-constrained domain-level maps of the network to users and allows them to explicitly formulate domain-level routes; 2) an end system protocol stack that allows various applications to take advantage of path diversity; 3) algorithms and protocols that prevent users from rapidly switching paths in a fashion that jeopardizes the overall routing stability; 4) techniques that mitigate the security threats associated with user-controlled routes (e.g. source address spoofing, multi-path denial of service attacks). <br\/><br\/>If successful, this work will have a positive economic impact that fosters ISP competition, result in measurable technical improvements in terms of reliability and performance of network communications, and contribute to education. Algorithms, protocols, and software developed in this project will be disseminated through research publications and a project web-site.","title":"NeTS-FIND: An Internet Architecture for User-Controlled Routes","awardID":"0925472","effectiveDate":"2008-12-04","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7631","name":"ITR-NeTS"}}],"PIcoPI":["462629"],"PO":["565090"]},"144607":{"abstract":"Texas A&M University, in collaboration with Rensselaer Polytechnic Institute and Auburn University, proposes to use culturally responsive approaches to attract and retain high school students to computer science. They will expand two frameworks that have been developed for math education into computing education. The AADMLSS City Stroll (African American Distributed Multiple Learning Styles System) and CSDT (Culturally Situated Design Tools) are interactive environments that use culturally relevant cues to teach math. AADMLSS City Stroll system is a game-like environment that includes instruction, practice, and assessment. CSDTs are web-based applets, based on ethnomathematics, that is, the mathematical knowledge embedded in cultural designs such as cornrow hairstyles, Native American beadwork, Latino percussion rhythms, etc. The essential idea of CSDTs is one of translating knowledge from informal to formal systems. The goals of the proposed project are: (1) to assist the efforts to extend the work on these math educational tools to include computing; (2) to develop a institutional \"pipeline\" such that K-12 students successfully participating in these activities can maximize their odds of entering undergraduate programs in computing; and (3) extend the current work with CSDTs and AADMLSS, from the local or regional scale to the national scale, by incorporating it into the Boys and Girls Clubs of America (BGCA).","title":"Collaborative Proposal: BPC-DP: Incorporating Cultural Tools for Math and Computing Concepts into the Boys and Girls Clubs of America","awardID":"0837717","effectiveDate":"2008-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["541641"],"PO":["561855"]},"151758":{"abstract":"It is recognized that numerical multilinear algebra is playing an increasingly important role across the sciences and engineering. <br\/>High-dimensional modeling has become ubiquitous because of advances in storage technology. Computatationally-oriented researchers no longer have to be shy about the involvement of unimaginably large, tensor-structured data sets. <br\/>For the nation to maintain its leadership in scientific computing, the NSF needs to review the progession from matrix-based computational thinking to tensor-based computational thinking and design a coordinated program that will effectively support research in this area. <br\/>We propose to hold a small, invitation-only, two-day workshop comprised of established researchers that will identify the important open problems and opportunities for discovery in computational multilinear algebra. Getting the right mix of talent is crucial and we plan to assemble representatives from key application areas together with experts in large-scale matrix computations, numerical multilinear algebra, high-performance computing, classical numerical linear algebra, and crucial areas within the field of programming languages. Based on the discussions at the workshop, a document of recommendations will be delivered to the NSF one month after the Workshop.","title":"The Future Directions in Tensor-Based Computation and Modeling","awardID":"0908059","effectiveDate":"2008-12-15","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["450672"],"PO":["550329"]},"149391":{"abstract":"Proposal Number: 0856317<br\/>PI: Terry Benzel<br\/>Institution: University of Southern California, Information Sciences Institute<br\/>Lead<br\/><br\/><br\/><br\/>Title: NCDI Industry Workshop<br\/><br\/><br\/>Our Nation?s computers and networks control many critical infrastructures. Because these infrastructures depend on systems that were not defined to be secure, determined adversaries can easily attack with impunity these infrastructures through vulnerabilities in the underlying networks and computers. For years, the approach to achieving security has been to patch systems to remove vulnerabilities as they are discovered, often by adversaries, or to detect attacks as they are launched or, hopefully, shortly thereafter. This approach will not work against determined adversaries.<br\/><br\/>NSF and other research funding agencies has been pursing new research ideas towards security and privacy, but usually such research does not lead to products and services that are fit into industry?s business models. <br\/><br\/>This workshop will attempt to accelerate the collaboration of the security research community and industry towards sound ideas for the attainment of security and privacy but which industry sees as the basis for future products and services. <br\/><br\/>The workshop will produce a detailed report to be posted on the NSF web site","title":"NCDI Industry Workshop","awardID":"0856317","effectiveDate":"2008-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["561510"],"PO":["529429"]},"149585":{"abstract":"This is funding to support a workshop of approximately 30 graduate students and recent graduates from master's and doctoral programs in diverse communities (including computer science, engineering, psychology, cognitive science, and communications), along with distinguished research faculty. The event will take place on Tuesday, March 10, 2009, immediately preceding the Fourth Annual Human Robot Interaction Conference (HRI 2009) to be held March 11-13, 2009, in San Diego, which is sponsored by ACM and cosponsored by IEEE. The theme of HRI 2009 is ?Interacting Naturally with Robots,? which highlights the critical need to develop human-like communications capabilities as robots become more common in everyday settings (including the home, office, museums, and shopping environments), and begin to collaborate with humans to accomplish complex tasks. This workshop is designed to complement the conference, by providing a forum for students and recent graduates in the field of HRI to present their current research before peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference, and by providing all participants with opportunities to talk about the important trends and issues in the field with a view to encouraging the formation of collaborative relationships across disciplines and geographic boundaries. To these ends, the workshop will include sessions in a variety of formats. Participants will hear 15-minute presentations on their current research from 9 of the students, with time allotted for questions and discussion after each talk. A morning breakout session will divide the participants into 2-4 groups to discuss a focused question on common research themes posed by the organizers, while an afternoon breakout session will involve a small group project in which participants must work together to address some facet of HRI in a given domain\/application. Following a keynote address from a distinguished researcher in the field, a group presentation session will provide each breakout group with the opportunity to present a summary to the entire workshop. <br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (including but nor limited to computer science and engineering, psychology, robotics, human factors and ergonomics, and human-computer interaction). This is important for the field, because it has been recognized that transformative advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming year. Workshop organizers will act aggressively to recruit young researchers from minority and underrepresented groups in order to assure diversity of the participants across a variety of dimensions, so that the students' horizons are broadened to the future benefit of the field.","title":"Workshop for Student Introduction to Human Robot Interaction","awardID":"0900362","effectiveDate":"2008-12-15","expirationDate":"2009-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["565099"],"PO":["565227"]},"139685":{"abstract":"The discovery that synaptic plasticity is mediated by processes sensitive to the precise relative timing of pre- and post-synaptic events overturned models of synaptic change based on average activity levels (so-called rate-dependent models). This experimental discovery contradicted the conceptual framework that has dominated since the work of Donald Hebb (1949), and requires different theoretical and computational tools.<br\/><br\/>Individual synaptic events have inherent random variability, so computational synaptic dynamics in the new paradigm must be based in the theory of stochastic processes. Previous work modeling the stochastic dynamics of neural systems uses approximation tools -- the nonlinear Fokker-Planck equation (FPE) -- known to be deeply flawed and potentially misleading. The situation recalls the use of the FPE by machine learning theorists in the early to mid 1990s; indeed the dynamics of spike-timing-dependent plasticity in neural systems and those of stochastic approximation algorithms in the machine learning literature are very similar.<br\/><br\/>This project establishes rigorous tools for treating the stochastic dynamics of learning systems based on spike-timing-dependent synaptic plasticity. It develops well-grounded approximation techniques (and exact solutions where available) and applies them to synaptic dynamics in natural and artificial learning systems. The new methods are compared to those employed in the recent literature to provide insight into the accuracy and appropriateness of the various methods. The project is relevant to both computational neuroscience and machine learning, and will also provide interdisciplinary research training for graduate and undergraduate students.","title":"RI-Small: Stochastic Learning: Modeling in Machines and Brains","awardID":"0812687","effectiveDate":"2008-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["562760","516823"],"PO":["564316"]},"144571":{"abstract":"Texas A&M University, in collaboration with Rensselaer Polytechnic Institute and Auburn University, proposes to use culturally responsive approaches to attract and retain high school students to computer science. They will expand two frameworks that have been developed for math education into computing education. The AADMLSS City Stroll (African American Distributed Multiple Learning Styles System) and CSDT (Culturally Situated Design Tools) are interactive environments that use culturally relevant cues to teach math. AADMLSS City Stroll system is a game-like environment that includes instruction, practice, and assessment. CSDTs are web-based applets, based on ethnomathematics, that is, the mathematical knowledge embedded in cultural designs such as cornrow hairstyles, Native American beadwork, Latino percussion rhythms, etc. The essential idea of CSDTs is one of translating knowledge from informal to formal systems. The goals of the proposed project are: (1) to assist the efforts to extend the work on these math educational tools to include computing; (2) to develop a institutional \"pipeline\" such that K-12 students successfully participating in these activities can maximize their odds of entering undergraduate programs in computing; and (3) extend the current work with CSDTs and AADMLSS, from the local or regional scale to the national scale, by incorporating it into the Boys and Girls Clubs of America (BGCA).","title":"Collaborative Proposal: BPC-DP: Incorporating Cultural Tools for Math and Computing Concepts into the Boys and Girls Clubs of America","awardID":"0837564","effectiveDate":"2008-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[385622,"503742"],"PO":["561855"]},"154273":{"abstract":"Puppet choreography is a highly-developed language for controlling mechanically complex marionettes. It has evolved over centuries into a largely standardized form that allows puppeteers to address issues that arise as a result of the complex systems with which they are working. The project looks at how puppeteers address complex tasks in their choreographic descriptions of plays and using that understanding to solve questions of importance to computer science and engineering. These goals will be achieved by creating an automated puppet play, which will use insights about puppet choreography to implement embedded control of mechanically complex marionettes engaged in complex coordination tasks.<br\/><br\/>This work will impact a broad spectrum of activities, including integrating the choreographic structure of programming into two innovative classes, introducing puppeteers to technical computer science and engineering problems, and the introduction of puppetry as programming to children involved in a local YMCA. Students in these classes will also be statistically assessed for their ability to transfer the choreographic techniques to novel problems as well as the puppeteers? ability to apply their expertise to high-level engineering problems in order to gain insight into educational aspects of the creative process.","title":"Collaborative Research: Major: Puppet Choreography and Automated Marionettes","awardID":"0917837","effectiveDate":"2008-12-01","expirationDate":"2013-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["555644"],"PO":["565136"]},"144550":{"abstract":"The Rochester Institute of Technology proposes to increase the participation of students with visual impairments in computing by providing better preparation and support for them, as well as increased professional development opportunities for their teachers. There are four objectives: (1) increase the number of students with visually impairments who enter computing programs at the post-secondary level, (2) increase instructional opportunities for students are visually impaired in grades seven through twelve, (3) increase the preparation of computing teachers at the secondary level, and (4) provide ongoing support for computing educators and students while the students are in secondary school or making the transition to post-secondary education. Summer workshops and year-round follow-up activities will be developed to provide middle and high school-aged students with the opportunity to explore computing in a multi-modal, hands-on environment with their parents. An annual workshop will be held to train special education and computing educators from secondary schools. The Project ACE website will be expanded to include a multimedia career zone to learn about being a student and practitioner pursuing computing. In addition, a 2-day conference for industry, STEM professionals who are visually impaired, students and their families will be held in collaboration with the National Federation of the Blind to explore the issues, opportunities and successes regarding participation in computing by the visually impaired community.","title":"BPC-DP Project ACE: Accessible Computing Education for Visually Impaired Students","awardID":"0837493","effectiveDate":"2008-12-01","expirationDate":"2012-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["527961","530220"],"PO":["561855"]},"157420":{"abstract":"The design and use of information systems to support the collaborative activity of collocated teams in dynamic, high-risk scenarios remains a challenge. This project will develop novel methods to more efficiently capture and communicate this activity in environments that currently rely on human observation, verbal communication, and collective memory. More efficient teamwork capture processes will enable both larger-scale collection (which supports retrospective analysis that is critical for improved training and technology design) and contemporaneous collection (which provides real-time feedback to workers to assist in error detection). <br\/><br\/>To achieve these goals, domain-specific knowledge and probabilistic reasoning will be used to identify patterns of work and communication. The representative domain of trauma resuscitation is ideal for this work since the roles and tasks of players are well-defined and the flow of work follows a general schema regardless of the patient?s injuries. Because of the complexity of this environment, manual tracking of all activities using video recordings requires repeated review and is very time-consuming even for experienced observers. A computer system will be developed that uses video analysis to determine the location of each player, motion analysis to track their movements, and speech recognition targeted at a limited lexicon to identify their communication. Using these inputs, a probabilistic reasoning model will be constructed that correlates data from the environment with a domain-specific model of teamwork. The tagged recording of the resuscitation event will be available in real time during the event as well as post-event for analysis. <br\/><br\/>The scientific importance of this work is in the need to tag these video observations. Many forms of videos are of repetitive behaviors, whether in surveillance applications, work situations, or other uses. In all such cases, applying a grammar to the video, and matching actions and sounds to that grammar, has the possibility of greatly simplifying work analysis, which is the critical phase in the development computer support for complex, high-risk human activities. <br\/><br\/>The proposed approach will develop novel algorithms and methods for: (i) person and resource tracking in crowded collaborative environments; (ii) recognition of human activity based on fusion of unreliable data from multimodal sensors and a model of the process being recorded; and (iii) reasoning about human activities at different time scales based on heterogeneous technologies (Hidden Markov Models, Bayesian Nets, and Petri Nets) that mutually interact for activity and event detection. Moreover, the methods will be developed and evaluated in a clinical environment that currently uses limited information technology. <br\/><br\/>Broader Impacts. This work will also provide the foundation for implementing decision aids in environments such as trauma resuscitation and related medical domains that lack effective methods for instrumented tracking of teamwork. Trauma care is a significant health care crisis and any improvements in resuscitation processes will save lives.","title":"HCC-Medium: Collaborative Research: Multimodal Capture of Teamwork in Collocated Collaboration","awardID":"0929705","effectiveDate":"2008-12-15","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[419981],"PO":["565342"]},"168178":{"abstract":"Recent years have seen the rise of new forms of large-scale distributed scientific enterprises supported primarily through advanced technological infrastructures such as supercomputers and high speed networks. This \"cyberinfrastructure\" is attracting significant investment from major funding agencies and substantial participation from domain scientists. Although its primary aims are to transform and accelerate scientific and engineering practice, relatively little research has focused on systematically studying the actual practices of cyberinfrastructure development and use or on examining the transformations that it is created to engender.<br\/><br\/>This project will make empirical and conceptual contributions to ongoing research in areas such as computer supported cooperative work, science and technology studies, and the study of cyberinfrastructure. Empirically, it will detail collaboration in cyberinfrastructure development, especially in relation to local concerns. Conceptually this project builds on the author?s previous research on collaboration in cyberinfrastructure in order to create a framework for understanding: 1) the incremental alignment and realignment of people, processes, and tools; 2) and how these alignments play out in: collaboration between distributed institutions; collaboration between disciplines; collaboration between the project itself and the scientific community; and collaboration within and between work groups.<br\/><br\/>Given that cyberinfrastructure is comprised not only of advanced computational technologies, but also of scientists and engineers, who are both developers and end users, this study will: <br\/>- Investigate existing scientific and engineering practices;<br\/>- Investigate how scientific and engineering practices are collaboratively transformed;<br\/>- Identify patterns of collaboration (e.g., social networks, communication and management strategies) and relate those patterns to organizational and scientific outcomes.<br\/><br\/>Ethnographic methods will be used including participant-observation and semi-structured interviews. Qualitative social science methods are useful for understanding practice and how work processes change and develop over time. A nascent metagenomic cyberinfrastructure project will serve as the field site.<br\/><br\/>Broader Impacts:<br\/>By contributing to a more sophisticated understanding of how cyberinfrastructure development is dependent on both technical and social transformation, this research will stimulate and support the future development of such efforts. To further enhance cyberinfrastructure, collaborations amongst institutions conducting work on social aspects of cyberinfrastructure will be established to more efficiently define common concerns. To make innovations more broadly useful, research will be presented at multi- and interdisciplinary conferences and published in formats that will be useful to policy-makers.","title":"HCC: Collaboration in the Development of Cyberinfrastructure","awardID":"1015653","effectiveDate":"2008-12-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["335186"],"PO":["564456"]}}