{"208868":{"abstract":"Computational systems biology is a groundbreaking research area that seeks to use tools from engineering systems theory to understand the holistic functioning of a complex biological system. Translation of such knowledge into medicine is revolutionizing and will continue to revolutionize disease diagnosis and prognosis, medical therapy, disease prevention, drug discovery, and drug design. The objective of this project is to seek student travel support from NSF for the IEEE Workshop on Genomic Signal Processing and Statistics, or GENSIPS, a workshop sponsored annually by the IEEE Signal Processing Society.<br\/><br\/>Intellectual merit<br\/>Our goals for GENSIPS13 are: 1) to address the systems biology issues in the emerging \"omics\" fields of genomics, transcriptomics, proteomics and metabolomics, especially the next-generation sequencing technologies (which facilitate parallel and much faster sequencing of DNA or RNA); and 2) to significantly increase the participation from the Signal Processing society, and the computer science, biostatistics, and biological science communities. The theme of GENSIPS13 will be next generation sequencing and systems biology applied to cancer. We will be inviting expert plenary speakers from the cancer research and genome research fields. To broaden the reach of the scientific work presented in the meeting, accepted papers will be published in the IEEE Conference Proceedings and selected ones in special issues in high profile journals. <br\/><br\/>Broader Impact <br\/>Another important mission of GENSIPS13 is to promote the participation of graduate students and post-doctoral researchers, especially women and minority students, and foster student education on systems biology. GENSIPS13 will provide travel awards to qualified graduate students, whose papers are deemed to be of high quality. Specifically, 20-30% of the awards will be allocated to encourage women and minority students to participate and submit papers to GENSIPS13.","title":"Student Travel Award Support for GENSIPS'13","awardID":"1342663","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[559861,559862,559863,559864,"334663"],"PO":["565223"]},"199254":{"abstract":"Excessive energy consumption on a mobile phone irritates the user with short, unpredictable battery life. Excess consumption in a datacenter hurts a business's bottom line and has the potential to cause large-scale failures. This research project develops energy tracking and monitoring techniques to enable many parties -- such as the software developer, system engineer, and end user -- to audit and control software energy consumption.<br\/><br\/>This research aims to address four issues. The first investigates the low-level software representations needed to understand, debug, and control a parallel application's performance and energy consumption on heterogeneous architectures (i.e., on a multicore with accelerators). The second develops a hardware\/software energy exception framework, whereby meeting expressed energy targets is treated as a requirement for correct computation. The division of labor in this framework tasks hardware with monitoring and reporting energy consumption at fine temporal and spatial granularities, while software is responsible for expressing energy targets and handling cases in which the targets are not met. The third explores the system-wide impacts of this energy monitoring framework using Javascript as a testbed. The focus of this thrust is understanding and balancing the overheads and benefits of energy tracking in real systems. Finally, the fourth examines programmer feedback and incentives required to develop and optimize \"responsible\" software that runs faster and at lower energy cost. This project will develop the abstractions and tools necessary to bring visibility and control to software energy consumption, important capabilities as energy becomes one of the most critical resources in a computing system.","title":"CAREER: Abstractions for Energy Management: Vision, Architecture and Tools","awardID":"1253772","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":[534424],"PO":["366560"]},"210672":{"abstract":"Recent breakthroughs in the mechatronics of powered lower limb (LL) prostheses hold the promise of enabling restoration for the large and growing population of lower limb amputees of a broad spectrum of functionality (e.g., standing up when seated in a chair, climbing stairs, and even running). The PIs argue that to realize this potential it is essential to provide neural control of artificial legs. The application of existing upper limb (UL) neural control approaches is inappropriate to this end, because the UL and LL neural control mechanisms are significantly different. In particular, most activities involving the lower limbs recruit both involuntary (spinal cord) and voluntary (supra-spinal) neural control, present high dynamics, and require multi-joint coordination and control of unstable locomotion, characteristics which combine to make the design specifications for neural control of LL prostheses much more demanding than those for UL devices. In this project the PIs will address this challenge by developing an innovative neural control system for powered artificial legs that can recognize and exploit multi-scale user intent (e.g., general motor commands such as intended task vs. detailed motor commands such as intended joint motion) to modulate intrinsic (autonomous) control of multiple LL prosthetic joints for locomotor and nonlocomotor task performance. The goals are to support reverse-engineering of the neural control of human locomotion while creating innovative neural-machine interfacing (NMI) technology that enables users to control the dynamics of LL prostheses in a natural, adaptive and flexible way. Inspired by what is currently known about the neurological organization and function of the human motor control system, the PIs' approach is to design a novel NMI based on a combination of noninvasive scalp electroencephalography (EEG) and surface electromyography (EMG). The hypothesis is that fusion of low-level peripheral and high-level central neural control sources can achieve multi-scale user intent recognition with higher accuracy and more rapid response time than can be realized with either EEG or EMG alone. A hierarchical control scheme for powered LL prostheses, in which multi-scale user intent identified by the NMI modulates intrinsic (autonomous) control, will support intuitive and efficient prosthesis use in dynamic, multi-joint coordinated movements while significantly reducing the mental burden of the prosthesis user in locomotion because the cyclic motion is achieved autonomously (this is desired because we rarely think about knee and ankle control when walking). The PIs will also explore correlation across EEG and EMG signals, which may provide insight into neural adaption and the time course of cortical control during the initiation and generation of gait, including how the brain initiates walking and regulates motor output in anticipation of key events such as foot placement at landing or during stepping up and down, weight acceptance, and push-off into swing phase. Finally, the PIs will use translational research to validate their novel approach in patients with trans-femoral amputations (a high and challenging amputation level).<br\/><br\/>Broader Impacts: The PIs' long-term objective is to develop true bionic prostheses that feel and work just like real legs. Their approach in this project represents a paradigm shift in the control of lower limb wearable prosthetics. As such, project outcomes will directly impact both the Human-Robot Interaction and Brain-Machine Interface research communities. The findings will also be relevant to the neuroscience and rehabilitation communities, in that they will help elucidate the adaptive spinal cord and cortical contributions to human locomotion, while providing innovative and functional neuro-prosthetics solutions to improve the lives of lower limb amputees.","title":"HCC: Medium: Collaborative Research: Neural Control of Powered Artificial Legs","awardID":"1361549","effectiveDate":"2013-06-30","expirationDate":"2017-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["534671"],"PO":["565227"]},"202224":{"abstract":"Recent breakthroughs in the mechatronics of powered lower limb (LL) prostheses hold the promise of enabling restoration for the large and growing population of lower limb amputees of a broad spectrum of functionality (e.g., standing up when seated in a chair, climbing stairs, and even running). The PIs argue that to realize this potential it is essential to provide neural control of artificial legs. The application of existing upper limb (UL) neural control approaches is inappropriate to this end, because the UL and LL neural control mechanisms are significantly different. In particular, most activities involving the lower limbs recruit both involuntary (spinal cord) and voluntary (supra-spinal) neural control, present high dynamics, and require multi-joint coordination and control of unstable locomotion, characteristics which combine to make the design specifications for neural control of LL prostheses much more demanding than those for UL devices. In this project the PIs will address this challenge by developing an innovative neural control system for powered artificial legs that can recognize and exploit multi-scale user intent (e.g., general motor commands such as intended task vs. detailed motor commands such as intended joint motion) to modulate intrinsic (autonomous) control of multiple LL prosthetic joints for locomotor and nonlocomotor task performance. The goals are to support reverse-engineering of the neural control of human locomotion while creating innovative neural-machine interfacing (NMI) technology that enables users to control the dynamics of LL prostheses in a natural, adaptive and flexible way. Inspired by what is currently known about the neurological organization and function of the human motor control system, the PIs' approach is to design a novel NMI based on a combination of noninvasive scalp electroencephalography (EEG) and surface electromyography (EMG). The hypothesis is that fusion of low-level peripheral and high-level central neural control sources can achieve multi-scale user intent recognition with higher accuracy and more rapid response time than can be realized with either EEG or EMG alone. A hierarchical control scheme for powered LL prostheses, in which multi-scale user intent identified by the NMI modulates intrinsic (autonomous) control, will support intuitive and efficient prosthesis use in dynamic, multi-joint coordinated movements while significantly reducing the mental burden of the prosthesis user in locomotion because the cyclic motion is achieved autonomously (this is desired because we rarely think about knee and ankle control when walking). The PIs will also explore correlation across EEG and EMG signals, which may provide insight into neural adaption and the time course of cortical control during the initiation and generation of gait, including how the brain initiates walking and regulates motor output in anticipation of key events such as foot placement at landing or during stepping up and down, weight acceptance, and push-off into swing phase. Finally, the PIs will use translational research to validate their novel approach in patients with trans-femoral amputations (a high and challenging amputation level).<br\/><br\/>Broader Impacts: The PIs' long-term objective is to develop true bionic prostheses that feel and work just like real legs. Their approach in this project represents a paradigm shift in the control of lower limb wearable prosthetics. As such, project outcomes will directly impact both the Human-Robot Interaction and Brain-Machine Interface research communities. The findings will also be relevant to the neuroscience and rehabilitation communities, in that they will help elucidate the adaptive spinal cord and cortical contributions to human locomotion, while providing innovative and functional neuro-prosthetics solutions to improve the lives of lower limb amputees.","title":"HCC: Medium: Collaborative Research: Neural Control of Powered Artificial Legs","awardID":"1302339","effectiveDate":"2013-06-15","expirationDate":"2017-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["547729"],"PO":["565227"]},"208704":{"abstract":"This is funding to support a workshop of approximately 12 promising doctoral students along with 5 distinguished research faculty. The event, the 6th doctoral consortium on Sociotechnical Issues in Medical Informatics, will take place in conjunction with the 2013 Annual Symposium of the American Medical Informatics Association (AMIA) in Washington DC on November 16-20. Held every fall, this is the premier AMIA conference and the largest biomedical informatics conference in the United State, attracting researchers, professionals and students from an array of occupational settings who are interested in all aspects of health information technologies. More information about the conference may be found at https:\/\/www.amia.org\/amia2013. <br\/><br\/>One issue that is of particular importance within medical informatics is the need to design\/deploy systems with an understanding of how these systems fit into organizational and social contexts. The term sociotechnical denotes the importance of considering technical and organizational\/social issues together rather than in isolation. For instance, the medical informatics community has long been interested in the technical features of the Electronic Medical Record (EMR), but less attention has been paid to how the design of the EMR will be affected by who the primary users of the system are, what context it is used in, and what interactions it should support. Yet, to design effective EMR systems, we need to understand how these different issues impact each other. The growing need for integrating research across disciplines (e.g., HCI and Medical Informatics) is the primary motivation for this doctoral consortium. Therefore, student participants will span a broad range of disciplines and approaches that inform medical informatics, including computer science, information science, engineering, clinical sciences, law, management and related fields. The doctoral consortium will take place on the weekend prior to the AMIA Symposium so the students can also participate in the conference, which will introduce them to the exciting breadth of research topics within the medical informatics community. Conversely, bringing a new generation of scholars from different disciplines into the medical informatics community will broaden that community's understanding of what other research disciplines can offer medical informatics.<br\/><br\/>The consortium will provide a forum for doctoral students to share their work and also network with other doctoral students and researchers. Student participants will give short presentations during the consortium and will receive constructive remarks and feedback on their research from prominent researchers as well as through interaction with other students. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape both these ongoing and future inter- and multi-disciplinary research projects focusing on organizational and social issues surrounding health-related technologies. The names and abstracts of the accepted participants will be printed in the AMIA program guide, and will also be made available to the public on a special website to be developed by the organizers.<br\/><br\/>Broader Impacts: The doctoral consortium will bring together people from different disciplines who might not otherwise engage with one another and will expose them to different scientific research approaches and questions. It will foster a sense of community among the young researchers by allowing them to create a supportive mentoring and social network both among themselves and with senior researchers at a critical stage in their professional development. The organizers will make a concerted and proactive effort to ensure a diverse pool of student participants including members of under-represented groups in the STEM disciplines; this, in turn, will broaden the students' horizons to the future benefit of the field.","title":"Workshop: AMIA Doctoral Consortium 2013","awardID":"1341409","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[559463],"PO":["565227"]},"208726":{"abstract":"The International Symposium on Information Theory (ISIT) is the premier annual information theory conference worldwide, and thus a valuable forum for graduate students in this discipline to present their work, receive feedback from other researchers working on similar or related topics, and to make professional acquaintances within the discipline. This award provides international travel funds to be awarded to students who have a paper accepted at this year's ISIT and who otherwise would not have sufficient travel funds to attend the symposium. As information theory is a core component of the Communications and Information Foundations cluster, the efforts to ensure participation of graduate students in this symposium are consistent with NSF's goal of promoting education and research of the next generation of scientists.","title":"CIF: Student Travel Support for the 2013 IEEE International Symposium on Information Theory","awardID":"1341809","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7935","name":"COMM & INFORMATION THEORY"}}],"PIcoPI":[559524],"PO":["564924"]},"204524":{"abstract":"This award will support student travel to the 2013 New Security Paradigms Workshop to be held in Banff, Canada, in September 2013. The New Security Paradigms Workshop (NSPW) provides a stimulating, safe, and highly interactive forum for innovative approaches to computer security. NSPW encourages graduate students and junior faculty to examine long-held ideas within computer security. It also strongly encourages non-computer security experts from economics, sociology, psychology, and other disciplines to bring their expertise to bear on computer security paradigms. The support from NSF will be used to sponsor travel expenses for graduate students to attend the workshop. Supporting student travel to attend professional conferences and workshops is a very important mission of the NSF. Broader impacts include training the next generation of researchers in this important research area.","title":"Travel Support for Participants in the 2013 New Security Paradigms Workshop","awardID":"1313572","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["560876"],"PO":["565264"]},"205624":{"abstract":"A long and successful line of research in machine learning deals with algorithms that learn from \"labeled\" data, where a target function is assumed to provide a label for each data point. A major focus of theoretical work has been to develop efficient algorithms for learning different classes of target functions. Recent years have witnessed a data explosion across many domains of science and society, but much of this newly available data consists simply of example points (DNA sequences, sensor readings, smartphone user locations, etc) without any labels. A natural model of such scenarios is that data points are generated according to some unknown probability distribution (typically over an extremely large domain). The goal of the proposed work is to study the learnability of different classes of probability distributions given access to samples drawn from the distributions. This is closely analogous to the framework of learning from labeled data sketched above, but with probability distributions playing the role of functions as the objects to be learned.<br\/><br\/>In this project, the PI will perform theoretical research on developing computationally efficient algorithms for learning and testing various natural types of probability distributions over extremely large domains. (Testing algorithms are algorithms which, instead of trying to accurately model an unknown distribution, have the more modest goal of testing whether or not the distribution has some property of interest.) Specific problems the PI will address include: (1) Developing efficient algorithms to learn and test univariate probability distributions that satisfy various natural kinds of \"shape constraints\" on the underlying probability density function. Preliminary results suggest that dramatic improvements in efficiency may be possible for algorithms that are designed to exploit this type of structure. (2) Developing efficient algorithms for learning and testing complex distributions that result from the aggregation of many independent simple sources of randomness.<br\/><br\/>The algorithms that the PI will work to develop can provide useful modelling tools in data-rich environments and may serve as a \"computational substrate\" on which large-scale machine learning applications can be developed for real-world problems spanning a broad range of application areas. Other important focuses of the grant are to train graduate students through research collaboration, disseminate research results through seminar talks, survey articles and other publications, and to continue ongoing outreach activities aimed at increasing interest in theoretical computer science topics in elementary school students.","title":"AF: Small: Learning and Testing Classes of Distributions","awardID":"1319788","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":[550576],"PO":["565157"]},"204426":{"abstract":"Trusted Platform Modules (TPMs) and other advances in hardware have made it possible to address many security issues, such as ensuring that all loaded software is from authorized sources. As an example, The Windows 8 Secure Boot relies on TPM technology to provide strong guarantees for device integrity, and both Intel and AMD chips include abilities to use external verifiers for code verification.<br\/><br\/>Although these hardware advances provide extremely useful and powerful security properties, researchers and practitioners have been slow to adopt these technologies. One of the main reasons is the lack of familiarity with the capabilities and properties of these technologies. To address this situation, the Trusted Infrastructure Workshop (TIW 2013) provides training for current graduate students with experience in computer security about these technologies and how they can be leveraged for research and engineering. TIW 2013 offers students lectures by leading researchers from industry, government, and academia that are actively developing and using trusted computing technologies, as well as developing future infrastructure technologies for building secure systems.","title":"Trusted Infrastructure Workshop 2013","awardID":"1313027","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[547471],"PO":["565327"]},"206758":{"abstract":"The PIs and Co-PIs of grants supported through the NSF-NIH-BMBF Collaborative Research in Computational Neuroscience (CRCNS) program meet annually. This ninth meeting of CRCNS investigators brings together a broad spectrum of computational neuroscience researchers supported by the program, and includes poster presentations, talks, plenary lectures, and discussions. The meeting is scheduled for June 9-11, 2013 and is hosted by the Massachusetts Institute of Technology.","title":"CRCNS 2013 PI Meeting at Massachusetts Institute of Technology","awardID":"1329776","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7327","name":"CRCNS"}}],"PIcoPI":[553588],"PO":["564318"]},"199223":{"abstract":"Cloud Computing has radically changed how businesses run their applications by allowing a huge number of computers to be economically shared by many different users. The applications running inside these cloud data centers are growing in size and complexity. Even a relatively straightforward web application is likely to be composed of multiple interacting service components such as a web server, a database, and a data cache. The result is a complicated distributed application that may exhibit performance bottlenecks or consistency requirements between components. Unfortunately, existing resource management and reliability tools consider these components individually, and are often unaware of the important relations between them.<br\/><br\/>This work is predicated on the belief that future data centers must be application-agnostic, yet distributed-computing-aware. The goal of this research project is to enable cloud platforms to balance this trade-off, improving performance, reliability, and efficiency. Its contributions will be twofold: 1) tools for cloud providers to better understand the applications running on their infrastructure, and 2) new resource management and reliability algorithms that offer customers stronger guarantees. These will be achieved with application-agnostic solutions built into the virtualization layer, that are still capable of understanding the structure and dependencies of distributed applications. <br\/><br\/>Broader Impact: This work will improve the efficiency and reliability of data centers running web applications used by millions of people daily. By attacking these challenges at the virtualization layer, we will provide flexible solutions fit for a wide variety of environments. The project also contains a significant educational component to enhance the understanding of cloud computing challenges for students at the high school through graduate levels.","title":"CAREER: Application-Agnostic, Distributed-Aware Cloud Platforms","awardID":"1253575","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[534362],"PO":["565255"]},"199179":{"abstract":"The past decade has seen a growing reliance on data driven technologies, including recommendation systems, targeted advertising, and search personalization. This growth in big data has made data privacy into a central concern. The central question raised is: how can we continue to extract useful information from large datasets, while provably protecting some measure of privacy for the individuals contained in these datasets?<br\/><br\/>This research centers around advancing the state of the art in privacy preserving data analysis. It specifically has several themes: (1) Exploiting structure in the private data being analyzed, as well as the classes of queries used in the analysis to give computationally efficient algorithms for private data analysis. (2) Deepening the connections between private data analysis and machine learning theory. (3) Relaxing the adversarial collusion model implicit in most work on the foundations of data privacy, and (4) applying the tools of differential privacy to usefully exploit and analyze noise in other algorithmic settings. To ensure the broad impact of this research, this project includes substantial outreach activities, including workshop organization, course development, and the development of a textbook and other educational materials.","title":"CAREER: The Algorithmic Foundations of Data Privacy","awardID":"1253345","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[534274],"PO":["565264"]},"199268":{"abstract":"Infrastructure-as-a-service (IaaS) cloud computing systems are revolutionizing business, government, and science by providing easy access to scalable computing. These public services, as offered by Amazon, Google, Microsoft, and others, allow an arbitrary customer to rent, by the hour, the resources needed to run their applications within virtual machines (VMs) hosted on the provider?s compute infrastructure. With these new services, however, comes subtle new security issues. Prior work by the PI uncovered attacks that abuse two aspects unique to cloud computing: resource sharing among mutually distrustful customers and pricing that incentivizes malicious behavior. <br\/><br\/>The proposed research is organized along the two themes of resource sharing and pricing. In the first theme, the work explores whether cryptographic side channel attacks and resource-freeing attacks pose serious threats to cloud customers and then develops new placement and CPU scheduling algorithms that realize the security principle of soft isolation: minimization of potentially dangerous cross-user scheduling interactions (e.g., sharing a server or CPU core). Within the second theme, the work explores the implications of fine-grained pricing mechanisms on security. This includes developing pricemarks (mechanisms for accurately determining the true costs of a cloud service), understanding customer-controlled placement gaming that exploits cloud performance heterogeneity, and explores pricing-based security mechanisms that, in conjunction with the aforementioned scheduling mechanisms, will degrade fiscal incentivizes for adversarial behavior. <br\/><br\/>The impact of the proposed work will be deeper understanding of threats in cloud IaaS systems, new security design principles, deployable security technologies, and improvements in security education.","title":"CAREER: Infrastructure for Secure Cloud Computing","awardID":"1253870","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["553788"],"PO":["565327"]},"202227":{"abstract":"Inland bodies of freshwater are a resource that is critical for the Nation's health and safety. This project is developing a new spatio-temporal field representation suitable for modeling, planning and control under uncertainty in order to improve monitoring of such water systems. The project's focus is on a reconfigurable aquatic sensor-actuator network designed to capture data from coupled physical, chemical, and biological processes that occur across space and time-scales. The key advantages of this sensor-actuator network in its application to this domain include synoptic volume coverage, adaptive sampling, flexible control and robustness to component failure. The research objective is to build models of dynamic processes for which high resolution sampling is necessary at special locations. Toward this end, this project is contributing new methods, data-structures, algorithms, and implementations validated by field testing a heterogeneous system consisting of stationary and mobile (robotic) underwater node. <br\/><br\/>This project provides unique interdisciplinary opportunities for education of both graduate and undergraduate students via new course work that blends projects and research topics directly into courses and newly developed seminars. It provides a multi-disciplinary experience for students while developing their engineering skills. Relevant components of computer science, computer engineering, and mechanical engineering are integrated together by using the project's aquatic platform and experimental scenarios as a focal point. <br\/><br\/>The project advances the state-of-the-art for such systems because it integrates low-level dynamic processes with high-level planning and distributed optimization. The research represents a change in the scale of robotic aquatic sampling away from immense bodies of<br\/>water in oceanographic research, toward bodies of water that have a more immediate affect on our well-being as they are sources and stores of drinking water. The impact of datasets which lead to better understanding of managed and natural inlets, differing topography including dam walls and man-made structures, regions of turbulence, and seasonal algal growth are immense.","title":"RI: Medium: Collaborative Research: Decision-Making on Uncertain Spatial-Temporal Fields: Modeling, Planning and Control with Applications to Adaptive Sampling","awardID":"1302360","effectiveDate":"2013-06-01","expirationDate":"2017-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[541963],"PO":["564069"]},"201017":{"abstract":"This award establishes a new CISE REU site focused on mobile computing security at Indiana University Purdue University Indianapolis. A team of faculty will lead undergraduate students in hands-on projects based on the latest research on mobile device security, mobile cloud security, and mobile social network security. Working together in small groups, the students will learn how to plan, implement, and evaluate research projects. Participating students will have access to an internal cloud computing platform as well as smartphones and tablet computers. Through this program, participants will gain first-hand experience in research and graduate student life, which will help them make informed decisions in pursuing postgraduate studies as well as in choosing professional careers. This project is co-funded by the CISE Secure and Trustworthy Cyberspace (SaTC) Cluster.<br\/><br\/>Intellectual Merit. The intellectual merit of this proposal includes a faculty with expertise in mobile and cloud computing security, an important and timely area of computing that is of national interest. Students will acquire first-hand experiences with state-of-the-art technologies, which are often inaccessible to them due to high acquisition and maintenance costs. Through this REU grant, students will work with faculty mentors in completing cutting-edge research projects that have the potential to change our everyday computing experiences. By the end of program, students will acquire valuable skills, gain a broader and deeper understanding of research, and develop greater confidence in their abilities.<br\/><br\/>Broader Impact. The broader impact of this proposal is to help students tap into cutting-edge research, to boost their interests in science and engineering, and to inspire them to pursue postgraduate education in these fields. The team is committed to recruiting underrepresented minority and female students, as well as students from institutes with inadequate resources to conduct research in mobile computing security. Thus the project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Enhancing Undergraduate Experience in Mobile Computing Security","awardID":"1262984","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["194265",538939],"PO":["564181"]},"209829":{"abstract":"This project will enable the development of personally-tailored motivators for the use of social technologies, e.g., various incentives to encourage users to contribute knowledge, provide emotional support or curate information on an online system. The project includes (1) study of motivator-to-motivation matching using a series of controlled studies, (2) development of models to infer users' motivation profiles through analyzing how underlying motivations predict usages of social technologies, and (3) application and evaluation of tailored motivators to encourage user-participation in naturalistic settings. <br\/><br\/>The results of this research will advance scientific understanding of how a person's motivations influence his or her usage of social technologies. It will also deepen our understanding of human motivations more generally by elucidating the intricate relationship between the types of rewards and how they are moderated by different underlying motivations to affect behaviors. In addition, the research will also result in models for identifying users' motivation profiles, and a general design framework for researchers and designers to tailor motivators, bridging multiple disciplines.<br\/><br\/>The developed motivation profiles and design framework may be useful to tackle a variety of everyday challenges of motivation in social technologies to improve knowledge sharing, social support and information representation. Through collaborative projects, this research will also aid health behavior change efforts to encourage blood donation and combat infant obesity. Finally, through an integrated educational plan, this research program will also contribute to improving general classroom learning, the creation of a graduate course and high school summer camp, and the training of scholars in interdisciplinary research methods.","title":"CAREER: Advancing Social Computing with Tailored Motivators","awardID":"1348542","effectiveDate":"2013-06-16","expirationDate":"2018-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562508],"PO":["565342"]},"205814":{"abstract":"The path of technological evolution has naturally led to a critical issue to ensure content, devices, and intellectual property being used by authorized users for legitimate purposes, and to be able to forensically prove with high confidence when otherwise. When information goes through various devices and processing, there are inherent traces left from each processing step. These traces serve as intrinsic fingerprints and are essential for forensic analysis. This research involves developing a joint forensic and anti-forensic framework to leverage the universal intrinsic fingerprints to gather traces of evidence to answer who has done what, when, where, and how. The main thrusts of this research include:<br\/><br\/>(1) Investigation of the strategy space and adversarial dynamics on a broad range of forensic problems associated with content, device and emerging sensing paradigm;<br\/><br\/>(2) Development of a theoretical foundation to understand the fundamental performance limit and establish formal notions of forensicability in an information processing chain; and<br\/><br\/>(3) Development of an Information Forensic and Anti-Forensic Engine along with a benchmark set and an online portal for integrated research, education, and outreach.<br\/><br\/>This research establishes a comprehensive foundation for the field of trustworthy information forensics, with a broad range of important applications tackled from a new angle of thinking. The research program seamlessly integrates with the education and outreach program through the establishment of the Forensic Engine and the collaboration with law and policy professionals. Through establishing trust and provenance in digital domain, closely involving and training students, collaboration in the research community, and partnership with law professionals and industry, this research contributes to law enforcement and national security as well as promotes the emerging science of trustworthy forensics to a broad audience.","title":"CIF: Small: Toward Trustworthy Information Forensics and Anti-Forensics","awardID":"1320803","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[551009,"98543"],"PO":["564898"]},"202217":{"abstract":"Inland bodies of freshwater are a resource that is critical for the Nation's health and safety. This project is developing a new spatio-temporal field representation suitable for modeling, planning and control under uncertainty in order to improve monitoring of such water systems. The project's focus is on a reconfigurable aquatic sensor-actuator network designed to capture data from coupled physical, chemical, and biological processes that occur across space and time-scales. The key advantages of this sensor-actuator network in its application to this domain include synoptic volume coverage, adaptive sampling, flexible control and robustness to component failure. The research objective is to build models of dynamic processes for which high resolution sampling is necessary at special locations. Toward this end, this project is contributing new methods, data-structures, algorithms, and implementations validated by field testing a heterogeneous system consisting of stationary and mobile (robotic) underwater node. <br\/><br\/>This project provides unique interdisciplinary opportunities for education of both graduate and undergraduate students via new course work that blends projects and research topics directly into courses and newly developed seminars. It provides a multi-disciplinary experience for students while developing their engineering skills. Relevant components of computer science, computer engineering, and mechanical engineering are integrated together by using the project's aquatic platform and experimental scenarios as a focal point. <br\/><br\/>The project advances the state-of-the-art for such systems because it integrates low-level dynamic processes with high-level planning and distributed optimization. The research represents a change in the scale of robotic aquatic sampling away from immense bodies of water in oceanographic research, toward bodies of water that have a more immediate affect on our well-being as they are sources and stores of drinking water. The impact of datasets which lead to better understanding of managed and natural inlets, differing topography including dam walls and man-made structures, regions of turbulence, and seasonal algal growth are immense.","title":"RI: Medium: Collaborative Research: Decision-Making on Uncertain Spatial-Temporal Fields: Modeling, Planning and Control with Applications to Adaptive Sampling","awardID":"1302302","effectiveDate":"2013-06-01","expirationDate":"2017-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["563654"],"PO":["564069"]},"202207":{"abstract":"3D image segmentation is an important and ubiquitous task in image-oriented scientific disciplines, particularly biomedicine, where images provide the basis for biological discovery. While imaging techniques reveal spatial content and activities within an entire subject, ultimately biologists are interested in specific anatomical structures (e.g., organs, tissues, cells, etc.). Delineation of the structures of interest within a given set of images is therefore a typical first-step in the data-to-knowledge pipeline, with both the efficiency and accuracy of segmentation critically affecting how the data is utilized in research and clinical practice. Creating accurate segmentations, particularly for 3D biomedical images, is a non-trivial task that calls for cooperation between humans and computers. While human experts, with their superior visual perception skills and vast knowledge and experience acquired from years of training, ultimately decide what constitutes an accurate segmentation, they lack the objectivity or efficiency of computational algorithms. On the other hand, without expert guidance, segmentation algorithms easily fail in the presence of the noise and ambiguity that are inevitable in biomedical images. In this research the PIs will investigate 3D image segmentation as a human-computer interaction paradigm to better understand the human factors that are involved in the current segmentation process, with the goal of making the process more efficient, accurate and repeatable. The team's hypothesis is that the segmentation process could be significantly improved through a deeper understanding of how people perform low-level perception and cognition tasks in the context of 3D segmentation (e.g., visual cues, delineation of structures by marks, and local accuracy or quality criteria), and how domain experts wish to specify high-level segmentation constraints (e.g., connectivity, topology, and shape). To test this hypothesis the PIs will analyze the segmentation process by domain experts that span a reasonable subspace of the actual segmentors and segmentation tasks in biology and clinical practice, to define a conceptual framework that captures the low-level perception and cognitive elements of segmentation as well as the higher-level information related to navigation, marking, and inspection. Building upon and instantiating the framework, the team will work with experts to develop a prototype segmentation tool that explores novel interaction and visualization paradigms as well as their supporting algorithms. The prototype tool will be used to both verify the conceptual framework and to create a more effective practical solution to segmentation.<br\/><br\/>Broader Impacts: By formulating and studying segmentation as a human perception and cognitive task, this work represents a major departure from existing research on either segmentation algorithms or tools. The resulting conceptual framework will serve as a bridge between the two communities, leading both to better designs for current and future segmentation tools and the framing of new problems for segmentation algorithms. For end users, the working prototype will support a more effective segmentation experience that is powered by the underlying conceptual framework. Furthermore, formalizing the kinds of perceptual cues and conceptual models users have when approaching the segmentation problem will serve as a useful test case for understanding the more general question of how perception and cognition interact when they are re-mapped to solve a problem they were never designed for. To disseminate the findings of this research, the PIs will release their working prototype as an open-source project, which can then serve as a shared communication platform between algorithm developers, tool developers, and end users.","title":"CGV: Medium: Collaborative Research: Developing conceptual models for navigation, marking, and inspection in the context of 3D image segmentation","awardID":"1302248","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["561353"],"PO":["565227"]},"204759":{"abstract":"Despite best efforts, electronic chips are manufactured with unique personalities that stem from the inability to precisely fabricate their underlying circuits and to create software for controlling the resulting uncertainty. It is possible to use sophisticated test methods to identify the best-performing systems, but this would result in significant cost. An electronic chip's personality is further shaped by its environment and usage, and since both can fluctuate over time, so can the system personality. Systems also grow old and can wear out unexpectedly. These nature and nurture influences make it extremely difficult to design an electronic chip or system that will operate optimally for all possible personalities. <br\/><br\/>To address this challenge, this research will develop \"statistical learning in-chip\" (SLIC). SLIC is a holistic approach to electronic chip\/system design based on continuously learning key personality traits on-line, for evolving a system to a state that optimizes performance. SLIC will not only optimize electronic chip performance but will also reduce costs since systems that were before deemed to have weak personalities at the time of fabrication can now be recovered through the use of SLIC. Integrated systems, especially mobile systems, have stringent constraints on power that necessitate a fundamental re-thinking of how to implement learning, especially since the system itself both performs the learning and uses the resulting knowledge. Therefore, it is conceivable that some learning tasks will require custom hardware; for others, software or even cloud-based solutions may be possible and\/or necessary. In this work, (i) new learning algorithms for use in the chip that optimize operation at every system level and across levels will be developed; (ii) self-evolving systems that learn and adapt to the personality of a system will be developed, designed and implemented; and finally (iii) enhanced performance as well as reduced power consumption using diverse design-driver applications from the medical and consumer electronics fields will be demonstrated. The merit of this research centers on the idea of creating and demonstrating a self-evolving system based on the SLIC design paradigm. Specifically, SLIC will provide a comprehensive approach for coping with uncertainty at all levels of the system stack through learning that enables tradeoffs in performance, power, and reliability as demands on the system change over time.","title":"SHF: Large: High-Performance, Low-Power, Self-Evolving Integrated Systems through Statistical Learning in Chip (SLIC)","awardID":"1314876","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":[548334,"560185",548336,"554461",548338],"PO":["562984"]},"202824":{"abstract":"There is an urgent need for models of financial ecosystems that are driven and informed by data. Unfortunately, current financial cyberinfrastructures severely restrict the availability of data to market participants, regulators and researchers. There are constraints on the data collection authority of regulators that are exacerbated by the lack of ontologies and standards. Beyond these limitations is the inherent challenge of dealing with the complexity of financial information and meeting the diverse and sophisticated analyses required to model heterogeneous ecosystems.<br\/><br\/>For computer scientists to get engaged, a central requirement is the availability of data -- as exemplar and for testing and benchmarking. While some types of data are easily available, many other important types of financial data are proprietary and generally unavailable to the computing research community. The creation of a community infrastructure can go a long way toward meeting this need and hence enabling computer science research in a new domain of data science for finance.<br\/><br\/>The impact of the next generation of community financial cyberinfrastructure and a framework of data science for finance will be significant. There will be increasing synergy from applying computational technology, BIGDATA and Linked Data, and social media, to address difficult modeling and monitoring problems. This may result in improved tools for regulators, as well as fundamentally new designs of market mechanisms, recommendations, ratings, etc. On the educational frontier, data science for finance should nurture a new generation of multi-disciplinary scholars who will blend computational solutions with theories, models and methodologies from finance, economics, mathematics and statistics.","title":"CI-P: Developing the Next Generation of Community Financial CyberInfrastructure for Monitoring and Modeling Financial Eco-Systems and for Managing Systemic Risk","awardID":"1305368","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[543580,543581,543582,"550401","550878"],"PO":["563727"]},"199118":{"abstract":"Modern society depends on a massive amount of, largely ?dirty,? energy to sustain itself. Collectively, buildings consume more energy than the other broad sectors of consumption. A significant barrier to improving building energy efficiency is that fine-grained monitoring of electrical loads at large scales remains impractical: it is expensive, invasive, and unreliable. Our hypothesis is that a comprehensive repository of detailed models that describe how loads use power provides a foundation for programmatically managing building energy consumption. The project?s goal is to advance research and education using the model-based paradigm to design automated load discovery, monitoring, and scheduling techniques that are low in cost, highly transparent, and privacy preserving. To achieve this goal, the project will bootstrap and seed an online data repository to enable new techniques for modeling loads based on their energy usage. Since many types of loads exist, our goal is to develop a library of load modeling techniques. The project will then leverage these models to automatically discover the set of loads a building operates, and monitor their electricity usage using only aggregate electricity recorded by a building smart meter. To benefit students, the project will develop new courses on building energy management, and make the materials publicly available to benefit educators. Importantly, the courses will enable students to gain hands-on experience by ?programming? real buildings. This learning-by-doing approach is highly effective---simply turning devices on and off via computer is eye-opening---and will serve as a catalyst for including undergraduates in research.","title":"CAREER: Model-based Energy Management for Sustainable Buildings","awardID":"1253063","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["558564"],"PO":["565255"]},"198811":{"abstract":"This big data project develops tools to support researchers and developers in the task of prototyping multimedia content analysis algorithms in a large scale. Typically, scientists and engineers prefer to use high-level programming languages such as Python or MATLAB to conduct experiments, as they allow for a quick implementation of a novel idea. Experiments on big data, however, are often computationally-intensive and therefore must eventually be recoded into a low-level language by expert programmers in order to achieve sufficient performance, creating a gap between productivity and performance. In addition, multiple strategies may exist for mapping a problem onto parallel hardware depending on the input data size and the hardware parameters, further exacerbating the problem. Using the application area of multimedia content analysis as an example (an area with one of the largest and the fastest growing amounts of data due to the steady upload of consumer produced videos), this project performs research on a pattern-oriented, application-specific specialization framework that uses a tiered approach to parallel programming. The ultimate aim is to provide the scalability of diverse parallel processing at the productivity level of high-level languages.<br\/><br\/>Social media videos are increasingly being used for scientific research, as they allow us to observe and model many phenomena studied, for example, in social sciences, economics, meteorology and medicine. More scalable content analysis impacts any field that uses social media videos. Moreover, social media videos are an everyday part of many people's lives. Making multimedia content analysis more scalable allows for better algorithms to be developed by more students and researchers, and therefore impacts many people's lives. The framework is made available on the project website (http:\/\/smash.icsi.berkeley.edu).","title":"BIGDATA: Small: DCM: DA: Collaborative Research: SMASH -- Scalable Multimedia content AnalysiS in a High-level language","awardID":"1251276","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["558409"],"PO":["563751"]},"198768":{"abstract":"We are now in the midst of the big data revolution where enterprise services are increasingly being driven by operational and business models that are powered by data analysis. A key part in making big data successful is ensuring that basic data processing primitives can execute efficiently on large and every increasing volumes of data. However, data processing kernels today largely employ techniques that have been designed about three decades ago, and are now out of touch with modern hardware that has made a fundamental technological shift. First, driven by power consumption characteristics, modern processors now have multiple processing units (called cores) fabricated in a single chip. In contrast, processors just a few years ago were single core. Second, traditionally the storage media for data has been the magnetic hard disk. Now, data has started to move nearly permanently to higher levels of the memory hierarchy, and more specifically to main memory. The goal of this project is to rethink key aspects of data processing techniques for the modern many-core and main memory hardware environment. The research approach is to design, implement and evaluate various methods for data kernels that can be used to store and process data efficiently. In other words, the key focus is on producing data kernels that \"run at the speed of modern hardware.\" Thus, this project aims to have a broad impact on the big data ecosystem by developing faster, cheaper and more energy-efficient data kernels.","title":"BIGDATA: Small: DCM: Data Management for Analytics Applications on Modern Architecture","awardID":"1250886","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8083","name":"Big Data Science &Engineering"}}],"PIcoPI":[533271],"PO":["565136"]},"199319":{"abstract":"This project takes a new approach to problems involving sensitive data, by focusing on rigorous mathematical modeling and characterization of the value of private information. By focusing on quantifying the loss incurred by affected individuals when their information is used -- and quantifying the attendant benefits of such use -- the approaches advanced by this work enable concrete reasoning about the relative risks and rewards of a wide variety of potential computations on sensitive data. <br\/><br\/>Specifically, this work has four main technical thrusts. The first is the development of new models and definitions, enabling privacy considerations to be incorporated into agent utility functions. The second is analysis of the feasibility and costs of eliciting sensitive information, in light of these models. The third focus is on enabling more sophisticated computations in settings where individuals value their privacy. Finally, more complex settings incorporate the interests of additional actors.<br\/><br\/>One of the goals of this project is not only to develop a science of the value of private information, but to build bridges between computer science and economics that will enable such work. Further, the models and algorithms developed by this project could inform future regulation regarding the use, exchange, and monetization of sensitive data. The project supports and is supported by a wide variety of educational goals, including significant research involvement of students at a range of stages, development of a course series with a substantial research component, and assessment of a pedagogical technique created to facilitate meaningful engagement with research literature.","title":"CAREER: The Value of Privacy","awardID":"1254169","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["554263"],"PO":["562974"]},"210837":{"abstract":"Although volitional control of prosthetic arms has been studied intensively in recent years, similar technology has not yet been developed for lower limb prostheses, due in part to the lack of control capability in current passive prosthetic legs. Two emerging technologies, powered lower limb prostheses and neural-machine interfaces (NMI), have opened up new possibilities for allowing leg amputees to operate prostheses intuitively and to perform various activities in a natural way. It remains, however, to demonstrate the feasibility of volitional control for powered prosthetic legs. This is the PI's goal in the current project: to develop and implement a novel volitional controller that allows users with transfemoral amputations to operate a multifunctional, powered prosthetic leg intuitively and safely. To this end, she will systematically investigate and quantify the interaction effects between lower limb amputees and powered artificial legs. Intrinsic control (i.e., control based on intrinsic mechanical feedback) for a prototype powered transfemoral (TF) prosthesis will be developed with finite-state machine and impedance control mechanisms so that it can assist amputees in performing various activities in weight bearing and non-weight bearing situations. The design of the volitional control will be based on a multi-model engineering framework that integrates intent decoders with intrinsic prosthesis control so as to create feed-forward control in a powered TF prosthesis while ensuring amputee safety. Finally, a proof-of-concept prototype of a volitionally-controlled, powered TF prosthesis will be implemented and evaluated in real time on patients with TF amputations. <br\/><br\/>Broader Impacts: Project outcomes will significantly advance lower limb prostheses technology, which will in turn lead to quality of life improvements for the large and growing population of lower limb amputees. Similar technology should be applicable to control of powered orthotics, which would benefit patient populations with neuromotor deficits. The experimental data collected in the project will shed light on human motor control mechanisms, which should benefit diverse fields such as kinesiology and neuroscience. The new technologies developed in this research (including sensors, communication, algorithms, control, etc.) should help advance research across human-centered computing (including, for example, exoskeleton control and wearable sensors for health monitoring). Through integration of her research into comprehensive education and outreach programs, the PI will help educate the next generation of engineers and scientists, who will impact the future of science and technology.","title":"CAREER: Understanding and Analyzing User-Prosthesis Interaction for Designing a Volitional Controller for Powered Lower Limb Prostheses","awardID":"1406750","effectiveDate":"2013-06-30","expirationDate":"2017-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["534671"],"PO":["565227"]},"198807":{"abstract":"This big data project develops tools to support researchers and developers in the task of prototyping multimedia content analysis algorithms in a large scale. Typically, scientists and engineers prefer to use high-level programming languages such as Python or MATLAB to conduct experiments, as they allow for a quick implementation of a novel idea. Experiments on big data, however, are often computationally-intensive and therefore must eventually be recoded into a low-level language by expert programmers in order to achieve sufficient performance, creating a gap between productivity and performance. In addition, multiple strategies may exist for mapping a problem onto parallel hardware depending on the input data size and the hardware parameters, further exacerbating the problem. Using the application area of multimedia content analysis as an example (an area with one of the largest and the fastest growing amounts of data due to the steady upload of consumer produced videos), this project performs research on a pattern-oriented, application-specific specialization framework that uses a tiered approach to parallel programming. The ultimate aim is to provide the scalability of diverse parallel processing at the productivity level of high-level languages.<br\/><br\/>Social media videos are increasingly being used for scientific research, as they allow us to observe and model many phenomena studied, for example, in social sciences, economics, meteorology and medicine. More scalable content analysis impacts any field that uses social media videos. Moreover, social media videos are an everyday part of many people's lives. Making multimedia content analysis more scalable allows for better algorithms to be developed by more students and researchers, and therefore impacts many people's lives. The framework is made available on the project website (http:\/\/smash.icsi.berkeley.edu).","title":"BIGDATA: Small: DCM: DA: Collaborative Research: SMASH -- Scalable Multimedia content AnalysiS in a High-level language","awardID":"1251258","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[533364],"PO":["563751"]},"208791":{"abstract":"This project supports funding for students to participate in the International Green Computing Conference (IGCC), to be held in Arlington, VA, in June 2013. Green computing is a rapidly establishing interdisciplinary research area spanning across the fields of computer science and engineering, electrical engineering and other engineering disciplines. Green computing or sustainable computing is the study and practice of using computing resources efficiently, which in turn can impact a spectrum of economic, ecological, and social objectives. IGCC has established itself as the premier conference in this area. The conference will enable researchers and students to the study and practice of using computing resources efficiently, which in turn can impact a spectrum of economic, ecological, and social objectives. This grant will provide travel grants to 10 students who may otherwise not be able to attend IGCC and take advantage of the available learning opportunities in the newly evolving research area of green computing.","title":"Student Travel Sponsorship for the 2013 International Green Computing Conference","awardID":"1342149","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[559679,559680],"PO":["565319"]},"202192":{"abstract":"3D image segmentation is an important and ubiquitous task in image-oriented scientific disciplines, particularly biomedicine, where images provide the basis for biological discovery. While imaging techniques reveal spatial content and activities within an entire subject, ultimately biologists are interested in specific anatomical structures (e.g., organs, tissues, cells, etc.). Delineation of the structures of interest within a given set of images is therefore a typical first-step in the data-to-knowledge pipeline, with both the efficiency and accuracy of segmentation critically affecting how the data is utilized in research and clinical practice. Creating accurate segmentations, particularly for 3D biomedical images, is a non-trivial task that calls for cooperation between humans and computers. While human experts, with their superior visual perception skills and vast knowledge and experience acquired from years of training, ultimately decide what constitutes an accurate segmentation, they lack the objectivity or efficiency of computational algorithms. On the other hand, without expert guidance, segmentation algorithms easily fail in the presence of the noise and ambiguity that are inevitable in biomedical images. In this research the PIs will investigate 3D image segmentation as a human-computer interaction paradigm to better understand the human factors that are involved in the current segmentation process, with the goal of making the process more efficient, accurate and repeatable. The team's hypothesis is that the segmentation process could be significantly improved through a deeper understanding of how people perform low-level perception and cognition tasks in the context of 3D segmentation (e.g., visual cues, delineation of structures by marks, and local accuracy or quality criteria), and how domain experts wish to specify high-level segmentation constraints (e.g., connectivity, topology, and shape). To test this hypothesis the PIs will analyze the segmentation process by domain experts that span a reasonable subspace of the actual segmentors and segmentation tasks in biology and clinical practice, to define a conceptual framework that captures the low-level perception and cognitive elements of segmentation as well as the higher-level information related to navigation, marking, and inspection. Building upon and instantiating the framework, the team will work with experts to develop a prototype segmentation tool that explores novel interaction and visualization paradigms as well as their supporting algorithms. The prototype tool will be used to both verify the conceptual framework and to create a more effective practical solution to segmentation.<br\/><br\/>Broader Impacts: By formulating and studying segmentation as a human perception and cognitive task, this work represents a major departure from existing research on either segmentation algorithms or tools. The resulting conceptual framework will serve as a bridge between the two communities, leading both to better designs for current and future segmentation tools and the framing of new problems for segmentation algorithms. For end users, the working prototype will support a more effective segmentation experience that is powered by the underlying conceptual framework. Furthermore, formalizing the kinds of perceptual cues and conceptual models users have when approaching the segmentation problem will serve as a useful test case for understanding the more general question of how perception and cognition interact when they are re-mapped to solve a problem they were never designed for. To disseminate the findings of this research, the PIs will release their working prototype as an open-source project, which can then serve as a shared communication platform between algorithm developers, tool developers, and end users.","title":"CGV: Medium: Collaborative Research: Developing conceptual models for navigation, marking, and inspection in the context of 3D image segmentation","awardID":"1302200","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["550459"],"PO":["565227"]},"202182":{"abstract":"3D image segmentation is an important and ubiquitous task in image-oriented scientific disciplines, particularly biomedicine, where images provide the basis for biological discovery. While imaging techniques reveal spatial content and activities within an entire subject, ultimately biologists are interested in specific anatomical structures (e.g., organs, tissues, cells, etc.). Delineation of the structures of interest within a given set of images is therefore a typical first-step in the data-to-knowledge pipeline, with both the efficiency and accuracy of segmentation critically affecting how the data is utilized in research and clinical practice. Creating accurate segmentations, particularly for 3D biomedical images, is a non-trivial task that calls for cooperation between humans and computers. While human experts, with their superior visual perception skills and vast knowledge and experience acquired from years of training, ultimately decide what constitutes an accurate segmentation, they lack the objectivity or efficiency of computational algorithms. On the other hand, without expert guidance, segmentation algorithms easily fail in the presence of the noise and ambiguity that are inevitable in biomedical images. In this research the PIs will investigate 3D image segmentation as a human-computer interaction paradigm to better understand the human factors that are involved in the current segmentation process, with the goal of making the process more efficient, accurate and repeatable. The team's hypothesis is that the segmentation process could be significantly improved through a deeper understanding of how people perform low-level perception and cognition tasks in the context of 3D segmentation (e.g., visual cues, delineation of structures by marks, and local accuracy or quality criteria), and how domain experts wish to specify high-level segmentation constraints (e.g., connectivity, topology, and shape). To test this hypothesis the PIs will analyze the segmentation process by domain experts that span a reasonable subspace of the actual segmentors and segmentation tasks in biology and clinical practice, to define a conceptual framework that captures the low-level perception and cognitive elements of segmentation as well as the higher-level information related to navigation, marking, and inspection. Building upon and instantiating the framework, the team will work with experts to develop a prototype segmentation tool that explores novel interaction and visualization paradigms as well as their supporting algorithms. The prototype tool will be used to both verify the conceptual framework and to create a more effective practical solution to segmentation.<br\/><br\/>Broader Impacts: By formulating and studying segmentation as a human perception and cognitive task, this work represents a major departure from existing research on either segmentation algorithms or tools. The resulting conceptual framework will serve as a bridge between the two communities, leading both to better designs for current and future segmentation tools and the framing of new problems for segmentation algorithms. For end users, the working prototype will support a more effective segmentation experience that is powered by the underlying conceptual framework. Furthermore, formalizing the kinds of perceptual cues and conceptual models users have when approaching the segmentation problem will serve as a useful test case for understanding the more general question of how perception and cognition interact when they are re-mapped to solve a problem they were never designed for. To disseminate the findings of this research, the PIs will release their working prototype as an open-source project, which can then serve as a shared communication platform between algorithm developers, tool developers, and end users.","title":"CGV: Medium: Collaborative Research: Developing conceptual models for navigation, marking, and inspection in the context of 3D image segmentation","awardID":"1302142","effectiveDate":"2013-06-15","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["547864"],"PO":["565227"]},"208695":{"abstract":"This project supports the travel of 10 graduate students and 2 postdoctoral students from U.S. institutions to the SIGCOMM 2013 conference. The ACM SIGCOMM 2013 Conference will be held between August 12 and August 16, 2013, in Hong Kong. ACM SIGCOMM is the flagship annual conference of the Special Interest Group on Data Communications, a special interest group of the Association for Computing Machinery. SIGCOMM is a very highly selective (<14%), high-quality conference sponsored by the ACM. The conference is a major forum for presentation and discussion of important research results in networking. Recipients of the travel grants will be selected via a widely advertised competitive process involving submitting a travel grant application and review by a travel grant committee associated with the SIGCOMM organization.<br\/><br\/>This project integrates research and education of students through exposure to a premier technical meeting in computer networks and communications. Students will have the opportunity to observe high-quality presentations and interact with senior researchers in the field. The proposed student participation is expected to have a positive impact on the students' research interests and quality. Second, the project will promote diversity by encouraging and enabling women and other underrepresented minorities to participate. Furthermore, the truly international flavor of SIGCOMM as an annual conference is well-known and reflected in the composition of the Technical Program Committee (TPC) as well as in the authors of the submitted and accepted papers. As such, it cultivates international research interactions and presents a tremendous opportunity to students to increase their breadth of ideas, research approaches, and technical perspectives.","title":"Student Travel Support for the SIGCOMM 2013 Conference","awardID":"1341344","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[559442],"PO":["564993"]},"205770":{"abstract":"Technical:<br\/>The presence of unmeasured confounding factors can result in incorrect statistical and causal inferences if the confounding factors are correlated with the observed data. This phenomenon has been well documented in at least two important applications. One application is identifying genetic variation involved in disease from populations of related individuals. A second application is identifying genes active in a disease when comparing disease and health samples. In this proposal we propose a new approach to correct for unobserved confounders in taking advantage of insights into how confounders affect high dimensional data. These insights motivate a formal definition for a specific type of confounder which we term a 'low-rank confounder.' Formalizing this definition allows us to motivate methods for correcting for the effects of these types confounders even when the confounders are not observed. Our proposal will develop a theory of how confounders affect data and under what conditions unobserved confounders can be corrected. The proposed theory is related to recent developments in understanding sparsity which has been well studied in electrical engineering, computer science and statistics. The result of our proposed methods will lead to improved methods for applications where such confounders are present.<br\/><br\/>Non-technical:<br\/>Inference of knowledge from high dimensional data is a fundamental problem affecting virtually all areas of science including physics, astronomy, chemistry, computer science, social science and many areas of biology. Many of these problems are driven by recently available large sources of data and advances in measurement or data collection technologies. A major challenge is the presence of unknown (and unmeasured) confounding factors. Confounding factors are variables that are often not observed in the data, but are correlated with various features of the data. Unfortunately, confounding factors can cause incorrect inferences. This phenomenon has been well documented in at least two important applications: one application is identifying genetic variation involved in disease from populations of related individuals, and a second application is identifying genes active in a disease when comparing disease and health samples. There are traditional approaches to perform inference if the confounders are observed in the data. However, dealing with unobserved confounders is more difficult. This project will develop and study a new approach to correct for unobserved confounders, taking advantage of insights into how confounders affect high dimensional data. The project has broad impact due to its utility in a wide range of scientific questions, through the interdisciplinary research opportunities provided to undergraduate and graduate students, and through the distribution of software and data.","title":"III: Small: Causal and Statistical Inference in the Presence of Confounding Factors","awardID":"1320589","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["554197"],"PO":["565136"]},"206760":{"abstract":"This award provides support for the Doctoral workshop and grand challenge forum to be conducted in conjunction with the ACM International Conference on Distributed Event-Based Systems conference (DEBS 2013). The 7th conference of DEBS is held at the University of Texas at Arlington, June 29th -- July 3rd 2013. The event-based paradigm has gathered momentum as witnessed by current efforts in areas such as event-driven architectures, big data systems, the internet of things, complex event processing, publish\/subscribe systems, business process management, grid computing, web services, information dissemination, stream processing, and message-oriented middleware. The DEBS conference brings together students, researchers and practitioners from these diverse communities to share their views and reach a common understanding of current research work and open challenges. The conference also provides a forum for facilitating the exchange of ideas between academia and industry. The ACM DEBS proceedings are published by ACM. <br\/><br\/>The grant provides partial travel expenses for about 12 U.S.-based students presenting their research in the doctoral workshop and participating in the grand challenge activity. Participation in DBES 2013 provides the opportunity to students to learn about cutting edge research in the area of distributed event-based systems and to interact with experts in the top stream and event-based systems conference. The conference will provide an opportunity to students to present their on-going research, as well as obtain objective feedback on their presentation. DEBS offers an environment for training and developing the future generation of academics, and personnel with appropriate skills needed for the industry, as well as enhancing the participation of underrepresented students in event-based research. A strong representation of U.S.-based graduate students at the DEBS 2013 conference is useful in maintaining U.S. competitiveness in this field of research. The student travel stipend recipients will be announced at the ACM DEBS 2013 conference website (http:\/\/www.orgs.ttu.edu\/debs2013).","title":"Doctoral Workshop and Student Travel support for the 7th ACM International Conference on Distributed Event-Based Systems Conference (DEBS 2013)","awardID":"1329782","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[553593,"229551",553595,553596],"PO":["563751"]},"208685":{"abstract":"This award supports travel stipends for students to participate in Doctoral Consortium (July 22, 2013) and in the 2013 ACM\/IEEE-CS Joint Conference on Digital Libraries (JCDL 2013), to be held in Indianapolis, Indiana, June 23-25, 2013 (http:\/\/www.jcdl2013.org). The selected PhD students are in the early stages of their dissertation work and several international students are included in order to provide breadth in exchanging ideas. The goal of the consortium is to help students develop their dissertation proposals and research plans through feedback and guidance from prominent researchers and experienced practitioners from the field of digital library research and development. The JCDL Doctoral Consortium provides a forum for Ph.D. students to interact with major leaders in the digital library community. These international leaders exemplify a broad set of expertise, diversity of perspectives, and wealth of knowledge. The consortium provides students with an opportunity to have broad audience and interact intellectually with professionals who would otherwise be difficult to meet with. Participating students will be selected on the basis of a paper describing their research. At the consortium, participants will have approximately 40 minutes to present their research plans and receive feedback from the panel. After the consortium the students will revise their papers based on the consortium's feedback and then they will be published in the IEEE Technical Committee on Digital Libraries publication \"TCDL Bulletin\" (http:\/\/www.ieee-tcdl.org\/mediawiki\/TCDL\/index.php\/IEEE-TCDL).<br\/><br\/>Participation in JCDL 2013 Doctoral Consortium and conference will expose the selected students as well as other attending students to a larger community, extend their opportunities for intellectual engagement, and encourage scholarly discourse and networking among new entrants into the field. The goal is to help shape ongoing and future teaching, research, and development projects in the field of digital libraries by providing wider exposure for the students to innovative ideas which may generate new research questions in the future, and to foster a sense of community among these young researchers at a critical stage in their professional development. The organizers will also take special steps to solicit participation from institutions with underrepresented groups to extend the potential benefits and broaden the horizon of expertise in the field.","title":"Doctoral Consortium and Student Travel Support for 2013 ACM\/IEEE-CS Joint Conference on Digital Libraries (JCDL 2013)","awardID":"1341309","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[559417],"PO":["563751"]},"208102":{"abstract":"This project will support travel by approximately 11-12 students at U.S. institutions to attend the 11th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys 2013). MobiSys, sponsored by ACM SIGMOBILE, will be held June 25th-28th, 2013 in Taipei, Taiwan. Priority will be given to students who will benefit from attending this conference, but are unlikely to attend due to the unavailability of travel funding. MobiSys is the premier conference in the field of mobile computing and system integration. It offers a variety of technical activities including keynote and contributed presentations, a poster session, demonstrations, three workshops, and a PhD Forum.<br\/><br\/>This project furthers both research and education, by enabling graduate students conducting research in the field to attend high-caliber technical presentations, be exposed to state-of-the-art research, and interact with leading researchers and fellow graduate students from around the world. The impact to the students' careers from attending MobiSys 2013 is expected to be substantial.","title":"Student Travel Grant for MobiSys 2013","awardID":"1338240","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[557642],"PO":["564778"]},"199291":{"abstract":"Many scientific domains have entered a data-driven era, in which scientific discovery depends heavily on effective and efficient analysis of large-scale data generated by wet-bench experiments or computer simulations. Current database management systems (DBMSs), while being very popular in the business world, fall short in high-throughput data processing required by scientific applications. The goal of this project is to design and implement a novel data management software architecture that enables high-throughput data management services for general scientific communities. The project achieves this goal via (1) a novel one-scan-fits-all data processing framework based on repetitive scans of large data sources; (2) a query engine that leverages the massive computing power of modern Graphics Processing Units (GPU) hardware; and (3) design and implementation of algorithms for popular analytics in three scientific domains on top of the query engine to demonstrate the effectiveness and efficiency of the proposed architecture. The project also aims at building a software prototype and evaluating this prototype with real-world scientific datasets and query workloads. <br\/><br\/>The project is expected to provide a highly efficient solution to satisfy the data management needs of a wide range of scientific fields. To deliver comparable performance, the proposed architecture requires only a fraction of the hardware and energy costs needed by existing systems. As a result, it has the potential to make scientific studies that are regarded as difficult or infeasible a reality. Integration of proposed research into educational endeavors that contribute to broadening the influence of computer science, nurturing the next generation of multidisciplinary scientists, and boosting the success of minority and women students in the computer science and engineering field are other broader impact activities planned.","title":"CAREER: Enabling high-throughput data management in scientific domains","awardID":"1253980","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[534498],"PO":["565136"]},"202141":{"abstract":"Modern computer systems are undergoing a pervasive change. They are becoming increasingly parallel, meaning that multiple processing units, or cores, work together to carry out tasks. To facilitate the kinds of synchronization and coordination needed to exploit these new architectures, leading hardware vendors have developed a new generation of processor architectures that provide hardware transactional memory, a synchronization structure that promises to avoid many of the well-known pitfalls and limitations of conventional approaches to synchronization. The move to hardware transactions will bring about a fundamental positive change in the way multicore machines are programmed.<br\/><br\/>This project will redesign basic synchronization structures such as locks, memory management, and a range of concurrent data structures such as heaps, hash tables, and skip lists. These new structures will be embodied in an open-source C++ library. The project's goal is to create better performing, more reliable, and less expensive parallel software, scalable to larger systems, while at the same time making code simpler and more reliable. Moreover, this project will enhance understanding of how hardware transactional memory can be used effectively, a benefit to both users and manufacturers of future processors.","title":"SHF: Medium: Collaborative Research: Transactional Software Infrastructures: Making the Most of Hardware Transactions","awardID":"1301924","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":["554181"],"PO":["564588"]},"202262":{"abstract":"Matrix learning is fundamental in many learning problems. These include problems that can be directly formulated as learning some unknown matrix, as well as a broader class of learning problems involving a matrix of parameters. The most direct matrix learning problem is matrix completion, completing unseen entries in a partially observed matrix. Matrix completion has recently received much attention both in practice in collaborative filtering (notably through the Netflix challenge), and theoretical analysis as an extension to compressed sensing. Matrix learning has also been used for clustering, transfer and multi-task learning, and similarity learning.<br\/><br\/>The dominant approach to matrix learning in recent years, especially in the context of matrix completion, has used the matrix trace norm (developed in part by the PI on this award). Indeed, trace norm-based methods enjoy much success in a variety of applications. This project develops and studies alternative matrix norms to the trace-norm, most importantly the promising max-norm.<br\/><br\/>Learning with the max-norm was initially presented in 2004 (along with the trace norm), but has not received the same attention, despite many theoretical and empirical advantages. This project identifies domains where the max-norm and related norms can be beneficial, develops computational methods for using these norms, and promotes the adoption of these norms. A central aim is to develop optimization methods for max-norm regularized problems that are as efficient as the corresponding methods for trace-norm regularized problems, such as singular value thresholding and LR-type methods. Beyond matrix completion, the project applies the max-norm both to problems where the trace-norm has been previously applied, and in novel settings. Novel applications include clustering, binary hashing, crowdsourcing, modeling rankings by a population, and similarity learning.<br\/><br\/>Research under this project links the machine learning and theory-of-computation research communities (where SDP relaxations essentially corresponding to the max-norm have played a significant role in recent years). The project forms bridges between the communities, enabled in part by cross-disciplinary tutorials. Through collaboration with sociologists the PIs reach out to the social sciences, and increase the broad impact of the work by presenting it in an approachable and useable way to this audience.","title":"RI: AF: Medium: Learning and Matrix Reconstruction with the Max-Norm and Related Factorization Norms","awardID":"1302662","effectiveDate":"2013-06-01","expirationDate":"2017-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":[542050,542051],"PO":["562760"]},"208774":{"abstract":"Computational techniques are revolutionizing the way in which research is conducted in science and engineering.. This is particularly true in the domains of biology, medicine, and drug discovery. Given that these areas are of utmost importance to the society at large, it is not enough if advances are made in these areas in isolation. These communities have to work together to help each other and come up with the best possible diagnosis tools, treatment procedures, drugs for various diseases, etc. The proposed conference has the goal of bringing together scientists in all the three areas and hence serving as a platform for bridging the research efforts in these areas. The requested funds will be used to support the travel expenses of graduate students and keynote speakers. These students will get to meet experts and listen to their research results. Not only the attending students but also their friends will benefit since when the students return to their schools they will communicate their experience with their friends. The conference proceedings will be of great use to students, researchers, and practitioners. Portions of the proceedings could be used in different courses as well.","title":"Third International IEEE Conference on Computational Advances in Bio and Medical Sciences (ICCABS) - Travel Awards","awardID":"1342060","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[559638],"PO":["565136"]},"208653":{"abstract":"Cyber-physical systems (CPS), are smart networked systems that have cyber technologies, both hardware and software, deeply embedded in, and interacting with, physical components. CPS represent a core opportunity area and source of competitive advantage for the U.S. innovation economy in the 21st century. A highly skilled science and engineering workforce is needed to design and build CPS, in which cyber and physical components must be tightly integrated into complex, networked systems that must respond in real (physical) time and interoperate safely and securely. This NSF award supports a study, conducted by the Computer Science and Telecommunications Board under the auspices of the National Research Council of the National Academies, that will examine current and future needs in education for Cyber-Physical Systems (CPS). <br\/><br\/>Two workshops are being convened to gather input and foster dialogue, yielding a brief interim report prepared to highlight emerging themes. The committee's final report will articulate a vision for a 2l-st century CPS-capable U.S. workforce. It will explore the corresponding educational requirements, examine efforts already under way, and propose strategies and programs to develop faculty and teachers, materials, and curricula. It would consider core, cross-domain, and domain-specific knowledge. It would consider the multiple disciplines that are relevant to CPS and how to foster multidisciplinary study and work. In conducting the study, the committee would focus on undergraduate education and also consider implications for graduate education, workforce training and certification, community colleges, the K-12 pipeline, and informal education. It would emphasize the skills needed for the CPS scientific, engineering, and technical workforce but would also consider broader needs for CPS fluency.","title":"Toward 21st Century Cyber-Physical Systems Education","awardID":"1341078","effectiveDate":"2013-06-15","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["560890"],"PO":["565255"]},"208785":{"abstract":"The project provides support for Symposium on Discovery Informatics and Cognitive Systems. Discovery informatics aims to develop computational systems that support the scientific enterprise. Cognitive systems aims to develop computational artifacts that exhibit the broad range of intelligent behavior found in humans. <br\/><br\/>The symposium brings together researchers who approach discovery informatics from a variety of perspectives but who share an interest in system-level approaches and the role of high level cognition in science. It focuses on a specific set of challenges at the intersection of cognitive systems and discovery informatics. The participants' interactions should lead to new insights and new collaborations in this emerging area.<br\/><br\/>The new field of discovery informatics has the potential to not only accelerate but also advance the frontiers of the scientific enterprise by automating processes that researchers currently carry out manually. This symposim aims to clarify these processes and share insights with the broader community. The symposium fills a critical need in terms of building a vibrant community of interdisciplinary researchers in discovery informatics. It contributes to education and training of graduate students, and broadening participation of underrepresented groups in STEM areas that are critical to multiple NSF initiatives e.g., Big Data Science and Engineering, Computation and Data Enabled Science and Engineering, among others.","title":"Symposium on Cognitive Systems and Discovery Informatics","awardID":"1342104","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[559662],"PO":["565136"]},"205662":{"abstract":"Modern imaging devices, sensors, data acquisition systems allow to gather data with unprecedented speed and<br\/>accuracy. Most of the times, however, we are not interested in accumulating data per se, but rather to<br\/>uncover some hidden patterns in the data. For instance, given a large network, we might want to discover <br\/>a small subset of notes that are tightly connected to each other. Such highly connected substructures<br\/>are of interest in biological datasets, but also in social network analysis, and in signal processing. <br\/>Finding such patterns requires highly efficient algorithms that can process large amount of data and<br\/>uncover tenuous statistical signatures. The investigators develop new algorithms that simultaneously optimize<br\/>both metrics: statistical efficiency and computational efficiency.<br\/><br\/>Consider in particular the problem of finding an anomalous submatrix in a large data matrix with independent <br\/>random entries. If the anomalous submatrix has entries with a different distribution, this can be done via <br\/>principal component analysis, as long as the submatrix has dimensions of the order of the square root of<br\/>the ambient dimensions. The investigators introduce a class of first order methods with linear complexity,<br\/>and determine the optimal algorithm within this class. This appears to provably outperform existing approaches. <br\/>The same framework is generalized to several other classes of high-dimensional estimation problems. <br\/>Optimal iterative procedures are developed under strict computational constraints.","title":"CIF: Small: Optimal Iterative Estimation in Signal Processing, Information Theory and Machine Learning","awardID":"1319979","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[550662],"PO":["564898"]},"201086":{"abstract":"The objective of this research project is to investigate new ideas that could potentially further accelerate the revolution in integer programming. This project will investigate more efficient convexification techniques: a new cutting plane paradigm that generates a pool of points from which cuts can be produced, and a theory of cut-generating functions, both aimed at finding deeper cuts more efficiently. Integer programming has experienced a revolution in the last two decades that has greatly advanced our ability to solve practical problems in engineering, manufacturing, transportation, telecommunication, finance, marketing and many other areas of economic activity. According to recently performed extensive testing, integer programming solvers are now close to a billion times faster than they were twenty years ago. Better integer programming algorithms (including their linear programming components) account for a speedup of about half a million times, the rest of the improvement (by a factor of about 1600) coming from faster computers. A key element of this transformation was a breakthrough in the use of cutting planes in the early nineties, including the design of the lift-and-project cuts and the ensuing revival of the Gomory mixed integer cuts, two projects carried out by the principal investigators with previous NSF support.<br\/><br\/>Progress in the ability to solve large-scale mixed integer linear programs will affect problem solving and improve efficiency of operations in an extremely broad range of activities that include industrial production, supply chain management, logistics, transportation, electricity production, airport operations, telecommunication networks, health care applications such as scheduling intensive care units and determining radiation dosage, combinatorial auctions, finance and economics. The widespread impact of tools developed in this project will contribute to technological excellence and strengthen US technological leadership.","title":"(Mixed) Integer and Combinatorial Optimization: New Convexification Techniques","awardID":"1263239","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":[539128,539129],"PO":["565139"]},"208753":{"abstract":"This project proposes to provide competitive travel support for student teams wishing to compete in the Mobile Micro-Robotics Challenge. The challenge involves advances in the design and fabrication of microelectromechanical systems (MEMS) enabling the development of mobile micro-robots that can autonomously navigate and manipulate in controlled environments. It is expected that this technology will be critical in applications as varied as intelligent sensor networks, in vivo medical diagnosis and treatment, and adaptive microelectronics. However, many challenges remain, particularly with respect to locomotion, power storage, embedded intelligence, and motion measurement, therefore, it is valuable to help enable participation by defraying travel costs. <br\/><br\/>The broader impacts of this grant include the ability of research teams to showcase working demonstrations that support the challenge themes of micro-scale actuation, manipulation and locomotion. Travel assistance will increase the exposure of US student teams to international competitors, likely increasing the knowledge and competitiveness of the US-based teams since this event has traditionally been dominated by teams from Europe. The multi-day competitions will be held during the IEEE ICRA conference providing an excellent opportunity to engage a broad technical audience. The competitions are open to the general public to raise awareness of the state-of-the-art. The competitions provide an opportunity for students and leaders to learn how micro-robotics can play an important role in society.","title":"Travel Support for Mobile Micro-Robotics Challenge at IEEE ICRA 2013","awardID":"1341984","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8013","name":"National Robotics Initiative"}}],"PIcoPI":[559589],"PO":["564069"]},"206696":{"abstract":"The 2013 International Conference on Intelligent Biology and Medicine (ICIBM 2013) focuses on educating and training the next generation of bioinformatics, systems biology, and intelligent computing experts with up-to-date technologies and knowledge to further advance the future development within these innovative fields and beyond. ICIBM 2013 will facilitate programs that cater to multiple levels of research expertise so that those just beginning their research career can gain the highest level of training and information from experts and innovators, and those continuing with their research at higher levels have communication and collaborative opportunities that will significantly increase the success of research overall. To further disseminate the most innovative interdisciplinary research the program will include distinguished keynote lectures, innovative tutorial session, and research presentations. ICIBM 2013?s commitment to education and diversity, as evidenced by its support of underrepresented students and trainees, its unique training opportunities, and its inclusiveness even among its committees (including a culturally and disciplinarily diverse Trainee Committee to include young scientists more thoroughly), highlights it as an unprecedented resource for within bioinformatics, systems biology, intelligent computing, and related fields. These areas of research integrate science and engineering knowledge with modern, state-of-the-art intelligent computing technology.","title":"Interdisciplinary Dialogue for Education, Collaboration, and Innovation: Intelligent Biology and Medicine In and Beyond 2013","awardID":"1329380","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[553423],"PO":["565136"]},"208533":{"abstract":"It is widely acknowledged that improving health and quality of life in the United States will require contributions and advances in many technical and non-technical areas, including computer science, engineering, economics, as well as in the social and behavioral sciences. The NSF Smart Health and Wellbeing Program focused on fundamental research in these areas and has supported a diverse set of multidisciplinary projects and investigators that received their awards in 2011 and 2012. The workshop for the principal investigators in the Smart Health and Wellbeing Program was organized to bring together these researchers with diverse projects and varied backgrounds and areas of expertise to exchange ideas, network, learn from each other, form new collaborations, and help to shape the future of this dynamic and rapidly growing set of fields. In addition to the presentation of posters associated with the funded projects, the participants have the opportunity to attend several invited presentations by leaders in several relevant fields focused on healthcare challenges and potential solutions. To capture their creativity and innovative ideas, the workshop attendees were invited to participate in several breakout sessions. The summary of the workshop outcomes will be accessible at http: http:\/\/nsfsmarthealthwellness2013.usc.edu\/","title":"NSF Smart Health and Wellbeing PI Meeting","awardID":"1340358","effectiveDate":"2013-06-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[558935],"PO":["564768"]},"202230":{"abstract":"Inland bodies of freshwater are a resource that is critical for the Nation's health and safety. This project is developing a new spatio-temporal field representation suitable for modeling, planning and control under uncertainty in order to improve monitoring of such water systems. The project's focus is on a reconfigurable aquatic sensor-actuator network designed to capture data from coupled physical, chemical, and biological processes that occur across space and time-scales. The key advantages of this sensor-actuator network in its application to this domain include synoptic volume coverage, adaptive sampling, flexible control and robustness to component failure. The research objective is to build models of dynamic processes for which high resolution sampling is necessary at special locations. Toward this end, this project is contributing new methods, data-structures, algorithms, and implementations validated by field testing a heterogeneous system consisting of stationary and mobile (robotic) underwater node. <br\/><br\/>This project provides unique interdisciplinary opportunities for education of both graduate and undergraduate students via new course work that blends projects and research topics directly into courses and newly developed seminars. It provides a multi-disciplinary experience for students while developing their engineering skills. Relevant components of computer science, computer engineering, and mechanical engineering are integrated together by using the project's aquatic platform and experimental scenarios as a focal point. <br\/><br\/>The project advances the state-of-the-art for such systems because it integrates low-level dynamic processes with high-level planning and distributed optimization. The research represents a change in the scale of robotic aquatic sampling away from immense bodies of water in oceanographic research, toward bodies of water that have a more immediate affect on our well-being as they are sources and stores of drinking water. The impact of datasets which lead to better understanding of managed and natural inlets, differing topography including dam walls and man-made structures, regions of turbulence, and seasonal algal growth are immense.","title":"RI: Medium: Collaborative Research: Decision-Making on Uncertain Spatial-Temporal Fields: Modeling, Planning and Control with Applications to Adaptive Sampling","awardID":"1302393","effectiveDate":"2013-06-01","expirationDate":"2017-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["543408"],"PO":["564069"]},"206983":{"abstract":"This project is providing support for travel and registration for U.S. participants in a key global venue for research and training in the learning sciences via the Doctoral Consortium and Early Career Workshops at the Computer-Supported Collaborative Learning (CSCL) 2013 conference in Madison, WI. Prior versions of these workshops have had a significant impact on the career and research of pre- and post-PhD scholars in the learning sciences from diverse domains such as computer science, information science, education, psychology, and cognitive science. The intellectual merit of this project rests in its selection of top-quality pre- and post-doctoral candidates whose research in computer-supported collaborative learning addresses the conference theme: \"Learning across Levels of Space, Time, and Scale.\" Their participation in the conference provides opportunities to improve the dissertations of approximately fifteen graduate students and the research agendas of approximately fifteen early career, post-doctoral scholars. As such it is an important capacity-building project that leverages the expertise of the CSCL community and the outcomes of previous workshops held in conjunction with the International Conference of the Learning Sciences (ICLS). The broader impacts of this project include multiplying opportunities to develop international collaborations in the field of CSCL, and supporting the career development of some of the next generation of researchers in multiple disciplines who work in the CSCL area.","title":"CSCL 2013: Learning across Levels of Space, Time, and Scale Doctoral Consortium and Early Career Workshops","awardID":"1331135","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8020","name":"Cyberlearning: Transforming Ed"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7625","name":"REESE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7645","name":"DISCOVERY RESEARCH K-12"}}],"PIcoPI":[554179],"PO":["560894"]},"202143":{"abstract":"Modern computer systems are undergoing a pervasive change. They are becoming increasingly parallel, meaning that multiple processing units, or cores, work together to carry out tasks. To facilitate the kinds of synchronization and coordination needed to exploit these new architectures, leading hardware vendors have developed a new generation of processor architectures that provide hardware transactional memory, a synchronization structure that promises to avoid many of the well-known pitfalls and limitations of conventional approaches to synchronization. The move to hardware transactions will bring about a fundamental positive change in the way multicore machines are programmed.<br\/><br\/>This project will redesign basic synchronization structures such as locks, memory management, and a range of concurrent data structures such as heaps, hash tables, and skip lists. These new structures will be embodied in an open-source C++ library. The project's goal is to create better performing, more reliable, and less expensive parallel software, scalable to larger systems, while at the same time making code simpler and more reliable. Moreover, this project will enhance understanding of how hardware transactional memory can be used effectively, a benefit to both users and manufacturers of future processors.","title":"SHF: Medium: Collaborative Research: Transactional Software Infrastructures: Making the Most of Hardware Transactions","awardID":"1301926","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":[541744],"PO":["564588"]},"209744":{"abstract":"As the Internet grows, so do Internet routing tables. This growth has so far been manageable, i.e., routing tables count fewer than 300,000 entries versus several hundred millions entities connected to the Internet; but this status-quo is ending. Core routing tables have experienced exponential growth far exceeding the pace of technology improvements. This has become cause for alarm for equipment vendors and standard organizations (the IETF recently created a ?Working Group? dedicated to the problem). Solutions will, however, take time to mature and likely require significant changes to Internet technology. <br\/><br\/>Broader Impact: This project explores whether market mechanism can help control the growth of Internet routing tables. Specifically, Internet users contribute to this growth primarily through multi-homing and traffic engineering, both aimed at improving local performance and reliability. These local improvements have global consequences: they increase the number of routing entries in the Internet core. Market-based solutions can introduce incentives and pricing mechanisms that capture this tension and allow users to realize their goals while explicitly reflecting their costs to others.<br\/><br\/>The intellectual merit of this research is in accounting for both technical issues and user goals in developing solutions to preserve Internet growth. Market solutions are effective in tackling complex problems involving diverse parameters, as is the case here, and can also evolve with technology. Ensuring the continued growth of the Internet has obviously broad impact. The impact should, however, also extend to improving the engineering curriculum; in particular through examples illustrating the importance of interactions between economic factors and technology","title":"NetSE: Small: A Market Approach to Controlling the Proliferation of Internet Routes","awardID":"1347831","effectiveDate":"2013-06-30","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["564485"],"PO":["565090"]},"207159":{"abstract":"This grant will support a two-and-a-half-day long workshop on Computational Audition, bringing together top scientists from a broad range of disciplines. Computational audition, the study of how information can be derived from sound in both biological organisms and in machines, is an emerging field. The topic is broad, encompassing a diverse group of scientists including neuroscientists, psychologists, psychophysicists, speech scientists, computer scientists, and engineers. The field of computational audition has the potential to be a model of interdisciplinary research with a great deal of intrinsic intellectual interest. It is primed to become a hotbed of scientific growth, and this meeting will help the field evolve toward that goal.<br\/><br\/>Broader Impacts<br\/>Computational audition is important both for developing new technological applications as well as for finding new clinical treatments (because understanding the basis of normal hearing will help treat hearing impairment). And yet by comparison to many other related fields, its potential is underexplored. For instance, research on human and machine perception has been dominated to a large extent by vision, with hearing neglected by comparison. This workshop will nurture the development of interdisciplinary research in computational audition that will capitalize on this potential.","title":"Computational Audition Workshop","awardID":"1332234","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7704","name":"Science of Learning Activities"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[554697,554698,554699],"PO":["565215"]},"208810":{"abstract":"The April 15, 2013 Boston Marathon Bombing (BMB) is a fresh reminder that societies can be shocked not only by natural disasters such as earthquakes and hurricanes but also by acts of terrorism. The bombing engaged the public in multiple ways, and social media platforms (Twitter, YouTube, Facebook, etc.) enabled the public to become both informed and to some extent involved. Digital traces that can be collected from these sites present a brief window of opportunity for research on how, and to what extent, this involvement emerged. This RAPID project will collect data from social media such as Twitter and other linked sources to address questions about the flow of information about the event across traditional and social media, the propogation and amplification of unsubstantiated information and misinformation, differences between official and popular social media use, self-organization of efforts for assistance or suspect tracking and changes in public sentiment over time. Data from this event may reveal differences in the dynamics of social media use in the wake of terrorist events vs. natural disasters. <br\/><br\/>The intellectual merit of the proposed project is that it combines emerging methods and techniques for social media research with recent research on disaster response coordination and planning to develop a conceptual model of the BMB information flows to guide data collection and analysis. Because the Boston Marathon attracted participants from around the world, this bombing has a global dimension that may affect the nature and reach of the social media communications. <br\/><br\/>Broader impacts of the project include educational benefits from students involved in the project and in courses that will be informed by the project findings. The collected data will be made available to other researchers and the principal investigators plan to coordinate their work with others examining this event, thus contributing to the infrastructure for science. The proposal includes funding for dissemination of the results of preliminary analysis of the collected data. Results from analysis may offer an improved guide for research on communication and information flows in crises and disasters (whether natural or human-initiated), thus benefiting society.","title":"RAPID: Social Media: Learning from the Boston Marathon Bombing","awardID":"1342252","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[559720,559721],"PO":["565342"]},"199251":{"abstract":"While technology advances allow researchers to produce chips with higher performance and lower power consumption, our ability to deliver such computational power is challenged by the increasing susceptibility of silicon devices to faults. It is expected that in future computer systems, faults will occur in a continuous manner, across all levels from hardware to application. The fault behavior is furthermore expected to be more diverse and unpredictable. Of critical concern will be not only permanent and transient faults, but also intermittent faults that occur frequently and irregularly over nanosecond to second time scales.<br\/><br\/>These predicted high fault rates and diverse fault behaviors mandate a transformation in fault resilience approaches. When faults occur in a continuous manner, both fault detection and recovery must be performed in a much finer-grained manner, and recovery becomes as critical as detection. Moreover, since fault duration varies significantly, cost-effective solutions capable of uniformly detecting all types of faults, identifying the fault type, and then adaptively recovering the execution are necessary.<br\/><br\/>To address these reliability challenges, the proposed project will incorporate fine-grained adaptivity into the system, and couple statically extracted application information with runtime optimizations to guide adaptation decisions. The proposed research includes: (1) adaptive detection and checkpointing, capable of adjusting detection and checkpointing granularity to match system reliability levels; (2) adaptive recovery, capable of performing re-execution in a way that minimizes the chance of another fault occurring; and (3) adaptive resource management, capable of monitoring application and hardware reliability levels and quickly adapting scheduling decisions.","title":"CAREER: Adaptively Boosting Resilience Efficiency in the Face of Frequent, Clustered, and Diverse Faults","awardID":"1253733","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[534418],"PO":["565255"]},"199262":{"abstract":"This project develops the foundations of modeling, synthesis and development of verified medical device software and systems, from verified closed-loop models of the device and organ(s). The effort spans both implantable medical devices such as cardiac pacemakers and physiological control systems such as drug infusion pumps that have multiple networked medical systems. In both cases, the devices are physically connected to the body and exert direct control over the physiology and safety of the patient-in-the-loop. The goal is to ensure the device will never drive the patient into an unsafe state, while providing effective therapy. The contributions of are in three areas: closed-loop patient-device modeling; quantitative verification for optimized patient-specific devices; platforms for life-critical systems. Integrated modeling methodologies are developed to produce both the functional physiological signals, for clinically relevant testing with a medical device, and also generate the formal timing of device-patient interaction for formal verification. Starting with the problem of verifying the safety and correctness of medical device software, probabilistic patient models based on physiological data are then used to develop quantitative verification techniques to maintain the therapy?s efficacy on the patient and operational efficiency of the device. To facilitate participation of the CPS community, the Food and Drug Administration (FDA), physicians and manufacturers, open source libraries of device\/patient models, software tools for verification and model translation and hardware platforms for testing with real medical devices are developed.<br\/><br\/>The closed-loop design and verification techniques for medical device software and patients, developed here, have direct potential benefits on human health, and the quality and cost of medical care. Design of bug-free and safe medical device software is challenging, especially in complex implantable devices that control and actuate organs who's response is not fully understood. Safety recalls of pacemakers and implantable ?cardioverter? defibrillators between 1990 and 2000 affected over 600,000 devices. Of these, 200,000 or 41%, were due to firmware issues (i.e. software) that continue to increase in frequency. There is currently no formal methodology or open experimental platform to test and verify the correct operation of medical device software within the closed-loop context of the patient. If successful, this project has potential to not only increase the safety of such devices, but also to accelerate the development and certification process. The latter could reduce costs, and shorten the time to market for new devices. The project also has an extensive education and outreach component, including curriculum development in medical cyber-physical systems, involvement of undergraduate and graduate students in research, and cooperation with hospitals, makers of medical devices, and the FDA. The cross-cutting nature of the project brings together communities involving clinical physicians, electrical engineers, computer scientists and regulators of health care safety.","title":"CAREER: Medical Cyber-Physical Systems","awardID":"1253842","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[534440],"PO":["564778"]},"208689":{"abstract":"This project will support student travel to International Conferences on Computer Communications and Networks (ICCCN) to be held in Nassau Bahamas, on July 30-Aug 02, 2013. The conference will benefit students by exposing them to state of the art research in communications and networking areas","title":"Travel Grant Support for IEEE ICCCN 2013 Conference","awardID":"1341327","effectiveDate":"2013-06-15","expirationDate":"2015-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["559428",559428,559429],"PO":["565255"]},"207259":{"abstract":"By supporting graduate students to attend IEEE SECON 2013, this award will increase the dissemination<br\/>of the conference research results to a larger and a more diverse audience, which otherwise<br\/>would not have been able to attend. In so doing, this award will contribute to the strength<br\/>and inclusiveness of the research community, and will lead to the long-term health and vitalization<br\/>of SECON. In addition, by giving preference in grant awards to women and under-represented<br\/>students, it is hoped that it will increase the participation among these groups. By advertising to a wide<br\/>range of colleges and universities, participants from a more diverse set of institutions should<br\/>be able to attend and benefit from the conference. A broad and diverse population is key to<br\/>the health of the research community.<br\/><br\/>Conference attendance is a crucial part of the life of a researcher. By creating new opportunities<br\/>for students (especially those from under-represented groups) to attend a high-quality conference,<br\/>this project will benefit the research community in several ways. The students themselves<br\/>benefit from the opportunity to meet and interact with many other researchers in a favorable<br\/>setting, and from attending research presentations that may be related to their research areas.<br\/>The research community benefits from the improvement of the students in the pipeline, and<br\/>from the introduction of new researcher perspectives. Additionally, everybody benefits from<br\/>the increased diversity of participants attending the conference.","title":"Student Travel Grant Support for IEEE SECON 2013","awardID":"1332731","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[555021],"PO":["565303"]},"199295":{"abstract":"Faster computers have enabled advances in science, commerce and daily life. Unfortunately, computers have also become complex and more and more difficult to program efficiently. This trend threatens the sustainability of future advances. Perhaps, however, we can draw upon biologically inspired learning techniques to shed light into a new model of hybrid computers, a ``Programmable Smart Machine'', that inherently learns from its past behavior to automatically improve its performance without the burden of more complex programming. Specifically this work explores the addition of a smart memory to a computer that gives it the abilities to learn, store and exploit patterns in past execution to improve its performance.<br\/><br\/>Central to this work is the introduction of a new kind of global long-term machine learning based 'cache' that can be viewed as an auto-associative memory. The 'cache' is fed raw low-level traces of execution, from which it extracts and stores commonly occurring patterns that can be recognized and predicted. The core execution process is modified to send the trace to the 'cache' and to exploit its feedback to enact acceleration. The long-term goal is a system whose performance improves with the size and contents of the 'cache', which can be constructed with local associative memory devices and a shared online repository that is contributed to and leveraged by many systems. In this way a kind of shared computational history is naturally created and exploited.<br\/><br\/>This work experimentally explores questions with respect to concretizing the ``Programmable Smart Machine'' model. What are useful and tractable traces for detecting patterns in execution? Can current unsupervised deep learning techniques detect, store and recall useful patterns? How can the predictions from the machine learning based memory be utilized to automatically improve performance? How big does the machine learning based memory need to be to yield useful predictions and acceleration? This work explores these questions using simulation and controlled workload experiments to create complete traces including all instructions, register values, and I\/O events. Using the traces, at least two deep learning approaches will be evaluated with respect to the number and size of patterns they recognize. The resulting trained models will be integrated into the published auto-parallelization methodology that established preliminary results for this work. The simulation infrastructure, trace data and experimental results will be made publicly available to enable broader study.<br\/><br\/>This work produces unique trace data of computer operation. The PI has found that visual and audio presentations of the preliminary data reflect the kind of intuition that computer scientists develop about how computers work. This aspect will be leveraged to develop both a seminar, ``From Bits to Chess to Supercomputers'' and an associated<br\/>``Computing Intuition'' website that engages K-12 students with computing.","title":"CAREER: Programmable Smart Machines","awardID":"1254029","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["562065"],"PO":["565255"]},"199196":{"abstract":"The objective of the research is to innovate an embedded computing engine named ?Centaur? to achieve ultra-high power efficiency by adopting the bio-inspired computation model and the advanced memristor technology. <br\/>Three constituent elements are included to address the major technical obstacles: (1) The power-efficient hybrid computing system that integrates memristor-based synapse network and crossbar structure, targeting the flexible and intensive data processing, respectively. (2) The robust design methodology for Centaur, including the circuit and algorithm enhancements as well as the necessary EDA flow. (3) The integration of Centaur into modern heterogeneous systems and the prototype demonstration. Creative applications of critical importance to nowadays mobile and embedded systems by taking the full advantages of Centaur, including pattern recognition and video and image processing, will be also explored.<br\/>The research can benefit the embedded system community by the revolutions in computing architecture and hardware design for functional variety, power-efficiency, and cost. The results can further benefit the semiconductor and neuromorphic societies at large by stimulating the interaction between the advances in device engineering and computing models. The developed techniques will be transferred to mainstream practices under the close collaborations with several industry partners, and directly impact the future embedded systems. The activities in the collaboration also include the tutorials in the major conferences on the technical aspects of the projects and new course development. The educational plan will enhance the existing standard curricula by integrating new modules on emerging memristor-based computing architecture and the relevant neuromorphic computing model.","title":"CAREER: Centaur: A Bio-inspired Ultra Low-Power Hybrid Embedded Computing Engine Beyond One TeraFlops\/Watt","awardID":"1253424","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["556667"],"PO":["565255"]},"208767":{"abstract":"The International Workshop on Bio-Design Automation (IWBDA) brings together researchers from electronic design automation and synthetic biology. The goal of IWBDA is to make biology more easily, robustly, reliably, and predictably engineered and therefore, tackle challenges in biology and medicine, leading to advances in disease diagnosis, treatment and prevention. <br\/><br\/>Existing synthetic biology conferences and meetings do not explicitly focus on bridging the gap between the work of experimentalists and computational researchers. Bridging this divide is essential for the field of synthetic biology to fulfill its promise. Furthermore, other venues do not actively include the EDA community, which can bring a wide range of experiences, expertise, and perspectives to the design of novel biological systems.<br\/><br\/>IWBDA has been held successfully in 2009, 2010, 2011, and 2012 when it was co-located with the largest conference for EDA (the Design Automation Conference; DAC). DAC connected the IWBDA audience to the EDA community of over 10,000 academic and industrial participants. This year, IWBDA will be co-located with the BioBricks Foundation Synthetic Biology Conference Series, SB6.0, and will bring together researchers from the synthetic biology, systems biology, and design automation communities. IWBDA includes keynote and invited talks, tutorials, poster sessions, panel discussions, as well as dedicated time for informal discussions. <br\/><br\/>The intellectual merit of this workshop is a key strength. This workshop will provide a venue for between twelve and fifteen technical talks, four invited lectures, ten to twenty posters, and include an industry\/academic panel session. Topics will be diverse and include areas such as: Parts and Standardization, Biological Circuit Simulators, Biological Circuit Design, CAD Tools for Synthetic Biology and Gene Network Reconstruction. No other such workshop exists in Synthetic Biology\/EDA.<br\/><br\/>The broader impacts of IWBDA are numerous. A wide variety of researchers (120+) from EDA and synthetic biology will be brought together in a unique context which does not exist elsewhere. IWBDA will capture and make public the slides, posters, and abstracts from the session. In addition, IWBDA will create a user survey which is used to learn more about how workshops like this can better serve the community. Finally, this conference will also have numerous undergraduate, graduate and post graduate student researchers in attendance. IWBDA encourages and supports woman and underrepresented minority student participation and has a diverse technical program and executive committees.","title":"International Workshop on BioDesign Automation (IWBDA)","awardID":"1342046","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["563773"],"PO":["565223"]},"208679":{"abstract":"The International Conference on Machine Learning (ICML) is the permier conference in Machine Learning. ICML encompasses topics on all facets of Machine Learning, and solicits papers on problem areas, research topics, learning paradigms, and approaches to evaluation. In addition to rigorously refereed conference papers, it features poster sessions, tutorials, workshops and invited talks. This award provides funds for travel scholarships for students from US institutions to help cover their travel and costs of attending the conference. The selection of students to be funded is based on a review by the selection committee of their financial needs and alignment of research areas. The student scholarships are very important for encouraging student participation in this premier conference and for shaping the future of the field as a whole. Special attention will be paid to broadening the participation of students from groups that are traditionally underrepresented in Computer Science in general and Machine Learning research in particular and students from institutions with limited Machine Learning expertise who would benefit from the opportunity to interact with researchers from around the world.<br\/><br\/>Attendance at the ICML represents a unique opportunity for students interested in Machine Learning research. The poster sessions at the conference are designed enable students to recieve feedback from leading Machine Learning researchers from around the world and to help them become part of the larger Machine Learning research community. The award contributes to the education and training of the next generation of researchers and educators in an increasingly important area. It also helps broaden the participation of underrepresented groups and women in Machine Learning research.","title":"30th International Conference on Machine Learning (ICML 2013)","awardID":"1341268","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[559402,559403],"PO":["565136"]},"199153":{"abstract":"Billions of people depend daily on software systems built on top of slowly changing operating systems, programming languages, and library interfaces. A unifying theme of this infrastructure, from operating systems to Web browsers, is the use of nested sandboxes, involving multiple levels of abstraction, with complete mediation of resource accesses within and across levels. That is, as a program runs, several layers of abstraction are checking all resource accesses for conformance to security and isolation policies. This run-time checking imposes substantial overhead and is also quite inflexible. Often some sandbox layer is fundamentally incompatible with a new programming technique that could bring improved performance, security, etc. We will study how the Bedrock system may be used to replace restrictive run-time policy enforcement with open-ended compile-time policy enforcement, by requiring programmers to distribute code with formal mathematical proofs of policy conformance. As a concrete case study, we will implement a platform to replace today's common combinations of cloud hosting and Web browsers, providing a similar application experience to end users while giving programmers much more flexibility. To educate the future users of our tools, we will also develop an online tutor program suitable for use in introductory discrete math and logic classes, giving students instant feedback on the validity of their rigorous proofs.<br\/><br\/>The theoretical foundation of Bedrock, a Coq library, is higher-order separation logic for assembly languages. Several past projects have demonstrated how proofs in such logics may be carried out using proof assistants. Bedrock is distinguished by providing tools for mostly automated proofs, where the programmer provides help to the verifier through loop invariants and a few other types of annotation. We will continue improving this automation support to lower the human cost of verification further, while also investigating ways to broaden Bedrock's domain, such as to multi-core programs. We also intend to investigate the new semantic idea of phantom monitors, which allow Bedrock programs to spawn arbitrary automata (defined with their transition relations in Coq) that watch all program behavior and may veto actions that violate some policy. This is a compile time-only feature to support effective specifications, and we hope to use it as a unifying framework for specifying the interfaces between components in our proof-of-concept distributed application platform.","title":"CAREER: A Formal Verification Platform Focused on Programmer Productivity","awardID":"1253229","effectiveDate":"2013-06-01","expirationDate":"2018-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":[534221],"PO":["564588"]},"202233":{"abstract":"Surface haptics is the creation of programmable haptic effects on physical surfaces such as touch screens and touch pads. Unlike traditional force feedback devices that require the operator to grasp an end effector, surface haptic devices must provide feedback directly to the fingertips. With the dramatic rise of touch screen interfaces in recent years, many approaches to surface haptics have been explored, including vibrotactile, shape morphing, and variable friction. The PI and his team have pioneered an approach in which the surface generates controlled shear forces on each fingertip. Force Feedback for Fingertips (F3), gives fingertips the opportunity to interact with physics-based virtual environments, much like force feedback devices enable the whole hand to do. With F3, fingers can interact with virtual objects that have mass, stiffness and damping as well as more complicated dynamics (e.g., collisions, mechanisms, and force fields). By coordinating haptic effects at multiple fingertips, even more compelling illusions can be generated.<br\/><br\/>The technology, underlying science, and application of F3 are, however, still in their infancy. F3 works by coupling lateral vibrations to some form of rectification. For example, one approach involves high-frequency lateral vibrations of the surface synchronized with a friction reduction effect, resulting in a slip-push transition at each oscillation. The friction is modulated by means of electrostatic forces or acoustical stimulation. Current approaches work at ultrasonic frequencies, but little is known about the mechanical or electrical behavior of fingertips at these frequencies, or how energy transfer from a surface to the finger can be optimized.<br\/><br\/>This research will produce new knowledge in three main areas: the physical underpinnings of F3, device design and interaction design. First, both tribological and acoustic measurements will be made to elucidate the mechanisms by which shear forces are generated. A high-bandwidth tribometer and optical imaging system will allow friction to be studied, and a custom-built exciter will allow the propagation of acoustic energy in the fingertip to be studied. Laser Doppler vibrometry will be used to measure surface wave propagation while magnetic resonance elastography will be used to study shear wave propagation within the subcutaneous tissues. Fractional calculus and finite element techniques will then be used to build biologically plausible models of fingertip tribology and mechanics that match the data. Second, a new generation of high-performance F3 devices will be developed. Armed with good models, it will be possible to design impedance-matched devices so that force production is maximized and energy wastage is minimized. Additionally, these new devices will provide control over the force vector at each of multiple fingertip locations. Thirdly, novel multi-finger interactions will be designed. The key idea is that sophisticated percepts, such as \"objects\" that can be grasped and that feel as though they are moving relative to the surface, can emerge from properly coordinated fingertip forces due to Gestalt-like grouping principles.<br\/><br\/>Broader Impacts: Historically, the PI and his team have had greatest impact when providing technology to and collaborating with colleagues in human-computer interaction. Inspired by this, an open source F3 kit will be developed and shared. In addition, undergraduate and high school students will participate in the research, developing software routines and sample applications for the open source kit. Finally, the kit will be integrated with two pedagogical innovations already implemented by the investigators: flipped classrooms and portable laboratories.","title":"HCC: Medium: Collaborative Research: Force Feedback for Fingertips","awardID":"1302422","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[541975,541976],"PO":["565227"]},"202244":{"abstract":"Surface haptics is the creation of programmable haptic effects on physical surfaces such as touch screens and touch pads. Unlike traditional force feedback devices that require the operator to grasp an end effector, surface haptic devices must provide feedback directly to the fingertips. With the dramatic rise of touch screen interfaces in recent years, many approaches to surface haptics have been explored, including vibrotactile, shape morphing, and variable friction. The PI and his team have pioneered an approach in which the surface generates controlled shear forces on each fingertip. Force Feedback for Fingertips (F3), gives fingertips the opportunity to interact with physics-based virtual environments, much like force feedback devices enable the whole hand to do. With F3, fingers can interact with virtual objects that have mass, stiffness and damping as well as more complicated dynamics (e.g., collisions, mechanisms, and force fields). By coordinating haptic effects at multiple fingertips, even more compelling illusions can be generated.<br\/><br\/>The technology, underlying science, and application of F3 are, however, still in their infancy. F3 works by coupling lateral vibrations to some form of rectification. For example, one approach involves high-frequency lateral vibrations of the surface synchronized with a friction reduction effect, resulting in a slip-push transition at each oscillation. The friction is modulated by means of electrostatic forces or acoustical stimulation. Current approaches work at ultrasonic frequencies, but little is known about the mechanical or electrical behavior of fingertips at these frequencies, or how energy transfer from a surface to the finger can be optimized.<br\/><br\/>This research will produce new knowledge in three main areas: the physical underpinnings of F3, device design and interaction design. First, both tribological and acoustic measurements will be made to elucidate the mechanisms by which shear forces are generated. A high-bandwidth tribometer and optical imaging system will allow friction to be studied, and a custom-built exciter will allow the propagation of acoustic energy in the fingertip to be studied. Laser Doppler vibrometry will be used to measure surface wave propagation while magnetic resonance elastography will be used to study shear wave propagation within the subcutaneous tissues. Fractional calculus and finite element techniques will then be used to build biologically plausible models of fingertip tribology and mechanics that match the data. Second, a new generation of high-performance F3 devices will be developed. Armed with good models, it will be possible to design impedance-matched devices so that force production is maximized and energy wastage is minimized. Additionally, these new devices will provide control over the force vector at each of multiple fingertip locations. Thirdly, novel multi-finger interactions will be designed. The key idea is that sophisticated percepts, such as \"objects\" that can be grasped and that feel as though they are moving relative to the surface, can emerge from properly coordinated fingertip forces due to Gestalt-like grouping principles.<br\/><br\/>Broader Impacts: Historically, the PI and his team have had greatest impact when providing technology to and collaborating with colleagues in human-computer interaction. Inspired by this, an open source F3 kit will be developed and shared. In addition, undergraduate and high school students will participate in the research, developing software routines and sample applications for the open source kit. Finally, the kit will be integrated with two pedagogical innovations already implemented by the investigators: flipped classrooms and portable laboratories.","title":"HCC: Medium: Collaborative Research: Force Feedback for Fingertips","awardID":"1302517","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[542003,542004],"PO":["565227"]},"205545":{"abstract":"In the current era of information, large amounts of complex data are routinely generated across science and engineering. Geometric and topological data analysis is a major component involved in organizing, analyzing, as well as utilizing the huge amount of data generated. As data becomes more complex and high dimensional, it can be computationally formidable to compute and maintain even local structures from data. Hence it has become crucial to identify and use light-weight structures that can be efficiently computed, maintained and\/or manipulated; while at the same time are also sufficiently informative. <br\/><br\/>This project will focus on two such light-weight structures: the Reeb graph and the Gaussian-weighted graph Laplacian. Both of them have already been extensively used for various data analysis applications. Nevertheless, there are many theoretical and algorithmic questions about them that need to be addressed to better understand their behavior, their potential, as well as to further their practical usage. This project aims to address these issues, develop a solid theoretical foundation as well as efficient algorithms for their practical usage, and investigate novel geometric processing applications based on these two objects. <br\/><br\/>Data analysis is a fundamental problem in computational science, ubiquitous in a broad range of application fields in science and engineering. The intellectual value of this project lies not only in developing novel computational geometry algorithms and techniques, but also in transferring the results and insights to practical applications. Results from this project, especially algorithms and software, will be disseminated to a large scientific community so as to potentially produce a broader impact in scientific and engineering endeavors.","title":"AF: Small: Geometric Data Processing and Analysis via Light-weight Structures","awardID":"1319406","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":[550392],"PO":["565157"]},"205666":{"abstract":"This award targets counting and sampling variants of a number of cut and path problems in several restricted graph classes including planar graphs, the 8-connected 2D grid, and the 3D grid. These graph classes are primarily motivated by applications in computer vision where several recent results renewed interest in the minimization variants of these problems. The importance of the corresponding counting and sampling variants stems from, among others, automated learning of the parameters of the underlying probabilistic models such as the Markov Random Field.<br\/><br\/>The proposed research builds on the PI's recent works on counting and sampling minimum (s,t)-cuts and minimum single-source-multi-sink cuts with connectivity priors, both in planar graphs. These problems are used in image segmentation applications and form an initial step towards the ultimate goal of computing the partition function for weighted cuts, i.e., the summation of the cut weights across all (s,t)-cuts; this quantity is essential for model parameter learning via the maximum likelihood principle. The PI will study a variety of cut and path problems that generalize the initial results from different perspectives. These include studying other connectivity priors, moving beyond planarity, and beyond minimum cuts and shortest paths.<br\/><br\/>The research will actively involve undergraduate and master students. Related educational materials are projected to annually impact over 600 students, about 10 of them from the National Technical Institute for the Deaf. In addition to standard dissemination venues like conferences and journals, the PI will also present the results at the annual Imagine RIT festival. This community outreach festival attracted about 35,000 visitors in 2012, many of them middle and high school students.","title":"AF: Small: Counting and Sampling Cuts and Paths in Planar and Lattice Graphs","awardID":"1319987","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":[550671],"PO":["565157"]},"208845":{"abstract":"The First Workshop on Modeling of Biological Systems (MoBS) focuses on computational methods and software tools for modeling and analysis of biological systems. It will bring together researchers from computational systems biology and design automation communities. The goal of MoBS is to create an environment where different types of researchers interact and start fruitful collaborations. Co-locating MoBS with Design Automation Conference (DAC) provides means to fulfill this goal. For biologists, this workshop is an opportunity to showcase their work to an entirely new audience and gain exposure to a new talent pool of potential postdocs and graduate students. For electronic design automation (EDA) experts, this workshop provides an excellent opportunity to explore challenges in biology and medical research, and recognize potential for new collaborations and novel applications of methods and techniques they are familiar with. Existing systems biology conferences and meetings do not actively include the EDA community, which can bring a wide range of experiences, expertise, and perspectives to the modeling and analysis of novel biological systems. MoBS allow the EDA community to interact with and learn from leaders in systems biology. A number of academic leaders in systems biology are featured speakers of MoBS. <br\/><br\/>This workshop will provide a venue for fifteen technical talks, among them four keynote talks, five invited lectures, and six contributed talks, as well as ten to fifteen posters. Topics of the workshop are diverse and include areas such as: biological network inference, CAD and visualization of biological systems, data-mining for bio and health-care systems, hybrid methods for bio-system simulation, bio-model validation and verification, sensitivity analysis for biological systems and much more. A wide variety of researchers from EDA and computational systems biology are brought together in a unique context, which is not provided at other conferences. The slides, posters, and abstracts from the workshop will be made public on the workshop website. Finally, MoBS will have numerous undergraduate, graduate and post graduate student researchers in attendance. The organizing committee encourages and supports woman and underrepresented minority student participation, and has planned a diverse technical program.","title":"Request for travel supplement: DAC Workshop on Modeling of Biological Systems (MoBS)","awardID":"1342590","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[559800],"PO":["565223"]},"205699":{"abstract":"Lattices are mathematical objects defined as the set of all integer combinations of some n linearly independent vectors in n-dimensional Euclidean space. For instance, the set of all integer points in n-dimensional Euclidean space forms a lattice. Lattices have attracted the attention of great mathematicians for over two centuries, and have an impressive number of applications in mathematics and computer science, from number theory and Diophantine approximation to complexity theory and cryptography. The award focuses on lattice-based cryptography, an area born in the late 90s, and that has since grown tremendously. Lattice-based cryptography offers what is possibly the only alternative to traditional number-theoretic cryptography such as RSA, and boasts strong provable security, conjectured security against quantum computers, practical and highly optimized implementations, amazing versatility leading to a remarkable number of applications, and more.<br\/><br\/>The broad goal of the award is to answer some of the main and most challenging open questions in the area of lattice-based cryptography. These include: Is lattice-based cryptography provably superior to traditional cryptography? Can we obtain better security proofs for lattice-based cryptography, such as proving hardness statements for ideal lattices? Progress on these questions should be possible using techniques from number theory. The award also addresses related questions regarding the computational complexity of lattice problems, such as the hardness of the so-called shortest vector problem. Finally, the award addresses a fundamental question in the geometry of lattices, progress on which should have applications to the rest of the goals of the award, as well as to the mathematical and computational study of lattices in general. Techniques used for closely related questions in convex geometry seem particularly promising.<br\/><br\/>In summary, in the event of progress in algorithmic number theory or advances in the implementation of quantum computers, lattice-based cryptography is most likely the best (and possibly even only) means for humanity to reclaim modern cryptography as used in nearly any aspect of our lives, including credit cards, online financial transactions, secure phone conversations, and lots more. The award will further our understanding of lattice-based cryptography, and will aim to bring it to the point at which it is ready to replace traditional cryptography.","title":"AF: Small: Computational Foundations of Lattices","awardID":"1320188","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}}],"PIcoPI":[550747],"PO":["565157"]},"208504":{"abstract":"This grant provides travel support for selected students attending the 8th SIGART\/AAAI Doctoral Consortium. AAAI (Association for the Advancement of Artificial Intelligence) is the major professional association for AI. At the Doctoral Consortium (DC), PhD students who are pursuing work on AI-related topics present their proposed research and receive feedback from a panel of established researchers, as well as from other student participants. This provides the students with invaluable exposure to outside perspectives on their work at a critical time in their research, and also enables them to explore their career objectives.","title":"Support for 18th SIGART\/AAAI Doctoral Consortium","awardID":"1340162","effectiveDate":"2013-06-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[558854],"PO":["565035"]},"208768":{"abstract":"This project supports the US Ignite Application Summit which will be held in Chicago, IL on June 24-26, 2013. US Ignite fosters development of next-generation applications to provide transformative public benefit. The applications focus on six national priorities: Education & Workforce Development, Energy, Health, Public Safety, Transportation, and Advanced Manufacturing. The inaugural US Ignite Application Summit will provide the first opportunity to bring together the community involved in US Ignite?s mission to share experiences, demonstrate successes, discuss barriers and difficulties, further engage industry and communities, and inspire students, academics, open source developers, and community leaders.<br\/><br\/>A significant part of the Application Summit will be the demonstration of NSF-funded applications. The Application Summit participants will demonstrate that advanced networking technologies such as software-defined networking, virtualized networks, gigabit to the end-user, and GENI racks have real applications in the US Ignite target sectors. The combination of technology demonstrations and other summit activities will: enlarge the community that is knowledgeable about and can apply next-gen technologies to public benefit applications; engage the non-academic community including industry labs, federal mission agencies, foundations, venture capitalists, entrepreneurs, open source developers, and students at-large; build a sense of community and common effort within US Ignite constituencies as they meet in role-based groups: cities, foundations, and testbeds, application developers, and technical coordination and tools; and obtain participant buy-in for the next year of US Ignite efforts to ensure resources are widely available and partnerships are coordinated to support development of more applications for public benefit.","title":"US Ignite 2013 Application Summit","awardID":"1342048","effectiveDate":"2013-06-15","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[559625],"PO":["564993"]},"205611":{"abstract":"The proposed research addresses the algorithmic complexity of very basic optimization tasks - network partitioning, solving linear equations, satisfying logical formulas, and other constraint satisfaction problems (CSPs). Previous research on these kinds of problems suggested the existence of either very efficient algorithms yielding solutions of a certain quality, or very inefficient algorithms achieving perfect quality. However recent research, including a newly evolving algorithmic technique called the \"SOS method\", suggests the possibility of a nontrivial tradeoff between efficiency and quality. Specifically, the work has the following three technical goals:<br\/>1. Further understand the power and the limitations of the SOS Method.<br\/>2. Improve the known NP-hardness results for CSPs, with an emphasis on giving evidence against subexponential-time algorithms.<br\/>3. Find new random families of CSP instances - especially \"Small-Set Expansion\" or \"Unique Games\" instances - which seem algorithmically difficult.<br\/><br\/>The research will ultimately have broad impact on the practice of algorithms; more specifically, on developing (and ruling out) truly efficient heuristics for solving constraint satisfaction problems. It is also possible that the research on finding new families of hard-seeming CSP instances may lead to advances in cryptography.","title":"AF: Small: CSPs --- Approximability versus Time","awardID":"1319743","effectiveDate":"2013-06-01","expirationDate":"2016-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}}],"PIcoPI":[550547],"PO":["565157"]}}