{"208989":{"abstract":"Network densification - where a multitude of base-stations and access points with overlapping wireless footprints and disparate capabilities pervade the physical domain - is the way forward towards meeting the tremendous demand for mobile data. The main objective of this project is to reevaluate the manner in which wireless networks are engineered and spectrum usage is managed so as to exploit dense access infrastructure. The project is expected to make contributions in three areas: 1) Design, analysis and prototyping of communications and network protocols to enable unprecedented fine grain control over transmissions over shared spectrum without requiring high coordination overheads, by leveraging emerging agile access techniques; 2) Design and analysis of novel, simple and sparse-state algorithms that leverage the large flexibility in such systems to achieve near-optimal resource allocations; 3) Modeling and analysis of extreme dense wireless networks using mean field games to both evaluate the performance of resource sharing between providers in this regime, as well as evaluate economic and policy incentives to deploy a range of contractual structures.<br\/><br\/>The proposed research activity relies heavily on the development of sound theory and analysis of extremely dense networks, algorithmic development, simulation for large-scale systems and finally prototyping small-scale regimes. The research will serve as a catalyst towards changing traditional wireless networking paradigm, from one where infrastructure points connect to many mobiles, to one where a mobile connects to a large number of infrastructure nodes. The research will be disseminated broadly to researchers, practitioners and policy makers, leveraging in particular, a strong industry focused research center, as well as in efforts reaching out to public high school students, parents and teachers.","title":"Collaborative Research: Extreme Densification of Wireless Networks","awardID":"1343253","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560159],"PO":["557315"]},"209968":{"abstract":"The visual appearance of the world around us is the result of complex light interactions between different surfaces and material properties that comprise a scene. Despite staggering advances in data-driven appearance modeling, the creation of accurate models of large environments remains an open problem. The reliance of most current appearance modeling methods on active lighting to probe different slices of a scene's appearance precludes their use in environments where there is limited or no control over the incident ambient lighting. Furthermore, to facilitate calibration, many appearance modeling techniques estimate the appearance of a scene from a fixed vantage point, excluding scenes too large to fit in a single view with sufficient detail. In this research, the PI will investigate two novel appearance modeling paradigms designed expressly for large-scale environments under uncontrolled ambient lighting: appearance-from-motion and appearance-by-similarity. The former exploits relations between observations from different viewpoints to infer the full reflectance behavior, while the latter seeks to identify the best match from a library of pre-existing appearance instances to a possibly under-constrained set of observations. To support these two paradigms, a novel appearance model will be developed that builds upon our intuitions regarding scene appearance. The work will focus on two common types of input: community photo-collections and targeted video sequences.<br\/><br\/>Broader Impacts: This research will pave the way towards practical techniques for in-situ appearance modeling of large-scale environments, while stimulating new research in computer vision and in data-driven appearance modeling in computer graphics by answering fundamental questions as to whether we can model appearance from motion and\/or by exploiting similarity. The project will have far-reaching impact not only on computer science but also on diverse fields ranging from metropolitan planning to cultural heritage to entertainment. The ability to model existing environments will be beneficial to various security and safety training programs (for example, virtual fire drill simulations of existing buildings and sites could help train and prepare firefighters and first responders). The emerging field of virtual reality therapy will also benefit from this research, by making it easier to create digital models of large-scale environments (so that, for example, patients who have suffered a stroke can practice motor rehabilitation skills in virtual reproductions of environments they encounter in their daily lives, while autistic children can train to improve their social interactions in virtual reproductions of places such as classrooms which they encounter in their daily lives).","title":"CAREER: Large-scale Appearance Modeling","awardID":"1350323","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562850],"PO":["565227"]},"210012":{"abstract":"In the current age of personal devices and online services, many \"why\" questions people ask are left unanswered. Questions such as \"why am I seeing this online ad?\", \"is my application sending my contact information to somewhere else?\", or \"why is my device not lasting even a day?\" are often raised but left unanswered.<br\/><br\/>The underlying issue of answering these questions is transparency. If a system is transparent, i.e., if a system provides detailed information that reveals its inner working, then we can start answering the \"why\" questions. For example, if an application or a platform reveals how the application behaves in regards to all the data read from contacts, we should be able to answer \"is my application sending my contact information to somewhere else?\".<br\/><br\/>To address the challenge of transparency, this project designs a suite of techniques and tools that provide greater transparency into how applications and platforms behave. Especially, this project focuses on three most pressing areas in personal devices and online services that desire transparency?personal data use, system behavior, and energy usage. For the transparency in personal data use, this project designs techniques to track personal data use across front-end smartphones and back-end data center systems. An automated instrumentation framework for smartphone provenance management and a service for managing provenance in data centers form the core of this functionality. For the transparency in system behavior, this project designs a tracing framework for the Android platform. Our design is tailored to the needs for mobile tracing such as holistic tracing of both applications and the platform as well as instrumentation customization for performance and energy. For the transparency in energy usage, this project designs an activity-based energy usage monitoring tool for personal devices. This tool raises the level of abstraction to user activities, providing user-centric transparency for energy usage.<br\/><br\/>This project provides a unique opportunity that can advance the state-of-the-art in multiple domains---applications for personal devices, data center systems, personal device platforms, mobile program and platform instrumentation, and data provenance management---with a focus on transparency. If successful, this research will benefit users, developers, researchers, and providers of personal devices and online services. The results will be disseminated through publications, open-source software, and real deployment.","title":"CAREER: Systems for Transparency in Personal Devices and Services","awardID":"1350883","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[562939],"PO":["565319"]},"210254":{"abstract":"This project will assess the effectiveness of live fitness sessions broadcast via gigabit networking. Participation in regular group fitness programs and access to personal trainers is a way to improve the health of individuals, thus increasing lifespans and reducing the overall cost of healthcare. Significant challenges exist in the participation in regular fitness programs including cost, time and geography. There are over 251,000 registered fitness trainers in the USA which deliver group fitness and personal training programs at their local health clubs on a daily basis. This proposal seeks to explore the effectiveness of live broadcast fitness via gigabit networking and the impact of varying the video fidelity. The study will utilize the KinectHealth software application, GENI racks and the OpenFlow networking protocol. Kinect Health 3D was a Bronze price winner in the recent MozillaIgnite competition. <br\/><br\/>Obesity and its consequent diseases is a national problem that is a significant component of rising health-care expenditures. Exercise and even modest exercise-driven weight loss can significantly lower fasting blood sugar, improve glucose tolerance, and reduce blood triglyceride levels. This project will explore a network-mediated method of encouraging and facilitating regular exercise and will document its associated bandwidth requirements.","title":"EAGER: US Ignite: FitGENI - The Impact of Video Fidelity on Fitness Efficacy","awardID":"1353831","effectiveDate":"2014-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[563461,563462,563463],"PO":["564993"]},"210034":{"abstract":"Crowdsourcing systems typically draw on the work of non-experts, as expert crowds are difficult to gather and coordinate. To extend the reach of crowdsourcing, this project investigates interactive systems, platforms and computational techniques to integrate experts as core participants of crowdsourcing systems. The project will develop and evaluate three related systems that improve the coordination, participation and education of expert crowds. First, the project will develop modular, composable workflows to guide paid expert crowds to accomplish complex tasks such as design and engineering. A second system seeks to attract a new form of expert participation by reaching out to experts in their spare moments. A final system will enable crowd workers to learn new skills by leveraging existing tasks as work-study opportunities. This research will produce three concrete types of results: 1) techniques and patterns for guiding expert crowds and their contributions, 2) scientific results and evaluations that depict the strengths and weaknesses of expert crowds, and 3) open, public platforms and systems to recruit, guide, and train members of expert crowds.<br\/><br\/>Crowd work has the potential to employ millions of full-time workers and grant them the flexibility to guide their own careers. The proposed work advances a vision of how experts can engage in the future crowd-work economy, contribute to projects while improving their own skills, and be supported by practical knowledge and new sociotechnical systems. The project also includes a plan to use expert work-study techniques to provide realistic training in Stanford?s HCI curricula and develop a peer mentoring system to scale advising and informal learning.","title":"CAREER: Enabling expert crowdsourcing via coordination, targeted contribution and education","awardID":"1351131","effectiveDate":"2014-01-01","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562985],"PO":["565342"]},"209969":{"abstract":"In spite of significant recent advances 3D computer graphics are still humbled when confronted with medical-grade requirements, so medical illustrators often continue to rely on 2D hand drawing. A fundamental challenge is that detailed geometric models and advanced nonlinear materials increase computational complexity, making them difficult to apply in real-time interactive applications. In this research, the PI will investigate an alternative approach based on geometric shape deformations rather than the processes which created them. He argues that intuitive shape deformation can be facilitated by guarantees of basic geometric properties such as smoothness and injectivity (no self-intersection). The key is to design algorithms that can do this quickly while providing the user with a small yet expressive set of adjustable controls to ensure an efficient interactive experience; the task of shape deformation techniques is to extrapolate this parsimonious, human manageable set of input controls into a full-scale 3D deformation field in a natural and predictable way. The PI's hypothesis is that this requirement can be formally expressed in terms of basic geometric properties. To this end, the PI will explore both direct (closed-form) and variational methods, because while direct methods excel in speed variational methods offer stronger guarantees and advanced geometric properties. In terms of direct methods, the PI will develop new ways to quickly blend certain groups of 3D transformations (e.g., with the help of new geometric algebraic structures). Transformation blending will be complemented by advanced influence weights that allow the user to explicitly control the resulting sparseness. In terms of variational methods, the PI will study deformation energies satisfying traditional properties such as rotation invariance but augmented with higher-order continuity and injectivity; here, the main challenge will be to find efficient numerical solutions for the underlying optimization problems. The PI believes it will prove possible to mitigate the inherent computational complexity of variational methods by suitably combining them with direct methods so as to cast some of the variational problems as convex optimizations, thereby opening the door to highly efficient convex solvers.<br\/><br\/>Broader Impacts: Shape deformation is relevant to architecture, computer aided design (CAD), and many areas of science and engineering, as well as to the entertainment industry. But this project has primarily been motivated by medical applications, inspired by requests from the PI's collaborators at The Children's Hospital of Philadelphia. Given the right tools, the classical field of hand drawn medical illustration will evolve into 3D animated medical atlases, setting new standards in medical education. Shape deformation techniques could ultimately contribute to clinical praxis, by facilitating diagnosis and pre-operative planning when treating conditions such as pathological skull deformities (craniosynostosis). And shape modeling tools in expert hands could help lower the radiation dose required in CT scanning, by applying new reconstruction methods that combine user input with template models and accurate surface scans (obtained with radiation-free methods such as laser scanning). The PI also will organize seminars and courses that bring together medical and engineering students, including members of underrepresented groups, thereby promoting interdisciplinary collaboration in both research and education.","title":"CAREER: Geometric Shape Deformation with Applications in Medicine","awardID":"1350330","effectiveDate":"2014-01-01","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562852],"PO":["565227"]},"210860":{"abstract":"Shannon's masterpiece, A Mathematical Theory of Communication (1948), is one of the most influential works in the history of communications. In this seminal work, Shannon characterized the fundamental limit for reliable communication over point-to-point channels and provided the architectural system design for achieving it. Extending this theory to network setting has been one of the greatest challenges in information theory over the past few decades. Progress in this area is expected to produce significant breakthrough in the design of distributed wireless networks of the future, such as ad-hoc networks. So far, most research efforts have approached this problem using the same generality and accuracy used by Shannon for point-to-point channels. However, meeting such a standard has proven to be extremely difficult, to the extent that the capacity of most basic networks is still unknown.<br\/><br\/>This research overcomes the limitations of prior work by presenting a new approach, which is based on changing the focus to seek approximate solutions accompanied by guarantees on the gap to optimality. At the heart of this approach is the development of simple, deterministic channel models that capture the main features of the wireless medium, and are utilized to approximate more complex models. Building on recent results of the PI, the work develops a unified framework to utilize this powerful approach to 1) approximate the capacity of wireless networks; 2) study the impact of incomplete network knowledge on the capacity; 3) design protocols that are robust against adversaries; and 4) utilize recent physical layer coding techniques for cross-layer protocol design. The project also includes significant outreach program to women and under-represented minorities in the form of presenting tutorials and organizing workshops.","title":"CAREER: Breaking the Barriers in Wireless Network Information Theory: A Deterministic Approach","awardID":"1408639","effectiveDate":"2014-01-01","expirationDate":"2015-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["565302"],"PO":["564924"]},"208319":{"abstract":"Marquette University, in collaboration with the University of Wisconsin La Crosse, proposes the PUMP-CS Project (Preparing the Upper Midwest for Principles of Computer Science). PUMP-CS will provide a two-track professional development (PD) sequence for endorsing in-service and pre-service teachers--regardless of their prior CS-specific knowledge--to teach the Exploring Computer Science (ECS) or Computer Science Principles (AP CSP) curricula in their classrooms. The first track prepares in-service teachers to lead 9th- or 10th-grade level ECS, which integrates an inquiry- and equity-based pedagogy to convey solid CS content while appealing to a more diverse student population than traditional CS offerings. The second track includes a methods course, Teaching Computer Science (TCS), which enables both pre-service and in-service teachers to add a CS-specific endorsement to their primary certification, while continuing to promote pedagogical reform. This CS methods course is a \"missing link\" preventing teachers from earning the CS endorsement required to teach a course with more than 25% programming content, (e.g. AP CS or CSP). The planned hybrid\/online format for TCS will allow remote teachers in \"density-challenged\" regions to participate in a supportive learning community as they master the content and methods required. The project team includes members from universities, the Wisconsin-Dairyland chapter of the Computer Science Teachers Association (CSTA), officials from the Department of Public Instruction (DPI), and teachers and administrators from districts across the state. Collectively, they have the diverse institutional knowledge necessary to drive change in state licensure and curriculum standards, to match college-level courses at key universities to the STEM student pipeline, to promote new content and structure for CS teacher preparation, and to rigorously assess the results of this large-scale intervention on teacher education and student learning. This proposed work will lead to regional, sustainable institutional change to improve CS education, and scalable teacher preparation materials ready for other institutions to adopt, and its careful assessment will explore deeper questions of when and how CS teacher preparation can be most effective, and how those lessons can be leveraged in other STEM teaching fields.","title":"CS 10K: Collaborative Research: Priming the PUMP - Preparing the Upper Midwest for Principles of Computer Science","awardID":"1339179","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558254],"PO":["561855"]},"210772":{"abstract":"The bombing attacks at the Boston Marathon in April 2013 presented the law enforcement community with significant challenges in terms of the volume and variety of video and still images acquired in the course of the investigation. Tens of thousands of individual media files in multiple formats were submitted from a variety of sources. These sources included broadcast television feeds, private Close-Circuit Television (CCTV) systems, mobile device photographs and videos recovered from the scene, as well as photographs and videos submitted by the public. Teams of analysts reviewed this evidence using mostly manual processes to determine the sequence of events before and after the bombing, ultimately leading to a quick resolution of the case. In the aftermath, it has become evident that the proliferation of video and image recording devices in fixed and mobile devices make it inevitable that a similar situation will occur in future events. As a result, it is incumbent upon the law enforcement community and the U.S. Government at large to further explore the use of automated approaches, available today or in the coming years, to better organize and analyze such large volumes of multimedia data. The findings of this workshop will help define the future research agenda. <br\/><br\/>The problem of searching for actionable intelligence information from unconstrained images and videos is an unsolved problem. Solving this involves addressing many sub-problems such as video summarization, shot detection\/scene change detection, geo-tagging, robust face recognition, human action recognition, semantic description, image recognition and designing human in the loop systems. In addition, issues such as data collection and performance evaluation have to be addressed. Given that several hundreds of videos and a large collection of still images may be available for analysis, there is a great need to develop robust computer vision techniques. While many existing computer vision algorithms perform reasonable well in constrained acquisition conditions, their performance when unconstrained images and videos are given, is less than satisfactory. This workshop precisely addresses the challenges that arise in analyzing a large collection of unstructured image\/video collection. This workshop explores the state of the art in algorithms being developed in academia that can support forensic analysis and identification in large volumes of images and videos (e.g., multimedia). The workshop informs long- and near-term research and development efforts aimed at optimally addressing this situation in the future. The workshop identifies those video and image analysis problems which are: (1) Considered solved (i.e., ready to deploy in specific operational scenarios); (2) Nearly solved (i.e., could lead to solutions with one to three years of development); and (3) Over-the-Horizon problems (i.e., those challenges requiring concerted effort over the next 3-5 years and beyond).","title":"Workshop on Frontiers in Image and Video Analysis","awardID":"1402723","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[564721,564722],"PO":["565035"]},"205801":{"abstract":"The general vehicular networking system (VNS), where the vehicular ad hoc network (VANET) is integrated with hybrid electric vehicles (HEVs), enables a wide range of intelligent transportation system (ITS) applications. With different visions on VANETs, most of the existing studies provide case-specific solutions in an incoherent manner, which can hardly be integrated into an effective system. This project aims at developing a reliable, energy-efficient, and secure VNS with a synergetic approach through five complementary research tracks: infrastructure optimization, protocol design for reliable networking performance, energy-efficient VNS, security and privacy provisioning, and virtual-field testbed development. This project is expected to significantly advance the state of the art of VANET research by addressing some fundamental research issues. Analytical models are developed to study the road-side infrastructure deployment, networking protocols and control algorithms for optimal performance, considering the complex issues of mobility, interference, and data traffic dynamics. The throughput-optimal control in a multi-radio multi-channel context with dynamic network topology is studied to improve the throughput over a multi-hop vehicular network. Energy-efficient solutions are pursued by exploiting the interplay between the VNET and HEVs. Scalable security protocols with small computation and communication overhead are developed to provision security and privacy in VANET. <br\/><br\/>The proposed research seamlessly integrates research and education activities in the areas of optimization, probability and random process, graph theory, wireless networking, HEV technologies, as well as computer simulations. The research proposed in this project has a good potential to be transformed into practical protocols or control algorithms for VANETs.","title":"NeTS: Small: Collaborative Research: Towards Reliable, Energy-Efficient, and Secure Vehicular Networks","awardID":"1320736","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["549772"],"PO":["565303"]},"210862":{"abstract":"Wireless networks are the dominant medium through which people connect to the Internet, communicate, do business and access information. The ever-growing demand for higher data rates places the conventional approaches to network design under considerable stress. To meet this demand, future wireless networks are rapidly evolving towards high-density, user-deployed, heterogeneous infrastructure characterized by very high data rates at shorter communication range, with possibly harsh interference. In this context, multiple flow and multiple hop communication is expected to play an increasingly important role. Yet, current visions of how such networks should be designed are limited by the fact that the fundamental understanding of such novel communication paradigms is still in its infancy. <br\/><br\/>This research addresses key questions about multihop multiflow networks in the form of new ideas, insights and tools, with a transformative impact on the design of future networks. The project is organized into three symbiotic research thrusts on extensibility, side information and algorithms. In the extensibility thrust, the investigators develop a new understanding of the capacity of multihop multiflow networks of prototypical network models. The side information thrust moves beyond idealized model assumptions and incorporates imperfect or uncertain conditions at multiple spatial and temporal scales. The third thrust on algorithms translates the new key ideas developed in the first two thrusts into explicit coding and signal processing algorithms with polynomial complexity in the network size, for resource-efficient multiflow multihop communication. The research can broadly impact the wireless industry by generating new ideas that will power the design of future generations of wireless networks. The project also includes a dedicated educational plan to recruit and train under-represented minorities in this field.","title":"CIF: Medium: Collaborative Research: Multihop Multiflow Wireless Networks: A Treasure Hunt","awardID":"1408755","effectiveDate":"2014-01-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":["565302"],"PO":[564924]},"210994":{"abstract":"This is funding to support a Pioneers Workshop (doctoral consortium) of approximately 18 graduate students and post-docs (including about 12 U.S. participants) from diverse research communities (e.g., computer science and engineering, psychology, cognitive science, robotics, human factors, human-computer interaction design, and communications), along with distinguished research faculty. NSF funding will be used solely to cover travel, housing, and subsistence for eligible U.S. attendees. The event will take place on Monday, March 3, 2014, immediately preceding the Ninth International Conference on Human Robot Interaction (HRI 2014), to be held March 4-6 in Bielefeld, Germany, and which is jointly sponsored by ACM and IEEE. HRI is a single-track, highly selective annual international conference that seeks to showcase the very best inter- and multi-disciplinary research in human-robot interaction with roots in social psychology, cognitive science, HCI, human factors, artificial intelligence, robotics, organizational behavior, anthropology and many more, and invites broad participation. The theme of HRI 2014 is \"(E)Merging Perspectives\" which seeks to combine both user and system perspectives to advance new and possibly unorthodox methodologies. To extend the current singular approaches, this year's conference emphasizes papers that demonstrate the usage of novel empirical methods, the integration of empirical findings into complex robot systems, and holistic approaches in system evaluation. More information about the conference is available online at http:\/\/humanrobotinteraction.org\/2014. <br\/><br\/>The Pioneers Workshop is designed to complement the conference, by providing a forum for students and recent graduates in the field of HRI to share their current research with their peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference. During the workshop, participants will talk about the important upcoming research themes in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. To these ends, the workshop format will include oral presentations from 2 student attendees, poster presentations from all attendees, a hands-on meet-and-greet session, two alumni speakers, a keynote, and a panel presentation by senior researchers. The oral presentations and the interactive poster sessions will provide a forum for participants to share their research, enabling them to receive feedback on their work and to gain perspective on the field. The hands-on meet-and-greet session will involve networking and the cultivation of cross-disciplinary ideas. The alumni presentations will provide advice for short-term goals and a recent perspective on looking for jobs within the community. The keynote lecture will provide a global and future vision for HRI. The panel presentation will feature five senior HRI researchers from both academia and industry who will share insights about their own careers, answer career path questions, and provide insight into the interdisciplinary nature of the HRI community. The conversations between the panel and participants will continue over lunch and during dinner.<br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (including but not limited to computer science and engineering, psychology, robotics, human factors and ergonomics, and HCI). This is important for the field, because it has been recognized that transformative advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming years. Participants will also gain leadership and service experience, as the workshop is largely student organized and student led. The PI has expressed her strong commitment to recruiting women and members from under-represented groups. To further ensure diversity the event organizers will consider an applicant's potential to offer a fresh perspective and point of view with respect to HRI, and will limit the number of participants accepted from a particular institution to two, with one being a woman if two are accepted","title":"WORKSHOP: HRI 2014 Pioneers","awardID":"1418922","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565226],"PO":[565227]},"210016":{"abstract":"Information sharing between operators (agents) in critical infrastructure systems such as the Smart Grid is fundamental to reliable and sustained operation. The contention, however, between sharing data for system stability and reliability (utility) and withholding data for competitive advantage (privacy) has stymied data sharing in such systems, sometimes with catastrophic consequences. This motivates a data sharing framework that addresses the competitive interests and information leakage concerns of agents and enables timely and controlled information exchange.<br\/><br\/>This research develops a foundational approach to privacy-guaranteed information sharing among distributed self-interested agents in complex systems using information theory and game theory. This multidisciplinary project focuses on four mutually related challenges in multi-agent network abstractions of the Smart Grid: (1) characterization of the fundamental limits of distributed interaction with privacy constraints; (2) operational and practical significance of information-theoretic privacy measures; (3) formalizing the cost of privacy and the role of trust and repeated interactions for cooperation; and a direct application of these results via (4) distributed algorithms and protocols for privacy-guaranteed data sharing in the Smart Grid. The research has the broader implication of enabling information sharing in a variety of complex networks with strict privacy requirements including electronic healthcare and water distribution systems, and also engenders academic and industry collaborations in power systems. This research project incorporates carefully tailored outreach efforts including privacy awareness for middle- and high-school students, and active engagement of undergraduate and graduate students, especially females, in research.","title":"CAREER: Privacy-Guaranteed Distributed Interactions in Critical Infrastructure Networks","awardID":"1350914","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[562947],"PO":["564924"]},"211017":{"abstract":"This proposal outlines a Workshop for Aspiring PIs in Cyber-Physical Systems. The invitation-only workshop will take place over 1.5 days, and include early-career researchers with interests in cyber-physical systems who have not previously been funded by the NSF CPS solicitation but who have submitted proposals. <br\/><br\/>The workshop will help aspiring PIs understand what NSF (and importantly, the panels convened by NSF) are expecting to see in a successful CPS proposal. The workshop will include exciting talks by CPS program grantees as well as NSF CPS Program Officers, along with panel discussions with researchers as well as program officers. The agenda also plans significant time for discussions between aspiring PIs and panelists.<br\/><br\/>The workshop will enlarge the CPS research community. It will help early-stage researchers better understand CPS program goals, provide opportunities for interaction with program leadership, and result in significant improvement in the quality of CPS project ideas from the community and better alignment with program goals.","title":"Workshop for Aspiring PIs in Cyber-Physical Systems","awardID":"1419419","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7918","name":"CYBER-PHYSICAL SYSTEMS (CPS)"}}],"PIcoPI":[565273],"PO":[565274]},"211028":{"abstract":"Femto-aided cellular networks appear to be one the best solutions to achieve multi-fold capacity needed for future wireless networks. However, Femto-aided cellular systems have an information architecture that is very different from current planned and centrally managed cellular architecture. In this project, both the design of information architecture to acquire network state information and the optimal use of the resulting NSI will be addressed. The project is organized into three symbiotic research thrusts on network-aware physical-layer (PHY) coding schemes, network protocols and algorithms leveraging advanced PHYs, and their architectural prototypes. The first thrust utilizes recent innovations in deterministic models of wireless networks and develops novel physical-layer cooperative encoding and decoding schemes that operate with delayed, inconsistent, and erroneous NSI. The second thrust builds on the new physical-layer coding schemes to design network-scheduling algorithms to address performance issues. Finally, the third thrust utilizes the WARP programmable radios and studies implementation challenges of the protocols. The project goals of foundational design for Femto-aided cellular networks will have significant impact on industry practice. The PIs will facilitate technology transfer through their established industry affiliate program. A broad range of education and outreach activities will also complement the research agenda, including integration of research findings into the courses, promoting underrepresented and undergraduate populations, and engaging with the middle\/high school community to raise the level of interest in engineering and mathematics.","title":"NeTS: Medium: Collaborative Research: Information Architectures for Femto-Aided Cellular Networks","awardID":"1419632","effectiveDate":"2014-01-01","expirationDate":"2016-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[565302],"PO":[565303]},"210018":{"abstract":"As Internet services scale, their growing energy and carbon footprints present conflicting challenges. On one hand, services must keep energy costs low. On the other, they should make costly investments to undo environmental harm caused by their energy footprint. Carbon offsets are transferable certificates that undo greenhouse gas emission, even when offset holders are located in carbon-heavy regions, making them attractive to large-scale, geographically distributed services. This research project lays the foundation for greening services, a new class of Internet services that buy carbon offsets for user requests routed through their servers (i.e., a service that makes other services green). People who use popular large-scale services could undo their carbon footprint by simply routing their requests through a greening service. The greening service would manage costs.<br\/><br\/>The intellectual challenge for greening services is to model or confirm carbon footprints for servers outside of their control. The key insight is that emerging trends within cloud computing, e.g., energy-efficient servers, auto scaling, and open source software, provide uniformity. Dissimilarity between services, in terms of response times and energy footprints, is increasingly due to service-specific features. We use black-box machine learning approaches to infer these features.<br\/><br\/>Beyond greening services, the proposed research will help system managers identify performance bugs, especially costly bugs that shift energy consumption toward datacenters with high energy costs. As part of the proposed research, the PI will conduct outreach to underserved institutions and to local, Columbus, OH, area high schools.","title":"CAREER: Carbon Footprint Modeling and Elastic Caching for Greening Services","awardID":"1350941","effectiveDate":"2014-01-01","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["563444"],"PO":["565319"]},"210965":{"abstract":"The nascent Science of Security (SoS) seeks to develop the principles with which to understand how computing systems are architected, built, used, and maintained with a view to understanding and addressing security challenges systematically across their life cycle. The Symposium and Bootcamp on the Science of Security (HotSoS), held April 2014 in Raleigh, North Carolina, will help further research in the field. HotSoS is a follow-on to the NSF\/NSA-sponsored Science of Security Community meeting held in conjunction with the 2012 SaTC Principal Investigators Meeting. As this is the first year of HotSoS as a separate event, it is difficult to predict attendance, but the organizers are anticipating 150-200 people.<br\/><br\/>The goal of the travel grant program is to encourage participation in HotSoS by students who would normally find it difficult to attend. Availability of student travel grants is publicized through the website and announcements, with particular encouragement for women and underrepresented groups to apply. Preference for awards is given to full-time students with limited other means to support their participation, with priority given to students who are presenting papers at HotSoS.","title":"Student Support for Participation in the Symposium and Bootcamp on the Science of Security (HotSoS)","awardID":"1417325","effectiveDate":"2014-01-01","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[565158],"PO":["565327"]},"210713":{"abstract":"This award provides student travel support for the 19th Annual International Conference on Architecture Support for Programming Languages and Operating Systems (ASPLOS) to be held from March 1-5 2014, in Salt Lake City, Utah. ASPLOS is the premier conference for multidisciplinary systems research spanning computer architecture and hardware, programming languages and compilers, operating systems and networking, as well as applications and user interfaces. The importance of such cross-cutting research continues to grow as we grapple with the end of Dennard scaling, the explosion of big data, scales ranging from ultra-low power wearable devices to exascale parallel and cloud computers, the need for sustainability, and increasingly human-centered applications. ASPLOS embraces systems research that directly targets these new problems in new ways.<br\/><br\/>The NSF support ensures participation of US students while paying attention to underrepresented groups. To broaden participation, the grant is intended specifically to increase the numbers of students who cannot otherwise attend, that is, students who do not have any financial support whatsoever, e.g., from their advisors, departments, universities. The broader impacts include building international community and cooperation in the research areas of the conference, and enhancing education of students with exposure to and interaction with leading-edge research and researchers. This award will therefore help train the next generation of architects, operating systems builders and language designers in interdisciplinary integration of their respective skills.","title":"Travel support for ASPLOS 2014","awardID":"1400472","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[564587],"PO":[564588]},"210009":{"abstract":"Cloud data centers have become an important cyber-infrastructure vital to our society and economy, yet the virtualization infrastructure is prone to many reliability challenges. In a cloud, the virtualization infrastructure presents an abstraction layer on top of commodity hardware components and manages the execution of guest virtual machines (VMs). However, commodity computer systems are susceptible to hardware errors and expected to experience high error rates in the near future. Notably, a hardware error in a virtualized system can potentially result in a system crash, breaking the assumption of VM fault isolation. This reliability risk is further compounded by the massive scale of data centers hosting hundreds of thousands of servers as well as the pursuit of aggressive server consolidation that aims to host hundreds of VMs on each single server for high resource utilization. Traditional VM fault tolerant solutions are inadequate to address this challenge.<br\/><br\/>This research proposes a hardware error resilient virtualization infrastructure that provides high-performance virtualization during error free execution while offering strong protection against hardware errors. This research will advance our understanding of hardware error behaviors in virtualized environments and develop virtualization-aware techniques that provide robust error detection, recovery, and protection. The proposed hardware error resilient virtualization infrastructure will offer a low-cost full system solution by taking advantage of the characteristics of virtualized systems and providing resource management mechanisms for balanced performance and reliability.<br\/><br\/>The proposed virtualization infrastructure, if successful, will bring substantial benefits to cloud providers in delivering reliable services to millions of users. Education will also be an integral part of the project. This project will develop educational materials for the undergraduate and graduate curriculum, recruit and mentor under-represented students, and carry out a number of unique outreach activities that benefit K-12, undergraduate, and graduate students.","title":"CAREER: Hardware Error Resilient Virtualization Infrastructure","awardID":"1350766","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[562933],"PO":["565319"]},"210979":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for approximately 9 graduate students from U.S. universities, along with a panel of 3 distinguished research faculty as mentors. The event will take place in conjunction with and immediately preceding the 2014 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC), to be held July 28-August 1 in Melbourne, Australia, and sponsored by the IEEE Computer Society. This year marks the 30th anniversary of the Symposium. Established in 1984, VL\/HCC's mission is to support the design, formalization, implementation and evaluation of computing systems that are easier for a broader group of people to learn, use, and understand. This includes research aimed at visual technology and text, and technology that uses sound, taste, virtual reality, and the Web. It also includes research on theories about the many media used toward this goal. VL\/HCC occupies a unique niche among HCI and programming language conferences, in that it focuses specifically on how to help end users successfully develop and use software. Recent advances in computing have led to continually deeper integration between computers and human society. People now swim in a \"sea\" of socio-technical systems that synthesize large numbers of contributing users with vast amounts of source code. Examples include social media systems, open source repositories, online marketplaces and massively multiplayer online games. Yet as the socio-technical systems in this sea have grown in complexity, they have become increasingly difficult for end users to understand and direct toward productive ends. More information about the VL\/HCC Symposium may be found online at https:\/\/sites.google.com\/site\/vlhcc2014. <br\/><br\/>The primary goal of this year's VL\/HCC Doctoral Consortium, the twelfth to be funded by NSF in this series, is to stimulate graduate students' thinking about how to make computation easier to express, manipulate, and understand. In particular, what methods, models and tools can people use to visualize, analyze, tailor, and direct socio-technical systems? The doctoral consortium aims to stimulate novel approaches that go far beyond simplistic solutions like Web browsers and search engines. Although search engines do provide information that is useful in simple situations, they represent only one portion of a socio-technical system (information retrieval); search engines alone are not powerful enough to be used to start new businesses and run them competitively, for example, since they only give people the ability to find resources provided by other people rather than the ability to create new resources. Effective approaches will bring users and software together in creative and productive ways that bear directly on the needs of modern society. <br\/><br\/>The workshop will build community among young researchers working on different aspects of these problems from the perspectives of diverse fields including computer science, the social sciences, and education. It will guide the work of these new researchers by providing an opportunity for experts in the research field (as well as their peers) to give them advice, in that student participants will make formal presentations of their work during the workshop and will receive feedback from a faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether the results are appropriately analyzed and presented. As in prior years the VL\/HCC 2014 Doctoral Consortium will be part of the regular conference program. A 2-page extended abstract of each participant's work will be published in the conference proceedings. <br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other. The PI and the members of the organizing committee will make special efforts to attract a diverse and interdisciplinary group of student participants, with special attention paid to recruitment of students from underrepresented institutions and women; to further increase diversity, no more than 2 student participants (one of whom must be female if two are accepted) will be accepted from any one institution.","title":"WORKSHOP: VL\/HCC 2014 Graduate Consortium","awardID":"1418176","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[565193],"PO":["565227"]},"210528":{"abstract":"To reduce the ever-increasing power dissipation caused by high temperature in computing systems, current approaches seek to apply cooling mechanisms to remove heat aggressively, as well as devising management techniques to avoid thermal emergencies by slowing down heat generation. Complementary to existing techniques, this proposal attempts to address the heat management problem using a fundamentally different approach -- rather than removing the heat or slowing down heat generation, we transform this heat into reusable energy by using thermoelectric materials. A Thermal Energy Harvesting (TEHar) framework is proposed here that will allow heat energy generated by computing devices to be recovered, transformed, and harvested efficiently, to achieve better energy efficiency. TEHar is based on the interesting implication of thermal energy distribution of computing platforms: the temperature differences between the hottest and the coldest components can be more than tens of degrees, creating a steep spatial thermal gradient. We discover that, by leveraging the thermoelectric effects at the architectural level, the varying spatial thermal gradients created as a result of computations can be exploited to transform heat into reusable energy. Therefore, the heat generated by the circuitry of the computing devices is not wasted but is rather harvested for reuse. This research explores possibilities in thermal energy harvesting techniques at the architectural level. Overall, this proposal explores the potential for energy harvestability, particularly in the steep thermal gradients commonly observed in computing systems, while also investigating applications that can reuse this recovered energy.<br\/><br\/>The TEHar solution proposed here is anticipated to not only reduce cooling expenses and ambient temperatures, but also increase energy utilization, device lifetime, and physical space utilization. The TEHar technology developed here can be applied to a broad range of computing devices, large or small. If the research is successful, it has the potential of having a significant economic benefit as well as a significant, positive impact on the environment. <br\/><br\/>Furthermore, this energy harvesting research requires cross-disciplinary engagement in areas such as material engineering, VLSI architecture, system architecture, and mechanical engineering and will attract a diverse set of student researchers. Overall, the engineering and scientific contributions will also have important societal impacts, including the broadening of ASU's engineering curriculum, the engagement of graduate as well as undergraduate research activities, the potential of creating high-school or middle-school scientific projects, and the increased representation of target underrepresented minorities in science and engineering.","title":"EAGER: Characterization and Modeling for Architectural Thermal Energy Harvesting","awardID":"1358805","effectiveDate":"2014-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["565318"],"PO":["565319"]},"209170":{"abstract":"This INSPIRE award is partially funded by the Interdisciplinary Research Program in the Division of Civil, Mechanical and Manufacturing Innovation in the Directorate for Engineering, the Computer systems Research Program in the Division of Computer and Network Systems in the Directorate for Computer and Information Science and Engineering, and the Robust Intelligence Program in the Division of Information and Intelligent Systems in the Directorate for Computer and Information Science and Engineering.<br\/><br\/>Integrated circuits are produced in billion-dollar chip fabs, which require many months of processing to go from a design to a chip. The goal of this proposal is to accomplish that in an afternoon, with a table-top process. Rather than etching or depositing electronic materials, as is done today, it is based on assembling digital materials. These use a discrete set of components, reversibly joined in a discrete set of relative positions and orientations. Those attributes allow positions to be determined by the parts, errors in their placement to be detected and corrected, dissimilar materials to be joined, and them to be disassembled rather than disposed. A conducting and insulating part type will be used to replace multilayer printed circuit boards, connectors and cabling for three-dimensional interconnect, inductors and capacitors, striplines and antennas. A resistive part type will be added for producing passive components, semiconducting part types will be added for active components, and magnetic and flexural part types for electromechanical components.<br\/><br\/>This project will develop prototypes of the parts, the processes to produce them, the assemblers to place them, and the software tools to design with them. The research will progress in stages of size and complexity, reproducing the history of integrated electronics. First will be the equivalent of small-scale integration, using tens of parts with a 100 micron feature size. A test case at this level of integration will be assembling a radiofrequency matching network. Then will come medium-scale integration, using hundreds of parts with a 10 micron feature size. A goal here will be assembling a ring oscillator and binary counter. Finally, large-scale integration will use thousands of parts with a 1 micron feature size, with a goal of assembling a microprocessor. Computer-controlled manufacturing has progressed from subtractive to additive processes; this research roadmap will introduce the discrete assembly and disassembly of functional digital materials, to code the construction of complete systems in an integrated process.","title":"INSPIRE Track 1: Programming Digital Materials: Additive Assembly of Integrated Electronics","awardID":"1344222","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8078","name":"INSPIRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7484","name":"IIS SPECIAL PROJECTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7951","name":"ENG INTERDISC RES (IDR)"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"8013","name":"National Robotics Initiative"}}],"PIcoPI":[560692],"PO":["564949"]},"209171":{"abstract":"This INSPIRE award is partially funded by the Evolutionary Processes program in the Division of Environmental Biology in the Directorate for Biological Sciences, the Behavioral Systems program in the Division of Integrative Organismal Systems in the Directorate for Biological Sciences, and the Information Integration and Informatics program in the Division of Information & Intelligent Systems in the Directorate for Computer & Information Science & Engineering.<br\/><br\/>For millennia, humans have bred organisms to produce better food, clothes, and companionship. Recently, scientists have learned how to breed robots, evolving simulated creatures in virtual worlds, or physical robots in the real world. By combining the evolutionary process with robotic engineering, more complex and novel designs should be possible compared to traditional methods. In spite of the promise, so far evolved robots only do simple things like walk, navigate, or pick up objects. What limits progress is a lack of understanding of \"evolvability,\" the capacity of organisms (or robots) to change and become more complex. Understanding evolvability is the main goal of this project: researchers will borrow ideas from modern genetics so their robots mutate and develop in ways that are similar to how biological creatures do. In theory, this could produce simple robots that evolve into ever more complex, capable and useful robots.<br\/><br\/>Understanding how complexity evolves is central to the study of life, and may enable even non-specialists to automatically and continuously produce diverse kinds of machines. By linking complexity, genetics, and evolution, this project seeks to discover new principles that can be applied in science and industry. To help convert scientific principles into innovation drivers, online software will be created to show how to evolve virtual or physical robots; this will help students learn about engineering, biology, and how to apply both to technology. Finally, evolutionary robotics can be used to solve complex problems in robotic control that defy logical programming solutions, so this research can help companies that manufacture robots.","title":"INSPIRE Track 1: Is Evolvability Driven By Emergent Modularity? Biomimetic robots, gene inspired information structures, and the evolvability of intelligent agents","awardID":"1344227","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8078","name":"INSPIRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7378","name":"EVOLUTIONARY GENETICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7275","name":"CROSS-EF ACTIVITIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"7659","name":"ANIMAL BEHAVIOR"}}],"PIcoPI":[560694,560695,560696,560697,560698],"PO":["565123"]},"209152":{"abstract":"This project builds a novel privacy-preserving framework with both new algorithms and software tools to: 1) evaluate the effectiveness of current identifier-suppression techniques for Electronic Healthcare Record (EHR) data; 2) de-identify and anonymize EHR data to protect personal information without significantly reducing the utility of data for secondary data analysis. The proposed techniques eliminate the violation of privacy through re-identification, and facilitate the secondary usage, sharing, publishing and exchange of healthcare data without the risk of breaching protected health information (PHI). This new privacy-preserving framework injects the ICD-9-CM-aware constraint-based privacy-preserving techniques into EHRs to eliminate the threat of identifying an individual in the secondary use of research data. The proposed technique and development can be readily adapted to other types of healthcare databases in order to ensure privacy and prevent re-identification of published data. The project produces groundbreaking algorithms and tools for identifying privacy leakages and protecting personal privacy information in EHRs to improve healthcare data publishing. New privacy-preserving techniques developed in this project lead towards a new type of healthcare science for EHRs. The project also delivers fundamental advancements to engineering by showing how to integrate biomedical domain knowledge with a computationally advanced quantitative framework for preserving the privacy of published EHRs. HIPAA has established protocols and industry standards to protect the confidentiality of PHI. However, our results demonstrate that, even with regard to health data that meets HIPAA requirements, the risk of re-identification is not completely eliminated. By identifying the security vulnerabilities inherent in the HIPAA standards, our research develops a more rigorous security standard that greatly improves privacy protections by applying state-of-the-art algorithms.<br\/><br\/>The developed data privacy-preserving framework has significant implications for the future of US healthcare data publishing and related applications. Specifically, the transition from paper records to EHRs has accelerated significantly since the passage of the HITECH Act of 2009. The Act provides monetary incentives for the \"meaningful use\" of EHRs. As a result, the quality and quantity of healthcare databases has risen sharply, which has renewed the public's fear of a breach of privacy of their medical information. This research work is innovative and crucial not only for facilitating EHR data publishing, but also for enhancing the development and promotion of EHRs. At the educational front, this project facilitates the development of novel educational tools to construct entirely new courses and laboratory classes for healthcare, data privacy, data mining, and a wide range of applications. As a result, it enhances the current instructional methods for teaching data privacy and data mining, and has compelling biomedical and healthcare applications that can facilitate learning of computational algorithms. This project involves both undergraduate and graduate students in the three participating institutions. The PIs make a strong effort to engage minority graduate and undergraduate students in research activities in order to increase their exposure to cutting-edge research.","title":"SCH: EXP: Collaborative Research: Privacy-Preserving Framework for Publishing Electronic Healthcare Records","awardID":"1344152","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560636,560637],"PO":["565136"]},"209241":{"abstract":"Sleep is one of the key aspects of good health, along with a healthy diet and regular exercise. Computing researchers have recently worked to understand how systems can support nutrition and exercise, but sleep has been relatively under-studied despite its significant health benefits. The right amount of quality sleep can improve both physical and mental health and is associated with a lower risk for heart disease, diabetes, depression, and obesity. However, sleep disorders are often undiagnosed, and many people are unaware of how their activities or environments affect sleep. Ubiquitous computing has the opportunity to help through self-monitoring, awareness, and identification of strategies to promote healthy sleep behaviors.<br\/><br\/>This interdisciplinary research agenda will involve the design, development, and evaluation of novel ubiquitous computing approaches to support good sleep health and behaviors. This research will combine expertise in human-centered design, computer science, sleep medicine, and nursing. The researchers' previous formative work with target users and sleep experts has informed design requirements for technologies in this field. The work will focus on building on those results through three main activities. First, they will apply machine learning to model sleep patterns based on a person's smartphone usage to unobtrusively sense and predict sleep duration and timing. Then they will employ a human-centered design process to develop and study the feasibility and initial efficacy of two novel software tools to assist individuals in sensing, recording, and visualizing the behavioral (e.g., caffeine use, food intake) and environmental factors (e.g., noisy environment, light levels) that can disrupt their sleep. And then, they will develop and assess the feasibility and initial efficacy of a new technique and tool for assessing, modeling, and visualizing the impact of sleep deprivation on users' reaction time, cognitive functioning, and mood to help them prioritize sleep.<br\/><br\/>This research will bring into focus the domain of sleep as a new area for human-centered computing research. The design and evaluation of new applications for sleep will further knowledge of how technology can be designed for long-term health tracking and behavior change, and the designs and evaluations move beyond what is currently being addressed in industry. The technical contributions are novel approaches to monitoring sleep and an expansion of knowledge about how technologies can adapt to meet the unique health needs of different users. Finally, the research seeks to unite the fields of sleep research and computing research to develop solutions for better understanding and treating sleep disorders.<br\/><br\/>This work has the potential to significantly affect the lives of the estimated 40.6 million individuals in the U.S. with sleep disorders or sleep deprivation, which helps address a major public health issue. In addition, the economic cost of sleep deprivation has been estimated to be $63.8 billion per year. The research will have immediate impact by allowing free access to new behavior change technologies developed through this project. In addition, the research will also impact education by using sleep research as a means for attracting women and minorities to computing research and engaging students in interdisciplinary design teams through student projects and directed research groups.","title":"SCH: INT: Supporting Healthy Sleep Behaviors through Ubiquitous Computing","awardID":"1344613","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560939,560940,560941,560942],"PO":["565136"]},"209010":{"abstract":"Network densification - where a multitude of base-stations and access points with overlapping wireless footprints and disparate capabilities pervade the physical domain - is the way forward towards meeting the tremendous demand for mobile data. The main objective of this project is to reevaluate the manner in which wireless networks are engineered and spectrum usage is managed so as to exploit dense access infrastructure. The project is expected to make contributions in three areas: 1) Design, analysis and prototyping of communications and network protocols to enable unprecedented fine grain control over transmissions over shared spectrum without requiring high coordination overheads, by leveraging emerging agile access techniques; 2) Design and analysis of novel, simple and sparse-state algorithms that leverage the large flexibility in such systems to achieve near-optimal resource allocations; 3) Modeling and analysis of extreme dense wireless networks to both evaluate the performance of resource sharing between providers in this regime, as well as evaluate economic and policy incentives to deploy a range of contractual structures.<br\/><br\/>The proposed research activity relies heavily on the development of sound theory and analysis of extremely dense networks, algorithmic development, simulation for large-scale systems and finally prototyping small-scale regimes. The research will serve as a catalyst towards changing traditional wireless networking paradigm, from one where infrastructure points connect to many mobiles, to one where a mobile connects to a large number of infrastructure nodes. The research will be disseminated broadly to researchers, practitioners and policy makers, leveraging in particular, a strong industry focused research center, as well as in efforts reaching out to public high school students, parents and teachers.","title":"Collaborative Research: Extreme Densification of Wireless Networks","awardID":"1343383","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560221,560222,560223],"PO":["557315"]},"209186":{"abstract":"This INSPIRE award is partially funded by the Arctic Natural Sciences Program in the Division of Polar Programs in the Directorate for Geosciences, the Communications, Circuits and Sensing Systems Program in the Division of Electrical, Communications and Cyber Systems in the Directorate for Engineering,and the Division of Computer and network Systems in the Directorate for Computer and Information Science and Engineering. <br\/><br\/>The PIs propose to design and develop an integrated underwater acoustic sensor network for ice-covered<br\/>seas. It will transmit data wirelessly through acoustic waves from sub-surface ocean sensors to a receiving array with a surface connection to satellites and the Internet. The PIs will expand the limits and capabilities of underwater communication networks in the transition zone where sea ice changes from 1) smooth land-fast ice to 2) ridged mobile ice to 3) open water. This transition zone evolves in both time and space within the 30-50 km foot-print of the proposed networked sensor and communication network array. This goal requires integration of both existing knowledge from a set of diverse disciplines and intellectual innovations within each discipline. It will modify underwater communication network theory, coastal acoustic propagation and scattering, and experimental design of oceanography. Providing long-term, long-range acoustic connectivity, the PI team will address three major new research challenges: 1) Mid-frequency (1-5 kHz), mid-range (10 km) acoustic wave propagation in the transition zone; 2) Data telemetry in the new communication environment; and 3) Resilient sensor networks that cope with and harness complex dynamics of the transition zone. The multi-disciplinary team will implement reliable modem hardware, integrate it with resilient network protocol, and optimize the system design for Arctic deployment to support an ocean experiment off Thule, Greenland.<br\/><br\/>The sensor and communication network will support 1) long-term, intelligent distributed Arctic observing systems, 2) assimilation of remote-sensing and in-situ under-ice measurements, and 3) regional and global climate modeling with real-time measurements. Such a network holds the promise to revolutionize under-ice ocean sampling in polar regions. Data will be broadly disseminated via the web and archived for public access. Planned outreach includes participation in the field program of Greenlandic residents from the Inupiat village of Qaanaaq and meaningful classroom involvement from the elementary to community college levels. The PIs are also committed to outreach through their global print, radio, TV, and electronic media contacts.","title":"INSPIRE Track 1: Acoustic Sensor Networks for Ice-Covered Seas","awardID":"1344264","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8078","name":"INSPIRE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1403","name":"Division of ANTARCTIC SCIENCES DIVISION","abbr":"ANT"},"pgm":{"id":"5280","name":"ARCTIC NATURAL SCIENCES"}}],"PIcoPI":["564501",560746,560747,560748],"PO":["565325"]},"209133":{"abstract":"Asthma is a common lung disease with acute and chronic manifestations that impacts more than 22.2 million Americans or 7.9% of the population, including over 6.7 million children younger than 18 years of age. The cost of asthma is significant both for individuals and for the society as a whole. It is highly desirable to establish transformative technologies to improve the patient quality of life and reduce the cost of asthma management. The recent development in sensor and mobile computing technology provide great opportunities to establish Smart Asthma Management (SAM) systems and achieve a quantum leap in asthma management. Leveraging on the fast development of information infrastructure, patients can create a detailed temporal log recording their symptoms, medicine usage, and possibly vital physiological signals through an easy access to a website or their smart phones in SAM systems. This unprecedented continuous stream of patient-generated data in SAM systems provides us significant opportunities to better estimate patient condition and make clinical intervention decisions. However, since the information infrastructure of SAM has not become available until recently, very limited work is available for SAM systems. Against this background, this collaborative project aims to develop a suite of statistical modeling, monitoring, prognosis, and clinical intervention decision making methodologies based on a flexible yet rigorous multistate model to describe the evolving of patient conditions. The true underlying state of the patient is assumed unknown; however, there is reason to expect that it could be inferred from patient generated data such as the frequency of the rescue inhaler usage (the time and frequency of the rescue inhaler use is an important indicator of asthma control). <br\/><br\/>Some anticipated advances include: (i) Multistate model with event intensity function as observations. The proposed methodology brings the mixed effect model and the multistate model into a unified framework to integrate the population information embedded in the historical records of multiple patients and the individual information collected in real-time in a quantitative way. (ii) Stochastic filtering approach for individual patient condition modeling and updating. The novel state space formulation enables efficient stochastic filtering algorithms to estimate and update the states and parameters in the multistate model. (iii) Clinical intervention decision support for patients and clinicians. The salient features of the proposed policy are that it is based on a condition-based policy and incorporates uncertainties in the patient condition model through a Partially Observable Markov Decision Process (POMDP) framework which has been widely used and proven to be very effective in the management of industrial systems. Plans are in place to evaluate the effectiveness of the resulting technologies in collaboration with clinical experts. <br\/><br\/><br\/>The project is likely to contribute predictive technologies that could help reduce the cost and improve the quality of healthcare in the US, especially as it relates to effective management of chronic illnessess. Additional broader impacts of the project include enhanced research-based training opportunities for graduate and undergraduate students (including members of under-represented minorities) in healthcare engineering, statistics, and operation research; enrichment of the curricula in health systems in industrial engineering and operations research at the University of Wisconsin-Madison and the University of Iowa.","title":"SCH: EXP: Collaborative Research: Smart Asthma Management: Statistical modeling, prognostics, and intervention decision making","awardID":"1343969","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560579,560580],"PO":["560586"]},"209002":{"abstract":"A fundamental operation for users in cognitive radio networks (CRNs) to access the spectrum is channel rendezvous. After rendezvous is established, channel information exchange and propagation among users are also essential for efficient spectrum access. Existing studies on channel rendezvous in CRNs have limitations and are unsuitable for efficient access scenarios. Additional information about users can help generate intelligent designs in CRNs that can shorten spectrum access delay. However, due to practical constraints, such information is extremely difficult to obtain before rendezvous is established. Mining the social patterns of CR users (or secondary users, SUs) and intelligently utilizing the captured social information is a promising approach. The objective of this project is to design, analyze, and evaluate fast and efficient spectrum access schemes for CRNs without a common control channel. One unique feature of this work is the consideration of SU social patterns and the incorporation of social analysis to enhance spectrum access efficiency. The approach involves analyzing the time, location, and spectrum-dependent social patterns of SUs; identifying and addressing new challenges in channel rendezvous, security, and recommendation designs with the assistance of SU social analysis; and proactively utilizing social patterns of SUs for fully distributed fast and secure spectrum access design. <br\/><br\/>This project will have a significant impact on efficient spectrum access. Social analysis of users is a critical component to further enhance spectrum access efficiency and accelerate CRN deployment. This interdisciplinary research is potentially transformative as it will help generate innovative techniques to numerous CRN applications. It will also greatly enhance the understanding of social interactions of mobile users in wireless networks. This project provides an excellent opportunity for graduate and undergraduate research students to gain valuable educational training and research experiences. The research results will be presented at IEEE\/ACM journals and international conferences.","title":"EARS: Accelerating Spectrum Access in Cognitive Radio Networks via Social Analysis of Secondary Users","awardID":"1343355","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560196,"251870",560198],"PO":["565303"]},"206770":{"abstract":"Abstract<br\/><br\/>1329875 (Hu). Despite their importance within the energy sector, buildings have not kept pace with technological improvements and particularly the introduction of intelligent features. A primary obstacle in enabling intelligent buildings is their highly distributed and diffuse nature. To address this challenge, a modular approach will be investigated for building design, construction, and operation that would completely transform the building industry. Buildings would be assembled from a set of pre-engineered intelligent modules and commissioned on site in a \"plug-and-play\" manner much like a \"LEGO\" set but with added capability of (a) allowing for easy configuration and re-configuration that can be integrated to provide delivery of thermal and visual comfort, ventilation; (b) providing optimized controls in terms of overall occupant satisfaction and energy efficiency and performance monitoring. The primary goal of the research is to develop and demonstrate innovative concepts for distributed intelligence along with a new paradigm for plug-and-play building control that is a necessary precursor in enabling this transformation. To accomplish these tasks, the investigators constitute a multidisciplinary team with expertise from three engineering disciplines, namely Civil (Architectural), Mechanical, Electrical and Computer Engineering. The intellectual merit of this research lies in developing a unified approach that advances the engineering of cyber-physical systems (CPS) for buildings by contributing to the following fields: (a) modeling and identification of building subsystems and integrated systems; (b) multi-agent system networks that enable distributed intelligent monitoring and control of multi-zone buildings; (c) optimal control algorithms for stochastic hybrid systems that can optimize the operation of buildings with mode changes under uncertainty. These contributions will be integrated in simulation and experimental platforms for multi-agent building system networks to validate the developed algorithms and to provide a new CPS-based technological solution to the control and optimization of modular buildings. An initial knowledge\/technology base will be provided for scalable, adaptive, robust, and efficient engineering solutions for cyber-enabled building systems that will transform the current building operation practice, enabling the next generation of smart buildings with optimized comfort delivery and energy use. The broader impacts of this project are: (a) Theoretical development of modeling representations, algorithms, and simulation tools that will impact a number of scientific communities, including Civil\/Architectural, Mechanical and Computer Engineering, Computer Science, and Operations Research. The proposed new principles for heterogeneous multi-agent system networks, distributed intelligence, and optimal hybrid control algorithms will have impacts in a diverse range of fields outside of building systems such as power systems, transportation systems, robotics, etc.; (b) Integration of the proposed modeling, simulation, and experimental platforms into new teaching modules and experiential learning activities that support the curriculum development in three engineering schools and Purdue?s first year engineering program; (c) Dissemination of research outcomes to the industry to open up a new horizon of business and economy that would enable the growth of green and intelligent buildings; (d) The creation of outreach and engagement initiatives that motivate K-12 teachers and students in STEM learning and research, broaden the participation of underrepresented groups in engineering, and motivate undergraduate students to participate in research related to emerging CPS topics.","title":"CPS: Synergy: Plug-and-Play Cyber-Physical Systems to Enable Intelligent Buildings","awardID":"1329875","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"7643","name":"ENVIRONMENTAL SUSTAINABILITY"}}],"PIcoPI":[553622,553623,553624,553625],"PO":["565364"]},"205560":{"abstract":"In this research the PI will develop efficient mesh-based algorithms to simulate the dynamics and interactions of thin liquid structures such as sheets, jets, bubbles, and films. The thin geometry of these liquid phenomena poses tremendous difficulties for traditional techniques, leading to long runtimes and excessive memory consumption. The PI argues that a fundamentally different approach that recognizes and exploits the unique geometry of thin liquids is needed in order to simulate them efficiently and accurately (by analogy with the special treatment of thin elastic bodies such as rods, plates, shells). The project is comprised of three thrusts. First, the PI will develop algorithms for the dynamic simulation of liquid bodies composed of high viscosity threads and sheets, including physical modeling, collision processing, topology changes, and mixed dimensional remeshing. Second, he will address the specific challenges of low viscosity jets and sheets, considering in particular the enhanced influence of surface tension, sheet breakup, and the choice of Eulerian vs. Lagrangian evolution. Finally, he will examine the deformations of films, bubbles, and foams, using a new mesh-based representation for deforming multi-region interfaces, coupled to the fluid dynamics of the surrounding air. In each thrust, the predictive power of the techniques developed will be validated against both experimental observations and theoretical results from the literature.<br\/><br\/>To these ends, the PI will bring several geometric and computational techniques from the dynamics of thin elastica to bear on the dynamics of thin fluids. The PI believes this cross-pollination of ideas has the potential to provide dramatic improvements in efficiency and accuracy, while yielding computational tools that complement theory and experiment in the study of thin fluid phenomena. By considering a thin material as a lower dimensional object (curve or surface) with an associated thickness, the dimension of the problem can be reduced, yielding improved numerical properties and better allocation of degrees of freedom. This perspective has never before been applied to develop computational techniques for three-dimensional thin liquids. The use of non-manifold meshes to represent mixed bodies of thin liquids also opens up previously unexplored challenges in mixed dimensional remeshing and the handling of topological transitions. Furthermore, the proposed surface tracking representation builds on robust collision-processing techniques originally applied to cloth animation, and will offer the first surface mesh-based technique for the evolution of multi-material interfaces. This will allow for more accurate tracking of bubbles and general multiphase flows than can be achieved with state-of-the-art implicit surface approaches.<br\/><br\/>Broader Impacts: Thin liquids are crucial to a broad class of problems in computer graphics, engineering, and scientific applications. Liquid animations are increasingly prevalent in visual effects-driven films, yet thin splashes remain among the most difficult effects to animate. Thin threads and sheets of viscous liquids arise in applications from food processing to cosmetics, from the geophysics of the earth's crust to the forming and blowing of elaborate glass artwork. They are the subject of substantial concurrent experimental and theoretical investigation, and complementary computational tools for these problems could offer vital new insights. The potential applications for low viscosity liquids and foams are equally wide-ranging. Project outcomes will be reported at major international venues including the SIGGRAPH conferences, and the associated computational tools will be made publicly available. A variety of education and outreach efforts, some of which specifically target minority middle school students, are also planned.","title":"CGV: Small: Mesh-based Simulation of Thin Liquid Structures","awardID":"1319483","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["554341",550426],"PO":["565227"]},"208981":{"abstract":"Innovative use of wireless devices such as smartphones in various mobile applications has exacerbated the congestion over cellular spectrum. On the other hand, many licensed spectrum blocks are left unused. Although cognitive radios (CR) technology has emerged as an enabler for unlicensed users to opportunistically access the unused licensed spectrum, most previous works commonly assume that each user is equipped with a CR which can operate across a wide range of spectrum. This may be possible in theory, but may not be practical for light-weight devices such as cell phones. How to effectively utilize the CR technology to build more flexible networks so that even non-CR capable devices can benefit from the opportunistic access to the unused spectrum is therefore in dire need.<br\/><br\/>In this project, the PIs propose a novel cognitive mesh assisted cellular network (CMCN) and investigate: 1) the architectural design of CMCN so that unoccupied licensed spectrum can be efficiently utilized and non-cognitive cellular devices can benefit from the CR technology, 2) spectrum and energy efficient CR mesh router placement under uncertain spectrum availability, 3) how to construct a fine-grained spectrum map to facilitate efficient spectrum allocation and intelligent traffic delivery, and 4) experimental validation and implementation for the proposed design. The research outcome provides a viable solution to the spectrum congestion in cellular systems. Moreover, with this flexible architecture, telecommunication industries can be rejuvenated with new innovations, leading to further development of cellular networks with high capacity and better support of new applications such as mobile healthcare, which has significant impact on individuals' lives and further provides greater opportunities for job creation and economic growth. The results of the project will be disseminated through publications and presentations. Finally, this project will actively recruit and train minority students for the future workforce and mentor junior faculty.","title":"EARS: Collaborative Research: Cognitive Mesh: Making Cellular Networks More Flexible","awardID":"1343220","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560137],"PO":["557315"]},"209971":{"abstract":"Authorship Analysis (AA) is the task of extracting characteristics from written documents that can help to determine authorship of a document, generate a profile of the author, or identify cases of plagiarism. AA can be used for historical purposes, to settle disputes over the original creators of a given document, and to build a prosecution case against an online abuser.<br\/><br\/>Most previous work in AA assumes the availability of samples with known authorship that closely match the domain of the documents of interest. A strong assumption like this one limits the applications of AA approaches. This program addresses this key outstanding challenge by designing robust frameworks for scenarios with different cross-domain degrees: cross-topic, cross-genre and cross-modality (text vs. transcribed speech). The project leverages the large amounts of free text available representing each cross-domain setting to learn general lexical and syntactic distributional correspondences. These correspondences are used to map the out-of-domain texts to a representation that is closer to the target domain. <br\/><br\/>Direct contributions of this research include new approaches to extract and embed cross-domain prior knowledge into AA models in the form of distributional trajectories; and a solid understanding of the influence of topic, genre, and modality in the feature engineering process for AA that will also be helpful in other text processing tasks. This research will make direct contributions to the field of forensic linguistics, which is of major relevance for national security.<br\/><br\/>The PI will design an advanced seminar in computational approaches for forensic linguistics and will expand her ongoing educational and outreach activities for underrepresented groups in the STEM disciplines. The PI will integrate opportunities for international visits to key research labs for the graduate students involved in the program that will enrich their training and provide great networking opportunities.","title":"CAREER: Authorship Analysis in Cross-Domain Settings","awardID":"1350360","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[562856],"PO":["565215"]},"209003":{"abstract":"Innovative use of wireless devices such as smartphones in various mobile applications has exacerbated the congestion over cellular spectrum. On the other hand, many licensed spectrum blocks are left unused. Although cognitive radios (CR) technology has emerged as an enabler for unlicensed users to opportunistically access the unused licensed spectrum, most previous works commonly assume that each user is equipped with a CR which can operate across a wide range of spectrum. This may be possible in theory, but may not be practical for light-weight devices such as cell phones. How to effectively utilize the CR technology to build more flexible networks so that even non-CR capable devices can benefit from the opportunistic access to the unused spectrum is therefore in dire need.<br\/><br\/>In this project, the PIs propose a novel cognitive mesh assisted cellular network (CMCN) and investigate: 1) the architectural design of CMCN so that unoccupied licensed spectrum can be efficiently utilized and non-cognitive cellular devices can benefit from the CR technology, 2) spectrum and energy efficient CR mesh router placement under uncertain spectrum availability, 3) how to construct a fine-grained spectrum map to facilitate efficient spectrum allocation and intelligent traffic delivery, and 4) experimental validation and implementation for the proposed design. The research outcome provides a viable solution to the spectrum congestion in cellular systems. Moreover, with this flexible architecture, telecommunication industries can be rejuvenated with new innovations, leading to further development of cellular networks with high capacity and better support of new applications such as mobile healthcare, which has significant impact on individuals' lives and further provides greater opportunities for job creation and economic growth. The results of the project will be disseminated through publications and presentations. Finally, this project will actively recruit and train minority students for the future workforce and mentor junior faculty.","title":"EARS: Collaborative Research: Cognitive Mesh: Making Cellular Networks More Flexible","awardID":"1343356","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560200],"PO":["557315"]},"209135":{"abstract":"Asthma is a common lung disease with acute and chronic manifestations that impacts more than 22.2 million Americans or 7.9% of the population, including over 6.7 million children younger than 18 years of age. The cost of asthma is significant both for individuals and for the society as a whole. It is highly desirable to establish transformative technologies to improve the patient quality of life and reduce the cost of asthma management. The recent development in sensor and mobile computing technology provide great opportunities to establish Smart Asthma Management (SAM) systems and achieve a quantum leap in asthma management. Leveraging on the fast development of information infrastructure, patients can create a detailed temporal log recording their symptoms, medicine usage, and possibly vital physiological signals through an easy access to a website or their smart phones in SAM systems. This unprecedented continuous stream of patient-generated data in SAM systems provides us significant opportunities to better estimate patient condition and make clinical intervention decisions. However, since the information infrastructure of SAM has not become available until recently, very limited work is available for SAM systems. Against this background, this collaborative project aims to develop a suite of statistical modeling, monitoring, prognosis, and clinical intervention decision making methodologies based on a flexible yet rigorous multistate model to describe the evolving of patient conditions. The true underlying state of the patient is assumed unknown; however, there is reason to expect that it could be inferred from patient generated data such as the frequency of the rescue inhaler usage (the time and frequency of the rescue inhaler use is an important indicator of asthma control). <br\/><br\/>Some anticipated advances include: (i) Multistate model with event intensity function as observations. The proposed methodology brings the mixed effect model and the multistate model into a unified framework to integrate the population information embedded in the historical records of multiple patients and the individual information collected in real-time in a quantitative way. (ii) Stochastic filtering approach for individual patient condition modeling and updating. The novel state space formulation enables efficient stochastic filtering algorithms to estimate and update the states and parameters in the multistate model. (iii) Clinical intervention decision support for patients and clinicians. The salient features of the proposed policy are that it is based on a condition-based policy and incorporates uncertainties in the patient condition model through a Partially Observable Markov Decision Process (POMDP) framework which has been widely used and proven to be very effective in the management of industrial systems. Plans are in place to evaluate the effectiveness of the resulting technologies in collaboration with clinical experts. <br\/><br\/><br\/>The project is likely to contribute predictive technologies that could help reduce the cost and improve the quality of healthcare in the US, especially as it relates to effective management of chronic illnessess. Additional broader impacts of the project include enhanced research-based training opportunities for graduate and undergraduate students (including members of under-represented minorities) in healthcare engineering, statistics, and operation research; enrichment of the curricula in health systems in industrial engineering and operations research at the University of Wisconsin-Madison and the University of Iowa.","title":"SCH: EXP: Collaborative Research: Smart Asthma Management: Statistical Modeling, Prognostics, and Intervention Decision Making","awardID":"1343974","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":["474923"],"PO":[560586]},"209961":{"abstract":"As new computing and communication technologies become mainstream, online communities are transforming journalism and other industries to support more interactive, community-driven work. This project will study how mental models of online communities are formed, how they shape expectations about the future of the community, how they co-evolve with the community over time, and how they aggregate to form a critical mass that is essential for successful work and community survival. In many such online communities, participation is voluntary: each person must look at the community, develop a mental model of what that community is, how it works, and what it means for them to join, and then make a decision about whether they want to participate. And then, as the community evolves and changes, they need to continually decide whether and how to participate.<br\/><br\/>This research will triangulate three research methods to understand how individuals form mental models of online communities, and how mental models of multiple individuals interact and aggregate to form a larger community. First, it will use qualitative interviews to understand how individuals make sense of a new online community and how they make continuing participation decisions in communities they are already part of. Second, it will use a series of human subjects lab experiments to characterize how people form mental models of both the content available in an online community, and the other users of an online community. These experiments will also help to understand how a user's mental model helps her interpret the community's reactions to her participation. Finally, this project will use statistical analysis and formal mathematical modeling of existing online communities to understand how online communities grow over time and when people choose to leave online communities.<br\/><br\/>Results of this research will be of general value in designing, managing, and participating in many kinds of online communities, as well as contributing to education in the information, cognitive, and social sciences. A unique, cross-disciplinary education program will be created that trains students to use this research to build special-purpose online communities. This program will include a joint class linking a School of Journalism with a department of Telecommunication, Information Studies and Media. This class will form cross-disciplinary teams who spend the semester creating and growing an online community. This partnership will teach students to apply social science and computer science research for real-world applications, and work on collaborative, cross-disciplinary teams that include technical people, creative people, and topic experts. It represents a new type of education in journalism that will bring students into new, community-driven methods of doing journalism, based more on curating content and facilitating discussion than on original, unidirectional reporting.","title":"CAREER: Mental Models and Critical Mass: Shaping the Success of Online Communities","awardID":"1350253","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[562836],"PO":["564456"]},"208344":{"abstract":"The University of Pittsburgh and Carnegie Mellon University will test and refine a Theory of Badges applied to Computer Science Education. Given that badges have recently attracted a great deal of attention as both motivator and assessment marker, the goal of the project is to create a foundation of principles that will guide the design of future Computer Science badging initiatives. The team will experimentally manipulate the use of badges within an ongoing Computer Science education development project that leverages highly popular robotics competitions as the distribution channel. They will monitor and adapt the form and content of assessments and badge representations in computer science content modules to try to achieve the best possible outcomes for student participants (learner persistence, computer science content learning, and computer science career interest) as predicted by the current iteration of their badge theory. Researchers will explicitly track and publish data for underrepresented minorities, women, and economically disadvantaged students to see whether badges are particularly effective or encounter obstacles specific to these populations.","title":"Collaborative Research: CER: Building a Theory of Badges for Computer Science Education","awardID":"1339354","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558328],"PO":["560704"]},"209136":{"abstract":"This project builds a novel privacy-preserving framework with both new algorithms and software tools to: 1) evaluate the effectiveness of current identifier-suppression techniques for Electronic Healthcare Record (EHR) data; 2) de-identify and anonymize EHR data to protect personal information without significantly reducing the utility of data for secondary data analysis. The proposed techniques eliminate the violation of privacy through re-identification, and facilitate the secondary usage, sharing, publishing and exchange of healthcare data without the risk of breaching protected health information (PHI). This new privacy-preserving framework injects the ICD-9-CM-aware constraint-based privacy-preserving techniques into EHRs to eliminate the threat of identifying an individual in the secondary use of research data. The proposed technique and development can be readily adapted to other types of healthcare databases in order to ensure privacy and prevent re-identification of published data. The project produces groundbreaking algorithms and tools for identifying privacy leakages and protecting personal privacy information in EHRs to improve healthcare data publishing. New privacy-preserving techniques developed in this project lead towards a new type of healthcare science for EHRs. The project also delivers fundamental advancements to engineering by showing how to integrate biomedical domain knowledge with a computationally advanced quantitative framework for preserving the privacy of published EHRs. HIPAA has established protocols and industry standards to protect the confidentiality of PHI. However, our results demonstrate that, even with regard to health data that meets HIPAA requirements, the risk of re-identification is not completely eliminated. By identifying the security vulnerabilities inherent in the HIPAA standards, our research develops a more rigorous security standard that greatly improves privacy protections by applying state-of-the-art algorithms.<br\/><br\/>The developed data privacy-preserving framework has significant implications for the future of US healthcare data publishing and related applications. Specifically, the transition from paper records to EHRs has accelerated significantly since the passage of the HITECH Act of 2009. The Act provides monetary incentives for the \"meaningful use\" of EHRs. As a result, the quality and quantity of healthcare databases has risen sharply, which has renewed the public's fear of a breach of privacy of their medical information. This research work is innovative and crucial not only for facilitating EHR data publishing, but also for enhancing the development and promotion of EHRs. At the educational front, this project facilitates the development of novel educational tools to construct entirely new courses and laboratory classes for healthcare, data privacy, data mining, and a wide range of applications. As a result, it enhances the current instructional methods for teaching data privacy and data mining, and has compelling biomedical and healthcare applications that can facilitate learning of computational algorithms. This project involves both undergraduate and graduate students in the three participating institutions. The PIs make a strong effort to engage minority graduate and undergraduate students in research activities in order to increase their exposure to cutting-edge research.","title":"SCH: EXP: Collaborative Research: Privacy-Preserving Framework for Publishing Electronic Healthcare Records","awardID":"1343976","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560587,"464575"],"PO":["565136"]},"209147":{"abstract":"This project builds a novel privacy-preserving framework with both new algorithms and software tools to: 1) evaluate the effectiveness of current identifier-suppression techniques for Electronic Healthcare Record (EHR) data; 2) de-identify and anonymize EHR data to protect personal information without significantly reducing the utility of data for secondary data analysis. The proposed techniques eliminate the violation of privacy through re-identification, and facilitate the secondary usage, sharing, publishing and exchange of healthcare data without the risk of breaching protected health information (PHI). This new privacy-preserving framework injects the ICD-9-CM-aware constraint-based privacy-preserving techniques into EHRs to eliminate the threat of identifying an individual in the secondary use of research data. The proposed technique and development can be readily adapted to other types of healthcare databases in order to ensure privacy and prevent re-identification of published data. The project produces groundbreaking algorithms and tools for identifying privacy leakages and protecting personal privacy information in EHRs to improve healthcare data publishing. New privacy-preserving techniques developed in this project lead towards a new type of healthcare science for EHRs. The project also delivers fundamental advancements to engineering by showing how to integrate biomedical domain knowledge with a computationally advanced quantitative framework for preserving the privacy of published EHRs. HIPAA has established protocols and industry standards to protect the confidentiality of PHI. However, our results demonstrate that, even with regard to health data that meets HIPAA requirements, the risk of re-identification is not completely eliminated. By identifying the security vulnerabilities inherent in the HIPAA standards, our research develops a more rigorous security standard that greatly improves privacy protections by applying state-of-the-art algorithms.<br\/><br\/>The developed data privacy-preserving framework has significant implications for the future of US healthcare data publishing and related applications. Specifically, the transition from paper records to EHRs has accelerated significantly since the passage of the HITECH Act of 2009. The Act provides monetary incentives for the \"meaningful use\" of EHRs. As a result, the quality and quantity of healthcare databases has risen sharply, which has renewed the public's fear of a breach of privacy of their medical information. This research work is innovative and crucial not only for facilitating EHR data publishing, but also for enhancing the development and promotion of EHRs. At the educational front, this project facilitates the development of novel educational tools to construct entirely new courses and laboratory classes for healthcare, data privacy, data mining, and a wide range of applications. As a result, it enhances the current instructional methods for teaching data privacy and data mining, and has compelling biomedical and healthcare applications that can facilitate learning of computational algorithms. This project involves both undergraduate and graduate students in the three participating institutions. The PIs make a strong effort to engage minority graduate and undergraduate students in research activities in order to increase their exposure to cutting-edge research.","title":"SCH: EXP: Collaborative Research: Privacy-Preserving Framework for Publishing Electronic Healthcare Records","awardID":"1344072","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560616],"PO":["565136"]},"205650":{"abstract":"The general vehicular networking system (VNS), where the vehicular ad hoc network (VANET) is integrated with hybrid electric vehicles (HEVs), enables a wide range of intelligent transportation system (ITS) applications. With different visions on VANETs, most of the existing studies provide case-specific solutions in an incoherent manner, which can hardly be integrated into an effective system. This project aims at developing a reliable, energy-efficient, and secure VNS with a synergetic approach through five complementary research tracks: infrastructure optimization, protocol design for reliable networking performance, energy-efficient VNS, security and privacy provisioning, and virtual-field testbed development. This project is expected to significantly advance the state of the art of VANET research by addressing some fundamental research issues. Analytical models are developed to study the road-side infrastructure deployment, networking protocols and control algorithms for optimal performance, considering the complex issues of mobility, interference, and data traffic dynamics. The throughput-optimal control in a multi-radio multi-channel context with dynamic network topology is studied to improve the throughput over a multi-hop vehicular network. Energy-efficient solutions are pursued by exploiting the interplay between the VNET and HEVs. Scalable security protocols with small computation and communication overhead are developed to provision security and privacy in VANET. <br\/><br\/>The proposed research seamlessly integrates research and education activities in the areas of optimization, probability and random process, graph theory, wireless networking, HEV technologies, as well as computer simulations. The research proposed in this project has a good potential to be transformed into practical protocols or control algorithms for VANETs.","title":"NeTS: Small: Collaborative Research: Towards Reliable, Energy-Efficient, and Secure Vehicular Networks","awardID":"1319915","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["251870"],"PO":["565303"]},"205694":{"abstract":"The alignment of protein structures is essential for the study of protein function. Superposing the binding cavities of one protein onto another can reveal shape similarities that explain why two proteins bind a similar molecular partner. Superposition can also expose critical differences that explain why proteins sometimes bind very different partners. These observations, made by experts in structural biology with the computational aid of protein structure alignments, help construct our atomic-level understanding of protein binding preferences. Protein binding preferences lie at the crux of many pressing challenges in protein engineering, systems biology, drug design, and other fields.<br\/><br\/>This project considers a new approach to protein structure alignment that generates superposition by maximizing the overlapping volume between binding cavities. Two core research directions will be considered: (1) The development of specialized optimization techniques that rapidly and reliably explore the continuous space of alignments and (2) the usage of biological and biophysical data to enhance the alignment process.<br\/><br\/>Intellectual Merit: The proposed work advances the study of protein structure comparison with new representations of protein structure and new geometric superposition techniques. A novel focus on closely related proteins also diverges from existing methods, which generally target proteins with distant evolutionary ties. The project advances techniques in mathematical optimization for accommodating the noisy and expensive estimation of overlapping cavity volume. Accommodations of this nature are an emerging challenge in optimization, where the function being optimized is frequently the result of imprecise and expensive computations, like simulations. The low dimensionality of the cavity alignment problem, coupled with the opportunity to optimize in the presence of noise and imprecision creates a unique opportunity to advance techniques for this general challenge in optimization. In structural biology, the proposed work will add automation and precision to existing workflows, enabling the examination of more structures than humans can fully consider and identifying molecular subtleties that might otherwise be overlooked.<br\/><br\/>Broader Impacts: The project also focuses on developing interactive software for protein structure comparison. This software will provide a visual and intuitive interface, helping students and scientists from non-computational background to better use and understand software in structural bioinformatics. The research itself and the development of the interface software will expose graduate and undergraduate students with mono-disciplinary backgrounds to an interdisciplinary research program in bioinformatics, and train them in cross-disciplinary communication.","title":"AF: Small: Volumetric Alignment of Protein Cavities for the Analysis of Ligand Binding Specificity","awardID":"1320137","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":[550735,550736],"PO":["565223"]},"208972":{"abstract":"As cognitive radio (CR) research advances to multihop and complex systems over large geographic regions, the spectrum utilization enhancement should be generalized to fully exploit the spectrum usage diversity in three dimensions (3D): time, frequency, and space, with new emphasis on the under-explored spatial dimension. Accordingly, this project focuses on the following three research objectives. The first one is to utilize the recent advancements in statistical learning over big data to develop efficient 3D spectrum sensing schemes, where a hierarchical approach is taken in developing novel finite-bit and single-bit learning techniques to efficiently explore the correlation structure across the three dimensions, with an advanced distributed approach also developed. The second one is to develop two key building blocks in large-scale CR networking based on the 3D spectrum sensing: 1) a novel multi-scale routing scheme to enhance the overall spectrum utilization, with a focus on exploiting the layered spectrum usage correlation structure in the spatial dimension; and 2) a reliable hierarchical common control channel identification scheme. The last research objective is to validate some key aspects in the proposed sensing and networking schemes via both intensive simulations and a concept-proving testbed. Throughout the project, an interdisciplinary approach is taken to combine the methods of statistical learning, signal processing, and wireless networking, with the core built upon the hierarchical treatment of both spectrum usage statistics and CR networking methodologies. The project provides both theories and algorithms for large-scale spectrum sensing and cognitive networking. Through a coherent education plan, the research findings will be incorporated into courses, and disseminated to the community via journal papers and conference presentations.","title":"Collaborative Research: EARS: Large-Scale Statistical Learning based Spectrum Sensing and Cognitive Networking","awardID":"1343155","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560117,560118],"PO":["557315"]},"208312":{"abstract":"The University of Pittsburgh and Carnegie Mellon University will test and refine a Theory of Badges applied to Computer Science Education. Given that badges have recently attracted a great deal of attention as both motivator and assessment marker, the goal of the project is to create a foundation of principles that will guide the design of future Computer Science badging initiatives. The team will experimentally manipulate the use of badges within an ongoing Computer Science education development project that leverages highly popular robotics competitions as the distribution channel. They will monitor and adapt the form and content of assessments and badge representations in computer science content modules to try to achieve the best possible outcomes for student participants (learner persistence, computer science content learning, and computer science career interest) as predicted by the current iteration of their badge theory. Researchers will explicitly track and publish data for underrepresented minorities, women, and economically disadvantaged students to see whether badges are particularly effective or encounter obstacles specific to these populations.","title":"Collaborative Research: CER: Building a Theory of Badges for Computer Science Education","awardID":"1339085","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558235],"PO":["560704"]},"208334":{"abstract":"The University of Maryland Baltimore County, in collaboration with the University of Maryland College Park, will develop and evaluate professional development activities focused on increasing the expertise of Maryland high school teachers for teaching computer science, with the ultimate goal of increasing the number of rigorous computer science classes offered across the state and the number and diversity of students taking these classes. Experienced higher education faculty and highly effective high school teachers will collaborate to train other high school teachers to develop and offer a college preparatory CS curriculum. In the first year, an initial cohort of 12 master teachers will collaborate with the project leadership team to develop standardized classroom materials based on the CS Principles curriculum and then offer the CS Principles course in their home schools. In the second year, the project staff will train less experienced teachers in the CS Principles curriculum, and in the third year, the leadership team will demonstrate scalability by supporting the delivery of multiple independently funded regional workshops.<br\/><br\/>The proposed project will develop course materials, create training materials, and increase the expertise of high school computer science teachers in Maryland. Master teachers and apprentice teachers will be trained in the new curriculum, increasing the readiness and ability of schools and teachers to adopt and offer the CS Principles curriculum and increasing the availability of academically rigorous CS courses in high schools across the state. The proposed effort will ultimately lead to increased interest of Maryland students in studying and pursuing careers in computer science.","title":"CS 10K: Collaborative Research: A Structured CS Principles Approach to Professional Development for Maryland High School Teachers","awardID":"1339265","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558297],"PO":["560704"]},"209005":{"abstract":"Innovative use of wireless devices such as smartphones in various mobile applications has exacerbated the congestion over cellular spectrum. On the other hand, many licensed spectrum blocks are left unused. Although cognitive radios (CR) technology has emerged as an enabler for unlicensed users to opportunistically access the unused licensed spectrum, most previous works commonly assume that each user is equipped with a CR which can operate across a wide range of spectrum. This may be possible in theory, but may not be practical for light-weight devices such as cell phones. How to effectively utilize the CR technology to build more flexible networks so that even non-CR capable devices can benefit from the opportunistic access to the unused spectrum is therefore in dire need.<br\/><br\/>In this project, the PIs propose a novel cognitive mesh assisted cellular network (CMCN) and investigate: 1) the architectural design of CMCN so that unoccupied licensed spectrum can be efficiently utilized and non-cognitive cellular devices can benefit from the CR technology, 2) spectrum and energy efficient CR mesh router placement under uncertain spectrum availability, 3) how to construct a fine-grained spectrum map to facilitate efficient spectrum allocation and intelligent traffic delivery, and 4) experimental validation and implementation for the proposed design. The research outcome provides a viable solution to the spectrum congestion in cellular systems. Moreover, with this flexible architecture, telecommunication industries can be rejuvenated with new innovations, leading to further development of cellular networks with high capacity and better support of new applications such as mobile healthcare, which has significant impact on individuals' lives and further provides greater opportunities for job creation and economic growth. The results of the project will be disseminated through publications and presentations. Finally, this project will actively recruit and train minority students for the future workforce and mentor junior faculty.","title":"EARS: Collaborative Research: Cognitive Mesh: Making Cellular Networks More Flexible","awardID":"1343361","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560205],"PO":["557315"]},"209126":{"abstract":"Clinical decision support has the potential to reduce healthcare costs and improve patient outcomes, while shedding light into policy questions surrounding healthcare costs and practices in the US. This project aims to develop intelligent clinical decision support techniques for recommending optimal action plans - including both diagnostic tests and medical interventions - for treating chronic disease, performing multi-step and adaptive treatments, and modifying long-term health habits. In an effort to integrate evidence-driven decision-making with established clinical practices, the research will develop disease-agnostic artificial intelligence techniques that combine data from large electronic health records (EHRs) with recommendations from human experts. A prototype decision support system will be tested on three clinical settings - cardiology, clinical depression, and emergency room readmission - using existing EHR datasets and consultation with domain experts from clinical partners. Outcomes-driven and cost-driven optimized decisions will be compared to current clinical practice. This exploratory research will provide the groundwork for follow-up projects in decision support information presentation, integration with clinical workflow and IT systems, and making the transition from retrospective studies to clinical trials. Other broader impacts include workshops for healthcare applications of AI, and women and minority students will be recruited and mentored in graduate and undergraduate computer science research.<br\/><br\/>The technical approach of this research builds on state-of-the-art machine learning and artificial intelligence methods to automatically learn, simulate, and reason about patient-specific treatment plans. Such methods must be simultaneously probabilistic and temporal. Probabilistic techniques are needed to handle significant uncertainties in clinical diagnoses and outcomes, much like a human clinician would. Temporal techniques are needed to consider sequences of future decisions over the course of treatment, rather than decisions at single time points. More specifically, this project will consider the use of statistical relational learning (SRL) techniques to mine for probabilistic, temporal patterns in large electronic health records, and these patterns will be used in partially-observable Markov decision processes (POMDPs) that exhaustively search for optimal treatment sequences. Recent results indicate that SRL achieves superior performance to other machine learning methods in predicting cardiac arrest from demographic and lifestyle observations, and POMDP treatment plans outperform existing fee-for-service practices by reducing costs by 50% and improving outcomes by 40% on a clinical depression dataset. By combining SRL and POMDPs, specifically, using SRL to learn a disease progression model used by the POMDP, this project aims to achieve further improvements in recommendation quality and computational scalability for complex treatments. Furthermore, because EHRs may suffer from limited or missing data, clinical decision support tools should follow established practices and expert knowledge when necessary. To do so, new workflows for integrating expert knowledge into SRL and POMDPs will be explored. Evaluation will be performed on a variety of disease scenarios in conjunction with clinical partners at Marshfield Clinic, Centerstone, Wake Forest School of Medicine, and South Bend Memorial Hospital.","title":"SCH: EXP: Intelligent Clinical Decision Support with Probabilistic and Temporal EHR Modeling","awardID":"1343940","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8018","name":"Smart Health & Wellbeing"}}],"PIcoPI":[560558,560559,560560],"PO":["565136"]},"208973":{"abstract":"As cognitive radio (CR) research advances to multihop and complex systems over large geographic regions, the spectrum utilization enhancement should be generalized to fully exploit the spectrum usage diversity in three dimensions (3D): time, frequency, and space, with new emphasis on the under-explored spatial dimension. Accordingly, this project focuses on the following three research objectives. The first one is to utilize the recent advancements in statistical learning over big data to develop efficient 3D spectrum sensing schemes, where a hierarchical approach is taken in developing novel finite-bit and single-bit learning techniques to efficiently explore the correlation structure across the three dimensions, with an advanced distributed approach also developed. The second one is to develop two key building blocks in large-scale CR networking based on the 3D spectrum sensing: 1) a novel multi-scale routing scheme to enhance the overall spectrum utilization, with a focus on exploiting the layered spectrum usage correlation structure in the spatial dimension; and 2) a reliable hierarchical common control channel identification scheme. The last research objective is to validate some key aspects in the proposed sensing and networking schemes via both intensive simulations and a concept-proving testbed. Throughout the project, an interdisciplinary approach is taken to combine the methods of statistical learning, signal processing, and wireless networking, with the core built upon the hierarchical treatment of both spectrum usage statistics and CR networking methodologies. The project provides both theories and algorithms for large-scale spectrum sensing and cognitive networking. Through a coherent education plan, the research findings will be incorporated into courses, and disseminated to the community via journal papers and conference presentations.","title":"Collaborative Research: EARS: Large-Scale Statistical Learning based Spectrum Sensing and Cognitive Networking","awardID":"1343156","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560120],"PO":["557315"]},"208324":{"abstract":"Harvard University will undertake a retrospective cohort study to analyze college students? education background and previous IT-related experiences for predictors of performance when students study Computer Science in college, while controlling for demographic differences. The study will reveal how decisions concerning the use of technology made by high school teachers in the teaching of science and mathematics and the growing number of high school computer science courses relate to the performance of 12,000 college computer science students nationwide, who will be recruited from randomly selected 2-year and 4-year colleges and universities. This study has the capacity to both reveal and evaluate the use of the most promising educational practices and interventions, including both in-school computing instruction and after-school programs, competitions, and clubs, and to assess the effects of a match between experiences during the high school years with the evolving landscape of introductory college computer science courses. Such knowledge can only help to ameliorate the high failure rates that prematurely end the pursuit of a potential computer science degree, especially for females and under-represented minorities who historically opt out of this field earlier and in greater numbers than other classmates. Both college and high school computer science instructors can also benefit from understanding the factors contributing to effective preparation for students? first college computer science course.","title":"CER: Factors Influencing College Success in Information Technology (FICSIT)","awardID":"1339200","effectiveDate":"2014-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":["563275","563645"],"PO":["560704"]},"208335":{"abstract":"Cleveland State University (CSU) in collaboration with the University of California San Diego (UCSD), proposes CISS -- Computing in Secondary Schools -- a CS10K project designed to provide computer science education professional development to high school teachers throughout the state of Ohio. Through participation in CISS, high school teachers will become fluent in computational thinking and will develop the skills needed to teach the new AP CS Principles course. The teachers will be supported through access to course materials, pedagogy, mentoring, weekly telephone meetings, mid-year workshops and technical coaches. Teachers will also have access to an online knowledge repository, CS Learning Commons, which will be used to address challenges that arise and share best practices. Specifically the project will (1) recruit, train, and assist 30 high school teachers in teaching CS in their classroom; (2) prepare and teach an open online course focused on CS education, which will include both content knowledge required to teach CS at the high school level as well as the pertinent pedagogical techniques; (3) widen the CS teacher pipeline by offering a teacher licensure pathway; (4) create a replicable network design model for CS teacher training and mentoring by engaging with an online school network; and (5) establish CS mentoring programs for high school teachers with a focus on gender diversification and participation by minority teachers. Additional partners include the Ohio STEM Learning Network (OSLN) and school districts geographically dispersed throughout the state of Ohio. This project will leverage the work already done on ComPASS CS10K award and will increase our understanding of its scaling to a wider audience.","title":"CE21: CS10K: CISS: Computing in Secondary Schools","awardID":"1339270","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558299,558300,558301,558302],"PO":["561855"]},"209006":{"abstract":"The project is focused on designing a holistic communication stack that leverages TV whitespaces for enabling \"connected vehicles\" and their many advantages in ushering smarter and safer transportation services. The combination of low cost of the unlicensed TV whitespace spectrum and its longer communication ranges matches the needs of vehicular connectivity quite well. Yet realizing TV whitespace communications faces unique constraints and challenges including, e.g., protecting primary incumbents, scanning through many channel configurations subject to spatial-temporal variations, dealing with asymmetric uplink\/downlink transmit power constraints due to FCC regulations concerning mobile and static nodes. The proposed research addresses these challenges through a range of techniques. It augments spectrum sensing techniques from sensors distributed across moving vehicles to enhance the accuracy of spectrum databases. It employs innovative PHY and MAC layer techniques including variable spreading codes, MIMO and directional antennas, complemented with network\/transport layer protocols that adapt to uplink\/downlink asymmetry. These research tasks integrate machine learning techniques to explore the predictable mobility and other unique advantages of the vehicular whitespace network. <br\/><br\/>This project is developing a new communication technology for improved and robust wide-area connectivity for vehicles. All developed techniques are expected to be deployed in a practical setting on a realistic vehicular testbed in Madison, WI. The research work engages collaboration with many industry partners and is expected to influence regulatory and standardization bodies. The researchers are also making educational impact through public lectures, developing new curriculum, and motivating women and minorities in future STEM careers through appropriate PI engagement at high school and undergraduate levels.","title":"EARS: A TV Whitespace Communication System for Connected Vehicles","awardID":"1343363","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[560207,560208,560209],"PO":["564993"]},"205410":{"abstract":"Multimedia forensics is increasingly becoming an important research area for protecting public safety and enhancing national security; steganalysis and forgery detection are becoming two active research areas, even as they are still in their inception. The shortage of comprehensive detection systems has severely impeded progress and practical applications in the field. This study will facilitate the work of forensic practitioners in criminal investigations and will deliver to the community benchmark datasets, performance evaluation standards and models, software design and the analysis toolkit in order to design and test new steganalysis\/forgery detection system approaches. Additionally, as part of the research education plan, undergraduate women, minorities, and first-generation college students will be extensively involved. A further contribution to an educational pipeline for computer science involves local high school students through the creation of a multimedia forensics and knowledge discovery laboratory. <br\/><br\/>The research involves designing comprehensive hybrid intelligent systems for steganalysis and forgery detection with the capability to discriminate the operations of steganography, general processing and forgery manipulation. This research will make contributions to engineering by providing the optimal classification\/regression models associated with the identification of minimal optimal feature sets, benefitting a broad range of applications. The scientific objectives of the research involve validation of new paradigms, shift-recompression-based derivative\/wavelet differential pattern analyses on multimedia data, to merge high dimensional rich models that were used for steganalysis, and apply judicious feature mining and machine learning techniques to handle high dimensionality and establish comprehensive hybrid intelligent forensics systems to recognize different categories of multimedia data and reveal past processing history.","title":"CIF: SMALL: RUI: Novel Detection Approaches with Comprehensive Hybrid Intelligent Systems for Multimedia Forensics","awardID":"1318688","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":[550030],"PO":["564898"]},"208336":{"abstract":"The University of Maryland Baltimore County, in collaboration with the University of Maryland College Park, will develop and evaluate professional development activities focused on increasing the expertise of Maryland high school teachers for teaching computer science, with the ultimate goal of increasing the number of rigorous computer science classes offered across the state and the number and diversity of students taking these classes. Experienced higher education faculty and highly effective high school teachers will collaborate to train other high school teachers to develop and offer a college preparatory CS curriculum. In the first year, an initial cohort of 12 master teachers will collaborate with the project leadership team to develop standardized classroom materials based on the CS Principles curriculum and then offer the CS Principles course in their home schools. In the second year, the project staff will train less experienced teachers in the CS Principles curriculum, and in the third year, the leadership team will demonstrate scalability by supporting the delivery of multiple independently funded regional workshops.<br\/><br\/>The proposed project will develop course materials, create training materials, and increase the expertise of high school computer science teachers in Maryland. Master teachers and apprentice teachers will be trained in the new curriculum, increasing the readiness and ability of schools and teachers to adopt and offer the CS Principles curriculum and increasing the availability of academically rigorous CS courses in high schools across the state. The proposed effort will ultimately lead to increased interest of Maryland students in studying and pursuing careers in computer science.","title":"CS 10K: Collaborative Research: A Structured CS Principles Approach to Professional Development for Maryland High School Teachers","awardID":"1339275","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558304],"PO":["560704"]},"208347":{"abstract":"Marquette University, in collaboration with the University of Wisconsin La Crosse, proposes the PUMP-CS Project (Preparing the Upper Midwest for Principles of Computer Science). PUMP-CS will provide a two-track professional development (PD) sequence for endorsing in-service and pre-service teachers--regardless of their prior CS-specific knowledge--to teach the Exploring Computer Science (ECS) or Computer Science Principles (AP CSP) curricula in their classrooms. The first track prepares in-service teachers to lead 9th- or 10th-grade level ECS, which integrates an inquiry- and equity-based pedagogy to convey solid CS content while appealing to a more diverse student population than traditional CS offerings. The second track includes a methods course, Teaching Computer Science (TCS), which enables both pre-service and in-service teachers to add a CS-specific endorsement to their primary certification, while continuing to promote pedagogical reform. This CS methods course is a \"missing link\" preventing teachers from earning the CS endorsement required to teach a course with more than 25% programming content, (e.g. AP CS or CSP). The planned hybrid\/online format for TCS will allow remote teachers in \"density-challenged\" regions to participate in a supportive learning community as they master the content and methods required. The project team includes members from universities, the Wisconsin-Dairyland chapter of the Computer Science Teachers Association (CSTA), officials from the Department of Public Instruction (DPI), and teachers and administrators from districts across the state. Collectively, they have the diverse institutional knowledge necessary to drive change in state licensure and curriculum standards, to match college-level courses at key universities to the STEM student pipeline, to promote new content and structure for CS teacher preparation, and to rigorously assess the results of this large-scale intervention on teacher education and student learning. This proposed work will lead to regional, sustainable institutional change to improve CS education, and scalable teacher preparation materials ready for other institutions to adopt, and its careful assessment will explore deeper questions of when and how CS teacher preparation can be most effective, and how those lessons can be leveraged in other STEM teaching fields.","title":"CS 10K: Collaborative Research: Priming the PUMP - Preparing the Upper Midwest for Principles of Computer Science","awardID":"1339392","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558335,558336],"PO":["561855"]},"205323":{"abstract":"This project will study three broad families of optimization problems: graph routing, graph drawing, and vertex sparsification. Graph routing problems typically aim at connecting pairs of graph vertices with disjoint or nearly disjoint paths. Routing problems are central to combinatorial optimization, and arise in many different applications. Algorithms for graph drawing assist with visualizing a given graph, by appropriately drawing it in the plane. Graph sparsifiers allow us to replace a given graph by a much smaller one, that preserves the routing properties of the original graph. Optimization problems can then be solved on the smaller graph, thus obtaining faster algorithms. This project aims at developing better approximation algorithms for graph routing and drawing problems, and constructing better and smaller vertex sparsifiers. The PI will also study graph partitioning problems, that play a central role in designing algorithms for many problems in the areas of graph routing, drawing, sparsification, and beyond.<br\/><br\/>Graphs are among the most basic combinatorial objects, and are often used to model various applications, or to represent data. Algorithms for graph partitioning, routing and drawing are central tools for manipulating graphs and solving optimization problems on them. Designing better approximation algorithms for such problems will require developing new algorithmic paradigms, that will most likely find other uses across the field of approximation algorithms and beyond. The problems the PI studies have interesting connections to other areas, including Graph Minor Theory, Fixed Parameter Tractability, and VLSI Design. This project presents an opportunity for collaboration with these areas, with the goal of combining their diverse technical tools and insights. This research offers a broad range of opportunities for student projects, and will involve graduate students from TTIC and University of Chicago, as well as students from other institutions who participate in TTIC's summer internship program. The PI will also participate in activities aimed at encouraging a broader involvement of women in theoretical computer science, including participation in workshops and mentorship programs whose target audience is undergraduate and graduate female students.","title":"AF: Small: Algorithms for Graph Routing, Drawing and Partitioning","awardID":"1318242","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":[549808],"PO":["565157"]},"208315":{"abstract":"Twin Cities Public TV pilot project--Educational Media to Advance Computer Science (EMACS)--is a collaboration of Twin Cities Public Television (tpt), the Department of Computer Science at Carleton College, and the STEM Education Center at the University of Minnesota. The goal of the pilot project is to establish the effectiveness of a media-based instructional model to enhance high school computer science teachers' content and pedagogical knowledge and ability to teach Advanced Placement® Computer Science Principles (AP® CSP). The EMACS Pilot will involve students in a media-enhanced exploration of infrastructure systems to increase their awareness and understanding of real-world applications of computer science and the importance of computational thinking in everyday life. Deliverables will include a standards- aligned, media-based supplementary curriculum module that promotes inquiry-driven investigation of how computer science is applied to infrastructure systems, a detailed outline of a teacher professional development (PD) program, a wireframe model of an online environment for the teacher PD experience, and a formative evaluation on the appeal and educational impact of the module on students and their teachers. <br\/><br\/>The alignment of the pilot module with the concepts and computational thinking practices that comprise the AP CSP course will be facilitated by active involvement with representatives from the College Board, the AP CSP course development team, and an external project advisory group. A selection of the seven \"Big Ideas\" within that framework (i.e., Creativity, Abstraction, Data, Algorithms, Programming, Internet, and Impact) will be brought to life through video and an applied programming activity. The project will employ the graphical programming environment Scratch, providing a rich platform for building simulations of infrastructure systems. Building on an award-winning track record of using video of \"real kids doing real science\" as a tool to foster interest in STEM and model scientific processes (e.g., tpt's PBS series DragonflyTV and SciGirls and related learning and professional development tools), coupled with the University of Minnesota's research on teacher training and impactful and integrated STEM learning opportunities for diverse learners, the EMACS pilot will demonstrate a new approach to support and enhance AP CSP courses. The formative evaluation of the pilot will demonstrate the potential of the model to 1) engage students and improve their understanding of applications of computer science, and 2) improve teachers' understanding and ability to teach core AP CSP principles.","title":"CS 10K: Educational Media to Advance Computer Science (EMACS)","awardID":"1339104","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":[558241,558242,558243,558244],"PO":["561855"]},"210295":{"abstract":"This project will develop, implement, and evaluate a novel, scalable and transferable virtual reality (VR) based pedagogical ecosystem that provides learners with the relevant skill training to address existing skilled worker shortage in the area of green energy and environmental engineering. This will facilitate the growth of new jobs and training opportunities for entry-level positions in this sector. Specifically, the ecosystem will use cloud services such as the Amazon Web Services (AWS) for backend technology and 3-D gaming engines such as Unity3d for front-end rendering to create immersive educational modules that cover technical topics on green energy and environmental engineering. The ecosystem will introduce and sustain inside and outside the classroom: 1) a unique blend of cloud-based self-contained VR modules from STEM areas of environmental engineering that feature student deliverables such as virtual renewable energy installations (wind-farms, solar-farms, etc.) for optimal energy generation, and virtual designs for energy automation systems along with strategies to operate them at optimal capacity 2) a cloud-based technological framework to deliver VR educational modules, and 3) a play-based learning pedagogical model Play-Curricular activity-Reflection and Discussion (PCaRD) that assess the application of students? independent thought processes, along with design and operational skills in creating these deliverables. <br\/><br\/>The creation of a VR-based pedagogical ecosystem in the context of the specific green energy themes will provide insight into the opportunities for using computation and bandwidth as a replacement for selected physical laboratories and field trips. The instrumentation of the VR modules will provide data on the impact of network bandwidth and latency on the educational experience. This data will be directly useful for designing and provisioning larger scale US Ignite VR-based education projects.<br\/><br\/>The pathways to the classroom include community college level of education via Drexel?s partnership with Burlington County College, high schools via an active GK-12 grant, and undergraduate courses at Drexel?s College of Engineering. The implementation plan, course materials, and associated technology will be regularly updated and made available to the public via a highly interactive web portal in a format that is easily adaptable for implementation in other universities. The results generated from this effort will be shared via education research conferences, journals and venues, and will help inform 1) the US IGNITE community of the benefits and limitations of using the proposed pedagogical ecosystem, and 2) the ongoing national dialogue on cloud-based VR education, thereby helping all stakeholders better align their educational efforts.","title":"EAGER: US Ignite: A Cloud Enabled Virtual Reality Based Pedagogical Ecosystem for Green Energy and Environmental Engineering Education","awardID":"1354572","effectiveDate":"2014-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":[563558,563559,563560],"PO":["564993"]},"210340":{"abstract":"An EAGER grant for the Values In Design analysis for Future Internet Architectures--Next Phase (VID4FIA-NP) project supports experimentation with a new model for interdisciplinary collaboration, using the Future Internet Architecture projects as an exciting testbed, and integrating social, ethical, legal, and economic issues with the technical work of the FIA-NP project teams. VID4FIA-NP will build a network of VID experts and find common ground with the challenges faced by the FIA projects, using the VID methodologies for analyzing and designing technology that recommends social values that can serve as design requirements alongside more traditional technical constraints. These activities will produce events that connect VID approaches with the prototyping and testing process, and working papers, possible joint publications and other documents formalizing our findings and methods.<br\/><br\/>Intellectual Merit: Within the extensive community of researchers and scholars there are diverse, hotly contested views on what it means to say that technology is or is not value free. There are smaller demonstrations of the claim that features of technology can actively be adjusted to yield morally and socially relevant outcomes. VID4FIA-NP will make significant, convincing contributions to this debate by providing opportunities for social scientists, humanists, economists, legal and policy experts, and technical experts to collaborate on gritty design features that are socially and ethically important. Beyond potential contributions to the general understanding of social dimensions of technology, the project could yield insights into how to operationalize abstract concepts such as security, privacy, etc. and how to implement them in architecture, protocol, mechanism, etc. Not only could these contributions directly affect the FIA-NP projects, they could have significance for IT design generally, and even beyond, to other technologies. <br\/><br\/>Broader Impacts: Living with the consequences of technology, it is inevitable that we applaud some and bemoan others. Such evaluation can be retrospective, but for approaches in the VID network, there is commitment to pro-action, making adjustments in material elements of systems and devices systematically can affect socially relevant outcomes. Aware of the pitfalls of naive technological determinism, the payout measured in terms of systems and artifacts that promote--or do not subvert--attainment of societal values, is potentially great. The opportunity to test out these ideas in a research context as ambitious as the FIA-NP projects holds promise for better technology and deeper understanding of the mutual shaping influence of material design on the one hand and values on the other.","title":"EAGER - Values in Design for Future Internet Architecture - Next Phase","awardID":"1355398","effectiveDate":"2014-01-01","expirationDate":"2015-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[563668,563669],"PO":["565090"]},"211000":{"abstract":"The Computational Cybersecurity in Compromised Environments (C3E) is a community of interest that has annually gathered, since its inception in 2009, to address some of the most arduous challenges of cybersecurity. Through these annual workshops, organizers bring together a diverse group of top academic, commercial, and government experts to discuss innovative approaches to the cybersecurity challenges facing our Nation. This travel grant will support an estimated twenty-five travelers to the 2014 C3E workshop. The results of this workshop will be widely disseminated in the open literature. Additionally, this workshop and its challenge problems will create excellent opportunity for students to engage with leaders in the field in the context of unsolved problems.","title":"Computational Cybersecurity in Compromised Environments (C3E) Workshop Support","awardID":"1419097","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[565238],"PO":[565239]},"208977":{"abstract":"As cognitive radio (CR) research advances to multihop and complex systems over large geographic regions, the spectrum utilization enhancement should be generalized to fully exploit the spectrum usage diversity in three dimensions (3D): time, frequency, and space, with new emphasis on the under-explored spatial dimension. Accordingly, this project focuses on the following three research objectives. The first one is to utilize the recent advancements in statistical learning over big data to develop efficient 3D spectrum sensing schemes, where a hierarchical approach is taken in developing novel finite-bit and single-bit learning techniques to efficiently explore the correlation structure across the three dimensions, with an advanced distributed approach also developed. The second one is to develop two key building blocks in large-scale CR networking based on the 3D spectrum sensing: 1) a novel multi-scale routing scheme to enhance the overall spectrum utilization, with a focus on exploiting the layered spectrum usage correlation structure in the spatial dimension; and 2) a reliable hierarchical common control channel identification scheme. The last research objective is to validate some key aspects in the proposed sensing and networking schemes via both intensive simulations and a concept-proving testbed. Throughout the project, an interdisciplinary approach is taken to combine the methods of statistical learning, signal processing, and wireless networking, with the core built upon the hierarchical treatment of both spectrum usage statistics and CR networking methodologies. The project provides both theories and algorithms for large-scale spectrum sensing and cognitive networking. Through a coherent education plan, the research findings will be incorporated into courses, and disseminated to the community via journal papers and conference presentations.","title":"Collaborative Research: EARS: Large-Scale Statistical Learning based Spectrum Sensing and Cognitive Networking","awardID":"1343189","effectiveDate":"2014-01-01","expirationDate":"2017-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7976","name":"EARS"}}],"PIcoPI":[560128],"PO":["557315"]},"209967":{"abstract":"This research project aims to develop a system-level theory of energy efficient communication that incorporates the energy consumed in transmission as well as in the supporting transmitter\/receiver circuitry. The existing theoretical foundation that guides the design of practical communication systems -- traditional information theory -- focuses almost exclusively on the transmit energy. For many modern short-distance communication systems, however, the energy consumed in the processing circuitry dominates over the transmit energy. The proposed research will advance the existing theory and practice by examining flows of information in the supporting circuitry in order to obtain a fundamental understanding of total (transmit + circuit) energy. A three-layer approach will be adopted to reduce energy consumption: (i) The Foundational Layer for expanding the frontiers of traditional information theory by incorporating processing energy at the transmitting and receiving ends; (ii) The Design Layer for novel designs of strategies including error-correcting codes that minimize the total energy; and (iii) The Validation Layer for assessing the energy reductions for various applications through strategies proposed in the Design Layer.<br\/><br\/>Applications ranging from education, healthcare, manufacturing, and commerce today rely on uninterrupted and ubiquitous connectivity. Consequently, it has become increasingly important to keep the energy consumed in communication networks low, both for improving battery life of wireless devices and for sustainability of high-energy wired communication (such as ethernet links in data centers). Broadly speaking, the traditional design approach follows a \"division-of-labor\": the transmission strategy is first chosen to best approach the information-theoretic limits on minimum transmit energy, and then the most energy-efficient circuits are built to support the chosen strategy. The proposed research rethinks this division-of-labor by jointly designing the transmission strategy and circuits to maximize system-level energy efficiency. This research necessitates simplification and synthesis of concepts in communication, computation, and circuits. The project incorporates several educational and outreach efforts, including organizing interactive workshops for K-12 students and developing new material for both theoretical and experimental classes towards educating cross-disciplinary leaders not just in research, but also in industry where such education is essential for increased innovation.","title":"CAREER: Towards Green Communications Using an Information-Lens: Foundations of the Joint Design of Communication Strategies and Circuits","awardID":"1350314","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}}],"PIcoPI":[562848],"PO":["564924"]},"208339":{"abstract":"Cleveland State University (CSU) in collaboration with the University of California San Diego (UCSD), proposes CISS -- Computing in Secondary Schools -- a CS10K project designed to provide computer science education professional development to high school teachers throughout the state of Ohio. Through participation in CISS, high school teachers will become fluent in computational thinking and will develop the skills needed to teach the new AP CS Principles course. The teachers will be supported through access to course materials, pedagogy, mentoring, weekly telephone meetings, mid-year workshops and technical coaches. Teachers will also have access to an online knowledge repository, CS Learning Commons, which will be used to address challenges that arise and share best practices. Specifically the project will (1) recruit, train, and assist 30 high school teachers in teaching CS in their classroom; (2) prepare and teach an open online course focused on CS education, which will include both content knowledge required to teach CS at the high school level as well as the pertinent pedagogical techniques; (3) widen the CS teacher pipeline by offering a teacher licensure pathway; (4) create a replicable network design model for CS teacher training and mentoring by engaging with an online school network; and (5) establish CS mentoring programs for high school teachers with a focus on gender diversification and participation by minority teachers. Additional partners include the Ohio STEM Learning Network (OSLN) and school districts geographically dispersed throughout the state of Ohio. This project will leverage the work already done on ComPASS CS 10K award and will increase our understanding of its scaling to a wider audience.","title":"CE21: CS10K: CISS: Computing in Secondary Schools","awardID":"1339312","effectiveDate":"2014-01-01","expirationDate":"2016-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7382","name":"Computing Ed for 21st Century"}}],"PIcoPI":[558312],"PO":["561855"]},"210000":{"abstract":"Computers are increasingly used to monitor and manage many aspects of our daily lives. These systems are often required to work together to solve complex problems that are rapidly changing. Current approaches to addressing these situations develop tailored distributed protocols that are verified through empirical testing. This project increases the practical applicability of distributed problem solving techniques by developing a theoretical model of these problems based on thermodynamic theory. Using this model, a protocol's performance can, for the first time ever, be predicted under previously untested conditions.<br\/><br\/>This theoretical model is validated through extensive empirical evaluation and this project develops a new protocol that alters its problem solving strategy to maximize the trade-off between deliberate and reactive decision making based on environmental dynamics. This protocol is applied to address a pressing practical problem: allocating telescopes for tracking objects in Low Earth Orbit (LEO). With nearly all of our manned space missions and satellites in LEO, effectively monitoring space debris has broad implications to society at large and scientific progress along numerous directions.<br\/><br\/>This transformative research combines cross-disciplinary ideas from artificial intelligence, distributed systems, and statistical physics. The educational initiatives in this project directly address the recruitment and retention of students, especially focusing on women and minorities, into Computer Science by generating excitement through the Heartland Gaming Expo and by utilizing a new peer outreach program, called Engineering Ambassadors.","title":"CAREER: Problem Solving in Dynamic, Distributed Environments","awardID":"1350671","effectiveDate":"2014-01-15","expirationDate":"2018-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[562915],"PO":["565035"]},"211012":{"abstract":"The award supports the attendance of fifty US-based students to attend the sixth Federated Logic Conference (FLoC 14) which will be held in Vienna, Austria, in July 2014, as part of the Vienna Summer of Logic (VSL 14). The federated logic conference is an event which brings together ten major international conferences in the area of Formal Methods, and around 75 satellite workshops. While the participating conferences are normally held individually by their local conference organization on an annual basis, they all agree to this joint and federated event to be held every three-four years.<br\/><br\/>Enhancing the security, privacy, usability, and reliability of computing systems is widely accepted as one the grand challenges facing the computing-research community. Formal Methods have emerged as one of the primary approaches towards that goal. A federated conference provides an opportunity for accelerating research via synergy between the different strands of research in Formal Methods. It is also an outstanding training opportunity for young researchers, as it offers them a grand view of the whole area.","title":"Student Support for the 2014 Federated Logic Conference","awardID":"1419283","effectiveDate":"2014-01-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[565263],"PO":[565264]},"211056":{"abstract":"The concurrent nature of human-computer interaction (HCI) can result in situations unanticipated by designers. Usability may not always be properly maintained or human operators may not be able to complete the task goals that a system was designed to support. This can result in poor adoption of the system, decreased productivity with its use, or unsafe operating conditions. Mathematical tools and techniques called \"formal methods\" exist for modeling and providing proof-based evaluations of different elements of HCI including the human-computer interface, the human operator's task analytic behavior, and usability. Unfortunately, these approaches require the creation of formal models of interface designs, something that is non-standard practice and prone to modeling error. This project will show that a formal-methods approach can be used to automatically generate formal human-computer interface designs that are guaranteed to adhere to usability properties and to support human operator tasks. Specifically, a system that uses the L* machine learning algorithm will be created that will generate formal interface designs using task analytic behavior models and formal representations of usability properties.<br\/><br\/>The researchers will implement an interface generation system, test its performance with a suite of benchmark examples, and evaluate its ability to generate an interface for a realistic application. To implement the generator, the researchers will first construct an oracle system capable of accepting or rejecting interface state transition sequences based on analyst-specified task models and usability properties. This oracle system will be connected to an implementation of the L* algorithm that will progressively learn a formal interface model by observing how generated sequences of interface state transitions are accepted or rejected by the oracle. Artificial test cases that exploit the different features of the system will be used to generate interface designs, and formal verification will be used to check that the designs exhibit the intended properties. The system will be used to generate the human-computer interface for programming a patient controlled analgesia pump, a medical device that automatically delivers pain medication to patients intravenously. The generated interface will then be compared against the formal interface design standard that exists for these devices.<br\/><br\/>The automatic generation of human-computer interface designs from task analytic models and usability properties constitutes a novel approach to user-centered design. By using this method in the creation of interfaces, designs will be guaranteed to always exhibit certain properties. This will potentially help ensure that designs will be accepted by users, improve the associated system's efficiency, and facilitate safer operation. The formal representation of user interfaces that result from the implementation of this method will also permit HCI designers to pursue formal analysis and verification of other interface properties, and will facilitate the automated generation of test cases for usability verification and certification purposes.<br\/><br\/>Broader Impacts: The proposed research has the potential to significantly change the way human-computer interfaces are designed. By guaranteeing that generated interfaces are always usable, this research could improve the usability and safety of user interfaces across many domains. The performance guarantees of the generated designs could allow development and testing times to be reduced, thus decreasing development and software costs. This work will also enhance the education and research experience of UIC's diverse engineering student body. The computational resources acquired for this work will be made available to student for research projects and study results will be incorporated into the curriculum of the PI's graduate and undergraduate courses. Project results will be presented at conferences by student researchers and published with open access in high quality journals. A dedicated website will be used to rapidly disseminate results and tools produced during this effort.","title":"EAGER: Automatically Generating Formal Human-Computer Interface Designs From Task Analytic Models","awardID":"1429910","effectiveDate":"2014-01-01","expirationDate":"2015-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[565361],"PO":[565362]}}