{"90403":{"abstract":"The IT component of information system development has been radically simplified in recent years. Many corporations are now attempting to jointly design business processes and IT systems, to integrate workflows and information flows across business processes. The majority of these efforts fail, because there is a fundamental contradiction in the way that we design this type of \"boundary-spanning\" information system (IS). Stakeholders need to establish common visions of design goals and information flows, but can only do this in situations where the context for doing these things is already well defined and stable - so how can they do it in rapidly-changing or evolving development contexts? Understanding why something is done in a specific way is often possible only within the culture and local knowledge of a specific work-group. We lack ways to share this understanding across workgroups, or even to determine what knowledge is significant for an effective IS design.<br\/><br\/>Most boundary-spanning design projects employ the type of design process used for IT system development. Goals for change are defined, requirements for a solution are specified, then the solution is implemented. But this approach is not appropriate for the design of ill-defined, cross-functional information systems, where the boundaries and goals for change evolve as the design proceeds. The PI's prior studies indicate that stakeholders from different areas of the organization perceive organizational processes and goals in very different ways and are often unaware that they understand the same concept differently. Stakeholders' partial and different understandings of organizational processes are a major obstacle to developing a shared vision of design problems and solutions. Establishing a common language for people with different backgrounds and expertise is problematic. Consequently, there is too little input from IS users and organizational stakeholders to define an appropriate system.<br\/><br\/>There are three major challenges in designing that involves stakeholders from multiple disciplines and backgrounds, which are not resolved by current research: The need for a common language, that allows participants from a variety of organizational areas and backgrounds to understand and interpret the processes and concepts of design in the same way; The need for effective \"boundary objects\", to mediate and integrate knowledge that is distributed among multiple stakeholders; The need to understand the process drivers that permit a design group to rapidly agree and constantly validate a common vision of their design. This project will develop a new theory of knowledge integration for short-term, dynamic cross-disciplinary teams designing information and communication technologies (ICTs). The PI will propagate this knowledge both to typical IS practitioners and to new groups of people who are key stakeholders but not typically first-class participants in critical IS design activities.<br\/><br\/>Broader Impacts: This research will affect the design-related area of distributed problem-solving in new contexts, both organizational and educational. New ways of supporting collaborative, problem-centered learning will be developed, that will alleviate the disadvantages currently faced by women, students with disabilities, and ethnic minority individuals because they do not share the mainstream cultural traditions or genres that drive the negotiation of outcomes in goal-driven processes. By developing collective problem-solving techniques and performance-measures that shift the focus from goal-achievement to inclusive problem-definition, these communities will be provided with the opportunity to participate more fully in group work and to exert increased influence, both in business organizations and in the classroom. Current problem-based learning emphasizes complex, real-world problem investigation; this emphasis feeds back into the practical, strategic applications of the current project. Results will be disseminated broadly, through the Drexel University education initiative, and through the PI's current affiliations with Philadelphia Knowledge Management industry group, through industry seminars and workshops in the two collaborating organizations, and through the AIS Cognitive Research Special Interest Group.","title":"CAREER: Distributed Cooperation in Boundary-Spanning IS Design","awardID":"0347595","effectiveDate":"2004-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[237068],"PO":["564456"]},"90828":{"abstract":"This proposal requests support for the travel expenses of junior participants from the U.S. who would otherwise not be able to attend ISIT, such as graduate students, research associates, and new faculty hires. These participants would be individuals whose papers have been selected for presentation at the Symposium, but who lack funds and would not be able to attend without travel support. ISIT has a strong tradition of junior participation that has helped it to maintain its reputation as a leading forum for new ideas. IT is proposed that the co-chairs of the symposium, Daniel Costello and Bruce Hajek, make the awards.","title":"2004 IEEE International Symposium on Information Theory Travel Support; Chicago, IL; June 27-July 2, 2004","awardID":"0349797","effectiveDate":"2004-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508186"],"PO":["564898"]},"89391":{"abstract":"Van de Geijin, Robert<br\/>CCF-0342369<br\/><br\/>The proposed project will develop prototype tools for the automatic<br\/>derivation, automatic implementation, automatic performance modeling,<br\/>and automatic stability analysis of high-performance sequential and<br\/>parallel linear algebra libraries.<br\/><br\/>As part of the proposed project, a set of tools will be created that<br\/>will merge the capabilities of the above described prototypem (semi-) automated systems. The functionality will be extended to encompass automated generation of code targeting APIs for different languages, automated cost analysis for architectures with multi-level memories (including distributed memory) as well as automated stability analysis. The input to the system will be matrix operations in form of linear algebraic expression. The output will be entire families of algorithms for the given operations, high-performance implementations for sequential and parallel architectures, cost analyses of the implementations, and stability analyses of the algorithms. A demonstration of the system will be the automatic creation of a next-generation high-performance library with functionality that encompasses LAPACK and more, parameterized for a broad range of sequential and parallel architectures.<br\/><br\/>It is the reduction to a system of the knowledge that underlies the<br\/>development of high-performance linear algebra libraries that<br\/>represents the primary contribution to science of this project.<br\/>Automation of the kind that is targeted is the ultimate demonstration<br\/>of the level of understanding that has been achieved.<br\/><br\/>The success of the proposed work will then measured by: (1) the<br\/>broadness of applicability of the automated tools; (2) the amount of<br\/>effort required to accommodate new architectural features; and (3) the<br\/>ease with which new functionality can be accommodated by the tools.<br\/>In other words, the measurement of success will largely be with<br\/>respect to productivity, maintenance, and applicability.","title":"Automatic Tools for Deriving, Analyzing, and Implementing Linear Algebra Libraries","awardID":"0342369","effectiveDate":"2004-03-01","expirationDate":"2008-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["556801"],"PO":["565272"]},"95370":{"abstract":"This effort is in support of the NSF Informational Meeting on Programmable Wireless Networks. The purpose of the Informational Meeting is to share with the community the goals and scope of the focus area. By including presentations from government, academia, and industry, this meeting will enable attendees to get a sense of the state of the art in programmable wireless networking, and the key challenges facing the focus area and sub-areas thereof. It will help the community better target proposals and be more efficient. Finally, it will start to build a community for the focus area, perhaps encouraging early collaboration and potentially strengthening the pool of submissions.","title":"Informational Meeting on Programmable Wireless Networks; February 2004; Arlington, VA","awardID":"0414779","effectiveDate":"2004-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["209556"],"PO":[250082]},"97295":{"abstract":"This is funding to partially support a workshop to explore the problems of information overload, the fragmentation of attention, and the general busyness and speed up of everyday life. The goal of the meeting is to investigate this imbalance, to begin to map its causes and conditions, and to explore remedial actions. The workshop will be held in Seattle on May 10-12, 2004, and is expected to attract approximately 50 participants from a number of disciplines and walks of life, including the arts and humanities, technology, library and information sciences, economics, education, and religion. Participants will be selected to satisfy a number of criteria, including gender balance and representation of under-represented groups. The workshop will begin with a Public Forum on Information and the Quality of Life at Town Hall in downtown Seattle on the evening of May 10, attended by the workshop invitees and open to the general public at no charge. It will continue with two days of invitation-only meetings on the University of Washington campus. Discussion topics will include: the stress of overload; why are we so overloaded; silence and sanctuary; the role of public institutions in achieving balance; and sanctuary in, or from, cyberspace. There do not appear to have been any other recent meetings on exactly this subject. Partial funding for the workshop is being provided by the MacArthur Foundation, by the UW Simpson Center for the Humanities, and by the Online Computer Library Center.<br\/><br\/>Broader Impacts: The PI's goal is to raise public awareness of the workshop topics and to stimulate broad discussion of them. To these ends, he will write a report summarizing the workshop presentations and its major findings, and will make it available online. In addition, he has secured agreement from the journal Ethics and Information Technology (Kluwer) to publish a special issue devoted to the workshop's findings, that will include a report on the workshop and papers produced by some of the participants. The PI hopes to generate extensive press coverage of the workshop, and plans to organize (in conjunction with the UW Libraries, the UW Henry Art Gallery, and the Seattle Public Library) public meetings at local (Seattle) libraries and museums on the workshop discussion topics, as well as panel(s) on these topics at one or more upcoming ACM conferences.","title":"Workshop on Information, Silence, and Sanctuary","awardID":"0424586","effectiveDate":"2004-03-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["427132"],"PO":["495796"]},"88264":{"abstract":"NATIONAL NANOTECHNOLOGY INFRASTRUCTURE NETWORK (NNIN)<br\/><br\/>The National Nanotechnology Infrastructure Network (NNIN) is a partnership of 13 institutions (Cornell University, Georgia Institute of Technology, Harvard University, Howard University, North Carolina State University (affiliate), Pennsylvania State University, Stanford University, University of California at Santa Barbara, University of Michigan, University of Minnesota, University of New Mexico, University of Texas at Austin, and University of Washington) that provides multi-faceted, interdisciplinary, and broadly-accessible infrastructure supporting both near-term and long-term needs identified in the National Nanotechnology Initiative. The partnering facilities are open laboratories providing outstanding service to the external user, comprehensive training and staff support, and support of interdisciplinary and emerging areas of research, with openness to new materials, techniques, and applications.<br\/>Some of the key scientific, educational, and societal needs supported by the network are:<br\/> Easy implementation of nanotechnology experiments through integration of knowledge and coordination of large numbers of different types of patterning and processing steps, together with the complex tasks of synthesis and assembly at the molecular scale<br\/>Specialized techniques for characterization and metrology at the atomic scale <br\/>Support of advanced and robust modeling and simulation through software and hardware resources with strong technical support<br\/>Technology transfer and the sharing of new techniques through in-person and web-based interactions<br\/>Education and technical training of new users who will be the leaders in nanotechnology <br\/>Public education about the opportunities and challenges of nanotechnology <br\/>Promotion of research in the social sciences so that future developments lead to the greatest possible societal benefits, and societal and ethical studies that focus on research, infrastructure, and the impacts of nanotechnology.<br\/>Nation-wide outreach across age groups and technical interests, with special efforts to reach non-traditional users and under-represented groups.<br\/>Active coordination and knowledge dissemination on safety, environment and health benefits and risks of nanotechnology <br\/><br\/>Specifically, the network provides: <br\/>Infrastructure for Research: The network provides on-site and remote access for users, from academia, small and large industry, and government, to advanced top-down patterning and processing and bottom-up synthesis and self-assembly, comprehensive integration capabilities for multi-step processes, state-of-the-art characterization for hard and soft materials, the development of tools and techniques, and a comprehensive web and computation infrastructure in support of nanotechnology. The network has easy user access that enables a diversity of projects efficiently and at low cost: e.g., molecular-scale electronic contacts; use of functionalized nanotubes; integrated mechanical, electronic, fluidic, and bio-systems; advanced types of microscopy; and a large ensemble of other projects. The network also develops tools in support of future research and nano-manufacturing, including imprint and soft-lithography with applications in electronics, microfluidics, and nanobiotechnology. <br\/>Infrastructure for Network Web and Computation: The network's computation and web-based infrastructure provides a centralized resource for organizing and distributing the rapidly-growing knowledge base at the foundation of nanoscience and engineering. It includes training in tools, processing, and synthesis techniques; classes; discussion groups; an open text-book with links to the technical resources and data-bases; and technical support for robust computational tools for design, simulation, and modeling. The web-based infrastructure also comprehensively links our initiatives in education, outreach, and societal and ethical studies in order to provide nation-wide access.<br\/>Collaboration and External Interactions: The network employs connections and extensive collaborations with national and industrial laboratories, and with foreign institutions. Through these partnerships and joint meetings and workshops, we share expertise and perspectives, provide specialized training opportunities, coordinate access to unique instrumentation, and transfer newly developed technologies. <br\/>Infrastructure for Education, Human Resource Development, Outreach, and Societal and Ethical Studies: Education, human development, outreach, and societal and ethical studies components are thoroughly integrated throughout the network. Our goals are to spread the benefits of nanotechnology to new disciplines, to educate a dynamic workforce in advanced technology, and to become a teaching resource in nanotechnology for people of all ages and educational backgrounds. Network-based education and information tools and comprehens","title":"NNIN: National Nanotechnology Infrastructure Network","awardID":"0335765","effectiveDate":"2004-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7731","name":"OTHER GLOBAL LEARNING & TRNING"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1743","name":"NATIONAL FACILITIES"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1991","name":"CHEMISTRY PROJECTS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"8815","name":"Studies of Policy Sci Eng Tech"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1516","name":"RESOURCES & INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1674","name":"NANOSCALE: INTRDISCPL RESRCH T"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1675","name":"NANOSCALE: SCIENCE & ENGIN CTR"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7601","name":"NAT NANOTECHNOLOGY INFRAST NET"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"7641","name":"INT'L RES & EDU IN ENGINEERING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1788","name":"NANOMANUFACTURING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1179","name":"Enviro Health & Safety of Nano"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1491","name":"BIOTECH, BIOCHEM & BIOMASS ENG"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1101","name":"RESEARCH RESOURCES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"7634","name":"BIO CENTERS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7227","name":"ITEST"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7259","name":"INFORMAL SCIENCE EDUCATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7412","name":"ADVANCED TECH EDUCATION PROG"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7645","name":"DISCOVERY RESEARCH K-12"}}],"PIcoPI":["511217","492139","457977"],"PO":["564454"]},"93470":{"abstract":"Gonzalez, Avelino J. University of Central Florida Special Project: Acquisition, Preservation, and Re-Use of Programmatic Knowledge . This proposal, striving to provide tools and methods to manage essential knowledge in business organizations, aims at preserving valuable and volatile knowledge in a knowledge-based medium for ease in re-use. The work represents a controlled investigation into the process of managing knowledge using as a case study the programmatic knowledge of NSF's Industry\/University Cooperative Research Centers program (I\/UCRC) enabling future re-use of the elicited knowledge. Programmatic knowledge will be elicited from the subject matter experts at the NSF I\/UCRC program office as well as at various centers. The knowledge will be incorporated into a knowledge-based system for preservation and reuse. After validating and verifying the system, training will ensue. Rigorously measuring the benefits, an evaluation of its projected usefulness will follow.<br\/><br\/>The intellectual merit and contributions of the proposed project lie in the long-term case study about the application of modern knowledge-based techniques in knowledge management within the real-world domain. Long-term case studies can provide invaluable experience in knowledge elicitation, representation, and re-use for the knowledge management community. These studies are scarce in the published literature.<br\/><br\/>Broader impact is addressed through students and potential generalization of the process to other organizations. The project involves two graduate students in computer engineering addressing elicitation and development. One, focusing in knowledge elicitation, will reside in DC\/VA area and will attend and follow closely the site visits necessary for the program. The other, focusing in validation and verification, will receive the knowledge and contribute in the development of the expert system. Moreover, the case study will be incorporated into classes in knowledge management.","title":"Special Projects: Acquisition, Preservation and Re-use of Programmatic Knowledge","awardID":"0406008","effectiveDate":"2004-03-15","expirationDate":"2007-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1491","name":"BIOTECH, BIOCHEM & BIOMASS ENG"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["496768"],"PO":["557609"]},"96694":{"abstract":"SGER: SALT: Molecular Computing with Regular Crystals<br\/><br\/>Abstract<br\/><br\/><br\/>The research will investigate a massively parallel three-dimensional computing architecture implementing a new family of cellular automata called Salt. Transitions in the automata are governed by a 6-cycle state update process that alternates between two disjoint sets of cells in a regular lattice. It may be possible to construct such a regular crystal lattice structure at a molecular scale resulting in unprecedented density and parallelism. The physics and topology of such systems are suited for solving problems such as computational fluid dynamics and protein folding. <br\/><br\/><br\/>In this work we will investigate computational models that exploit the Salt architecture, and conduct preliminary analysis of the engineering feasibility of Salt models at the physical level. Long-term efforts are directed towards nanoscale construction of these devices and identifying suitable programming models for Salt hardware.","title":"SALT: Molecular Computing with Regular Crystals","awardID":"0421729","effectiveDate":"2004-03-15","expirationDate":"2006-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[254137],"PO":["366560"]},"93064":{"abstract":"Abstract<br\/><br\/>The project is an exploratory research into the potential of using a new promising programming paradigm, which combines two agent-based concepts: mobile agent computing and multiple collaborative agent systems, for emerging distributed applications. One major obstacle that hinders the development of mobile agent systems is due to the concern of agent protection against malicious hosts. The research conjectures that the issue can be addressed and the security of agents can be enhanced by relying on the concept of protection as a whole, i.e., the secrecy and integrity of a mobile agent processes can be better protected through dispersion of its functions and data resulting in a system of multiple collaborating mobile agents. Viewing from a different angle, the research extends multiple agent systems with a new dimension in mobility. This extension will broaden the application of distributed collaborative agent systems. The goal of this research is to prove the feasibility and the holistic effect of unifying mobility and distributiveness in the design of future Internet services, and meanwhile, to identify system requirements and their supporting algorithms\/protocols in this new computing paradigm. Since the proposed research is on the design of a general computing system architecture for distributed applications, its impact will be broad and potentially useful for any network-based applications that require agent collaboration. The initial system assumption is most likely to be well suited for e-commerce systems where security is an essential requirement. From the educational perspective, the project is ideal for research pursuing graduate students since it involves a broad spectrum of fundamental research topics in algorithm and theory, distributed systems, mobile and pervasive computing, and can cross into AI and language design.","title":"SGER: A Computing Paradigm for Collaborative Multiple Mobile Agent Applications","awardID":"0404113","effectiveDate":"2004-03-01","expirationDate":"2006-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["530417"],"PO":["499399"]},"86530":{"abstract":"Simulation has become a critical component of the scientific method, with the resulting demands for<br\/>computational power continually pushing the limits of available hardware. Scientific applications need to<br\/>be tuned to acheive high efficiency, but hand tuning by application scientists cannot keep pace with the ever changing features of the underlying hardware. It is not uncommon for applications that involve a large amount of communication or memory operations relative to computation to run at under 10% of the peak performance of a machine. The goal of the project is to address the widening gap between peak performance of computers and attained performance of real applications by developing several innovative approaches to address such challenges. Namely: design new automatic tuning techniques for dense linear algebra, sparse linear algebra, and inter processor communication kernels; target emerging architectures of importance to the high performance computing community, including commodity processors with SIMD extensions, clusters, vector processors, and highly parallel machines; develop an intermediate representation and compilation model for these operations that will allow tuning of new operations to be incorporated into compilers and programming systems; deliver these capabilities to users by integrating them into languages (Matlab, UPC, Titanium); and explore the impact of new kernels on higher level algorithm design.<br\/><br\/>The project will deliver tuned kernels to users through standard libraries (BLAS, LAPACK, MPI, ScaLAPACK, PETSc) as well as parallel languages designed to make high end machines more accessible (UPC and Titanium), and will evaluate the impact of our work on large scale scientific applications that use these systems.","title":"ITR\/NGS: Automatic Performance Tuning for Large Scale Scientific Applications","awardID":"0325873","effectiveDate":"2004-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["558550","558475","436421"],"PO":["551712"]},"95286":{"abstract":"Software applications, large-scale web sites, and computing devices like mobile phones continue to increase in complexity as new features are added almost daily. Thus, help systems are needed and extremely important to enable users, novice users in particular, to cope with current interfaces. Despite their importance, studies continue to show that existing help systems are not very helpful at assisting users in accomplishing their tasks. One issue that is not reflected in these studies is the fact that help systems are also difficult to develop. Innovations are clearly needed in both the design and development of help systems. In this project, the PI will explore the solution space for improving the usability and maintainability of help systems, in order to lay an empirical foundation for future research that will result in innovative, usable, and maintainable help systems. In particular, the PI will characterize the state-of-the-art in help systems, examine the use and development of help systems, and test the technological feasibility of two help system innovations: (1) a help-by-demonstration system which enables users to demonstrate their help needs and receive the appropriate help; and (2) a help search engine that harvests help content from various sources (such as online help, web sites, and discussion groups), organizes intelligently the content, and enables users to search for help on specific problems. Help use by users with visual and other impairments, in addition to novice and experienced users, will be examined.<br\/><br\/>This project will produce invaluable data on current help system use and development in the desktop, Web, and mobile device domains. These findings are needed to inform the design of more usable and maintainable help system solutions. The activities will also provide evidence of users' and developers' perceptions, and the technological feasibility, of the two proposed help system solutions. There is a major risk involved with changing the way that people use (and possibly create) help, and this preliminary work will minimize this risk. By the completion of this research, the innovations that are most feasible from all perspectives (user, developer, and technology) will be documented. <br\/><br\/>Broader Impacts. The existence of unusable and unmanageable help systems is a pervasive problem that affects users and developers universally. Thus, this project will benefit a broad population of help system users and developers. The research will include a user population that is typically excluded from studies on help use-namely, users with disabilities. Hence, findings will address the needs of users with diverse abilities and computer experience. Study results will be disseminated via journal articles, conference papers, and online, so that other help system researchers and developers can benefit from the findings.","title":"SGER: Toward More Helpful Help","awardID":"0414385","effectiveDate":"2004-03-01","expirationDate":"2005-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["250258"],"PO":["565227"]},"90392":{"abstract":"ABSTRACT<br\/>0347518<br\/>Sebastian Elbaum<br\/>University of Nebraska-Lincoln<br\/><br\/>CAREER: Leveraging Field Data to Test Highly-Configurable and Rapidly Evolving Pervasive Systems<br\/><br\/>Software test engineers cannot predict, much less exercise, the overwhelming number of potential scenarios faced by their software. Instead, they allocate their limited resources based on assumptions about how the software will be employed after release. Yet, the lack of connection between in-house activities and how the software is employed in the field can lead to inaccurate assumptions, resulting in decreased software quality and reliability over the system's lifetime. This project will address those challenges by developing profiling techniques with a small footprint to capture field data and adaptive testing techniques that can leverage that information. The two primary objectives are: 1) to design profiling mechanisms for large pools of users and<br\/>resource-cognizant monitoring schemes to reduce execution overhead, and 2) to develop adaptive testing techniques that continuously characterize software behavior to identify testing inadequacies, realign testing<br\/>resources, and extend existing test suites to overcome their limitations. Empirical studies will be regularly employed for technique evaluation and exploration. The educational component of this work aims at bringing an earlier appreciation of the real-world validation problems to the undergraduate classroom and prepare students well-versed in software quality and empirical validation.","title":"CAREER: Leveraging Field Data to Test Highly-Configurable and Rapidly-Evolving Pervasive Systems","awardID":"0347518","effectiveDate":"2004-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["518212"],"PO":["564388"]},"89413":{"abstract":"Calder, Bradely<br\/>CCF-0342522<br\/><br\/>A crucial problem for architecture and systems research involving program simulation is how to simulate the smallest amount of the program (to gather the results as fast as possible), and still achieve accurate results representative of the complete execution of the program. The goal of this proposal is to address this problem by fully developing techniques using phase analysis to guide efficient and accurate simulation and program analysis.<br\/><br\/>Our focus is to create new phase analysis techniques to provide very accurate and efficient simulation infrastructure for single program, and multi-threaded workloads. These new phase analysis techniques will also incorporate statistical sampling to provide a minimal set of simulation points with statistical guarantees.","title":"Using Phase Analysis to Perform Accurate and Efficient Simulation","awardID":"0342522","effectiveDate":"2004-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["293079"],"PO":["565272"]},"90393":{"abstract":"This research aims to develop theory, algorithms, and interactive visualization tools for mining a variety of high-dimensional data stemming from real world application areas, ranging from medical images to satellite data. The research aims to develop a unified framework for unsupervised feature selection, identify and characterize clustering criteria for different clustering objectives, create new similarity metrics that reflect the spatial and temporal nature of data in specific domains (e.g., earth science images), define measures of feature relevance\/irrelevance, and incorporate feature selection into hierarchical clustering methods. The new algorithms developed will benefit a variety of application domains; in particular, it will directly aid physicians studying the severity of emphysema and cystic fibrosis lung diseases, and help scientists discover interesting patterns of the earth surface. This project integrates research and education by providing hands-on research experiences to both undergraduate and graduate students in the classroom and in the lab. Moreover, the PI plans to work with the Society of Women Engineers and the Connections program to inspire female high school students to pursue careers in engineering and computer science and to insure that under-represented groups are involved in this research.","title":"CAREER: A Foundation for Unsupervised Learning of High-Dimensional Data","awardID":"0347532","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["521034"],"PO":["564316"]},"90470":{"abstract":"This research is on separating forwarding policy from route discovery in the Internet, allowing users to select among possibly many inter-AS paths available to them and enabling ISPs to more effectively manage the end-to-end behavior of their traffic. The researcher is exploring the concept of the so-called network capability that binds together a path request, an accountable resource principal, and an authorizing agent. Network capabilities form the basis of Platypus, a loose source routing protocol that composes authorizations from multiple ISPs to construct alternative inter-AS routes that can be independently validated and accounted for on the fly. The proposed research has the potential to significantly improve the performance, reliability, and robustness of the Internet. Network capabilities remove many of the obstacles to deploying sophisticated routing policies in the Internet, enabling network operators to explicitly authorize third parties to affect the network's routing decisions in an accountable, secure, and efficient fashion. The major result of this project will be an implementation of Platypus and a demonstration of its effectiveness in expressing and arbitrating amongst competing ISP routing policies. In particular, this research will show that capabilities can express both existing ISP routing policies and additional, more complex policies not supported by BGP. The Platypus implementation will be made freely available and deployed on the PlanetLab and Internet-2 test-beds.","title":"CAREER: Decoupling Policy from Mechanism in Internet Routing","awardID":"0347949","effectiveDate":"2004-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["548363"],"PO":["565090"]},"90481":{"abstract":"Computational geometry algorithms developed by practitioners in areas such as geographic information science, computer graphics, robotics, and pattern matching tend to be efficient for typical inputs, but inefficient for more complicated inputs. On the other hand, algorithms developed by computational geometry researchers are proved to be valid and efficient even in worst cases, but they are too often difficult to implement or slow in practice. These drawbacks have limited the widespread use of computational geometry techniques in fulfilling the practical needs of application areas. The goal of this research is to bridge the gap between practice and theory by developing algorithms whose correctness and bounds are proven, yet are simple to implement and perform efficiently on real-world inputs.<br\/><br\/>The research focus is two fold. First is geometric pattern matching with biological and medical applications, such as patient positioning in radiation therapy of cancer. Second is an investigation of effective algorithms for realistic input models. The project examines computational geometry algorithms for general classes of inputs that capture realistic data, yet have special properties that enable developing efficient algorithms for them. In particular, the notion of fatness plays an important role in this context. A convex object is called \"fat'\" if the ratio between its diameter and the radius of the largest ball enclosed in the object is at least some predetermined threshold. For non-convex objects the definition is more involved. In many cases, the worst-case scenario for an algorithm is exhibited only for input objects that are not fat, and these seldom appear in realistic scenarios. The goal of the research here is to develop algorithms, either by tailoring known algorithms or by inventing new ones that are easy to implement and run fast on these classes of inputs. The investigator is developing efficient algorithms for different variants of realistic input models, and also has shown that known algorithms can be executed efficiently for \"fat'' objects. The investigator's research (and complementary studies) shows that often these algorithms have guaranteed small asymptotic time bounds, as well as fast running time in practice.","title":"CAREER: Pattern Matching, Realistic Input Models and Sensor Placement. UsefulAlgorithms in Computational Geometry","awardID":"0348000","effectiveDate":"2004-03-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["451114"],"PO":["565157"]},"90371":{"abstract":"CAREER: Intelligently Managing the Memory Hierarchy of Future High-Performance Servers<br\/>Abstract<br\/><br\/>The research addresses the unique challenges facing high-performance server design in the billion-transistor chip era. Chip multiprocessors consisting of multiple cores that share the memory hierarchy and run many independent threads simultaneously, represent one direction for future parallel architectures. In such architectures, the contention for shared resources such as caches and off-chip bandwidth can produce thrashing and degrade the server performance significantly if not properly managed.<br\/><br\/> In this research a synergistic approach involving computer architecture, compiler, and operating systems is advocated to tackle the problem of resource management in chip multiprocessor based servers. An intelligent memory hierarchy is proposed (i) to provide fine-grain inter-thread management of resources like caches, off-chip bandwidth, and main memory (ii) to offload critical memory-bound functions from the server and (iii) to reduce context switch overheads.","title":"CAREER: Intelligently Managing the Memory Hierarchy of Future High Performance Servers","awardID":"0347425","effectiveDate":"2004-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["485790"],"PO":["550859"]},"96675":{"abstract":"This award will provide travel support for approximately eighteen graduate students to attend the 2004 ACM SIGCOMM Conference on Communications Architectures, Protocols and Applications to be held in Portland, OR, from August 30-September 3, 2004. The travel award will target graduate students, since attending conferences is an important part of their educational experience, and they often have limited funds. SIGCOMM is a highly esteemed international conference series that have endeavored to provide researchers and professionals with a cutting-edge forum to exchange and publish their work and ideas in computer networks and communications.","title":"Student Travel Support for ACM SIGCOMM 2004 Conference; Portland, OR; August 30-Sept. 3, 2004","awardID":"0421632","effectiveDate":"2004-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["485542"],"PO":["565090"]},"91560":{"abstract":"The Computing Research Association (CRA) has been awarded funds to support travel to a workshop of 25 female graduate students in computer science. The workshop, and other activities following the workshop, are already supported by a grant from Microsoft Corporation. This proposal would increase the number of attendees at the initial workshop from 45 to 70. The purpose of the workshop, and of the follow-on activities, is to provide mentoring and other support activities for female graduate students in CS&E.","title":"Travel Grant: Women's Graduate Cohort Project","awardID":"0353118","effectiveDate":"2004-03-01","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["561855","527984"],"PO":["289456"]},"81781":{"abstract":"ABSTRACT<br\/><br\/>ACI-0305453; PI: AMARASINGHE<br\/><br\/>There is evidence that streaming media applications are already consuming most of the cycles on consumer machines. StreamIt is a language and complier specifically designed for modern stream programming. Its goal is to raise the abstraction level in the streaming domain., providing a natural, high-level syntax that conceals architectural details without sacrificing performance, and provide a language and compiler that can abstract away cognitive complexities of programming next generation, heterogeneous computing grids. <br\/>The proposal will extend the current StreamIt language to include novel features such as variable rates, multi-dimensional streams, a messaging model and adaptable stream graphs so that the language can support a wide variety of applications in the streaming domain, and will also develop a large application base to evaluate the effectiveness of the language and the compiler. In addition the project will undertake a substantial compiler effort to create a robust and powerful compiler. With novel optimizations such as a space-time multiplexer, a stream graph partitioner, a phased scheduler a constraint scheduler, and liner transformer, as well as compilation technology necessary for heterogeneous computational platforms, and for substrates whose available resources can vary dynamically. Furthermore, the project will develop many optimizing compiler backends for different communication exposed architectures as well as next generation computing grids","title":"NGS: StreamIt: A Language and a Compiler for Streaming Applications","awardID":"0305453","effectiveDate":"2004-03-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["467768","382922"],"PO":["301532"]},"90430":{"abstract":"This project will explore early design support for creative uses of augmented reality (AR) in the arts and design. The primary goal is to advance the state of the art by enabling designers to work directly with AR as a new medium for dramatic experiences. The PI will identify and support appropriate design activities for AR experiences, create design tools that support these activities, and solve the fundamental technical problems to support the creation of these tools. The tangible manifestation of this research will be a system called DART (the Designers Augmented Reality Toolkit), and the primary impact will be increased understanding of the design and creation process of experiential AR systems, which offer tremendous promise for creating in-situ educational and dramatic experiences.<br\/><br\/>To these ends, the PI will focus on two design activities: rapid prototyping using informal content to promote reflective design, and experience testing using Wizard-of-Oz simulation. A primary contribution of this work will be to understand the computational abstractions necessary to support prototyping in the space between paper storyboards and fully working experiences. The PI believes that working with \"computationally active\" informal content in real physical spaces is the key to rapid design of experiential AR systems, and that dealing with the interactions between the physical and virtual worlds is what distinguishes AR design from other interactive system design. The PI expects the AR technologies and design tools he will create will provide the scaffolding necessary to allow both researchers and domain experts to push the limits of application design. Designers interested in any AR application domain will benefit greatly from the ability to rapidly prototype their ideas, and DART will extend Macromedia Director, the de facto standard for authoring multimedia content, to support the design, testing and deployment of AR experiences.<br\/><br\/>Broader Impact. Beyond the AR community, the tools to be developed in this project will be useful to non-AR designers in any field that involves simulated or physical space, such as VR, theater production, architectural visualization, or urban planning, even if the final content will not be delivered using see-through HMDs. The PI intends to freely distribute the technology created in this project, so as to empower a broad class of designers who have been unable to pursue their interests in these new media because of the expense of equipment and the difficulty in using the technology. The research will also provide a novel educational experience to those undergraduate and graduate students (in Media Studies, Computing and other disciplines such as Architecture and Industrial Design) who will be working together in the multi-disciplinary project teams in the PI's classes and on their own research projects. The PI further intends to explore how DART might be used for teaching some introductory computing concepts to non-CS students.","title":"CAREER:Supporting Design Exploration, Prototyping and Testing of Creative Augmented Reality Experiences","awardID":"0347712","effectiveDate":"2004-03-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["538206"],"PO":["565227"]},"90452":{"abstract":"This project addresses fundamental issues in causal reasoning with the long range goal of developing theoretical foundations that will facilitate building intelligent systems capable of operating autonomously in dynamic and uncertain environments. This project uses causal Bayesian networks to represent and reason about causal relationships and to address several related topics, including axiomatizing causal reasoning, model testing, identifying causal effects, and causal reasoning in structural equation models. In addition, the project will produce a causal reasoning software tool that can answer causal queries. Causal reasoning is intrinsically a multidisciplinary topic and the results of this project, particularly the resulting software tools, would be useful in other fields such as statistics, economics, health care, and social sciences. The educational component of this project includes curriculum development, student mentoring activities, and efforts to involve undergraduate students in research.","title":"CAREER: Reasoning with Cause and Effect: Model Testing, Axiomatization, and Identification","awardID":"0347846","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[237170],"PO":["564316"]},"90364":{"abstract":"Over the past decade, the Internet has emerged as one of the primary tools for information dissemination. The traditional point-to-point nature of the Internet has created a natural trend of increasingly redundant data across the network as applications and information sources increase in both scope and scale. While a wide variety of techniques have emerged to increase the efficiency of the network, the techniques have met with varying degrees of success. This career work aims to develop novel techniques for network efficiency through transparent bandwidth conservation while avoiding many of the pitfalls associated with previous approaches. Individual facets of the research include a paradigm-shifting approach to multicast (stealth multicast) whereby redundant packets are dynamically converted to\/from multicast, inter-domain peering protocols for expanding the benefits of bandwidth conservation, and extensive analsis\/exploitation of existing applications to increase redundancy but yet improve overall system efficiency. In addition, this project will serve as a catalyst for the development of large-scale group oriented applications. Furthermore, the work will have a direct impact on the efficiency of the Internet, Quality-of-Service pricing and resource management, and how applications are designed to cooperate with the underlying network. Beyond its research impact, this work will directly impact education through innovative studies on classroom methodologies and student development contests. The results will also be conveyed to industry and academia through the development of prototypes freely available via open-source.","title":"CAREER: Transparent Bandwidth Conservation Techniques","awardID":"0347392","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["540626"],"PO":["565090"]},"90343":{"abstract":"Expediting computations by operating in the quantum mechanical regime is<br\/>an intriguing idea. Apparently, some problems can be solved much faster by<br\/>quantum algorithms than by any randomized algorithm. The main thrust of<br\/>this proposal is to derive design methods for fast quantum algorithms, and<br\/>to study various applications such as pattern recognition and communication<br\/>problems. The main objectives of the proposed research are<br\/> the development of design methods for quantum circuits;<br\/> the development of design principles for quantum algorithms;<br\/> the application of such methods to pattern recognition applications;<br\/> and the development of primitives for quantum communications.<br\/>The project is integrated with an educational plan which supports the goals<br\/>the the PI's department. The objectives of the educational plan are<br\/> the further development of a course on quantum algorithms;<br\/> the development of a new course on randomized algorithms;<br\/> the development of experimental components and new material for<br\/>courses in Information, Secrecy, and Authentication;<br\/> an outreach component which explains and animates quantum algorithms<br\/>and protocols in the form of a virtual tour.<br\/>The educational plan includes the continued improvement of the course materials<br\/>for the above courses.<br\/>The PI will organize an interdepartmental Quantum Computing Seminar<br\/>and two mini-symposia so that students, faculty, and participants from local<br\/>industry get informed about the latest research in quantum computing.<br\/>The project provides opportunities for one undergraduate student and two<br\/>graduate students to participate in the research.","title":"CAREER: Design of Efficient Quantum Algorithms","awardID":"0347310","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}}],"PIcoPI":["451778"],"PO":["565157"]},"91586":{"abstract":"The objective of this research is to strengthen the theoretical foundations of computer graphics by carefully formulating its mathematical underpinnings, applying formal methods of computer science, and exploring fundamental connections with other disciplines. The work plan is organized into four categories: 1) mathematical underpinnings, 2) numerical methods, 3) computational complexity, and 4) formal methods. Within each category several specific projects are described.<br\/>Work done under this grant will depart from previous work in both the tools applied and in the areas investigated. Among the novel tools to be applied are mathematical methods from functional analysis (e.g. measure theory), information-based complexity (e.g. radius of information), and formal <br\/>methods of computer science (e.g. refinement calculus); these tools will be applied to fundamental problems of computer graphics, such as deriving and clarifying radiometric principles, placing a priori limits on the accuracy of image-based rendering, and differentiating images of non-Lambertian scenes. These projects are firmly rooted in previous work performed by the author.<br\/><br\/>Among the novel areas to be investigated are proving the correctness of rendering algorithms, \"inverting\" rendering algorithms in response to user queries, and formalizing the use of default assumptions, ambiguity, and contradiction in human-computer interaction. The fundamental educational objectives of this work are to infuse computer graphics with appropriate mathematical structure, to train future graphics researchers in the art of constructing rigorous proofs and formally verifiable algorithms, and to integrate the tools and fundamental concepts of computer graphics into the core computer science curriculum. These goals cannot be attained through the introduction of a single course, but will instead require exposing students to the necessary concepts at many levels. Toward this end, elements of computer graphics will be introduced into an existing sophomore-level course on the theory of computation, and an advanced graduate-level course will be devised that explores the interplay of computer graphics, human-computer interaction, and artificial intelligence, while emphasizing the role of mathematical abstraction and formal verification.","title":"CAREER: Mathematical Foundations of Computer Graphics","awardID":"0353204","effectiveDate":"2004-03-01","expirationDate":"2005-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[239874],"PO":["321058"]},"90322":{"abstract":"The Peer-to-Peer (P2P) paradigm allows potentially millions of hosts under different administrative controls to join a virtual system where they can exchange resources in a scalable manner and run distributed applications. As a result, wealth of services can be accumulated and disseminated efficiently promoting a huge economic and social impact. Despite the explosive growth in P2P applications, the P2P scalable and flexible architecture has not exhausted its potential. The key objective of this project is to address the challenges and opportunities that face the deployment of structured P2P systems. In particular, the primary focus is on the design and implementation of network protocols supporting new services that complement the traditional, mostly file-sharing applications, new schemes to locate services, new strategies to serve them that compensate for the discrepancies in capacities and intentions of different peers in the system, and a variety of optimizations in order to improve the users' experience. Also, this project introduces the so-called metric-induced topology inference and integration schemes that are used to characterize the impact of Internet traffic on P2P performance as perceived by service consumers, to optimize content distribution, and to support network-aware applications. This project will also deliver a prototype that will be made publicly available and will be deployed as a service to help disseminate the investigated ideas and to lay the ground for testing new ideas. The prototype will also serve a significant educational role as an invaluable tool in the classroom to bring hands-on experience to students about P2P technology.","title":"CAREER: New Directions In Managing Structured Peer-to-Peer Networks","awardID":"0347226","effectiveDate":"2004-03-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":[236898],"PO":["565090"]},"88706":{"abstract":"Title of Project: Track 2, GK12: Technology Integration Partnerships:<br\/>Bringing Emerging STEM Research into Grades 5-12 enabled by New Technologies<br\/>Institution: Columbia University<br\/>PI\/Co-PI: Jack McGourty\/Susan Lowes\/Elizabeth Sklar<br\/>Number of Fellows\/year: 6 Graduate and 6-9 Undergraduate<br\/>School District Partners: Manhattan High School Superintendency, Bronx School District<br\/>Target Audience: Grades 5-12<br\/>Setting: Urban<br\/>NSF Supported Disciplines: All STEM disciplines<br\/><br\/>Narrative Summary: An integral objective of this Track 2 project is advancing understanding of how to best integrate instructional technologies into the classroom. Teams of Fellows, Faculty, and K-12 teachers are investigating how to best integrate instructional technologies in support of standards based STEM topics within classroom imposed time, space and resource limitations. Using applied research techniques, all partnerships investigate, test, and evaluate how these technologies improve teaching and enhance student motivation and learning. <br\/><br\/>Intellectual Merit: The Technology Integration Partnership (YIP) project has four major goals: (1) to increase the access to, and the integration of, new technologies into the curriculum of STEM teachers who are working in urban environments; (2) to deepen the science, math and engineering content knowledge of these teachers; (3) to bring the excitement of emerging STEM research to 5th-12th grade students, offering them a window into future academic and career paths; and (4) to interest and excite STEM graduate students about education, giving them unique opportunities to improve their teaching and communication skills. Fellow and Teacher partners are expanding knowledge concerning best practices concerning technology in the classroom by developing the three technologies (probeware, robotics, and simulations) applied in the Track 1 project and by introducing three additional technologies (engineering design applications, remote lab experimentation, and educational games). <br\/><br\/>Broader Impact: The project's outcomes will provide a model of how engineering and applied science faculty and students can partner with urban school districts to support the integration of technology into the classroom in the service of standard-based curriculum on emerging STEM topics. All best practices and technology-enabled lessons will be disseminated through the project's established web site and lesson plans database (http:\/\/tip.columbia.edu).<br\/><br\/>Outcomes from Track 1: Eight Fellows and over 30 K-12 teachers have collaborated over the three-year period. The Fellow-teacher partnerships have clearly benefited both Fellows and teachers. Each Fellow and cooperating teacher developed between two and four curriculum units that use technology to address difficult-to-teach topics in the standard curriculum for that grade level, tested them in the classroom and revised them for posting on the website. Pre- and post assessments developed by Fellows-Teachers College faculty teams have demonstrated significant K-12 student learning of abstract math and science concepts as a result of using these new technologies in comparison with more traditional methods of instruction. Teachers report that Fellows have enriched the curriculum with their knowledge of the subject areas being taught, from global warming to bridge building to mechanical engineering to computer programming, in a way that would not have been possible without their expertise. They have been able to introduce topics and technologies that they would not otherwise have had the time or the confidence to try in their classrooms; and have gained access to badly needed resources, including hardware, technology expertise and content knowledge. Fellows' teaching skills have improved dramatically, as has their ability to explain the importance of their research to a non-specialist audience. Several undergraduates and one Fellow have embarked on a career path toward teaching in urban K-12 schools. This project is receiving partial support from the Directorate for Computer and Information Science and Engineering.","title":"Track 2, GK12: Technology Integration Partnerships: Bringing Emerging STEM Research into Grades 5-12 enabled by New Technologies","awardID":"0338329","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":["496707","504394","523503",232729],"PO":["559975"]},"90301":{"abstract":"This project investigates two different but intertwined lines<br\/>of research: (A) quantum computational complexity, and, <br\/>(B) polynomial approximation of Boolean functions and its <br\/>applications in quantum and classical complexity. The goals are: <br\/>(1) to develop fundamental mathematical tools for analyzing the <br\/>inherent power and limitations of quantum computing, and (2)<br\/>to enrich the connections of polynomial approximations of Boolean<br\/>functions with quantum and classical complexity theory, as well <br\/>as to develop fundamental techniques to solve the corresponding <br\/>approximation problems. <br\/><br\/>Towards these tow goals, a wide range of problems in both quantum <br\/>and classical complexity, as well as related approximation <br\/>problems are being investigated, with techniques drawn from <br\/>approximation theory, harmonic analysis, matrix analysis, <br\/>convexity, etc.. Direction (B) is also part of the PI's longer <br\/>term objective to develop a theory of polynomial approximations <br\/>of Boolean functions, which at its current stage still has <br\/>fundamental obstacles to overcome.<br\/><br\/>The research on polynomial approximations of Boolean functions <br\/>would provide powerful tools from classical mathematics for <br\/>computer science, and promote collaborations between the two<br\/>communities from approximation theory and theory of computation.<br\/>Quantum computing promises revolutionary, far-reaching impacts <br\/>on the society through its paramount superiority over current <br\/>technologies in the efficiency and the security of information <br\/>processing. This project could contribute significantly to the <br\/>foundations of quantum information processing.","title":"CAREER: Quantum Complexity and Polynomial Approximations of Boolean Functions","awardID":"0347078","effectiveDate":"2004-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1708","name":"QuBIC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["549690"],"PO":["565157"]},"90433":{"abstract":"The objective of this work is to develop programs that can learn executable models of behavior as they observe physical social agents, where \"executable\" means that the models should run in simulation or on mobile robots; and \"physical social agent\" means an animal, robot or person that senses its environment, acts upon its environment, and normally operates as part of an interacting multi-agent group. The algorithms developed in this work will support a applications such as: the ability to observe social insect colonies, build models of their behavior, then execute and verify the models in simulation; the ability to observe motorized vehicle activity (e.g., cars on a highway), build models of their behavior, then use the models to evaluate highway designs in simulation; and the ability to train mobile robot teams by providing video examples of team behavior to be emulated. To these ends, the PI will leverage research in behavioral ecology, computer vision (especially activity recognition), and behavior-based robot control, having observed that the representations utilized in each of these areas are strikingly similar. The PI will investigate how natural, large-scale systems organize themselves and, in tandem, he will study how artificial robot teams can be programmed to cooperate effectively; the motivation for pursuing both lines of research at once is that the PI expects each to inform the other. The results of this project will advance our understanding of how intelligent, distributed multi-agent systems can be organized for effective performance. <br\/><br\/>Broader Impacts: The techniques developed in this work will profoundly influence research in several disciplines outside computer science, including ethology, ecology, and animal behavior. The software developed for learning and executing models of social behavior will be made available over the Internet to members of the research community. The PI will also develop new computer science courses whose topics are intertwined with this research, including one on Intelligent Robotics and Perception, another on Autonomous Multi-Robot Systems, and a third on Principles of Physical MultiAgent Systems.","title":"CAREER: Learning Executable Models of Physical Social Agent Behavior","awardID":"0347743","effectiveDate":"2004-03-15","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7496","name":"COLLABORATIVE SYSTEMS"}}],"PIcoPI":["436270"],"PO":["564456"]},"90257":{"abstract":"When virtual environments achieve their full potential, they will have the capacity to make a significant impact in several promising application domains including scientific visualization, medical diagnosis and surgical training, flight simulation, educational tools, and 3D games. However, due to technological limitations, the graphic and haptic feedback available in current interactive virtual environments cannot match the sensory feedback available in the natural environment. In virtual environments, providing an abundance of integrated sensory feedback to users comes at a significant cost. Technological limitations, such as system latency, cumbersome tracking\/feedback equipment, and computationally expensive graphics and haptic rendering, make it impractical to provide subjects with rich sensory feedback about all aspects of interaction. Further, these limitations are amplified when we consider a collaborative system where multiple users share the environment across a network.<br\/><br\/>The PI's premise is that virtual environments will only reach their full potential when we have a deeper understanding of the human user. Because humans constitute an essential component in the interaction equation, knowledge about human behavior is essential to the design and evaluation of these systems. In this project, the PI's goal is to understand how sensory feedback conditions in virtual environments affect the planning and performance of simple and collaborative object manipulation movements. A multi-disciplinary approach, using methodologies from computer science, engineering, human motor control, biomechanics and neuroscience, will be used to achieve this purpose. Specifically, the PI will investigate what sensory (graphics and haptic) information users require to move effectively in single-user and collaborative computer-generated environments, when that information is required, and how best to present the information so that it can be effectively used. Basic motor control measurement and predictive modeling techniques will be employed to understand how sensory feedback is used, to quantify the negative effects of lag, and to suggest methods for improving the presentation of sensory information to users under a variety of task-specific conditions. By gaining a comprehensive understanding of the role of graphics and haptic information for interaction in computer-generated environments, the PI expects it will be possible to make evidence-based recommendations to designers of virtual environments regarding how to provide the most effective sensory feedback to users at the most efficient times.<br\/><br\/>Broader Impacts: Beyond the research activities, this project includes several educational goals. Because the PI believes that all students should be exposed to research efforts being undertaken at their university, she will ensure that students in her undergraduate and graduate classes spend at least one session collecting data, participating in an experiment, or observing the research process. . New and innovative approaches, including active learning techniques and web-based teaching, will be investigated to make the teaching\/learning process active and interesting.","title":"CAREER: Sensory Information for Interaction in Single-User and Collaborative Virtual Environments","awardID":"0346871","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["409291"],"PO":["565227"]},"86606":{"abstract":"The project will attempt to develop techniques for indexing and retrieving motion data. The PIs have already developed a substantial library of motion data. Motion databases are being used in the film and entertainment industry. However efficient access to such data is still a major challenge. The indexing algorithms to be developed will enable efficient access to the data. The retrieval algorithms will enable the retrieval of motion data. The project will also develop clustering techniques so that similar motions may be grouped together for efficient retrieval. <br\/><br\/>The proposal has strong intellectual merit and will make contributions to advancing the state-of-the-art in motion databases. While the main application area at present is the entertainment and film industry, the results of the project may be applied to defense, intelligence and transportation applications. One can expect this project to have broader impact in homeland security applications.","title":"ITR Collaborative Research: Indexing, Retrieval, and Use of Large Motion Databases","awardID":"0326322","effectiveDate":"2004-03-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["438709","548220","233332","560865"],"PO":["371077"]},"90258":{"abstract":"This program targets the growing gap between the advancement of CMOS technology and the introduction of analog-to-digital converters in new technologies. Using deep sub-micron digital CMOS processes, engineers can put hundreds of millions of transistors on an integrated circuit. This makes System-on-a-Chip (SOC) integration a real possibility, promising new applications such as ubiquitous broadband wireless communications, and pervasive computing. The science of digital design has delivered the concepts and the tools to build huge digital systems. However, the problem is that all SOCs require some analog functions and in particular analog-to-digital conversion circuits (ADCs). The challenge is to implement analog-to-digital conversion on the same die and in the same CMOS technology as the digital processing. This research involves the development of new to analog-to-digital conversion techniques that take advantage of the capabilities of the deep sub-micron CMOS.<br\/><br\/>The research objectives are to identify and to utilize the strengths of sub-micron digital CMOS.<br\/>The investigators study methods, architectures and concepts that take advantage of the shrinking size and increasing speed of MOS devices, the increasing capability of interconnect, and the growing digital processing capability. Fast, simple circuits, aided by redundancy, parallelism, and digital processing are explored. The limitations of these new approaches are analyzed. In contrast, the current paradigm seeks to extend the life of old design techniques though specialized process options and clever design. A simpler approach to mixed-signal design makes it easier for new engineers and researchers to become productive. The impact of this work is enhanced through the introduction of new undergraduate and graduate courses in mixed-signal and analog design, though outreach to under-represented groups, and through continuing education.","title":"CAREER: Improving analog\/digital interfaces to CMOS signal processing systems","awardID":"0346874","effectiveDate":"2004-03-01","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550475"],"PO":["564898"]},"86607":{"abstract":"The project will attempt to develop techniques for indexing and retrieving motion data. The PIs have already developed a substantial library of motion data. Motion databases are being used in the film and entertainment industry. However efficient access to such data is still a major challenge. The indexing algorithms to be developed will enable efficient access to the data. The retrieval algorithms will enable the retrieval of motion data. The project will also develop clustering techniques so that similar motions may be grouped together for efficient retrieval. <br\/><br\/>The proposal has strong intellectual merit and will make contributions to advancing the state-of-the-art in motion databases. While the main application area at present is the entertainment and film industry, the results of the project may be applied to defense, intelligence and transportation applications. One can expect this project to have broader impact in homeland security applications.","title":"ITR Collaborative Research: Indexing, Retrieval, and Use of Large Motion Databases","awardID":"0326325","effectiveDate":"2004-03-15","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["517101"],"PO":["371077"]},"90479":{"abstract":"As an increasing number of genomes are being sequenced to completion, the exciting promise of comparative genomics is beginning to bear fruit. Remarkable discoveries are being made about the evolution of genomes and the complex relationships between sequence, function and conservation. As we will highlight in this proposal, interesting biological results have emerged from comparisons of closely related primate sequences, as well as from comparisons of more distant organisms such as human, mouse and the Fugu fish. In the last year, it has become possible for the first time to study multiple whole genomes: four eukaryotic genomes (human, mouse, rat and Fugu fish) have now been sequenced almost to completion. Preliminary results of multiple genome comparisons have revealed the power of phylogenetic inference, and at the same time have shed light on fundamental questions about the nature of sequence evolution. <br\/><br\/>The biological results which have been discovered using comparative genomics have been underpinned by algorithmic advances in alignment methods and the development of novel models for the functional annotation of genomes. Despite much progress during the past years, the promise of comparative genomics remains to be fulfilled. In this proposal we review the status of the following critical problems and propose a plan for tackling both the algorithmic problems, and the practical aspects of relating the informatics to biology. The key issues are: 1. Development of accurate multiple alignment methods for whole genomes. 2. Incorporation of phylogenetic models into whole genome alignment and annotation strategies. 3. Discovery of novel genes, in particular primate (or human) specific genes which may be related to disease. 4. Unraveling of the regulatory code and the annotation of transcription factor binding sites and other regulatory elements.<br\/><br\/>We begin with a review of the available sequence data, current sequencing prospects for other eukaryotic genomes, and the existing state-of-the-art computational tools for alignment and annotation. We then outline the major components of our research plan, starting with the theoretical aspects and concluding with our plans for experimental validation and how this integrates with the career objectives of the PI. We also specifically address the practical aspects of the proposed work, for example the issue that genome sequences are constantly being updated, and the implication this has for their alignment and for the end-user biologist.<br\/><br\/>Intellectual Merit<br\/><br\/>Biological discovery based on the comparison of genome sequences is limited by computation: in particular the algorithms for annotating and comparing genomes sequences are inherently \"quadratic\" (i.e. all the sequences have to be compared against each other) and this means that accurate processing of existing genomes is intractable unless supported by heuristics. This difficulty is coupled with the practical burden of processing and displaying large quantities of data for identifying interesting experiments or for further analysis by biologists. These are the two issues we address in the proposal. Our research agenda is motivated by, and will build on, success we have already had in developing comparative genomics algorithms using hidden Markov models (pairwise, generalized and phylogenetic) and integrating those with heuristics to process whole genomes for biological discovery. We also plan a series of experiments for novel gene discovery (using RT-PCR) and for regulatory element detection using gel shift assays and transfection analysis. This plan both unifies and extends the research agenda of the principal investigator. <br\/><br\/>Broader Impacts<br\/><br\/>The core development resulting from the proposed research is a system for alignment and browsing of multiple whole genomes. This resource will be maintained and constantly updated (we estimate less than one week turnaround on a multiple genome alignment) so that biologists can work with the latest versions of genomes and their alignments. The annotation component of the research will lead to the discovery of novel genes and regulatory elements in the human genome, and the techniques we will develop should also be useful for other organisms including drosophila and even plant genomes (for example cereals).","title":"CAREER: Comparison and Annotation of Multiple Whole Genomes","awardID":"0347992","effectiveDate":"2004-03-15","expirationDate":"2010-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":[237224],"PO":["565223"]}}