{"52706":{"abstract":"A Research Project on Theory and Algorithms for Robust Information Embedding<br\/><br\/>Principal Investigator:<br\/><br\/>Prof. Gregory W. Wornell<br\/><br\/>Research Laboratory of Electronics<br\/><br\/>Massachusetts Institute of Technology<br\/><br\/>ABSTRACT<br\/><br\/>A consequence of the widespread dissemination of digital computing and communication is the increasing ease and flexibility with which multimedia content in electronic formats---such as audio, video, and still imagery---can be distributed, exchanged, manipulated and otherwise processed. These capabilities open up a broad array of new applications, from digital restoration of photographs and recordings, to convenient and instantaneous sharing of such content via networks. At the same time, these changes have far-reaching societal implications, making it easier for individuals to, e.g., circumvent copyright laws, or circumvent security systems based on photo IDs, or doctor voice recording evidence in legal trials.<br\/><br\/>Information embedding is an important emerging signal processing technology for managing such multimedia content issues. Information embedding refers to the embedding of information in the form of a digital signature or fingerprint or other sequence of bits into a multimedia ``host'' signal or image in such a way that the embedding is both effectively imperceptible and resistant to the effects of benign forms of perturbation and noise, as well as to explicit attempts to remove or modify the embedded information. While a variety of heuristic approaches to embedding have been introduced within the research community, these existing approaches have many shortcomings. This research project is investigating the fundamental limits of information embedding systems, and exploring new methods for approaching these limits, for a wide range of applications. These applications range from copyright protection of digital multimedia content, to automated monitoring of broadcasting, to authentication of documents and identification.<br\/><br\/>An emphasis in the research is on robust quantization-based embedding methods, which lend themselves well to practical implementations. And as one particular focus, the research is developing a class of such methods referred to as quantization index modulation (QIM). Part of the research involves the development of optimized implementations of QIM, and an evaluation of its performance characteristics relative to alternative approaches.","title":"Theory and Algorithms for Robust Information Embedding","awardID":"0073520","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["550597"],"PO":["564898"]},"40948":{"abstract":"This project is entitled \"Multi-Lingual Digital Library for West African Sources\". It seeks to build a multi-media digital library of West African sources in multiple languages. Collaborating <br\/>organizations include several at Michigan State, the Institut Fondemental d'Afrique Noire (IFAN) and West African Research Center (WARC) in Dakar, Senegal. Four types of material will be archived <br\/>including historical manuscripts from the 19th and early 20th centuries (primarily in Arabic and French), oral sources (primarily in Wolof, Pulaar, and French), photographs and African language print <br\/>materials. The project will give careful attention to identifying and providing metadata that describe the provenance and content of the digital materials. A multiple-languages interface will allow <br\/>users to gain access to content through the use of standardized subject headings in the original languages. Caching proxy server technology will be used a local site servers in Senegal to address <br\/>low-speed international network connections common in African countries. It is hoped that this project will serve as a model for larger-scale efforts by African and US researchers to create new repositories for the broader research and education communities.","title":"Multi-Lingual Digital Library for West African Sources","awardID":"9905834","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["281301","318996",103660,"140618"],"PO":["564456"]},"56909":{"abstract":"This proposal is to fund a US-Korea Joint Workshop on Digital Libraries. This small planning workshop is the first with an Asian country. The globalization of the internet and associated information infrastructure now offers the promise of creating international digital libraries whose resources are distributed and are capable of managing content originally created in multiple languages, formats, media, and social and organizational contexts. The barriers to achieving progress in worldwide development of digital libraries are particularly difficult between nations with very different languages and cultures. To achieve this \"next level\" of knowledge infrastructure requires collaborative efforts in research areas including: (1) multi-lingual information systems, cross-language retrieval systems, language translation, and language teaching software; (2) multi-national content development including sound, data, image, ultimedia, and software; (3) interoperability and scalability technology to permit extremely large world-wide collections; (4) metadata techniques and tools<br\/>The workshop has three primary goals. First, it will work to identify ways to reduce the barriers to increased collaborative efforts between US and Korean researchers. Second it will explore technical advances and research environments needed to facilitate US-Korea collaboration related to digital libraries research and educational applications. Third, it will attempt to produce generalizable strategies and approaches for extending and employing digital libraries technologies across radically different textual and cultural materials.","title":"US-Korea Joint Workshop on Digital Libraries: Removing Barriers to International Collaboration on Research and Education through Digital Libraries","awardID":"0090153","effectiveDate":"2000-08-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["550462"],"PO":["433760"]},"51718":{"abstract":"DMS 0070641<br\/>ABSTRACT.<br\/><br\/>The principal investigator will continue his research program in the numerical<br\/>solution of large systems of nonlinear equations and noisy optimization <br\/>problems. In the area of nonlinear equations the PI will continue his <br\/>research program on pseudo-transient continuation methods for nonlinear <br\/>equations to the partial differential algebraic equation (PDAE) setting<br\/>and design and analyze multilevel methods for fully iterative algorithms <br\/>for parameter-dependent families of compact fixed point problems.<br\/>In the area of optimization, the principal investigator will <br\/>extend his work on sampling methods to problems with ``hidden constraints'', <br\/>i.e. constraints whose violation can only be detected by failure of the <br\/>objective function to return a value, continue his development of the implicit<br\/>filtering with the design of a Levenberg-Marquardt form of the algorithm, <br\/>and investigate the performance of the DIRECT method both from the <br\/>theoretical viewpoint and as a way to identify hidden constraints. <br\/>This aspect of the PI's research involves undergraduates in a significant way.<br\/><br\/>Many processes and models in engineering and science are expressed as nonlinear<br\/>equations. Numerical simulation of these processes requires the rapid and <br\/>accurate solution of these equations and a clear understanding of the methods<br\/>and their limitations. With a high-quality simulator in hand, optimization<br\/>can be used in design. The optimization problems that arise in <br\/>industrial design are often noisy because of measurement or simulation error. <br\/>The principal investigator will continue his work on the computational <br\/>solution of nonlinear equations and optimization problems. The work <br\/>will consist of study of algorithms, needed to ensure robustness and <br\/>reliability of simulations, implementation on distributed memory computers,<br\/>which is important for for rapid turnaround, and applying the methods<br\/>in collaborations with scientists and engineers in industry, national <br\/>laboratories, and academia. The work will be used in (a) environmental <br\/>modeling, measurement, and remediation, (b) simulation, optimal design, <br\/>and control in the aerospace industry, and in (c) optimization of <br\/>gas pipeline networks.","title":"Nonlinear Equations and Optimization","awardID":"0070641","effectiveDate":"2000-08-01","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["558578"],"PO":["565356"]},"52719":{"abstract":"This proposal is a continuation of the research on Reduced-rank Adaptive Subspace Filtering for Spread Spectrum Communications, Array Signal Processing and Detection, a research grant funded by the National Science Foundation under Contract No. MIP-9706215. During the current grant, the theoretical foundations of the cross-spectral metric (CSM) for reduced-rank were studied. The practical processing algorithms to apply the CSM to several related research areas are developed. Our research shows that the CSM method results in a better rank reduction than the principal components method in the sense of the minimum mean square error for filtering. The remaining problem with the CSM method is that the eigenvectors of the data covariance matrix, that are used to span the full-rank space, are unknown and have to be estimated from the observation data in most applications. The expensive computation needed for obtaining these eigenvectors will hinder the use of the CSM method in real-time processing. In addition, the strategy used by the CSM method for searching a desired rank-reducing subspace is not efficient: one has to compute all of the eigenvectors and their corresponding eigenvalues in order to rank order the cross-spectral items, but only a certain number of them are needed for the subspace filtering. <br\/>A new framework for reduced rank subspace filtering, built on a non-eigenvector-based subspace representation, is now proposed to address these issues. In this new framework, a set of orthonormal vectors, which tridiagonalizes, rather than diagonalizes, the covariance matrix, is used to replace a set of eigenvectors as a basis of the full-rank space. Advantages of this replacement are (1) the computation of the tridiagonalization has a much lower complexity as compared to that of the diagonalization; (2) the rank reduction from the full-rank N to the lower rank K only requires computing K or less desired orthonormal basis vectors, instead of computing all N of them, and (3) the resulting subspace remains optimal in the sense of maximum signal-to-interference plus noise ratio. The proposed effort for this non-eigenvector-based subspace filtering framework includes studying the theoretical foundations, developing adaptive processing algorithms and their computation architectures, deriving a rank reduction optimization metric, and evaluating theoretical and implementation performances as compared to the eigenvector based approaches. <br\/>New results in rank reduced adaptive filtering will be directly applicable to several new research areas currently under consideration such as space and time wireless systems and code addressed multiple access signaling. In these applications, and similar extensions, low dimension addressing signals are superimposed in larger 2-dimensional(frequency\/time or space\/time) signal spaces. Signal crosstalk in the form of address overlap must be removed by processing over the entire 2-D observation space. The ability to rank reduce data for efficient crosstalk rejection will be a major step in the development of practical processing algorithms. In addition, overlap interference will be time varying due to continual data modulation (in the multiple accessing case) and due to the spatial fading (in the space\/time case). Hence adaptive updating processors will be necessary for maximum efficiency. The research developed in the newer study proposed here will significantly influence practical filtering solutions for these two dimensional cases.","title":"A New Framework for Adaptive Subspace Filtering: Theory and Algorithms for Application to Wireless Communications","awardID":"0073559","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[134414,"279768"],"PO":["564898"]},"69393":{"abstract":"","title":"Lumigraphs and Manifolds","awardID":"0196213","effectiveDate":"2000-08-31","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["532660","547864"],"PO":["179846"]},"48780":{"abstract":"To reduce the risks associated with software faults, the research <br\/>focuses on a fault tolerance method based on controlled execution <br\/>with lookahead. In this approach, a program is run in a lookahead <br\/>mode without affecting the external environment. During lookahead, <br\/>sufficient information is traced so that it can be analyzed for faults. <br\/>If the analysis of the execution shows that there are no faults, then <br\/>the lookahead execution is committed and its effects are visible to <br\/>the environment. Otherwise, the results from the lookahead execution <br\/>are discarded, and the system is run in a controlled mode. In this mode, <br\/>the system exercises control by introducing additional synchronization <br\/>or by changing the order of messages to avoid the fault that occurred <br\/>during lookahead.<br\/><br\/>There are three main components of the project - algorithms for<br\/>detection of software faults, algorithms for automatic<br\/>control such as insertion of control messages and reordering of<br\/>messages based on lookahead, and a system which supports controlled<br\/>execution with lookahead. For detection of software faults, <br\/>previous algorithms will be extended to work for more general model of<br\/>computation in the presence of failures. For automatic control, the project <br\/>will focus on synchronization faults in concurrent programs.<br\/>Finally, a system in Java that supports controlled<br\/>execution with lookahead will be developed.","title":"Software Fault-Tolerance based on Observation and Control of Distributed Programs","awardID":"9988225","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["561475"],"PO":["565090"]},"47361":{"abstract":"EIA-9983267<br\/>Malyankar, Raphael M.<br\/>Arizona State University<br\/><br\/>Digital Government: Representation and Distribution of Geospatial Knowledge<br\/><br\/>This project will work within the domain of maritime navigation, in partnership primarily with the Coast Guard, but with contacts to NOAA, NIMA, and the Navy. The ontology developed will include such representations as shorelines, hazards, aids to navigation, tide tables, sea lanes, etc. and a related markup language. This will be of benefit as these agencies begin to deploy web-based Q&A systems and automated mission planning, intelligent navigation aids, and route planning tools. The research challenges in this work revolve around representing a domain that is highly dynamic, time-critical and rich in factors and entities.","title":"Digital Government: Representation and Distribution of Geospatial Knowledge","awardID":"9983267","effectiveDate":"2000-08-01","expirationDate":"2004-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W467","name":"COAST GUARD-MIML"}}],"PIcoPI":[121233,121234],"PO":["371077"]},"48582":{"abstract":"The project researches interconnect-dominated floorplanning. The floorplanning organizes the topology of wires and the assignment of buffers while placement and routing are structured as supporting tools to fulfill the design requirements. The project includes exploration of the following. Technology Floorplanning: Given a circuit design project, the technology floorplanning identifies the technology that provides the best interconnect capability in terms of cost and performance. Logic Floorplanning with a Hierarchical Design Framework: A logic floorplanning takes advantage of the design hierarchy and derives the effect of interconnect delay. Physical Layout Floorplanning: Physical layout floorplanning serves as a foundation to support the interconnect optimization operations.","title":"Research on Interconnect-Dominated Floorplanning","awardID":"9987678","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":[124355,"451456"],"PO":["562984"]},"48891":{"abstract":"A drawing of a graph is a one-to-one placement of the vertices and edges into the plane so that the edges become continuous curves. Many important problems in theory of VLSI and computational geometry can be stated as graph drawing problems. For instance, the problem minimizing the number of edge crossings, or the crossing number problem, has been extensively studied in theory of VLSI. Moreover, a class of interesting problems in discrete and computational geometry exhibit structures which can viewed as variations, generalizations and extensions of the notion of crossings. Some of these problems can be reformulated as problems concerning cliques, independent sets and the chromatic numbers of the intersection graphs of drawings. In addition, automatic generation of drawings is customary in many scientific areas in which diagrammatic representations are used.<br\/>Most of these problems are computationally difficult, and therefore it only makes sense to focus on the design of approximation algorithms for solving them. Unfortunately, geometric properties of many such problems are not well understood, and additional research is needed to investigate the design of new and effective approximation algorithms, or to sharpen and improve the performance of the existing algorithms for solving them.<br\/><br\/>This project is aimed at studying a collection of problems that arise in drawings of graphs in the plane. The theoretical goal is to develop new structural results and theoretically efficient approximation algorithms that can produce provably near optimal solutions. The experimental goal is to implement these algorithms and test and document their effectiveness in practice.","title":"Solving Crossing Number Problems With Applications","awardID":"9988525","effectiveDate":"2000-08-01","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["354802"],"PO":["279077"]},"55062":{"abstract":"This CONACyT research project will enable a research group at the University of South Carolina to cooperate with a research group at the Instituto Politecnico Nacional in Mexico City, Mexico. Together they will develop a methodology that enables software agents with different ontologies to interact and exchange information. The objectives are to increase the ease with which such software can be produced and its robustness. Under this approach, software development would consist of choosing among \"volunteers\" (agents from an active repository) and assembling them into a problem-solving team, instead of debugging lines of code. Software development would be more like coaching and less like traditional programming. The research will explore 1) how independently constructed autonomous agents reach mutual understanding, 2) what categories of software are suitable for team-oriented programming, and 3) how team behaviors can be analyzed and validated. Groups of students will assemble agent-based software systems and compare the resulting systems for robustness with software developed conventionally. The two resarch sites will collaborate through online meetings, the exchange of graduate students and mutual visits to each other's research centers.","title":"Robust Software with Errors through Team-Oriented Programming","awardID":"0083362","effectiveDate":"2000-08-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[140772],"PO":["565227"]},"47450":{"abstract":"EIA-9983507<br\/>Parks, Bradley O.<br\/>University of Colorado Boulder<br\/><br\/>Digital Government: Criteria-based Inference from Geospatial Data: Automating Government Decision Making for Genetic Food Security, Crop Improvement and Global Germplasm Needs<br\/><br\/>This award will support a planning effort for submission of a full proposal. Government partners include primarily the National Oceanic and Atmospheric Administration (National Geophysical Data Center), the US Department of Agriculture (Agricultural Research Service, and several other agencies in supportive roles.<br\/><br\/>There is immediate need to prioritize the target government germplasm (seeds and rootstocks) acquisitions for crop improvement and to estimate distribution of germplasm diversity in landscapes. These problems are complex and interdependent ones since the distribution of germplasm diversity must be inferred (modeled) from eco-geographical indicators such as temperature, precipitation, and soil type, accommodating anecdotal information about native distributions, without knowing how the relationships among these elements are controlled. The objectives of the proposed work are to predict, based on ecological factors; when current germplasm collections are inadequate, how they should be augmented with new material, and where additional germplasm should be collected. The scope of these problems is global since the gene pool from which germplasm may be sampled is not restricted to nations or continents.<br\/><br\/>An innovative approach is proposed to infer germplasm diversity from the extensive and expanding national resource of digital environmental data by applying multiple-criteria geospatial stratification techniques and geographic information system (GIS) technology to predict germplasm distributions in relation to environmental factors. This approach will automate previously non-comparable, unsystematic, and subjective procedures to create digital government gene banks that are capable of becoming self-monitoring, more adaptable to changing conditions, and much more efficient.","title":"Digital Government: Criteria-Based Inference from Geospatial Data: Automating Government Decision Making for Genetic Food Security, Crop Improvement, and Global Germplasm Needs","awardID":"9983507","effectiveDate":"2000-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[121460],"PO":["371077"]},"48792":{"abstract":"Proposal Number: CCR-9988254<br\/>PI: Lerner, Barbara S.<br\/>Institution: Williams College<br\/>Title: Improving Usability of Software Process Programs<br\/><br\/>The goal of software process programming is to encode software processes in<br\/>a language that is amenable to formal analysis and execution. By executing<br\/>a software process, the quality, cost, and timeliness of software products<br\/>should improve. While process programming languages can describe processes<br\/>accurately, organizations do not execute process programs to guide process<br\/>execution. One impediment to the adoption of process program execution is<br\/>that little attention has been paid to user interface issues. The research<br\/>involves developing extensions to process programming languages, developing<br\/>a style for more usable processes, and addressing issues of how to make a<br\/>process program usable to both novice and experienced users. Extensions<br\/>allow re-execution of parts of a process to try alternative approaches,<br\/>dynamic error handling, and customized user interfaces. The extensions<br\/>provide more flexibility to process users. This flexibility is balanced<br\/>against the demands of the process to guarantee that the quality, cost, and<br\/>timeliness goals of the process are not compromised. The research<br\/>investigates this tradeoff, balancing the programmability of the process<br\/>language against the usability of the resulting processes, striving to<br\/>maintain the benefits of process programming while making their execution<br\/>more acceptable to the user community.","title":"Improving Usability of Software Process Programs","awardID":"9988254","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[124900],"PO":["564388"]},"48760":{"abstract":"Clusters are becoming a predominant and cost-effective platform<br\/>for high performance parallel computing. These systems are gaining acceptance<br\/>not just for scientific applications, which have traditionally needed<br\/>supercomputers, but are also being deployed to meet the needs of<br\/>applications in domains such as databases, web service, multimedia, and <br\/>graphics\/visualization. Traditional parallel scheduling techniques<br\/>such as simple space sharing or coscheduling, which are optimized more<br\/>for throughput, may not be able to handle the responsiveness needs of<br\/>these emerging applications. At the same time, leaving it entirely<br\/>to the native operating system scheduler at each node to make independent<br\/>decisions can have a detrimental effect on the performance of communicating<br\/>applications. Considering these different issues, this proposal will<br\/>explore techniques for efficient management and coordination of the <br\/>CPU resources across the nodes of a cluster. This research will develop<br\/>a framework to design cluster scheduling mechanisms taking communication <br\/>into account together with working sets and I\/O information, accomodate<br\/>the constraints and idiosyncrasies of an application, and adapt dynamically<br\/>to the system load. The mechanisms will be evaluated with real workloads,<br\/>using simulation, analytical models and actual implementations.<br\/>The outcome of this research will take an important step towards making<br\/>clusters more ubiquitous, multiprogrammed, manageable and user-friendly.","title":"Scheduling Support for High Performance Clusters","awardID":"9988164","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["542015"],"PO":["309350"]},"48892":{"abstract":"Abstract<br\/><br\/>PI: Michael Saks<br\/>Proposal Number: 9988526<br\/>Institution: Rutgers University<br\/><br\/>This project covers ongoing and new work in several diverse areas in the theory of computation:<br\/><br\/>(1) Time-space tradeoffs for branching programs,<br\/>(2) Exact algorithms for NP-Hard problems,<br\/>(3) Private Information Retrieval, and <br\/>(4) Online algorithms for distributed web servers,<br\/><br\/><br\/>Two basic resources in computation are computation time<br\/>and memory (space). There are many computational problems known where there seems to be a tradeoff between these resources: by increasingthe memory used one can significantly reduce the time needed. However, we don't know whether these apparent tradeoffs are inherent properties of the computational problems, or are just due to our lack of understanding. The first part of the project aims at analyzing the mathematical structure of some specific computational problems in order to establish that these tradeoffs are indeed inherent. There is a large class of problems, the so-called NP-complete problems, whose solution on large inputs seems to require a very large amount of time. One of the most basic of these is the satisfiability problem for boolean formulas, which asks whether for a given boolean formula it is possible to set its variables in such a way that the formula evaluates to 1. In the second part of this investigation, we seek to find the faster algorithms for this problem, and to investigate the limits to speed of the algorithms, as well as for related computational problems. The third part is based on a problem that arises in trying to maintain the privacy of users who request information from a large database. In some such situations, the users do not want it known what information they are requesting. Various methods for maintaining user privacy have been proposed. In some versions of this problem, maintaining privacy seems to require a large amount of communication between the user and the database. In this investigation, we seek to determine whether such a large amount of communication is really necessary, and if so, whether small relaxations in the privacy requirements can significantly reduce the communication cost. In the fourth part, we look at the problem of a web server that is providing documents from a large library to users on the web. The requests for documents arrive over time, and the server wants to satisfy the requests so that no requester ever waits too long. Because a set of requests to the same page can be served faster than the same number of requests to different pages, it may be advantageous to delay some requests in order to group together requests of the same type. We seek to develop and analyze different algorithmic strategies for this problem.","title":"Further Studies in Complexity and Algorithms","awardID":"9988526","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["518427"],"PO":["543507"]},"69220":{"abstract":"","title":"CAREER: Providing Interactive VOD Services in Multicast Networks","awardID":"0196039","effectiveDate":"2000-08-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["564706"],"PO":["565090"]},"40081":{"abstract":"Delays on the World-Wide Web are a well-known problem for users. Caching of web objects closer to clients is a technique shown to improve performance because requested objects that are in the cache can be presented to the client without traversing sometimes slow network connections to a possibly overloaded web server. Prefetching, in advance of their need, soon-to-be-requested objects that are not in the cache can improve performance even further. Such objects can often be predicted from a range of information sources, such as client and server histories as well as the contents of the objects currently and previously retrieved by the client. In this work, the researcher proposes to develop intelligent prefetching algorithms that use machine learning techniques to develop models that make predictions based on past experience, and to test their implementation in a proxy cache with the goal of reducing user-perceived latency. Moreover, adding prefetching to a cache raises some subtle problems for evaluation methods, and so the researcher proposes a new methodology for proxy cache evaluation that can also handle prefetching systems. The high-level goals of this research are to propose and implement both prefetching algorithms and a sufficient evaluation methodology for such algorithms. This evaluation methodology will then be used to measure the progress made toward the ultimate objective of reducing user latencies.","title":"Intelligent Web Prefetching to Reduce Client Latencies","awardID":"9903052","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["523297"],"PO":["565090"]},"54260":{"abstract":"EIA-0079734<br\/>Ligon, Walter B.<br\/>Clemson University<br\/><br\/>MRI: Acquisition of a Computational Mini-Grid Supercomputing Facility<br\/><br\/>The objective of this CISE\/MRI proposal is to acquire computational equipment to support research in genomics, polymeric fibers and films, and high-performance computing systems. This enabling technology will be used to support programs in the Clemson University Genomics Institute, the Center for Advanced Engineering Fibers and Films, and the Parallel Architecture Research Laboratory. The requested equipment will help these three groups meet their current goals, increase their computational capacity, and permit expansion into new research areas. It will foster collaboration, interdisciplinary work, and integration of research and education.","title":"MRI: Acquisition of a Computational Mini-Grid Supercomputing Facility","awardID":"0079734","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["455742",138507,"521239",138509,"255102"],"PO":["557609"]},"53083":{"abstract":"EIA-0074808<br\/>Jonoska, Natasa<br\/>University of South Florida<br\/><br\/>POWRE: Self-Assembling Graphs by DNA<br\/><br\/>This POWRE award will support research on a new way of solving computational problems using three-dimensional DNA structures. An experiment for solving a computational problem, the so called three-vertex colorability problem for graphs, by actually constructing a three-dimensional DNA graph structure is proposed. This is an initial study towards developing computational methods using three-dimensional DNA structures such as graphs that are not available with current electronic computers. The project proposes use of branched junction molecules to build graphs by DNA. The project will provide a better understanding of the topology of DNA, which leads to a more profound understanding of natural processes in vivo.","title":"POWRE: Self Assembling Graphs by DNA","awardID":"0074808","effectiveDate":"2000-08-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"14","name":"Office of OFFICE OF POLAR PROGRAMS                ","abbr":"OPP"},"div":{"id":"1401","name":"Division of ARCTIC SCIENCES DIVISION","abbr":"ARC"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["506031"],"PO":["564181"]},"45142":{"abstract":"Kirby<br\/>9973303<br\/><br\/> The investigator exploits the Whitney Reduction Network, a new tool for processing and analyzing data sets of high ambient dimension. Whitney's theorem motivates the architecture of the network, which consists of a \"good projection,\" designed to be bilipschitz and retain the differential structure of the data, followed by a nonlinear inverse with good interpolation properties inherited from the choice of projection. The approach provides a natural representation of the data as the graph of a function that is approximated using radial basis functions (RBFs). The basic technique may be implemented in a variety of ways, hence the development and evaluation of a broad class algorithms is a primary focus of the research. Problems and algorithms examined include adaptive basis methods, RBF center selection, (spatio-temporal) clustering methods, direct and iterative methods for solving for RBF weights, RBF approximation with constraints and a local implementation of the basic algorithm.<br\/><br\/> Scientific research has to a certain degree become a problem in data processing. High-speed numerical simulations of intractable model equations of natural phenomena produce enormous quantities of data. Understanding the phenomena means extracting and interpretting information in the data. The main goal of the project is to develop mathematical tools to produce efficient representations of data so as to expose the information it contains in a manner that the orignal data does not. Potential applications of this methodology are widespread and multi-disciplinary. In particular, the basic research undertaken here has direct applications through collaboration with Honeywell Corporation and the Air Force materials research program at Wright Patterson Air Force Base.","title":"The Whitney Reduction Network: Theory, Algorithms and Applications","awardID":"9973303","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["551905"],"PO":["565027"]},"48101":{"abstract":"This USC-ISI award supports work on a Collaborative Simulation for Education and Research (CONSER) project. The CONSER system involves development of infrastructure that addresses two purposes: (a) support for research activities in the development and evaluation of networking protocols, and (b) teaching in the areas of networking protocols and networking concepts. Based on a collaborative simulation environment, CONSER is intended to aid understanding of protocol behavior in complex operational environments, over a range of traffic conditions, and on a variety of media. The system will involve simulation and visualization support intended to aid researcher and student understanding, thus <br\/>providing benefits in both research and teaching settings. Based on ns and nam, the work is expected to be well received by the research community and industry.","title":"Collaborative Simulation for Education and Research","awardID":"9986208","effectiveDate":"2000-08-15","expirationDate":"2006-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V979","name":"NSA-R4 TECH OPPORTUNITIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V011","name":"NATIONAL SECURITY AGENCY-NEWLY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V237","name":"CIA-MULTIMEDIA WIRLESS TRAFFIC"}}],"PIcoPI":["560926","377594","559198"],"PO":["565090"]},"48046":{"abstract":"EIA-9986057<br\/>Kenneth Rose<br\/>Univ. of California-SB<br\/><br\/>CISE Research Instrumentation: Research in Computational Multimedia<br\/><br\/>The departments of Computer Science and Electrical Engineering at the University of California, Santa Barbara will purchase the following infrastructure equipment: an SGI 2100 multimedia server with three client SFI 02 workstations to manage, process and stream multimedia data onto a wireless local area network with several PC's on the backbone Ethernet and mobile computers (laptop computers and handheld devices); an MPEG-2 encoder from Optivision, still and video cameras as input devices, and high resolution monitors and a color laser printer for display and presentation. This equipment will be dedicated to support research in computer and information science and engineering with the main focus on computational multimedia research related to multimedia signal processing, databases, networking and communications. The equipment will be used by several interrelated research projects. These projects include: clustering, indexing, and data mining in high dimensional feature spaces; scalable audio and video over IP and wireless networks; data warehousing in mobile environments; and shared multimedia objects in mobile environments.","title":"CISE Research Instrumentation: Research in Computational Multimedia","awardID":"9986057","effectiveDate":"2000-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["536696","536697","550914","426604","381444"],"PO":["301532"]},"69442":{"abstract":"","title":"CISE Research Instrumentation: Establishing a Laboratory for Research in Parallel Computing and Signal Processing","awardID":"0196324","effectiveDate":"2000-08-01","expirationDate":"2005-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["380971","179869"],"PO":["557609"]},"47431":{"abstract":"EIA-9983451<br\/>MacEachren, Alan M.<br\/>Pennsylvania State University<br\/><br\/>Digital Government: Collaborative Research: Quality Graphics for Federal Statistical Summaries<br\/><br\/>The Federal government distributes a vast quantity of statistical summaries in printed and electronic form. The full wealth of information that might be derived from these summaries is not being realized because limited attention is paid to disseminating summaries in understandable forms. This research will develop and assess quality graphics for federal statistical summaries. The development and assessment process will consider perceptual and cognitive factors in reading, interacting with and interpreting statistical graphs, maps and metadata representatives. The purposes of the quality graphics include exploration by agency users evaluating data quality and looking for emergent trends, decision making by public policy makers and communication of statistical summaries to the public. The proposed research addresses four topic areas: converting tables to graphs, representing metadata, interacting with both graphs and maps, and conveying multivariate spatial and temporal relationships. The research features use of Web-based \"middleware\" components to provide rapid development of graphics for usability testing. The featured middleware is a Java Graphics Component Library (GPL). A long history of research has recently culminated in a rigorous graph algebra that is the foundation for the library. The library also benefits from the collective intellectual effort being poured into Java. Principles of human perception and cognition will be used to guide the construction of statistical graphics, and usability tests will help to refine those principles in the context of federal statistical summaries. The research team has been carefully selected to bring together outstanding and compatible investigators who will provide expertise in statistical graphics, cartography, human perception and cognition, and software development and is composed of university, industrial and federal agency personnel.","title":"Digital Government: Collaborative Research: Quality Graphics for Federal Statistics","awardID":"9983451","effectiveDate":"2000-08-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V423","name":"CENSUS-DIGITAL GOVT COLLAB RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W059","name":"NIH-NSF DIGITAL GOV PROG INITA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W146","name":"NIH-QUALITY GRAPHICS FOR STAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W406","name":"BUR OF CENSUS-DIGITAL GOVT RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W556","name":"NIH-NSF DIGITAL GOVT PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X716","name":"BUR OF CENSUS-QUALITY GRAPHICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X723","name":"NIH-DIGITAL GOV PROG INITIATIV"}}],"PIcoPI":[121416,"524344"],"PO":["371077"]},"48894":{"abstract":"Subdivision was initially conceived as an extension of splines to control meshes of<br\/>arbitrary topology. Subdivision algorithms, while being more flexible and general,<br\/>retain a number of useful properties of splines. Most importantly, the surfaces generated<br\/>by these algorithms have a natural hierarchical structure and are computed<br\/>using simple local rules. This allows the design of efficient hierarchical, local, and<br\/>adaptive algorithms for rendering, manipulation, collision detection and intersection<br\/>of such surfaces. Subdivision surfaces are rapidly gaining wide acceptance in<br\/>the industry. In recent years, substantial progress has been made in understanding<br\/>the properties of the subdivision surfaces, especially smoothness properties. However,<br\/>subdivision still lacks the body of well understood and reliable algorithms<br\/>available for splines and a few practically important aspects of subdivision, such<br\/>as subdivision rules for boundaries and singular features, do not have a rigorous<br\/>theoretical foundation. Aside from smoothness, no other property of subdivision<br\/>surfaces has been studied in detail. At the same time, some fundamental limitations<br\/>of the commonly used stationary subdivision schemes became apparent. For example,<br\/>practical curvature-continuous subdivision surfaces necessarily have a \"flat.\"<br\/>spot near extraordinary vertices, and the surfaces acquire ripples near vertices of<br\/>high valence. The proposed research has three main objectives:<br\/><br\/><br\/>Advance the theory of stationary subdivision to include all important practical<br\/>cases, and develop the theory necessary to understand fairness, mesh<br\/>quality, and approximation properties of subdivision.<br\/><br\/><br\/>Develop robust algorithms for common geometric operations such as com-putting<br\/>collisions and intersections of subdivision surfaces;<br\/><br\/><br\/>Explore nonstationary subdivision schemes which retain locality, and identify<br\/>ways to improve the quality of the resulting surfaces without sacrificing<br\/>the performance.<br\/><br\/>The three components are unified by a common goal: the development of a<br\/>surface representation supporting highly efficient, local, hierarchical and adaptive<br\/>algorithms for geometric modeling.","title":"Subdivision-based Algorithms for Surface Modeling","awardID":"9988528","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550936"],"PO":["532791"]},"47453":{"abstract":"EIA-99083518<br\/>Delcambre, Lois M.<br\/>Oregon Graduate School<br\/><br\/>Digital Government: Harvesting Information to Sustain our Forests<br\/><br\/>Historically, forest management practices have aimed to maximize harvests, put out fires, and create plots of a common age and species. More recently, there is an increasing awareness that forests must be managed to reflect a broad range of local, regional and national objectives, including ecological, economic, social and recreational. This research will be a collaboration between the university research team and the Adaptive Management Areas program, a multi-agency initiative (USDA Forest Service, and two agencies of the US Department of Interior, Bureau of Land Management and Fish and Wildlife Service) to design and prototype an \"Adaptive Management Portal\" to make Adaptive Management information available in an open, natural and useful way to all parties interested in forest lands. A key technical question is to what extent \"superimposed information\" (information overlaid on the base set of resources) can help realize these goals. There is particular interest in thematic organizations based on terminology in common use in the forest practices domain, and in the ability for arbitrary users to augment the system with their own annotations, linkages and collations that might be of use to others.","title":"Digital Government: Harvesting Information to Sustain Our Forests","awardID":"9983518","effectiveDate":"2000-08-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["483300","533018","468145",121472],"PO":["371077"]},"69244":{"abstract":"","title":"CAREER: Controlling Space Properties of Higher-Order Typed Programs","awardID":"0196063","effectiveDate":"2000-08-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["517796"],"PO":["551992"]},"53063":{"abstract":"NSF Proposal: DMS-0074735<br\/><br\/> \"Advances in Level Set and Related Methods: New Technologies and Applications\"<br\/><br\/> Principal Investigator: Stanley J. Osher<br\/><br\/><br\/>ABSTRACT<br\/><br\/>The level set method devised by Osher and Sethian in 1988 has proven to be phenomenally successful as a numerical and theoretical device for representing and analyzing the motion of curves in R^2 and surfaces in R^3. A level set calculus has been developed, and recent extensions include the ghost fluid method, convolution generated motion, dynamic surface extension, the variational level set approach, and the motion of higher codimensional objects. Recent applications include multiphase fluid dynamics, the island dynamics model for epitaxial growth, level set based interpolation of unorganized points, and fast methods in image restoration. This work was partially supported by our previous NSF grants. The goal of this proposed research is to extend the technology and the range of applications through the following two projects:<br\/>(1) Convolution generated motion for filaments.<br\/>(2) Fast algorithms for steady state geometric Hamilton-Jacobi equations and<br\/> the induced motion of fronts.<br\/><br\/>The level set method is rapidly becoming the method of choice to simulate on the computer a host of important physical, biological, materials science, image processing, computer vision, electromagnetic and other real world problems. In particular areas of nanotechnology will also be impacted. Improvements of the numerical methods used to simulate these phenomena will ultimately be crucial in the design of computer chips, analysis of explosions, recognition of objects and many other areas of modern technology. This proposal addresses further improvements of the level set and related methods.","title":"Advances in Level Set and Related Methods: New Technology and Applications","awardID":"0074735","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["487144"],"PO":["565027"]},"47674":{"abstract":"Data hierarchies - that is, different access speeds for different areas of computer memory - in parallel computer architectures are becoming increasingly complex. Machines with several levels of memory, including cache-coherent non-uniform memory architectures (CC-NUMA) and clusters of workstations, now dominate supercomputing. In the near future, all high-performance parallel architectures in both science and industry will be hierarchical systems, and the successful development of a general-purpose approach to programming these machines is imperative. Unfortunately, although hierarchical systems are not new, the research community has not yet developed a general and comprehensive approach to them. Fortunately, rapidly decreasing cost of processing power and recent developments in dynamic compilation and runtime support may allow solutions to this problem that were not possible before. This project will build a software infrastructure that exploits those factors to deliver high levels of application performance on hierarchical systems. The infrastructure will support the advance of computational science, serve as a model for future commercial systems, and serve as a tool to educate and expose students to explicit management of parallelism and memory hierarchies. Through collaborations with the National Center for Supercomputing Applications it will also produce a wide range of high-performance scientific and non-scientific codes developed for hierarchical systems.<br\/><br\/>Technically, the project approaches the hierarchy problem with a 4-pronged attack:<br\/>-A hierarchical virtual machine that abstracts resource allocation and management issues<br\/> -A hierarchy-aware runtime system that offers the illusion of a non-hierarchical system by adapting an application's communication and synchronization operations<br\/>-Language constructs and dynamic compiler support to tune application behavior to the hierarchy<br\/>-Applications that demonstrate the value of the framework<br\/>Parts of this approach will receive support from other sources as well as this award.","title":"CAREER: An Adaptive, High-Performance Software Infrastructure for Hierarchical Systems","awardID":"9984492","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["557162"],"PO":["565272"]},"69333":{"abstract":"","title":"CAREER: Statistical Signal Processing for Wireless Communication Channels","awardID":"0196152","effectiveDate":"2000-08-15","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[179503],"PO":["223414"]},"69454":{"abstract":"","title":"CAREER: Telepresence in Teleoperations","awardID":"0196342","effectiveDate":"2000-08-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X454","name":"ARMY-DAVID KABER AWARD"}}],"PIcoPI":["402586"],"PO":["246649"]},"48598":{"abstract":"Internet applications are being rapidly developed and adopted for use in the US agricultural system. Yet, to date, there has been little research or theoretical development concerning the impacts of Internet technology on the structure of value chains in agriculture. The primary goal of this SGER project is to inductively construct theoretical models of agricultural value chains and to show the impacts of Internet development on them. This goal will be accomplished through two complementary activities. First, a literature review will be done to understand the adoption and subsequent impacts of two other major network technologies - electrification and telephony -- in rural areas. This review will provide insight into agricultural value chains, how previous technologies have impacted them and the types of impacts that could be expected from the adoption of the Internet. The second activity will be to: 1) understand how firms producing agricultural inputs, marketing agricultural commodities, or processing food products use the Internet to provide information, goods, and services to farmers and ranchers; and 2) analyze the impacts of the Internet on value chains within the US agricultural system.","title":"SGER: COLLABORATIVE RESEARCH: The Internet & the U.S. Agricultural System","awardID":"9987770","effectiveDate":"2000-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[124398],"PO":["564456"]},"53163":{"abstract":"EIA-0075066<br\/>Cushing, Judith B.<br\/>Evergreen State College<br\/><br\/>POWRE: Integrating Information Resources for the Canopy Scientist a Model System for the Ecology and Database Research Community<br\/><br\/>This work extends an ongoing project that focuses on building database facilities for forest canopy scientists into research, leading towards a model for ecologists and computer scientists. The grant will be used to extend a six-month sabbatical into fifteen months of intensive research and development experience. Meanwhile, integrating relevant computer science research, efforts will be made to build an effective community-wise database for an emerging ecological field. The PI will also explore the use of access- and workflow-oriented mediators, integrating metadata with data, data validation, data transformation, schema representation and integration using XML. The focus will be on metadata acquisition and spatial transformations for data integration.","title":"POWRE: Integrating Information Resources for the Canopy Scientist a Model System for the Ecology and Database Research Community","awardID":"0075066","effectiveDate":"2000-08-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["474015"],"PO":["564181"]},"58026":{"abstract":"This workshop proposal was not reviewed externally, but is considered to fall under the provisions of the NSF Proposal and Award Manual Section 122.3b. The award is for NSF co-sponsorship of a three-day conference focused on assessing the magnitude of the digital divide in thirteen southern states and on ameliorating the gap in access and computer literacy among southern populations. About 450 researchers, policy makers, community and business leaders and interested citizens are expected to attend. NSF sponsorship will enable the research and production of the report associated with the conference and it will provide some stipends for the speakers.","title":"TelecomSouthII: One South: Digitally Divide: A Conference on Internet Access in the South","awardID":"0094707","effectiveDate":"2000-08-15","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["484576"],"PO":["495796"]},"53351":{"abstract":"ABSTRACT<br\/>Proposal: 0075792<br\/>PI: Michael Langston<br\/><br\/><br\/>An adaptive computing system (ACS) offers a revolutionary combination of the performance of custom hardware and the flexibility of software by employing reconfigurable technology. A key feature of an ACS is the reconfigurable processing element, which, in the current generation, is a Field-Programmable Gate Array (FPGA) chip. This research project investigates the impact of an ACS in the context of a high-performance computational grid with clusters-of-workstations, shared memory multi-processors and rapid interconnects. Suites of fast estimators are devised using approximation algorithms for FPGA mapping and partitioning. An assortment of algorithmic methods is applied. A major focus is on new heuristic and optimization strategies designed to exploit emergent mathematical techniques. Supporting software tools are also developed, with an emphasis placed on portability. Implementation testbeds are built around edge-based segmentation and related problems common to a variety of image processing applications.","title":"Towards an Automated Development Environment for Parallel Computing with Reconfigurable Processing Elements","awardID":"0075792","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["217240","364563",135973,"550407","559172"],"PO":["180163"]},"54682":{"abstract":"EIA-0081307<br\/>Torrellas, Josep<br\/>University of Illinois<br\/><br\/>ITR: Intelligent Memory Architectures and Algorithms to Crack the Protein Folding Problem<br\/><br\/>This project is a multidisciplinary effort to design fundamentally improved algorithms, hardware, and software to solve the protein folding problem. The project, which teams experts in hardware, software, and computational biology, promises advances in applications of protein folding such as drug design and understanding of diseases. In addition, the project will investigate new hardware and software based on advancing IC technology. The architecture under examination will use increased integration of processors and memory in a single chip, and software will take advantage of the proximity of memory and processing. This work is tightly coupled to the IBM Blue Gene effort, but will investigate complementary issues. In particular, simulation-based studies will investigate the use of next-generation intelligent architectures.","title":"ITR: Intelligent Memory Architectures and Algorithms to Crack the Protein Folding Problem","awardID":"0081307","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["199938","515512","558488","485665","541367"],"PO":["565136"]},"53164":{"abstract":"EIA- 0075067<br\/>Mark, Gloria<br\/>University of California-Irvine<br\/><br\/>POWRE: Developing a Research Methodology for Studying Mobile IT Usage and Person Mobility<br\/><br\/>The objective of this work is to develop a new methodology that is suitable for evaluating the usage of mobile information technologies, as well as person mobility. The research activity consists of adapting a microcamera technology as an evaluation tool. The project encompasses development of specialized coding software and data analysis techniques and development of supplementary evaluation tool for an electronic diary. The system testing will involve actual users in the field, obtaining user feedback, analyzing the data, and refining the technology and evaluation methodology.","title":"POWRE: Developing a Research Methodology for Studying Mobile IT Usage and Person Mobility","awardID":"0075067","effectiveDate":"2000-08-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["518420"],"PO":["289456"]},"48962":{"abstract":"The goal of this research is to explore and evaluate the addition of visual peripheral displays to human-computer interfaces. Through a series of laboratory experiments, in conjunction with usability evaluations and field trials of system prototypes, the PI will conduct an in-depth exploration of how peripheral information can be used effectively in an office setting. The PI and her team will design and build an interface that uses projected visual displays to extend the user's virtual workspace past the confines of his\/her desktop monitor, and then use it to augment an office environment in a way that supports current working practices. The emphasis on supporting current work practice, with its resulting inclusion of desktop computers, is in sharp contrast to visions of tomorrow's world where the desktop computer is replaced by either a plethora of computing devices (ubiquitous computing) or a single personal head-worn display that superimposes information over the wearer's view of the world (wearable augmented reality). The PI posits that her approach, coupled with a set of carefully designed laboratory experiments, will lead to a deep understanding of the issues involved in deploying peripheral displays in realistic environments. This research is expected to have several important outcomes. It will lead to techniques for determining and modeling a user's working contexts, especially the ranking and clustering of documents within those contexts; these will enable the user to easily shift between tasks, quickly regaining the last state of previous efforts and maintaining an awareness of documents used in the past. This research will also lead to techniques for visually presenting peripheral information, perhaps as visual montages designed to take advantage of peripheral perception mechanisms by conveying the salient portions of a piece of information, including its surrounding context, while remaining unobtrusive. Finally, the research will provide insight into the design of a 3D peripheral space that augments the use of traditional desktop terminals, with emphasis on the division of this space into logical groups based on the relevance and familiarity of the material, and the dynamic behavior of the space as material becomes more or less relevant to the current task.","title":"Augmenting the Periphery with Large-Scale Visual Displays","awardID":"9988712","effectiveDate":"2000-08-01","expirationDate":"2004-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":[125303,"506686","538206"],"PO":["246649"]},"54286":{"abstract":"EIA-0079799<br\/>Swindlehurst, Arnold<br\/>Brigham Young University<br\/><br\/>MRI: Development of a Comprehensive Real-Time Instrument for MIMO Wireless Channel Measurement and Space-Time Coding Implementation<br\/><br\/>The primary goal of this proposal is the design, construction, and testing of a general purpose wireless communications platform that can be used for multiple transmit and receive antennas channel measurement and space-time coding algorithm assessment. The proposed instrumentation will be extremely flexible, allowing for variable array geometry, antenna spacing, bandwidth (up to 20MHz), carrier frequency (500MHz-20GHz), modulation format, polarization, and path distance. Two system configurations will be constructed, a tethered system for short range (<300m) indoor experiments, and another that permits longer range (300-5000m) outdoor experiments using GPS receivers for carrier phase lock.","title":"MRI: Development of a Comprehensive Real-Time Instrument for MIMO Wireless Channel Measurement and Space-Time Coding Implementation","awardID":"0079799","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["486561","545777","364780","557396"],"PO":["557609"]},"47423":{"abstract":"EIA-9983430<br\/>Zhang, Aidong<br\/>SUNY Buffalo<br\/><br\/>Digital Government: Very Large Scale Multidimensional Data Management and Retrieval for USGS and NIMA Imagery<br\/><br\/>This project will conduct research on managing and retrieving multidimensional data held by partner government agencies (the United States Geological Survey (USGS) and the National Imaging and Mapping Agency (NIMA)). In such applications, geographic image databases distributed at remote locations must be made available at other locations for purpose of data retrieval. With the advent of content-based retrieval of image data, traditional methods for database design and query search will not be suitable in developing distributed image retrieval systems.<br\/><br\/>The objective of the proposed research is to investigate novel approaches to supporting effective and efficient access to the integrated geographic image databases over the Internet. These approaches will establish a foundation for the design of distributed geographic image retrieval systems. The technical challenge relating to the design of such integration is the creation of meta-level system on top of the image databases. The specific research goals are : (1) identify multi-scale representation (multidimensional) methods for geographic images, (2) investigate novel clustering approaches that can detect clusters of arbitrary shape of multidimensional image data, (3) construct a metadata model that formulates the metadata that are needed for the integrated system to direct a visual query to relevant databases, (4) develop the theoretical foundation of database selection approaches based on the metadata, and (5) design novel visual query processing approaches that integrate heterogeneous features extracted from the content of visual data.<br\/><br\/>During the project period, USGS and NIMA will provide all necessary imagery data sets and their categories. A system will be disseminated at both USGS and NIMA sites at the end of the project period. Through the above research activities, the fundamental understanding and novel techniques will be provided to support the design of distributed volume of multidimensional data distributed over the Internet and will find broad applications as a template for the development of distributed image database system in other government agencies, such as NASA. The experimental results to be generated can be used to establish effective benchmarks for assessing the performance of distributed image data retrieval systems.","title":"Digital Government: Very Large Scale Multidimensional Data Management and Retrieval for USGS and NIMA Imagery","awardID":"9983430","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["542246","518277"],"PO":["371077"]},"47434":{"abstract":"EIA-9983459<br\/>Scott, David W.<br\/>William Marsh Rice University<br\/><br\/>Digital Government: Collaborative Research: Quality Graphics for Federal Statistical Summaries<br\/><br\/>The Federal government distributes a vast quantity of statistical summaries in printed and electronic form. The full wealth of information that might be derived from these summaries is not being realized because limited attention is paid to disseminating summaries in understandable forms. This research will develop and assess quality graphics for federal statistical summaries. The development and assessment process will consider perceptual and cognitive factors in reading, interacting with and interpreting statistical graphs, maps and metadata representatives. The purposes of the quality graphics include exploration by agency users evaluating data quality and looking for emergent trends, decision making by public policy makers and communication of statistical summaries to the public. The proposed research addresses four topic areas: converting tables to graphs, representing metadata, interacting with both graphs and maps, and conveying multivariate spatial and temporal relationships. The research features use of Web-based \"middleware\" components to provide rapid development of graphics for usability testing. The featured middleware is a Java Graphics Component Library (GPL). A long history of research has recently culminated in a rigorous graph algebra that is the foundation for the library. The library also benefits from the collective intellectual effort being poured into Java. Principles of human perception and cognition will be used to guide the construction of statistical graphics, and usability tests will help to refine those principles in the context of federal statistical summaries. The research team has been carefully selected to bring together outstanding and compatible investigators who will provide expertise in statistical graphics, cartography, human perception and cognition, and software development and is composed of university, industrial and federal agency personnel.","title":"Digital Government: Collaborative Research: Quality Graphics for Federal Statistical Summaries","awardID":"9983459","effectiveDate":"2000-08-15","expirationDate":"2005-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["412000"],"PO":["371077"]},"49018":{"abstract":"CCR 9988884<br\/> Title: Automated Methods in the Analysis and Verification of Concurrent <br\/> Systems<br\/> PI: A. Prasad Sistla<br\/><br\/>Abstract: <br\/> The project investigates various methods, based on temporal <br\/>logic model-checking, for automated<br\/>analysis of concurrent and distributed systems including<br\/>security verification of Internet based applications such<br\/>as e-commerce.<br\/>Hybrid techniques, employing symmetry and partial order based<br\/>methods, will be investigated for containing<br\/>the state explosion and for checking both safety and liveness properties.<br\/>The project also considers work on verification of systems<br\/> composed of arbitrary number of processes. <br\/>Verification of such systems<br\/>with different network topologies will be explored. <br\/>As part of this work, induction based techniques as well as<br\/>algorithmic techniques will be developed. The security verification will<br\/>consider different security properties, intruder and protocol models.<br\/>The project emphasizes both basic research as well as experimental <br\/>work in the form of implementation<br\/>and application to real-world problems.","title":"Automated Methods for Verification of Concurrent Software Systems","awardID":"9988884","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["550555"],"PO":["564388"]},"52021":{"abstract":"The aim of this project is to study mathematical problems associated with the control and performance analysis of stochastic networks. The network models being considered are heterogeneous, may have complex feedback mechanisms, and allow for stochastic variability in arrivals, service times and routing. Buffers in the network enable jobs to be stored that cannot be served immediately. In addition, the models with control allow for dynamic sequencing and alternate routing of jobs. Since the complexity of these network models usually precludes exact analysis, the focus is on approximate models. Two levels of approximation are being considered, namely fluid models (first order approximations) and diffusion models (second order approximations). Investigating the interplay between these models is an important feature of the research. The two main topics are (i) dynamic control through sequencing and alternate routing, and (ii) performance analysis for processor sharing networks. With regard to topic (i), some authors have successfully used diffusion control problems as formal tools for generating good control policies for some specific network models. However, there are few rigorous analyses of the performance of such policies. The PI is developing a systematic approach to finding and interpreting solutions of diffusion control problems and to analyzing the performance of the policies generated in this manner. Regarding topic (ii), the processor sharing discipline is an example of a service discipline for which a natural state descriptor involves a measure-valued process (to keep track of the residual service times of all jobs in the network). The PI is studying fluid and diffusion approximations of processor sharing networks with the aims of understanding the dynamics of such networks, obtaining measures of performance, and developing general tools for studying measure-valued processes associated with network models. <br\/> Stochastic networks are used as models for complex manufacturing, telecommunications and computer systems. A challenging problem for such networks is to design controls that are simple to implement and yet are near optimal in an appropriate sense. Motivated by such problems, a number of mathematical questions associated with controlling and analyzing the performance of stochastic networks are being studied under this grant. Since the complexity of stochastic network models usually precludes exact analysis, the focus is on approximate models with a hierarchical structure. As with recent work on the performance analysis of some networks, the interplay between the levels in this hierarchy is an important feature of the research.","title":"Stochastic Networks: Control and Performance","awardID":"0071408","effectiveDate":"2000-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1263","name":"PROBABILITY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["512491"],"PO":["517169"]},"54287":{"abstract":"EIA-0079800<br\/>Huang, Thomas S.<br\/>University of Illinois Urbana-Champaign<br\/><br\/>MRI: LIVE: Laboratory for Immersive Virtual Experiments<br\/><br\/>This proposal establishes the Laboratory for Immersive Virtual Environments (LIVE) which will provide a testbed for engineering and computer science research on distributed graphics, sensor integration, audio display, and human face, speech, and gesture recognition. Psychologists will use LIVE to determine how visual perception drives information extraction, navigation, and human movement. Scientists will use LIVE to explore and analyze their three dimensional datasets. Twenty-five faculty members from nine departments will use LIVE to build and understand virtual worlds and human interfaces. The heart of LIVE will be a fully enclosed, 6-sided, 10'x10'x10', backprojected virtual reality environment to be housed at the Beckman Institute and the University of Illinois.","title":"MRI: LIVE: Laboratory for Immersive Virtual Experiments","awardID":"0079800","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"V012","name":"DARPA-OPTICAL IMAGING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"W387","name":"DAPRA-OPTICAL IMAGING ANALYSIS"}}],"PIcoPI":["550184",138623,"464050"],"PO":["557609"]},"46675":{"abstract":"Research on multiclass scheduling and congestion control for computer communication networks<br\/>is proposed. Emphasis is placed on multiple qualities of service, including throughput and delay,<br\/>and on multiple classes of packet data. Two complementary research topics are addressed. The<br\/>first topic is causal scheduling of packets with multiple priority classes and deadlines. The goal<br\/>is to investigate a new scheduling criterion and related algorithms for dealing with conflicting<br\/>requirements for throughput and delay for multiclass traffic with deadlines.<br\/> The second topic is multiclass implementations of end-to-end congestion control, with pricing<br\/>based on explicit congestion notification. Recently Gibbens and Kelly proposed the idea of charging<br\/>network users for marks placed on packets by network routers. A mark on a packet is an indication<br\/>that the packet caused congestion. This research explores the use of this pricing mechanism with<br\/>the addition of a small number of packet classes and a multiclass service discipline at the routers,<br\/>based on the classes. Limited or no use of per flow state information will be made at the routers.<br\/> The approach will be to perform modeling, analysis, and design. Models will be based on current and anticipated future technology, and cover a broad spectrum of user demands and network<br\/>topologies. The analysis techniques will include simulation, asymptotic analysis based on fluid limits, diffusion limits, and large deviation theory, and stability analysis based on Lyapunov functions<br\/>derived from convex analysis. Methods for optimization, such as convex programming methods and<br\/>combinatorial optimization, and classical scheduling theory will be used. Nonstochastic methods<br\/>such as investigation of sample path optimality properties and competitively optimal scheduling<br\/>will also be considered.<br\/> Successful completion of the proposed research will provide (1) improved algorithms for scheduling multiclass traffic with strict time constraints, (2) an improved understanding of the implementation choices and the value of congestion based pricing using a small number of packet classes for the purpose of end-to-end congestion control in large scale networks, and (3) new mechanisms for end-to-end congestion control in large-scale computer communication networks.","title":"Multiclass Scheduling and Congestion Control in Communication Networks","awardID":"9980544","effectiveDate":"2000-08-15","expirationDate":"2006-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["456909"],"PO":["565090"]},"53088":{"abstract":"EIA-0074821<br\/><br\/>Krol, Marina<br\/>Mt. Siani School of Medicine<br\/><br\/>The objective of this POWRE project is to advance research by the development of more sophisticated algorithms and mathematical\/ computer models based on pharmacokinetic analysis for predicting critical conditions that are associated with postoperative complications. The project is based upon a database of computerized anesthesia records that grows by 20,000 cases per year. The paradigm is based upon real clinical cases. The end porduct of the research, beyond project duration, will be prototype intelligent workdtation that implements proposed models and algorithms.","title":"Multidisciplinary Research: Early Detection and Prediction of Critical Conditions During Anesthesia.","awardID":"0074821","effectiveDate":"2000-08-15","expirationDate":"2002-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":[135266],"PO":["289456"]},"48766":{"abstract":"Vijay Karamcheti, Zvi M. Kedem<br\/><br\/>The process migration problem has received a lot of attention but has produced only mixed results. Traditionally, migration mechanisms have been used to balance the load among processors in a distributed system. However, most mechanisms proposed to date for general-purpose applications have required extensive operating system kernel modifications. Hence, conventional wisdom has held that the costs of process migration are not justified by resulting benefits. This research takes a new look at process migration, recognizing both its utility for an increasing number of emerging applications that can tolerate higher overheads, as well as the possibility of implementing necessary mechanisms using novel user-level techniques. Process<br\/>migration enables a host of capabilities such as mobility, collaborative work, distributed systems management, automatic reconfigurability, and fault-tolerance. Moreover, API interception<br\/>technologies, which permit insertion of arbitrary functionality in the execution path of an application's interactions with the underlying operating system, enable process migration to be implemented without kernel modification. This research investigates a virtualization<br\/>scheme that decouples an application from dependencies in the operating system and the physical environment. Virtualization also monitors and controls the interactions and the resulting side effects between processes and operating systems, making process migration<br\/>possible.","title":"General-purpose Process Migration","awardID":"9988176","effectiveDate":"2000-08-01","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["218060","309341"],"PO":["241298"]},"48788":{"abstract":"In this project, the original theory for hazard elimination in combinational circuits is being expanded to also accelerate circuit speed while reducing power consumption. This method relies on transistor timing adjustments to eliminate hazards, and also on transistor resizing to speed up multiple circuit paths. One method being investigated is to enumerate path delays in the circuit, and use them as non-linear programming constraints. This will be feasible if the circuit is partitioned. Another method being investigated is a different formulation that does not require path enumeration. Experiments on both formulations are being conducted using linear and non-linear programming solvers. Since it is not clear which method is superior, both will be tried using AMPL, which is a widely used mathematical programming package.<br\/> Hazards account for 60% of the power used in certain arithmetic circuits. Hazards are eliminated with either the balanced path delay method or by an original method of increasing logic gate inertial delays so that gates do not respond to hazard-creating input conditions. Agrawal and Bushnell have proven the minimum transient energy conditions necessary for a circuit to use minimal energy, and developed the first optimal linear programming method for transistor resizing to minimize transient energy. They use a simultaneous application of both the balanced path delay method, and the method of increasing logic gate inertial delays to make logic gates filter out hazards. The balanced path delay method frequently requires the insertion of buffers to balance path delays, or decreased transistor sizes on fast paths to achieve the same effect. Hazard filtering, instead, merely requires that logic gates be slowed down so that they cannot react to hazard-producing conditions at their inputs. The project is developing a non-linear programming method to adjust path delays by transistor resizing to simultaneously lower power and speed up the circuit, while limiting the increase in chip area. This beneficial method substantially reduces power while speeding up the circuit, which lowers chip packaging, cooling, and silicon costs.","title":"Low-Power System-on-a-Chip Design for Minimum Transient Energy","awardID":"9988239","effectiveDate":"2000-08-15","expirationDate":"2005-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["485659","260890"],"PO":["562984"]},"52682":{"abstract":"Run-time reconfiguration (RTR) is a method of computing in which the hardware, usually field-programmable gate arrays (FPGAs), changes structure from one phase to the next of a computation. It has applications in image processing, signal processing, encryption, networking, and other areas. The research develops the necessary foundations to open up RTR to wider usage.<br\/><br\/>The research addresses directions: (1) Development of a layered model of FPGAs suitable for broad exploration of RTR solution approaches, and porting of reconfiguration techniques developed by the investigators and others in the study of reconfigurable meshes to the RTR arena. (2) Design of fault tolerant RTR solutions in both an algorithm-specific context and in a general computational context. (3) Development of ``hardware operating system'' support for users to distance themselves from FPGA details.<br\/><br\/>The research leads to benefits of less hardware, because of reuse of reconfigurable hardware, and faster computation, because of specialization to input. It develops a fundamental understanding of RTR, its power and<br\/>limitations, and to establish a framework for using it efficiently.","title":"Modeling Run-Time Reconfiguration","awardID":"0073429","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["216913","216914","216915"],"PO":["180163"]},"43310":{"abstract":"Proposal Number: 9912387 <br\/>PI: Miller, Dale A<br\/>Institution: Penn State University, University Park <br\/>Title: Reasoning about Specifications of Computation <br\/><br\/><br\/>Computational systems are often given their meaning in terms of<br\/>operational semantics, and these, in turn, can be formalized in<br\/>meta-languages based on logics or type systems. Specifying<br\/>operational semantics in such meta-languages allows formal results<br\/>about semantics to be derived by reasoning within the meta-language:<br\/>for example, type soundness for a programming language might be<br\/>derived as a formal consequence from the theories specifying typing<br\/>and evaluation semantics. One challenge in developing a framework for<br\/>such reasoning is the proper treatment of induction when higher-order<br\/>abstract syntax, an elegant and declarative treatment of object-level<br\/>abstraction and substitution, is used to encode syntax. Current<br\/>approaches to inductive reasoning requires that syntax be coded using<br\/>the first-order techniques of algebraic terms, which itself requires<br\/>clumsy encodings for binding and substitution. A meta-logic that can<br\/>be used to reason inductively about judgments coded using higher-order<br\/>abstract syntax will be developed: this meta-logic will be an<br\/>extension of a higher-order intuitionistic logic that admits induction<br\/>and a notion of definition. A prototype system that implements this<br\/>logic and uses it to reason about computations specified in<br\/>operational semantics will be developed.","title":"Reasoning About Specifications of Computation","awardID":"9912387","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["364876"],"PO":["564388"]},"48756":{"abstract":"CCR-9988155<br\/>Stark, Eugene W.<br\/>Smolka, Scott A.<br\/>State University of New York at Stony Brook<br\/>\"Compositional Techniques for Verification and Performance Analysis<br\/> of Reactive, Probabilistic Systems\"<br\/><br\/>The research proposed here has as its objectives: (1) to develop<br\/>significantly improved techniques for the formal specification,<br\/>verification, and performance analysis of systems that exhibit<br\/>concurrent, reactive, probabilistic, and real-time behavior; (2) to<br\/>construct implementations of these techniques in the form of efficient<br\/>computer-aided design tools; and (3) to assess these tools and<br\/>techniques and guide their further development by applying them to<br\/>problems drawn from actual real-world engineering practice. In this<br\/>research, attention will be focused primarily on finite-state system<br\/>models. A key characteristic of the approach is compositionality,<br\/>which permits a large system to be described as the composition of a<br\/>collection of simpler components and to be analyzed in a<br\/>component-by-component fashion. This research will build on previous<br\/>work of the PIs, in which they developed a model, called<br\/>\"probabilistic I\/O automata\" (PIOA), for the compositional<br\/>specification of reactive, probabilistic systems, together with<br\/>compositional performance analysis algorithms for this model. The<br\/>proposed project would advance the state of the art in the area of<br\/>formal specification and verification techniques for finite state<br\/>systems, which holds promise for enabling more efficient production of<br\/>more reliable software systems.","title":"Compositional Techniques for Verification and Performance Analysis of Reactive Probabilistic Systems","awardID":"9988155","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["451745",124818],"PO":["564388"]},"47667":{"abstract":"This project will strengthen the high performance computing academic program at Mississippi State University by creating a symbiosis between research and education. The research component will ultimately help extend the knowledge of the scientific community towards obtaining accurate theoretical models, so that computer simulations of physical phenomena give correct predictions. The research will do this by studying dynamic scheduling strategies for these computations, which (when properly constructed) provide simple, fast, and effective algorithms for the simulations. The education component will nurture the development of students' fundamental skills in problem solving in both theoretical and practical training. It will do this by improving the curricula by coupling strong foundational courses from different disciplines and providing meaningful interactions between them.<br\/><br\/>Technically, the research will extend the study of dynamic scheduling strategies used in scientific computing with new methods, and evaluate those methods on both analytical and experimental bases. The work here specifically addresses the issues of discovering novel dynamic scheduling strategies that can accommodate highly unpredictable program behavior, providing an integrated dynamic scheduling framework for scientific applications, and analyzing the performance of parallel applications via predictive performance metrics. Doing this will use the expertise and infrastructure of the NSF Engineering Research Center for Computational Field Simulation.","title":"CAREER: Advances in Dynamic Scheduling Strategies for Scalable Parallel Scientific Applications","awardID":"9984465","effectiveDate":"2000-08-15","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["491915"],"PO":["565272"]},"47436":{"abstract":"EIA-9983461<br\/>Carr, Daniel B.<br\/>George Mason University<br\/><br\/>Digital Government: Collaborative Research: Quality Graphics for Federal Statistical Summaries<br\/><br\/>The Federal government distributes a vast quantity of statistical summaries in printed and electronic form. The full wealth of information that might be derived from these summaries is not being realized because limited attention is paid to disseminating summaries in understandable forms. This research will develop and assess quality graphics for federal statistical summaries. The development and assessment process will consider perceptual and cognitive factors in reading, interacting with and interpreting statistical graphs, maps and metadata representatives. The purposes of the quality graphics include exploration by agency users evaluating data quality and looking for emergent trends, decision making by public policy makers and communication of statistical summaries to the public. The proposed research addresses four topic areas: converting tables to graphs, representing metadata, interacting with both graphs and maps, and conveying multivariate spatial and temporal relationships. The research features use of Web-based \"middleware\" components to provide rapid development of graphics for usability testing. The featured middleware is a Java Graphics Component Library (GPL). A long history of research has recently culminated in a rigorous graph algebra that is the foundation for the library. The library also benefits from the collective intellectual effort being poured into Java. Principles of human perception and cognition will be used to guide the construction of statistical graphics, and usability tests will help to refine those principles in the context of federal statistical summaries. The research team has been carefully selected to bring together outstanding and compatible investigators who will provide expertise in statistical graphics, cartography, human perception and cognition, and software development and is composed of university, industrial and federal agency personnel","title":"Digital Government: Collaborative Research: Quality Graphics for Federal Statistical Summaries","awardID":"9983461","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1706","name":"DIGITAL GOVERNMENT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"X716","name":"BUR OF CENSUS-QUALITY GRAPHICS"}}],"PIcoPI":["352325"],"PO":["371077"]},"69238":{"abstract":"","title":"State-Space Reduction for Flexible and Approximate Computation","awardID":"0196057","effectiveDate":"2000-08-07","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["356253"],"PO":["564456"]},"53332":{"abstract":"Abstract<br\/><br\/><br\/>The goal of this project is to develop algorithms and tools for interior point methods. <br\/>The investigator will continue his ongoing research into interior point methods with <br\/>the aim of advancing several outstanding topics in semidefinite programming (SDP) and <br\/>related problems. A better understanding of neighborhoods and paths is needed in SDP, <br\/>and in programming over a symmetric cone in general. This is necessary in order to <br\/>develop more efficient algorithms in terms of faster asymptotic convergence and numerical <br\/>stability. The investigator intends to develop effective mathematical tools to deal <br\/>with these issues. Programming over homogeneous cones and hyperbolic cones are likely <br\/>to become the next emerging fields in interior point methods, and there is a need to <br\/>develop efficient, long-step interior algorithms for such problems. Eventually, <br\/>interior point methods will need to deal with even more complicated industrial <br\/>applications which must be solved efficiently. The project will involve all of these <br\/>areas of interior point methods; efficient algorithms will be devised in all cases, <br\/>and the needed mathematical tools will be developed. The project also has two other <br\/>goals. The first is an extension of duality theory beyond its traditional convexity, <br\/>and the second one is the development of faster proximal point algorithms for convex <br\/>programming. <br\/><br\/><br\/>Interior point methods have been successful in solving many large scale industrial problems <br\/>in industry: in civil and electrical engineering, management, communication networks, <br\/>finance, and others. Further applicability of these methods depends on a better <br\/>understanding of their behavior and continuous development of appropriate software. This <br\/>project aims to search for efficient algorithms and improved mathematical tools so that large <br\/>scale optimization problems arising from diverse industrial disciplines can be efficiently <br\/>solved.","title":"Investigations in Interior Point Methods and Convex Programming","awardID":"0075722","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["248451"],"PO":["565356"]},"48647":{"abstract":"This research focuses on creating a computer system that serves as musical accompanist in non-improvised music for soloist and accompaniment. The system will \"hear\" the soloist by performing a real-time analysis of the acoustic signal to determine when important musical events take place. As the piece of music is rehearsed, the system will train a probabilistic model of the soloist's rhythmic interpretation; it will understand both what it \"knows\" and what it \"doesn't know\" about the soloist's interpretation by modeling both mean behavior and covariance structure. The predictive power of this model will be combined with the real-time signal analysis to enable the system both to follow and to anticipate the soloist. In addition, the system will be presented with expressively played examples of the accompaniment and will train and utilize a model of the accompaniment's musical interpretation based on these. The goal is to create a system that demonstrates both the technique and musicality necessary to achieve a high level of music-making. From a modeling point of view, the primary challenge is one of knowledge fusion. The system is faced with a number of disparate sources of knowledge including the musical score, the real-time analysis of the soloist's acoustic signal, training data from the past rehearsals, and inherent musical constraints on the accompaniment. A probabilistic model, a Bayesian Belief Network (BBN), will be developed that incorporates and balances these knowledge sources in a way that is musically believable, automatically trainable, and computationally efficient. The resulting system will be an invaluable teaching tool, as well as an aid to musicians preparing for performance. The approach should be applicable to other domains as well. Finally, if such an accompaniment system passes the musical equivalent of the \"Turing Test\" it would comprise a new and unexpected data point to be considered in our evolving understanding of the bounds of human and artificial intelligence.","title":"Music Plus One: A System for Synthetic Musical Accompaniment","awardID":"9987898","effectiveDate":"2000-08-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1269","name":"STATISTICS"}}],"PIcoPI":["535948"],"PO":["246649"]},"52695":{"abstract":"Abstract<br\/> This research will improve the decoding of error-control codes, in<br\/>particular, Reed-Solomon codes, which are essential in most advanced modern<br\/>communication and storage systems, ranging from deep space communication to <br\/>optical and magnetic storage systems, such as the compact disk and CD-ROM.<br\/>By developing decoders that operate at lower signal to noise ratios, this<br\/>research will allow the recovery of data and records that currently are<br\/>unreadable.<br\/> This research will develop an efficient soft decoding algorithm that <br\/>will significantly outperform GMD-based decoding algorithms. The algorithm<br\/>is based on Sudan's list decoding technique that produces a list of <br\/>tentative codewords and it shows a number of very interesting features.<br\/>Among the most intriguing characteristics of the algorithm is a complexity<br\/>and performance that can be traded freely within certain fundamental<br\/>limits. Hence, the coding gain provided by the Reed-Solomon code can be<br\/>traded on the fly for complexity in any application with the maximal<br\/>list size changing accordingly.","title":"High-Performance Decoding of Algebraic Codes Beyond their Packing Radii","awardID":"0073490","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["381437","348133","320975"],"PO":["564898"]},"46920":{"abstract":"BIOCOMPLEXITY: Collaborative Research: Biocomplexity of aquatic microbial systems -- relating diversity of microorganisms to ecosystem function<br\/><br\/>Microbial biogeochemical cycling of the elements regulates a dynamic environment in which the cycles of different elements are linked through the physiology of microorganisms. While a certain degree of understanding can be gained through physical\/chemical approaches to measurement and modeling of the net transformations, these approaches necessarily rely on gross simplifications about the role and regulation of the various functional groups (guilds) involved. Recent advances in molecular microbial ecology have shown the microbial world to contain immense diversity and complexity at every level: redundancy and duplication of functional genes within a single organism; molecular diversity among functional genes that encode the same process in different organisms; large genetic diversity among different organisms apparently engaged in the same biogeochemical function within single communities; great variability in the species composition of different communities that apparently perform equally well. The goal of this project is to investigate the functional relationship between complexity in microbial communities and the physical\/chemical environment at a range of biological and ecological scales. Previously, such analysis was technologically limited by the inability to assay large numbers of samples simultaneously for a large number of genes and phylotypes. Using gene array technology, the researchers will be able to detect the distribution and differential expression of functional genes in natural systems. The results of this study will constitute the first step towards application of DNA chip technology for gene expression of \"exotic\" (i.e., not of biomedical importance) processes and organisms in the environment. The gene arrays, along with a full suite of ecosystem process measurements, will be deployed along a transect that spans the eutrophic - oligotrophic gradient from the inland waters of the Chesapeake Bay out to the Sargasso Sea. Experiments and functional gene studies will focus on key transformations in the carbon and nitrogen cycles (C fixation, N fixation, nitrification, denitrification, urea assimilation). The diversity of guilds will be interpreted in terms of ecosystem function, assessed using geochemical data and tracer experiments. In addition to field studies designed to investigate and dissect the natural system, the group of collaborating scientists will also perform perturbation experiments using mesocosms. The goal of these experiments is to determine how microbial species diversity affects the major energy and nutrient flows within ecosystems, and to assess the degree of stability or instability associated with changes in redundancy within guilds of microorganisms responsible for major nitrogen and carbon pathways.","title":"Collaborative Research: Biocomplexity of Aquatic Microbial Systems: Relating Diversity of Microorganosms to Ecosystem Function","awardID":"9981437","effectiveDate":"2000-08-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["528109"],"PO":["354885"]},"48834":{"abstract":"Proposal Number CCR-9988363<br\/>An Experimental Study of Broadcasting Protocols for Video-on-Demand<br\/>PI: D.E. Long<br\/><br\/>One of the most promising approaches to making video-on-demand services<br\/>more competitive is to continuously broadcast the most frequently requested<br\/>videos. This research addresses three important limitations common to most<br\/>existing broadcasting protocols for video-on-demand.<br\/><br\/>A first research direction is the development of broadcasting protocols<br\/>that can handle compressed videos having variable bandwidth requirements.<br\/>The performance of these new protocols will be evaluated using a<br\/>representative set of videos in the MPEG-2 format used by DVD. <br\/><br\/>A second research direction is the efficient implementation of interactive<br\/>functions analogous to those existing on a VCR. These functions will allow<br\/>customers to pause, move backward and forward as if they were watching a<br\/>videocassette.<br\/><br\/>A third research direction is the design of broadcasting protocols that can<br\/>adjust their broadcasting schedules to all observed changes in the request<br\/>arrival rate. As a result, these dynamic broadcasting protocols will<br\/>perform equally well at peak hours and at hours of lower demand.<br\/><br\/>All these broadcasting protocols will be demonstrated on a very simple<br\/>testbed consisting of a single workstation broadcasting a few specific videos.<br\/><br\/> This is a collaborative research project between the University of<br\/>California, Santa Cruz and the University of <br\/>Houston.","title":"COLLABORATIVE RESEARCH: An Experimental Study of Broadcasting Protocols for Video-on-Demand","awardID":"9988363","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["540846"],"PO":["241298"]},"51970":{"abstract":"This award provides infrastructure and research funding for the Center for Ultracold Atoms, a joint effort between the Massachusetts Institute of Technology and Harvard University designed to take advantage of the recent dramatic progress in atom optics on the one hand and in methods for creating coherent atoms on the other to explore opportunities for scientific advances and new technologies that would be difficult to implement within the context of individual investigators working in isolation. The goals of the Center include developing coherent atom sources of unprecedented intensity, devising techniques for manipulating the atoms for scientific and technological applications, developing methods for trapping and cooling new species of atoms, studying surface interactions with coherent atoms, loading atoms into surface waveguide structures, and developing methods for new types of spectroscopy. The Center will reach out to the scientific community with a substantial visitors program that will encourage senior and junior scientists to participate in the research and carry the Center's expertise elsewhere. A companion educational project is also being undertaken with the Museum of Science in Boston and Wellesley College. This project is jointly supported by the Atomic, Molecular, Optical, and Plasma Physics Program, the Condensed Matter Physics Program, and the Office of Multidisciplinary Activities in the Mathematical and Physical Sciences Directorate.","title":"Center for Ultracold Atoms","awardID":"0071311","effectiveDate":"2000-08-15","expirationDate":"2006-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1248","name":"PHYSICS-OTHER"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"1646","name":"PHYSICS FRONTIER CENTER"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["300351","465262","300352","490257"],"PO":["384749"]},"40871":{"abstract":"The objective of the proposed research is to investigate novel approaches to supporting effective and efficient access to various geographic image databases over the Internet leading to design of <br\/>distributed geographic image retrieval systems. The research involves three research teams from: SUNY Buffalo, National Center for Science Information Systems (NACSIS) in Japan, and the University of Nantes in France. (IRESTE) The technical challenges are the creation of a new meta-level system for geographic image databases. To achieve this, research issues concerned with representation models for geographic data, relationships between metadata and resource discovery and efficient query processing in a distributed environment must be addressed. The problems addressed are critical to retrieval on large volume, multidimensional, distributed data over the Internet. Results can be broadly applied to numerous domain and interdisciplinary research areas.","title":"Metadata Model, Resource Discovery, and Querying on large-scale Multidimensional Datasets","awardID":"9905603","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["528208","542246","518277"],"PO":["564456"]},"54852":{"abstract":"EIA-0082499<br\/>Siyuan, Han<br\/>University of Kansas<br\/><br\/>Title: ITR: Fast Superconducting Qubit and Qugate for Quantum Computing<br\/><br\/><br\/>An interdisciplinary team of experimentalists and theoreticians from the University of Kansas and the Japanese Ministry of Posts and Telecommunications are collaborating to explore the use of superconducting interference devices for quantum computing. The SQUID devices under investigation consist of Josephson junctions embedded in a superconducting loop, and will be used to implement quantum bits and quantum gates. This work concentrates on two problems:<br\/><br\/>1. To increase the decoherence time of qubits using niobium nitride (NbN) as the superconducting material. NbN has much lower intrinsic damming than the commonly used niobium SQUID. The Japanese collaborators, who have the best NbN junction fabrication facilities in the world, will make samples of tunnel junctions and SQUIDs. These will be sent to Kansas for measurement of decoherence times.<br\/><br\/>2. To conduct an integrated theoretical and experimental study of Controlled-Not gates using SQUID.","title":"ITR: Fast Superconducting Qubit and Qugate for Quantum Computing","awardID":"0082499","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["362803","548326"],"PO":["565223"]},"54687":{"abstract":"EIA-0081332<br\/>DeMille, David<br\/>Yale University<br\/><br\/>ITR: Quantum Computation with Trapped Polar Molecules<br\/>David DeMille<br\/><br\/>This project is developing the basis for a new technical approach to the design of a quantum computer, which can plausibly achieve several orders of magnitude improvement in number of operations performed before decoherence. The quantum mechanical bits in this design consist of the electric dipole moments of diatomic molecules, which may be oriented either along or against an external electric field. Coupling between bits for logical operations is established because the electric field created by each dipole influences the energy of its neighbors. The molecular dipoles are trapped in a linear array formed by a standing-wave laser beam. It is estimated that this design can lead to a quantum computer with 10,000 qubits, which can perform 100,000 processor steps in the 1-10 seconds before decoherence.<br\/><br\/>This project will address two aspects of the development of this approach: a source of ultracold molecules, and demonstration of the couplings between polarized molecules. The first stage of the work will be development of the source of molecules by simultaneously collecting Rb and Cs atoms in a magneto-optic trap, then photoassociating them to form ultracold RbCs molecules. The second stage will demonstrate the possiblilty of coupling between molecules by measurement of molecular electric resonance frequencies as a function of density and applied electric field. Once the effect has been observed the project will turn to the construction of an optical trap for the quantum computer. Demonstrations of most of the technical elements necessary for the quantum computer will be possible within the period of this project.","title":"ITR: Quantum Computation with Trapped Polar Molecules","awardID":"0081332","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["476888"],"PO":["565223"]},"51068":{"abstract":"Proposal processing and data entry by Allied Technology, Inc. for IIS-0004184","title":"Proposal Processing for the Division of Information and Intelligent Systems","awardID":"0004184","effectiveDate":"2000-08-01","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["130583"],"PO":["565227"]},"48813":{"abstract":"Proposal Number: CCR-9988322<br\/>PI's Name: Vardi, Moshe Y.<br\/>Institution: Rice University<br\/>Title: Developing Linear-Time Model-Checking Technology<br\/>Project-summary-paragraph:<br\/><br\/>Model checking is a key technology in formal verification.<br\/>As it is generally practiced today, model checking is basically<br\/>an efficient symbolic search procedure based on fixed-point computation<br\/>that checks whether a model of the design satisfies given CTL<br\/>specifications. In spite of the phenomenal success of CTL-based model<br\/>checking, CTL suffers from several fundamental limitations as<br\/>a specification language, all stemming from the fact that CTL is a<br\/>branching-time formalism: the language is unintuitive and hard to<br\/>use, it does not lend itself to compositional reasoning, and it is<br\/>fundamentally incompatible with dynamic validation.<br\/>In contrast, the linear-time framework is expressive and intuitive,<br\/>supports compositional reasoning and semi-formal verification, and<br\/>is amenable to combining enumerative and symbolic search methods.<br\/>Surprisingly, the linear-time framework, even though it preceded CTL,<br\/>and does not suffer from its weaknesses, has not enjoyed the same <br\/>intensive research focus as CTL, resulting in a much less mature<br\/>technology. This projects builds upon the theoretical foundations of<br\/>the linear-time framework that have been laid over the last 20 years, <br\/>and focuses on generating a body of knowledge that industry can convert<br\/>into a robust technology.","title":"Developing Linear-time Model-checking Technology","awardID":"9988322","effectiveDate":"2000-08-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}}],"PIcoPI":["565263"],"PO":["564388"]},"47636":{"abstract":"ABSTRACT<br\/><br\/>EIA 9984317<br\/>Naren Ramakrishnan<br\/>Virginia Polytechnic Institute & State University<br\/><br\/>CAREER: Runtime Recommender Systems for Compositional Modeling of Scientific Computations<br\/><br\/>The central goal of this career development proposal is to introduce runtime recommendation, an abstraction that extends the above two ideas significantly. Specifically, it monitors a computational process, detects state-changes, and makes selections of solution components dynamically, thus aiding knowledge-based application composition at runtime. Such a facility is important in many problem domains because: (i) the nature of the problem being solved changes as the computations are being performed, (ii) the underlying computing platform or resource availability is dynamic, or (iii) information about application performance characteristics is acquired during the actual computation rather than before. While traditional recommenders are designed off-line (by organizing a battery of benchmark problems and algorithm executions, and subsequently mining it to obtain high-level recommendation rules), the design of a runtime recommender system is difficult, because such a database is not readily available and needs to be \"captured\" on the fly. Thus, a runtime recommender interacts dynamically with its environment and learns through interactions with its environment.","title":"CAREER: Runtime Recommender Systems for Compositional Modeling of Scientific Computations","awardID":"9984317","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["498314"],"PO":["301532"]},"48978":{"abstract":"In this research program the silicon strip technology from High Energy Physics detectors is further developed for three dimensional particle tracking. Fundamental questions about Lagrangian properties of turbulence are unanswered, and our ability to test theoretical models is very limited. Important unsolved problems include statistics of the fluid particle acceleration, inertial range scaling of the Lagrangian structure functions, and n-particle turbulent dispersion. This new technology allows to follow up to four particles in three dimensions at sufficient spatial and temporal resolution to provide the facility to measure single and multiple particle Langrangian statistics in the dissipation and interial range of high Reynolds number turbulence. Simultaneously, new ways are developed to generate very high Reynolds number isotropic and homogeneous turbulence in flows with no mean velocity. These measurements will provide much needed data to compare with theoretical predictions and may trigger new directions in theoretical research. In addition, they will give important information needed to address problems of turbulent diffusion in many processes ranging from turbulent combustion to pollutant transport in the atmosphere. It also promises the continued development of high speed strip detectors as a general purpose tool which can be used for many measurements where a weak light streak has to be followed in real time.","title":"Particle Tracking in High Reynolds Number Turbulent Flows","awardID":"9988755","effectiveDate":"2000-08-01","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0301","name":"Division of PHYSICS","abbr":"PHY"},"pgm":{"id":"9134","name":"PHYSICS EDUC & INTERDISCIP RES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1710","name":"CONDENSED MATTER PHYSICS"}}],"PIcoPI":["544512","362485"],"PO":["561720"]},"47428":{"abstract":"EIA-9983445<br\/>Agouris, Peggy<br\/>University of Maine<br\/><br\/>Digital Government: Knowledge Management over Time-Varying Geospatial Datasets<br\/><br\/>Spatially-related data is collected by many government agencies in various formats and for various uses. This project seeks to facilitate the integration of these data, thus providing new uses. This will require the development of a knowledge management framework to provide syntax, context, and semantics, as well as exploring the introduction of time-varying data into the framework. Education and outreach will be part of the project through the development of an on-line short courses related to data integration in the area of geographical information systems. The grantees will be working with government partners (National Imagery and Mapping Agency, the National Agricultural Statistics Service, and the US Army Topographic Engineering Center), as well as an industrial organization, Base Systems, and the non-profit OpenGIS Consortium, which works closely with vendors of GIS products.","title":"Digital Government: Knowledge Management Over Time-Varying Geospatial Datasets","awardID":"9983445","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["457136","391834","258283"],"PO":["371077"]},"69219":{"abstract":"","title":"Proxy Services in Wide-Area Networks","awardID":"0196038","effectiveDate":"2000-08-01","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4095","name":"SPECIAL PROJECTS IN NET RESEAR"}}],"PIcoPI":["564706"],"PO":["234222"]},"46966":{"abstract":"BIOCOMPLEXITY: Collaborative Research: Biocomplexity of aquatic microbial systems -- relating diversity of microorganisms to ecosystem function<br\/><br\/>Microbial biogeochemical cycling of the elements regulates a dynamic environment in which the cycles of different elements are linked through the physiology of microorganisms. While a certain degree of understanding can be gained through physical\/chemical approaches to measurement and modeling of the net transformations, these approaches necessarily rely on gross simplifications about the role and regulation of the various functional groups (guilds) involved. Recent advances in molecular microbial ecology have shown the microbial world to contain immense diversity and complexity at every level: redundancy and duplication of functional genes within a single organism; molecular diversity among functional genes that encode the same process in different organisms; large genetic diversity among different organisms apparently engaged in the same biogeochemical function within single communities; great variability in the species composition of different communities that apparently perform equally well. The goal of this project is to investigate the functional relationship between complexity in microbial communities and the physical\/chemical environment at a range of biological and ecological scales. Previously, such analysis was technologically limited by the inability to assay large numbers of samples simultaneously for a large number of genes and phylotypes. Using gene array technology, the researchers will be able to detect the distribution and differential expression of functional genes in natural systems. The results of this study will constitute the first step towards application of DNA chip technology for gene expression of \"exotic\" (i.e., not of biomedical importance) processes and organisms in the environment. The gene arrays, along with a full suite of ecosystem process measurements, will be deployed along a transect that spans the eutrophic - oligotrophic gradient from the inland waters of the Chesapeake Bay out to the Sargasso Sea. Experiments and functional gene studies will focus on key transformations in the carbon and nitrogen cycles (C fixation, N fixation, nitrification, denitrification, urea assimilation). The diversity of guilds will be interpreted in terms of ecosystem function, assessed using geochemical data and tracer experiments. In addition to field studies designed to investigate and dissect the natural system, the group of collaborating scientists will also perform perturbation experiments using mesocosms. The goal of these experiments is to determine how microbial species diversity affects the major energy and nutrient flows within ecosystems, and to assess the degree of stability or instability associated with changes in redundancy within guilds of microorganisms responsible for major nitrogen and carbon pathways.","title":"Collaborative Research: Biocomplexity of Aquatic Microbial Systems: Relating Diversity of Microorganisms to Ecosystem Function","awardID":"9981617","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}}],"PIcoPI":["450482","347050"],"PO":["354885"]},"48924":{"abstract":"This research project proposes to study the programming productivity of global software teams from the dual perspectives of cultural variability and collaborative skills. Based on these two dynamics, the PIs will develop a framework, determine its validity and then establish the relative importance of cultural forces and collaborative skills on global team performance. An international research team of faculty at the Middle East Technical University in Ankara, Turkey and Sejong University in Seoul, South Korea are participating in this project. The three universities will set up global teams of undergraduate students doing joint programming tasks. Students will use a synchronous groupware system (with asynchronous communications capabilities, also) for their tasks. This research should provide useful insights into how to manage globally dispersed software development projects and the specific dynamics affecting global team performance, contributing to the theoretically motivated empirical studies on these topics.","title":"The Effects of Collaborative Skills and Culture in International Computer-Supported Collaborations","awardID":"9988605","effectiveDate":"2000-08-01","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5976","name":"AFRICA, NEAR EAST, & SO ASIA"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5978","name":"EAST ASIA AND PACIFIC PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["159102","350925","334005"],"PO":["564456"]},"50300":{"abstract":"0002295<br\/><br\/>This project is an attempt to provide a better understanding of <br\/>(a) processes determining the structure, distribution and scale <br\/>content of the oceanic mesoscale field and (b) the role of mesoscale <br\/>eddies in determining the large-scale structure of the ocean, looking <br\/>in turn at the structure of the thermocline, abyssal flows, and <br\/>structure of the mid-depth flows below the base of the thermocline. <br\/>The physical effects that will be considered are broad-ranging and <br\/>include, wind-forcing, mesoscale instabilities of large scale flows, <br\/>the response of the ocean to stochastic forcing, adiabatic advection <br\/>(ventilated thermocline dynamics), and eddy-topography interactions. <br\/>The approach will be a combination of theory and numerical simulations. <br\/>Much of the numerical simulation will be with stratified quasi-<br\/>geostrophic models although some will use a primitive equation model <br\/>(MOM4). The project will begin by looking at the life-cycles of <br\/>baroclinic eddies in a broad, baroclinically unstable, wind-driven <br\/>flow, studying their equilibration and the scaling of the vertical <br\/>structure of the equilibrated eddies. The effects of inhomogeneity <br\/>will be studied by stochastically forcing a quasigeostrophic model <br\/>linearized about a time-mean wind-driven gyre. The project will go <br\/>on to look at the role of the planetary and topographic vorticity <br\/>gradients in introducing anisotropies in the nonlinear cascade of <br\/>eddy energy in wavenumber space, leading to coherent and energetic <br\/>deep flows. Lastly the role of mesoscale eddies in establishing the <br\/>vertical structure of the thermocline will be examined using a <br\/>primitive equation model.","title":"Eddies and their Potential Role in the General Circulation","awardID":"0002295","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1610","name":"PHYSICAL OCEANOGRAPHY"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1266","name":"APPLIED MATHEMATICS"}}],"PIcoPI":["537412"],"PO":["563981"]},"52665":{"abstract":"The objective of this project is to investigate the design, implementation, and performance evaluation of a new architecture for storage area networks. The architecture under investigation, Distributed RAID and Locatin Independent Caching (DRALIC) will implement distributed RAID and global caching at the device level, using the embedded controllers in storage devices to perform complex functions. A preliminary study has shown that this architecture has significant performance and reliability advantages in web server applications. The present project includes detailed simulation studies and a proof-of-concept implementation on a network of general-purpose computers.","title":"Boosting Web Server Performance Using DRALIC----Distributed RAID and Location Independence Caching","awardID":"0073377","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["414327"],"PO":["325495"]},"52698":{"abstract":"ABSTRACT<br\/><br\/>Title: Research Into Code compression<br\/>PI: Trevor Mudge, University of Michigan<br\/><br\/>The research examines the problem of reducing the size of programs. This is termed \"code compression.\" The size of programs can adversely affect the performance of a computer in several ways, but until recently, code<br\/>compression has been targeted at low cost systems, where chip size and thus cost is at a premium. Reducing chip size suggests that the code compression techniques may also reduce power consumption, because the power consumed by a chip is related, among other things to its area. Furthermore, earlier studies by the Principal Investigator have shown that compression can improve the memory system efficiency and, as a result improve system performance. There are three directions being pursued in this research: 1) to explore the use of code compression to reduce chip size and cost; 2) to explore the use of code compression to reduce power; and 3) to explore the use of code compression to improve performance. The impact of this work is expected to be reduced chip size and power consumption for the same or better performance. The research leverages tools that were created by the Principal Investigator in prior code compression work.","title":"Research Into Code Compression","awardID":"0073497","effectiveDate":"2000-08-01","expirationDate":"2004-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["535404"],"PO":["180163"]},"53105":{"abstract":"EIA-0074869<br\/>Wilkins, Dawn E.<br\/>University of Mississippi<br\/><br\/>POWRE: Computational Methods to Support Molecular Biology Applications.<br\/><br\/>The purpose of this CISE\/EIA POWRE proposal is to allow the PI to conduct research and work with investigators at the Hartwell Center for Bioinformatics and Biotechnology at St. Jude Children's Research Hospital to develop data mining algorithms and software for use with microarray data. In addition, an introductory elective course on bioinformatics and computational biology for upper-division computer science majors at the University of Mississippi will be developed.","title":"POWRE: Computational Methods to Support Molecular Biology Applications","awardID":"0074869","effectiveDate":"2000-08-01","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":[135301],"PO":["564181"]},"48826":{"abstract":"Abstract:<br\/><br\/>With the advent of the World Wide Web, there has been a fundamental<br\/>shift in the way information is exchanged among systems connected to<br\/>the Internet. There has been significant research in developing<br\/>techniques for eliminating performance bottlenecks arising due to the<br\/>lack of sufficient CPU, disk, and network bandwidths. While this<br\/>research has led to greater understanding about building a Web<br\/>middleware, it is not clear how a Web middleware can provide services<br\/>that can be customized to suit the needs of end users.<br\/><br\/>This research project aims to investigate two key ideas - support for<br\/>differentiated level of services and extensibility of the Web<br\/>components - to make a Web middleware more responsive and adaptive.<br\/>The research will first develop components that can control and<br\/>regulate allocation of resources to different requests. The research<br\/>here encompasses development of a quality of service (QoS) model with<br\/>respect to services and resources provided by the components,<br\/>exploration of QoS architectures, extension of the QoS model over a<br\/>wide area network, and investigation of a QoS model for web<br\/>caching. The project will then develop components whose behavior<br\/>can be customized to suit user preferences, Web object characteristics<br\/>and operating conditions.","title":"Towards a Customizable Web Infrastructure","awardID":"9988349","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["284993"],"PO":["309350"]},"55008":{"abstract":"EIA-0083172<br\/>Hasler, Paul<br\/>Georgia Institute of Technology<br\/><br\/>ITR: High Density Analog Computing Arrays<br\/><br\/>This project is investigating an alternate model of real-time sensory signal processing based upon a mixture of analog and digital computation. The arrays under study perform analog computations directly in modified EEPROM memory cells; each cell acts as a multiplier that multiplies the input signal by an analog value stored on a floating gate. Potential advantages of analog computing arrays include lower latency than digital computers, lower power consumption, and parallel processing of many analog inputs. The project encompasses experimental demonstration of analog computing arrays, simulation and design tools to make the technology accessable to DSP designers, and investigation of the robustness and reliability of the technology. Several single-chip signal processing systems will be developed, including adaptive matched filters, a cepstrum calculater, systems for hidden Markov models, and a multi-directional filter array.","title":"ITR: High Density Analog Computing Arrays","awardID":"0083172","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["550108","558209"],"PO":["565223"]},"48507":{"abstract":"CCR-9987458<br\/>Abstract:<br\/><br\/>With the increasing demands of users for ever more complex features in<br\/>their systems, interfaces to these systems necessarily also become<br\/>complex. At some point, the interfaces approximate a programming<br\/>language, and the system can reasonably use a compiler to efficiently<br\/>handle the users' directions. We thus expect that compiler-writing<br\/>technology will increasingly be demanded of software engineering<br\/>professionals. Unfortunately, compilers are often large, mysterious<br\/>programs, and compiler-writing somewhat of a black art. <br\/><br\/>We are developing a new approach to the development and exposition of<br\/>compilers for mostly functional languages. Courses on compilers are<br\/>generally centered around an extensive project through which a<br\/>compiler is developed. Some attempt is often made to divide the<br\/>compiler into phases. Traditionally, however, the early phases merely<br\/>cover scanning and parsing and most of the real work is left as a<br\/>single task. This makes compiler courses either difficult, if<br\/>students are left to deal with this problem on their own, or<br\/>contrived, if they are given substantial amounts of help from their<br\/>instructor. The primary advantage of our approach is that students<br\/>can build a compiler in incremental stages and understand how each<br\/>stage contributes to the project. Thus, at any point in time, the<br\/>students are only concerned with a single aspect of the target<br\/>architecture. In this way, they gain an understanding of how the<br\/>source and target architectures relate to each other and no longer<br\/>view them as totally disparate worlds. An additional advantage of our<br\/>approach is that instructions at different levels can be interleaved,<br\/>so that transformations can be written and debugged for one language<br\/>form at a time. All of this will make compiler-writing far less<br\/>mysterious and make compiler courses accessible to many more students.<br\/><br\/>We are submitting this request under Small Grants for Exploratory<br\/>Research because we wish to pursue this research immediately. This<br\/>new approach, if further developed, could greatly affect Indiana<br\/>University's undergraduate compiler course this spring. We will also<br\/>make the results of our efforts available to the larger educational<br\/>community through submissions to education-oriented conferences and\/or<br\/>the publication of relevant texts.<br\/><br\/>Although our primary motivation at this point is educational, the<br\/>benefits of our approach are likely to range much further. They<br\/>should include the ability to reuse components in compilers with a<br\/>different source or target language, to the point where writing a<br\/>compiler involves plotting a course through a variety of intermediate<br\/>languages or programming styles or architectures. Then, a change to<br\/>any one architecture will have minimal impact on the family of<br\/>compilers. A second advantage is that optimizations can be added<br\/>individually, at the highest appropriate level. Finally, support for<br\/>the interleaving of instructions at different levels should make the<br\/>development of compilers much less expensive and error-prone. It<br\/>should also help to improve intuitions and understanding of <br\/>issues of just-in-time compililation that have become pressing with<br\/>the increased popularity of the Java programming language.","title":"SGER: Gradual Compilers","awardID":"9987458","effectiveDate":"2000-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["537808"],"PO":["209879"]},"56824":{"abstract":"This award supports international travel for fifteen U.S. graduate students who would not otherwise be able to attend the Second AgentLink European Agent Systems Summer School being held in Saarbrucken, Germany, from August 14-18, 2000. AgentLink, Europe's ESPRIT-funded Network of Excellence for agent-based computing, organizes the school (http:\/\/www.agentlink.org). It is a world-class event that will bring together internationally recognized researchers in the area of autonomous agents and multi-agent systems to present introductory and advanced courses in the theoretical and practical aspects of agent-based computing. The objective of this award is to encourage and enable U.S. graduate students of outstanding merit who are interested in research in agent systems but have no current funding to attend this event. This travel grant will cover their travel, hotel, registration fees, and some subsistence. The Europeans are giving similar support to their graduate students (i.e., those at European universities who are registered AgentLink members). This travel grant allows a strong and diverse group of US graduate students to attend EASSS 2000 rather than just a small group of elite researchers. Further, because the summer school is in Europe, it provides a unique opportunity for American researchers to have direct contact with their European colleagues.","title":"U.S. Graduate Student Travel to the Second AgentLink European Agent Systems Summer School (EASSS) 2000","awardID":"0089901","effectiveDate":"2000-08-01","expirationDate":"2001-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["351123"],"PO":["565227"]},"48805":{"abstract":"PROJECT SUMMARY<br\/>Proposal Number: NSF 9988304<br\/>Robust Algorithmic Building Blocks for Parallel Computing <br\/>PI: Alexander A. Shvartsman<br\/>This research investigates algorithmic approaches to robust building blocks for parallel computing. The research direction is based on the idea that parallel solutions to computational problems can be formulated as compositions of building blocks, components that encapsulate efficient and fault-tolerant parallel implementations of well-defined computation primitives. Building blocks come equipped with precise specifications of their compositionality, and in general provide services at a higher level of abstraction than the operations made available by common parallel programming languages. A major goal of this research is to provide provably efficient building blocks that help the designers of complex parallel applications to concentrate on algorithm design while freeing them from the need to perpetually consider the problem of efficient and effective mapping of the algorithms expressed in some notation to a specific target machine. Traditionally, research in the distributed computing field has concentrated on fault-tolerance, while parallel computing research has taken speed-up as its main focus. This research synthesizes these two foci, and together with the building block methodology, it yields an approach to computing with multiple processors that obtains scalable parallel speed-up, while providing correctness and compositionality guarantees, and enabling graceful degradation in the face of failures. By combining the research on robust parallel computing with the building blocks approach to constructing complex systems, this work intends to substantially advance the state-of-the-art in the theory of effective and efficient parallel computing. Towards this end this research program deals with robust (i.e., efficient and fault-tolerant) algorithms, lower bounds that define the limits for achieving our efficiency goals, composable building blocks that encapsulate key algorithms, and program simulations and transformations that allow to efficiently execute programs specified at a high level of abstraction on the available parallel platforms.","title":"Robust Algorithmic Building Blocks for Parallel Computing","awardID":"9988304","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["451177"],"PO":["543507"]},"48816":{"abstract":"This project explores practical architectures, circuits, and tool support for asynchronous digital systems. In particular, it seeks to fill a design niche that requires both high-performance in a specific problem domain and some flexibility in how the computation proceeds. One focus is on an asynchronous microprogrammed control style called a microengine. In addition to the flexibility that comes from a microcoded execution style, the asynchronous microengine approach embodies many advantages related directly to the asynchronous execution model of the controller, and of the circuits that it controls. This project explores the classes of design problems that can benefit from asynchronous microengines, explores the use of specialized circuit structures to enhance performance, and constructs a tool for the automated synthesis of microengines within the ACK high-level synthesis framework.","title":"Microengines for Programmable Self-timed Control","awardID":"9988329","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["561775","451272"],"PO":["562984"]},"48827":{"abstract":"\"Efficient Algorithms for Molecular Sequences, Evolutionary<br\/> Trees, and Physical Maps\"<br\/><br\/>PI: Tao Jiang<br\/>Proposal Number: 9988353<br\/>Institution: University of California-Riverside<br\/><br\/><br\/><br\/>Project Summary<br\/>---------------<br\/><br\/>Biological, biomedical and pharmaceutical research is undergoing a major<br\/>revolution as new experimental approaches, such as high-throughput DNA<br\/>sequencing, are yielding unprecedented amounts of genetic data.<br\/>The exploration of this information is critically dependent upon the <br\/>development of advanced computational methods for data analysis.<br\/>From this dependency, a new interdisciplinary research field, <br\/>{\\em Computational Molecular Biology}, has emerged in recent years. This<br\/>project aims at investigating some fundamental algorithmic issues<br\/>in several key areas of computational molecular biology,<br\/>including multiple sequence alignment, the reconstruction of<br\/>evolutionary trees, physical mapping, and DNA sequencing.<br\/><br\/>Multiple sequence alignment is a standard model for comparing a set of<br\/>(biomolecular) sequences simultaneously. Software tools for computing multiple<br\/>sequence alignments are routinely used by biologists.<br\/>This project continues the study of a unique approach for multiple sequence alignment<br\/>that takes into account the evolutionary history of the input sequences.<br\/>The objectives include improved approximation methods to compute multiple<br\/>sequence alignment and evolutionary tree simultaneously. <br\/><br\/>Efficient and accurate inference of evolutionary trees has long been a<br\/>challenging topic for both biologists and computer scientists. <br\/>This project is especially focused on quartet-based evolutionary tree reconstruction<br\/>methods that attempt to extract topological information about quartets<br\/>(i.e. sets of four) of input species and then recombine these quartet topologies<br\/>into a full evolutionary tree. Efficient approximation algorithms will be <br\/>devised that explicitly aim at minimizing the inconsistency between the output tree<br\/>and the estimated quartet topologies. <br\/><br\/>The other objectives of the project include the study of efficient (approximation)<br\/>algorithms for some combinatorial problems that are motivated by physical mapping and<br\/>(shotgun) DNA sequencing, which are two fundamental steps in the Human Genome Project. <br\/>Some specific topics to be studied include the complexity of fragment identification<br\/>in multiple complete digest mapping with bounded multiplicity and the approximation<br\/>of (vairants of) shortest superstrings.<br\/><br\/>Although this research is theoretical in nature, its results will <br\/>likely have applications (or implications) in the development of software tools<br\/>for multiple sequence alignment, phylogenetic inference, and restriction mapping.","title":"Efficient Algorithms for Molecular Sequences, Evolutionary Trees, and Physical Maps","awardID":"9988353","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["538402"],"PO":["543507"]},"48838":{"abstract":"One of the most promising approaches to making video-on-demand services more competitive is to continuously broadcast the most frequently requested videos. This research addresses three important limitations that are common to most existing broadcasting protocols for video-on-demand.<br\/><br\/>A first research direction is the development of broadcasting protocols that can handle compressed videos having variable bandwidth requirements. The performance on these new protocols will be evaluated using a representative set of videos in the MPEG-2 format used by DVD.<br\/><br\/>A second research direction is the efficient implementation of interactive functions analogous to those existing on a VCR. These functions will allow customers to pause, move backward, and move forward as if they were watching a videocassette.<br\/><br\/>A third research direction is the design of broadcasting protocols that can adjust their broadcasting schedules to all observed changes in the request arrival rate. As a result, these dynamic broadcasting protocols will perform equally well at peak hours and at hours of lower demand.<br\/><br\/>All of these broadcasting protocols will be demonstrated on a very simple testbed consisting of a single workstation broadcasting a few specific videos.<br\/><br\/>This is a collaborative research project between the University of California, Santa Cruz and the University of Houston.","title":"Collaborative Research: An experimental study of broadcasting protocols for video-on-demand","awardID":"9988390","effectiveDate":"2000-08-15","expirationDate":"2005-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[125010],"PO":["309350"]},"50423":{"abstract":"Network systems provide the infrastructure and foundation for the functioning of today's societies and economies. They come in many forms and include physical networks such as transportation, communication, and power networks, as well as more abstract networks such as a variety of economic and financial networks and social and knowledge networks. Such network systems are characterized by decentralized decision-making, a large-scale nature, different time scales, and distinct system equilibrium concepts. This project studies complex network systems, consisting of the foundational systems of transportation and communication networks whose interplay is becoming increasingly important in the case of telecommuting, intelligent transportation systems, electronic commerce, and knowledge networks. The project aims to: develop a theory of such complex network systems, which emphasizes the individual behavior of the decision-makers and allows for the treatment of multiple criteria; construct algorithms for the solution of such systems, along with convergence analysis and computer implementation and numerical experimentation; develop visualization techniques to understand and depict the behavior, and apply the theory to complex knowledge networks; and conduct an empirical analysis. The results of the research are expected to have broad cross-disciplinary reach and to significantly add to the understanding of fundamental networks systems underlying our societies and economies for the purpose of both prediction <br\/>and network management purposes.","title":"Decentralized Decision-Making in Complex Network Systems","awardID":"0002647","effectiveDate":"2000-08-01","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V050","name":"NSA-WORLD RENOWNED EXPERTS FRO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V463","name":"NSA-MEIDS PROJECT"}}],"PIcoPI":[128803,"483545",128805],"PO":["565136"]},"52557":{"abstract":"The inverse problem of matrix construction arises in many<br\/>areas of important applications. Matrices under construction<br\/>are supposed to satisfy certain specific constraints. The<br\/>constraints could be inherited intrinsically from the physical<br\/>feasibility of a certain mechanical structure or could be<br\/>driven extrinsically by the desirable property of a certain<br\/>design parameter. This proposal intends to extend the<br\/>investigation that the PI has been conducting in the past<br\/>years with emphasis on the the development of numerical<br\/>algorithms for application to challenging inverse problems.<br\/>Four specific inverse problems of matrix construction will<br\/>be studied via three possible numerical approaches. Techniques<br\/>to be used involves computer experiments, high resolution<br\/>graphics and symbolic manipulation, in conjunction with<br\/>mathematical analysis. This project is expected to find<br\/>important applications ranging from new development of<br\/>numerical algorithms to theoretic solution of difficult<br\/>problems. Since matrix reconstruction with specified<br\/>properties arises from a remarkably wide area of disciplines,<br\/>the resulting technology would have substantial impact on the<br\/>progress in scientific and engineering fields.<br\/><br\/>In the era of information and digital technologies,<br\/>massive data processing becomes an imperative task<br\/>at almost every level of applications. In many situations<br\/>the digitized information is gathered and stored as a data<br\/>matrix. Nonetheless, because most of the information<br\/>gathering devices or methods have only finite bandwidth, one<br\/>cannot avoid the fact that the data collected often are not<br\/>exact. Signals received by antenna arrays often are<br\/>contaminated by instrumental noises; astronomical images<br\/>acquired by telescopes often are blurred by atmospheric<br\/>turbulence; and even empirical data obtained in laboratories<br\/>often do not satisfy intrinsic physical constraints. Before<br\/>any forward analysis technique can be applied, it is important<br\/>to first reconstruct the data matrices so that the inexactness<br\/>is reduced while certain feasibility conditions are satisfied.<br\/>The general objective of this proposal is to develop numerical<br\/>algorithms to carry out this kind of data reconstruction task.<br\/>The work in this proposal concerns the mathematical theory and<br\/>the numerical implementation of three algorithms for four<br\/>specific inverse construction problems. This investigation<br\/>could lead to improved techniques for use in several national<br\/>strategic areas, including ground-based astro-imaging<br\/>processing, medicine, communications, and laser technology.","title":"Algorithms for the Inverse Problem of Matrix Construction","awardID":"0073056","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["549174"],"PO":["565027"]},"53118":{"abstract":"EIA-0074919<br\/>Dickerson, Julie A.<br\/>Iowa State University<br\/><br\/>POWRE: Adaptive Fuzzy Intrusion Detection using Cooperative Agents<br\/><br\/><br\/>This POWRE proposal explores an interdisciplinary area of research in network security. The project proposes a novel method that uses distributed fuzzy agents to recognize intrusions in networked systems. Intrusions can be detected by noting anomalies in the use of a system and misuse of computing resources or data. As part of this research, the following issues will be addressed: (1) the development of distributed fuzzy agents to collect and assess data on a switched network, (2) new methods of encoding complex causal sequences and intrusions, and (3) novel mechanisms for finding new attack profiles and methods to stop false alarms using neural fuzzy learning methods.","title":"POWRE: Adaptive Fuzzy Intrusion Detection using Cooperative Agents","awardID":"0074919","effectiveDate":"2000-08-15","expirationDate":"2003-01-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["496031"],"PO":["289456"]},"48817":{"abstract":"As CMOS technology advances into the 80 nanometer generation and beyond, the manufacturing process is having an increasingly constraining effect on physical layout design and verification. To maximize yield, process engineers must achieve predictability and uniformity of manufactured device and interconnect attributes. This project investigates newly critical issues in the interface between layout design and manufacturability, such as layout modification for reduced variability of chemical-mechanical polishing, design which is amenable to optical lithography using phase-shifting masks and optical proximity correction, and other problems. This project is developing robust testbeds, algorithms and tools to address these important problems, and is interacting with industry partners to tailor the proposed approaches to address real objectives on actual test cases and production runs.","title":"Research in Layout Optimization for Advanced Manufacturability Considerations","awardID":"9988331","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["486396"],"PO":["562984"]},"48509":{"abstract":"CCR-9987466<br\/>Teodor Rus<br\/>University of Iowa<br\/><br\/>AMAST Anniversary Meeting, May 23-27, 2000 in Iowa City, Iowa<br\/><br\/>ABSTRACT:<br\/><br\/>The 10th anniversary meeting of AMAST is in Iowa City from May 23 to 27, 2000, bringing together researchers who previously agreed to cooperate to create the mathematical framework for the development of software technology. The AMAST goal is the creation of a mathematical methodology for the development of software technology. It is unique among organizations pursuing computing research by the vision of the field it can offer and by the balance it can provide to trends in the field. The meeting celebrates past achievements, looks at current trends in using formal methods for software development, and adapts AMAST goals to the new problems raised by current developments. This project would provide partial support for members of the steering committee, invited speakers, and student attendees.","title":"AMAST Anniversary Meeting in Iowa City, Iowa","awardID":"9987466","effectiveDate":"2000-08-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[124112],"PO":["150697"]},"54703":{"abstract":"EIA-0081437<br\/>Eckstein, James<br\/>University of Illinois<br\/><br\/>ITR: Toward Agile Information Networks: Electro-Optic Frequency Shifter<br\/><br\/>A new type of optical frequency translator, under study and development in this project, can provide very rapid optical routing capability. The device, known as an Electro-Optic Frequency Shifter (EOFS) provides an all optical way to rapidly shift a bitstream from one optical channel to another in a high-bandwidth wavelength division multiplexed network. The EOFS uses a traveling wave electro-optic interaction between a microwave control signal and the optical bit stream. The microwave signal co-propagates with the optical bit stream through a LNO waveguide, and shifts frequency of the optical pulses via the linear electro-optic effect.<br\/><br\/>Tuning in this device is accomplished by changing the microwave power level, keeping the microwave frequency fixed. All of the light is shifted in frequency, so there is no need to filter unshifted light. A single-stage device should have a tuning range of over 2 THz, which would encompass many optical data channels. Since there is no second optical source needed, there is no settling\/control time required for tuning a second optical frequency; the device can change frequency shifting as quickly as the amplitude of the microwave signal can be changed, which should be on the order of the inter-pulse time spacing.","title":"ITR: Toward Agile Information Networks: Electro-Optic Frequency Shifter","awardID":"0081437","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["480627"],"PO":["565223"]},"51348":{"abstract":"","title":"CAREER: Plenoptic Scene Reconstruction","awardID":"0049095","effectiveDate":"2000-08-15","expirationDate":"2005-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["533242"],"PO":["317663"]},"54329":{"abstract":"This SGER is a preliminary grant to begin testing a hypothesis concerning using the web for learning guided by the use of Multi-User Virtual Environments as a place for competitive and collaborative learning games. The hypothesis that this award is testing is that by tracking user performance, managing the set of available playmates for every student, and introducing virtual agent players at a variety of school levels, such a community of evolving learners can keep all participants appropriately challenged and motivated to learn. To test this hypothesis, appropriate games and learning outcomes will be defined and the software protocols written to do playmate matching agent choice, and collection of data or student learning. The students tested will be in fourth and fifth grade classrooms and work with games to improve learning of mathematics and elementary physics.","title":"SGER: Communities of Evolving Learners","awardID":"0079972","effectiveDate":"2000-08-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"1666","name":"RESEARCH ON LEARNING & EDUCATI"}}],"PIcoPI":["362937"],"PO":["560894"]},"47817":{"abstract":"The World-Wide Web has become a prime vehicle for disseminating information. As a result, the number of large Web sites with complex structure and that serve information derived from multiple data sources is increasing. Building a web site involves the tasks of selecting the data that will be displayed at the site, designing the site's structure, and designing the visual presentation of pages. In existing Web-site management tools, these three tasks are, for the most part, interdependent, and as a result, many maintenance tasks become tedious to perform. The goal of this research project is to develop tools for flexible construction, maintenance and management of web sites. Two specific problems are being studied in detail. The first is the development of policies for efficient run-time management of Web sites. As a part of designing such policies, novel methods for selecting which views over the underlying data can be materialized in order to speed up the performance of the site. In addition, methods are being developed for the automatic restructuring of web sites in response to user browsing patterns. The second problem under consideration is the development of an architecture in which several web-site management tools can interoperate. The goal of such an architecture is to be able to support the larger scope of tasks involved in the lifecycle of a web site, which undoubtedly will require a multitude of tools. This research program is closely coordinated with the development of a database curriculum at the University of Washington, and is carried out in collaboration with industry that is likely to lead to technology transfer with a broad impact. <br\/>http:\/\/data.cs.washington.edu\/","title":"PECASE: Flexible Construction and Management of Web Sites","awardID":"9985114","effectiveDate":"2000-08-15","expirationDate":"2006-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["278933"],"PO":["469867"]},"48818":{"abstract":"On-chip inductance becomes an important design issue at transistor geometries of 0.25 mm and below. The primary goal of this project is to generate computer aided design tools and on-chip measurement techniques that will enable IC designers to cope with inductance related issues without the need for highly specialized knowledge or experimentation. The project has three thrusts. In thrust one, modeling and model reduction techniques will be developed that enable complex on-chip structures to be modeled and reduced so that they will be tractable for simulation. The techniques are based on rule-based extensions to PEEC and wavelet-based extraction. Thrust two is concerned with establishing an automated methodology to generate layout and performance margin guidance for use by designers. At the center of this effort is the identification of a set of generalized parameterized interconnect topologies that capture most of the important issues related to inductance control. Thrust three is concerned with measurement verification of the results of the other two thrusts and the determination of new automated in-situ measurement techniques.","title":"Inductance Control for On-Chip Signal Integrity","awardID":"9988334","effectiveDate":"2000-08-01","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["243970","475429"],"PO":["562984"]},"50964":{"abstract":"This action provides funds to be transferred from the National Science Foundation (NSF) to the National Imagery and Mapping Agency (NIMA). These funds will be used by NIMA to help support a project on Spatio-Temportal Panning and Zooming that has been selected through a NIMA-administered competitive evaluation process as part of the NIMA University Research Initiative (NURI) program. The project will be conducted by Kathleen Hornsby and colleagues at the University of Maine.<br\/><br\/>Spatio-temporal knowledge representation often requires changing from one level of detail to another so that users can carry out a desired task. Although abstraction, or the opposite task of shifting to more detailed views, are routinely and intuitively carried out by humans, formalizing these shifts for integration into information system query languages offers many challenges. Current geographic information systems (GIS), for example, allow for zooms based on geometric properties only. Similarly, GIS users can change only their perspective of data by panning. This project goes beyond graphic zooming or panning by considering another important perspective - time. This project will develop a formal model to support changes in levels of temporal detail. Using the identity-based approach, a set of temporal pan and zoom operators will be introduced. These operators will be embedded into a spatial query language and ultimately integrated with the spatial pan and zoom operators to become a set of spatio-temporal operations. The project will also examine the utility and mathematical properties of using lattices as an underlying structure for organizing views of objects at different levels of temporal detail. <br\/><br\/>Temporal panning and zooming result in either simpler views that are easier to understand or more detailed views that uncover information that is otherwise unknown. The research will advance the theory on temporal abstractions, which is important for users of very large geospatial databases. The findings will be of particular relevance to information management of massive databases, and will be applicable to a variety of phenomena that involves time such as meteorological occurrences and population movements.","title":"Interagency Agreement to Support The National Imagery and Mapping Agency University Research Initiatives - NURI Activities","awardID":"0003930","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1352","name":"GEOGRAPHY AND SPATIAL SCIENCES"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"5209","name":"ENVIR SOCIAL & BEHAVIOR SCIENC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0603","name":"Division of EARTH SCIENCES","abbr":"EAR"},"pgm":{"id":"1580","name":"INSTRUMENTATION & FACILITIES"}}],"PIcoPI":[130137],"PO":["251646"]},"54924":{"abstract":"EIA-0082913<br\/>Cote, Robin<br\/>University of Connecticut<br\/><br\/>ITR: Quantum Information Processing with Ultracold Rydberg Atoms<br\/><br\/><br\/>Ultracold Rydberg atoms have long lifetimes and interact strongly at large distances, which may make them ideal for quantum information processing. This project is investigating this possibility by studying and experimentally implementing a universal two-qubit logic gate, in which a two-atom state acquires a phase that depends on the time the atoms are interacting. The project is investigating sparsely populated optical lattices containing Rydberg atoms, which will permit the preparation of well-identified atoms in arbitrary states. The properties of atom-atom interactions, including the effect of external electric and magnetic fields will be investigated. Finally, methods of reading the information stored in Rydberg atoms will be investigated, including imaged fluorescence and selective ionization. Scaling to large numbers of qubits, as well as the effects of the optical lattice on decoherence, will be explored.","title":"ITR: Quantum Information Processing with Ultracold Rydberg Atoms","awardID":"0082913","effectiveDate":"2000-08-15","expirationDate":"2005-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["513223","513225","477856"],"PO":["565223"]},"52669":{"abstract":"This research involves coded modulation, the combination of a convolutional code and a higher order digital modulation. The typical application is for a wireless communications system operating over fading channels. The design typically trades off performance versus complexity. More complex systems are larger in size and consume more power. High performance means high spectral efficiency (in bits per second per Hz), low error rate (probability of bit error) at minimum transmitted power. Modern systems basically achieve this with sophisticated receivers; decoders that are now feasible due to the advances in microelectronics. In this research, the goal is to improve the performance of bit interleaved coded modulation (BICM) by incorporating iterative decoding (BICM-ID). Systems using BICM-ID achieve high performance but are less complex than those incorporating turbo codes.<br\/><br\/>More specifically, the investigator studies fundamental advances both the design and the performance evaluation of BICM-ID systems. This is done is several ways. The research optimize the codes, signal labels, bit interleaver in the encoder. Iterative decoding is improved by better matching with the specific channel type, and quality of the channel state information (CSI). Performance evaluation will be based on a more fundamental understanding of the error-free feedback bound for iterative decoding. The performance for channels with imperfect CSI and more general fading statistics is studied. Diversity will be improved in several ways: through explicit use of multiple channels and through constellation rotation. In all of these situations, design optimization and performance evaluation is investigated.","title":"Iteratively Decoded Bit Interleaved Coded Modulation: A Robust Reduced Complexity Design For Fading Channels","awardID":"0073391","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":[134296],"PO":["223414"]},"54418":{"abstract":"EIA- 0080234<br\/>Saks, Michael<br\/>Rutgers University<br\/><br\/>Title: ITR: Project on Strengths and Limitations of Quantum Information Processing<br\/><br\/>This project provides an opportunity for an outstanding postdoctoral researcher to become involved in collaborative research in quantum computing with university and industry scientists. The project is investigating the use of quantum information theory in establishing time and communication bounds on quantum communication and computing. The project is also investigating space complexity, comparing quantum computers with restricted workspace to classical machines. Finally, taking advantage of the observation that all quantum algorithms that currently provide a time advantage may be viewed as black-box algorithms, the project is investigating use the \"polynomial method\" in proving lower bounds in the quantum black-box setting.","title":"ITR: Project on Strengths and Limitations of Quantum Information Processing","awardID":"0080234","effectiveDate":"2000-08-15","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["518427"],"PO":["565223"]},"50965":{"abstract":"This one-day workshop will be held currently with the 2000 ASME Design Engineering Technical Conference. The goal of this workshop is to bring relevant academic, industry, and government experts together, especially including those outside of the ASME community, to discuss research challenges and establish research goals in the general area of human assist devices and automation. The focus will be on task-oriented integration of simple mechanisms, controls and intelligence to provide customized flexibility at an affordable cost. The potential task scopes range from aiding people with disability, microsurgery, health care, industrial automation, material handling, manufacturing, construction, combat, tele-operation, to satellite deployment. Findings of the workshop will comprise the substance of a public report to the NSF, which is also made available on the web for appropriate wider dissemination.","title":"Next Generation Human-Assist Devices and Automation","awardID":"0003932","effectiveDate":"2000-08-15","expirationDate":"2000-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6846","name":"UNIVERSAL ACCESS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0706","name":"Division of DESIGN & MANUFACTURING INNOV","abbr":"DMI"},"pgm":{"id":"1463","name":"INTEGRATION ENGINEERING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"5345","name":"BIOMEDICAL ENGINEERING"}}],"PIcoPI":["257988"],"PO":["475621"]},"52901":{"abstract":"Despite very strong economic incentives to approach the information theoretic limits of wireless channels, the state-of-the-art (typified by second generation cellular wireless)remains far from an efficient utilization of spectrum and power resources. Wireless channels are known to be particularly challenging from the standpoint of analysis of fundamental limits. Fading, multiuser interference, and the space-distributed nature of wireless pose considerable difficulties. Relevant simple canonical models and the<br\/>appreciation of the right mathematical tools are only emerging recently. The focus of this work is the investigation and application of a rich body of mathematical results that play a pivotal role in the analysis of wireless communication channels of contemporary interest. Random matrices are ubiquitous in the study of wireless systems. For example, fading makes channel coefficients random and time-varying, spreading waveforms in nonorthogonal code-division multiple access systems are accurately modeled as being randomly selected, multiantenna transmitters\/receivers in scattering environments give rise to channels described by random matrices.<br\/><br\/>Both coded (Shannon capacity) and uncoded (bit-error-rate) performance turn out to be determined (in most cases) by the eigenvalues of certain random matrices. Frequently, those matrices are quite large as their dimensions grow linearly with parameters such as the number of users and signaling degrees of freedom.<br\/>Many information theoretic problems for which numerical simulation is the only alternative<br\/>with finite size matrices find elegant deterministic solutions in the infinite-size limit.<br\/>This project is a systematic study of the spectrum of random matrices arising in single- and multiuser communication and information theory. Its results should influence the choice of both multiaccess techniques <br\/>and receiver designs, as well as guide the development of asymptotic random matrix theory with<br\/>technologically relevant problems.","title":"Random Matrices in Wireless Communication","awardID":"0074277","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["550344"],"PO":["223414"]},"51647":{"abstract":"Researchers know very little about the tasks engineers perform, the ways in which they employ technology, how their knowledge and tasks are embodied in technology, and what skills are likely to be required in the years ahead. In this project, the role of technology in the work of modern engineers will be assessed. Using ethnographic techniques of observation and interviewing, two types of engineers will be studied: structural engineers who design buildings and electrical engineers who design computer chips. In the course of this research, what engineers do, what technologies they employ, the extent to which, and the manner in which, these technologies embody, augment, and alter engineering knowledge and tasks will be investigated. This study augments current knowledge about engineering work and will have significant implications for organizations as they consider how to manage and support their engineering workforce. In addition, the answers to these research questions will inform the education and training of engineers, as well as their broader study in the social sciences. Our results will lend insight into the design of engineering workspaces, tools, and supporting technologies. More generally, they will further add to our understanding of how technologies are employed in the workplace.","title":"Assessing the Role of Technology in the Work of Modern Engineers","awardID":"0070468","effectiveDate":"2000-08-01","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["555560","518944","213464","483518"],"PO":["495796"]},"51317":{"abstract":"","title":"Submicron Wave-Pipelined VLSI Architecture of a Reconfigurable Router","awardID":"0049064","effectiveDate":"2000-08-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["326169"],"PO":["197478"]},"51328":{"abstract":"","title":"CAREER: Dialogue Context in Graphical User Interfaces: Representation, Portability and Uses","awardID":"0049075","effectiveDate":"2000-08-10","expirationDate":"2004-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["531150"],"PO":["565227"]},"51339":{"abstract":"","title":"CAREER: Application-Driven Approach for Building Run-Time Systems for Future Teraflop and Petaflop Architectures","awardID":"0049086","effectiveDate":"2000-08-01","expirationDate":"2004-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["561580"],"PO":["551992"]},"46928":{"abstract":"BIOCOMPLEXITY: Collaborative Research: Biocomplexity of aquatic microbial systems -- relating diversity of microorganisms to ecosystem function<br\/><br\/>Microbial biogeochemical cycling of the elements regulates a dynamic environment in which the cycles of different elements are linked through the physiology of microorganisms. While a certain degree of understanding can be gained through physical\/chemical approaches to measurement and modeling of the net transformations, these approaches necessarily rely on gross simplifications about the role and regulation of the various functional groups (guilds) involved. Recent advances in molecular microbial ecology have shown the microbial world to contain immense diversity and complexity at every level: redundancy and duplication of functional genes within a single organism; molecular diversity among functional genes that encode the same process in different organisms; large genetic diversity among different organisms apparently engaged in the same biogeochemical function within single communities; great variability in the species composition of different communities that apparently perform equally well. The goal of this project is to investigate the functional relationship between complexity in microbial communities and the physical\/chemical environment at a range of biological and ecological scales. Previously, such analysis was technologically limited by the inability to assay large numbers of samples simultaneously for a large number of genes and phylotypes. Using gene array technology, the researchers will be able to detect the distribution and differential expression of functional genes in natural systems. The results of this study will constitute the first step towards application of DNA chip technology for gene expression of \"exotic\" (i.e., not of biomedical importance) processes and organisms in the environment. The gene arrays, along with a full suite of ecosystem process measurements, will be deployed along a transect that spans the eutrophic - oligotrophic gradient from the inland waters of the Chesapeake Bay out to the Sargasso Sea. Experiments and functional gene studies will focus on key transformations in the carbon and nitrogen cycles (C fixation, N fixation, nitrification, denitrification, urea assimilation). The diversity of guilds will be interpreted in terms of ecosystem function, assessed using geochemical data and tracer experiments. In addition to field studies designed to investigate and dissect the natural system, the group of collaborating scientists will also perform perturbation experiments using mesocosms. The goal of these experiments is to determine how microbial species diversity affects the major energy and nutrient flows within ecosystems, and to assess the degree of stability or instability associated with changes in redundancy within guilds of microorganisms responsible for major nitrogen and carbon pathways.","title":"Collaborative Research: Biocomplexity of Aquatic Microbial Systems: Relating Diversity of Microorganisms to Ecosystem Function","awardID":"9981482","effectiveDate":"2000-08-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1705","name":"BIOLOGY & INFORMATION TECHNOLO"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1181","name":"ECOSYSTEM STUDIES"}}],"PIcoPI":["495569",120129],"PO":["354885"]},"52902":{"abstract":"We will develop new algorithms, mathematical foundations, and a new<br\/>programming methodology for the fast parallel solution of elliptic<br\/>problems with aspects that are crucial in practice but present serious<br\/>difficulties to existing methods. We will investigate new robust iterative<br\/>substructuring methods that perform well even in the presence of interface<br\/>roughness on element scale. The performance of existing methods<br\/>deteriorates in this case, but smooth decompositions are typically not<br\/>available in practice. We also propose to investigate fast methods for the<br\/>discretization and iterative solution of high frequency wave propagation<br\/>and scattering problems by representing the solution locally as a<br\/>combination of waves on a coarse mesh and exploiting connections with the<br\/>fast multipole method. Finally, we propose to develop new programming<br\/>approaches and prototype tools for latency tolerant implementation on<br\/>parallel machines, transforming a high level program with new directives<br\/>into multiple independent tasks queued on processors.<br\/><br\/>The project will advance the state of the art in modeling complicated<br\/>problems in Mechanical Engineering with irregular geometries on<br\/>high-performance computers with high accuracy and efficiency, improve the<br\/>technology underlying radar, sonar, and ultrasound imaging, and create a<br\/>new highly efficient methodology and prototype tools for High-Performance<br\/>Computing. Potential applications include computational analysis and<br\/>modeling of automobiles and aircrafts and accurate high resolution<br\/>ultrasound imaging. It is expected that the new methodology for<br\/>High-Performance Computing will be important for futuristic technologies,<br\/>where the speed of light is the limiting factor of communication between<br\/>the processors, as well as for more immediate distributed computing on<br\/>networks of computers.","title":"Scalable Submesh Computing","awardID":"0074278","effectiveDate":"2000-08-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["517181"],"PO":["565027"]},"46918":{"abstract":"BIOCOMPLEXITY: Collaborative Research: Biocomplexity of aquatic microbial systems -- relating diversity of microorganisms to ecosystem function<br\/><br\/>Microbial biogeochemical cycling of the elements regulates a dynamic environment in which the cycles of different elements are linked through the physiology of microorganisms. While a certain degree of understanding can be gained through physical\/chemical approaches to measurement and modeling of the net transformations, these approaches necessarily rely on gross simplifications about the role and regulation of the various functional groups (guilds) involved. Recent advances in molecular microbial ecology have shown the microbial world to contain immense diversity and complexity at every level: redundancy and duplication of functional genes within a single organism; molecular diversity among functional genes that encode the same process in different organisms; large genetic diversity among different organisms apparently engaged in the same biogeochemical function within single communities; great variability in the species composition of different communities that apparently perform equally well. The goal of this project is to investigate the functional relationship between complexity in microbial communities and the physical\/chemical environment at a range of biological and ecological scales. Previously, such analysis was technologically limited by the inability to assay large numbers of samples simultaneously for a large number of genes and phylotypes. Using gene array technology, the researchers will be able to detect the distribution and differential expression of functional genes in natural systems. The results of this study will constitute the first step towards application of DNA chip technology for gene expression of \"exotic\" (i.e., not of biomedical importance) processes and organisms in the environment. The gene arrays, along with a full suite of ecosystem process measurements, will be deployed along a transect that spans the eutrophic - oligotrophic gradient from the inland waters of the Chesapeake Bay out to the Sargasso Sea. Experiments and functional gene studies will focus on key transformations in the carbon and nitrogen cycles (C fixation, N fixation, nitrification, denitrification, urea assimilation). The diversity of guilds will be interpreted in terms of ecosystem function, assessed using geochemical data and tracer experiments. In addition to field studies designed to investigate and dissect the natural system, the group of collaborating scientists will also perform perturbation experiments using mesocosms. The goal of these experiments is to determine how microbial species diversity affects the major energy and nutrient flows within ecosystems, and to assess the degree of stability or instability associated with changes in redundancy within guilds of microorganisms responsible for major nitrogen and carbon pathways.","title":"Collaborative Research: Biocomplexity of Aquatic Microbial Systems: Relating Diversity of Microorganisms to Ecosystem Function","awardID":"9981424","effectiveDate":"2000-08-15","expirationDate":"2007-07-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1253","name":"OFFICE OF MULTIDISCIPLINARY AC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1629","name":"BE: NON-ANNOUNCEMENT RESEARCH"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0604","name":"Division of OCEAN SCIENCES","abbr":"OCE"},"pgm":{"id":"1650","name":"BIOLOGICAL OCEANOGRAPHY"}}],"PIcoPI":["418686"],"PO":["354885"]},"50659":{"abstract":"Abstract <br\/><br\/>0003231<br\/><br\/>Subramaniam, Shankar<br\/><br\/>University of California, San Diego<br\/><br\/>Biology Workbench; A web-based infrastructure for databases, tools and interfaces in Biology.<br\/><br\/>Project Abstract<br\/><br\/>This award focuses on the maintenance and enhancement of the Biology Workbench; an integrated set of tools for sequence analysis, originally created as part of the NPACI\/NCSA project and recently relocated to UCSD. The project will add additional public domain tools and continue to serve a wide base of molecular biology researchers and educators as a single, integrated data retrieval and analysis resource.","title":"Biology Workbench: A web-based infrastructure for databases, tools and interfaces in biology","awardID":"0003231","effectiveDate":"2000-08-15","expirationDate":"2003-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1165","name":"ADVANCES IN BIO INFORMATICS"}}],"PIcoPI":["556513"],"PO":["292812"]},"80557":{"abstract":"","title":"Multimodal Interaction with Biological Molecules in Virtual Environments","awardID":"0296148","effectiveDate":"2000-08-22","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}}],"PIcoPI":["553768","543581","519685"],"PO":["562362"]}}