{"161590":{"abstract":"Magnetic microrobots that navigate the natural pathways of the body have the potential to revolutionize minimally invasive medicine and biomedical research. Current magnetic manipulation systems utilize massive magnets to produce a uniform magnetic field over a relatively small area. Uniform magnetic fields are used to simplify control, but this simplified control comes at a huge cost, and it is difficult to scale up most laboratory field-generation systems to the size required for clinical use. The use of nonuniform magnetic fields makes it possible to place magnets nearer to the patient, which permits the use of smaller, less-expensive magnets, while simultaneously improving actuatable degrees of freedom and force levels that systems can render. The hypothesis being tested is that using nonuniform magnetic fields to wirelessly control medical microrobots results in superior systems?in terms of size, cost, and performance?compared to using uniform fields. This research consists of two thrusts: control of magnetically tipped continuum microrobots, which provide distal dexterity in hard-to-reach locations, and control of fully untethered magnetic helical microrobots, which swim and crawl through fluids, lumens, and soft tissue using a method inspired by bacterial flagella. Understanding how to use nonuniform magnetic fields for wireless control may be the key to translating nearly every previously developed method for microrobot propulsion into clinical practice. Magnetic microrobots may be the ideal platform from which to deploy the numerous BioMEMS devices and magnetic sensors and actuators that have been designed in recent years.","title":"CAREER: Nonuniform-Magnetic-Field Control of Medical Microrobots","awardID":"0952718","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["513355"],"PO":["564069"]},"172030":{"abstract":"The NSF-sponsored workshop on 'Future Directions of Computer System Research in 2010' is to be held in the Waterview Conference Center, Arlington, VA over the two days of March 25-26, 2010. <br\/><br\/>The outcome of this workshop is a report that outlines new research directions in the general area of Computer Systems. This report will become available on the web within two weeks after the conclusion of the workshop, and will be used later as an inspiration in writing the new solicitation of the CSR program.","title":"NSF Workshop on Future Directions of Computer System Research in 2010","awardID":"1036243","effectiveDate":"2010-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["530391"],"PO":["535244"]},"165892":{"abstract":"The aims of this renewal REU project are to improve the understanding and processing of imaging data and to develop of computer- based solutions to current imaging and vision problems. Student research projects will include: spectral data processing, perceptual, ubiquitous, and mobile user interfaces, content based media retrieval, multi- approach integration of image processing, and inverse problems using scattering theories. While designed for undergraduate research, the projects are relevant to current problems in the imaging field and thus seek to contribute to its advancement in a real way.<br\/><br\/>This site is supported by the Department of Defense in partnership with the NSF REU program.","title":"Montclair REU Site in Imaging and Computer Vision (iMagine)","awardID":"1004447","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J103","name":"AIRFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J243","name":"Air Force Office of Scientific"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"K629","name":"Air Force Office of Scientific"}}],"PIcoPI":["550606",444454],"PO":["563751"]},"166079":{"abstract":"Binghamton University in general, and its Computer Science (CS) Department in particular, are successfully complementing an outstanding reputation for undergraduate education with vibrant and growing graduate-level research programs. This combination provides fertile ground for an outstanding NSF REU Site in experimental computer systems research. Each summer, the Binghamton CISE REU Site attracts ten top undergraduate students from a wide variety of CS and Computer Engineering departments across the country. Participants include (i) students from under-represented groups, (ii) women, and (iii) students with limited local access to graduate-level research programs in their home institutions. Students immerse themselves in intensive high-quality research projects directed by one or more CS Faculty Research Mentors at Binghamton, for a ten week period in the summer.<br\/><br\/>Binghamton's CISE REU Site exposes students to high-quality computer systems research, trains them to be effective researchers, and influences them through exciting and positive experiences to continue to pursue a research-oriented career path, including graduate study both at Binghamton and at other universities. As part of the REU experience, students write research-style papers and make public conference-style presentations in Binghamton's CS Department. In preparing to do so, the students make significant contributions to the department's research programs.<br\/><br\/>Departmental research areas of expertise (and therefore potential areas for REU student projects) include computer architecture, energy-aware computing, graphics and image computing, virtualization, Internet search and information retrieval, security, cloud and grid computing, circuit design, algorithmic optimization, data mining, mobile and sensor networks, and more. <br\/><br\/>The program includes an effective evaluation strategy carried out by a local educational evaluation expert. The combination of a high quality research environment, dedicated and talented Faculty Research Mentors, and a feedback loop driven by this evaluation professional, ensure the strong intellectual merit of the proposed activity.","title":"REU SITE: Computer Systems Research in High Performance Cloud Computing Environments","awardID":"1005153","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["553586","550962"],"PO":["564588"]},"161591":{"abstract":"This project investigates in much more detail the human anatomy and dynamics to further progress in replicating human articulation capabilities. To overcome long-standing imaging limitations, the project follows a data-driven approach, in which sampled dynamic motion data is used to infer unknown parameters such as soft-tissue geometry and behavior. The project is cross-disciplinary and driven by specific problems in orthopaedics and human character animation, although its focus is fundamentally on computational and automated analysis tools. The research plan develops computational tools for capturing robustly and accurately dynamic skeletal motion from medical images, for inferring biological shape and behavior from dynamic motion information, and for representing and calculating with these data. The education effort is naturally integrated with the research work, and includes recruiting and training graduate, undergraduate, and high-school students into multi-disciplinary work, through a modeling and simulation approach to teaching computer graphics. The outcome of the project is a set of human-anatomy based (i.e., humanoid) models of articulations that impacts orthopaedists' understanding of articulation injury and disease, leads to improved diagnosis and medical treatment, and improves the realism of digital character animation. The broad impact of the project includes applications in biology, bioengineering, ergonomics, evolutionary biology and robotics. Results of this project, including software, data, and publications, are publicly available through the project web site, http:\/\/vis.cs.pitt.edu\/marai_nsf_career","title":"CAREER: Data-driven Bottom-Up Humanoid Articulations","awardID":"0952720","effectiveDate":"2010-04-01","expirationDate":"2015-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["532924"],"PO":["564316"]},"163781":{"abstract":"Insufficient attention has been given to enterprise Identity and Access Management (IAM) as a process that needs to be carried out on a continuing basis in the presence of change and evolution. In particular, there is little formal support for how IAM can exploit experience the enterprise collects over time. This project is developing a lifecycle model of IAM called Experience Based Access Management (EBAM) that provides a set of models, techniques, and tools to reconcile differences between the \"ideal\" access model, as judged by high-level enterprise, professional, and legal standards, and the \"enforced\" access control, specific to the operational IAM system. The principal component of an EBAM support system is an \"expected\" access model that is used to represent differences between the ideal and enforced models based on information collected from access logs and other operational information. The project is developing and validating an approach to the expected model based on using probabilistic information to inform the design of access rules. The project focuses on EBAM for hospital information systems since these are an especially important class of enterprise systems that present diverse and interesting challenges but also provide potential insight into similar issues in other types of enterprise IAM systems. The team consists of specialists in cyber security, biomedical informatics, and a physician who serves as chief medical information officer within a major hospital system. The project will demonstrate how analysis of clinical experience can address gaps between ideal and enforced access control models in a representative hospital.","title":"TC: Medium: Collaborative Research: Experience-Based Access Management (EBAM) for Hospital Information Technology","awardID":"0964087","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[438436],"PO":["565264"]},"165761":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 10 graduate students along with distinguished research faculty. The event will take place on Thursday, August 5, 2010, immediately preceding the 2010 International Conference on Cognitive Modeling (ICCM) to be held August 6-8, 2010, at Drexel University in Philadelphia. Cognitive modeling has emerged over the last twenty years as an important discipline, both for advancing our understanding of the mind and for developing real-world applications that save money and lives. Using computers to model the mind has also opened up the application of our theories of the mind to real world applications, from being able to better design human-computer interfaces, to evaluating task workload and predicting human performance in mission-critical roles, to creating simulations of humans that participate in large-scale training exercises. ICCM is the premier international forum for research on computational models and computation-based theories of human behavior. It fills a critical niche between other related conferences, in that conference topics span the complete spectrum of cognitive models including connectionism, symbolic modeling, dynamical systems, Bayesian modeling, and cognitive architectures. ICCM includes basic and applied research across a wide variety of domains, ranging from low-level perception and attention to higher-level problem-solving and learning. More information about the conference is available at http:\/\/iccm2010.cs.drexel.edu.<br\/><br\/>The doctoral consortium will bring together the top graduate students in cognitive modeling from around the world. Each student will have about 20-30 minutes to present his\/her thesis research. Students will get feedback from the other students, as well as comments and mentoring from three senior leaders in the field. The mentors will be picked for their ability to work with students, as well as for their breadth of expertise (cognitive modeling is a broad field with many different methodologies, and the workshop organizers plan to ensure that the mentors represent the breadth of the field). At the conclusion of the daylong consortium sessions, the entire group (students and mentors) will enjoy a dinner at a local restaurant for less formal but still valuable discussions and interaction. The conference proper begins the following day, at which the students can now mingle with the larger community both in the conference sessions and at the conference reception. Drexel University has graciously agreed to contribute space, audio\/visual, and networking facilities for the doctoral consortium as part of their support for the ICCM conference, and will not charge overhead on the NSF funding.<br\/><br\/>Broader Impacts: To keep refreshing and renewing research, it is necessary to continually bring new investigators into the field. The doctoral consortium is an important avenue for helping graduate students successfully transition to independent researchers. Thus, a primary objective of the consortium is to serve as a first step in creating a diverse cohort of students and future researchers, by bringing them together so that they can build up a network of contacts, both with senior leaders in the field and with other students who will be active in the field for years to come. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and perhaps to generate new research questions to be addressed during the coming years. The workshop organizers will make a particular effort to recruit students from under-represented groups (including women, minorities, and persons with disabilities), as well as students from smaller schools and\/or schools with less established research centers.","title":"International Conference on Cognitive Modeling 2010 Doctoral Consortium","awardID":"1003923","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[444122],"PO":["565227"]},"159326":{"abstract":"The Colorado School of Mines proposes a project to develop CONNECT (Creating Open Networks aNd Expanding Connections with Technology), a tool that provides networking assistance for attendees of conferences aimed at broadening participation. Attendees at such conferences as the Grace Hopper Celebration of Women in Computing, the Richard Tapia Celebration of Diversity in Computing, and the Colorado Celebration of Women in Computing, for example, consistently state that networking is an extremely valuable component of the conference. Professional networking is particularly important to underrepresented populations, as barriers to participation include a lack of mentors and the feeling of isolation that one doesn't belong. CONNECT uses technology to help BPC conference attendees develop a support network at the conference and, more importantly, sustain those connections after the conference ends. With CONNECT, attendees of a conference set networking goals prior to the event. Then, when two (or more) people want to CONNECT and exchange contact information, conference badges are scanned. CONNECT attendees also receive networking tips, a daily progress email that details which of their networking goals are being met, and suggestions on the types of people to try and meet the next day. At the end of the conference, contact information of the connections made by an attendee is shared. Feedback from an initial pilot of the system will be used to significantly improve upon the CONNECT system, adding, for example, the development of stationary CONNECT stations that do not require personnel to oversee, the ability to make a connection by transmitting a text message from a cell phone, which avoids the need to scan badges, the integration of connections with other social network systems, a face-to-face mentoring opportunity at the conference venue, a networking game component that can be used as an icebreaker, and the facilitation of forming BPC communities of individuals that share common interests. The CONNECT system will be deployed and evaluated at several different types of BPC conferences and meetings.","title":"BPC-DP: Let's CONNECT!","awardID":"0940632","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["546219"],"PO":["561855"]},"170150":{"abstract":"The workshop is planed to honor the life and the scientific achievements of Judea Pearl.The workshop brings together prominent scholars from the three areas in which Judea Pearl had landmark contributions, Heuristics, Probabilistic Reasoning and Causality. It is centered around an edited book; a tribute to Judea Pearl that includes 30 articles in the three areas. The book is co-edited by Pearl's past students and colleagues: Rina Dechter, Hector Geffner and Joe Halpern who also organize the workshop. <br\/><br\/>During the workshop day about about 20 scholars, whose work appear in the book, will present their work. The workshop is open to the public. In addition to about 30 visitors from around the world, it will be attended by faculty and students at UCLA, and in California, and by community members.<br\/><br\/>This event coincides with the 25th anniversary of the first paper by Judea in which he introduced \"Bayesian networks\" in 1985. In this context, a unique book exhibit will be on display, featuring rare first-editions of several milestones in the history of causal and probabilistic reasoning, from Huygens (1657) and Bernoulli (1713) to Bayes (1763) and Laplace (1812), from Hume (1739) and Mill (1843) to Boole (1847), Galton (1895) and Turing (1953).<br\/><br\/>The workshop facilitates disseminating the ideas developed in the past few decades in the three fields, featuring leading scholars and the edited book that include state of the art articles as well as historical perspectives of the three fields. The workshop presentations and book will draw additional researchers into the three fields.","title":"WORKSHOP - Heuristics, Probabilities and Causality","awardID":"1025552","effectiveDate":"2010-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["475511"],"PO":["562760"]},"163770":{"abstract":"Over the past two decades there have been many examples of <br\/>results and insights in the Theory of Algorithms and Complexity that are motivated by,<br\/>and inform, important research fronts in other sciences: Quantum Computing, <br\/>Markov chain Monte Carlo, and Algorithmic Game Theory are <br\/>examples. This project is about computational research<br\/>whose purpose is to shed light to a broad front of central problems in <br\/>Game Theory and Economics, Networking, and Biology. <br\/>Aspects of this work involve devising algorithms for approximating <br\/>Nash equilibria, or identifying computational impediments to the task;<br\/>understanding better the power and limitations of learning and<br\/>distributed algorithms for computing equilibria; exploring from the<br\/>algorithmic standpoint the refinements of the Nash equilibrium concept, as<br\/>well as of equilibrium selection processes, which have been<br\/>developed by researchers in Game Theory over the past fifty years;<br\/>coming up new, compelling, and computationally motivated solution concepts; <br\/>identifying complexity-theoretic impediments to the central problem of characterizing <br\/>the optimal multi-object auction, as well as developing algorithms and lower<br\/>bounds for the problem of computing price equilibria in both the<br\/>most general setting and in novel special cases of markets. <br\/>Further goals of this project in the realm of Networking include <br\/>studying a recently identified class of models known as ``networks of games;'' <br\/>determining the extent to which sophisticated pricing schemes <br\/>can improve the efficiency of selfish routing; and the analyzing two new <br\/>genres of network models: One for social<br\/>networks, and one for financial markets. In Biology, a recent result <br\/>established that natural selection under recombination optimizes not fitness, <br\/>as it had been assumed for decades, but a novel metric which we call ``mixability;'' <br\/>this project shall follow on this work by devising techniques for proving mathematically <br\/>this effect, as well as gauging rigorously its impact on Evolution, and and by exploring <br\/>the relationship between recombination, mixability, and genetic modularity.<br\/><br\/>This project is likely to produce new insights into both Computation<br\/>and the target disciplines (Game Theory, Networking, Theory of Evolution), <br\/>as well as new mathematical techniques. In Algorithmic Game Theory, <br\/>it seeks to make progress on some of the deepest and most looked at problems, but also to<br\/>identify new exciting research fronts and directions in this field.<br\/>In the Theory of Evolution, the effort is to shed light on some of<br\/>the most fundamental and old questions of this important discipline.<br\/>The insights from this work will be used in the development of graduate and<br\/>undergraduate courses. A substantial part of this project aims at<br\/>understanding and improving the global information environment (the<br\/>Internet, the worldwide web, and the digital social networks they<br\/>enable), which is one of Humankind's most valuable resources.","title":"AF: Medium: Algorithmic Research in Game Theory, Networks, and Biology","awardID":"0964033","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":["561682","450995","558880"],"PO":["565251"]},"158865":{"abstract":"Petascale applications are producing terabytes of data at a great rate. Storage systems in large-scale machines are significantly stressed as I\/O rates are not growing as fast to cope with data production. A variety of HPC activities such as writing output and checkpoint data are all stymied by the I\/O bandwidth bottleneck. Further to this, the post-processing and subsequent analysis\/visualization of computational results is increasingly time consuming due to the widening gap between the storage\/processing capacities of supercomputers and users' local clusters. <br\/><br\/>This research focuses on building a novel in-job dynamic data staging architecture and in bringing it to bear on the looming petascale I\/O crisis. To this end, the following objectives are investigated: (i) the concerted use of node-local memory and emerging hardware such as Solid State Disks (SSDs), from a dedicated set of nodes, as a means to alleviate the I\/O bandwidth bottleneck, (ii) the multiplexing of traditional user post-processing pipelines and secondary computations with asynchronous I\/O on the staging ground to perform scalable I\/O and data analytics, (iii) bypassing memory to access the staging area, and (iv) enabling QoS both in the staging ground and in the communication channel connecting it to compute client and persistent storage.<br\/><br\/>This study will have a wide-ranging impact on future provisioning of extreme-scale machines and will provide formative guidelines to this end. The result of this research will be a set of integrated techniques that can fundamentally change the current parallel I\/O model and accelerate petascale I\/O pipelines. Further, this research will help analyze the utility of SSDs in day-to-day supercomputing I\/O and inform the wider HPC community of its viability.","title":"Collaborative Research: Dynamic Staging Architecture for Accelerating I\/O Pipelines","awardID":"0937827","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7952","name":"HECURA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[424542],"PO":["565272"]},"171394":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 12 promising graduate students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the 16th International Conference on Auditory Display (ICAD 2010), to be held June 9-15, 2010, at George Washington University in Washington, DC. ICAD is the premier international forum for presenting research on the use of sound to display data, monitor systems, and provide enhanced user interfaces for computers and virtual reality systems. It is unique in its singular focus on auditory displays and the array of perception, technology, and application areas that this encompasses; this includes, for example, data sonification, auditory wayfinding, auditory graphs, speech interfaces, virtual environments, and associated perceptual, cognitive, technical, and technological research and development. Many of the interdisciplinary research and development efforts are of direct relevance to persons with perceptual disabilities, especially visual impairments; for example, developing wayfinding systems for the blind requires research into effective distance cues and object identifiers used in auditory displays. More details about the conference are available at http:\/\/www.icad.org\/icad2010. The doctoral consortium will bring together graduate students from diverse backgrounds (e.g., engineering, computing, music, and psychology), so that they can experience the broad spectrum of approaches to auditory displays, assistive technologies and universal design, while exploring their research interests through interaction with peers and under the guidance of a panel of distinguished experts in the field. To these ends, the ThinkTank will develop a supportive community of scholars and a spirit of collaborative research, by providing participants with a friendly and open, yet rigorous, scientific forum to present their research ideas, to listen to ongoing work from peer students, and to receive constructive feedback. Student participants will make formal presentations of their work during the ThinkTank and will receive feedback from the faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The ThinkTank will also provide students with relevant information about important issues for doctoral candidates, whether they are considering academic or industrial career paths. The event will further offer invited speakers and discussion groups, and will involve many students as part of the audience and discussion groups, in addition to those presenting their work. Each student participant will furthermore present a poster about his\/her work during the conference proper. An evaluation of the ThinkTank will be conducted and the findings will be made available to the organizers of future conferences and consortia.<br\/><br\/>Broader Impacts: This event will promote scholarship and networking among new researchers in an important emerging interdisciplinary area, and will help shape ongoing and future research projects that have clear and important implications for development of assistive technologies and universal access. The doctoral consortium will afford participants exposure to a larger community, allowing them to bond among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality and culture as well as scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"ThinkTank (Doctoral Consortium) at International Conference on Auditory Display (ICAD) 2010","awardID":"1032353","effectiveDate":"2010-04-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["529975"],"PO":["565227"]},"167424":{"abstract":"As the amount and complexity of the data increase and as the questions being addressed become more sophisticated, bioinformatics and computational biology researches have been formed which integrate expertise in computer science, mathematics, statistics, and biochemistry into the biological and biomedical researches. Bioinformatics and computational biology cover a broad range of research topics from genomic, proteomic and molecular biology data analysis to tissue engineering, cell engineering, medical image analysis and biological and medical devices. The increasingly wide use of digital and high-throughput technology has enabled<br\/>biological and biomedical researchers to generate massive amounts of data from laboratory<br\/>experiments, survey data, health records and a wide array of biomarkers. In addition, the availability of public genomic databases and the associated analysis on comprehending sequences and annotations, protein-protein interaction data, protein structures and domain information has increased the need for the development of new approaches in computer science to inform new computational tools and methodologies directed towards integration and extraction. The 2010 ACM International Conference on Bioinformatics and Computational<br\/>Biology (ACM-BCB 2010) is the first ACM (Association for Computing Machinery) conference in<br\/>the areas of bioinformatics, computational biology, and biomedical research. It marks the start of ACM?s efforts to better support the bioinformatics and computational biology community. The conference is scheduled to be held at Niagara Falls Conference center, in Niagara Falls, New York. The best student paper awards will be an excellent means to promote graduate students? involvement with cutting-edge computer science research. In addition, through the ACM-BCB conference, ACM hopes to build the bioinformatics and computational biology community and establish an ACM Special Interest Group in Bioinformatics and Computational Biology (SIGBio). A community meeting will be held during the ACM-BCB2010 conference at Niagara Falls to assess and develop the support for forming the ACM SIGBio, further helping to insure the active participation of computer science in this multidisciplinary area.","title":"ACM-BCB: Conference on Bioinformatics and Computational Biology","awardID":"1011828","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518557",448581,"518277",448583,448584],"PO":["565136"]},"169646":{"abstract":"This project funds 10 US-based graduate students to attend the 8th USENIX Symposium on File and Storage Technology (FAST), in February<br\/>2010. FAST is a leading forum for innovative research in storage systems, bringing in researchers and practitioners from both industry and academia. <br\/>Participation in leading conferences is an extremely important part of the graduate school experience, providing the opportunity to interact with more senior researchers and to be exposed to leading edge work. This project enables participation of students who would otherwise be unable to attend, including women, African-Americans and Native Americans.","title":"NSF: Request for Funding Student Participation in the File and Storage Technology (FAST) 2010","awardID":"1023169","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["541948"],"PO":["535244"]},"171890":{"abstract":"Enhancing Access to the Radio Spectrum (EARS) is a multi-disciplinary activity whose goal is to improve the efficiency with which the radio spectrum is utilized and to improve access to the radio spectrum in support of current and new technologies. Achieving these goals will, among other impacts, improve the availability of wireless broadband to Americans presently without broadband access, as called for in the American Recovery and Reinvestment Act. Because the radio spectrum is a valuable but finite natural resource, improvements in spectrum efficiency will have significant economic impact to the nation and the world. This award funds the first step, which is an invitational workshop that will bring together some of the key researchers and policy makers involved in radio spectrum access. All relevant fields will be represented, including science, engineering, economics, and policy\/regulatory. The output of the workshop will include a vision for the future of radio spectrum access and use, and a prioritized list of research areas that can help achieve that vision.","title":"Collaborative Research: Enhancing Access to the Radio Spectrum (EARS) Workshop","awardID":"1035474","effectiveDate":"2010-04-15","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"7976","name":"EARS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7564","name":"COMMS, CIRCUITS & SENS SYS"}}],"PIcoPI":[460382],"PO":["499668"]},"170493":{"abstract":"The 2010 East Coast Computer Algebra Day (ECCAD), will be held at Emory University, Atlanta, Georgia, on May 15, 2010. The purpose of this meeting is to stimulate interest in and enhance understanding of the technical aspects of computer algebra, by providing a meeting for those in the region who are active or interested in any aspect of computer algebra, including theory, software, and applications. The one day format allows researchers from the community and those interested in learning more about computer algebra to meet with each other in an inexpensive and easily accessible way. This meeting will be more informal than a traditional conference, with ample time for unstructured interaction. Participation by graduate students from the region will be particularly encouraged through special invitation to contribute to the poster sessions, and through travel support.<br\/><br\/>The meeting will include presentations by three speakers who are researchers in computer algebra or who make signi cant use of computer algebra in applications. In addition, there will be contributed poster and software demo sessions, and a panel discussion on trends, open issues and future directions of computer algebra.","title":"Conference: East Coast Computer Algebra Day","awardID":"1027212","effectiveDate":"2010-04-15","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":["564098"],"PO":["565251"]},"163860":{"abstract":"","title":"HCC: Medium: Collaborative Research: Low Cost, Portable, Multi-User, Immersive Virtual Environment Systems for Education and Training in Worlds of Unlimited Size","awardID":"0964490","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[438649],"PO":["565227"]},"162661":{"abstract":"The College of Staten Island of the City University of New York (CUNY) plans to add a new Cray system, code-named Cray-Baker, to its existing set of machines to exploit the advantages provided by Partitioned Global Address Space (PGAS) programming languages, such as Co- Array Fortran and Unified Parallel C. The significance of this project is that it allows CUNY and collaborating researchers to jump-start academic research in the development of PGAS-based applications by acquiring the first such system, outside of the National Security Agency and Department of Energy.<br\/>City University of New York (CUNY) investigators use high performance computing (HPC) to simulate electro-mechanical coupling in the heart to understand how acquired disorders, such as myocardial infarction, and genetic diseases, result in abnormal heart rhythms. CUNY investigators also use HPC to model the ability of urban structures to withstand the effects of blast from explosive devices. The new HPC system with its advanced programming models and support for low-latency global communications accelerate these research activities. Collaborations with noted national and international researchers are supported.","title":"II-EN: CUNY Computing Research Infrastructure","awardID":"0958379","effectiveDate":"2010-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434663,"459151",434665,"490437",434667],"PO":["565272"]},"163893":{"abstract":"A fundamental but challenging issue in information security is secure sharing and management of sensitive data and information among numerous organizations that form large-scale e-enterprises. Today, an increasing number of enterprises are using the Internet for managing and sharing users? and enterprise information through online databases. However, security and privacy of data is an overriding concern currently limiting the proliferation of information technology. Among others, the two key security issues are; (a) interoperability challenge of diverse security policies exercised by collaborating organizations for sharing sensitive information and; (b) using collaborative knowledge for detecting and responding to any emerging security or emergency threats. The objective of this project to develop a scalable multi-domain information security framework which: (a) facilitates large-scale integration, mining, and analysis of multimedia data residing in multiple domains for identifying sensitive information that require controlled dissemination (b) allows distributed real-time content analysis of multimedia data streams across multiple-domains for correlating detectable events, (c)l provides integration and evolution of inter-domain access control policies for distributed multimedia applications, and (d) ensures protection of user?s information. The project uses several innovative approaches to meet these objectives. First, novel real-time data mining and stream-correlation methods is used for extracting useful content and detecting events embedded in data streams by using multiple sliding window operators. Second, an efficient privacy\/security based multimedia data clustering mechanism allows a prevailing security policy to be adaptable to the changing context and the datasets. The uniqueness of this approach is the adaptive nature of security policies. In addition, a novel XML-based integrated mechanism is used for encoding of multimedia data in conjunction with multi-domain security policies for ensuring technical viability and portability of the system.<br\/>The proposed research is expected to have direct and long-term impact on developing secure information infrastructures, such as e-commerce, digital libraries, and healthcare systems, which are projected to have an important role at a global scale for the next several decades. The research results can help in alleviating the heavy financial risks associated with information and system security and in general, meeting the national information infrastructure security needs and threat management. The research will be pursued in collaboration with Cyber Center, the Center for Education and Research in Information Assurance and Security (CERIAS) and PURVAC facilities at Purdue University with which the PI?s have strong affiliation and on-going collaboration. Results and tools developed will be made available over the Web to research community. In The team has a track record of providing their research results and tools to various research communities in the areas of multimedia databases and information security management.<br\/><br\/><br\/>For further information see the project web site at the<br\/>URL: http:\/\/cobweb.ecn.purdue.edu\/~dmultlab\/ <http:\/\/cobweb.ecn.purdue.edu\/%7Edmultlab\/>","title":"TC: Medium: Security and Privacy Preserving Data Mining and Management for Disctributed Domains","awardID":"0964639","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[438744,438745,"486458"],"PO":["565136"]},"171044":{"abstract":"This project provides support for US students to attend the 8th IEEE International Conference on Pervasive Computing and Communications <br\/>(PerCom 2010), which will be held in Mannheim, Germany between March 29th, 2010 and April 2nd, 2010. IEEE PerCom is the premier technical forum in the rapidly emerging and important area of pervasive computing and networking. Graduate student participation in a key conference like IEEE PerCom is extremely important part of graduate education and would help motivate students to engage in research in a variety of pervasive computing aspects. The European venue for the conference will further help US students to interact with European researchers. The grant primarily supports students who will not be able to a attend the conference otherwise.","title":"CSR: IEEE PerCom 2010 Student Travel Support","awardID":"1030412","effectiveDate":"2010-04-15","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["486502"],"PO":["535244"]},"159318":{"abstract":"Chaminade University of Honolulu proposes a collaboration with the University of Hawai'i campuses at Hilo and Manoa for the purpose of planning and developing the infrastructure for a BPC Pacific Alliance. That Alliance would serve higher education institutions with significant Native Hawaiian and Pacific Island student populations in the Pacific region. These students are a largely untapped resource, but they will be difficult to reach: they attend 20 undergraduate institutions located on ten islands, and they are a diverse population, scattered across thousands of miles in the Pacific Ocean, encompassing four distinct cultural traditions and speaking a dozen different Pacific Island languages. Existing programs aimed at improving STEM educational opportunities in the region have not had the resources needed to make a significant impact on students in the computing disciplines. This project takes the first steps in building a program specifically designed to meet the needs of students pursuing computing degrees. The Pacific BPC alliance will be built in stages starting with the three founding institutions. It will be modeled on two other Alliances: the Islands of Opportunity Alliance (IOA-LSAMP) will provide the foundation and basic structure, while the Computing Alliance of Hispanic-Serving Institutions (CAHSI) will provide best practices and successful interventions. Planning activities will center around preparations for a full proposal in the spring of 2011.","title":"BPC-A: Planning a Broadening Participation in Computing Alliance for the Pacific Islands","awardID":"0940578","effectiveDate":"2010-04-01","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425912,"492735","488830"],"PO":["561855"]},"171550":{"abstract":"This CISE special project funds the organization of the CISE Broader Impacts Summit. The goals of the summit include educating the CISE community about the NSF Broader Impacts criterion how to evaluate this criterion as part of a research project. The Summit should provide researchers and educators with the opportunity to forge collaborations and build long-term partnerships that may lead to a wide range of activities with the potential to enhance CISE research projects. The Summit is to be organized by a Steering Committee that represents all CISE divisions and a range of CISE disciplines. The investigators plan to discuss, present, and subsequently develop guidance materials for the CISE computing research community on how to effectively integrate broader impact activities into research projects. <br\/><br\/>Intellectual Merit: The intellectual merit of this project will arise from the working group discussions at the summit. At the end of the summit, a report is to be developed that synthesizes both current and future ideas in each of the five broader impact categories. This should provide research based methods for CISE investigators to connect their research and broader impacts in innovative ways.<br\/><br\/>Broader Impacts: The broader impacts of this project will arise from the computing community members, by those to whom they speak about the summit, and by those who access materials created after the summit. The project includes dissemination plans to ensure the efforts from this project have an impact on future NSF projects. The impact on future NSF projects should result in significant broader impacts from CISE research projects across all five broader impact categories.","title":"Collaborative Research: Broader Impacts for Research and Discovery Summit","awardID":"1033492","effectiveDate":"2010-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["542299"],"PO":["564181"]},"163762":{"abstract":"Computational photography refers broadly to sensing strategies and algorithmic techniques that enhance or extend the capabilities of digital photography. Representative techniques include high dynamic range (HDR) imaging, flash-noflash imaging, panoramic stitching, and refocusable photography. Although interest in computational photography has steadily increased among graphics and vision researchers, progress has been hampered by the lack of a portable, programmable camera platform with enough image quality and computing power to be used outside the laboratory, i.e. for everyday photography. Similarly, courses in computational photography are offered in dozens of universities nationwide. However, none of these courses provide students with a camera on which they can implement the algorithms currently being published in the literature.<br\/><br\/>To address these two problems, we are building an open-source camera platform (called Frankencamera) that is portable, self-powered, connected to the Internet, and accommodates SLR-quality lenses and sensors. We also describe a software architecture based on Linux, and an API with bindings for C++, that permits control and synchronization of camera functions at the microsecond time scale. Our API includes pre-capture functions like metering and focusing, an image post-processing pipeline, a user interface toolkit for the viewfinder, and support for current and future I\/O devices. Our plan is to distribute this platform at minimal cost to researchers and university instructors nationwide, using the computational photography courses they already teach as a natural distribution vehicle. Instructors will apply to us to be part of this outreach program, and a standing committee will evaluate these applications. Our long-term goal is to spur creation of a community of photographer-programmers who write plug-ins and apps for cameras.","title":"III: Medium: Collaborative Research: Frankencamera - an open-source Camera for Research and Teaching in Computational Photography","awardID":"0964004","effectiveDate":"2010-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["515737","485699"],"PO":["532791"]},"163773":{"abstract":"This collaborative project investigates Opportunistic Sensing (OS) and Compressive Sensing (CS) in Wireless Sensor Networks (WSNs). OS refers to a paradigm in which a WSN can automatically discover and select sensor modalities and sensors based on an operational scenario, resulting in an adaptive network that automatically finds scenario-dependent, objective-driven opportunities with optimized performance. CS is a novel sensing\/sampling paradigm that goes against the common wisdom in data acquisition. Both OS and CS help improve efficient operations and performance of WSNs significantly. In particular, OS aims at reduction from space by selecting a subset of sensors and modalities for efficient data fusion, whereas CS targets reduction in sampling by selecting a subset of samples non-uniformly. Therefore, theoretical foundations and algorithms for opportunistic and compressive sensing are essential for advancing the state of the art in WSNs that not only ensure effective utilization of sensing assets but also provide robust optimal performance. This project addresses fundamental research issues from information theoretic viewpoint to evaluate joint OS and CS distortions, develop OS and collaborative CS schemes for better performance of WSNs, and cross-layer design to adapt to the non-uniform sampling in CS-based WSNs.<br\/>This project will make a significant contribution to the theory and applications of opportunistic and compressive sensing to WSNs and will have a broad and deep social impact in homeland security and defense. Under-represented and female students from different societies will be recruited, and seminars and in-house short courses will be offered to local industry via IEEE.","title":"NeTS: Medium: Collaborative Research: Opportunistic and Compressive Sensing in Wireless Sensor Networks","awardID":"0964060","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[438415],"PO":["565303"]},"162586":{"abstract":"This project is developing new simulation frameworks for the ns-3 discrete-event network simulator, a free and open-source research tool designed for use by computer communications network researchers. Simulation remains in heavy use for network research and education, because of its ease of use, reproducibility, availability, scalability, and ease of software development. However, the workflow of a typical simulation study requires the user's careful attention to a number of best practices in methodology to ensure that the results are credible and reproducible by third parties and that errors are not introduced. This project is building an automation framework for the ns-3 simulator that provides an environment that is more conducive to the creation of rigorous studies. The automation framework guides the user to produce valid network simulation models by composition and consistency checking, and definition of experimental settings. The framework exercises control over large-scale simulation studies, and applies statistical methods for output data analysis and execution control. The framework also collect details required to reproduce the experiment and report results. The framework also allows users to specify wide ranges of simulation network topologies, application traffic, and other parameters, allowing experiments to be conducted on a wide range of scenarios with minimal effort. Finally, maintaining the ns-3 software, documentation, and dissemination activities continue. The additions to ns-3, disseminated as open source software, are improving the methodology and credibility for future simulation-based network research.","title":"Collaborative Research: Frameworks for NS-3","awardID":"0958015","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434457],"PO":["564993"]},"164687":{"abstract":"Early detection of wildfires is critical to mounting a successful response, and a growing need given trends in both urbanization and climate change. As recently as a few months ago, large wildfires started in inaccessible unmonitored areas threatened large urban areas for weeks (witness the Station Fire in the Angels National Forest). Manned observation towers, the method of choice in decades past, has become unsustainable with the boundaries of urban sprawl growing and the budgets of local governments under strain.<br\/><br\/>This project tackles the problem head-on by developing algorithmic and engineering tools for remote detection of incipient fires using networked remote optical sensors in the visible and infra-red spectra. While previous efforts suggested blanketing the target area with networked temperature and smoke sensors, this approach does not scale well because it requires sensors to be close to the source in order to trigger an alarm. Remote sensors can detect events at a distance and are only limited by the topography of the environment. Thus one strategically placed camera can monitor an entire valley and would ultimately be suitable for co-deployment with other infrastructure such as cell towers. However, processing these video streams is not trivial since events of interest, such as the inception of a fire, can manifest themselves in a large number of ways depending on time of the day, season, weather, distance from the sensor, fuel etc. The challenge is to tease apart these \"nuisance effects\" and only detect events of interest. The team will focus on the algorithmic challenge of inferring spatio-temporal events in video streams, and on the systems trade-offs between computation, communication and energy resources.","title":"Remote Sensing for Early Detection of Wildfires","awardID":"0969032","effectiveDate":"2010-04-15","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7938","name":"SENSOR NETWORKS"}}],"PIcoPI":["461021","560926"],"PO":["564898"]},"159308":{"abstract":"Pacific University proposes to engage girls in computing with a multifaceted, modular pedagogical strategy that focuses on women computer scientists as leaders. The approach will feature a four-week long computer science summer camp for 7th and 8th grade girls - G2CS (Girls Gather for Computer Science) - with original curriculum that utilizes active learning and focuses on computational thinking, a mentoring program, a multi-media approach and interactive web site, as well as a ten-year commitment to the students involved. Using female computer science leaders as instructors and removing students from their usual surroundings and preoccupations free young women to concentrate on the science, and imagine themselves as scientists. The camp will run for three years and systematic follow-on activities within electronic environments will create an ongoing community of students, their families, mentors and teachers as well as partners. The focus in this particular project is on overcoming the lack of young women in computer science, though its approach would be suitable for use in a variety of scientific fields. <br\/><br\/>The project is a partnership between Pacific University and Oregon's nationally recognized public broadcasting station, Oregon Public Broadcasting (OPB). Other partners include the Berglund Center for Internet Studies at Pacific, the Intel Corporation, the educational media company Flying Rhinoceros, Vernier Software & Technology, leaders from tribal groups, local Latino community representatives, and local school district heads. The outcomes of the project include video coverage of the camp, featuring young scientists and their mentors at work, game-like \"interactives\" for the camp web site, and a broad collection of media tools.","title":"G2CS - Girls Gather for Computer Science. Developing a modular summer day camp to introduce girls to computer science, with female scientists and industry professionals as leaders.","awardID":"0940545","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425873,425874,425875],"PO":["561855"]},"161684":{"abstract":"Scientific practice has been radically transformed by computation.<br\/>Many observers now place computational simulation on an equal footing<br\/>with the two traditional approaches to scientific discovery,<br\/>experimentation and theory. But while there are long-established and<br\/>rigorous criteria for validating experiments and mathematical<br\/>reasoning, the same is not true for simulation. Published reports of<br\/>simulation-based research typically say little or nothing about the<br\/>software, its qualities, or what was done to ascertain its<br\/>correctness. The software is rarely examined by reviewers or other<br\/>researchers, and in some cases is not even made available to them.<br\/>This situation is particularly troublesome in light of the substantial<br\/>evidence that scientific software is, in general, as unreliable as any<br\/>other type of software.<br\/><br\/>The research focuses on developing a set of integrated techniques for<br\/>the specification and verification of scientific software. Drawing on<br\/>ideas from model checking, symbolic execution, and other formal<br\/>methods, these will include: (1) new techniques to efficiently check<br\/>for the presence of deadlocks, race conditions, improper use of<br\/>parallel programming libraries, and other generic defects in<br\/>scientific programs, (2) techniques to specify and verify the order of<br\/>accuracy of numerical programs, such as those used to solve systems of<br\/>differential equations, and (3) new techniques to verify the<br\/>functional equivalence of two scientific programs, including programs<br\/>with unbounded loops, and programs with (shared-variable and\/or<br\/>message-passing) parallelism. These techniques will be realized in a<br\/>new tool suite, the Toolkit for Accurate Scientific Software (TASS),<br\/>which will be made publicly available under an open source license.","title":"CAREER: Ensuring the Accuracy of Scientific Software: A Formal Approach","awardID":"0953210","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"K585","name":"NSA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["561781"],"PO":["565272"]},"158836":{"abstract":"Petascale applications are producing terabytes of data at a great rate. Storage systems in large-scale machines are significantly stressed as I\/O rates are not growing as fast to cope with data production. A variety of HPC activities such as writing output and checkpoint data are all stymied by the I\/O bandwidth bottleneck. Further to this, the post-processing and subsequent analysis\/visualization of computational results is increasingly time consuming due to the widening gap between the storage\/processing capacities of supercomputers and users' local clusters. <br\/><br\/>This research focuses on building a novel in-job dynamic data staging architecture and in bringing it to bear on the looming petascale I\/O crisis. To this end, the following objectives are investigated: (i) the concerted use of node-local memory and emerging hardware such as Solid State Disks (SSDs), from a dedicated set of nodes, as a means to alleviate the I\/O bandwidth bottleneck, (ii) the multiplexing of traditional user post-processing pipelines and secondary computations with asynchronous I\/O on the staging ground to perform scalable I\/O and data analytics, (iii) bypassing memory to access the staging area, and (iv) enabling QoS both in the staging ground and in the communication channel connecting it to compute client and persistent storage. <br\/><br\/>This study will have a wide-ranging impact on future provisioning of extreme-scale machines and will provide formative guidelines to this end. The result of this research will be a set of integrated techniques that can fundamentally change the current parallel I\/O model and accelerate petascale I\/O pipelines. Further, this research will help analyze the utility of SSDs in day-to-day supercomputing I\/O and inform the wider HPC community of its viability.","title":"Collaborative Research: Dynamic Staging Architecture for Accelerating I\/O Pipelines","awardID":"0937690","effectiveDate":"2010-04-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7952","name":"HECURA"}}],"PIcoPI":["549981","540170"],"PO":["565272"]},"170562":{"abstract":"This award will support travel of approximately 8 U.S. students to the annual IEEE symposium on Security and Privacy, held this year on May 16-19, 2010. This is one of the primary research conferences in this field. Attending this particular symposium can be of significant value in starting students on effective careers in this field, which is of vital national interest.","title":"IEEE Symposium on Security and Privacy - Student Travel Support; May 2010; Oakland, CA","awardID":"1027642","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["561510"],"PO":["529429"]},"161762":{"abstract":"Millions of computers worldwide are estimated to be infected by malware (malicious software) and have become ? unknown to their owners ? part of an army of dangerous ?bots?, which are software applications that run automated tasks over the Internet controlled by cyber criminals. These infected computers are coordinated and used by attackers to launch illegal and destructive network activities including identity theft, sending spam (estimated 100 billion spam messages every day), launching distributed denial of service attacks, and committing click fraud. They are also capable of launching information warfare to destroy critical network infrastructure of a nation. Existing malware-detection approaches are limited in their ability to identify and discern malicious bots from legitimate and benign ones. This proliferation and sophistication requires constant vigilance and upgrading. The proposed project introduces a new and paradigm-shifting approach for malware detection, referred to as human-behavior driven malware detection. With this approach, the project will be able to accurately differentiate network behaviors of a legitimate user and malware by identifying and enforcing unique properties of human computer usage on a host.<br\/><br\/>The focus on human-user characteristics, versus those of malware, allows computer security to be realized without the need for continually monitoring ever-changing malware patterns. This approach will complement conventional malware-detecting techniques based on code analysis, data mining, or network trace filtering. The design of a unique and tamper-resistant traffic-enforcement framework will cryptographically verify the provenance information of both system and application-level data utilizing on-chip cryptographic hardware support. This project will implement novel and fine-grained input-traffic correlation analysis that has not been previously applied across a host?s network stack, kernel modules, and input devices. The proposed work will create new knowledge on design principles of reliable operating systems and applications, as well as gain insights to provide seamless integration of network-security techniques into a kernel. These studies will significantly advance the understanding of human-behavior based security and improve the system integrity of all networked computers. The research will build a base of important fundamental knowledge about user-centric security and will provide a compelling and more permanent solution to the increasing need of malware detection. The proposed work will focus on identifying characteristic human-user behaviors (namely application-level user inputs via keyboard and mouse), developing protocols for fine-grained traffic-input analysis, and preventing forgeries and attacks by malware. The PI will design and apply a combination of cryptographic techniques, correlation analysis, and Trusted Platform Module based integrity measures to carry out these tasks.<br\/><br\/>As an integrated component of the project, the PI will conduct outreach and educational activities that aim to increase the general awareness of cyber-security issues in the K-14 community and broaden the interdisciplinary participation of undergraduate and underrepresented groups in computer security research. In addition, the PI will develop a novel interactive software system Sec Ed for teaching computer security and advancing efforts in curriculum development, mentoring, diversity building, and workshop organization.","title":"CAREER: Human-Behavior Driven Malware Detection","awardID":"0953638","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["494759"],"PO":["565136"]},"162642":{"abstract":"American Sign Language (ASL) is used by as many as two million people in the United States, with additional users elsewhere in North America. The purpose of this \"planning grant\" is to enable the PI and her multi-institutional team to explore the case for a possible future NSF investment in an annotated, publicly available, and easily searchable corpus consisting of terabytes of ASL video data (deriving in part from prior work by the PI and her colleagues), including diverse types of content such as dialogues, narratives, elicited sentences illustrating specific grammatical constructions, and isolated signs. The PI contends such a resource would constitute an important infrastructure that would be exploited by a broad research community to advance the fields of linguistics (the structure of ASL), computer vision (machine recognition of gestures), indexing of visual information (through the expansion of mark up vocabularies), and education. The PI notes that the potential value of the existing corpora remains largely untapped, notwithstanding their extensive and productive use by her team and others, due to hardware and software limitations that make it cumbersome to search, identify, and share data of interest. <br\/><br\/>Broader Impacts: The new resource would be easily accessible by the research community and the broader public, via a user-friendly Web-based interface. Availability of the resource online would allow ASL teachers and users, and others, to access the data directly. Users would be able to look up an unknown sign by submitting a video example of that sign. Students of ASL would be able to retrieve video showing examples of a specific sign used in actual sentences, or examples of a grammatical construction. ASL instructors and teachers of the Deaf would have easy access to video examples of lexical items and grammatical constructions as used by a variety of native signers, for use in language instruction and evaluation.","title":"Collaborative: II-EN: Development of Publicly Available, Easily Searchable, Linguistically Analyzed, Video Corpora for Sign Language and Gesture Research","awardID":"0958286","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["557541"],"PO":["565227"]},"161696":{"abstract":"Several important problems in machine learning, such as maximum<br\/>aposteriori (MAP) inference in graphical models, are inherently combinatorial. While extensive research has been devoted to designing approximation algorithms for such problems, existing algorithms do not scale well to large problems. This project focuses on leveraging ideas from online learning with expert advice to develop a novel family of online learning algorithms for combinatorial optimization problems. <br\/><br\/>Algorithms for combinatorial online learning are efficient and simple to analyze in order to establish guarantees. Unlike existing literature on approximation algorithms for combinatorial problems which rely on suitable real relaxations of the original problem, combinatorial online learning algorithms never use relaxations; they work directly with binary\/integer solutions and have global approximation guarantees. The project investigates generalizations of the framework to solve online and batch binary quadratic programming problems, yielding approximation algorithms for a variety of combinatorial problems, including NP-complete problems, and MAP inference in directed and undirected graphical models. The project considers three important real life applications: portfolio selection for effectively investing in the stock market, automating surgical pathology by expediting disease detection in tissue images, and climate change detection for discovering abrupt climate changes from spatiotemporal climate data. <br\/><br\/>The project is expected to be transformative, especially in the context of surgical pathology and climate change detection, yielding significant long term societal benefits. The research results will be disseminated to the community through research papers, tutorials, open source software, and outreach activities using games based on mock stock markets.","title":"CAREER: Combinatorial Online Learning and its Applications","awardID":"0953274","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["557452"],"PO":["562760"]},"163775":{"abstract":"Insufficient attention has been given to enterprise Identity and Access Management (IAM) as a process that needs to be carried out on a continuing basis in the presence of change and evolution. In particular, there is little formal support for how IAM can exploit experience the enterprise collects over time. This project is developing a lifecycle model of IAM called Experience Based Access Management (EBAM) that provides a set of models, techniques, and tools to reconcile differences between the \"ideal\" access model, as judged by high-level enterprise, professional, and legal standards, and the \"enforced\" access control, specific to the operational IAM system. The principal component of an EBAM support system is an \"expected\" access model that is used to represent differences between the ideal and enforced models based on information collected from access logs and other operational information. The project is developing and validating an approach to the expected model based on using probabilistic information to inform the design of access rules. The project focuses on EBAM for hospital information systems since these are an especially important class of enterprise systems that present diverse and interesting challenges but also provide potential insight into similar issues in other types of enterprise IAM systems. The team consists of specialists in cyber security, biomedical informatics, and a physician who serves as chief medical information officer within a major hospital system. The project will demonstrate how analysis of clinical experience can address gaps between ideal and enforced access control models in a representative hospital.","title":"CT: Collaborative Research: Experience-Based Access Management (EBAM) for Hospital Information Technology","awardID":"0964063","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":[438419],"PO":["565264"]},"162676":{"abstract":"American Sign Language (ASL) is used by as many as two million people in the United States, with additional users elsewhere in North America. The purpose of this \"planning grant\" is to enable the PI and her multi-institutional team to explore the case for a possible future NSF investment in an annotated, publicly available, and easily searchable corpus consisting of terabytes of ASL video data (deriving in part from prior work by the PI and her colleagues), including diverse types of content such as dialogues, narratives, elicited sentences illustrating specific grammatical constructions, and isolated signs. The PI contends such a resource would constitute an important infrastructure that would be exploited by a broad research community to advance the fields of linguistics (the structure of ASL), computer vision (machine recognition of gestures), indexing of visual information (through the expansion of mark up vocabularies), and education. The PI notes that the potential value of the existing corpora remains largely untapped, notwithstanding their extensive and productive use by her team and others, due to hardware and software limitations that make it cumbersome to search, identify, and share data of interest. <br\/><br\/>Broader Impacts: The new resource would be easily accessible by the research community and the broader public, via a user-friendly Web-based interface. Availability of the resource online would allow ASL teachers and users, and others, to access the data directly. Users would be able to look up an unknown sign by submitting a video example of that sign. Students of ASL would be able to retrieve video showing examples of a specific sign used in actual sentences, or examples of a grammatical construction. ASL instructors and teachers of the Deaf would have easy access to video examples of lexical items and grammatical constructions as used by a variety of native signers, for use in language instruction and evaluation.","title":"Collaborative Research: II-EN: Development of Publicly Available, Easily Searchable, Linguistically Analyzed, Video Corpora for Sign Language and Gesture Research","awardID":"0958442","effectiveDate":"2010-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["475203","472054"],"PO":["565227"]},"171510":{"abstract":"This CISE special project funds the organization of the CISE Broader Impacts Summit. The goals of the summit include educating the CISE community about the NSF Broader Impacts criterion how to evaluate this criterion as part of a research project. The Summit should provide researchers and educators with the opportunity to forge collaborations and build long-term partnerships that may lead to a wide range of activities with the potential to enhance CISE research projects. The Summit is to be organized by a Steering Committee that represents all CISE divisions and a range of CISE disciplines. The investigators plan to discuss, present, and subsequently develop guidance materials for the CISE computing research community on how to effectively integrate broader impact activities into research projects. <br\/><br\/>Intellectual Merit: The intellectual merit of this project will arise from the working group discussions at the summit. At the end of the summit, a report is to be developed that synthesizes both current and future ideas in each of the five broader impact categories. This should provide research based methods for CISE investigators to connect their research and broader impacts in innovative ways.<br\/><br\/>Broader Impacts: The broader impacts of this project will arise from the computing community members, by those to whom they speak about the summit, and by those who access materials created after the summit. The project includes dissemination plans to ensure the efforts from this project have an impact on future NSF projects. The impact on future NSF projects should result in significant broader impacts from CISE research projects across all five broader impact categories.","title":"Collaborative Research: Broader Impacts for Research and Discovery Summit","awardID":"1033192","effectiveDate":"2010-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["538796"],"PO":["564181"]},"162710":{"abstract":"This project aims to educate, train and equip graduate students in what is becoming a critical paradigm in speech and NLP: distributed algorithms, a paradigm pursued by Google with great success. This distributed processing paradigm represents more than just a computational convenience, but rather an approach for designing algorithms to optimize performance within such an environment, yielding massive improvements over standard algorithms directly deployed in parallel.<br\/><br\/>The objectives of the current institutional infrastructure proposal are to (1) acquire an extensive (384 core) cluster of processors for use as a Hadoop cluster at the Center for Spoken Language Understanding (CSLU) at OHSU; (2) integrate the cluster within the existing computing infrastructure; and (3) develop educational resources (tutorials, lab sessions, course modules and seminars) focused on both ``how-to'' information for using the Hadoop cluster and more general topics in algorithms for distributed computing. At CSLU -- part of the Division of Biomedical Computer Science at OHSU -- nearly all of the problems are within the scope of basic or applied NLP or speech processing research.<br\/><br\/>Apart from training graduate students via both course-work and work on research projects, the infrastructure created in this project will contribute to advances in speech processing and NLP and applications that make use of these technologies, including national defense applications in text and speech mining along with biomedical applications. It will enable at least eight funded NSF projects and at least five projects from other agencies to pursue novel directions in their data analysis.","title":"II-NEW: Hadoop cluster acquisition, deployment and training for speech and language processing","awardID":"0958585","effectiveDate":"2010-04-01","expirationDate":"2012-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["467640","456647"],"PO":["565215"]},"171334":{"abstract":"This is funding to support a Doctoral Consortium (workshop) for about 10 graduate students, along with a panel of 4 distinguished research faculty mentors, which will take place in conjunction with the 2010 IEEE Symposium on Visual Languages and Human-Centric Computing (VL\/HCC 2010), to be held September 21-25, 2010, in Madrid, Spain, and sponsored by the IEEE Computer Society. The long-running VL\/HCC series occupies a unique niche among HCI and Programming Language conferences, in that it focuses specifically on how to help end users successfully develop and use software. The diversity and ubiquity of people's goals, interactions, and concerns with information systems is continually increasing. Not only does interactive computer software permeate many individuals' working lives, people commonly rely on computing and information systems for leisure and home activities as well. As a result, end users now expect considerable flexibility and control in their interactions with computer software. For many, it is no longer sufficient to consume the packaged software and scripted tasks developed by the professional software industry; they now must create their own computational solutions to a wide variety of problems, including spreadsheet models, web sites, educational media and simulations, automated business procedures, and visualizations. To produce such software, even for domain-specific problems, end users must look beyond surface-level interaction with computers and acquire the conceptual models and skills of computational thinking. But current advances toward computational thinking by end users are not evenly distributed across all segments of the population. Thus, this year's VL\/HCC Doctoral Consortium, the eighth to be funded by NSF in this series, will focus on expanding the benefits of computational thinking to diverse populations. Ensuring that designers of computational languages and tools consider the needs of populations historically overlooked in information technology will increase the chance that these individuals\/groups are able to learn and use the more powerful tools that are fast becoming essential to information literacy. At the same time, such efforts may lead researchers to identify new software construction metaphors and techniques that increase the usability of their languages and environments more generally. The workshop's primary goal is to stimulate graduate students' and other researchers' thinking about how varying communication media, representations, and problem-solving support affect end users' willingness and ability to access, manipulate, and program solutions to their work or everyday problems. What are the special needs of disadvantaged populations? How can computational problem-solving tools and devices be designed to meet these needs? The workshop will bring together and build community among young researchers working on different aspects of these problems from the perspectives of diverse fields including computer science, the social sciences, and education. It will guide the work of these new researchers by providing an opportunity for experts in the research field (as well as their peers) to give them advice, in that student participants will make formal presentations of their work during the workshop and will receive feedback from a faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether the results are appropriately analyzed and presented. As in prior years the VL\/HCC 2010 Doctoral Consortium will be part of the regular conference program. A 2-page extended abstract of each participant's work will be published in the conference proceedings. <br\/><br\/>Broader Impacts: The workshop will help shape ongoing and future research projects aimed at alleviating a pressing problem of relevance to a great many people within our society. This event will promote discovery and learning, by encouraging the student researchers to explore a difficult and challenging open problem, through involvement of a panel of well-known researchers whose task is to provide constructive feedback, and through inclusion of other conference participants who will also learn from and provide additional feedback to the students and to each other. The PI and the members of the organizing committee will make special efforts to attract a diverse and interdisciplinary group of student participants, with special attention paid to recruitment of women and minorities. The PI expects that most of the students supported by this award will come from U.S. universities but as in past years, due to the highly international make-up of the research community, a few non-U.S. students may be invited to participate as well. As a testament to the success of previous workshop","title":"WORKSHOP: Visual Languages and Human-Centric Computing Conference 2010 Doctoral Consortium: Democratizing Computational Tools","awardID":"1032097","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["548140"],"PO":["565227"]},"161786":{"abstract":"Various technological trends, such as faster networks, cheaper data storage, and ubiquitous data logging, have given us access to massive amounts of data. This gives rise to two fundamental questions that need to be addressed if we are to exploit this data: (a) How to process such data? Traditional models of computation and notions of efficiency need to be reconsidered when monitoring Gbps network traffic, mining petabytes of search engine data, or processing data that is distributed across multiple low-power sensors. (b) What to compute about such data? Often the data that is quickest to accumulate is data that is noisy, plagued by internal inconsistencies, or redundant. How can useful information be extracted from such data? <br\/><br\/>Over the last decade, the study of sketching (a form of compression based on linear projection) and stream computation (space-bounded computation where the input is processed sequentially) has sought to address aspects of the above questions. The research goal of this project is to initiate and pursue a variety of new directions for these computational models. These include (a) Developing a more systematic understanding of computation in the existing models by seeking broad characterizations of problem tractability and developing \"super synopses\" that solve entire families of related problems. (b) Extending and tailoring existing models in order to address a wider range of applications such as processing stochastically generated data. (c) Establishing a general and intellectually intriguing abstraction of the challenges of computing with massive data sets that subsumes sketching and stream computation.<br\/><br\/>In conjunction with these research goals, the project includes various educational and broader impact initiatives that are designed to ensure a wide dissemination of research results and to train graduate and undergraduate students.","title":"CAREER: New Directions for Sketching and Stream Computation","awardID":"0953754","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}}],"PIcoPI":["550976"],"PO":["565251"]},"163722":{"abstract":"This project seeks to build an algorithmic foundation<br\/>for the analysis of complex self-organizing systems.<br\/>Computing theory has been successful at<br\/>pinning down the computational power of<br\/>common dynamical systems, but less so<br\/>at analyzing their behavior and functionality.<br\/>Recent research points to the potential benefits<br\/>of viewing these systems as \"natural algorithms.\"<br\/>The approach is premised on the belief that<br\/>the algorithm itself is at least as important<br\/>as the data it generates and that<br\/>the current reliance on simulations and statistics<br\/>must be supplemented with analytical tools,<br\/>something akin to an ``algorithms calculus.''<br\/>The research will be oriented along the following lines:<br\/>new proof techniques and analytical tools;<br\/>communication-based algorithmic renormalization;<br\/>geometry, topology, and approximation of complex systems.<br\/><br\/>The ambition of this project is to lay<br\/>the foundations of an algorithmic theory of<br\/>complex adaptive systems. Algorithm design<br\/>has been one of the most fruitful<br\/>areas of computer science in the past few decades.<br\/>Building a bridge between this intellectual discipline<br\/>and the ever-growing area of complex systems<br\/>could potentially have a major impact on science as a whole.<br\/>Accordingly, the present project will involve<br\/>collaborations with computer scientists, control theorists,<br\/>physicists, and systems biologists.","title":"CCF: AF Analytical Tools for Natural Algorithms","awardID":"0963825","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7929","name":"COMPUTATIONAL GEOMETRY"}}],"PIcoPI":["450650"],"PO":["565251"]},"161577":{"abstract":"This research continues and extends work on subtle gaze direction - a novel technique that combines real-time eye- tracking with image-space modulation to direct a viewer's gaze about a digital image. This proposed project aims to pursue research in subtle gaze direction for dynamic scenes. This is a natural extension of viewers gaze pattern for static scenes. The work will seek improvement in search task performance. Advances in this area are important for many applications from locating anomalies in medical images to identifying camouflaged targets in a scene. The approach will use automatic feature detection algorithms. The project will also address issues relevant to improving information recall. This will involve studies to determine the impact of subtle gaze direction on spatial information recall for images and spatial-temporal information recall for dynamic scenes. The work will also explore gaze direction in the presence of more overt stimuli. <br\/><br\/>The project is designed to enable high quality interdisciplinary research that links technology design with health-based applications. The topics addressed are highly interdisciplinary and will require interaction with faculty and mentors from a number of disciplinary areas. The program will create new opportunities for undergraduates to study health and human behavior using the technology. The PI will pursue two curriculum development projects that are closely related to this research endeavor aimed at computer science and non- computer science majors. The courses are continually refined by inclusion of state-of-the- art computer graphics research and techniques. The Principal Investigator also plans to develop a new course on applied perception in graphics and visualization. In both cases, students are exposed to a broad topical area that draws upon human vision, computer graphics and visualization. The courses are expected to attract students from Rochester Institute of Technology's many programs in imaging related science.","title":"CAREER: Graphics: Gaze Manipulation","awardID":"0952631","effectiveDate":"2010-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[432160],"PO":["565227"]},"171962":{"abstract":"This proposal requests funding to assist approximately 15 US-based graduate students to travel and attend the Seventh Symposium on Networked Systems Design and Implementation (NSDI-2010), which is to be held in San Jose, CA on April 28-30, 2010. The support requested in this proposal will enable the participation of students, especially those from under-represented groups, who would otherwise be unable to attend NSDI-2010.","title":"Student Travel Support for the Seventh Symposium on Networked Systems Design and Implementation (NSDI 2010); April 2010; San Jose, CA","awardID":"1035987","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["463055"],"PO":["535244"]},"161666":{"abstract":"The goal of this research is to discover novel foundational principles<br\/>for developing highly-efficient and reliable software that can achieve<br\/>sustainable performance on the exascale computing platforms expected by<br\/>2020. Such platforms will deliver three orders of magnitude beyond<br\/>today?s systems; harnessing this raw computational power could<br\/>revolutionize our modeling and understanding of critical phenomena in<br\/>areas like climate modeling, energy, medicine, sustainability,<br\/>cosmology, engineering design, and massive-scale data analytics. Yet,<br\/>developing software for exascale systems is a tremendous challenge<br\/>because the hardware is complex and it is not believed that the most<br\/>productive ?high-level? software development environments (e.g.,<br\/>programming languages and libraries) will be able to effectively exploit<br\/>these exascale systems.<br\/><br\/>The investigator aims to address this challenge by using automated<br\/>tuning (autotuning) to eliminate the low performance traditionally<br\/>associated with high-level programming models. This research (a)<br\/>develops new model-driven frameworks for tuning parallel algorithms and<br\/>data structures, going beyond existing techniques that focus on<br\/>low-level code tuning; and (b) studies autotuning for programs expressed<br\/>in high-level programming models, with the aim of eliminating the<br\/>performance gap. Concomitant with this research, the PI will create a<br\/>new practicum course: The HPC Garage. The HPC Garage physically<br\/>co-locates interdisciplinary teams in a social collaborative lab space;<br\/>the teams engage in a year-long competition, called the XD Prize, to<br\/>develop highly scalable algorithms and software for NSF TeraGrid?s<br\/>next-generation XD facilities. The HPC Garage also hosts summer interns<br\/>in Georgia Tech?s Computing Research Undergraduate Intern Summer<br\/>Experience (CRUISE) program, whose mission is to encourage students,<br\/>especially those from underrepresented groups, to pursue graduate<br\/>degrees in computing.","title":"CAREER: Autotuning Foundations for Exascale Computing","awardID":"0953100","effectiveDate":"2010-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["558498"],"PO":["565272"]},"162634":{"abstract":"American Sign Language (ASL) is used by as many as two million people in the United States, with additional users elsewhere in North America. The purpose of this \"planning grant\" is to enable the PI and her multi-institutional team to explore the case for a possible future NSF investment in an annotated, publicly available, and easily searchable corpus consisting of terabytes of ASL video data (deriving in part from prior work by the PI and her colleagues), including diverse types of content such as dialogues, narratives, elicited sentences illustrating specific grammatical constructions, and isolated signs. The PI contends such a resource would constitute an important infrastructure that would be exploited by a broad research community to advance the fields of linguistics (the structure of ASL), computer vision (machine recognition of gestures), indexing of visual information (through the expansion of mark up vocabularies), and education. The PI notes that the potential value of the existing corpora remains largely untapped, notwithstanding their extensive and productive use by her team and others, due to hardware and software limitations that make it cumbersome to search, identify, and share data of interest. <br\/><br\/>Broader Impacts: The new resource would be easily accessible by the research community and the broader public, via a user-friendly Web-based interface. Availability of the resource online would allow ASL teachers and users, and others, to access the data directly. Users would be able to look up an unknown sign by submitting a video example of that sign. Students of ASL would be able to retrieve video showing examples of a specific sign used in actual sentences, or examples of a grammatical construction. ASL instructors and teachers of the Deaf would have easy access to video examples of lexical items and grammatical constructions as used by a variety of native signers, for use in language instruction and evaluation.","title":"Collaborative Research: II-EN: Development of Publicly Available, Easily Searchable, Linguistically Analyzed, video Corpora for Sign Language and Gesture Research","awardID":"0958247","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["522465"],"PO":["565227"]},"163900":{"abstract":"Manipulation allows a robot to alter its environment by performing mechanical work on it. Combined with locomotion, autonomous manipulation will be a key enabling capability in future robot systems for exploration, home care, military, industrial, and space applications. While most current robotic manipulation consists of simple grasp-and-carry operations, the spectrum of manipulation methods is much broader, including throwing, pushing, rolling, sliding, tapping, etc. Humans and animals make use of these methods on a daily basis, but robots do not. What is missing is a theoretical framework for combining and sequencing such manipulation methods for automatic planning and control of robotic manipulation.<br\/><br\/>This project is working toward autonomous manipulation by bridging the gap from individual robotic manipulation primitives to full manipulation sequence planning. The project is developing theoretical tools, a mechanics-based manipulation planning framework, feedback control algorithms, and an experimental manipulation testbed incorporating high-speed vision. The tools developed for autonomous planning and execution of manipulation sequences will allow future robot users to program robots at a much higher level of abstraction than currently possible. For example, instead of programming low-level control of motors, the user can simply say \"place object A on object B.\" This will help grow the field of personal robotics, by allowing non-experts to interact with robots.<br\/><br\/>International partners in this work include leading laboratories in Italy and Japan. These collaborations provide unique access for graduate and undergraduate researchers to the world's leading experts in robotic manipulation.","title":"RI: Medium: Planning and Control for Dynamic Robotic Manipulation","awardID":"0964665","effectiveDate":"2010-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8013","name":"National Robotics Initiative"}}],"PIcoPI":["522422"],"PO":["534411"]},"163922":{"abstract":"This project develops a semantic media adaptation scheme for mobile access of information that is perceptually optimized for users to enjoy semantically relevant media content using small display mobile devices. The research team explores seamless integration of multidisciplinary technologies from computer vision, media coding and transmission, wireless networking, mobile device, and human visual perception to tackle the challenges in closing the gap between rich content in high resolution and size limited mobile device access.<br\/><br\/>The intellectual merit of this project lies in the exploration and development of several relevant techniques in (1) Limited user interface media semantic extraction; (2) Capacity and resource constrained media content adaptation; (3) Perceptually optimized delivery and display of adapted media to small sized mobile devices. The research team addresses these issues by seamless integration of technologies from different research fields that traditionally have less interaction. <br\/><br\/>The project bridges both semantic gap and user intention gap in mobile multimedia search and access. First, the innovative scheme of semantic adaptation can be extended for any media search application based on semantically relevant characteristics. Second, the adaptation of high resolution media content for small sized mobile device plays a key role in media gateway for wireless mobile access. Finally, the investigation of perceptual optimized display on mobile devices shall open up a new research avenue to understand how mobile users perceive rich media content with small displays.","title":"EAGR: Perceptually Optimized Semantic Media Adaptation for Mobile Device Access","awardID":"0964797","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[438832],"PO":["564316"]},"163812":{"abstract":"The lack of predictive power over complex systems, either designed by humans or evolved by nature, is a foundational problem in contemporary science. The Internet offers a paradigmatic example:<br\/>nothing in its architecture and design explains its complex large-scale structure. Many complex networks in nature share this peculiar structural character of the Internet, but they also manifest phenomenal behavior: they efficiently route information without any observable routing communication protocol. Hence, the main objective of this project is to explore the relationship between the structure and communication function of complex networks.<br\/><br\/>An international team of researchers assembled for this project includes computer scientists from the Cooperative Association for Internet Data Analysis (CAIDA) at the University of California San Diego, and physicists from the University of Barcelona, Spain. The project includes theoretical modeling and computer simulations to discover if the Internet 30-year old interdomain topology has naturally evolved toward a structure for which nature has superior routing technology.<br\/><br\/>The intellectual merit of this project is in the utilization of this natural routing technology for infinitely scalable Internet routing with minimal communication overhead. If successful, this project will solve a long-standing theoretical problem of constructing a maximally efficient algorithm for routing in complex networks. These results may help to remove serious scaling limitations within the existing Internet routing architecture.<br\/><br\/>The broader impact is in improving our knowledge of the basic principles of organization, function, and evolution of large-scale complex networks, transforming research on how to model, predict, and control them. The elucidation of fundamental connections between network structure and function has far-reaching impact on the study of many complex systems, including search engines, recommender and reputation systems, terrorist network modeling, cancer and brain research, protein folding, and drug design.","title":"NetSE: Medium: Discovering Hyperbolic Metric Spaces Hidden beneath the Internet and Other Complex Networks","awardID":"0964236","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7794","name":"NETWORK SCIENCE & ENGINEERING"}}],"PIcoPI":["521741","560811"],"PO":["564993"]},"170798":{"abstract":"Researchers in US universities interested in working on wireless networks, both the technology and new applications, are currently unable to conduct national scale experiments. The creation of a National Wireless Test Bed using a public wireless carrier and a mechanism known as Mobile Virtual Network Operator (MVNO) may provide a suitable mechanism. A MVNO contracts with a public cellular network operator to gain access and buy time at wholesale rates. The MVNO then handles all the customer related tasks including usage contract, billing, and in some cases, provision of hardware. The concept here is to create a nonprofit MVNO aimed at supporting research. Potential benefits of a nonprofit MVNO for research include: a national scale testbed to experiment with mobile applications. There is also a possibility of the MVNO providing end-user devices, or base stations\/femtocells bound to the MVNO's network to enable experimentation at lower layers. The first step to explore this concept is to hold a workshop in Washington DC attended by representatives from all the stake holders in a Wireless National Test Bed (WiNTeB). The purpose of this workshop is to define the research areas, implementation requirements, and to provide the foundation for planning a path toward realization of the concept.","title":"CNS-CRI: Unsolicited Community Infrastructure, Wireless National Scale Test Bed (WiNTeB) Workshop","awardID":"1029079","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[457239],"PO":["565090"]},"163912":{"abstract":"This collaborative project investigates Opportunistic Sensing (OS) and Compressive Sensing (CS) in Wireless Sensor Networks (WSNs). OS refers to a paradigm in which a WSN can automatically discover and select sensor modalities and sensors based on an operational scenario, resulting in an adaptive network that automatically finds scenario-dependent, objective-driven opportunities with optimized performance. CS is a novel sensing\/sampling paradigm that goes against the common wisdom in data acquisition. Both OS and CS help improve efficient operations and performance of WSNs significantly. In particular, OS aims at reduction from space by selecting a subset of sensors and modalities for efficient data fusion, whereas CS targets reduction in sampling by selecting a subset of samples non-uniformly. Therefore, theoretical foundations and algorithms for opportunistic and compressive sensing are essential for advancing the state of the art in WSNs that not only ensure effective utilization of sensing assets but also provide robust optimal performance. This project addresses fundamental research issues from information theoretic viewpoint to evaluate joint OS and CS distortions, develop OS and collaborative CS schemes for better performance of WSNs, and cross-layer design to adapt to the non-uniform sampling in CS-based WSNs.<br\/>This project will make a significant contribution to the theory and applications of opportunistic and compressive sensing to WSNs and will have a broad and deep social impact in homeland security and defense. Under-represented and female students from different societies will be recruited, and seminars and in-house short courses will be offered to local industry via IEEE.","title":"NeTS: Medium: Collaborative Research: Opportunistic and Compressive Sensing in Wireless Sensor Networks","awardID":"0964713","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["531713"],"PO":["565303"]},"161767":{"abstract":"Recent advances in high-throughput technologies have unleashed a torrent of data with a large number of dimensions. Examples include gene expression pattern images, microarray gene expression data, protein\/gene sequences, and neuroimages. Dimensionality reduction, which extracts a small number of features by removing the irrelevant, redundant, and noisy information, is crucial for the analysis of these data. The goal of this project is to develop efficient and effective dimensionality reduction algorithms for multi-label classification. Multi-label dimensionality reduction poses a number of exciting research questions that will be studied in this project: How to fully exploit the class label correlation for effective dimensionality reduction? How to scale dimensionality reduction algorithms to large-scale multi-label problems? How to effectively combine dimensionality reduction with classification? How to derive sparse dimensionality reduction algorithms to enhance model interpretability? How to derive multi-label dimensionality reduction algorithms for multiple data sources?<br\/><br\/>To address these questions, a hypergraph spectral learning formulation will be developed for multi-label dimensionality reduction, in which a hypergraph is used to capture the class label correlation. A joint learning formulation will be developed, in which dimensionality reduction and multi-label classification are performed simultaneously. In addition, a multi-source dimensionality reduction framework is developed for learning from multiple heterogeneous data sources. <br\/><br\/>The success of this project will largely improve the state-of-the-art in dimensionality reduction for multi-label classification, and broaden this research area by opening up and addressing many new research themes. The algorithms and tools developed in this project will directly impact biological research, as they will be used to annotate FlyExpress images; FlyExpress is the only digital library of standardized fruit fly embryonic expression patterns. The educational component of this project includes developing a new curriculum that incorporates research into the classroom and provides students from under-represented groups with opportunities to participate research. Project results, including open source software and data sets will be disseminated via project Web site (http:\/\/www.public.asu.edu\/~jye02\/Project\/CAREER).","title":"CAREER: Dimensionality Reduction for Multi-Label Classification","awardID":"0953662","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["456042"],"PO":["563751"]},"163758":{"abstract":"This project develops, from the ground up, a new theoretical framework for analyzing and designing algorithms for dynamic ad-hoc wireless networks. This proposal embraces network dynamics as an opportunity to be exploited, not an adversity to be overcome. <br\/><br\/>The approach is based on four inter-related thrusts:<br\/>1. Incremental Topology Learning: Tracking changes in the network much more efficiently than re-learning entire topology, using sparse \"error graph\" representations.<br\/>2. Topology and Traffic Shaping: Controlling the \"effective\" wireless network topology so that (i) at any instant of time it appears to be highly disconnected to scheduling algorithms, but retains global connectivity over time; and (ii) modifying traffic statistics to ensure statistical spatial correlation decay.<br\/>3. Warm-starting Distributed Algorithms: Message-passing algorithms that can warm-start the optimization based on local knowledge of past solutions.<br\/>4. Proteus - A Mobile Robot Testbed: This project validates its approach via implementation on a mobile robot testbed called Proteus, which is used to optimize algorithms in a practical setting.<br\/><br\/>Broader Impact: Industry is involved in this research from the start, via the WNCG Affiliates program at UT. The research will be disseminated via publications in top-tier venues, industry interactions, and specially organized workshops. Both graduate students and undergraduate students, via a REU program at UT (with emphasis on recruiting women and minorities), get exposure to both real-world wireless networks (via the testbed), and cutting edge theory.","title":"NeTS: Medium: Collaborative Research: Shaping, Learning and Optimizing Dynamic Networks","awardID":"0963989","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["517534"],"PO":["557315"]},"157808":{"abstract":"The TeraGrid (TG) is an advanced, nationally distributed, open cyberinfrastructure (CI) comprised of supercomputing, storage, analysis, and visualization systems, data services, and science gateways, connected by high-bandwidth networks, integrated by coordinated policies and operations, and supported by computing and technology experts, that enables and supports leading-edge scientific discovery and promotes science and technology education. <br\/><br\/>The TG has enabled numerous scientific achievements in almost all fields of science and engineering. The TG is driven by researchers and educators requiring computational resources and services which would be extremely difficult or impossible to obtain in their local\/campus environments. The largest fraction of TG resources are used in the support of peer-reviewed scientific and engineering projects enabled by the advanced CI resources of the TG. However, ?small? allocations are available to any individual willing to apply. Through the coordinated capabilities of its staff, resources, and services, TG enables cutting-edge, often transformative science and engineering, by experts and expert teams of users making highly-skilled use of TG resources. In addition, the TG also supports a wider community of much larger, domain-focused groups of users that may not possess specific high-performance computing skills but who are addressing important scientific research and education problems. The broader impact of TG activities include outreach to communities beyond the traditional set of HPC users, raising the awareness of future scientists in schools and science fairs on the power of computation and data mining, and spreading TG knowledge about how to build cyberinfrastructure, and how to bring it to the user community. Advanced support joins researchers with TG experts to increase efficiency and productivity, define best practices, and create a vanguard of early adopters of new capabilities. Support for Science Gateways provides community-designed interfaces to TG resources and extends access to data collections, community collaboration tools, and visualization capabilities to a much wider audience of users. Performing transformative science and engineering on the TG depends on its resources working in concert, which requires a coordinated user support system, centralized mechanisms for user access and information, a common allocations process and allocations management, and a coordinated user environment. Underlying this user support environment, the TG maintains a robust, centrally managed infrastructure for networking, security and authentication, and operational services. In this one year extension, the TG will.<br\/>* Continue to support several resources into 2011. This includes the Track 2 systems, Pople (PSC), a shared memory system particularly useful to a number of newer users, three IA32-64 clusters and a new resource employing flash memory and virtual SMP nodes called DASH (SDSC).<br\/>* Allow high-throughput, Open Science Grid-style jobs.<br\/>* Enable exploration of interoperability and technology sharing.<br\/>* Provide a transition platform for users coming from university- or departmental-level resources.<br\/>* Support unique compute platforms and massive storage systems.<br\/>* Integrate new systems from additional OCI awards.<br\/>* Provide vigorous efforts in training, education and outreach to retain larger and more diverse communities in advancing scientific discovery.<br\/>* Engage under-represented communities, and continue to build strong partnerships in order to offer the best possible HPC learning and workforce development programs and increase the number of well-prepared STEM researchers and educators.","title":"TeraGrid Extension: Bridging to XD","awardID":"0932251","effectiveDate":"2010-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"8004","name":"Software Institutes"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7476","name":"ETF"}}],"PIcoPI":["469704","554547",421209],"PO":["525727"]},"160712":{"abstract":"New, GK-12: Infusing System Design and Sensor Technology in Education (INSIGHT)<br\/><br\/>This project integrates sensor technology with computing and information science in a standards-based science, technology, and engineering curricula. Project activities team GK-12 STEM Fellows with science, technology, and physical education teachers. Activities include both summer and academic year training in rural Kansas schools. In the summer, project staff provides fellows and teachers with training in hands-on, sensor-driven science, engineering, and technology development and appropriate pedagogical strategies. During the academic year, fellows support participating teachers in the classroom two times a week with content-specific sensor technology. The intellectual merit lies in the focus on the technology and engineering aspects of STEM education and on the use of sensors, computing, and information technology as the enabling element to facilitate hands-on technology and engineering education in areas related to telemedicine and precision agriculture.<br\/><br\/>Broader impacts include the establishment of sensor, computing, and information technology as a foundational high school skill by accelerating the integration of sensor technology content into Kansas high school science and technology classes.<br\/>The curriculum is aligned with state curriculum standards. The project is innovative because it will enhance the usefulness, practicality, and relevance of sensor technology education by linking research for fellows to high school science and technology curriculum, and provide communication and research opportunities in sensor technology for doctoral students in engineering. This project encourages participation in engineering and technology from an even wider, more diverse group of students from rural Kansas.","title":"New, GK-12: Infusing System Design and Sensor Technology in Education (INSIGHT)","awardID":"0948019","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7172","name":"GRADUATE RESEARCH FELLOWSHIPS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1101","name":"Division of GRADUATE EDUCATION","abbr":"DGE"},"pgm":{"id":"7179","name":"GRAD TEACHING FELLOWS IN K-12"}}],"PIcoPI":["495161","495164","495163","528451","475718"],"PO":["559975"]},"163803":{"abstract":"A mismatch exists in modern computer systems between the computational resources provided by emerging multicore chip-multiprocessors (CMPs) and the ability of virtual machines (VMs), such as the Java VM or Microsoft Common Language Runtime, to exploit those resources. CMP architectures will dominate the next several processor generations; meanwhile, for reasons of security and portability, software will target VMs rather than native processors. However, since modern VMs are ill-equipped to directly exploit the coarse-grained parallelism provided by CMPs, they will not experience significant performance increases with future generations of processors.<br\/><br\/>This work aims to pioneer an approach for accelerating the execution of VMs on CMPs by creating pipelined VMs which are implemented as a series of balanced programs, or pipeline stages, each executing on a distinct processor core. A pipelined VM with N balanced stages can provide an N-fold increase in performance relative to an unpipelined VM. Pipelined VMs allow programmers to benefit from multicore parallelism while writing sequential single-threaded programs.<br\/><br\/>This research agenda closely integrates theoretical work on the benefits and limits of VM pipelining, with both 1) the design and implementation of pipelines on real systems, and 2) the exploration of novel computer architectures and mechanisms. For concreteness, the research plan focuses on pipelined VMs that target high-speed networking, an area in which aggressive CMPs are already deployed in commercial and academic platforms and where publically-accessible testbeds will allow others to develop and deploy pipelined VMs of their own design.","title":"CSR: Medium: Multicore Virtual Machines for High-Speed Networking","awardID":"0964201","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["522382"],"PO":["565255"]},"163836":{"abstract":"This project develops, from the ground up, a new theoretical framework for analyzing and designing algorithms for dynamic ad-hoc wireless networks. This proposal embraces network dynamics as an opportunity to be exploited, not an adversity to be overcome. <br\/><br\/>The approach is based on four inter-related thrusts:<br\/>1. Incremental Topology Learning: Tracking changes in the network much more efficiently than re-learning entire topology, using sparse \"error graph\" representations.<br\/>2. Topology and Traffic Shaping: Controlling the \"effective\" wireless network topology so that (i) at any instant of time it appears to be highly disconnected to scheduling algorithms, but retains global connectivity over time; and (ii) modifying traffic statistics to ensure statistical spatial correlation decay.<br\/>3. Warm-starting Distributed Algorithms: Message-passing algorithms that can warm-start the optimization based on local knowledge of past solutions.<br\/>4. Proteus - A Mobile Robot Testbed: This project validates its approach via implementation on a mobile robot testbed called Proteus, which is used to optimize algorithms in a practical setting.<br\/><br\/>Broader Impact: Industry is involved in this research from the start, via the WNCG Affiliates program at UT. The research will be disseminated via publications in top-tier venues, industry interactions, and specially organized workshops. Both graduate students and undergraduate students, via a REU program at UT (with emphasis on recruiting women and minorities), get exposure to both real-world wireless networks (via the testbed), and cutting edge theory.","title":"NeTS: Medium: Collaborative Research: Shaping, Learning and Optimizing Dynamic Networks","awardID":"0964391","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550745","539208","560222"],"PO":["557315"]},"172714":{"abstract":"Sophisticated user interfaces are now technologically possible as we have moved from mouse and joystick to the stylus for the Palm, the trackwheel of the iPod, the touchscreen of the iPhone, the gesture recognition of Wii applications and immersive environments like the CAVE. The new frontier in user interfaces and interaction is that of mixed-reality applications which allow many different modes of interaction with the real and virtual worlds, and allow novel kinds of feedback from real to virtual and virtual to real. This project develops components and tools to build software components that will enable application designers to express their creativity without getting bogged down in the nitty-gritty detail of handling a variety of different input and output devices. This will enable a transformation not only in software but the way that software will be used. The tools will be evaluated by end users of the mixed reality applications and the designers for their ability to enhance creativity. More broadly, these tools will lead to new forms of communicating ideas, user interaction and collaboration. Additional impact will be achieved by broad dissemination of the research results, the open-source distribution of the tools developed by the project, and the involvement in the research of students from a broad range of economic, cultural and ethnic backgrounds.","title":"ITR-CreativeIT: Pilot: Mixed-Reality Without Tears: Tools to Support Creativity in Mixed-Reality Applications","awardID":"1040896","effectiveDate":"2010-04-21","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7788","name":"CreativeIT"}}],"PIcoPI":["557889"],"PO":["565227"]},"163826":{"abstract":"In recent years immersive real-time interactive 3D computer environments (virtual reality or VR) have become an invaluable tool for research and development, training, healthcare, commerce, communication, and education, as well as a medium for entertainment. Yet, in general, the use of current VR systems requires travel to specialized facilities in which a sophisticated infrastructure has been pre-installed at great expense. Furthermore, although fully immersive systems that allow teams of users to concurrently explore a simulated environment by walking, turning, and looking around in a natural manner are particularly useful because they provide increased realism through multisensory stimulation, current VR facilities often support only one user at a time who is constrained to explore the virtual world by means of an artificial interface or a movement metaphor that is arbitrary and awkward (e.g., treadmills or walking in place). For most people, the benefits of VR are thus relatively inaccessible and fall quite short of their promise. In this collaborative effort between Miami University and the Naval Postgraduate School, the PIs will conduct research whose goal is to develop an innovative immersive VR system that is completely portable, that will allow multiple users to be immersed simultaneously, and that can be used in any large indoor or outdoor area such as a gymnasium or parking lot. Users will be able to walk naturally for miles in a virtual world without ever becoming aware of the physical limits of the tracking space or the locations of other users. A system capable of immersing a single user will cost an order of magnitude less than current systems. To these ends the PIs will exploit two emerging techniques: redirected walking, an algorithm that imperceptibly steers users away from obstacles such as walls and which the PIs have previously shown can, given a physical area of sufficient size, enable users to navigate through a virtual world of unlimited size in a natural manner without encountering real-world boundaries and obstacles; and self contained inertial position tracking, which prior research has shown can be used to accurately monitor and track the position and orientation of the user's viewpoint in space without the need for pre-installed permanent infrastructure. In addition, the PIs will integrate into the new VR technology ultrasonic mapping and positioning, a technique commonly used in robotics to provide estimates of absolute position. <br\/><br\/>Broader Impacts: By creating VR systems that are portable and relatively inexpensive, this research will take significant steps toward making VR technology available to a much broader range of people than has heretofore been possible, providing first-hand exposure to cutting-edge concepts and models in science and technology to any population that educators or researchers chose. In particular, the work will enable students at any grade level to experience computer simulations and models by walking within them, instead of by reading about them or by viewing them as an outside observer. The synthesis of redirected walking and self-contained inertial position tracking will offer rich research potential in the computer and behavioral sciences. Implementing relative position tracking through inertial sensors and periodic position fixes instantiates a biologically plausible model of navigation and can parallel research on how humans and other animals find their way through environments.","title":"HCC: Medium: Collaborative Research: Low Cost, Portable, Multi-User, Immersive Virtual Environment Systems for Education and Training in Worlds of Unlimited Size","awardID":"0964324","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[438562,438563],"PO":["565227"]},"163837":{"abstract":"Insufficient attention has been given to enterprise Identity and Access Management (IAM) as a process that needs to be carried out on a continuing basis in the presence of change and evolution. In particular, there is little formal support for how IAM can exploit experience the enterprise collects over time. This project is developing a lifecycle model of IAM called Experience Based Access Management (EBAM) that provides a set of models, techniques, and tools to reconcile differences between the \"ideal\" access model, as judged by high-level enterprise, professional, and legal standards, and the \"enforced\" access control, specific to the operational IAM system. The principal component of an EBAM support system is an \"expected\" access model that is used to represent differences between the ideal and enforced models based on information collected from access logs and other operational information. The project is developing and validating an approach to the expected model based on using probabilistic information to inform the design of access rules. The project focuses on EBAM for hospital information systems since these are an especially important class of enterprise systems that present diverse and interesting challenges but also provide potential insight into similar issues in other types of enterprise IAM systems. The team consists of specialists in cyber security, biomedical informatics, and a physician who serves as chief medical information officer within a major hospital system. The project will demonstrate how analysis of clinical experience can address gaps between ideal and enforced access control models in a representative hospital.","title":"TC: Medium: Collaborative Research: Experience-Based Access Management (EBAM) for Hospital Information Technology","awardID":"0964392","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["553855"],"PO":["565264"]},"163749":{"abstract":"This collaborative project investigates Opportunistic Sensing (OS) and Compressive Sensing (CS) in Wireless Sensor Networks (WSNs). OS refers to a paradigm in which a WSN can automatically discover and select sensor modalities and sensors based on an operational scenario, resulting in an adaptive network that automatically finds scenario-dependent, objective-driven opportunities with optimized performance. CS is a novel sensing\/sampling paradigm that goes against the common wisdom in data acquisition. Both OS and CS help improve efficient operations and performance of WSNs significantly. In particular, OS aims at reduction from space by selecting a subset of sensors and modalities for efficient data fusion, whereas CS targets reduction in sampling by selecting a subset of samples non-uniformly. Therefore, theoretical foundations and algorithms for opportunistic and compressive sensing are essential for advancing the state of the art in WSNs that not only ensure effective utilization of sensing assets but also provide robust optimal performance. This project addresses fundamental research issues from information theoretic viewpoint to evaluate joint OS and CS distortions, develop OS and collaborative CS schemes for better performance of WSNs, and cross-layer design to adapt to the non-uniform sampling in CS-based WSNs.<br\/>This project will make a significant contribution to the theory and applications of opportunistic and compressive sensing to WSNs and will have a broad and deep social impact in homeland security and defense. Under-represented and female students from different societies will be recruited, and seminars and in-house short courses will be offered to local industry via IEEE.","title":"NeTS: Medium: Collaborative Research: Opportunistic and Compressive Sensing in Wireless Sensor Networks","awardID":"0963957","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560587"],"PO":["565303"]},"171538":{"abstract":"This CISE special project funds the organization of the CISE Broader Impacts Summit. The goals of the summit include educating the CISE community about the NSF Broader Impacts criterion how to evaluate this criterion as part of a research project. The Summit should provide researchers and educators with the opportunity to forge collaborations and build long-term partnerships that may lead to a wide range of activities with the potential to enhance CISE research projects. The Summit is to be organized by a Steering Committee that represents all CISE divisions and a range of CISE disciplines. The investigators plan to discuss, present, and subsequently develop guidance materials for the CISE computing research community on how to effectively integrate broader impact activities into research projects. <br\/><br\/>Intellectual Merit: The intellectual merit of this project will arise from the working group discussions at the summit. At the end of the summit, a report is to be developed that synthesizes both current and future ideas in each of the five broader impact categories. This should provide research based methods for CISE investigators to connect their research and broader impacts in innovative ways.<br\/><br\/>Broader Impacts: The broader impacts of this project will arise from the computing community members, by those to whom they speak about the summit, and by those who access materials created after the summit. The project includes dissemination plans to ensure the efforts from this project have an impact on future NSF projects. The impact on future NSF projects should result in significant broader impacts from CISE research projects across all five broader impact categories.","title":"Collaborative Research: Broader Impacts for Research and Discovery Summit","awardID":"1033413","effectiveDate":"2010-04-01","expirationDate":"2013-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["546219"],"PO":["564181"]},"171549":{"abstract":"This CISE special project funds the organization of the CISE Broader Impacts Summit. The goals of the summit include educating the CISE community about the NSF Broader Impacts criterion how to evaluate this criterion as part of a research project. The Summit should provide researchers and educators with the opportunity to forge collaborations and build long-term partnerships that may lead to a wide range of activities with the potential to enhance CISE research projects. The Summit is to be organized by a Steering Committee that represents all CISE divisions and a range of CISE disciplines. The investigators plan to discuss, present, and subsequently develop guidance materials for the CISE computing research community on how to effectively integrate broader impact activities into research projects. <br\/><br\/>Intellectual Merit: The intellectual merit of this project will arise from the working group discussions at the summit. At the end of the summit, a report is to be developed that synthesizes both current and future ideas in each of the five broader impact categories. This should provide research based methods for CISE investigators to connect their research and broader impacts in innovative ways.<br\/><br\/>Broader Impacts: The broader impacts of this project will arise from the computing community members, by those to whom they speak about the summit, and by those who access materials created after the summit. The project includes dissemination plans to ensure the efforts from this project have an impact on future NSF projects. The impact on future NSF projects should result in significant broader impacts from CISE research projects across all five broader impact categories.","title":"Collaborative Research: Broader Impacts for Research and Discovery Summit","awardID":"1033485","effectiveDate":"2010-04-01","expirationDate":"2012-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["516895"],"PO":["564181"]},"161638":{"abstract":"This project addresses the design of machine learning algorithms enabling content-based image retrieval in Web-scale collections of photos. This research formulates image retrieval as a binary classification problem: decide which database images are the \"same\" as the user-provided photo. Efficiency and scalability to large collections are achieved by constraining the classifiers to be models supported by traditional text-search engines, which perform real-time search in databases of several billion documents. In order to implement search based on high-level notions of similarity, the research team develops methods to automatically localize the most content-relevant regions in the input photo and to extract from them semantically powerful classifiers combining appearance cues with robust geometric constraints. The algorithms learn from user-provided labels indicating the presence but not the location of similar visual content, thus requiring a minimal amount of human supervision. This research investigates also how this advanced form of similar-image search can be used to organize personal photos, provide semantic annotations, and support content-based clustering of pictures. Furthermore, this work provides technical advances in a wide range of computer vision problems including object detection, visual saliency, and content-based clustering of photos. Moreover, the research team is collecting an unprecedentedly large image data set to evaluate the developed image retrieval system and to be available to the community. Research is naturally integrated with education and outreach by means of related courses and out-of-classroom activities aimed at attracting students to this field and at encouraging interdisciplinary collaborations.","title":"CAREER: Learning Models for Scalable Content-Based Image Retrieval","awardID":"0952943","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[432284],"PO":["564316"]},"171869":{"abstract":"This is funding to support a consortium (workshop) of approximately 12 promising doctoral students from the United States and abroad, along with 5 distinguished research faculty. The event will take place on Sunday, October 24, immediately preceding and in conjunction with the Twelfth ACM SIGACCESS Conference (ASSETS 2010), to be held Monday-Wednesday, October 25-27, in Orlando, and sponsored by the ACM Special Interest Group on Computers and Accessibility. The ASSETS conference is the premier forum for presenting research outcomes and innovations in software and technology designed to address the special needs of persons with disabilities and older adults. Researchers and developers from around the world in both academia and industry will meet to exchange ideas and present their latest work on the design and use of mainstream and specialized assistive technologies relating to speech, motor, hearing, and vision impairments, cognitive limitations, emotional and learning disabilities, and aging. More information about the conference may be found at http:\/\/www.sigaccess.org\/assets10. <br\/><br\/>A key component of building this community is through its youth. The ASSETS 2010 doctoral consortium will provide an opportunity for graduate students from diverse backgrounds (computing, engineering, psychology, architecture, etc.) to come together and explore their research interests in an interdisciplinary workshop, under the guidance of the PI and a panel of other distinguished experts in the field, so that they can appreciate the broader spectrum of research and development approaches to assistive technologies and universal usability, and also experience the community in which they can pursue their endeavors. Student participants will make formal presentations of their work during the consortium, and will receive constructive feedback from the faculty panel. The feedback is designed to help students understand and articulate how their work is positioned relative to related research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Thus, the consortium will help shape ongoing and future research projects aimed at assistive technologies and universal access, will promote scholarship and networking among new researchers in this emerging interdisciplinary area, and will also expose these promising young researchers to a larger community. A session has been set aside during the main conference to allow doctoral consortium participants to present to the entire conference, and one student from the doctoral consortium will be selected to deliver the closing plenary presentation. The organizers will take special steps to promote participation from institutions with relatively large numbers of students from underrepresented groups. An evaluation of the consortium will be conducted, and the results made available to the organizers of future such events. <br\/><br\/>Broader Impacts: The doctoral consortium will help expand the participation of young researchers pursuing graduate studies in this field, by providing them an opportunity to gain wider exposure in the community for their innovative work and to obtain feedback and guidance from senior members of the research community. It will further help foster a sense of community among these young researchers, by allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field. The organizers will also take special steps to promote participation from institutions with relatively large numbers of students from under-represented groups.","title":"Doctoral Consortium for ASSETS 2010","awardID":"1035382","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["475201"],"PO":["565227"]},"163905":{"abstract":"This is a study of tagging, the assignment of labels to information objects by users, and the \"folksonomy\" categorization systems that can result. By the 19th Century, increasing amounts of information were being published, and it was clear that efficient methods of organization were needed for the information to be accessible. In response, categorization schemes like the Library of Congress Classification and the Dewey Decimal System were invented. The overall information dissemination system contained clear roles and divisions of labor: editors decided what got published, information professionals categorized published works, and most people simply consumed the results. The Internet has toppled this traditional approach. There is no publication barrier, so orders of magnitude more information is available online and information professionals cannot keep up. However, new technologies have arisen that work in this context, notably tagging. Any user can associate tags with items such as documents, movies, or photos, and the tags serve as keys for retrieval. Since tags can be created by any user, the number of tags contributed scales with a community's size: thus, tagging works at Internet scale. Tagging lets users represent their own perspectives, which aids retrieval.<br\/><br\/>However, tagging is a young technology, with significant challenges and unmet potential. Individual tags are often of poor quality, and many tagging systems are globally incoherent. Empirical evaluations of tagging systems in use are few, and formal comparisons to traditional approaches have not been done. Tagging applications have been limited mainly to search. This project addresses these challenges. It will develop a firmer scientific understanding of the strengths and weaknesses of tagging as a categorization method. It will explore the potential of tagging to enable powerful applications beyond information retrieval. The project consists of three main research activities: (1) Creating a set of metrics to quantify the value of a categorization structure; using these metrics in formal and empirical comparisons of tagging systems to traditional categorizations; (2) Designing mixed-initiative interaction techniques for computational agents and people to detect, evaluate and resolve problems in tagging systems; (3) Developing novel tag-based applications for users to express their preferences and navigate complex information spaces.<br\/><br\/>This research will create both information-theoretic and usage-based metrics to measure the value of a categorization structure. Studies will be done to show relations between the two types of metric, letting designers predict, for example, how many tags per item are required for effective user search. Systematic cost-benefit comparisons of tagging systems to traditional expert categorizations will be done, thus providing empirical data to a debate that has been characterized by heated conjecture. The utility and generality of a set of mixed-initiative interaction techniques and novel applications will be established by (a) implementing them in multiple platforms, and (b) evaluating them in careful field experiments.<br\/><br\/>Improving the effectiveness of tagging will help millions of users find the information, products, and services they seek. More directly, the techniques of this project will be implemented in four working online communities, for movie viewers, cyclists, ethics researchers, and politically interested citizens. Collectively these sites have tens of thousands of users, all of whom will benefit directly. Many students will be trained, learning multiple research methods and gaining valuable experience with real online communities. Finally, the software will be developed under an open source license and datasets will be published, thus facilitating other researchers and web site developers in their work.","title":"HCC: Medium: Collaborative Research: Guiding Folksonomy Development to Enable Novel Tagging Applications","awardID":"0964695","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["518491","483488"],"PO":["564456"]},"162607":{"abstract":"This project is developing new simulation frameworks for the ns-3 discrete-event network simulator, a free and open-source research tool designed for use by computer communications network researchers. Simulation remains in heavy use for network research and education, because of its ease of use, reproducibility, availability, scalability, and ease of software development. However, the workflow of a typical simulation study requires the user's careful attention to a number of best practices in methodology to ensure that the results are credible and reproducible by third parties and that errors are not introduced. This project is building an automation framework for the ns-3 simulator that provides an environment that is more conducive to the creation of rigorous studies. The automation framework guides the user to produce valid network simulation models by composition and consistency checking, and definition of experimental settings. The framework exercises control over large-scale simulation studies, and applies statistical methods for output data analysis and execution control. The framework also collect details required to reproduce the experiment and report results. The framework also allows users to specify wide ranges of simulation network topologies, application traffic, and other parameters, allowing experiments to be conducted on a wide range of scenarios with minimal effort. Finally, maintaining the ns-3 software, documentation, and dissemination activities continue. The additions to ns-3, disseminated as open source software, are improving the methodology and credibility for future simulation-based network research.","title":"CI-ADDO-EN: Frameworks for ns-3","awardID":"0958139","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["529904","429182"],"PO":["564993"]},"170803":{"abstract":"This award supports U.S. participation in a U.S.-Japan workshop on rescue robots to be held at Texas A&M University?s Disaster City on March 8-11, 2010. The workshop will be organized in conjunction with the National Institute of Standards and Technology (NIST) Response Robot Evaluation Exercise #6 and builds on an August 2008 U.S.-Japan workshop on robotics for safety, security and better quality of life. The award supports travel for six U.S. research teams, with one senior researcher and two student assistants per team, to the workshop. Professor Satoshi Tadokoro of Tohoku University Department of Information Sciences is the lead Japanese collaborator. <br\/><br\/>The TAMU meeting offers U.S. researchers in rescue robots (platforms, sensors, human-robot interactions) an uncommon opportunity to improve their understanding of real-world domains by testing their robots and sensors with NIST standards at the unique facility at Disaster City and obtaining feedback from responders. The workshop is expected to contribute to the theory of rescue robots and establish new collaborations. It fosters U.S.-Japan collaborations through fieldwork, presentations and information interactions. Recent earthquakes in Haiti and Chile make the workshop especially timely. The Directorate for Computer and Information Science & Engineering Division of Information and Intelligent Systems cofunded this award.","title":"NSF-JST-NIST Workshop on Rescue Robotics","awardID":"1029089","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["565226"],"PO":["399099"]},"161849":{"abstract":"Graphs and networks are ubiquitous, encoding complex relationships <br\/>ranging from chemical bonds to social interactions. Hidden in these<br\/>networks are the answers to many important questions in biology,<br\/>business, and sociology. In order to analyze complex networks, users <br\/>have to master sophisticated computing and programming skills. It <br\/>indeed becomes a pain point for many scientists and engineers.<br\/><br\/>This project is to change the state of the art by developing a <br\/>general graph information system, which is able to address the needs <br\/>of searching and mining complex networks. Real-life networks are <br\/>complex, not only having topological structures, but also containing <br\/>heterogeneous contents and attributes associated with nodes and <br\/>edges. The mixture of structures and contents raises two challenges <br\/>that require new solutions for smarter and faster graph analysis. <br\/>First, new types of graph search and mining operations, such as graph <br\/>aggregation, graph association, and graph pattern mining, are <br\/>emerging. Second, when graphs become complex and large, most of <br\/>existing graph mining algorithms cannot scale well. <br\/><br\/>This project addresses these challenges and performs a <br\/>comprehensive study of a general graph information system. <br\/>The system includes three major components: complex graph search, <br\/>graph pattern mining, and graph indexing. <br\/>It covers emerging structure queries in social, <br\/>biological, and information networks, new graph mining operators <br\/>such as graph summarization and association, and innovative indexing<br\/>methodologies, e.g., differential graph index.<br\/><br\/>This research is tightly integrated with education through student <br\/>mentoring and curriculum development. Publications, software and <br\/>course materials resulted from this project are disseminated on the <br\/>project website: http:\/\/www.cs.ucsb.edu\/~xyan\/gis.html.","title":"CAREER: Graph Information System: Deciphering Complex Networks","awardID":"0954125","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[432722],"PO":["563727"]},"162608":{"abstract":"This project is developing new simulation frameworks for the ns-3 discrete-event network simulator, a free and open-source research tool designed for use by computer communications network researchers. Simulation remains in heavy use for network research and education, because of its ease of use, reproducibility, availability, scalability, and ease of software development. However, the workflow of a typical simulation study requires the user's careful attention to a number of best practices in methodology to ensure that the results are credible and reproducible by third parties and that errors are not introduced. This project is building an automation framework for the ns-3 simulator that provides an environment that is more conducive to the creation of rigorous studies. The automation framework guides the user to produce valid network simulation models by composition and consistency checking, and definition of experimental settings. The framework exercises control over large-scale simulation studies, and applies statistical methods for output data analysis and execution control. The framework also collect details required to reproduce the experiment and report results. The framework also allows users to specify wide ranges of simulation network topologies, application traffic, and other parameters, allowing experiments to be conducted on a wide range of scenarios with minimal effort. Finally, maintaining the ns-3 software, documentation, and dissemination activities continue. The additions to ns-3, disseminated as open source software, are improving the methodology and credibility for future simulation-based network research.","title":"CI-ADDO-EN: Frameworks for ns-3","awardID":"0958142","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434515],"PO":["564778"]},"161806":{"abstract":"This CAREER award investigates how humans integrate a wide variety of <br\/>information sources to achieve rapid, accurate natural language <br\/>comprehension subject to the physical and cognitive constraints under <br\/>which it takes place. The project's primary empirical focus is on <br\/>reading, a mode of information exchange of unexceeded importance in <br\/>literate societies. Reading involves a rapid sequence of targeted eye <br\/>movements throughout a text -- recordable through modern eye-tracking <br\/>technology -- from which noisy sensory input are obtained and <br\/>integrated with prior knowledge to resolve perceptual and linguistic <br\/>uncertainty. The central goal of this project is thus to develop, <br\/>implement, and test a computational model of language comprehension <br\/>and eye movement control in reading built on principles of <br\/>probabilistic inference and rational action, using the tools of <br\/>natural language processing (NLP) technology, reinforcement learning, <br\/>and behavioral psycholinguistic experimentation.<br\/><br\/>The success of this project is likely to have major impact in the <br\/>field of human sentence processing, bringing a new level of nuance and <br\/>detail to both theory and data analysis, and will bear on broad <br\/>current debates in cognitive science regarding rationality in <br\/>cognition. Additionally, the results of this basic research project <br\/>have a wide range of potential applications ranging from intelligent <br\/>tutoring technology to language-impairment diagnosis to cognitive <br\/>ergonomics. Together with this research program, the project involves <br\/>an educational program including a new textbook on probabilistic <br\/>models in the study of language, new undergraduate and graduate <br\/>courses, and tutorials and courses on computational psycholinguistics <br\/>at major conferences and summer institutes.<br\/><br\/>This CAREER award is co-funded by two directorates:: CISE\/IIS and SBE\/BCS.","title":"CAREER: Rational Language Processing with Uncertain and Noisy Input","awardID":"0953870","effectiveDate":"2010-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"7252","name":"PERCEPTION, ACTION & COGNITION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[432631],"PO":["565215"]},"161707":{"abstract":"Robots today can assist surgeons and explore space; however, they cannot be trusted to drive autonomously in a real city. Robots either perform simple or hard-coded tasks fully autonomously or they operate with close human supervision. While most of the sensing and actuation technology exists, what is lacking is the ability to provide guarantees for safety and correctness of a robot's high-level, autonomous behavior.<br\/><br\/>The objective of this project is to develop mathematical formalisms and algorithms that will provide guarantees for the success of a high-level task, specified by a human using temporal logic and performed by a robot operating in an uncertain world. These techniques will pave the way towards creating truly correct autonomous robots thus making a significant impact in our community. <br\/><br\/>Specifically, the PI is developing mathematical theory, algorithms and open-source tools to address the following challenges: <br\/>(i) When a robot task is infeasible determine and communicate why it cannot be achieved;<br\/>(ii) Given known bounds on sensor and action uncertainties, provide offline guarantees for task success; <br\/>(iii) Provide online guarantees and task progress as new information regarding the workspace is gathered.<br\/><br\/>Broader impacts of the project include: (i) building a community of researchers interested in formal methods for robotics and automation, and (ii) increasing the number of women pursuing an engineering career. For the former, undergraduate and graduate students are mentored, two courses taught by the PI are enhances and workshops are organized. For the latter, the PI is designing and supervising a robotics-based project for female high school students during a summer program, and is working to recruit women through recruiting weekends and a series of talks at other institutions.","title":"CAREER: Formal Methods for Robotics and Automation","awardID":"0953365","effectiveDate":"2010-04-15","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["553547"],"PO":["565255"]},"163907":{"abstract":"This is a study of tagging, the assignment of labels to information objects by users, and the \"folksonomy\" categorization systems that can result. By the 19th Century, increasing amounts of information were being published, and it was clear that efficient methods of organization were needed for the information to be accessible. In response, categorization schemes like the Library of Congress Classification and the Dewey Decimal System were invented. The overall information dissemination system contained clear roles and divisions of labor: editors decided what got published, information professionals categorized published works, and most people simply consumed the results. The Internet has toppled this traditional approach. There is no publication barrier, so orders of magnitude more information is available online and information professionals cannot keep up. However, new technologies have arisen that work in this context, notably tagging. Any user can associate tags with items such as documents, movies, or photos, and the tags serve as keys for retrieval. Since tags can be created by any user, the number of tags contributed scales with a community's size: thus, tagging works at Internet scale. Tagging lets users represent their own perspectives, which aids retrieval.<br\/><br\/>However, tagging is a young technology, with significant challenges and unmet potential. Individual tags are often of poor quality, and many tagging systems are globally incoherent. Empirical evaluations of tagging systems in use are few, and formal comparisons to traditional approaches have not been done. Tagging applications have been limited mainly to search. This project addresses these challenges. It will develop a firmer scientific understanding of the strengths and weaknesses of tagging as a categorization method. It will explore the potential of tagging to enable powerful applications beyond information retrieval. The project consists of three main research activities: (1) Creating a set of metrics to quantify the value of a categorization structure; using these metrics in formal and empirical comparisons of tagging systems to traditional categorizations; (2) Designing mixed-initiative interaction techniques for computational agents and people to detect, evaluate and resolve problems in tagging systems; (3) Developing novel tag-based applications for users to express their preferences and navigate complex information spaces.<br\/><br\/>This research will create both information-theoretic and usage-based metrics to measure the value of a categorization structure. Studies will be done to show relations between the two types of metric, letting designers predict, for example, how many tags per item are required for effective user search. Systematic cost-benefit comparisons of tagging systems to traditional expert categorizations will be done, thus providing empirical data to a debate that has been characterized by heated conjecture. The utility and generality of a set of mixed-initiative interaction techniques and novel applications will be established by (a) implementing them in multiple platforms, and (b) evaluating them in careful field experiments.<br\/><br\/>Improving the effectiveness of tagging will help millions of users find the information, products, and services they seek. More directly, the techniques of this project will be implemented in four working online communities, for movie viewers, cyclists, ethics researchers, and politically interested citizens. Collectively these sites have tens of thousands of users, all of whom will benefit directly. Many students will be trained, learning multiple research methods and gaining valuable experience with real online communities. Finally, the software will be developed under an open source license and datasets will be published, thus facilitating other researchers and web site developers in their work.","title":"HCC: Medium: Collaborative Research: Guiding Folksonomy Development to Enable Novel Tagging Applications","awardID":"0964697","effectiveDate":"2010-04-15","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[438787],"PO":["564456"]},"161818":{"abstract":"The long-term research goal is to develop novel data mining<br\/>technologies to elucidate the structures and dynamics of complex<br\/>but ubiquitous networks. A complex network is a large system<br\/>of elements (vertices) that are joined by non-trivial relationships<br\/>(edges). Examples of such complex networks include the WWW,<br\/>metabolic and protein networks, social networks, and economic<br\/>and financial markets. The underlying principles and laws of these<br\/>network systems can help us construct more effective<br\/>communication mechanisms, find cures for fatal diseases, and<br\/>deal with economic crises.<br\/><br\/>In spite of the significant advances that have been made towards<br\/>understanding the fundamental laws that govern the structure and<br\/>behavior of complex networks, there is still a disconnect between<br\/> current analytical techniques and their applicability to real-world<br\/>complex networks. A principled approach is lacking to systematically<br\/>analyze a single large complex network and link system behaviors to<br\/> network structure. There is also immediate and crucial need for a<br\/>theoretical framework to understand the relationships between<br\/>multiple networks, which is the key for comparative network analysis. <br\/>How to integrate and leverage the rich system data, such as<br\/>measurement time series, associated with network topology to study<br\/>complex systems is still an open question. This project addresses<br\/>these issues by: 1) developing novel graph and information<br\/>theoretical approaches to extracting network backbones which both<br\/>simplify and highlight network structures; 2) developing information<br\/>theoretical network distance measures and clustering algorithms for<br\/>comparative network analysis; 3) applying causality inference and<br\/>network modularity to integrate time series with network topology.<br\/>The proposed mining methodologies build upon an innovative blend<br\/>of graph theoretical, information theoretical, and statistical learning<br\/>concepts and techniques, and can greatly expand the reach of<br\/>data mining. This project will also help us better analyze the<br\/>emerging complexity, heterogeneity, and large scale of real-world<br\/>complex network data.<br\/><br\/>In a close collaboration with domain experts from social and political<br\/>sciences, software engineering, and bioinformatics, the proposed<br\/>techniques have the potential to help understand how human society is<br\/>organized at the individual level (social networks) and organizational<br\/>level (political science); illuminate how large scale software systems<br\/>form and evolve; reveal the organizational principles of biocellular<br\/>systems in a dynamic environment; and identify therapeutic or drug<br\/>targets. Using the popular online social networks, such as MySpace<br\/>and Facebook, as ``hooks'', this project will attract, recruit, and<br\/>prepare students from underrepresented groups including women<br\/>and minorities to computer science and involve underrepresented<br\/>students in the cutting-edge research.<br\/><br\/>For further information see the project web page at:<br\/>http:\/\/www.cs.kent.edu\/~jin\/NSFCAREER\/","title":"CAREER: Novel Data Mining Technologies for Complex Network Analysis","awardID":"0953950","effectiveDate":"2010-04-01","expirationDate":"2015-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["532222"],"PO":["565136"]},"163908":{"abstract":"JavaScript is the lingua franca of modern Internet computing. Unlike traditional code, JavaScript is highly dynamic and malleable. While JavaScript is increasingly used in security-critical applications that manipulate sensitive information like banking information and social security numbers, Web browsers' sandboxing mechanism for JavaScript (the \"same-origin policy\") is too coarse to adequately secure \"mashups\" that combine code at runtime from mutually distrusting origins.<br\/><br\/>This project provides tools to secure JavaScript applications from buggy or malicious code by enforcing security policies, written by developers and users, that specify what code should be trusted and what data must be protected.<br\/><br\/>Faced with dynamic applications like mashups, traditional enforcement mechanisms call for either one incomplete initial analysis or expensive from-scratch re-analysis whenever code is added. This project instead introduces staged program analysis. At each stage, as much analysis as possible is performed as possible given the known code; the remainder of the analysis computation is deferred until more code becomes available.<br\/><br\/>The system, implemented in a browser and evaluated on real Web sites, must be scalable enough to use with complex, popular sites; precise enough to produce few false positives; efficient enough to run on end users' browsers without noticeable performance degradation; and user-friendly in minimizing user intervention and providing a faithful rendition of protected sites.<br\/><br\/>For users, the project will make Web 2.0 applications safer and more reliable, without degrading the browsing experience. For developers, it will provide early error detection and the guarantee of safe execution for dynamic Web 2.0 applications.","title":"TC: Medium: Securing JavaScript Web Applications via Staged Policy Enforcement","awardID":"0964702","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["529115","521726","521727"],"PO":["565264"]},"163809":{"abstract":"Computational photography refers broadly to sensing strategies and algorithmic techniques that enhance or extend the capabilities of digital photography. Representative techniques include high dynamic range (HDR) imaging, flash-noflash imaging, panoramic stitching, and refocusable photography. Although interest in computational photography has steadily increased among graphics and vision researchers, progress has been hampered by the lack of a portable, programmable camera platform with enough image quality and computing power to be used outside the laboratory, i.e. for everyday photography. Similarly, courses in computational photography are offered in dozens of universities nationwide. However, none of these courses provide students with a camera on which they can implement the algorithms currently being published in the literature.<br\/><br\/>To address these two problems, we are building an open-source camera platform (called Frankencamera) that is portable, self-powered, connected to the Internet, and accommodates SLR-quality lenses and sensors. We also describe a software architecture based on Linux, and an API with bindings for C++, that permits control and synchronization of camera functions at the microsecond time scale. Our API includes pre-capture functions like metering and focusing, an image post-processing pipeline, a user interface toolkit for the viewfinder, and support for current and future I\/O devices. Our plan is to distribute this platform at minimal cost to researchers and university instructors nationwide, using the computational photography courses they already teach as a natural distribution vehicle. Instructors will apply to us to be part of this outreach program, and a standing committee will evaluate these applications. Our long-term goal is to spur creation of a community of photographer-programmers who write plug-ins and apps for cameras.","title":"III: Medium: Collaborative Research: Frankencamera - an open-source Camera for Research and Teaching in Computational Photography","awardID":"0964218","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[438512,438513],"PO":["565227"]},"159290":{"abstract":"The University of California-Santa Barbara proposes to create a program that integrates computing education with topics -- Mesoamerican culture and conservation of endangered species -- that are culturally relevant and attractive to Latina\/os and females and their families. The focus is not on ecology or cultural studies as an end, but rather as a means to interest students in computing. The themes will motivate students from the targeted groups to excel in school, attend college, and choose computing as a career. The goal is to attract new students, students who are not already interested in computing. The program will include a summer program, in conjunction with long-term mentoring, advising, and tracking. Over the course of the 4 week summer program, students will learn about culture, history, and conservation as motivators for the real goal: learning about computer science. Participants will then use programming and web technology to create and share art, stories, and games with their peers and their parents through the eVoices web site. A comprehensive follow-up plan will engage and retains students from middle school through university with hierarchical mentoring and support from existing university programs (Pathways). The approach, if successful, can be replicated at many institutions using different culturally-relevant topics that appeal to their target populations.","title":"BPC-DP:Animal Tlatoque: A Synergy between Mesoamerican Cultural History and Endangered Species to attract and retain Latina\/os and Females in Computer Science","awardID":"0940491","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425826,"528013",425828],"PO":["561855"]},"159281":{"abstract":"Mississippi State University (MSU) proposes a project to increase the number of students entering and graduating from degree programs in Computer Science, Computer Engineering, Software Engineering, and Business Information Systems at four institutions of higher learning in the Mississippi. The project will have four major components:<br\/><br\/>(1) A Leadership Experience in Computing program, focusing on the transition from community colleges into 4 year programs. It will provide full summer school scholarships to community college students, enabling them to take two college credit courses, one an iPhone\/iPod Touch programming class, designed specifically to show that programming can be interesting and fun, and the other, a service-oriented class that shows how computing fits into a variety of career paths. <br\/><br\/>(2) A Career Advisory Council that will engage local employers in order to get commitments to provide internships, interviews, and jobs for project graduates.<br\/><br\/>(3) A recruiting campaign that will educate high school, community college, and undergraduate students on the wide range of career options in computing related fields. <br\/><br\/>(4) The development of a community college-to-university articulation agreements.<br\/><br\/>The project will leverage existing relationships - between the participating community colleges and Mississippi's secondary schools, and between MSU and existing employers - to develop a seamless pathway between Mississippi's system of fifteen community colleges and MSU.","title":"BPC-DP: Defining a Complete Educational Path to a Computing Degree","awardID":"0940470","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[425802,425803,425804,425805,425806],"PO":["561855"]},"159297":{"abstract":"The University of Pennsylvania proposes to develop and deploy a new CS service-learning course at the college level which will be integrated with the cascading mentoring of high and middle school students. The course - called College Service Learning Course to Promote and Increase COMPutational Thinking and ACTion (Penn COMP-ACT) - will train college students to teach K-12 computational activities. Penn COMP-ACT undergraduates will learn about computational thinking, and then they will teach and mentor high school and middle students in coordinated summer workshops and afterschool programs. The high school students will be engaged to work with the middle school students as well. This \"learning-by-teaching\" approach will improve all of the student's understanding of computational thinking and purposes by exposure to a variety of hands-on software design activities and materials. The Penn COMP-ACT course leverages several prior successful efforts including a pilot service-learning course set up in the CS course program, and the existing partnerships and programs within CS and Penn to recruit girls and minorities from the local community. It will be lead by an interdisciplinary team of computer scientists, computer science and K-12 educators.","title":"BPC-DP: Penn COMP-ACT: A College Service Learning Course to Promote and Increase COMPutational Thinking and ACTivities in Afterschool and Summer Programs","awardID":"0940511","effectiveDate":"2010-04-01","expirationDate":"2014-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["541878","526230",425848,425849,425850],"PO":["561855"]},"172070":{"abstract":"Number: 0634907<br\/>Institution: Georgia Tech Research Corporation - GA Institute of Technology<br\/>PI: Basu, Saugata <br\/>Title: Algorithmic Problems in Semi-algebraic Geometry and Topology<br\/><br\/>Abstract:<br\/><br\/>Algorithmic semi-algebraic geometry lies at the heart of many problems in several different areas of computer science and mathematics including discrete and computational geometry, robot motion planning, geometric modeling, computer-aided design, geometric theorem proving, mathematical investigations of real algebraic varieties, molecular chemistry, constraint databases etc. A closely related subject area is quantitative real algebraic geometry. Results from quantitative real algebraic geometry are the basic ingredients of better algorithms in semi-algebraic geometry and play an increasingly important role in several other areas of computer science: for instance, in bounding the geometric complexity of arrangements in computational geometry, computational learning theory, proving lower bounds in computational complexity theory, convex optimization problems etc. As such algorithmic and quantitative real-algebraic geometry has been an extremely active area of research in recent years.<br\/><br\/>The main research objectives would include, development of new techniques in real algebraic geometry that would lead to new and better algorithms, for computing topological invariants of semi-algebraic sets in theory, as well as practice, and bringing methods and techniques of algorithmic real algebraic geometry to bear on several open problems in discrete and computational geometry and to explore new connections, especially in the area of computational topology. The educational goals involve, developing an integrated cross-disciplinary curriculum suitable for advanced under-graduate and beginning graduate students, requiring no pre-requisite beyond college-level calculus and linear algebra, so that that they can quickly absorb the mathematical background necessary for this line of research. The broader impact of the proposed activity would include training of new graduate students in the field of algorithmic semi-algebraic geometry, as well as collaborative research spanning several different areas: real algebraic geometry, discrete and computational geometry, symbolic computation and computational complexity theory.","title":"Algorithmic Problems in Semi-algebraic Geometry and Topology","awardID":"1036361","effectiveDate":"2010-04-15","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["550244"],"PO":["565157"]},"169023":{"abstract":"The International Conference on Social Computing, Behavioral Modeling, and Prediction provides an interdisciplinary platform to encourage researchers of traditionally disjoint fields such as sociology, psychology, behavioral science, cognitive science, mathematics, computer science, religious studies, and engineering to exchange ideas and findings, enhance mutual understanding of state&#8208;of&#8208;the art development in individual fields, develop cross&#8208;discipline awareness, promote collaborative research opportunities, and offer a conducive environment for graduate students.<br\/><br\/>In the last few years, the emergence of the social web has had a profound influence on computing and on society. A pertinent example stems from social networks where individuals from various cultural and social backgrounds interact and exchange information. In such a scenario, it will be useful to understand the development of such social networks and the behavior of individuals who are part of such networks to gain insight into different cultures and patterns of social behavior that can form the basis for predictive models. The focus of this workshop is not only on applications pf social computing but also on the encompassing research from varied areas that can provide insight. Computer scientists are key members of this community of researchers but social scientists are integral as well.<br\/><br\/>This is the third event in a series on this topic and it has developed into an international conference. The conference provides a common ground for emerging research topics in the area. This conference will create awareness among the community about the uses of such research to various areas and will result in a proceedings published as a book by Springer.","title":"NSF Conference Sponsorship for the Third International Conference on Social Computing, Behavioral Modeling, and Prediction","awardID":"1019597","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7603","name":"SCIENCE, TECH & SOCIETY"}}],"PIcoPI":["517806"],"PO":["565227"]},"166088":{"abstract":"This award supports a Doctoral Consortium (DC) at the 2010 Conference on Open Source Systems (OSS 2010) to be held May 30, 2010 at Notre Dame. The OSS 2010 conference will bring together a wide range of researchers from the fields of software engineering, information systems, social science, and information science. This conference is a critical link between researchers who study the more formal practices of software engineering and those who study the often less formal practices of the Open Source Software movement. The focus of the OSS 2010 DC is the intellectual content of the participants' doctoral dissertations. These dissertations represent state-of-the-art research in the study and development of complex software systems. Established faculty will participate in the DC as mentors to provide critical feedback on the participants' research. Participation in the DC will develop an intellectual community in a critically important research area. Organizers will work to cultivate diverse participation on several dimensions (nationality, scientific discipline, gender, institutional affiliation, and under-represented status).","title":"Travel support for the OSS 2010 Doctoral Consortium","awardID":"1005183","effectiveDate":"2010-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["565342"],"PO":["565342"]}}