{"157696":{"abstract":"The objective of this research is to develop methods for the operation and design of cyber physical systems in general, and energy efficient buildings in particular. The approach is to use an integrated framework: create models of complex systems from data; then design the associated sensing-communication-computation-control system; and finally create distributed estimation and control algorithms, along with execution platforms to implement these algorithms. A special emphasis is placed on adaptation. In particular, buildings and their environments change with time, as does the way in which buildings are used. The system must be designed to detect and respond to such changes. <br\/><br\/>The proposed research brings together ideas from control theory, dynamical systems, stochastic processes, and embedded systems to address design and operation of complex cyber physical systems that were previously thought to be intractable. These approaches provide qualitative understanding of system behavior, algorithms for control, and their implementation in a networked execution platform. Insights gained by the application of model reduction and adaptation techniques will lead to significant developments in the underlying theory of modeling and control of complex systems.<br\/><br\/>The research is expected to directly impact US industry through the development of integrated software-hardware solutions for smart buildings. Collaborations with United Technologies Research Center are planned to enhance this impact. The techniques developed are expected to apply to other complex cyber-physical systems with uncertain dynamics, such as the electric power grid. The project will enhance engineering education through the introduction of cross-disciplinary courses.","title":"CPS: Medium: Collaborative Research: GOALI: Methods for Network-Enabled Embedded Monitoring and Control for High-Performance Buildings","awardID":"0931416","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["537010","560356"],"PO":["564778"]},"159313":{"abstract":"Prairie View A&M University (PVAMU) proposes a project, entitled \"Building Computing Aptitude, Confidence, and Engagement for Students (Computing ACES).\" Computing ACES aims to increase the number of high school students, especially underrepresented minorities and women, who enroll in computer science and computer engineering programs. Computing ACES will target high school students in business computing and technology courses who currently are taught how to use a computer, without being taught any of the computer science behind it. <br\/><br\/>Piloting this project in a rural area of social, economic, and education need, PVAMU will partner with nearby Hempstead High School (HHS). A multipronged approach will be used to achieve the project's goal, and strong relationships formed between the two institutions will contribute to project effectiveness. Computing ACES project objectives are to (1) Engage high school students' interest in computing disciplines and strengthen their aptitude in computing; (2) Increase high school students' awareness of careers in computing disciplines aligned with their areas of interest and dispel commonly held myths about computing careers, especially for women; and (3) Encourage and assist qualifying students to apply to college in a computing discipline, particularly in PVAMU computer science and computer engineering. The innovative component of this BPC demonstration project will be the development of computing modules for incorporation into an existing HHS occupational technology course. The modules will be integrated into the existing syllabus and will teach computing principles using a fun, engaging, and gender-sensitive environment. PVAMU faculty will guide the process and routinely interact with the HHS technology teachers and students. A PVAMU student team (computing majors) will be an integral part of the activity and will work directly with HHS teachers and students. The teachers, after receiving instruction at Computing ACES summer workshops, will be able to adapt existing modules and develop new ones for incorporation into their curriculum. Other strategies to facilitate this novel effort will include utilization of media computing and pair programming to develop gender-neutral computing activities as the modules are introduced to the technology students. To scaffold student awareness of computing and dispel commonly held myths regarding computing careers, PVAMU will host several best-practices activities including Fiestas (summer day camps) for HHS students, as well as field trips to PVAMU computing labs during the academic year. Also, a Computer Festival will be incorporated into the annual PVAMU Engineering Week to further heighten student awareness of computing degree options at the university. To support the PVAMU application process for qualifying students, various efforts are proposed such as working with students on application materials during the last day of Fiesta and parental engagement during the Fiesta and the Computer Festival. By focusing on students enrolled in high school business computing and technology courses, this project targets traditionally underrepresented students in computing. <br\/><br\/>This model is both scalable and replicable. While most schools offer a business computing, technology or tech training course which covers the basic use of computers, many poor or rural schools, and those with larger numbers of underrepresented populations, do not offer courses in computer science. Successful components of this model can be replicated at other institutions with similar populations. Moreover, Computing ACES has potential for wider national impact with training guides and modules available online for the majority of U.S. high schools who offer business computing and occupational technology courses.","title":"BPC-DP: Computing Aptitude, Confidence, and Engagement (Computing ACES)","awardID":"0940561","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["460927","554927","526754"],"PO":["561855"]},"168323":{"abstract":"User interfaces that adapt themselves to individual needs and preferences or available user information are becoming increasingly important, to the degree where adaptability has become a selling point for software products. A system with the ability to construct and consult user models can adapt diverse aspects of its performance to individual users or user groups, thus enhancing its effectiveness, usability, and\/or acceptance in a wide variety of situations. Personalized interfaces are of special importance in dealing with information overload and navigation by personalizing and improving the quality of information retrieval and filtering, information restructuring and annotation, as well as information visualization.<br\/><br\/>User modeling has been found to enhance the effectiveness and usability of software systems in a variety of situations. A user model is an explicit representation of properties of a particular user, and a system that constructs and consults user models can adapt diverse aspects of its performance to individual users. Applications for user modeling range from electronic commerce and intelligent learning environments to health care and assistive technologies. Relevant platforms for user modeling include mobile and wearable systems and smart environments, as well as individual desktop systems, groupware, adaptive hypermedia, and other web-based systems.<br\/><br\/>The annual International Conferences on User Modeling, Adaptation and Personalization (UMAP) provide the premier forum in which academic and industrial researchers from all of these fields can exchange their complementary insights on user modeling issues. UMAP is a merger of the long-running and successful International Conferences on User Modeling (UM, 1986-2007), and the more recent important series of Adaptive Hypermedia and Adaptive Web-Based Systems Conferences (AH, 2000-2008). This is funding to support travel by approximately 8 graduate students to present their accepted papers and posters at and\/or to present their research plans at the Doctoral Consortium associated with the 18th event in the UMAP series, to be held June 20-24, 2010, in Waikoloa, Hawaii. More information about the conference is available at http:\/\/www.hawaii.edu\/UMAP2010. <br\/><br\/>UMAP-10 will include a Doctoral Consortium session, thereby continuing a tradition established at UMAP-09 and before that at both the UM and AH conferences. Lively and useful discussions have enabled students to receive suggestions about their ongoing research and allowed more experienced participants to hear some fresh ideas and view some of the new trends in the field. Students whose work has been selected for presentation at the Doctoral Consortium will be invited to write a paper that will be published in the UMAP-10 adjunct proceedings. They will have 15 minutes to present their work (which may include a short demonstration if appropriate), to be followed by an additional 15 minutes for questions and discussion. Both during the question\/discussion period and during subsequent informal interactions, the organizing committee members and other participants will provide constructive comments on each student's work and attempt to address aspects on which the student has requested advice.<br\/><br\/>Broader Impacts: Attending and presenting their work at UMAP, the top conference in its field, will have a significant impact on the careers of the future generation of user modeling, adaptation, and personalization researchers. Students who participate in the Doctoral Consortium will also benefit from that experience in several ways. First, they will have the opportunity to present their work to a knowledgeable audience and get useful comments at an early stage of their research when it will be most useful. Just as importantly, they will have an opportunity to meet established researchers and other graduate students doing similar work, to exchange ideas, and to make contacts that will be invaluable to them as they progress in their scientific careers. Lively discussions with young researchers are also useful to more experienced investigators, in that they provide new perspectives and fresh ideas. Thus, the Doctoral Consortium is a great confidence builder for the students involved, and highly stimulating to the established researchers who participate. The organizers have committed that the majority of funded students will be currently enrolled in Ph.D. programs in the United States. In selecting the students who will receive travel funds, the organizers will give preference to students who can reasonably prove that they would have difficulty participating in the conference due to financial constraints, and will also strive for diversity (gender, racial, ethnic, disabilities, institutional, etc.) among the selected students.","title":"Supporting Students Attending the User Modeling, Adaptation and Personalization 2010 Conference","awardID":"1016237","effectiveDate":"2010-03-01","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[450643],"PO":["565227"]},"163890":{"abstract":"This project examines wireless communication networks whose nodes have batteries that recharge by harvesting energy from the environment. Energy harvesting can yield a network that lasts as long as the network's hardware and intended purpose remain viable; this may be arbitrarily longer than the lifetime of any suitable single-charge battery. While average-power minimization is adequate to describe the lifetime of a device with a single-charge battery, a complete characterization of a network of rechargeable devices will depend on how the batteries are replenished. Given the broad variety of energy recharging systems, including solar cells, vibration absorption devices, wind and water mills, and thermoelectric generators, battery recharging is modeled as an environmental stochastic process. This project applies analytical models for battery recharging to evaluate fundamental multiple access, broadcast and relay network models composed of rechargeable nodes. The project objective is an enhanced understanding of the analytic fundamentals of rechargeable networks in order to contribute to the development and ultimate deployment of ecologically-friendly rechargeable networks.","title":"NeTS: Medium: Collaborative Research: Rechargeable Networks","awardID":"0964632","effectiveDate":"2010-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["548269"],"PO":["565303"]},"161691":{"abstract":"Computer science and engineering is undergoing a revolution. Many-core systems are rapidly becoming the foundation of computing systems that are well-integrated into every aspect of our lives and society. Their unpredictable performance and performance misbehavior adversely affects productivity, efficiency, and profit in all domains that make use of computers. Unfortunately, existing many-core systems are largely designed based on the assumptions made for single-core systems, i.e. there are no shared resources between cores, even though the memory system, a major performance and power bottleneck, is shared. As a result, many-core systems are severely vulnerable to denial of service, uncontrollable, unscalable, and low-performance. To enable the efficient and productive use of many-core systems, there is an urgent need to design them ensuring high quality-of-service (QoS), performance-robustness, and scalability.<br\/><br\/>This research focuses on developing fundamental breakthroughs that enable scalable, controllable, and high-performance many-core memory systems. It aims to change the design paradigm of many-core processors to treat QoS and scalability in shared resources as first-class design goals, and educate future engineers to design systems with these goals as fundamental design objectives. The central approach is to develop hardware\/software cooperative techniques to enable flexible QoS, partitioning, and performance mechanisms in memory systems and interconnects. The project develops fundamental techniques, targeting a very wide range of applications in cloud computing, data centers, client systems, mobile systems, and sensor environments. It is expected that research ideas developed in this project will enable controllable, robust, and therefore usable and efficient many-core systems, making our daily lives better and more productive, and taking a large step in making computing green.","title":"CAREER: QoS-Aware, High-Performance, and Scalable Many-Core Memory Systems","awardID":"0953246","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["550874"],"PO":["366560"]},"162681":{"abstract":"This proposal aims to establish a network forensics lab at University of Massachusetts Lowell. This proposed research and education infrastructure consists of network devices, such as network analyzers, Cisco routers, spectrum analyzer, and software for collecting and analyzing wired and wireless data. <br\/><br\/>The requested infrastructure will support three projects focusing on network forensics: <br\/>(1) Tracing Anonymous Criminals on the Internet <br\/>(2) Localizing and Locking Anonymous Malicious Wireless Mobiles <br\/>(3) Fingerprinting Wireless Mobiles for Forensics Purpose <br\/><br\/>These projects will address issues that are critical to the nation?s security and will train students who will be sought out by industrial companies and research laboratories. The proposed research will also position UMass Lowell among the leaders in network forensics research and education. <br\/><br\/>The three projects in this proposal have the following broader impact: <br\/>(i) The proposed infrastructure will enhance the research and education of network forensics, and will create an opportunity for developing new courses on network forensics and data recovery and analysis in UMass Lowell. <br\/>(ii) The proposed infrastructure will also enhance the collaborations that already exist between UMass Lowell, regional security industry, and the other UMass campuses.","title":"II-New: A Network Forensics Lab for Integrated Research and Education at University of Massachusetts Lowell","awardID":"0958477","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["554394","451664","539562"],"PO":["565327"]},"162693":{"abstract":"GreenIT: Testbeds for Real-time Data Center and Platform Energy and Thermal Management - CRI Proposal 0958514<br\/>The projected power demand for data centers and servers in the US is expected to grow to about 100B kWh by 2011, and even expected efficiency improvements projected by the EPA are insufficient to cap steady growth in IT energy demand. In order to reign in this growth, the 'GreenIT' cross-cutting and cross-disciplinary project seeks solutions that span multiple disciplines (mechanical, civil, electrical, and computer science) and multiple technologies (chips\/packaging, operating systems\/software, cooling technologies and thermal\/fluid modeling, at multiple length and time scales). The project approach is measurement-based, establishing a 'GreenIT' testbed for energy efficient IT. The testbed will operate at `data center scale', because it is coupled with ongoing efforts at Georgia Tech that are providing us both with (1) a large-scale, commodity IT infrastructure, i.e., racks of machines and (2) new facilities used for a multi-site collaboration in cloud computing. Commodity equipment and instrumentation are housed in the CEETHERM lab, in Mechanical Engineering at Georgia Tech, which offers dynamically controllable air cooling capabilities. This permits joint control of cooling and IT power consumption. Additional researcher-accessible measurement stations target new facilities and next generation multicore platforms.<br\/>A common thread in this research is its use and promotion of coordinated management 'across the energy stack', where management actions taken at different levels of the energy stack are performed in a coordinated manner. The outcome is holistic data center management for improved power efficiency.","title":"II-NEW: GreenIT: Testbeds for Real-time Data Center and Platform Energy and Thermal Management","awardID":"0958514","effectiveDate":"2010-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["523077","541936","526309","518444","556658"],"PO":["535244"]},"152573":{"abstract":"While hardware resources for computation and data storage are now abundant, <br\/>economic factors prevent specialized hardware security mechanisms from being <br\/>integrated into commodity parts. System owners are caught between the need to exploit <br\/>cheap, fast, commodity microprocessors and the need to ensure that critical security <br\/>properties hold. <br\/><br\/>This research will explore a novel way to augment commodity hardware after fabrication <br\/>to enhance secure operation. The basic approach is to add a separate silicon layer, <br\/>housing select security features, onto an existing integrated circuit. This 3-D Integration <br\/>decouples the function and economics of security policy enforcement from the <br\/>underlying computing hardware. As a result, security enhancements are manufacturing <br\/>options applicable only to those systems that require them, which resolves the <br\/>economic quandary. We plan to identify a minimal and realizable set of circuit-level <br\/>security capabilities enabled by this approach, which can be judiciously controlled by <br\/>the software layers. This will significantly assist in reducing both the software complexity <br\/>often associated with security mechanisms and system vulnerabilities. <br\/>This research introduces a fundamentally new method to incorporate security <br\/>mechanisms into hardware and has the potential to significantly shift the economics of <br\/>trustworthy systems. A broader impact will result through collaborative and educational <br\/>activities. Graduate and undergraduate student research associates will transfer <br\/>knowledge to future teachers, researchers and Information Assurance professionals; <br\/>and project publications will provide direct technical transfer to the embedded-systems <br\/>and hardware-design communities.","title":"TC: Large: Collaborative Research: 3Dsec: Trustworthy System Security through 3-D Integrated Hardware","awardID":"0910734","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["528231","528232"],"PO":["565264"]},"157754":{"abstract":"The objective of this research is to develop methods for the operation and design of cyber physical systems in general, and energy efficient buildings in particular. The approach is to use an integrated framework: create models of complex systems from data; then design the associated sensing-communication-computation-control system; and finally create distributed estimation and control algorithms, along with execution platforms to implement these algorithms. A special emphasis is placed on adaptation. In particular, buildings and their environments change with time, as does the way in which buildings are used. The system must be designed to detect and respond to such changes. <br\/><br\/>The proposed research brings together ideas from control theory, dynamical systems, stochastic processes, and embedded systems to address design and operation of complex cyber physical systems that were previously thought to be intractable. These approaches provide qualitative understanding of system behavior, algorithms for control, and their implementation in a networked execution platform. Insights gained by the application of model reduction and adaptation techniques will lead to significant developments in the underlying theory of modeling and control of complex systems.<br\/><br\/>The research is expected to directly impact US industry through the development of integrated software-hardware solutions for smart buildings. Collaborations with United Technologies Research Center are planned to enhance this impact. The techniques developed are expected to apply to other complex cyber-physical systems with uncertain dynamics, such as the electric power grid. The project will enhance engineering education through the introduction of cross-disciplinary courses.","title":"CPS: Medium: Collaborative Research: GOALI: Methods for Network-Enabled Embedded Monitoring and Control for High-Performance Buildings","awardID":"0931870","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}}],"PIcoPI":["518555"],"PO":["564778"]},"166004":{"abstract":"The objective of this proposal is to continue operation of a successful REU Site in the Department of Computer Science and Engineering at the University of South Carolina. The project provides students with research experiences derived from on-going research within the department in the engineering of secure software. Projects focus on one or more of the security triad of confidentiality, integrity, and availability. Participants engage in an eight-week summer research program with follow-on activities during the academic year after they return to their home institutions. These experiences: 1) encourage the computing majors to continue their studies and seek graduate degrees and research oriented careers in computer science and computer engineering; 2) encourage the pre-service teachers to continue their studies and enter the teaching profession prepared to engage their own students in research activities; 3) assist all the students in exploring employment and research opportunities available both as teachers and computing professionals; and 4) provide an enriching educational experience by exposing the students to non-classroom faculty-student interactions. The primary target participants are sophomore and junior level college students from primarily undergraduate institutions in the Southeast. Both students majoring in computing and related fields and pre-service teachers majoring in related education fields are eligible. The REU Site works closely with the South Carolina Alliance for Minority Participation (SCAMP) to provide joint support for some participants. <br\/><br\/>Intellectual Merit. The undergraduate research projects lead to the development of more effective tools and techniques for the engineering of secure, reliable and effective software. The research projects include such areas as the inclusion of security issues at early stages of software development, ensuring security on the semantic web, and maintaining availability of sensors and hand-held devices. <br\/><br\/>Broader Impact. The program provides an opportunity for ten undergraduates to participate in research projects each year. The experience will expose them to the possibility of graduate study and encourage them to choose this step in their career paths. The emphasis on secure computing is supportive of the social need for such software. The selection process for these students promotes the inclusion of underrepresented groups through targeted publicity and outreach efforts as well as cooperation with the SCAMP program.","title":"REU Site: Multisiciplinary Research in Secure Computing","awardID":"1004899","effectiveDate":"2010-03-01","expirationDate":"2014-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[444741,444742],"PO":["564181"]},"167225":{"abstract":"This award supports the Doctoral Colloquium program at the 2010 iConference to be held on the campus of the University of Illinois at Urbana-Champaign February 3 - February 6, 2010. This workshop will bring together 15 dissertation-stage doctoral students from diverse information and informatics subfields for one day of presentations, interaction, and feedback with 5 faculty members selected from among distinguished information researchers. The iConference Doctoral Research Colloquium is designed to assist doctoral students to become stewards of the information and informatics disciplines, by providing an opportunity for interaction with distinguished research faculty and for the development of a global cohort of new researchers. This award provides support for the travel, lodging and registration of students, plus one night lodging for the participating faculty mentors, as well as the direct expenses of putting on the Doctoral Colloquium at the meeting.","title":"Workshop: iConference Doctoral Research Colloquium","awardID":"1010836","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[447954],"PO":["565342"]},"162682":{"abstract":"Design and analysis of integrated systems (microprocessors, SoCs, ASICs, memories, MEMS, etc.) is increasingly difficult due to the extreme variations that exist both in the fabrication process and the operating environment. As a result, it is no longer viable to simply perform worst-case analysis during design. Instead, the distribution of designs resulting from these variations must be efficiently and accurately modeled. Compounding this need is the increasing scale of integration. With larger on-chip memories, growing use of diverse computing and communication blocks, and increasing heterogeneity, it is imperative that these systems be well characterized and \"statistically\" designed up to and even beyond \"six sigma\". <br\/>The Center for Silicon System Implementation (CSSI) at Carnegie Mellon is focused on all aspects of statistical design and analysis that spans from system-level architectures to analog\/digital circuits, to the physics and modeling of the complexities found in semiconductor manufacturing. Using the shared compute infrastructure acquired with support from the NSF Computing Research Infrastructure (CRI) program, CSSI is developing various statistical design and analysis methodologies that enable continued use of scaled-CMOS technology. CSSI faculty lead over 70 different research projects in various areas related to integrated system design and manufacturing, and instruct over 20 different graduate\/senior-level courses that cover these same areas. The ability to develop and validate new methodologies for statistical design, and train the next-generation of integrated systems researchers and practitioners is being significantly enhanced by the computer infrastructure acquired through support of the NSF CRI program.","title":"II-NEW: Infrastructure Acquisition for Research and Education in Statistical Design","awardID":"0958480","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["548338"],"PO":["565272"]},"151067":{"abstract":"To build high quality software, it is increasingly important for engineers to reason quantitatively about critical system properties, such as performance and reliability, as early as possible in the design process. Ideally, these properties are assessed before significant time and cost are expended on implementation. However, making useful predictions in early design stages is difficult at best due to the interplay among many relevant factors, such as complex properties of software components, effects of the firmware, and conflicts between desired system attributes. In this project, we focus on design-time evaluation of architectures with respect to one key attribute: reliability. The approach we pursue will enable an engineer to build a multi-faceted, hierarchical model of a system and assess its reliability in an incremental, scalable fashion. Moreover, we particularly focus on the area of embedded systems. Embedded systems present a rich target of opportunity for this work as (1) they demand close interplay of software and execution substrate; (2) they are often unencumbered with legacy concerns, allowing easier introduction and exploration of new techniques such as the one we propose; (3) they often have stringent and complex requirements, yet are seldom approached from a software architectural perspective. An extensive evaluation of our research focuses on two measures of interest: tractability (intended to address scalability issues existing in real, complex systems) and sensitivity (intended to address issues of confidence in our predictions under numerous design-time uncertainties).","title":"SHF: Medium: Early Reliability Modeling and Prediction of Embedded Software Systems","awardID":"0905665","effectiveDate":"2010-03-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["410098","551145","560335"],"PO":["564388"]},"168887":{"abstract":"Workshop on Design of DNA Origami<br\/>to be held 26 April, 2010<br\/><br\/><br\/>This proposal will support a day long workshop on design of DNA origami immediately prior to the 7th conference on the Foundations of Nanoscience (FNANO 2010).<br\/>Intellectual Merit<br\/>The workshop is designed to outfit each participant with information and tools that will enable them to design DNA nanostructures using the templated DNA origami method. Participants will return to their home institutions equipped with software, DNA sequence information, experimental hints and tips, and experience with AFM imaging that will allow them to design, fabricate and image a test origami structure. Workshop participants will also have the opportunity to attend the 2010 FNANO meeting, which this year features a double track on self-assembled DNA nanostructures. Most of the main researchers in DNA origami (Nadrian Seeman, Paul Rothemund, William Shih, Ebbe Andersen, Eric Winfree, Satoshi Murata, Masayuki Endo, Akinori Kuzuya, Hao Yan, Chengde Mao, Thom LaBean) attend this meeting. Coupling the workshop with the conference will enable younger scientists (postdocs, grad students, and junior faculty) to interact professionally with many of the top researchers in DNA origami.<br\/>Broader Impact<br\/>The workshop will be open to up to 15 NSF-supported participants, including 5 graduate students, 5 postdocs, and 5 junior faculty members. The workshop will be publicized to attract a wide range of applicants, who will be selected by the conference and program chairs of FNANO. The chairs will choose participants who are relatively new to FNANO, who will increase the diversity of the conference attendees, and who are likely to actually put the workshop content to use in their research.","title":"Workshop on DNA Origami","awardID":"1019003","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0307","name":"Division of MATERIALS RESEARCH","abbr":"DMR"},"pgm":{"id":"7623","name":"BIOMATERIALS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7931","name":"COMPUTATIONAL BIOLOGY"}}],"PIcoPI":["490724"],"PO":["565223"]},"161792":{"abstract":"CAREER: GoldMine:Automatic Assertion Generation in System Design Using Data Mining and Static Analysis<br\/>Shobha Vasudevan<br\/>University of Illinois at Urbana Champaign<br\/><br\/><br\/>Assertions are summarized statements of design intent that have emerged as the most popular checking artifacts in hardware and software development cycles. In hardware, assertions are used in formal verification, dynamic verification, runtime monitoring, emulation, post-Silicon debug and in-field diagnosis. The generation of assertions today is an intensely manual task. During each system development cycle, many man-months and resources are spent in assertion generation. This work proposes an automatic assertion generation technique and tool, GoldMine, for systems using data mining and static analysis in combination. Data mining infers knowledge by statistical analysis of dynamic behavior of a system. Static analysis reasons with the source code or model of the system without executing it, and analyzes possible behavior. These two technologies can be used synergisti-<br\/>cally. Static analysis techniques can be used to infer domain information and guide the data mining. GoldMine will provide simulation data of the target design along with static analysis to a suite of data mining algorithms that will infer ?likely invariants?. The likely invariants will be passed through a formal verifier for filtering the true assertions. Feedback from formal verification will be given to the mining algorithms, as will the designer\/user evaluation of the generated assertions. This iterative process will produce high quality assertions automatically. Preliminary results have been obtained on Rigel, a 1000+ processor RTL. <br\/><br\/>The marriage between statistical and static analyses proposed here for generating knowledge about a system is a ?meta technique? that can be used in a multitude of forms. A systematic methodology to extract and provide domain knowledge in any structured system, along with statistics based learning techniques can create a very powerful combination. The alliance of static domain analysis and statistical data mining that has been introduced can be used for software systems, embedded systems and other domains where knowledge needs to be inferred.<br\/><br\/>This proposal seeks to automate a manual, all-pervasive system process. This aims at saving economic and human resources, thereby increasing the productivity of the community. GoldMine will also be widely disseminated (along with the source code) for research and education purposes, contributing to practical learning of students. The merit in the system design world is that we are proposing to study and systematize the human cognition aspect of design.","title":"CAREER: GoldMine:Automatic Assertion Generation in System Design Using Data Mining and Static Analysis","awardID":"0953767","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["460238"],"PO":["562984"]},"170394":{"abstract":"The 7.0 Earthquake in Haiti has mobilized the entire world to support<br\/>the relief effort, especially through novel uses of the cyberspace. <br\/>Even though the earthquake damaged much of the communication <br\/>infrastructure in Haiti, Haiti's Internet connectivity is robust <br\/>because most Haitian Internet Service Providers use satellite, rather<br\/>than the damaged undersea fiber optic cable link, to connect to the <br\/>Internet. Consequently, relief workers, regular citizens, and <br\/>non-governmental organizations (NGO's) have used Tweets extensively <br\/>to spread and share information about the needs, events, and relief <br\/>operations. However, these tweets are not easily aggregated into <br\/>meaningful topics for ease of delivery to people who critically need <br\/>the information. <br\/><br\/>The goal of this research project is to develop and <br\/>deploy, in collaboration with an NGO coordination body (NetHope), <br\/>a reusable text message-based infrastructure that classifies and <br\/>aggregates multi-lingual tweets and text messages about Haiti <br\/>relief operations by topics and regions so that they can be easily <br\/>subscribed by NGO's, survivors in Haiti, and their friends and <br\/>families. The research project leverages existing software <br\/>developed for entity extraction and topic classification so that the <br\/>system can be developed and deployed quickly to respond to the time <br\/>critical needs at Haiti. <br\/><br\/>The evaluation of the system includes<br\/>feedbacks from NetHope as well as quantitative metrics about the<br\/>usage and performance of the system. The intellectual merit of the <br\/>research is developing integrated engineering solution to automatic <br\/>identification of topics and geo-location from short-messages <br\/>utilizing contextual information, which lays important foundation <br\/>for designing the next-generation information infrastructure for <br\/>emergency response and disaster management. For further information<br\/>see the project web page: URL: http:\/\/www.emerse.ist.psu.edu","title":"RAPID: Text Message-Based Infrastructure for Emergency Response","awardID":"1026763","effectiveDate":"2010-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[456072,"562561","563414",456075,456076],"PO":["563751"]},"161594":{"abstract":"Evolving software is no simple task: somehow, amongst innumerable bug reports, feature requests, and project plans, software teams must decide which of issues deserve the team's limited time and resources. To make these decisions, most teams engage in bug triage, comparing subjective estimates of the frequency and severity of issues.<br\/><br\/>This research seeks to replace these subjective estimates with large-scale data on software use. To achieve this, the research explores a tools that detect software issues through peoples' normal use of help tools. The use of these tools will capture a wide range of software issues in a consistent, structured form, enabling several forms of aggregation and analysis. Unlike voluntary feedback, these tools will be part of users' normal work, increasing the representativeness of frequency and severity estimates, while also capturing new kinds of issues such as non-fatal errors and a wide range of usability problems. Evaluation includes deployment to real software development teams and controlled experiments of the efficacy of the resulting tools. The broader impacts of the work are ultimately to enable software teams to evolve software in a way that best meets the needs of its users.","title":"CAREER: Enabling and Exploiting Evidence-Based Bug Triage","awardID":"0952733","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["548140"],"PO":["564388"]},"162596":{"abstract":"Code switching (CS) is the term used to describe a common practice among bilingual speakers of a given language pair in which the speakers switch back and forth between their common languages. CS occurs in all genres of communication, and at different levels of linguistic representation. <br\/><br\/>Computational algorithms trained for a single language fail when the input has other languages in the signal i.e. data with CS phenomena. One major barrier to research on processing CS is the lack of large, accurately annotated corpora of CS data. <br\/><br\/>This planning proposal aims at creating the framework for a large consistently annotated data repository that will target 7 different languages annotated with features at different levels of granularity. In the course of the planning grant, we plan to hold a community workshop to ensure that we are addressing their needs in the repository. We will work with the community in order to prepare the full CRI proposal. <br\/><br\/>This data will be transformative for computational linguistics research as it will provide a testbed for adaptive learning algorithms, lead to significant robustness in handling very diverse data sources, and create a framework for genuine multilingual processing. Moreover, it will have a direct impact on the way sociolinguists account for CS leading to more robust and replicable generalizations. <br\/><br\/>Research on CS will help acknowledge the creativity of bilinguals in exploiting their verbal repertoire. The CS repository will enable new research in many interconnected fields. This research will contribute to raising general awareness of bi\/multilingualism.","title":"Collaborative Research:CI-P: Creation of an annotated repository of multilingual and multigenre code switched data for several language pairs","awardID":"0958088","effectiveDate":"2010-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["562856"],"PO":["565215"]},"166017":{"abstract":"Harnessing computing applications and data, particularly with regard to materials and devices, is an important approach for solving our national contemporary power and energy challenges. This work synergistically brings together experts from a number of engineering disciplines that share a common goal of using computing resources and data to address major power and energy challenges. The primary goal is to provide more efficient use of resources and a deeper understanding of their role in cultivating alternative energy use and resources. The REU Site hosted at Drexel University provides a holistic view of the power and energy challenges to undergraduate researchers by addressing:<br\/><br\/>1. The old: Existing power grid and the computing needs for a smarter grid,<br\/>2. The new: Recently emerged power dissipation challenges on data centers and microelectronic devices (e.g. cell phones),<br\/>3. The renewable: Alternatives such as graphene sheets, photovoltaic cells and fuel cells to provide short and long-term solutions.<br\/><br\/>To this end, projects from the electrical, computer, mechanical and material engineering disciplines at Drexel University are providing an individual REU experience to each student while simultaneously educating the next generation of U.S. researchers in the interdisciplinary and contemporary power and energy challenges.<br\/><br\/>Intellectual Merit: The REU Site serves as a microcosm at Drexel University for computing-based projects in various engineering disciplines to carry out power and energy research. Demonstrated in an urban setting with state-of-the-art research facilities, the students are exposed to the motivations of these research projects and are gaining valuable hands-on research experience.<br\/><br\/>Broader Impact: The undergraduate researchers are learning the impacts of computing technologies in formulating and addressing power and energy challenges. Computing for power and energy is generating excitement in students and their parents, teachers, peers and siblings. This recognition is positively impacting the recruitment and retention of students in science and engineering. One of the big goals is to leverage an emerging and growing interest in ?a green planet? to promote engineering to a wider demographic at the pre-college level. The researchers are promoting the REU studies (web site, poster sessions and research papers) through Drexel collaboration with over 30 high-school STEM teachers and 20 middle school students in the School District of Philadelphia, and the Society of Hispanic Professional Engineers Pre-College program.","title":"REU Site: Computing for Power and Energy: The Old, The New and The Renewable","awardID":"1004936","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["543565"],"PO":["564181"]},"162673":{"abstract":"Wireless system performance is known to be highly dependent upon the characteristics of the environment. Despite the increasing ability of wireless devices to sense their surroundings, wireless systems have yet to fully leverage contextual data to improve performance. To this end, the Dallas-ARea Testbed for Context-Aware, Cognitive Research (DART-CARs) allows the study of wireless performance in a broad class of mobile and static environments from indoor labs to outdoor high-way speeds within a single testbed. Our hardware platform functions across many different wireless bands to enable real-time, multi-band operation. Such a first-of-its-kind infrastructure is critical for designing context-aware and cognitive algorithms that utilize multiple frequency bands to adapt to dynamic environmental settings. Our project has three major initiatives:<br\/><br\/>-Deploy a wireless research testbed to enable study across a vast array of urban environments <br\/>-Design multi-band wireless hardware and reconfigurable embedded software tools that enable context-driven, cognitive switching across frequency bands to improve performance in the aforementioned environments<br\/>-Develop an open-access data repository of wireless performance in multiple urban scenarios and across frequency bands<br\/><br\/>The project incorporates topics across disciplines such as wireless theory, embedded programming, hardware design, and ubiquitous computing. Student involvement in courses and research will allow cross-disciplinary intellectual growth. Further, field measurements will be made available to the research community. Finally, handheld mobile devices are increasingly being used as the primary method for under-represented groups to access the Internet. This infrastructure and resulting research will improve the performance these devices.","title":"CRI\/II-New: Dallas-ARea Testbed for Context-Aware, Cognitive Research (DART-CARs)","awardID":"0958436","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["462899","550846"],"PO":["564993"]},"170065":{"abstract":"Scientific Collections International is an organization devoted to the international and interdisciplinary coordination of object based scientific collections, and to increasing the scientific and societal impact of scientific collections. The organizational design and development is being guided by an international Steering Committee as an initiative of the Global Science Forum. As part of the planning and development process leading to the official launch of Scientific Collections International at the end of 2010, the Steering Committee is organizing an international workshop at the Belgian Royal Institute of Natural Sciences for 8 and 9 February 2010. The workshop will bring together representatives of collections based organizations and the users of collections in varied disciplines, including but not limited to biomedicine, earth and planetary sciences, biodiversity, physical anthropology, ethnology, and archaeology. The National Science Foundation is providing funds for a contingent of two US speakers, five US participants from a range of disciplines that rely on scientific collections, and six delegates from developing countries. This award is being co-funded by the Biological Research Collections Program, the Office of International Science and Engineering, and the Office of Cyberinfrastructure.","title":"Support for an International Workshop on Scientific Collections held in Brussels","awardID":"1025194","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0406","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1197","name":"BIOLOGICAL RESEARCH COLLECTION"}}],"PIcoPI":[455186],"PO":["561151"]},"152520":{"abstract":"While hardware resources for computation and data storage are now abundant,<br\/>economic factors prevent specialized hardware security mechanisms from being<br\/>integrated into commodity parts. System owners are caught between the need to exploit<br\/>cheap, fast, commodity microprocessors and the need to ensure that critical security<br\/>properties hold.<br\/><br\/>This research will explore a novel way to augment commodity hardware after fabrication<br\/>to enhance secure operation. The basic approach is to add a separate silicon layer,<br\/>housing select security features, onto an existing integrated circuit. This 3-D Integration<br\/>decouples the function and economics of security policy enforcement from the<br\/>underlying computing hardware. As a result, security enhancements are manufacturing<br\/>options applicable only to those systems that require them, which resolves the<br\/>economic quandary. We plan to identify a minimal and realizable set of circuit-level<br\/>security capabilities enabled by this approach, which can be judiciously controlled by<br\/>the software layers. This will significantly assist in reducing both the software complexity<br\/>often associated with security mechanisms and system vulnerabilities.<br\/>This research introduces a fundamentally new method to incorporate security<br\/>mechanisms into hardware and has the potential to significantly shift the economics of<br\/>trustworthy systems. A broader impact will result through collaborative and educational<br\/>activities. Graduate and undergraduate student research associates will transfer<br\/>knowledge to future teachers, researchers and Information Assurance professionals;<br\/>and project publications will provide direct technical transfer to the embedded-systems<br\/>and hardware-design communities.","title":"TC: Large: Collaborative Research: 3Dsec: Trustworthy System Security through 3-D Integrated Hardware","awardID":"0910581","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["560817"],"PO":["565264"]},"162684":{"abstract":"The ORBIT open access testbed for next-generation wireless networking at Rutgers was developed to address the challenge of supporting realistic and reproducible wireless networking experiments at scale. The 400-node ORBIT radio grid was released as a community resource in 2005, and can be accessed by researchers via an Internet portal (www.orbit-lab.org) which provides a variety of services to assist users with experiment setup, control and measurement. This project is aimed at a major hardware upgrade of the computing equipment and measurement instruments which make up the ORBIT testbed. Specific equipment items being upgraded are:<br\/><br\/>- All 400 ORBIT radio nodes which serve as the primary computing platform for experimenters.<br\/>- Computing\/storage servers and switching equipment in the ORBIT backend cluster.<br\/>- RF measurement instruments for spectrum monitoring on the radio grid.<br\/><br\/>This project also includes resources for ongoing maintenance and software support necessary for continued 24\/7 operation of the ORBIT facility as a community resource. The proposed equipment upgrade will prepare ORBIT for anticipated higher performance experiments on emerging wireless technologies and network architectures. Specific areas of experimental research that will be enabled by the upgraded ORBIT testbed include dynamic spectrum access, cognitive networking, wireless security, delay-tolerant routing protocols and network virtualization. As an open community facility, ORBIT helps lower the barrier for experimentation on wireless networks, thus improving teaching and research productivity in the field. The testbed currently serves as an important platform for wireless aspects of future Internet architecture research in the NSF computer science and engineering communities.","title":"CI-ADDO-EN: Major Equipment Upgrade and Improved Operations Support for the ORBIT Open Access Wireless Networking Testbed","awardID":"0958483","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["564745","564746"],"PO":["564993"]},"163686":{"abstract":"Modern automobiles are no longer mere mechanical devices; they are pervasively monitored and controlled by dozens of digital computers coordinated via internal vehicular networks and bridged to external networks as well. While this transformation has driven major advancements in efficiency, safety and convenience, it has also introduced a broad range of new potential risks. In this effort, we are evaluating these risks by experimentally mapping the attack surface of the modern automobile, identifying architectural security and privacy vulnerabilities, and developing new defense methodologies that can provide safety within the rubric of the existing automotive design ecosystem.","title":"TC:Medium:Collaborative Research:Foundations, Architectures, and Methodologies for Secure and Private Cyber-Physical Vehicles","awardID":"0963695","effectiveDate":"2010-03-15","expirationDate":"2014-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1104","name":"Division of UNDERGRADUATE EDUCATION","abbr":"DUE"},"pgm":{"id":"1668","name":"FED CYBER SERV: SCHLAR FOR SER"}}],"PIcoPI":["534402","559051"],"PO":["565239"]},"162399":{"abstract":"A new generation of robots is emerging which aims to interact with humans on a daily basis to provide service, care, and companionship. To support natural interaction between people and this type of robot, robust language processing enabling situated human robot dialogue will become increasingly important. Compared to traditional spoken dialogue systems and multimodal conversational interfaces, situated human robot dialogue is drastically different due to two unique characteristics. The first characteristic is situatedness. A robot is situated in a physical world that is cohabited with human partners. The spatial relations between the robot, the human, and the environment, and the dynamic nature of the surroundings, have a massive influence on how the robot accomplishes its task and interacts with the human. The second characteristic is embodiment. A robot and its human partner both have physical bodies in the environment. In embodied communication, speakers make extensive use of non-verbal modalities (e.g., eye gaze and gestures) to engage in conversation and make reference to the shared environment. These two characteristics make automated interpretation of human language in situated human robot dialogue extremely challenging. This is funding to provide the PI and her team with an enhanced infrastructure that will enable them to address these challenges. The new resources will include a physical environment and a virtual environment to enable human-centered investigation, tools to capture human multimodal language behaviors that include human speech, eye gaze, and gesture during situated human robot dialogue, and systems to support Wizard-of-Oz experiments, data collection, and data analysis. The integration of a physical world and a virtual world is an innovation of the new infrastructure. Limitations of sensor and effector technology often make it difficult or expensive to change robot configurations and implement desired behaviors. The virtual world paradigm allows efficient and high fidelity simulation of the physical world and robots, as well as studies on multimodal language behavior under many different conditions which are otherwise difficult to obtain in the physical world. The new infrastructure will enable a human-centered approach by facilitating a wide variety of controlled experiments. It will enable new empirical findings and provide a testbed for advanced techniques for multimodal language processing that are psycholinguistically plausible.<br\/><br\/>Broader Impacts: The new infrastructure will provide tremendous research and collaborative opportunities for the PI and her colleagues at Michigan State University. It will have profound implications in enabling the next generation of social and cognitive robots. This infrastructure will also provide new and exciting training and education opportunities for students at MSU through research mentoring and curriculum development. It will bring new educational experiences to K-12 students and encourage broader participation in engineering through several outreach programs at MSU.","title":"II-NEW: Towards an Infrastructure for Research on Multimodal Language Processing in Situated Human Robot Dialogue","awardID":"0957039","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["565127"],"PO":["565227"]},"161651":{"abstract":"Computer systems security is an arms race between defenders and<br\/>attackers that has mainly been confined to software<br\/>technologies. Increases in the complexity of hardware and the rising<br\/>number of transistors per chip have created opportunities for<br\/>hardware-based security threats. Among the most pernicious are<br\/>malicious hardware footholds inserted at design time, which an<br\/>attacker can use as the basis of a computer system attack.<br\/><br\/>This project explores of the feasibility of foothold attacks and a<br\/>fundamental design-time methodology for defending against them.<br\/>First, this project looks at techniques for highlighting potentially<br\/>malicious circuits in a design automatically. The basic algorithm,<br\/>called dead circuit identification (DCI), analyzes hardware<br\/>description language source code and dynamic execution traces of<br\/>design verification tests to identify suspicious circuitry whose<br\/>results do not impact the computation.<br\/><br\/>The second aspect of this project is a system for removing suspicious<br\/>circuits from a design automatically. The dead circuit elimination<br\/>(DCE) tool removes suspicious circuits from a design by pushing<br\/>potentially malicious logic up to a higher layer where it can be<br\/>analyzed in more detail at runtime.<br\/><br\/>The third aspect of this project is a new technique for generating<br\/>test cases and perturbing existing test cases to search specifically<br\/>for potentially malicious circuits.<br\/><br\/>This project provides a pathway to detection and defense against<br\/>security risks from hardware comprising attacks, making the enormous<br\/>disruptions possible with such attacks far more difficult than today.","title":"CAREER: Untrusted Computing Base: Detecting and Removing Malicious Hardware","awardID":"0953014","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["548692"],"PO":["565264"]},"150893":{"abstract":"The main objective of the proposed research is to develop a self-securing framework for smart mobile handsets, called S3Mobile (Self Securing Services for Mobile handsets), that protects the handsets against known and unknown malware. The key research components of S3Mobile include: (1) collect malware samples for mobile handsets, (2) record the hardware and software usage logs of the samples that represent the corresponding run-time behavior, (3) develop an algorithm for extracting features from the logs, (4) analyze similarities, features, and exploit vectors, and (5) implement and evaluate S3Mobile on the Android platform. <br\/><br\/>The general approach to the problem is to conduct some monitoring on the handset, but, recognizing the more limited computational and electrical resources available there, to use a remote server to conduct more computationally intensive activities and to maintain repositories of malware and normal application behavior. The server side facilities are referred to as a second line of defense. Four particular challenges are noted for the work: accurately specifying malware behavior, accurately detecting such behavior, testing the constructed system to evaluate its performance correctly, and the difficulty of obtaining malware samples. The proposal documents approaches to each of these challenges, including the use of a temporal logic based notation for describing malware behavior and a combination of honeypots and industrial collaboration to provide malware samples. <br\/><br\/>If successful, the work could lead to a cellphone \/ smartphone infrastructure with much improved resilience to software-based attacks that aim to steal information or drain power from the phone.","title":"TC: Medium: Self-Securing Services for Mobile Handsets","awardID":"0905143","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["553551"],"PO":["565264"]},"162652":{"abstract":"This infrastructure enhancement award expands the Optical Imaging Laboratory (OIL) at Brigham and Women's Hospital through the development of an image database and image analysis toolbox. The developed database integrates data obtained from multiple imaging instruments as well as an image processing toolbox implemented using Matlab. The database manages the dataflow by interacting with the imaging instruments, metadata, and the toolbox. The data model consists of four parts: (1)the raw image data, (2) image descriptor data, (3) metadata definitions from image computations, and (4) associated metadata definitions concerning cell line, reagents, subjects used in the experiment as well as information from genetics, biology, and experimental design. The toolbox features a modular design and includes a versatile graphic user interface and file input\/output. Its careful design facilitates the implementation of existing and new computational techniques. <br\/><br\/>The results of the project serve as the backbone of a computational infrastructure for a wide variety of biology research that is increasingly relying on optical imaging and computational analysis. Broad impact of the work arises from the fact that the database and the toolbox are available to researchers and students in biology, engineering, and mathematics for research and teaching activities. Undergraduate and graduate students and postdoctoral fellows involved in the work benefit from the training provided by the multi-disciplinary environment.","title":"II-EN: High-throughput and multimodality optical imaging in computational biology","awardID":"0958345","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["561951","472116"],"PO":["564316"]},"161695":{"abstract":"Recent trends are rapidly shifting developer and user expectations of programming languages and application programs. Firstly, growing program complexity is increasing the demand for higher-level programming languages. Secondly, growing availability and accessibility of the Internet is driving the demand for a portable distribution format for software, along with a safe and secure runtime environment. High-level managed languages along with their associated runtimes are ideally suited to deliver the features required for future software systems. Managed language runtimes provide their features by performing a number of auxiliary tasks during program execution. However, these tasks often also interfere with normal program execution, create stalls, and ultimately result in degrading program performance. As future applications necessitate even more expensive features to improve speed and protect against more sophisticated software attacks, the overhead of performing such inline auxiliary tasks is likely to become prohibitive.<br\/><br\/>This research develops a new virtual machine framework to exploit the opportunities provided by multiprocessor systems to effectively parallelize inline auxiliary tasks, and enable unhindered execution of the main program thread at runtime. The framework implements a novel parallelization model for virtual machines to allow each auxiliary task to execute in its own thread, and on a separate processing core. Each auxiliary thread is generated using program slicing to only calculate the state necessary for its correct execution. Thus, auxiliary threads execute independently, concurrently, and communicate their results to the main thread before they are due. Relieved of the stalls caused by the auxiliary tasks, the framework can allow accelerated program completion, and support even more beneficial and expensive tasks for future programs.","title":"CAREER: Implementing a New Parallelization Model for Virtual Machines","awardID":"0953268","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[432401],"PO":["565255"]},"162674":{"abstract":"Code switching (CS) is the term used to describe a common practice among bilingual speakers of a given language pair in which the speakers switch back and forth between their common languages. CS occurs in all genres of communication, and at different levels of linguistic representation. <br\/><br\/>Computational algorithms trained for a single language fail when the input has other languages in the signal i.e. data with CS phenomena. One major barrier to research on processing CS is the lack of large, accurately annotated corpora of CS data.<br\/><br\/>This planning proposal aims at creating the framework for a large consistently annotated data repository that will target 7 different languages annotated with features at different levels of granularity. In the course of the planning grant, we plan to hold a community workshop to ensure that we are addressing their needs in the repository. We will work with the community in order to prepare the full CRI proposal. <br\/><br\/>This data will be transformative for computational linguistics research as it will provide a testbed for adaptive learning algorithms, lead to significant robustness in handling very diverse data sources, and create a framework for genuine multilingual processing. Moreover, it will have a direct impact on the way sociolinguists account for CS leading to more robust and replicable generalizations.<br\/><br\/>Research on CS will help acknowledge the creativity of bilinguals in exploiting their verbal repertoire. The CS repository will enable new research in many interconnected fields. This research will contribute to raising general awareness of bi\/multilingualism.","title":"Collaborative Research: CI-P: Creation of an annotated repository of multilingual and multigenre code switched data for several language pairs","awardID":"0958440","effectiveDate":"2010-03-01","expirationDate":"2011-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["511614","560340"],"PO":["565215"]},"162685":{"abstract":"This project develops the DARwIn-miniature-humanoid-robot platform with advance computational power, sophisticated sensors, high payload capacity, and dynamic motion ability to enable many exciting research, education, and outreach activities. Two models of DARwIn robot, DARwIn-HP (High Performance) and DARwIn-LC (Low Cost), will be designed, fabricated, and built for distribution to 11 partner universities (including major research universities, RUI institutions, a women's college, and two local high schools) to establish a humanoid-robotics community. The project engages the humanoid-robotics community in a concerted effort to advance humanoid robotics.<br\/><br\/>The research results from the humanoid-robotics community will find applications in assistive robotics technology for the elderly, intelligent humanoids, and homeland security and the military. The partner universities will utilize DARwIn robots in their classroom teaching and projects as well as outreach activities to recruit high-school students and encourage them to select computer science or engineering for their career choices. An annual workshop will be organized and a website will be developed to broaden the DARwIn project and disseminate results. Public demonstrations of the robots at various high-impact events such as FIRST robotics competitions will capture the minds of K-12 students and promote interest in computer science and engineering among them.","title":"CI-ADDO-NEW: Collaborative Research: Development of DARwIn Humanoid Robots for Research, Education and Outreach","awardID":"0958487","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["540778","475378"],"PO":["564069"]},"150773":{"abstract":"Pascucci<br\/>0904631<br\/><br\/>Accurate simulation of turbulent combustion is a major open problem requiring petascale computing to resolve highly nonlinear coupling of physical processes over a wide range of length and time scales. The PIs approach to develop new modeling and algorithmic approaches for this problem to tackle effectively High Performance Computing (HPC) for combustion simulation at the Petascale. The PI's approach combines three techniques: automatic algorithm parallelization, multidimensional data analysis for model reduction, and multi-scale modeling with topological analysis to connect models at different scales. The algorithm parallelization is based on an algorithmic analysis that detects dependencies among computing stages, using graph theory to detect and exploit parallelism more effectively than current algorithms. This approach is independent from and complimentary to MPI distributed parallelism and allows achieving the finer grain parallelism necessary to exploit the multi core resources available on each computing node. The PIs also plan a powerful new approach to model multiphysics flows, such as turbulent combustion that leverages direct numerical simulation (DNS) and one-dimensional turbulence (ODT) to provide surrogate 'truth sets'. High-dimensional DNS data sets, containing terabytes of data, can be analyzed to extract lower-dimensional manifolds known to exist. Techniques such as principal component analysis can identify the optimal basis for representing manifolds in this high-dimensional data. Once a basis has been identified and extracted from the data sets generated by ODT, transport equations for the variables forming the basis may be derived and solved in a large-eddy simulation (LES). The LES can then be used to generate new ODT simulations which can feed back to the LES, thereby creating a dynamic modeling approach that uses down-scale, highly resolved statistical information to construct models to be used on larger scales (LES). This modeling approach is a prime candidate for early testing on petascale systems. The researchers in this study have already demonstrated the ability to scale DNS and LES to terascale computing systems, and availability of petascale computing will directly enable these modeling approaches. Application of the algorithmic and modeling advances will be made to oxyfuel combustion of natural gas. Oxyfuel combustion is one technique to facilitate carbon capture and sequestration to mitigate carbon dioxide emissions from power plants burning fossil fuels. While application will be made to natural gas systems, the techniques and algorithms developed here will apply directly to other systems including coal and transportation fuels such as diesel and gasoline. This project will provide unique educational experiences for students, including summer internships at national laboratories. Incorporating in regular classes the lessons learned in this project will help educate the future work force. Additionally, the research will strengthen collaborations between university researchers and national laboratory staff involved in simulation and model development, who will also participate in mentoring students.","title":"Scalable Algorithms for Multiscale Modeling and Analysis of Turbulent Combustion","awardID":"0904631","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"7691","name":"PetaApps"}}],"PIcoPI":["548347","556614"],"PO":["565247"]},"162675":{"abstract":"While areas of the US such as California and the East coast have major<br\/>medical centers near every population center, there are many areas,<br\/>even in developed countries, with a widely dispersed patient<br\/>population with significant obstacles to advanced medical care.<br\/>Victims of large scale natural disasters and battlefield casualties<br\/>also lack state of the art care. Telesurgery could potentially meet<br\/>these needs. There is a growing interest in computational research on<br\/>intelligent telesurgery. Today's telesurgery systems do not integrate<br\/>with medical imaging or have intelligent functions to assist the<br\/>surgeon. This project is building seven teleoperated surgical robot<br\/>and surgeon-interface systems powerful and precise enough to support<br\/>research on advanced robotic surgery techniques at seven major<br\/>research universities. University of Washington and University of<br\/>California Santa Cruz are building the seven robots and will<br\/>distribute them to Harvard, Johns Hopkins, University of Nebraska,<br\/>U.C. Berkeley, and UCLA. When completed, the seven research lab<br\/>robots will be networked together for sharing of software,<br\/>interoperability, and on-line telesurgery experiments.<br\/><br\/>Impact<br\/><br\/>The results of this project will enable a network of researchers to<br\/>prototype advanced surgical robotics techniques, and evaluate them in<br\/>realistic contexts including appropriate animal procedures. Besides<br\/>new and less invasive cures, such a technology can provide easier<br\/>access to care in remote parts of the US, and the developing world.<br\/> The seven cooperating labs, and external partners will be able to<br\/>interconnect their systems, share modules of software, and replicate<br\/>each others experiments.","title":"II New: A Network of Open Experimental Testbeds for Surgical Robotics Research","awardID":"0958441","effectiveDate":"2010-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[434705],"PO":["543539"]},"163688":{"abstract":"Modern automobiles are no longer mere mechanical devices; they are pervasively monitored and controlled by dozens of digital computers coordinated via internal vehicular networks and bridged to external networks as well. While this transformation has driven major advancements in efficiency, safety and convenience, it has also introduced a broad range of new potential risks. In this effort, we are evaluating these risks by experimentally mapping the attack surface of the modern automobile, identifying architectural security and privacy vulnerabilities, and developing new defense methodologies that can provide safety within the rubric of the existing automotive design ecosystem.","title":"TC: Medium: Collaborative Research:Foundations, Architectures, and Methodologies for Secure and Private Cyber-physical Vehicles","awardID":"0963702","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["525661",438188],"PO":["565239"]},"152446":{"abstract":"While hardware resources for computation and data storage are now abundant,<br\/>economic factors prevent specialized hardware security mechanisms from being<br\/>integrated into commodity parts. System owners are caught between the need to exploit<br\/>cheap, fast, commodity microprocessors and the need to ensure that critical security<br\/>properties hold.<br\/><br\/>This research will explore a novel way to augment commodity hardware after fabrication<br\/>to enhance secure operation. The basic approach is to add a separate silicon layer,<br\/>housing select security features, onto an existing integrated circuit. This 3-D Integration<br\/>decouples the function and economics of security policy enforcement from the<br\/>underlying computing hardware. As a result, security enhancements are manufacturing<br\/>options applicable only to those systems that require them, which resolves the<br\/>economic quandary. We plan to identify a minimal and realizable set of circuit-level<br\/>security capabilities enabled by this approach, which can be judiciously controlled by<br\/>the software layers. This will significantly assist in reducing both the software complexity<br\/>often associated with security mechanisms and system vulnerabilities.<br\/>This research introduces a fundamentally new method to incorporate security<br\/>mechanisms into hardware and has the potential to significantly shift the economics of<br\/>trustworthy systems. A broader impact will result through collaborative and educational<br\/>activities. Graduate and undergraduate student research associates will transfer<br\/>knowledge to future teachers, researchers and Information Assurance professionals;<br\/>and project publications will provide direct technical transfer to the embedded-systems<br\/>and hardware-design communities.","title":"TC: Large: Collaborative Research: 3Dsec: Trustworthy System Security through 3-D Integrated Hardware","awardID":"0910389","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["527086"],"PO":["565264"]},"157759":{"abstract":"The objective of this research is to develop methods for the operation and design of cyber physical systems in general, and energy efficient buildings in particular. The approach is to use an integrated framework: create models of complex systems from data; then design the associated sensing-communication-computation-control system; and finally create distributed estimation and control algorithms, along with execution platforms to implement these algorithms. A special emphasis is placed on adaptation. In particular, buildings and their environments change with time, as does the way in which buildings are used. The system must be designed to detect and respond to such changes. <br\/><br\/>The proposed research brings together ideas from control theory, dynamical systems, stochastic processes, and embedded systems to address design and operation of complex cyber physical systems that were previously thought to be intractable. These approaches provide qualitative understanding of system behavior, algorithms for control, and their implementation in a networked execution platform. Insights gained by the application of model reduction and adaptation techniques will lead to significant developments in the underlying theory of modeling and control of complex systems.<br\/><br\/>The research is expected to directly impact US industry through the development of integrated software-hardware solutions for smart buildings. Collaborations with United Technologies Research Center are planned to enhance this impact. The techniques developed are expected to apply to other complex cyber-physical systems with uncertain dynamics, such as the electric power grid. The project will enhance engineering education through the introduction of cross-disciplinary courses.","title":"CPS: Medium: Collaborative Research: GOALI: Methods for Network-Enabled Embedded Monitoring and Control for High-Performance Buildings","awardID":"0931885","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["433014",421061],"PO":["564778"]},"161840":{"abstract":"This research will develop a framework to understand the set of sociotechnical relationships that comprise cyberinfrastructure (CI). Cyberinfrastructures are distributed organizations supported by such technologies as supercomputers and high-speed networks. Scientific cyberinfrastructures, or eScience projects, are multiplying rapidly because they can be brought to bear on some of the world's most important problems in energy, the environment, health, and security. The technical challenges of cyberinfrastructure are already so demanding that projects often have little time to engage reflexively on how cyberinfrastructures are used and created in the current state of rapid scientific change in which the necessity of data sharing and multidisciplinary approaches is putting pressure on disciplinary boundaries. While the ability to pool data can enable scientists to answer questions that no single investigator or laboratory could answer individually, large-scale databases also bear the significant burden of supporting scientific sub-domains with different priorities and requirements. <br\/><br\/>This project will use ethnographic methods, including participant-observation and semi-structured interviews, to investigate: How scientists and engineers decide which cyberinfrastructure resources (e.g. databases and tools) to use and under what circumstances; Under what circumstances do scientists and engineers decide to create their own resources; How are scientists and engineers mixing disciplinary practices within their own laboratories; When do scientists and engineers adopt hybrid identities (e.g. computational biologists and bioinformaticists). <br\/><br\/>This project will make empirical and conceptual contributions to research in areas such as computer supported cooperative work, science and technology studies, and the study of CI. It will provide a corpus of material describing how local concerns shape the use of CIs and the development and use of alternative local resources. By contributing to a more sophisticated understanding of how eScience is dependent on both technical and social transformation, this research will stimulate and support the development of future eScience research. This project will benefit cyberinfrastructure users and developers, funding bodies and policy makers, by creating a typology of change related to scientific practice, training, and technological change. The education components will give students hands-on involvement in research including developing research instruments, collecting and analyzing data, and writing papers. Diverse students from undergraduate to postdoctoral level, including women and minorities, will emerge with practical skills as well as exposure to theoretical issues related to collaboration and eScience.","title":"CAREER: Interacting with Cyberinfrastructure in the Face of Changing Science","awardID":"0954088","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["335186"],"PO":["564456"]},"161785":{"abstract":"Attackers only need to find a single exploitable bug in order to<br\/>install malware, bots, and viruses on a vulnerable user's computer.<br\/>Unfortunately, bugs are plentiful. For example, the Ubuntu Linux<br\/>distribution bug management database currently lists over 58,000 open<br\/>bugs. Thus, the question is not whether an attacker can find a bug,<br\/>but which bugs an attacker can exploit.<br\/><br\/>This research investigates novel techniques, approaches, and<br\/>algorithms for finding exploitable bugs. The ability to deterimine<br\/>whether a bug is exploitable or not will allow developers to<br\/>prioritize bug reports so that the most security-critical bugs are<br\/>fixed first. The techniques investigated will also help developers<br\/>distribute patches safely.","title":"CAREER: Towards Identifying and Eliminating Exploitable Software Bugs","awardID":"0953751","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["521611"],"PO":["565264"]},"161675":{"abstract":"The goal of this research project is advance the Information Extraction (IE) paradigm beyond \"slot filling\", and achieve more accurate, salient, complete, concise and coherent extraction results by exploiting dynamic background knowledge and cross-document cross-lingual event ranking and tracking. The approach consists of cross-document inference, unknown implicit event time prediction and reasoning, cross-document entity coreference resolution with global contexts, centroid entity detection, event attribute extraction and graph-based clustering algorithms for redundancy and contradiction detection, automatic new event clustering and active learning, abstractive summary generation based on extraction results, name translations with comparable corpora and cross-lingual co-training.<br\/><br\/>The experimental research is integrated with educational activities, including project-related curriculum development. The project involves PhD students as well as undergraduate students, engages non-Computer Science undergraduate students in utility evaluation and corpus annotation, and attracts elementary school and high school students by tutorials, regular research seminars and an extensive summer workshop. The results of this project will also have a benefit in E-Science and E-Learning by extracting and tracking the related knowledge from scientific literature and learning materials used in elementary schools and high schools.<br\/><br\/>Project results, including open source software, task definition guidelines, annotated corpora, scoring metrics will be disseminated via project Web site<br\/>(http:\/\/nlp.cs.qc.cuny.edu\/blendeet.html).","title":"CAREER: Cross-Document Cross-Lingual Event Extraction and Tracking","awardID":"0953149","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["499546"],"PO":["563751"]},"164942":{"abstract":"Cyber-physical systems (CPS) are characterized by extremely tight integration of and coordination between computational and physical resources. CPS integrate computation, communication, and storage capabilities through systems of systems that must interact with the physical world in real-time at multiple time scales and often at multiple spatial scales. The inherent heterogeneity and the non-deterministic operation of different components in these systems pose new challenges to traditional control, communication, real-time scheduling, and robotics disciplines.<br\/><br\/><br\/>In conjunction with the IEEE Real-Time Systems Symposium in 2009 (RTSS 2009), this project helps to support a Ph.D. student forum to discuss (i) the set of interdisciplinary research problems that arise in the context of cyber-physical systems, (ii) novel applications that become possible thanks to the integration of computing, communication, and interaction with the physical world at scale, and (iii) initial system architecture that addresses some of these research problems. The primary goal is to help students (and the real-time community) recognize that cyberphysical systems are different from the over-engineered real-time embedded systems of the past, and to provide a forum by which students can discuss their proposal for addressing the complicated aggregate systems issues that arise in this context. As such, we need to encourage constructive debate on emerging research topics. A secondary goal is to encourage student involvement in new research directions and offer a channel to discuss and reward the most innovative student ideas in this exciting emerging research field. Advisors and students will be welcome to attend the forum, but the focus will be on training and motivating the next generation of researchers.","title":"CSR-CPS: Ph.D. Student Forum on Cyber-Pysical Systems","awardID":"1000028","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"7607","name":"ENERGY,POWER,ADAPTIVE SYS"}}],"PIcoPI":["486378"],"PO":["493916"]},"161587":{"abstract":"Increasingly, both personal and enterprise data are being stored at third-party locations, outside of the data owner's control. A company might directly outsource its data storage by using a backup service such as Amazon's S3 application. In other cases, outsourcing is a by-product of a larger service; for example, several corporations use Salesforce to manage their customer relations and sales data. Outsourcing data storage offers several benefits: storage costs can be amortized by a third-party over several customers, a third party can store data at different geographic locations for robustness, and integration with larger application services becomes easier. One can imagine a not too distant future where most computation and storage is realized in a network \"cloud\". In order to protect data stored at third party services we will need to encrypt it.<br\/><br\/>Unfortunately, traditional encryption systems are insufficient for these applications. Solving this problem requires an entirely new way of encrypting data. To see this, recall that in traditional public key encryption a party encrypts data to a single known user. While this functionality is useful for applications such as encrypted email and establishing secure web sessions, it lacks the expressiveness needed for more advanced data sharing. In enterprise settings, a party will want to share data with groups of users based on their credentials. Often a party sharing data will not know which individual users will need to have access to it; moreover, some users will not even exist in the system at the time the data is encrypted. For example, a traveling sales representative might want to encrypt records so that any current or future manager in the personal electronics division can access them.<br\/><br\/>The proposed research is laying the foundations for an entirely different vision for encryption called Functional Encryption. Instead of encrypting to individual users, in a functional encryption system, one can embed any access predicate f() into the ciphertext itself. Functional encryption simultaneously renders completely general functionality and its data access is self-enforcing --- requiring no trusted mediator. The PI aims to create a system where the encrypting party can specify any access predicate over a recipient's credentials (i.e. f can be any Turing Machine). Functional encryption for any predicate opens up a world of possibilities for data sharing; one could encrypt an image such that the access function f encoded an image recognition program allowing only people in the picture to view it.<br\/><br\/>In addition to broadening our view of public key cryptography, the PI will explore fundamental problems in public key encryption. One direction is to attempt to build chosen ciphertext secure encryption from standard public key encryption. Finally, the PI will explore the foundations of building public key cryptography.","title":"CAREER: Foundations and Extensions of Public Key Cryptography","awardID":"0952692","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["521455"],"PO":["565264"]},"162699":{"abstract":"Understanding the structure and dynamics of Internet topology, routing, workload, performance, and vulnerabilities remains disturbingly elusive, in part for lack of large-scale distributed network measurement infrastructure available to scientific researchers. This project upgrades and extends -- in geographic scope as well as function -- an active measurement instrumentation (Ark), creating an unprecedented laboratory in which to easily design, implement, and coordinate execution of Internet measurement experiments across a widely distributed set of dedicated monitors. In 2007 Ark launched a new global Internet topology measurement and mapping expedition, and now gathers the largest set of IP topology data available to academic researchers. We use the best available techniques for IP topology mapping, share raw and processed data sets, and support software for analysis, annotation, topology generation, and interactive visualization of resulting graphs. The effort has three tasks: (1) adding new monitors in geographic and topological areas lacking coverage; (2) improving tools for processing topology data; (3) enhancing and developing software modules to support new experiments and validation. Workshops will also be conducted to collect, synthesize, and integrate feedback on Ark operations. It is expected that a broad set of research communities will continue make use of this measurement infrastructure. By lowering the cost to implement scientific Internet measurement experiments, Ark will allow researchers to test and evaluate more ambitious, sophisticated and risky ideas. The resulting data will enable a wide range of network modeling, simulation, analysis, and theoretical research activities, including historical Internet studies and evaluation of proposed future Internet architectures.","title":"CI-ADDO-EN: ILENS: Internet Laboratory for Empirical Network Science","awardID":"0958547","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["521741"],"PO":["564993"]},"161731":{"abstract":"Computer technology is rapidly permeating all spheres of society. A computer system that affects the lives of thousands or millions of people creates a massive community of users who have an interest in the correct behavior of that system. Widespread interconnectivity means that we now have the ability to tap this potential.<br\/><br\/>This work confronts the challenge of diagnosing and mitigating concurrency bugs. A suite of novel instrumentation schemes will be developed for monitoring thread interleaving patterns. Coupled with statistical debugging models developed previously, this lets developers identify bad thread interleavings which constitute root causes of program failure. A new approach to coordinated cross-thread random sampling keeps overheads low while still providing ample data for diagnosis. Static analysis will play a role to further reduce instrumentation load. Prior statistical debugging work was content with diagnosis only, but this project will develop a speculative locking strategy, guided by the statistical models, to avoid and thereby mitigate the effects of a variety of concurrency bugs.","title":"CAREER: Advanced Methods for Post-Deployment Debugging","awardID":"0953478","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["549944"],"PO":["564388"]},"162655":{"abstract":"This project is for the acquisition of a GPU cluster dedicated to research on High Performance Computing. The selected infrastructure (a cluster of GPUs) presents itself as a serious candidate for the future of High Performance Computing. Indeed, the theoretical cost efficiency(GFlop\/sec\/dollar) and the theoretical power efficiency (GFlop\/sec\/Watt) scores very high compared to current other high performance computing platforms. However, two huge challenges are whether relevant application codes can reach a reasonable fraction of the peak of these computing platforms and how to reach this performance level. The PIs collaborative effort answers these research questions from various angles. The proposed infrastructure is supporting their research on these issues.<br\/><br\/>The codes produced by this collaborative effort are included in well-known software packages (LAPACK, NVIDIA CUBLAS, ScaLAPACK, WRF).","title":"II-NEW: GPU Cluster for Computing Research","awardID":"0958354","effectiveDate":"2010-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["558550","517181",434645,"558541",434647],"PO":["565272"]},"163535":{"abstract":"Measurement of operational Internet infrastructure involves navigating more complex and interconnected dimensions (logistical, financial, methodological, technical, legal, and ethical) than measurement in most scientific disciplines. These challenges impede the collection, coordination, curation, and sharing of data sets to support network architectural, engineering, security, and operations research.<br\/><br\/>This project will make three contributions to the IRNC community's measurement efforts: hosting structured discussions of how to most effectively share IRNC data and statistics; adapting exiting traffic and topology measurement technologies for IRNC community needs based on the resulting feedback; and applying two innovations in data stewardship to IRNC measurements. The measurement software improvements will include support for emerging IPv6 and DNSSEC, anonymization and aggregation for privacy protection, and data formats used by the majority of the IRNC operators, such as netflow output from routers. It will also (optionally) install, deploy, and manage IPv6-capable active measurement nodes at each interested IRNC site. The data stewardship contributions include: (1) experimentation with a recently developed framework for privacy-sensitive data sharing; and (2) prototyping a dissemination (reporting) format aimed at incenting broader participation in globally coordinated Internet measurements.<br\/><br\/>The project will help IRNC operators better understand their networks, and will advance the quantity and quality of data available to researchers in a number of sub-disciplines of network science. The impacts include strengthening activities in network modeling, simulation, analysis, and theoretical research, enabling the IRNC program to play a formative role in the emerging discipline of network science, and enhancing NSF's leading role in sustainable stewardship of cyberinfrastructure.","title":"IRNC-SP: Sustainable Data-Handling and Analysis Methodologies for the IRNC Networks","awardID":"0963073","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0707","name":"Division of INDUSTRIAL INNOVATION & PARTNE","abbr":"IIP"},"pgm":{"id":"7231","name":"CYBERINFRASTRUCTURE"}}],"PIcoPI":["521741"],"PO":["564246"]},"161842":{"abstract":"This project explores hardware and software techniques, as well as programming model considerations, for enabling flexible and dynamic soft error protection. Current hardware error-tolerance mechanisms take an all-or-nothing approach: the user either prepays for worst-case error protection or relies entirely on software to tolerate errors. Neither option is desirable for many applications and usage scenarios, however. Each approach results in wasted resources and squandered performance. The goal is to enable cooperative protection schemes and maximize efficiency by blurring the lines between the hardware and software control of soft error protection. The PI will investigate techniques that allow the hardware designer, software system, and programmer to make optimal decisions for their usage model. The aim is to make error tolerance a first-class optimization option in order to allow users to \"pay for the error tolerance they need, rather than overpay for what they might need\". Applicable scenarios will be studied and analyzed to gauge the advantages to overall system design, effective memory capacity, and performance\/power. The PI will also develop methods for the programmer to explicitly yet abstractly and intuitively express trade off between protection and hardware resources. The approach is based on a new mechanism called ``limited guaranteed precision\", which allows a programmer to selectively protect costly or sensitive portions of a computation. <br\/><br\/>To achieve long-term impact, materials to train developers to realize the benefits of treating reliability as a first-class application property will be developed. The education plan revolves around course modules, problems, and demonstrations at levels ranging from popular and mini-talks suitable for high-school and middle-school, through lower and upper division undergraduate course modules, to in-depth graduate-level study. The project will also introduce students who are not computer scientists\/engineers to scientific computing and systems and train them, thereby increasing US high-end computing competitiveness. The outcome of this research can impact related fields, industry, and society at large by maintaining advances in computational tools for science and engineering.","title":"CAREER: Architectural Mechanisms for Cooperative Reliability","awardID":"0954107","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":[432706],"PO":["366560"]},"161853":{"abstract":"As complex computer systems become ever more pervasive in our society, especially with the increasing deployment of multi-core processors and clusters of servers in the nation's cyber infrastructure, the demand to advance techniques on program analysis and verification has ever been more intensive. Logic-based reasoning techniques have played a fundamental role in assurance of correctness, reliability and security of computer systems. These techniques divide into two categories: general-purpose theorem proving and specialized decision algorithms. Theorem provers, enjoying a high degree of inference completeness, can prove sophisticated properties but require human guidance in general. On the other hand, decision algorithms, though confined within specialized domains, can automatically discharge a large amount of constraints. It has long been a challenge to combine the merits of the two kinds of techniques to produce a new generation of analysis tools that can handle a wide range of constraints with a high degree of automation. This research is to answer this challenge by building powerful decision theories as well as practical tools for reasoning about high-level data structures that are widely used in advanced programming languages and algorithms. The results would have wide and immediate applications in system analysis, improving the precision and scope of static and runtime analysis techniques.","title":"CAREER: Advanced Decision Procedures forWords, Trees and Lists","awardID":"0954132","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["510759"],"PO":["565264"]},"161743":{"abstract":"CAREER: A computational framework for mapping ligand migration channel networks and predicting molecular control mechanisms - Project Summary<br\/>Proteins are fundamental elements of living organisms. They are marvelous microscopic bio-machines that function in a steady, predictable manner. Together with other elements such as DNA, they make up the basics that underlie the complexity of life. The quest to know how these bio-machines work has inspired intense scientific curiosity and imagination. Since most functions are carried out dynamically and are difficult to observe directly from experiments, computational methods have an important, irreplaceable role to play.<br\/><br\/>The objective of this proposal is to map out the ligand migration channel networks inside proteins and determine the molecular control mechanisms by which these channels are regulated dynamically. To overcome the limitations that existing methods face, the project will develop and employ a novel, efficient computational framework that draws one of its inspirations from path planning in robotics, as a ligand?s migration in a dynamic protein resembles closely a mobile robot?s navigation in a dynamic environment. The proposed approach will overcome the computational barrier by integrating efficient geometric mappings with the dynamic exploration of a protein?s structure flexibility. By taking as input the structure ensemble of a given protein, which may be composed of existing experimental structures and\/or conformations generated from molecular dynamics simulations, the proposed method carries out a spatial mapping of the protein?s inner space at each conformation in the ensemble. The spatial mapping reveals the partial connectivity of the cavities and channels inside the protein. All partial maps are then merged to form a super-graph that represents the complete migration channel network that is accessible to the ligand, spatially and dynamically. The method will be applied to map out the ligand migration channel networks in a family of proteins and to study the similarities and differences in the ligand channel networks across the family, which is novel. Moreover, since the channel network is mapped for each individual conformation in the ensemble, direct correlation data between conformation changes and variations in channel sizes will be collected and analyzed to identify the key conformation changes that regulate these channels. Key residues that are responsible for the key conformation changes will then be identified. <br\/><br\/>As a university professor, the PI has observed the prevalent lack of motivation and inspiration in undergraduate classrooms and the need for more inspired training in creative thinking among graduate students. To address these pressing needs, the education objectives of this proposal are: i) to infuse scientific curiosity and motivation into the undergraduate classrooms, ii) to train motivated undergraduate and graduate students to become creative thinkers, and iii) to spread the excitement of learning and discovery to the community, to junior high and high school students. The PI believes that the inter-disciplinary nature of his research should provide invaluable resources to engender scientific curiosity and to inspire cross-disciplinary creative thinking among the students. <br\/><br\/>Intellectual merits: the project will develop a novel computational framework for mapping ligand migration channel networks. Upon completion of this project, it is expected that a clear understanding of the control mechanism by which ligand migration channel networks are regulated will have been developed. Key control residues, or molecular switches, will be identified. The precise roles of protein motions and dynamics will be delineated. Such an understanding of functional mechanisms can be used to interpret the existing experimental results or make new predictions that can guide future experiments.<br\/><br\/>Broader impacts: the proposed research activities will be closely integrated with education activities. The PI?s interdisciplinary research will be used to cultivate scientific curiosity and cross-disciplinary creative thinking among students, especially for women, underserved minorities and the disabled. The project will create ample opportunities for undergraduate and graduate students to participate in research and to be trained to become creative thinkers. The research results will be broadly disseminated through journal publications and conference presentations. The computational framework developed in this project will provide the scientific community with an invaluable tool that can be adapted to study the molecular control mechanisms of many other bio-molecules.","title":"CAREER: A Computational Framework for Mapping Ligand Migration Channel Networks and Predicting Molecular Control Mechanisms","awardID":"0953517","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[432501],"PO":["565223"]},"163833":{"abstract":"This project examines wireless communication networks whose nodes have batteries that recharge by harvesting energy from the environment. Energy harvesting can yield a network that lasts as long as the network's hardware and intended purpose remain viable; this may be arbitrarily longer than the lifetime of any suitable single-charge battery. While average-power minimization is adequate to describe the lifetime of a device with a single-charge battery, a complete characterization of a network of rechargeable devices will depend on how the batteries are replenished. Given the broad variety of energy recharging systems, including solar cells, vibration absorption devices, wind and water mills, and thermoelectric generators, battery recharging is modeled as an environmental stochastic process. This project applies analytical models for battery recharging to evaluate fundamental multiple access, broadcast and relay network models composed of rechargeable nodes. The project objective is an enhanced understanding of the analytic fundamentals of rechargeable networks in order to contribute to the development and ultimate deployment of ecologically-friendly rechargeable networks.","title":"NeTS: Medium: Collaborative Research: Rechargeable Networks","awardID":"0964364","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["550356"],"PO":["565303"]},"161787":{"abstract":"Game Theory occupies an important place in the foundations of multi-agent systems in artificial intelligence. Research under this award focuses on settings where one agent can commit to her (possibly randomized) strategy before the other agent moves. We consider how to compute optimal strategies to commit to in games with a combinatorial structure, extensive-form games, and repeated\/stochastic games. Among other topics are connections to learning in games and mechanism\/environment design, and the implications of commitment for the efficiency of computing game-theoretic solutions more generally.<br\/><br\/>The main objective of the research is to make scientific contributions to artificial intelligence, multi-agent systems, and computational game theory, but to also advance real-world applications. For example, other researchers have expanded on the PI's prior theoretical research (with his PhD advisor) to apply the commitment framework to security applications, such as the placement of checkpoints and canine units at Los Angeles International Airport and the scheduling of Federal Air Marshals. The research performed under this award aims to provide a solid scientific foundation for improving and expanding this and related applications. The award also helps to build connections between computer science and economics, the traditional home of Game Theory. This interdisciplinary link can help diversify the computer science community, intellectually and demographically. Research is tightly integrated with the PI's educational efforts, which include the development of courses in Computational Microeconomics and Game Theory and an approved Computational Economics minor.","title":"CAREER: New Directions in Computing Game-Theoretic Solutions: Commitment and Related Topics","awardID":"0953756","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["556682"],"PO":["565035"]},"162645":{"abstract":"In the last two decades there has been a great deal of interest among scholars, business leaders, and the general public in real-time interactive 3D computer graphics for inmersive virtual environments, in which the user wears a head-mounted display and his\/her movements are tracked by sensors. This technology offers great promise as a natural means of interacting with computer-generated environments. To date, however, immersive virtual environments have had difficulty accommodating multiple users, due both to a lack of available space and because of the inherent risk of collision when multiple users, each effectively blindfolded by a head mounted display, walk in the same area. The PI and his team have created a unique system called the HIVE (for Huge Immersive Virtual Environment) on the campus of Miami University in Oxford, Ohio. This is the world's largest indoor immersive virtual environment by a factor of four, offering precise, wireless, untethered tracking of users in a 1000 m2 gymnasium. Additionally, the team has developed effective software algorithms that imperceptibly steer users towards the HIVE's center and away from its walls, a capability that can be leveraged to steer multiple users around each other to prevent collisions. Despite these advances, there are three ways in which the HIVE's capabilities need to be further enhanced to support multiple users:<br\/><br\/>1. The HIVE currently possesses only two wearable rendering systems; several more are needed to pursue multi-user applications.<br\/><br\/>2. The HIVE's optical position tracking system was designed for much smaller tracking volumes, and needs to be upgraded to support robust multi-user simulations.<br\/><br\/>3. Substantial effort will be required to enhance the HIVE's existing software base to include functionality such as collision prediction algorithms that can support multiple users.<br\/><br\/>This is funding to provide these enhancements to the HIVE's existing hardware and software infrastructure, which will have an immediate effect on its utility for research, education, data visualization, and training.<br\/><br\/>Broader Impacts: The enhanced infrastructure will enable research in computer science that: (a) develops, evaluates, and compares 3D user interfaces; (b) develops algorithms for collision detection and multi-user redirected walking; (c) explores the use of inertial sensors for position tracking in portable virtual environments; and (d) develops tools for collaborative computing environments. Additional behavioral research enabled by this funding will aim to improve our understanding of how humans learn and remember large spaces, and of the social dynamics of users who cohabit a computer simulation. The improved infrastructure will also have a dramatic impact on educators who use the HIVE, by enabling: (a) several students and an instructor to be simultaneously involved in educational simulations; (b) new opportunities for hands-on student projects, particularly those that involve partnerships with industry clients to develop real-world products, services, and interactive media; and (c) the digital preservation and demonstration of culturally important spaces.","title":"Enabling Large-Scale Multi-User Immersive Virtual Reality Simulations","awardID":"0958303","effectiveDate":"2010-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["438562","438563"],"PO":["565227"]},"162667":{"abstract":"This project develops the DARwIn-miniature-humanoid-robot platform with advance computational power, sophisticated sensors, high payload capacity, and dynamic motion ability to enable many exciting research, education, and outreach activities. Two models of DARwIn robot, DARwIn-HP (High Performance) and DARwIn-LC (Low Cost), will be designed, fabricated, and built for distribution to 11 partner universities (including major research universities, RUI institutions, a women's college, and two local high schools) to establish a humanoid-robotics community. The project engages the humanoid-robotics community in a concerted effort to advance humanoid robotics.<br\/><br\/>The research results from the humanoid-robotics community will find applications in assistive robotics technology for the elderly, intelligent humanoids, and homeland security and the military. The partner universities will utilize DARwIn robots in their classroom teaching and projects as well as outreach activities to recruit high-school students and encourage them to select computer science or engineering for their career choices. An annual workshop will be organized and a website will be developed to broaden the DARwIn project and disseminate results. Public demonstrations of the robots at various high-impact events such as FIRST robotics competitions will capture the minds of K-12 students and promote interest in computer science and engineering among them.","title":"CI-ADDO-NEW: Collaborative Research: Development of DARwIn Humanoid Robots for Research, Education and Outreach","awardID":"0958406","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["435880"],"PO":["543539"]},"163888":{"abstract":"This project examines wireless communication networks whose nodes have batteries that recharge by harvesting energy from the environment. Energy harvesting can yield a network that lasts as long as the network's hardware and intended purpose remain viable; this may be arbitrarily longer than the lifetime of any suitable single-charge battery. While average-power minimization is adequate to describe the lifetime of a device with a single-charge battery, a complete characterization of a network of rechargeable devices will depend on how the batteries are replenished. Given the broad variety of energy recharging systems, including solar cells, vibration absorption devices, wind and water mills, and thermoelectric generators, battery recharging is modeled as an environmental stochastic process. This project applies analytical models for battery recharging to evaluate fundamental multiple access, broadcast and relay network models composed of rechargeable nodes. The project objective is an enhanced understanding of the analytic fundamentals of rechargeable networks in order to contribute to the development and ultimate deployment of ecologically-friendly rechargeable networks.","title":"NeTS: Medium: Collaborative Research: Rechargeable Networks","awardID":"0964617","effectiveDate":"2010-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["463100"],"PO":["564993"]},"161854":{"abstract":"Overlay anonymity systems like Tor are effective against many kinds of attacks<br\/>on privacy, but they have significantly slower network performance than regular<br\/>Internet traffic. The purpose of this project is to explore the design of<br\/>anon.next, an anonymity system for the next-generation Internet. In anon.next,<br\/>we embed anonymizing proxies into new Internet architectures, so that the<br\/>network itself can provide efficient and effective privacy protection in a way<br\/>that overlay designs cannot. This project seeks to make major advances in two<br\/>areas key to the design of anon.next. First, methods to construct<br\/>high-throughput paths of anonymizing proxies to route the user's packets to<br\/>their destinations with minimal leakage of privacy. Second, secure methods to<br\/>locate those proxies without relying on centralized directory servers or<br\/>exposing the users' packet routes. Both components require us to develop new<br\/>metrics for the privacy provided by a given anonymizing path and by the system<br\/>as a whole. We are conducting analysis and simulation studies and validating<br\/>these with extensive experimentation on GENI testbeds. These efforts will<br\/>provide major insights into the design of anonymity systems, which provide<br\/>personal privacy as well as censorship resistance and protection for<br\/>whistle-blowers, journalists, and intelligence services. Our project is also<br\/>part of the large effort required to understand and design distributed systems<br\/>in the next-generation Internet. This project involves students at many levels,<br\/>including middle and high school students in summer camp settings,<br\/>undergraduate students in research into finding new attacks against our<br\/>systems, and graduate students.","title":"CAREER: anon.next: Privacy-Enabled Routing in the Next-Generation Internet","awardID":"0954133","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["561003"],"PO":["564223"]},"161645":{"abstract":"The goal of this research project is to allow database users to enjoy high quality personalized answers for their spatial and spatio-temporal queries, without sacrificing the query execution efficiency. As the concept of personalization is subjective, there are plethora of approaches that define the meaning and contents of a high quality personalized answer. This project does not aim to provide more definitions of personalization, instead, it provides a system-oriented approach that can accommodate most of the existing and future definitions in one highly efficient database engine. <br\/><br\/>To achieve its goal, this project employs an extensible approach where core database modules for personalized queries are realized only once inside the database engine, and used many times in different ways to support a wide variety of personalized queries. The project provides such extensible core modules for:<br\/>(a) single-table operations, e.g., selection and aggregations,<br\/>(b) multi-table operations, e.g., join, <br\/>(c) operations with adaptive cost that can only be computed online, and <br\/>(d) handling uncertain data. <br\/>With these extensible modules, registering a new personalization definition becomes as easy as plugging few modules in an easy-to-use interface. Once plugged in, the new personalized definition lives in the database engine, and enjoys the power of the extensible modules for query processor, optimizer, and indexing. <br\/><br\/>Such extensible approach is highly attractive to industry as it gives minimal changes in the database engine to support wide variety of personalized queries, as well as orders of magnitude performance over existing approaches that are built on top of database systems. Besides its impact on industry, this project will have significant broader impact across multiple segments of society that include enhancing productivity, graduate and undergraduate student education, outreach to K-12 students, curriculum development, and tutorial presentations. Publications, technical reports, open-source software, and experimental data from this research are disseminated via the project web site (http:\/\/www.cs.umn.edu\/~mokbel\/career).","title":"CAREER: Extensible Personalization of Spatial and Spatio-temporal Database Management Systems","awardID":"0952977","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518156"],"PO":["563751"]},"170478":{"abstract":"The objective of this workshop is to bring together PIs and co-PIs currently in their second year of a research project funded by the Information, Integration and Informatics Program at the National Science Foundation along with selected industry and government invitees to discuss current research, as well as identify and elaborate on current challenges and future directions.<br\/><br\/>The growth in scale, diversity and complexity of data has increased the demand for understanding and effectively utilizing large amounts of heterogeneous data. The Information Integration and Informatics (III) program focuses on the processes and technologies involved in creating, managing, analyzing, visualizing, and understanding heterogeneous data, information and knowledge in order to enable intelligent actions throughout the knowledge life cycle. Given the III focus, the workshop goals include: (1) Analyzing the research and development issues of problems that are fundamental in making progress toward understanding complex data, information, knowledge and processes; (2) Specifying current and new areas where major breakthroughs appear possible; (3) Identifying needed collaborations (e.g., inter-disciplinary, academic-industry, international, inter-agency); and (4) Identifying research initiatives and facilities needed to meet current and future challenges.<br\/><br\/>The workshop is expected to have a significant impact for the participants and the broad Information, Integration and Informatics (III) research community. The participants will have an opportunity to explore fruitful collaboration and synergism by sharing accomplishments, providing demonstrations and interacting with each other. Workshop discussions will also focus on the objectives, contributions and challenges of major research activities funded by the Information, Integration and Informatics program and future research directions and activities for the III community. The workshop results, including new research directions that will be identified will be broadly publicized to the research community through publications and the workshop website (http:\/\/cs.georgetown.edu\/NSF-III-2010\/). The results dissemination is expected to inform and motivate III research community in their research, collaborative and education activities, and spur other innovative research directions.","title":"2010 Information, Integration and Informatics PI Workshop","awardID":"1027153","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["518332","550401","557843"],"PO":["563751"]},"161788":{"abstract":"The widespread use of software in our society has created unprecedented demand on software availability. Unfortunately, memory management bugs, a major category of common software defects, severely affect system availability. Previous studies have shown that memory management bugs account for 43% of the reported software failures. According to the Vulnerability Notes Database maintained by the U.S. Computer Emergency Readiness Team, memory bugs are dominant in recent vulnerability reports. Memory bugs remain prevalent and challenging to handle during production runs mainly because of three reasons. First, memory bugs are deterministic, failing traditional fault tolerance methods. Second, memory bugs manifested during production runs are hard to reproduce off-site, making them difficult for diagnosis. Third, modern computing trends such as cloud computing and multi-core enable larger and more complicated software, causing memory bugs to slip into the field more easily.<br\/><br\/>This project addresses the above challenges. The investigator employs a systematic approach for providing immunity to memory bugs during production runs. The main idea is to perform online diagnosis once a memory bug or failure is detected, then generate and apply runtime immune patches to the running program for surviving and preventing memory bug occurrences or failures caused by memory bugs. The research hinges on the following synergistic thrusts: (1) runtime support of diversified program execution environments for safely and efficiently surviving and preventing memory bug occurrences or failures, which addresses the determinism issue of memory bugs; (2) new algorithms for low-overhead bug diagnosis, which are applied on-site for easy reproduction of memory bugs and best exploitation of on-site bug\/failure information; (3) operating system support for lightweight checkpointing and re-execution mechanisms for multi-threaded programs<br\/>on modern multi-core systems.","title":"CAREER: Building Immunity to Memory Management Bugs during Production Runs","awardID":"0953759","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["550532"],"PO":["565272"]},"163878":{"abstract":"It is widely estimated that one in four computers is part of a botnet, and therefore under the control of an attacker. These computers are used to loot bank accounts, send spam, and perform DDoS (Distributed Denial of Service) attacks. The attacker almost always gains control of these computers by remotely attacking applications or the operating system on which these applications depend. The robustness---the ability to withstand attack---of the operating system has long been known as essential to produce secure systems. But even the most robust operating system cannot prevent applications from being exploited, and therefore has a limited effect on application robustness.<br\/><br\/>This project investigates the effect of the operating system on application robustness, and in particular the effect that the operating-system interface (the architecture and details of its system calls) has on the ability to write more robust applications. In particular, this project seeks to eliminate pitfalls in system calls; these pitfalls lead to security holes and make application development much more difficult. Eliminating pitfalls (and thus the resulting security holes) makes it more difficult to successfully attack applications. To evaluate the extent to which pitfalls can be eliminated, this project is building a operating system called Ethos. The Ethos interface will be analyzed and evaluated on its own and versus those in traditional operating systems.","title":"TC:Medium: The impact of operating systems on application robustness","awardID":"0964575","effectiveDate":"2010-03-15","expirationDate":"2014-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":[438703,"548359"],"PO":["565239"]},"162911":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59584<br\/>PI(s): Noubir, Guevara<br\/> Basagni, Stefano; Desnoyers, Peter; Vona, Marsette A.<br\/>Institution: Northeastern University <br\/>Title: MRI-R2\/Dev.: Second-Generation Applications-Driven Wireless Sensor Networking Instrument<br\/>Project Proposed:<br\/>This project, developing a multi-purpose wireless sensor networking instrument, supports the specific experimental research needs of cross-layer protocols for heterogeneous sensor networks and key applications such as search and rescue by swarms of robots, buildings structure health monitoring, and hand and patient motion tracking. The instrument enables<br\/>- Research and education for developing and experimenting with protocols and algorithms for a future generation of wireless sensor networks,<br\/>- Cross-cutting research and education in application areas of key interest to the society and the institution.<br\/>This work enhances the support of existing mechanisms of today's wireless sensor networks such as security, energy efficiency, and reliability by using a more capable second systems on chips at an order of magnitude lower cost and within a significantly smaller package than today's solution. Additionally, inexistent capabilities that enable research are designed and integrated in the target multi-disciplinary application areas; these include:<br\/>- Directional antennas for localization, and interference-cancellation, using a combination of low-cost mechanical and electronic beam-forming techniques (outperforming purely electronic smart antennas). This improves communication capacity and robustness against unintentional and malicious interference. It will be fitted on mobile robots and combined with ultra-sound transceivers for faster localization of transmission sources in search and rescue missions.<br\/>- Ultralow-power with multi-radio support including wakeup-radios, enabling asymmetric communication architectures, and allowing deployed sensor nodes to last for over a decade without battery changes.<br\/>- Nodes hardware, software, and network design architected for ease of composability to quickly integrate specific hardware components of new applications such as wideband reduces personnel in the development microelectronic mechanical systems (MEMS) ultrasound transceivers, MEMS accelerometers, flash storage, and also interfaces with a variety of robots and off-the-shelf components (e.g., miniSD GPS).<br\/>Broader Impacts: <br\/>This project fosters a wider use of wireless sensor networks in application areas of national importance, namely, emergency preparedness and health science. All the instrument components are open-sourced including the schematics, printed circuit board (PCB) layouts, and software with adequate documentation, thus enabling other institutions to easily extend and build copies of the instrument at low cost. The work fosters the development of the next generation application-driven wireless sensor networks widening the use of such networks both in research and education. Several education kits and evaluation systems will be made available to other academic groups. Dissemination workshops will also be organized for application and module developers. The instrument will be used in several multi-disciplinary courses bridging CS, EE, ME, and CE.","title":"MRI-R2: Development of a Second-Generation Applications-Driven Wireless Sensor Networking Instrument","awardID":"0959584","effectiveDate":"2010-03-15","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["518182","501972","499280","501974"],"PO":["557609"]},"161833":{"abstract":"Dedicated digital signal processing (DSP) is a key technology for a diversity of embedded applications. Recently, underwater autonomous distributed systems have received growing interest in aquatic observation and exploration. These systems pose significant challenges for sustainable signal processing due to the high communication cost and new constraints on energy supply in the harsh underwater environment. The relatively mature and predictable energy harvesting techniques are either not applicable in the underwater environment or do not offer sufficient capabilities. This raises dual challenges to the design of dedicated DSP for cyber-aquatic systems with respect to what alternative energy sources are available and how to effectively and reliably utilize renewable energy.<br\/><br\/>This CAREER project seeks to overcome these challenges arising at the cyber-aquatic interface. The goal is to develop a new DSP design framework that allows dynamic tuning of system complexity\/performance and energy-efficiency levels in adaptation with renewable underwater energy sources. The results from this research will enable sustainable cyber-aquatic systems that have great potential for innovations but have remained largely unexplored so far. Design tools and optimization methods developed from this project can be applied to a wide range of embedded applications powered by various energy sources.<br\/><br\/>The education component of this project seeks to strengthen interdisciplinary education through a dynamic curriculum that builds on this research project. Through industry collaboration and outreach programs at UConn, this project will offer research opportunities to students especially women and underrepresented minority students, and enhance engineering awareness and interests among high-school students.","title":"CAREER: Embedded DSP with Underwater Renewable Energy: Towards Sustainability for Cyber-Aquatic Systems","awardID":"0954037","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["491358"],"PO":["565255"]},"161855":{"abstract":"Cyber security, like security in the physical world, relies upon investigation methodologies that piece together dispersed evidence spread across multiple places, and come to a conclusion on what security breaches have happened and how they happened. While effective evidential reasoning based on manual analysis are used in the physical world by law-enforcement agencies, in the cyber world we need automated reasoning methodologies to handle the automated cyber attacks against our nation's information infrastructures every day. This research aims at discovering and developing such automated reasoning methodologies. The problem is difficult due to the uncertain nature of such reasoning, which is compounded by the characteristics of cyber attacks.<br\/><br\/>The uncertainty in cyber security comes from two sources. The first is the uncertainty from not knowing the attacker's actions and choices. Since hackers are essentially invisible in the cyberworld, we have to rely upon various types of sensors that report symptoms of potential attacks. The second source of uncertainty comes from these sensors. Since in most cases the symptoms of cyber<br\/>attacks significantly overlap with symptoms from benign network activities, it is not possible to rely on a single sensor to give an absolutely correct judgment on whether an attack has happened and succeeded. A key question is how to use these imperfect sensors to conduct reasoning so that one can come up with almost certain conclusions regarding a system's security status. <br\/><br\/>This challenge of reasoning under uncertainty is not new. In the past four decades computer science researchers have developed an array of reasoning models and methods for uncertainty, especially in the area of artificial intelligence. However, the emergence of cyber threats poses a new<br\/>challenge to this problem. The existing methodologies typically require a knowledge-engineering process to build a knowledge model for the problem domain. This has worked reasonably well with the more static and well-behaved problem domains such as disease diagnosis. A key difference between these problem domains and cyber security is that the latter has to deal with an active<br\/>malicious attacker who will try to break whatever assumptions made in the reasoning model. For this reason, the knowledge model for cyber security cannot be static because then they can be easily evaded. What will be an effective and practical knowledge engineering approach to handle the uncertainty in cyber security is the biggest open problem that needs to be answered from the<br\/>research.<br\/><br\/>This research adopts an empirical, bottom-up approach to tackle the above challenges. Instead of starting from the existing theories, the PI will start from empirical study on how a human security analysts would reason about cyber events and try to capture the essence of the reasoning in the process. Then, the PI will carry out this empirical study by running intrusion detection sensors on production networks and work with system administrators to understand and reason about the alerts. The next step is to develop a reasoning model that simulates the human reasoning process, and apply the automated reasoning engine on fresh new data to see how it fares. In this spiral theory development process the PI can always make sure that the methodologies are applicable to real cyber-security analysis and constantly find gaps in the model that reveal what will be the most appropriate theories and how to apply them in this problem. The eventual goal is to find the right theoretical framework for reasoning under uncertainty in cyber-security, and validate such theories through repeatable experiments on data from production systems.<br\/><br\/>This research is tightly integrated into the PI?s education efforts both for students and targeted at the society at large. The empirical nature of the research provides a valuable venue for dialogue between security practitioners and researchers, which will result in a two-way education process: students working on the project can acquire the essential skills of applying advanced knowledge to a practical problem; and security practitioners like system administrators can learn the state-of-the art in cyber security technology through collaborative work with the research team. The empirical study carried out from the research will provide endless data and examples to refresh the materials of the cyber-security courses taught by the PI. New courses with a focus on uncertainty in cyber security defense will be developed. There will be a number of undergraduate students who take part in the research efforts, which will provide a unique education experience for them. Moreover, the test-bed infrastructure produced from the research will also be used as an education platform for the general public about cyber-security problems, with the help of the out-reach programs already established at Kansas State University.","title":"CAREER: Reasoning under Uncertainty in Cybersecurity","awardID":"0954138","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["548367"],"PO":["565136"]},"161756":{"abstract":"The performance of computers has improved tremendously in the past four decades, which has enabled innumerable applications that have major roles in our daily lives. However, without dramatic innovations in improving power efficiency of computing, the continued semiconductor device scaling alone will fail to provide sufficient performance for the future computing capabilities. For the emerging challenge, the proposed research investigates revolutionary computing paradigms to process, comprehend, and use abundant data in an extremely efficient way. The novelty of the approach lies in developing power- and performance-efficient computing systems with software support by exploiting the characteristics of future workloads that often use complex probabilistic mathematical models of physical phenomena. In such applications, approximate computing can often result in satisfactory outcomes. Meanwhile, it can dramatically decrease power consumption or increase performance by replacing complete logic functions with simplified circuits that mimic the functions for rough calculations. To extend the approximate computing concept to more general-purpose computing systems, the following holistic approaches are proposed: 1) intelligent microarchitectures to identify correctness-non-critical regions of code with compiler support; 2) approximate computing engines to execute such regions of code power and performance efficiently; 3) high-level morphic primitives to process a large fraction of workloads with orders-of-magnitude greater power and performance efficiency; and 4) flexible architectures to allow programmers and users to trade the quality of computing with the efficiency. <br\/><br\/>The proposed research will have a specific and significant impact on the computer architecture, circuit, and compiler communities since it requires analysis of interesting and representative workloads; realization of state-of-the-art circuit, architecture, and compiler infrastructure; and invention of powerful and useful evaluation methodologies. Since most of the development and research work will be conducted by graduate students, both industry and academia will benefit from well-educated and trained employees as well as direct technology transfer when students graduate and begin employment elsewhere. Finally, the success of this research will tremendously benefit our ability to advance human?s collective knowledge in science, technology, business, medicine, and virtually every other field of human endeavor by allowing remarkable improvement in computing performance.","title":"CAREER: Approximate Computing Systems for Future Teraflops Workloads","awardID":"0953603","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["517586"],"PO":["366560"]},"162647":{"abstract":"Scalability is one of the key challenges to computing with hundreds if not thousands of processor. Yet, testing software at scale with hundreds of processing cores is impossible if system software with privileged access rights needs to be modified. The inability to change system software at will in large-scale computing installations thus impedes progress in system software.<br\/><br\/>This project creates a mid-size computational infrastructure, called ARC (A Root Cluster), that directly supports research into scalability for system-level software solutions. ARC empowers users temporarily with administrator (root) rights and allows them to replace arbitrary components of the software stack. Such replacements range from entire operating systems over drivers, kernel modules to runtime libraries, middleware and system tools.<br\/><br\/>ARC ultimately enables a multitude of systems research directions to be assessed under scalability that could otherwise not be conducted. Through ARC, methodologies for scalability of experimental system software in various institutional projects and beyond can be explored and systematically improved. ARC is positioned to benefit the software systems community and indirectly science in general by this assessment of system software requirements at scale.","title":"II-NEW: ARC: A Root Cluster for Research into Scalable Computer Systems","awardID":"0958311","effectiveDate":"2010-03-01","expirationDate":"2013-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["502081","549981",434616,434617,"553590"],"PO":["535244"]},"161823":{"abstract":"Data-driven model reduction has enabled astonishing speedups in physical simulation. We can now experience interactive simulations of three-dimensional fluids and other complex phenomena that were impossible with traditional techniques. However, this approach's central limitation is inflexibility. Even small changes to the simulation domain require complete recomputation of the model. Moreover, the approach has been limited to a small class of dynamical systems. In this project, the PI seeks to radically generalize model reduction so that it is reconfigurable at runtime, handles a far greater range of phenomena, and supports heterogeneous coupling between reduced systems. The core goal of this research is to enable interactive simulations with the speed of model reduction, but without its inflexibility. The tension between these goals brings to light fundamental questions. What kinds of flexibility and runtime reconfigurability are possible? What kinds of reduced models maximize runtime flexibility? How can dynamical systems be projected onto these models? What is the broadest possible class of phenomena to which we can apply model reduction? How can we couple the model reduced dynamics across heterogeneous systems? The answers to questions such as these will provide a deeper understand of the conditions under which low-dimensional representations can successfully represent complex dynamical systems. The PI's approach will be to subdivide his research goals into three challenge areas: modular and deformable bases; particle systems and non-polynomial dynamics; and model coupling. Success within these areas will greatly increase the flexibility and extensibility of model reduction techniques, bringing us closer to interactive simulation of rich, heterogeneous virtual environments. The PI will also explore several advanced technologies enabled by these theoretical advances.<br\/><br\/>Broader Impacts: Solving these challenges will be a transformative development directly applicable to a wide range of challenging fields including medical research, engineering, industrial design, architecture, training, and education. The interactive simulation of complex dynamics will allow people to rapidly explore physical design spaces, improve controllers for airplanes and other nonlinear systems, provide training for dangerous or remote environments, provide time-critical simulation for disaster scenarios, and will be a valuable tool for education. Interactive simulation will also allow students to play with remote phenomena, from wiggling proteins to curling smoke; interactively manipulating these structures will reveal concepts such as why a protein's helices are more rigid than its loops. Students could even modify the laws of physics; replace the famous force equals mass times acceleration with force equals mass times velocity and you find yourself in a strange molasses-like world where a rolling ball comes to rest as soon as it's no longer being pushed. In such impossible worlds, abstract equations suddenly resonate with truth.","title":"CAREER: Next-generation Interactive Simulation","awardID":"0953985","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["491767"],"PO":["565227"]},"161713":{"abstract":"Cognitive radio (CR) is a revolutionary wireless communication paradigm in which cognitive (secondary) users are able to observe, learn, optimize, and intelligently adapt for spectrum utilization without interfering with traditionally licensed (primary) users. Yet, the major technical challenges remain: First, to avoid interfering with primary users, the cognitive users must explore and sense the spectrum opportunities to determine whether there are ongoing activities before data transmission. Second, a critical issue is dynamic and opportunistic resource allocation over time-varying heterogeneous interfering environments. Third, due to hardware limitation, each cognitive user should distributively choose the candidate channels to either sense or access (i.e., exploration and exploitation). To overcome these challenges, the novel cooperative game theory methods are employed that emphasizes mutual benefit management with simple distributed solutions. For different problems and scenarios, this research project investigates three categories of cooperative games: Canonical Coalition Game, Coalition Formation Game, and Coalition Graph Game. The schemes and frameworks are implemented using the hardware\/software platform in the newly established Wireless Networking, Signal Processing, and Security Lab at the University of Houston. The expected research results are publicly available for other researchers worldwide through conference\/journal publications and via shared codes on the lab website. The education plan focuses on an outreach program that integrates campus summer camps for high school-age women\/minority students. It also engages graduate and undergraduate students in research. The goal of this project is to improve CR network performance through the game theoretic point of view and to enhance women\/minority participation in engineering.","title":"CAREER: Mutual Benefit in Cognitive Radio Networks: A Coalitional Game Framework","awardID":"0953377","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["540080"],"PO":["557315"]},"162703":{"abstract":"Meetings provide unique knowledge sharing opportunities and are an efficient way of interaction between people with different expertise areas. Such human communication in stored audio form has rapidly grown in recent years, providing ample source material for later use. In particular, the increased prominence of search as a basic user activity has meant that the ability to automatically browse, summarize, or graphically visualize various aspects of the spoken content has become far more important. There are several studies on representation and detection of various types of events in multiparty conversations, such as agreement\/disagreements and decisions. However, there is no consensus on how to represent structure of meeting discussions, to be used later for human browsing or in further automatic processing, such as summarization.<br\/><br\/>This planning project works towards a research infrastructure for a better understanding of meeting structure, and aims to organize a community effort in the form of a workshop, to identify the consensus needs of the meeting processing research and education community, for enhancing the existing and widely used ICSI meetings corpus with annotations of structure of meeting discussions. Such annotations are critical in initiating research on automatic detection and annotation of meeting discussions, and would also be useful for research on meeting visualization, browsing and summarization. Furthermore, such an infrastructure would provide students and researchers in natural language and speech processing a framework to experiment with and enable social scientists interested in interactional structures to develop more robust analysis mechanisms. The workshop discussions will contribute to the decision on an annotation schema and the design of annotation guidelines, with a small set of sample annotated meetings, which will be made publicly available.","title":"CI-P: Towards a Consensus Representation for Understanding Structure of Multiparty Conversations","awardID":"0958561","effectiveDate":"2010-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["550775",434792],"PO":["565215"]},"161757":{"abstract":"Wireless sensor networks play an important role in a wide variety of applications such as environment monitoring and battlefield surveillance. The basic function of a wireless sensor network is to monitor its deployed region and transport sensor data to certain designated nodes. Therefore, coverage, capacity, and connectivity are three most fundamental properties for the operation and performance of a wireless sensor network. A deep understanding of these properties and their interrelationship is of great importance for the network planning, algorithm design, and performance of wireless sensor networks.<br\/><br\/>This project aims to establish a strong theoretical foundation and design practical protocols to provide high performance coverage, capacity, and connectivity in wireless sensor networks. Wireless sensor networks have many unique characteristics differing from other wireless networks, including heterogeneous sensing, communication, and mobility capabilities of sensor nodes, limited infrastructure and power supply, and traffic pattern where data mainly flow from sensors to data sinks rather than between peer nodes. This research integrates the concepts and techniques in wireless communications, stochastic modeling, geometry, and combinatorial optimizations to construct analytical models and develop practical solutions.<br\/><br\/>The expected outcomes include: (i) fundamental limits of the coverage, capacity, and connectivity under various network scenarios; (ii) efficient algorithms for robust coverage, connectivity, and data transportation; (iii) a test-bed to validate the analytical results and evaluate the performance of algorithms via real experiments. This project also includes a strong educational component that promotes teaching, training, and learning through the active involvement of research students.","title":"CAREER: Coverage, Capacity, and Connectivity of Wireless Sensor Networks","awardID":"0953620","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["451664"],"PO":["565303"]},"161768":{"abstract":"Compilers are a critical component between the software developer and the computer. They translate application written by software developers into machine code that is processed by the computer. An important task of a compiler is to optimize applications so that they run efficiently. Traditional methods to develop optimizing compilers are ad-hoc, labor-intensive, and ineffective. As a consequence, optimizing compilers for a new processor often produces code that achieves only a fraction of the machine?s available performance. This is especially true for today's multi-core architectures, which are parallel processors on a single chip. This research will involve investigating techniques from the artificial intelligence community that will allow a compiler to automatically adapt and tune to new architectures. In effect, this research will replace hand-tuning with self-tuning compilers that adapt software automatically to match the performance characteristics of each target architecture.<br\/><br\/>In this project, the PI proposes to explore the viability of developing adaptive compilers for multi-core environments (ACME) to allow application portability while still achieving high performance. The PI will create a statistical auto-tuning framework to support the probabilistic representation of the following features: the benefit analysis of optimizations, the identification and prediction of the appropriate runtime environment for different optimizations, and the generation of executables that efficiently combine several optimized code versions. He will invent components to measure accurately the characteristics of applications and targeted computing systems. The PI hopes to discover techniques to replace ?traditional? optimization benefit analysis with powerful machine learning models. These models will address the broad spectrum of parallel applications and multi-core environments, and they will be able to analyze and predict benefit under different dynamic contexts.","title":"Career: An Adaptive Compiler for Multi-core Environments","awardID":"0953667","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["558848"],"PO":["565272"]},"161537":{"abstract":"This work investigates new methods to provide operating system support for hybrid computing systems. A hybrid system includes one or more instruction-based processors coupled with accelerator logic that exploits application parallelism to increase performance. The work focuses on accelerators constructed from reconfigurable hardware, such as field-programmable gate array (FPGA) logic. Reconfigurable hardware also reduces energy by directly implementing the needed computation instead of fetching, decoding, and executing instructions. Future work will extend the investigation to other types of accelerators, such as general-purpose graphics processing units (GPGPUs). In particular, the research studies the interdependence of accelerator management and software thread scheduling in multi-tasking hybrid systems, and proposes integrating these two system-level functions to increase the overall performance and energy-efficiency. This will encourage industry to further embrace hybrid computing in the development of new products, and thus, enable more capable and energy-efficient mobile devices; quiet multi-function household information appliances; portable medical devices; and more flexible, capable, and robust infrastructure systems in transportation, healthcare, and other key industries. <br\/><br\/>This project also targets to improve teaching, learning, and diversity in Computer Engineering. Activities include developing curriculum and teaching aids, outreach activities, undergraduate research, and involvement in education-related committees. As a part of this project, participants will create new instructional materials for Computer Engineering topics at a variety of levels of understanding.","title":"CAREER: Advanced System-Level Support for Hybrid Multi-Tasking Computing","awardID":"0952425","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[432068],"PO":["565255"]},"161669":{"abstract":"The PI's long-term research plans involve exploring new pathways to the human central nervous system (CNS) in order to expand our knowledge about this highly complex system and understand how it works, and developing innovative technologies and research tools that will enable direct or indirect communication with the CNS through such pathways. In particular, he is keen to utilize and evaluate new interfacing technologies in devices that will help individuals who suffer from chronic disabilities and neurological diseases, such as blindness, deafness, and paralysis to improve and extend their quality of life. With these general goals in mind, the PI will in this project focus on exploring the use of voluntary tongue motion as a substitute for some of the functions traditionally performed by the arms and hands in personal environmental control. This has not been possible in the past absent access to tongue motion without impeding the tongue's key roles in swallowing, respiration, and speech. The PI has previously developed and successfully tested a new wireless, unobtrusive, and wearable technology he calls the Tongue Drive System (TDS), to indicate tongue position in real time within certain user-defined locations in the oral space. Building upon the TDS prototype, he will explore whether the inherent characteristics of the tongue and its rich motor capabilities can be harnessed as an intermediary pathway to the human brain. In other words, he will seek to create a Brain-Tongue-Computer Interface (BTCI) by enhancing the functionality of the TDS hardware, signal processing algorithms, and GUI software to support a large number of choices that will be simultaneously available to users, in addition to the proportional control capability that is currently employed to facilitate navigation and computer access. The PI will conduct experiments to evaluate the performance, usability, and acceptability of the BCTI platform, and will employ it to achieve a fundamental understanding of human factors associated with voluntary tongue motions. Finally, the PI will combine his real time 3-D tongue tracking technology with multi-channel wireless neural recording to explore the relationship between unconstrained tongue movements and whole muscle\/single motor unit activities in speech, respiration, and swallowing without any bodily restraints.<br\/><br\/>Broader Impacts: Individuals who are severely disabled as a result of various causes from spinal cord injuries to stroke, cerebral palsy, and ALS find it extremely difficult to carry out everyday tasks without continuous help. This research will ultimately transform the lives of many persons with severe disabilities, by helping them live active, self-supportive, and productive lives. Solutions such as the BTCI may also help reduce healthcare and assisted-living costs by relieving the burden on family members and dedicated caregivers. Utilization of the tongue's motion as an untapped human motor modality in command, control, and navigation tasks involves costs and benefits which are at present unknown; quantitative analysis of human performance in concurrently conducted sensory, motor, and cognitive tasks, both in the presence and absence of tongue motions, is likely to bring about new scientific discoveries in human system integration. The PI's 3-D tongue tracking technology will also impact speech\/language therapy, as well as the treatment of communication and sleep disorders that involve tongue motion. The PI will explore use of the BTCI technology in educational settings for children with special needs through programs such as Tools for Life, and will also conduct outreach efforts to expose K-12 students to facts about the CNS, its associated impairments, and different ways to address those problems with engineering solutions.","title":"CAREER: Brain-Tongue-Computer Interfacing","awardID":"0953107","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["561584"],"PO":["565227"]},"162648":{"abstract":"This project develops a testbed for experimentation with energy saving in data centers via holistic management of both the computing and cooling subsystems. It instruments a large computing cluster at the University of Illinois that reproduces representative dynamics of energy consumption in data centers. Understanding heat and energy dynamics in large computing systems requires detailed sensing and control on both the computing and cooling side. The goal is to produce models and algorithms that significantly contribute to energy optimization research leading to reductions in carbon footprint and operating costs of contemporary computing clusters. The testbed developed in this project focuses primarily on understanding and improving software-controlled mechanisms for energy optimization in systems that exhibit non-trivial coupled thermal and computational dynamics, called thermo-computational systems, towards better energy management of data centers. When complete, it is likely to become the first and largest open testbed geared for enabling high quality research on large thermo-computational systems. The project is motivated by the increasing energy cost of data centers, which is estimated at more than $4.5 billion annually and is expected to grow at a rate of 12% in the absence of intervention. According to the EPA, most of this cost is avoidable. If successful, the project will therefore contribute significantly to both the economy and the environment by resulting in savings in both energy cost and carbon footprint.","title":"II-New: Towards Green Data Centers: A Testbed for Thermo-Computational Dynamics","awardID":"0958314","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["563534",434621,"553633","550441"],"PO":["563661"]},"168809":{"abstract":"This award supports the Workshop on Interactive Systems in Healthcare (WISH); a two-day workshop held April 10-11, 2010 in conjunction with the 2010 ACM SIGCHI conference in Atlanta, GA (April 10-15, 2010). The primary intellectual contributions of this project lies in bringing together a diverse set of researchers from across a range of disciplines, all of which intersect around interactive systems for health and wellness. This workshop enables both in-depth discussion with a small group of senior-level individuals and the development and encouragement of a broader range of scholars. Bringing together these researchers during the workshop and during the conference poster session will facilitate interdisciplinary dialogs, creating an environment for critical intellectual exchange. There are short and long-term benefits from supporting this workshop. Focused discussions among senior researchers and practitioners are likely to lead to recommendations for the future directions of research, funding, policy, and education related to systems design of interactive systems for health and wellness. Further, bringing together early stage doctoral students with more senior researchers and practitioners will generate important new research projects and develop the future generation of researchers in this topic. In the long-term, addressing the complex interplay between human, organizational, and technological systems in healthcare has the potential to impact quality, safety, efficiency, and effectiveness of health systems throughout America.","title":"WORKSHOP: Workshop on Interactive Systems in Healthcare (WISH)","awardID":"1018582","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["519772"],"PO":["565342"]},"162407":{"abstract":"While areas of the US such as California and the East coast have major<br\/>medical centers near every population center, there are many areas,<br\/>even in developed countries, with a widely dispersed patient<br\/>population with significant obstacles to advanced medical care.<br\/>Victims of large scale natural disasters and battlefield casualties<br\/>also lack state of the art care. Telesurgery could potentially meet<br\/>these needs. There is a growing interest in computational research on<br\/>intelligent telesurgery. Today's telesurgery systems do not integrate<br\/>with medical imaging or have intelligent functions to assist the<br\/>surgeon. This project is building seven teleoperated surgical robot<br\/>and surgeon-interface systems powerful and precise enough to support<br\/>research on advanced robotic surgery techniques at seven major<br\/>research universities. University of Washington and University of<br\/>California Santa Cruz are building the seven robots and will<br\/>distribute them to Harvard, Johns Hopkins, University of Nebraska,<br\/>U.C. Berkeley, and UCLA. When completed, the seven research lab<br\/>robots will be networked together for sharing of software,<br\/>interoperability, and on-line telesurgery experiments.<br\/><br\/>Impact<br\/><br\/>The results of this project will enable a network of researchers to<br\/>prototype advanced surgical robotics techniques, and evaluate them in<br\/>realistic contexts including appropriate animal procedures. Besides<br\/>new and less invasive cures, such a technology can provide easier<br\/>access to care in remote parts of the US, and the developing world.<br\/> The seven cooperating labs, and external partners will be able to<br\/>interconnect their systems, share modules of software, and replicate<br\/>each others experiments.","title":"Collaborative Research: Manipulation Network for Surgical Robotics Research","awardID":"0957082","effectiveDate":"2010-03-15","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["520782"],"PO":["543539"]},"163859":{"abstract":"Technical description of the project:<br\/><br\/>Smoothed analysis has been introduced to study the behavior of algorithms when their good practical performance cannot be predicted by the traditional frameworks such as the worst-case and average-case analyses. In the original paper that introduced smoothed analysis, Spielman and Teng proved that the simplex method, which was one of the amazingly practical heuristics known to have poor worst-case performance, had good smoothed complexity. Since its introduction, smoothed analysis has been applied to heuristics in areas that include mathematical programming, numerical analysis, and combinatorial optimization.<br\/><br\/>To follow up on this breakthrough in linear programming, whose primary concern is to optimize a single linear objective function, the goal of this project is to extend smoothed analysis to optimization problems involving multiple objective functions and multiple agents, as often considered in Computational Game and Economics Theory. The plan of the project will also include the design and analysis of machine learning algorithms in the smoothed setting.<br\/><br\/>The plan for multiobjective optimization is to improve the recent work which show that the Pareto set of any binary linear optimization problem with a constant number of objective functions has a polynomial size in the smoothed model. In game theory, the research will focus on the smoothed complexity of several potential games for resource allocation and scheduling. For both of these problems, a new analytical approach for the performance of an iterative process is needed. In machine learning, the goal is to extend the results on the smoothed analysis of PAC and agnostic learning from product distributions to other more practical distributions.<br\/><br\/><br\/>The broader significance and importance of the project:<br\/><br\/>This research will provide insight into why heuristics in multi-objective optimization, local search, and machine learning are successful and allow researchers in Theoretical Computer Science to incorporate these heuristics into the canon of Algorithms. It will also provide algorithmic insights into the differences between game-theoretic problems involving multiple agents and multi-objective optimization problems concerning only a single agent. By developing a theory that better predicts the performance of algorithms in practice, this research has the promise to allow researchers to develop more powerful algorithms. When one designs an algorithm, one does so with some reason in mind as to why it should work. By providing a new analytical notion of what it means for an algorithm to \"work in practice,\" this research can shape the intuition of algorithm designers to include algorithms that might otherwise have been discarded for being \"bad in the worst-case.\"<br\/><br\/>A primary objective of this project is to build bridges between the discipline of Theoretical Computer Science (TCS) and communities within the disciplines of Operations Research, Game Theory, and Mathematical Economics. If successful, the project will help to provide a framework within which researchers in TCS can understand some of the great practical achievements of these disciplines. In turn, by providing analyses that respect the sensibilities of researchers in these disciplines as to what constitutes a \"practical input,\" this project will increase the value of theoretical analyses to researchers in these fields. As this project combines ideas from many disciplines within one coherent research effort, lectures and tutorials presented on the fruits of the project will help cross-fertilize the disciplines within its scope. The development of theoretical explanations for the success of the heuristics examined in this project should simplify education in algorithms and allow discussion of practically important heuristics at earlier stages of a computer scientist's education. These explanations also simplify the task of designing easily digestible lectures on these topics, and such lecture notes inspired by this research will be made available by the PI and collaborators on the internet.","title":"AF: Medium:Smoothed Analysis in Multi-Objective Optimization, Machine Learning, and Algorithmic Game Theory","awardID":"0964481","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":["483541"],"PO":["565251"]},"172208":{"abstract":"Proposal #: CNS 07-09249<br\/>PI(s): Pena-Mora, Feniosky<br\/> Contractor, Noshir S..; Forsyth, David A., Murphy; Robin R., von Ahn, Luis<br\/>Institution: University of Illinois - Urbana-Champaign<br\/> Champaign, IL 61820-7406<br\/>Title: IAD:A Pressing Need for Observation, Facilitation and Computer Support of Group Interactions for Advancing US National Priorities-Homeland Security and Economic <br\/><br\/>Project Proposed:<br\/><br\/>This project, planning the development of a Mobile Incident Coordination Laboratory (MICL), addresses the pressing need for effective coordination and collaboration among critical responders to ensure an efficient response to extreme events that threaten national economy and homeland security. Studies reveal two pressing needs: to<br\/>. Improve research tools for observing first responders interactions in complex socio-technical contexts and<br\/>. Develop computer tools and methodologies that support these interactions.<br\/>MICL will consist of six main components: a mobile coordination post built on a truck chassis, a customized light hovercraft vehicle, two personal mobile platforms, two robotic miniature helicopters, two miniature ground robotic systems, and ten personal rugged wearable computer systems. All components will be equipped with robust and interoperable communication hardware, data persistence, and audio\/video capture and processing devices, with related software to securely capture, store, transmit, and provide feedback regarding on-scene data gathering in chaotic environments. Currently, researchers are compelled to use stationary laboratories away from the disaster site to conduct inherently dynamic and mobile research; MICL should facilitate work in location affected by extreme events. This work supports <br\/>. Understanding of underlying principles, adequate uses of IT and appropriate algorithms that govern interaction among diverse responders and organizations;<br\/>. Integration of secure data models & communication frameworks that support group interactions in extreme conditions;<br\/>. Development of a computer infrastructure to support interactions among first responders to reduce the negative impacts that extreme events have on homeland security and national economy;<br\/>. Integration of many academic areas including civil engineering, architecture, computer science, sociology, business, education that focus on interactions of key users in chaotic contexts, bringing real-world challenges.<br\/><br\/>Broader Impacts: Addressing needs benefiting national security, this infrastructure provides first responders aid to address critical issues such as security and vulnerability, along with expertise to prepare, respond, and recover from disaster. Moreover, it addresses education and training in this vibrant area.","title":"CRI: IAD - A Pressing Need for Observation, Facilitation and Computer Support of Group Interactions for Advancing United States National Priorities--Homeland Security and Economic","awardID":"1037598","effectiveDate":"2010-03-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1631","name":"CIVIL INFRASTRUCTURE SYSTEMS"}}],"PIcoPI":["508612"],"PO":["564456"]},"161803":{"abstract":"The vision of robotic assistants for domestic, health care, and workplace applications will not come to fruition without the ability to manipulate typical objects in human environments. However, grasping is challenging in unstructured environments because object models typically required to control the robot are not known beforehand and must be acquired through sensors that are imprecise and incomplete. The majority of research in robotic grasping and manipulation has attempted to address this problem through elaborate multifingered hands combined with tactile sensing and sophisticated planning and control algorithms, often following an anthropomorphic approach. This proposal utilizes an alternative approach involving a focus on the mechanics of the hand itself to accomplish most of the needed ?control.? By appropriately incorporating features such as compliance and underactuation, the uncertainty inherent in unstructured grasping tasks can be more easily accommodated. The proposed work addresses the problem of precision grasping of small objects from the surrounding environment and then begins to address the broader problem of dexterity by examining two-fingered precision manipulation, while investigating the role of compliance, underactuation, and configuration on performance in the presence of uncertainty. This work will be disseminated through publications in scholarly journals and conferences and will contribute to the fundamental understanding of the mechanical interaction of robot hands with small objects and the surrounding environment. These results are expected to lead to the development of low-dimensional hands for precision robotic grasping and manipulation with applications including assistive robots and prosthetics.","title":"CAREER: Underactuacted Precision Robotic Grasping and Manipulation","awardID":"0953856","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["549672"],"PO":["534411"]},"161858":{"abstract":"Over the next decade, advances in integrated circuit (IC) communication systems will encounter a number of interdependent challenges from system and architecture design to physical technology integration. With increasing system integration and technology scaling, the performance and scalability of electrical interconnect have become the primary bottleneck in IC design. Power and process variation induced thermal and reliability challenges further complicate IC communication system design and run-time operation. Looking forward, emerging system and physical technologies will vastly change the landscape of IC communication -- the move towards many-core systems and parallel applications increases the communication requirements and calls for new communication solutions to support system-level performance and functionality. Meanwhile, emerging physical technologies, such as nanophotonic interconnect and three-dimensional (3D) integration, are gradually becoming commercially feasible. Their adoption will offer new opportunities but also pose new challenges to IC communication system design.<br\/><br\/><br\/><br\/>The research objective of this CAREER development plan is to systematically investigate communication system design for future ICs and address the corresponding research challenges from system exploration, modeling and analysis, to technology integration, emphasizing a unified study of emerging communication system and physical technologies. More specifically, it will focus on addressing the following two system-level and physical challenges: (1)How emerging many-core systems will change the communication system design; and (2) How emerging physical technologies will change the communication system design. This work aims to discover scientific knowledge necessary for a unified exploration of IC communication system design, and deliver new communication architectures and physical solutions, modeling and analysis methods, design methodologies, and optimization techniques. The end results will be demonstrated and validated with chip designs.","title":"CAREER: Communication System Design for Future Integrated Circuits","awardID":"0954157","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}}],"PIcoPI":["485555"],"PO":["562984"]},"163706":{"abstract":"Modern distributed systems increasingly rely on distributed storage and lookup services. Existing storage and lookup solutions, however, provide only a subset of high availability, high scalability, and strong consistency semantics. In this project, we develop Harmony, a distributed hash table (DHT) aimed at providing very large scale applications with highly scalable, consistent and available storage and lookup. We address many significant challenges in delivering on this goal. First, the Internet has unpredictable node and communication failures, and preserving consistency in this context is a difficult task. To address this issue, we provide the abstraction of a collection of self-managing groups that coordinate to ensure atomic updates to distributed state. Second, consistency often comes at the cost of reduced availability. In our system, consistency is an inviolable safety property; availability is provided through replication. Third, coordination mechanisms for consistent replication and atomic updates often result in performance penalties. A key insight in our work is that one can improve performance with coordination mechanisms for delegation and autonomous execution. Finally, by isolating most of the communication necessary to preserve consistency within a group, we both simplify our implementation and improve its scalability. Further, adaptation to changing workloads and resource constraints is easier because it can take place within a framework for the consistent update of distributed state. If successful, the resulting storage abstraction should greatly simplify the development of complex distributed applications.","title":"CSR: Medium: Very Large Scale Consistent DHTs","awardID":"0963754","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["549890","463055"],"PO":["565255"]},"163838":{"abstract":"Modern data centers host operations as varied as flight planning, drug discovery, and Internet search running on thousands of machines. These services are often limited by the speed of the underlying network to coordinate parallel data access. In current data centers, network I\/O remains a primary bottleneck and a significant fraction of capital expenditure ($10B\/year). Compounding the problem are operational issues caused by interference between services, down times due to failures, and violations of performance requirements.<br\/>This project will develop a hardware\/software architecture with the following capabilities: i) non-blocking bandwidth to hundreds of thousands of hosts; ii) ``slicing'' across services with minimum bandwidth guarantees; iii) detecting fine-grained performance violations; iv) tolerating a range of failure scenarios; v) supporting end host virtualization and migration. Our goal is to enable modular deployment and management of networking infrastructure to keep pace with the burgeoning computation and storage explosion in data centers. This work will result in a prototype fully functional virtualizable data center network fabric to support higher-level services.<br\/>Broader impacts include: i) outreach to under-represented minorities through the UCSD COSMOS program; ii) a public release of the data center communication workloads, protocols, and algorithms we develop; iii) working with our industrial partners and advisory board to address key performance and reliability issues in a critical portion of the national computation infrastructure. A significant outcome will be students trained in data center networking and cloud computing.","title":"CSR: Medium: Scale, Isolation, and Performance in Data Center Networks","awardID":"0964395","effectiveDate":"2010-03-15","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[438592,"485593"],"PO":["565255"]},"161815":{"abstract":"The goal of this project is to develop sophisticated formal verification tools for finding harmful defects in cyber-physical systems. Cyber-physical systems are responsible for numerous control tasks in safety-critical systems such as automobiles, avionics, medical devices, and power distribution systems. Guaranteeing the correctness of these systems is of the utmost importance. However, existing verification and validation techniques have fallen far short of addressing this important challenge.<br\/><br\/>This project investigates verification techniques for analyzing large and complex cyber-physical systems. First, the project is developing rich modeling formalisms that are capable of capturing realistic system designs at the right levels of abstraction. These formalisms form the basis for verification techniques that can be used to pinpoint functional defects in cyber-physical systems. Specifically, the project focuses on techniques for detecting harmful numerical precision loss in control systems implemented using fixed and floating point numbers. Finally, the project addresses the challenge of verifying complex non-linear systems using interval analysis, convex optimization and symbolic decision procedures. The results of this research are available to the community in the form of open-source tools. These tools will directly support the verification of complex systems.<br\/><br\/>The educational impact of the project lies in the integration of the research with a course curriculum centered around the theme of rigorous software engineering for cyber-physical systems. The resulting courses provide valuable training to undergraduate as well as graduate students in the use of advanced verification tools and techniques to ensure safe and reliable design of systems.","title":"CAREER: Automatic Analysis of Cyber Physical Systems: Bridging the Gap between Research and Industrial Practice","awardID":"0953941","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["550702"],"PO":["565255"]},"161817":{"abstract":"With the advent of emerging e-Science applications, today's scientific research increasingly relies on petascale-and-beyond computing over large data sets with petabyte-and-beyond sizes. Representatives include analytics- and simulation- driven applications such as the human vision simulation, astrophysics data analysis, earthquake modeling, climate modeling using ensemble runs, etc. In many of the above-mentioned fields, scientists are dealing with large amounts of data and analyzing them to explore new concepts and ideas. These applications make up data-intensive HPC analytics, which lies at the intersection of current HPC and Data-Intensive Scalable Computing (DISC).<br\/>When HPC systems use traditional configurations to support data-intensive HPC analytics, data is copied from a large remote storage system to diskless compute nodes for processing. Copying data back and forth is an expensive and time consuming process. These data-intensive applications do not require compute intensive resources, but rather moderate compute power machines with the capability of local storage so that data can be processed in-place. One such example of this configuration is the Hadoop framework. However, there are currently limitations in this framework which must be overcome in order to make Hadoop an effective HPC tool. The investigator is leveraging the Hadoop framework to process large amount of patterned data in HPC. This research program includes three thrusts. It is developing the MapReduce API to support a wider range of I\/O access patterns, various data restructuring schemes to improve I\/O performance for these access patterns, and an efficient scheduling scheme considering multiple chunk locations and data transfer latencies over the network. The research is integrated into several educational activities, such as the development of data-intensive HPC curricula.","title":"CAREER: Data-Intensive HPC Analytics: A Systems Approach Through Extended Interfaces, Data Restructuring and Data-centric Scheduling","awardID":"0953946","effectiveDate":"2010-03-15","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["464413"],"PO":["565272"]},"161829":{"abstract":"Wireless systems have become an inseparable part of our social fabric, which allow users to move around and access the services from different locations while on the move. However, wireless security is often cited as a major technical barrier that must be overcome before widespread adoption of mobile services can occur. Traditional approaches have focused on addressing security threats on a case-by-case basis in an ad-hoc manner as new and specialized threats are uncovered. Furthermore, as wireless networks become increasingly pervasive, the ubiquity of wireless is redefining security challenges (e.g., attacks can be conducted by new and rapidly evolving adversaries with little effort). <br\/><br\/>This project aims to build location-oriented information into any wireless network stack and serve as a promising new dimension across different layers to complement conventional security solutions and enhance wireless security. A suite of location-enabled techniques are integrated into wireless network stacks as a true partner to cope with attacks and collaboratively defend against adversaries. The solutions are developed generic enough to apply across heterogeneous mixes of wireless technologies through the interaction with industry collaborators. <br\/><br\/>Project results are expected to assist conventional security methods and advance our knowledge in exploring generic security approaches across a wide-range of wireless technologies, which will contribute significantly to the successful deployment and adoption of emerging wireless services. The project also strengthens the education and research of undergraduate and graduate students in related areas of wireless networks and security, and helps to prepare students to face the challenges of future information technology.","title":"CAREER: EASE: Enhancing the Security of Pervasive Wireless Networks by Exploiting Location","awardID":"0954020","effectiveDate":"2010-03-01","expirationDate":"2015-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"8060","name":"Secure &Trustworthy Cyberspace"}}],"PIcoPI":["550063"],"PO":["565327"]},"169230":{"abstract":"NSF CISE Pathways to Revitalized Undergraduate Computing Education (CPATH) program has completed three funding cycles and has invested heavily in computing education. Each of the funded proposals has accomplishments and setbacks that should be shared with others. This special project supports a workshop to bring together the leaders of the funded projects in order to share experiences, explore opportunities for additional collaborations, and discuss issues that hinder accomplishing their stated goals. The workshop is planned for late March 2010 at a facility in Arlington, VA. The site is chosen for easy access both by the grant PIs and by NSF staff who wish to observe and learn about the accomplishments and challenges of the CPATH program.<br\/><br\/>Intellectual Merit: The proposed workshop will give leaders of CPATH funded projects an opportunity to reflect on their goals and their progress, to brainstorm on ways in which other project?fs experiences might inspire some new activities or some changes of emphasis, and to make new connections to related activities that will enhance each of the projects.<br\/><br\/>Broader Impacts: The outcomes of the workshop will include hard?]to?]quantify results from connections made between projects. There will also be concrete results in the form of commentary on experiences, suggestions for future directions, descriptions of ideas that worked and ideas that did not work. The results will be published on the NSF NSDL Ensemble site: the computing pathway to NSDL. The existence of the results will be well publicized and these materials will help future proposals to CPATH and other NSF computing education programs to avoid the pitfalls experienced by others and will provide insights that will lead to stronger proposals and more accomplishments in areas targeted by the CPATH program","title":"CPATH PI meeting 2010","awardID":"1020847","effectiveDate":"2010-03-01","expirationDate":"2012-02-29","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7640","name":"CPATH"}}],"PIcoPI":["83531"],"PO":["565264"]},"168254":{"abstract":"This is funding to support a Young Pioneers Workshop (doctoral consortium) of approximately 20 graduate students and recent graduates from master's and doctoral programs in diverse research communities (including computer science and engineering, psychology, cognitive science, robotics, human factors, human-computer interaction design, and communications), along with distinguished research faculty. The event will take place on Tuesday, March 2, 2010, immediately preceding the Fifth Annual Human Robot Interaction Conference (HRI 2010) to be held March 3-5, 2010, in Osaka, Japan, and which is jointly sponsored by ACM and IEEE. The theme of HRI 2010 is \"Grand Technical and Social Challenges in HRI,\" which highlights the critical need to take up and speak to the integration of the hard technical and social problems facing the field as we move to create our future with robots. More information about the conference is available at http:\/\/hri2010.org. <br\/><br\/>The Young Pioneers Workshop is designed to complement the conference, by providing a forum for students and recent graduates in the field of HRI to share their current research with their peers and a panel of senior researchers in a setting that is less formal and more interactive than the main conference. During the workshop, participants will talk about the important upcoming research themes in the field, encouraging the formation of collaborative relationships across disciplines and geographic boundaries. To these ends, the workshop will include sessions in a variety of formats: student oral presentations, student poster presentations, a hands-on breakout session, and group presentations. Attendees will hear short presentations from 6 selected student participants; those students not invited to give an oral presentation will participate in an interactive poster session. The workshop will feature a Career Panel with three senior HRI researchers who will share insights about their own careers and answer career path questions posed by the organizers and participants. The discussions will continue over lunch in smaller groups. In the afternoon, a hands-on breakout session will involve small group projects in which participants will investigate how to design an HRI experiment; afterward, the groups will present a summary to the entire workshop. Participants in the workshop will come away with knowledge of current research being conducted by their colleagues, awareness of diverse interdisciplinary methodologies, and understanding of emerging themes in HRI. They will also have had a rare opportunity to engage in dialogue containing cross-disciplinary knowledge and multinational perspectives at the graduate level.<br\/><br\/>Broader Impacts: This workshop will afford a unique opportunity for the best of the next generation of researchers in human-robot interaction to be exposed to and discuss current and relevant topics as they are being studied in several different research communities (including but nor limited to computer science and engineering, psychology, robotics, human factors and ergonomics, and human-computer interaction). This is important for the field, because it has been recognized that transformative advances in research in this fledgling area can only come through the melding of cross-disciplinary knowledge and multinational perspectives. Participants will be encouraged to create a social network both among themselves and with senior researchers at a critical stage in their professional development, to form collaborative relationships, and to generate new research questions to be addressed during the coming years. Participants will also gain leadership and service experience, as the workshop is largely student organized and student led. The PI will act aggressively to recruit young researchers from minority and underrepresented groups in order to assure diversity of the participants across a variety of dimensions, so that the students' horizons are broadened to the future benefit of the field. To validate the effectiveness of the 2010 Young Pioneers Workshop, she will conduct pre- and post-workshop surveys. Additionally, as this is the workshop's fifth year, she will evaluate its effectiveness and value by conducting a longitudinal survey of past participants and organizers.","title":"Workshop: Human Robot Interaction (HRI) 2010 Doctoral Consortium","awardID":"1015953","effectiveDate":"2010-03-01","expirationDate":"2012-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["526078"],"PO":["565227"]},"159311":{"abstract":"Southern Illinois University-Edwardsville and Washington State University propose to develop a new educational K-12 infrastructure aimed at increasing the participation of blind individuals in secondary schools, and ultimately in undergraduate computing programs and the software engineering profession. When it comes to computer programming, blind and visually impaired individuals are at a significant disadvantage compared to their sighted counterparts. Computer programming is a highly visual task, and modern programming tools are designed almost exclusively for sighted users. Moreover, computing curricula at schools for the blind are nearly non-existent; those rare blind individuals who are able to enter the computing profession are largely self-taught. This is an unfortunate state of affairs, as computer programming offers the blind population both a rich world to explore -- one that is potentially accessible through carefully designed auditory cues -- and a lucrative career path. The proposed project, in collaboration with five K-12 schools for the blind and a mentorship board of successful blind programmers, will develop and empirically evaluate a new educational infrastructure for the blind. It has three key components. The first is a novel auditory programming environment tailored to the special needs of the blind. The second is a new studio-based computing curriculum that engages students in the construction, customization, and sharing of auditory virtual worlds with the goals of teaching computer programming skills and inspiring students to consider computing as a career. The third is a blind-accessible, web-based community portal designed to facilitate peer mentoring and support, and to provide opportunities for students to interact with role models who have overcome their visual impairment and succeeded in the computing profession. <br\/><br\/>The proposed project will address two significant research questions: How can the highly-visual, cognitively complex task of computer programming be made both accessible and engaging to middle and high school blind students through computing education infrastructure consisting of an audio-based programming environment, specialized curriculum, and web-based community portal? And how can a such a computing education infrastructure be best designed so as both to facilitate their wide-scale adoption by K-12 schools for the blind and to broaden the participation of the blind population in computing?","title":"Collaborative Research: BPC-DP: Building an Educational Infrastructure for Students at K-12 Schools for the Blind to Broaden Participation in Computing","awardID":"0940555","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["551105"],"PO":["561855"]},"166022":{"abstract":"This project is a domestic and international REU program run by DIMACS, the Center for Discrete Mathematics and Theoretical Computer Science, headquartered at Rutgers University, and cosponsored by DIMATIA, the Center for Discrete Mathematics, Theoretical Informatics, and Applications, at Charles University in Prague, Czech Republic. Students will be recruited from across the U.S. and the Czech Republic. The domestic program will continue to develop an academic-industrial and interdisciplinary co-mentoring program previously introduced as a pilot and will leverage REU funds from the Department of Homeland Security through a new Center of Excellence based at DIMACS. The international program will host Czech students and send U.S. students to Prague. The goal of this REU program is to provide participants with an exciting research experience that will help them decide on future educational and career paths. All students, including those only in the domestic program, will get a taste of the international scientific enterprise through joint programs and social events involving the Czech students and lectures on Czech research and culture. <br\/><br\/>Intellectual Merit: The program will focus on common strengths of DIMACS and DIMATIA, particularly in topics of theoretical computer science and discrete mathematics such as graph theory, computational geometry, logic and complexity theory, and combinatorial optimization. The program will also leverage DIMACS position as an interdisciplinary center to offer projects whose applications cross disciplines and illustrate the power of computational thinking in many settings, such as computational bioinformatics, health data privacy, epidemiological modeling, economic aspects of e-commerce, and information management in massive data sets. This perspective will be reinforced by exposing students to current industrial research on network analysis, sensor location, and Internet auctions, and to homeland security applications through interaction with DIMACS Department of Homeland Security REU program. <br\/><br\/>Broader Impacts: The program will provide an incomparable scientific and cross-cultural experience to 15 outstanding undergraduates per year. In addition to leading to scientific papers and talks, there will be networking among students - domestic and foreign - that will last far into the future. There will also be new collaborations with mentors and graduate student coordinators. The program aims to influence the choices about further education and future careers of the students involved, and give them the confidence to pursue these choices. The program will increase the number of interactions between DIMACS and DIMATIA and their widespread scientific collaborators throughout the U.S. and the Czech Republic, and aims to have a \"trickle down\" effect that extends beyond the specific students supported. The program also aims to raise the awareness of a larger scientific community to the importance of and opportunities in international collaboration and cross-fertilization. This international collaborative model will be publicized to colleagues at other institutions.","title":"REU Site: DIMACS\/DIMATIA U.S.\/Czech International REU Program","awardID":"1004956","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["539009","540234","264120","264120"],"PO":["564588"]},"169201":{"abstract":"The topic of Human Computer Interaction (HCI) is more important now than at any other time in the history of computing. As computers become smaller, faster, and more ubiquitous, our ability to use them effectively becomes critical. Not only must we design usable systems, but we must do so in a rapidly changing landscape of computing hardware that includes desktops, mobile phones, and embedded systems. A unique aspect of HCI is that it requires the study of not just computing, but of the combination of computing and people. Because people are involved, HCI is a field where aspects such as culture, socio-economic background, gender, etc., are considered in the systems that we build. This is a clear argument for the development of a diverse field of researchers who bring to bear a wide range of experiences in their problem solving skills.<br\/><br\/>This is funding to provide partial support for the CHIMe 2010 workshop, which will bring together approximately 40 students and 10 distinguished speakers from academia and industry as part of the Discipline-specific Mentoring Workshops sponsored in part by CRA (http:\/\/www.cra-w.org\/cdc). The PIs, who were co-chairs of the Richard Tapia Celebration of Diversity in Computing Conference this past year, have put together a program that consists of presentations, panels, and a poster session designed to inform, inspire, and encourage our future scientists. Workshop speakers will include leading researchers in the field, who will address a broad range of issues ranging from technical concerns (such as appropriate evaluation methods) to some of today's hot topics. The workshop will be collocated with the ACM 2010 Conference on Human Factors in Computing Systems (CHI 2010), which will be held April 10-15 in Atlanta, and is sponsored by the Association for Computing Machinery's Special Interest Group on Human-Computer Interaction (SIGCHI); this is the leading international forum for the presentation and discussion of research and practice relating to human-computer interaction, and is attended by approximately 2,500 HCI professionals from around the world. The workshop is advertised on the CHI 2010 Conference website as a \"Hosted Event.\" Workshop sponsors currently include the CDC\/CRA-W and EL Alliance, and the PIs are soliciting additional funding from industry. NSF funds will be used to cover the travel costs of 9 non-local students to participate in the event.<br\/><br\/>Broader Impacts: The PIs have made a serious and successful effort to attract participants from HBCU (Historically Black Colleges and Universities), HSI (Hispanic-Serving Institutions), ACU (Appalachian Colleges and Universities), and TCU (Tribal Colleges and Universities) institutions. CHIMe 2010 will harness the cumulative experience of successful STEM professionals in the field to provide a unique forum in which to showcase the technical achievements of diverse researchers in computing and to encourage a new generation of researchers from underrepresented groups. With its focus on graduate students in HCI, the workshop will be positioned to have a direct impact on future faculty and researchers in this area of endeavor. It will provide a highly technical and supportive environment for underrepresented minority doctoral students in the field of HCI to discuss their research and to receive constructive feedback from experts, along with an opportunity for networking and peer mentoring.","title":"WORKSHOP: Student Travel Support for the CHI Mentoring Workshop","awardID":"1020637","effectiveDate":"2010-03-01","expirationDate":"2011-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["554552","531150"],"PO":["565227"]},"159301":{"abstract":"Southern Illinois University-Edwardsville and Washington State University propose to develop a new educational K-12 infrastructure aimed at increasing the participation of blind individuals in secondary schools, and ultimately in undergraduate computing programs and the software engineering profession. When it comes to computer programming, blind and visually impaired individuals are at a significant disadvantage compared to their sighted counterparts. Computer programming is a highly visual task, and modern programming tools are designed almost exclusively for sighted users. Moreover, computing curricula at schools for the blind are nearly non-existent; those rare blind individuals who are able to enter the computing profession are largely self-taught. This is an unfortunate state of affairs, as computer programming offers the blind population both a rich world to explore -- one that is potentially accessible through carefully designed auditory cues -- and a lucrative career path. The proposed project, in collaboration with five K-12 schools for the blind and a mentorship board of successful blind programmers, will develop and empirically evaluate a new educational infrastructure for the blind. It has three key components. The first is a novel auditory programming environment tailored to the special needs of the blind. The second is a new studio-based computing curriculum that engages students in the construction, customization, and sharing of auditory virtual worlds with the goals of teaching computer programming skills and inspiring students to consider computing as a career. The third is a blind-accessible, web-based community portal designed to facilitate peer mentoring and support, and to provide opportunities for students to interact with role models who have overcome their visual impairment and succeeded in the computing profession. <br\/><br\/>The proposed project will address two significant research questions: How can the highly-visual, cognitively complex task of computer programming be made both accessible and engaging to middle and high school blind students through computing education infrastructure consisting of an audio-based programming environment, specialized curriculum, and web-based community portal? And how can a such a computing education infrastructure be best designed so as both to facilitate their wide-scale adoption by K-12 schools for the blind and to broaden the participation of the blind population in computing?","title":"Collaborative Research: BPC-DP: Building an Educational Infrastructure for Students at K-12 Schools for the Blind to Broaden Participation in Computing","awardID":"0940521","effectiveDate":"2010-03-01","expirationDate":"2014-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425858],"PO":["561855"]}}