{"24140":{"abstract":"ABSTRACT: NCR9720674 National Laboratory for Applied Networking Research (NLANR): National Center for Network Engineering (NCNE) In 1995, NSF awarded a cooperative agreement for a National Laboratory for Applied Networking Research (NLANR) providing for engineering, technical support and coordination of the vBNS connections at the supercomputing centers. The purposes of this NLANR team activity were (i) to provide sufficient testing, utilization and measurement of the NSFvBNS to insure that its overall performance was at acceptable levels, (ii) to facilitate the experiments to be performed on the NSFvBNS, and (iii) to provide for the coordination of support activities among the centers. It also provided limited engineering and technical support for general use of the NSFvBNS and provided for the coordination of such activities and facilitated the development at the supercomputing centers of a skilled and distributed network engineering team with a thorough knowledge of the NSFvBNS and its performance capabilities and use for high performance applications. The recently initiated expansion of the NSFvBNS to encourage its use as a \"leading edge but stable\" platform to enable the development and use of high performance applications by the broader academic research community requires that the original NLANR activities be significantly expanded to encompass support for new users, sites and applications as well as continued measurement and testing of an expanded network. The need for this expansion has defined the NLANR activity into separate awards for three functional areas: the NLANR: Distributed Applications Support Team (DAST), located at the University of Illinois at Urbana-Champaigne, aimed at assisting the end users of high-performance applications in maximizing the performance of their applications; the NLANR: National Center for Network Engineering (NCNE), located at Carnegie-Mellon University, aimed at assisting high performance connections campuses in optimizing their network engine ering and connectivity; and the NLANR: Measurement and Operational Analysis Team (MOAT), located at the University of California, San, Diego, aimed at measuring and optimizing performance and use of the NSFvBNS and interconnected networks. The three efforts will continue to be be closely coodinated with each other and with the NSFvBNS. The agreement provides for the NLANR: National Center for Network Engineering (NCNE) which builds on the previous NLANR activity and the experience of Carnegie Mellon University's network engineering personnel at the Pittsburgh Supercomputer Center in analyzing and supporting the problems and peculiarities associated with high performance networking activities. NCNE will place network engineers in direct contact with campus networking personnel at High Performance Connections inatitutions andwill host workshops to facilitate the transfer of expertise supporting high performance networking to service organizations at those institutions. NCNE establishes a central help desk for High Performance Connection award sites to support and assist campus and other local service organizations in the resolution of network engineering problems related to campus networks, their connections to the vBNS and other engineering issues relevant to networks associated with the High Performance Connections program.","title":"National Laboratory for Applied Networking Research (NLANR):National Center for Network Engineering (NCNE)","awardID":"9720674","effectiveDate":"1998-01-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["560044"],"PO":["182196"]},"26671":{"abstract":"This proposal responded to the innovative technology connections for K12 portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64. It requested $117,000 to connect seven schools in four rural counties to the Internet using wireless technology. This award is made under the innovative technology connections portion of NCRI's \"Connections to the Internet\" announcement, NSF 96-64, which covers K-12 education institutions (including vocational technical schools), public libraries and museums. It provides partial support for 24 months to connect seven schools in four rural counties to the Internet using wireless technology. The Center for Education Integrating Science, Mathematics and Computing (CEISMC) of the Georgia Institute of Technology will assist in performance of the project.","title":"Rural Access to High Bandwidth Internet Connectivity Utilizing (RF) Technology","awardID":"9729620","effectiveDate":"1998-01-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["516793",67151,"552384"],"PO":["198445"]},"28112":{"abstract":"A major challenge facing designers for digital signal processing (DSP) systems is the rapidly increasing complexity of deriving sufficiently efficient and predictable software implementations. In consumer-oriented application domains such as wireless communications and PC multimedia, extremely competitive time-to- market pressure together with the continually escalating complexity of applications and processor architectures require companies to sustain enormous human resource expenditures for software development. Similarly, in very high performance applications such as radar signal processing, it remains a significant challenge to partition programs and manage interprocessor communication in a manner that effectively exploits large-scale multiprocessor computer systems. Over the past several years, it has become widely recognized that dataflow is an attractive programming model for computer-aided DSP system design tools. This project is investigating algorithms that automatically or interactively map high-level, dataflow programs for DSP into efficient software implementations. Specifically, this research is exploring (1) a thorough integration of dataflow programming and imperative programming formats, and an efficient integration of techniques for compiling dataflow with the existing techniques for compiling imperative languages; (2) the development of automatic and interactive software tools for mapping dataflow models into implementations on multiprocessor architectures, with emphasis on efficiently managing the interactions between scheduling, interprocessor communication, and synchronization; and (3) the development of algorithms for compiling dataflow computations models into uniprocessor implementations in such a way that program and data memory requirements, invocation overhead of individual subprograms, and latency are optimized.","title":"CAREER: Software Synthesis for Real-time Signal Processing Systems","awardID":"9734275","effectiveDate":"1998-01-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["539717"],"PO":["564898"]},"26771":{"abstract":"9729828 Chaudhary, Vipin Wayne State University CISE Research Instrumentation: High Performance Computing on an ATM-Connected Cluster of Symmetric Multiprocessors This research instrumentation grant serves to support the purchase of one Sun Enterprise 4000 (with 6 processors), two Sun Enterprises 3000 (4 processors each), and a 12-port Switch with 8 ATM interfaces which will enable the following projects:- Development of an Automatic Parallelization Environment (APE) for Scientific Engineering Programs in a Cluster of SMPs,- Real Time Optimization of #D Conformal Radiation Therapy Treatment Planning, - Parallel Techniques for 3D Cone Beam Tomography, and- Measurement of Resource Requirements for ATM ABR Connections. The first project integrates compile-time and run-time parallelization techniques focusing on loops with non-linear subscripts on a cluster of SMPs. An implementation of APE will reduce the execution time for various scientific and engineering applications. The second project serves radiation therapy where current computer assisted optimization techniques are too slow or too expensive to be adopted in clinical practice. Genetic algorithms will be used to optimize the dosage. A real-time cost effective implementation on a cluster of multiprocessors will make the planning process applicable in clinical practice. The third project encounters the bottleneck in parallel implementation of 3D Cone Beam Tomography technique on ethernet in the low bandwidth of the network. Using the virtual connectivity provided by ATM, the multiphase broadcast can be efficiently implemented. Results from this implementation will apply to other problems like volumetric imaging applications and finite element analysis of 3D structures. The last project utilizes profile data from various applications to enable sources to request just the necessary bandwidth and facilitate fair allocation of bandwidth. It will permit a better utilization of the network resources and improve the application perf ormance.","title":"CISE Instrumentation: Acquisition of High-Performance SMPs and a High-Speed Network","awardID":"9729828","effectiveDate":"1998-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["558152","501549","451038"],"PO":["557609"]},"26782":{"abstract":"9729848 Gupta, Gopal New Mexico State University CISE Instrumentation: Parallel and Distributed Constraint Programming Systems on Multiprocessor PCs: Implementations and Applications This research instrumentation serves to support the purchase of four-processor Pentium-based multiprocessors and a fast Ethernet hub to enable the following projects in parallel and distributed computing at the NMSU Computer Science: - Parallel and Distributed Constraint Logic Programming Systems,- A Concurrent Constraint-based Unified Framework for Internet Programming, - Parallel Constraint-based Natural Language Processing, and- Parallel Specification and Verification of Real-time Systems,all sharing the common theme of constraint-based technology. For the projects cited, the purchased equipment facilitates: first, the design and implementation of systems that exploit parallelism implicit in logic and constraint programs; second, the distributed network is enabling the prototyping of a unified framework for Internet programming, encompassing symbolic constraints and concurrency; third, parallel constraint software technology will significantly speed up the execution of large natural language processing applications; and fourth, the development of parallel tools for verifying large, complex real-time systems. Parallelism and distributivity are key to accomplishing the goals of these projects. The chosen platform is cost-effective, flexible, and provides a balance between shared memory multiprocessors, which are efficient but not scalable, and distributed networks of processors, which are less efficient but scalable.","title":"CISE Research Instrumentation: Parallel and Distributed Constraint Programming Systems on Multiprocessor PCs: Implementations and Applications","awardID":"9729848","effectiveDate":"1998-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["409250","490760","482838","561141"],"PO":["301532"]},"24110":{"abstract":"9720508 Franklin, Judy A. Mount Holyoke College POWRE: Positive Human Machine Interaction through Music This award supports an exploration into enabling machines to learn to interact with humans via music. Jazz improvisation is a domain for multi-scale on-line learning systems that requires continuous improvement of interactive performance during learning. Learning takes place at multiple levels and may have poorly defined, changing goal\/critic functions. Yet the domain problems have straightforward numerical representations. It is a popular, deep source of human interaction. Reinforcement learning (RL) is well suited. RL is easily used within a numerical context, within a hierarchical structure. A two-level structure is proposed. One RL node creates melody. A high level node learns to \"mix\" three melody sources: the first RL node, the melody from the human, and a third node that knows about jazz scales. Significantly, RL algorithms can use direct feedback (the improvisation fits rules of jazz) and \"indirect\" feedback (energy in the human's musical reply increases, human rates it highly, audience claps). The goals are to understand how to obtain reinforcement from a human, to facilitate improving human\/machine discourse. Results are relevant to other kinds of discourse. The PI will start a strong research program and continue collaborations with cognitive scientists interested in how humans learn to improvise (in the jazz and more general sense).","title":"POWRE: Positive Human\/Machine Interaction Through Music","awardID":"9720508","effectiveDate":"1998-01-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["408593"],"PO":["297837"]},"26795":{"abstract":"CISE Research Instrumentation: Large-Scale Data Visualization and Management 9729878 Ward, Matthew O. Worcester Polytechnic Institute This research instrumentation grant contributes to the purchase of several low-end and one high-end graphics workstations, a high -end file server, several licenses, and a database Web-application server which will enable the following projects:- Hierarchical Visualization of Large Databases,- MultiMedia Visual Information Seeking (MMVIS) Technology for Temporal and Spatial Applications, - Virtual Document Generation and Visualizations Multimedia Repositories, and - Real-Time Visualization of Fire Simulation Databases. supporting efforts exploring aspects related to the storage, processing, and visualization of large multimedia data sets. The projects will address:- Extension of current methods for visualizing multivariate data to support hierarchical views of very large data sets, with emphasis on interactive focusing and drill-down using N-dimensional brushes.- Incorporation of a visual direct-manipulation language for temporal and spatial query specification, and dynamic spatio-temporal visualizations of results, to make effective use of video and other multimedia resources.- Selection of needed information from distributed sources including the Web, and the presentation style that is meaningful to a particular application. The DelaunayMM project allows users to specify virtual documents through this selection.- Development of a database for building-specific fire simulations to help predict the path of actual fires, with sensor-driven queries and visualization of matching fire futures guiding fire suppression efforts. The computational resources made possible by this grant are essential for supporting the storage and analysis of the large-scale multimedia data sets and for achieving the necessary level of interactivity required by the visualization front-ends of all four projects.","title":"CISE Research Instrumentation: Large-Scale Data Visualization and Management","awardID":"9729878","effectiveDate":"1998-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["543519","543520","554456"],"PO":["301532"]},"28863":{"abstract":"9753054 Wacholder, Nina Columbia University POWRE: Computationally Tractable Methods for Document Analysis Although impressive progress has been made in recent years on information technology systems, the output is still far from perfect. For example, information retrieval systems, which locate information relevant to a particular query, frequently miss highly relevant articles. Much of the progress in information technology is due to the effectiveness of techniques based on statistical analysis of large corpora of text; however, recent work suggests that these results can be improved with hybrid systems which skillfully combine linguistic and statistical techniques. The central hypothesis of this research is that systematic analysis of documents will provide valuable insights into linguistic properties which affect their computational tractability. The goal is to identify linguistically-motivated heuristics which are indicative of complexity of structure, vocabulary or concept; these heuristics will shed valuable light on how well different systems are able to handle different kinds of documents. Most importantly, improved understanding of the nature of the data that information technology must handle will contribute to the design of the new generation of hybrid systems. Conducting this research will help the PI, a cognitive linguist and librarian, to establish a career in a hybrid area that combines aspects of information science, linguistics, and computer science.","title":"POWRE: Computationally Tractable Methods for Document Analysis","awardID":"9753054","effectiveDate":"1998-01-01","expirationDate":"2000-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["249966"],"PO":["297837"]},"23232":{"abstract":"This research explores a new two-dimensional distributed actuator system for transporting a human body on a flat, compliant surface by generating periodic waves on a bed surface. An array of fiber actuators made of NiTi Shape- memory alloy (SMA) are woven into a bed mattress, and periodic surface waves are created by coordinating the SMA fiber actuators that move the individual coil springs in both vertical and horizontal directions. This active surface system allows transfer of a bedridden patient between a bed and a chair without lifting the patient. It also provides assistance to the patient for changing his\/her position or posture in the bed to prevent bedsores. In this project, kinematic and static behavior of the active surface system interacting with the human body will be analyzed; optimal wave forms for transporting the human body comfortably and efficiently will be obtained; control algorithms for moving the human body and changing its posture will be developed based on the estimate of the body posture; and the design and control guidelines for reducing the complexity of the distributed actuator system will be addressed.","title":"Design and Control of Surface Wave Distributed Actuators forTransporting the Bedridden","awardID":"9712386","effectiveDate":"1998-01-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["351676"],"PO":["475621"]},"24101":{"abstract":"9720470 Scarlatos, Lori L. CUNY Brooklyn College Smart Object Interfaces for Collaborative Learning Environments Smart objects are physical objects that serve as input devices to a computer system. This effort aims to use pieces of a physical puzzle -- such as the Towers of Hanoi -- as smart objects that will help K-12 students to understand and appreciate mathematical and scientific concepts. The goal is to reach those students who are currently turned off by math and science, providing a way for them to learn collaboratively by manipulating real objects in the world around them. The PI will use this planning grant to study the feasibility of this new research direction, and to devise a sound technical approach for implementing smart object interfaces for collaborative learning environments. Unlike traditional interfaces, a computer system employing smart objects must track multiple input devices in a three-dimensional space in real time, distinguishing between objects and accounting for precision errors. Current sensor technologies are being examined to discover their capabilities and limitations. The PI is talking with other researchers and sensor experts and also exploring the software issues, aiming to ultimately develop a set of smart object interface tools. This effort will culminate in a long-term research plan and the beginnings of a new research laboratory.","title":"POWRE: Smart Object Interfaces for Collaborative Learning Environments","awardID":"9720470","effectiveDate":"1998-01-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["477225"],"PO":["297837"]},"26763":{"abstract":"CISE Research Instrumentation: Laboratory for Data Management and Modeling 9729814 Grosky, William I. Wayne State University This research instrumentation grant contributes to the purchase of several workstations and a 50 GB RAID subsystem, to be interconnected via 100Mbps Ethernet to establish a Data Management and Modeling Laboratory. The instrumentation will enable the following projects:- Distributed Numerical Computations on Networks of Workstations,- Simulation System for Studying Biochemical Information Processing, - Virtual Reality Interfaces to Databases, - Multi-Resolution Indexing of Spatio-Temporal Patterns of Features for Image and Video Database Retrieval, and- Compressed Video Processing for multimedia, supporting efforts directed to interdisciplinary research on topics involving multimedia data management, computational modeling, and distributed computing. The first project explores issues related to node allocation, data partitioning, load balancing, and disk I\/O balancing for scientific computations. The second project applies to empirical modeling of complex biochemical systems, metabolic engineering, and emulation of chemical and molecular computing devices. The third project focuses on applications of VRML interfaces to databases. The fourth project is directed to the efficient database access of images and video segments having particular semantics. The long-term goal of the fifth project serves to build a capability for automatic real-time annotation of images and videos for content-based searching and retrieval in large image and video databases.","title":"CISE Research Instrumentation: Laboratory for Data Management and Modeling","awardID":"9729818","effectiveDate":"1998-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["141002","196612","178350","217710","425921"],"PO":["301532"]},"25586":{"abstract":"9726388 Pingali, Keshav Ingrafea, Anthonly Cornell University Challenges in CISE: Crack Propagation on Teraflop Computers This research effort will focus on the design of algorithms and systems to support the numerical simulation of crack propagation problems on parallel computers. The specific focus is on 3-dimensional, time-dependent fracture simulations using unstructured, adaptive grids on the IBM SP-2 and on EARTH-MANNA, a machine based on a fine-grain, multiheaded program execution model. The effort will involve three major tasks: Design and implement 3-D adaptive, parallel mesh generators producing meshes of provably good quality Develop and implement restructuring compiler technology that will support the automatic generation of efficient parallel code, starting equations that arise in the simulation Evaluate the adequacy of existing thread generation and load balancing mechanisms on the parallel platforms, and reimplement those mechanisms for crack propagation studies","title":"Challenges in CISE: Crack Propagation on Teraflop Computers","awardID":"9726388","effectiveDate":"1998-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1446","name":"MATERIALS"}}],"PIcoPI":["439586","309332","556730","260339"],"PO":["301532"]},"26776":{"abstract":"9729839 Uht, Augustus K. University of Rhode Island Research Instrumentation: Equipment for Diverse Computer Architecture Research This research instrumentation grant enables three distinct research projects: - Realizing Instruction Level Parallelism in the 10's - A New Spectrum of Hierarchical Storage Architectures for High Performance Disk I\/Os - Ultra-Dependable and High-Performance Distributed Computing while seeking to improve computer performance in many dimensions: uni- or micro-processors, I\/O (Input\/Output) systems, and multiple-computer systems. Further, the reliability of multiple-computer systems is to be enhanced. These objectives are to be achieved by using the new instrumentation equipment (multiprocessor and multiple-disk RAID storage system) in several different ways. First, the Levo research prototype uniprocessor is to be designed and simulated on the new multiprocessor. The latter will serve to verify Levo's implementation and measure its performance, as well as to allow Levo's construction, establishing that uniprocessors can be designed to execute an order-of-magnitude more instructions per cycle than current uniprocessors. Second, since I\/O constraints can limit overall performance, the novel Disk Caching Disk (DCD) I\/O system is to be realized on the new multiprocessor and RAID equipment, demonstrating factors of 2 to orders-of-magnitude performance improvements of the DCD architecture. Lastly, the Active Nodal Task Seeking (ANTS) distributed computing system achieves high performance and ultra-dependability in a coarse-grain environment. The new ANTS kernel is to be realized on the new multiprocessor, showing that the same can be achieved on fine-grain applications.","title":"CISE Research Instrumentation: Equipment for Diverse Computer Architecture Research","awardID":"9729839","effectiveDate":"1998-01-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":[67442,"414327","71847","115160"],"PO":["301532"]},"23861":{"abstract":"Future growth of Internet and other network services depends upon how these services are marketed. Two decisions are involved: the division of services into quality-differentiated market segments, and the pricing structure of each segment. There is evidence of diversity in user demand for service quality depending on application, familiarity, and willingness to pay. On the supply side, network technology now can support a wide range of service quality. Successful growth therefore requires service providers to offer combinations of quality and price that match user need. But to do this providers must understand the structure of user demand. Such understanding is lacking at present. This is a proposal for a market experiment to estimate the demand for network services. INDEX---the Internet Demand Experiment---has three objectives: 1. Measurement of user demand for Internet access as a function of quality of service (QoS), pricing structure, and application; 2. Demonstration of an end-to-end system that provides access to a diverse group of users at attractive price-quality combinations; 3. Development of a prototype system that can be scaled to serve the demand for remote network access from all Berkeley students, faculty and staff on a user-financed basis. The experiment will recruit 160 students, faculty and staff from the Berkeley campus community. Users will select and pay for network services from a menu of QoS-price offerings. User decisions will be monitored and the data will be used to estimate their structure of demand. The experiment will produce a unique set of data that can be analyzed to characterize individual and aggregate network traffic and to evaluate strategies for managing network resources to accommodate diverse user needs.","title":"Demand for quality-differentiated network services","awardID":"9714559","effectiveDate":"1998-01-15","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["554417","229257"],"PO":["125800"]},"26799":{"abstract":"9729893 Jones, Mark T. Virginia Polytechnic Institute and State University (Virginia Tech) CISE Research Instrumentation: A Research Laboratory for High-Performance Computing,Configurable Computing, and Computer Networking This research instrumentation grant enables five distinct research projects: - Computational Physics- CAD for Digital Systems- Effective Parallel Numerical Software for Networks of Workstations-Network Protocols and Performance -Configurable Computing Machines. To support the aforementioned projects, the PIs are building a research laboratory comprising sixteen Pentium II-based personal computers, configurable computing boards, and a high-speed network switch. In addition to supporting the needs of the individual projects, the laboratory serves as a focal point for collaboration between the various projects. The choice of Pentium II-based computers and configurable computing boards for the basic architecture of the laboratory not only intersects with the interests of the PIs, but also yields an excellent price\/performance ratio for the applications of interest.","title":"CISE Research Instrumentation: A Research Laboratory for High-Performance Computing, Configurable Computing, and Computer Networking","awardID":"9729893","effectiveDate":"1998-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["485861","296385","540718","324165",67532],"PO":["557609"]},"25601":{"abstract":"9726424 Xiao, Jing University of North Carolina -- Charlotte POWRE: Visiting Associate Professor at Stanford University The PI plans to visit the Department of Computer Science and the affiliated Robotics Lab of Stanford University in 1998 with the objectives as defined in the program of Professional Opportunities for Women in Research and Education (POWRE): to achieve professional growth, career advancement, and increased prominence. The proposed activities will be centered around the theme of her new line of robotics research recently funded by NSF, to which there is much related expertise at Stanford and a great possibility for fruitful collaboration. The results are expected to impact significantly the PI's research and to be mutually beneficial to both her home and host institutions.","title":"POWRE: Visiting Associate Professor at Stanford University","awardID":"9726424","effectiveDate":"1998-01-01","expirationDate":"1999-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":["440783","475621"],"PO":["297837"]},"26779":{"abstract":"9729843 Wright, William F. University of California - Irvine CISE Research Instrumentation :Use of Groupware to Enhance Team Decisions and Achieve Organizational Learning This research instrumentation grant contributes to enable the following projects:- Better Collaborative User of Information Using Groupware: Use of Considerable Information and Use of Multimedia Information,- When will Team Members Collaborate Effectively?: The Impact of Team Leadership and Team Cohesion on Collaborative Use of Groupware, and- Use of Groupware to Acquire Organizational Memory: Framing of Case Descriptions and Incentives for Teams to Contribute. The most important asset of a professional organization is its people: more specifically, their accumulated knowledge and potential insights. When these knowledge workers collaborate, they are achieving learning for themselves and their organization. Groupware (including Intranets) is used to facilitate their collaborative work. The proposed research addresses first how use of groupware will improve both the decision effectiveness and efficiency of collaboration by geographically distributed professionals and second under what conditions will teams make available their decisions and decision processes to permit an organization to acquire, manage and distribute their knowledge. Members of teams of knowledge workers will communicate, exchange information, and make decisions, in the to-be-established Groupware Laboratory for which the networking, workstation and videoconferencing instrumentation is needed. The instrumentation, to be installed in soundproof cubicles, will permit simulation and study of how professionals \"interact\" using only digital (and voice) interaction when they are geographically distributed. This use of a \"digital communication\" laboratory permits control of extraneous variables (e.g., access to unknown parties and information) and concentrates on discovery of new causal effects.","title":"CISE Research Instrumentation: Use of Groupware to Enhance Team Decisions and Achieve Organizational Learning","awardID":"9729843","effectiveDate":"1998-01-01","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["426259","430298","547942","518420"],"PO":["301532"]},"26758":{"abstract":"9729809 Franklin, Manoj Clemson University CISE Research Instrumentation: Acquisition of a Multiprocessor for Multidisciplinary Research in Computing This research instrumentation award serves to acquire a multiprocessor system which will enable the following research projects:- Instruction-Level Parallel Processors,- Automatic Generation of Benchmarks for Shared Memory Computers, - Finite Element Computations in Structural Acoustics,- Performance Validation of Nonlinear Controllers for Magnetic Bearings, and - Nonlinear Vibrations of Coupled Fluid-Structure Systems. Each of these projects involves the development of large simulators and the use of compute-intensive simulations that require powerful dedicated processors, large RAM capacity, and large I\/O capacity. Research in ILP processing involves developing decentralized execution models and studying them by detailed, parallel simulators. Research in automatic benchmark generation involves developing techniques to automatically generate multiprocessor benchmark programs from concise algorithm specifications, which aids in identifying the top-performing algorithm on an individual system basis. Research on finite element computations deals with predicting wave propagation from large structures by developing and implementing high-order space-time finite element methods and appropriate data structures for simulating them on multiprocessors. Research on nonlinear controllers involves the development of improved nonlinear dynamic models for active magnetic bearing, and their validation via dynamic simulation on multiprocessors. Research on nonlinear vibrations focuses on using multiprocessors to develop models and computationally intensive techniques to solve the equilibrium and linearized vibration of complex, nonlinear, fluid-structure systems used in textiles and high performance underwater cable structures applications.","title":"CISE Instrumentation: Acquisition of a Multidisciplinary Research in Computing","awardID":"9729809","effectiveDate":"1998-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["225924"],"PO":["557609"]},"27838":{"abstract":"The main goal of this project is to develop an analytical, multidisciplinary approach to research and education in Image Processing, integrating important aspects of engineering problems that are often treated separately. In particular, this study incorporates realistic statistical models for image data and physical sensors, and seeks solutions to estimation and compression problems based upon fundamental statistical principles. The educational component of this project aims at better preparing students for their engineering careers by developing their multidisciplinary and analytical skills, and exposing them to multiple facets of complex engineering problems. This theme is present at all levels of this project: Firstly, motivated undergraduate students are encouraged to participate in the research. Secondly, an undergraduate Image and Video Processing course and laboratory exercises allow the students to learn, visualize and assimilate fundamental concepts. Thirdly, an advanced graduate Statistical Image Processing course is being developed with the objective of integrating, applying and solidifying concepts taught in Information Theory, Estimation Theory, and Statistical Optics. Fourthly, an interactive, virtual Image Processing lab is being developed as part of two Distance Learning projects. The research component of this project addresses key problems in image restoration and compression and quantifies the benefits that may result from the use of more accurate and sophisticated models. The methodology developed is also applicable to ill-posed statistical inverse problems such as Synthetic Aperture Radar imaging, astronomical imaging, and tomography. Complexity regularization theory plays a central role in this research. Complexity-regularized estimators are inherently in compressed form, and fundamental relationships between estimation performance and rate-distortion theory are explored in that context. Additionally, novel techniques for optimizing for optimizing the operational rate-distortion performance of several image coding systems are being developed.","title":"CAREER: An Integrated Study of Image Estimation and Compression Problems","awardID":"9732995","effectiveDate":"1998-01-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["518625"],"PO":["564898"]},"22910":{"abstract":"The goal is to develop a computer system to support geographically separated researchers performing cooperative experimental research in robotics. This system uses vision techniques under the control of smart planners to acquire a visual model (combining 3-D data and texture maps) of the physical environment where the experiment takes place. It provides real-time graphic renderings of the experiments on the researchers' graphic workstations along individually selected viewpoints. Hence, each researcher is able to OBSERVE the experiments using his\/her own controllable virtual camera. The initial exploration will focus on one major component of the envisioned system, the automatic construction of a 3-D model of an experimental robotic site. This will be used to analyze basic issues that will also be encountered in the other components of the envisioned system, in particular the effect of uncertainty on the interaction between a user and a remote experimental site. This is a collaborative effort between R. Bajcsy of the GRASP laboratory at the University of Pennsylvania and J. C. Latombe at Stanford University.","title":"Virtual Environment Interfaces to Physical Environments: A Tool for Cooperative Research in Experimental Robotics","awardID":"9711380","effectiveDate":"1998-01-15","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["563532","553286"],"PO":["475621"]},"23911":{"abstract":"This research collaboration project between NCR-9714702, Jaime B. Kim, California State University, Northridge, and NCR-9714700, W. Melody Moh, San Jose State University, aims to study traffic management in wireless ATM networks. It includes the following two phases: PHASE 1: BASIC TRAFFIC CONTROL In this initial phase, we will focus on two basic traffic management issues for wireless ATM networks: 1. Admission Control We propose to develop admission control schemes which can provide a high degree of QoS guarantee for the multimedia traffic carried in micro-cellular, wireless ATM networks. The proposed schemes can also adapt to the changing network conditions by constantly monitoring current network traffic load and adjusting the amount of reserved bandwidth. 2. Multicasting Flow Control We propose two new branch-point control mechanisms: the ISQ (Ignore the Slow reQuests) and the WS (Weighted Sum) schemes. Both schemes can be readily applied to the existing multicasting ABR flow control mechanisms, most of which adopt the LSQ (Listen to the Slowest reQuests) principle. We also propose two complete multicasting flow control mechanisms for non-real-time traffic, each includes specific controls at switches, branch-points, destinations, as well as the source. PHASE 2: INTEGRATED AND EXTENSION OF BASIC TRAFFIC CONTROL This phase will focus on integration of basic traffic control mechanisms to achieve the ultimate goal of a complete traffic management scheme. For this purpose, extensions on basic traffic control projects of Phase 1 will be carried out in the following directions: 1. End-to-end admission control for multicasting connections 2. Multicasting flow control for real-time traffic 3. Integrated traffic management by combining admission control, dynamic bandwidth allocation, and flow control For each of the sub-projects in both phases, we have identified research issues for investigation and presented analytical and simulation me thods. We believe that the proposed research is vital to the next generation of broadband wireless networks.","title":"Traffic Management in Wireless ATM Networks","awardID":"9714700","effectiveDate":"1998-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"9171","name":"SCIENCE AND TECHNOLOGY CENTERS"}}],"PIcoPI":[60085],"PO":["125800"]},"23878":{"abstract":"Recent work has suggested that adaptive signaling has the theoretical promise of greatly increasing the bandwidth efficiency of digital communication systems operating over wireless channels. However, the utility of adaptive signaling has been questioned due to the variation of the wireless channel over time, which results in a different channel at the time of data transmission than at the time of channel estimation. Recent results by the PI have shown that these issues cannot be disregarded; the channel variation greatly alters the nature of the problem and thus the design of robust adaptive signaling schemes for wireless channels presents significantly different challenges than the analogous design problem for wireline channels. Many of these challenges are driven by the robustness necessary in these algorithms due to uncertainties at the transmitter about the statistics of the channel fading process. In this project, a comprehensive study of the design of robust adaptive signaling schemes for time-varying channels is undertaken. The main portions of this study include: (1) The design and characterization of robust algorithms that employ a given adaptive signaling paradigm; (2) The development of adaptive coding paradigms that are well suited to time-varying channels; and (3) The development of adaptive hybrid-ARQ schemes, which have the added flexibility of partially guaranteeing robustness through retransmission. The coupling of this work with the development of the necessary statistical models, in particular the development of appropriate classes of autocorrelation functions for the channel fading processes, will lead to families of adaptive coding strategies that can be employed in systems operating over time-varying channels with various rates of channel variation. These results will illustrate both the applications where adaptive coding is useful and the manner in which it should be employed. The methods that will be used to obtain these results are drawn from the areas of pr obability and random processes, communication system theory, and statistical signal processing. In particular, the results rely heavily on results from random process theory, the design of coded modulation schemes, and extensions of results from minimax-robust time series prediction.","title":"Robust Adaptive Coded Modulation for Time-Varying Channels","awardID":"9714597","effectiveDate":"1998-01-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["545656"],"PO":["188393"]},"20920":{"abstract":"The goals of this research are to determine the usefulness of genetic algorithms in designing spatially extended, parallel systems to perform computational tasks. An important and novel component of this project is the development of appropriate theoretical frameworks for understanding both the computational strategies of the systems evolved by the genetic algorithm as well as the evolutionary process by which such strategies are designed. This research will make three major contributions: (1) advances in the study of how spatially extended parallel systems perform computations; (2) advances in the theory and practice of genetic algorithms; and (3) a foundation for applications to parallel computation problems such as image processing, noise reduction, texture detection, and the automatic discovery of coherent structures in image time series.","title":"Evolving Cellular Automata: With Genetic Algorithms","awardID":"9705830","effectiveDate":"1998-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["361100","451985"],"PO":["565227"]},"23912":{"abstract":"Motivated by the challenges of designing multi-user software systems and by the prospect of ubiquitous electronic commerce, the goal of this research project is to develop the theoretical foundations for reasoning about utilities in a multi-agent setting, and use these foundations to construct methods with which to reason effectively about other agents' preferences and motivations. The approach draws on developments in AI as well as in economics. Specifically, the project defines a notion of utility distribution that plays a role analogous to that of a probability distribution, and the notion of a utility network that allows one to reason about utilities the way Bayesian networks allow one to reason about probabilities. Beyond this, the project is investigating hybrid networks, which allow simultaneous reasoning about probabilities and utilities. The results of this project will provide a firm theoretical framework in which to reason about beliefs and preferences in multi-agent systems, with potential applications in software design and electronic commerce.","title":"SGER: Reasoning about Utilities and Incentives in Multi-Agent","awardID":"9714701","effectiveDate":"1998-01-15","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["561961"],"PO":["495796"]},"26805":{"abstract":"9729904 Bowyer, Kevin W. University of South Florida CISE Research Instrumentation: Acquisition of a Compute Server for Image Analysis Research that Emphasizes Empirical Performance Characterization This research instrumentation grant contributes to the purchase of a compute server for the lab research network at USF with four 250 Mhz UltraSparc Processors, 1GB main memory, 35 GB of formatted disk pace, and a tape drive, which will enable the following projects:- Automated Performance Evaluation of Edge Detectors,- Nonrigid Motion and Structure Recovery from 2D Views, - Performance Evaluation of Perceptual Organization Modules, and - Automatic Tumor Volume Extraction from Brain MRI. This project deals with four image analysis tasks: performance analysis of edge detector algorithms, algorithms for analysis of non-rigid motion in image sequences, the development and analysis of perceptual grouping algorithms, and the development of clustering-based algorithms for the segmentation of magnetic resonance images. These tasks are all computationally expensive. In addition, the studied empirical characterization of the performance of the algorithms is emphasized. This style of research presents enormous computational demands, and it is not feasible to conduct this style of research with the typical workstation that an individual user would have on their desk. To make it practical to carry out this research, USL will acquire a compute server that will provide much greater computational power. This compute server will be shared among the research projects. Each of the projects is innovative and will lead to high-quality publications. In addition, the data sets and empirical methods that are created in these projects will have substantial impact on future research.","title":"CISE Research Instrumentation: Acquisition of a Compute Server for Image Analysis Research that Emphasize Empirical Performance Characterization","awardID":"9729904","effectiveDate":"1998-01-01","expirationDate":"1998-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["549181","353592","522400","173374"],"PO":["557609"]},"23913":{"abstract":"This research collaboration project between NCR-9714702, Jaime B. Kim, California State University, Northridge, and NCR-9714700, W. Melody Moh, San Jose State University, aims to study traffic management in wireless ATM networks. It includes the following two phases: PHASE 1: BASIC TRAFFIC CONTROL In this initial phase, we will focus on two basic traffic management issues for wireless ATM networks: 1. Admission Control We propose to develop admission control schemes which can provide a high degree of QoS guarantee for the multimedia traffic carried in micro-cellular, wireless ATM networks. The proposed schemes can also adapt to the changing network conditions by constantly monitoring current network traffic load and adjusting the amount of reserved bandwidth. 2. Multicasting Flow Control We propose two new branch-point control mechanisms: the ISQ (Ignore the Slow reQuests) and the WS (Weighted Sum) schemes. Both schemes can be readily applied to the existing multicasting ABR flow control mechanisms, most of which adopt the LSQ (Listen to the Slowest reQuests) principle. We also propose two complete multicasting flow control mechanisms for non-real-time traffic, each includes specific controls at switches, branch-points, destinations, as well as the source. PHASE 2: INTEGRATED AND EXTENSION OF BASIC TRAFFIC CONTROL This phase will focus on integration of basic traffic control mechanisms to achieve the ultimate goal of a complete traffic management scheme. For this purpose, extensions on basic traffic control projects of Phase 1 will be carried out in the following directions: 1. End-to-end admission control for multicasting connections 2. Multicasting flow control for real-time traffic 3. Integrated traffic management by combining admission control, dynamic bandwidth allocation, and flow control For each of the sub-projects in both phases, we have identified research issues for investigation and presented analytical and simulation me thods. We believe that the proposed research is vital to the next generation of broadband wireless networks.","title":"Traffic Management in Wireless ATM Networks","awardID":"9714702","effectiveDate":"1998-01-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":[60089],"PO":["125800"]},"38908":{"abstract":"","title":"CAREER: Towards a New Generation of Multimedia Storage Systems","awardID":"9896232","effectiveDate":"1998-01-01","expirationDate":"2002-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["410098"],"PO":["209879"]}}