{"163098":{"abstract":"Many emerging critical applications such as those for target monitoring and tracking, data gathering, querying and integration would increasingly be based on networked computing platforms comprising heterogeneous sensor and hand held devices. These will be dependent on distributed algorithms which can yield accurate, power- and time-efficient solutions, providing the United States commanding technical superiority in be-on-the-look-out-for (BOLO) and opponent's center of gravity-related information arena. However, many of these applications have underlying intractable NP-hard optimization problems, practically restricting them to approximate solutions. The adverse result has been sub-par state-of-art with algorithms employing ad-hoc greedy heuristics far removed from problem structures, and therefore presenting critical vulnerability for aforementioned applications. <br\/><br\/>This calls for a fundamental exploration of these NP-hard optimization problems leading to distinctly superior class of distributed algorithms in this arena, both theoretically and practically. For past several years, the PI has been studying the sensor target coverage problem to maximize network lifetime from the first principles. As opposed to incrementally improving the greedy heuristics as has been routine practice by various groups, the PI has succeeded in attacking the problem head-on by exploiting the possibility of practically tractable local solution space as seen from the perspective of each sensor. This novel approach has resulted in (i) fundamental insights into the problem structure and its solution space; (ii) a general algorithmic framework for distributed algorithms for related class of coverage problems characterized by those wherein local sub-solutions collectively yield feasible global solution; and (iii) a set of distributed algorithms moving the state-of-art to 25% below an upper-bound on network lifetime.<br\/><br\/>The proposed algorithmic framework as well as the overall approach are expected be applicable to other unrelated NP-hard optimization problems over networks. This innovative exploratory project first proposes to investigate whether the proposed algorithmic framework can be effective for non-target-coverage related problems such as channel assignment in cellular networks, vertex cover, and triangle packing. Next, the PI proposes to explore whether the overall approach can be applied to other fundamental yet critical problems such as for target tracking, data aggregation, and channelization of ad-hoc mobile networks for real-time traffic. While there is some road map for the former, very little is known for the latter. This lack of definitive tools of the trade and early, untested, exploratory, high-risk high-reward nature of the project are the primary reasons for this EAGER proposal.","title":"EAGER: Exploratory Frameworks for Distributed Algorithms for Optimization Problems on Networks of Heterogeneous Sensors","awardID":"0960780","effectiveDate":"2009-11-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["526127"],"PO":["557315"]},"161165":{"abstract":"0950102<br\/>Moser<br\/><br\/>One outcome of the NSF-sponsored workshop 'NSF Workshop on Cyber-Fluid Dynamics: New Frontiers in Research and Education' held July 19-20, 2007 was a recommendation that the fluid mechanics community move toward consolidating computational fluid dynamics (CFD) tools as well as libraries of reference numerical solutions and experimental data (http:\/\/www.nsfcyberfluids. gatech.edu\/). A number of communities have benefited from such a software consolidation. These include the biological molecular dynamics community with NAMD (http:\/\/www\/ks.uiuc.edu\/Research\/namd) and GROMACS (http:\/\/www.gromacs.org), the weather modeling community with WRF (3www.wrf-model.org), and the geodynamics community with CIG (http:\/\/www.geodynamics.org\/). Among the benefits of such a consolidation would be: lowering barriers to innovation in modeling and numerical methods by providing a software platform for such innovation, increasing productivity of CFD-based research by providing well characterized and well established tools for such research, enabling fluid dynamics research through access to a wide array of reliable experimental and computational data, and improving standards for verification and validation to improve reliability of CFD solutions. To further pursue the possibility and potential processes for developing community software and data resources, a follow-up workshop specifically focused on the development and consolidation of such community resources is planned. The objectives of this workshop are three fold: 1. To explore the likely value and practical issues associated with development of fluid dynamics community software and data resources. 2. To develop a set of recommendations regarding whether and how to move forward to develop such resources. 3. To identify a group of fluid dynamics researchers who will participate in whatever development process is recommended. This award is primarily for participant support costs and will be used to attract a diverse workshop particiation.<br\/><br\/>This workhop grant is cofunded by the ENG, OCI, and CISE Directorates.","title":"A Workshop on the Development of Fluid Mechanics Community Software and Data Resources","awardID":"0950102","effectiveDate":"2009-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"7691","name":"PetaApps"}}],"PIcoPI":["527003","515803"],"PO":["525323"]},"166876":{"abstract":"","title":"HCC-Small: Collaborative Research: Statistical Methods for Learning to Diagnose Specific Language Impairment in Bilingual Children","awardID":"1008743","effectiveDate":"2009-11-05","expirationDate":"2010-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["562856"],"PO":["565227"]},"159309":{"abstract":"IndianaUniversity proposes a planning project for the creation of the Indiana Stars (IN-STARS) Alliance, which will leverage the already existing STARS Alliance model. The alliance will include research intensive universities, Indiana's community college system, residential campuses, commuter campuses, urban locations, as well as more rural locations. The alliance includes Techpoint, Indiana's statewide information technology consortium. Each educational member of the alliance brings different strengths and student populations, with a wide range of degrees, including computer science, computer information systems, information technology, and informatics. IN-STARS will provide enhanced opportunities for traditionally under-represented students in computing by creating strong local networks of students within each of the alliance institutions, and strengthening the support mechanism for this critical population of students by creating online social networks, and statewide conferences to bridge the local networks. <br\/><br\/>The focus of alliance planning activities will be to design programs that will create increased awareness of opportunities to be gained by majoring in computing. Over the course of the planning project, the PIs will design specific outreach programs for the IN-Stars Leadership Corps students and design a combination of approaches aimed at taking advantage of each alliance members? strengths. Outreach activities envisioned in this alliance include precollegiate summer programs, a statewide conference for the students participating as Stars leaders, a statewide conference for high school students, programs specifically geared for exploratory students already attending a particular college or university, all supported by development of social networks to link students, and co-curricular programs. A major component of the planning process is to establish detailed assessment programs, which will be designed to be coordinated with the existing STARS Alliance data collection efforts to provide enhanced understanding of the impacts of this approach locally and nationally. The PIs will disseminate the detailed plan to the computing community, to support and enhance other organizations and programs seeking to broaden participation in computing via the BPC-LSA approach.","title":"BPC-LSA: The Indiana Stars Alliance - Reaching Out, Connecting and Enhancing Diversity","awardID":"0940549","effectiveDate":"2009-11-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425877,"425936"],"PO":["561855"]},"168935":{"abstract":"Bioinformatics, Systems Biology and Intelligent Computing are synergistic interactive research<br\/>disciplines that hold great promise for the advancement of research and development in complex<br\/>biomedical systems, agricultural, environmental, pharmaceutical and medical sciences as well<br\/>as public health, drug design, genomics and so on. Research and development in these two are impacting the science and technology of fields such as medicine, food production, forensics, agriculture, pharmacy, engineering and bio-mathematical and biophysical sciences by advancing<br\/>fundamental concepts in molecular biology, in genomics and in medicine, by helping us understand living organisms at multiple levels, by developing innovative implants and prosthetics, by new medical image technologies, and by improving tools and techniques for the detection, prevention and treatment of diseases. The International Joint Conference on Bioinformatics, Systems Biology and Intelligent Computing (IJCBS 2009) provides a common platform for the cross fertilization of ideas, and to help shape knowledge and scientific achievements by bridging these two very important and complementary disciplines into an interactive and attractive forum. Keeping this objective in mind, IJCBS 2009 is aimed at promoting inter\/multidisciplinary education<br\/>and research by offering a number of keynote, tutorial and cutting-edge research lectures. IJCBS 2009 will host special sessions focusing on the interdisciplinary and multidisciplinary education and research in order to foster collaboration between the bioinformatics, systems biology and intelligent computing domains in the USA and China. IJCBS09 will provide travel support for a number of selected USA students and scholars to attend the event.","title":"Promoting Inter\/Multidisciplinary Education and Research, The International Joint Conference on Bioinformatics, Systems biology and intelligent computing","awardID":"1019213","effectiveDate":"2009-11-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[452129],"PO":["565136"]},"162578":{"abstract":"Spontaneous facial expressions are representative of facial expressions in daily life. Studying spontaneous (non-posed) facial expressions and Facial Action Coding System-AUs (FACS-AUs) requires spontaneous face expression data where the action units are manually and reliably coded. Currently, there is a high demand in computer vision society for such a database. The first objective of this research is to capture a 3D facial expression database and make it publically available to others interested in studying spontaneous facial expressions. As ground-truth, we also manually code the existence and the intensity of important action units (i.e., AU 1, 2, 4, 6, 9, 10, 12, 14, 15, 20, 25, and 26) in this dataset. These action units describe positive and negative emotional expressions. <br\/><br\/>The second objective of this research is to develop a framework to automatically measure the intensity of spontaneous FACS action units in videos captured from adults? faces. We aim to study dictionary-based representation (e.g., combination of wavelet and shearlet) to model face appearance in facial images. This is due to the fact that human facial images contain of edges, wrinkles and texture. We study this type of combined representations to provide a sparse representation of images containing edges and textures and utilize it in measuring the AU intensities. <br\/><br\/>The results of this research, the face database, the manually codes of AUs, and the developed framework in the measuring the AUs, are made publically available to other researchers in computer vision society.","title":"EAGER: RI: Developing a Framework for Automated Measurement of the Intensity of Spontaneous Facial Expressions","awardID":"0957983","effectiveDate":"2009-11-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["522995"],"PO":["564316"]},"161502":{"abstract":"The 19th IEEE International Conference on Computer Communications and Networks (ICCCN 2010) will be held in ETH Zurich, Switzerland in August, 2010 (http:\/\/icccn.org\/icccn10\/). This proposal requests $15,000 in funding to assist 10-15 United States-based graduate students to attend ICCCN 2010.<br\/><br\/>Intellectual Merit<br\/>ICCCN is one of the leading international conferences for presenting novel ideas and fundamental advances in the fields of computer communications and networks. ICCCN serves to foster communication among researchers and practitioners with a common interest in improving communications and networking through scientific and technological innovation. Technical co-sponsorship is provided by the IEEE Communications Society. In 2009, the number of submissions in response to the CFP was over 400; only 104 regular papers were selected by the Technical Program Committee for presentation at the conference. In 2009, the conference program includes 11 technical tracks, a number of keynote and distinguished speakers and panels. Besides, there are 7 workshops on cutting edge topics. ICCCN 2010 will include similar technical tracks and workshops and continue the tradition of presenting the Best Paper Award. <br\/><br\/>Broader Impact<br\/>Participation in conferences such as IEEE ICCCN is an extremely important part of the graduate students? research and career development, providing the opportunity for them to present their own work, attend panel and keynote speech sessions, interact with peers and more senior researchers, and expose themselves to leading edge work in the field of computer communication and networks. The support requested in this proposal will enable more participation of the US-based graduate students who would otherwise be unable to attend ICCCN 2010.","title":"NSF Travel Grant Support for IEEE International Conference on Computer Communications and Network 2010 Conference","awardID":"0952279","effectiveDate":"2009-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7937","name":"NETWORK CODING AND INFO THEORY"}}],"PIcoPI":[431963],"PO":["432103"]},"159294":{"abstract":"The University of Delaware (UD) proposes to partner middle school teachers with undergraduate computer science students to bring computing to underrepresented youth. The UD students will work with teachers from the Chester Community Charter School (CCCS), helping them to more effectively use XO laptops in their classrooms. To be able to use technology effectively across the curriculum, schools need sustainable strategies to help teachers become knowledgeable enough and confident enough to run computing-based activities. This project, Computing-Teams-4-Youth, builds on previous work with CCCS. It uses undergraduates in service learning opportunities to suppport teachers' integration of computing and computational thinking into middle school math, science, language arts, and social studies. Computing-Teams-4-Youth will (1) develop computational thinking activities and increased collaborative and differentiated learning activities for computing-based learning in middle school, (2) provide a service learning course for UD CS majors, with collaborative development teams matched with CCCS teachers and led by peer leaders to develop XO learning activities and apply good software engineering practice with feedback from a real client, and (3) build continuous software and professional development customized to teachers? student learning goals, with biannual teacher-focused workshops for training and collaborating. The undergraduates, working in carefully mentored software development teams, will gain from collaborative learning, software engineering practice with a real client, peer leader experiences, and an opportunity to experience first-hand the potential impact of their computing expertise in helping others. The teachers will get much needed support, and the middle school students will benefit from increased exposure to computers and computational thinking, increasing their interest in computing.","title":"BPC-DP: Partnering Middle School Teachers with Undergraduate Computer Science Teams to Bring Computing to Underrepresented Youth","awardID":"0940501","effectiveDate":"2009-11-15","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["527984","527985"],"PO":["561855"]},"159210":{"abstract":"The Institute of Electrical and Electronic Engineers requests travel support for participants in the Broader Engagement (BE) Program at the Supercomputing (SC) 2009 Conference. That program aims to increase opportunities for U.S. undergraduate, graduate, faculty, industry professionals, and researchers to learn about high performance computing (HPC). It emphasizes the participation of members of the groups that are underrepresented within the HPC community: African Americans, Hispanics, Native Americans, Alaska Natives, Native Hawaiians, Pacific Islanders, persons with disabilities, and women. Participants will have the opportunity attend specialized, targeted sessions, a student job fair, and to connect with mentors. This award will make it possible for additional participants to attend. New this year are (1) a pilot program combining the Broader Engagement Program, Education Program, Student Volunteers and Ambassadors Program into SC Communities to better leverage available opportunities for conference participants and (2) hosting travel to engage BPC Alliance members with the SC Community in order to build lasting relationships.","title":"Supercomputing 2009 Broader Engagement Program","awardID":"0940110","effectiveDate":"2009-11-01","expirationDate":"2010-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425619],"PO":["561855"]}}