{"162481":{"abstract":"Ongoing breakthroughs in nationally important research areas like Verification and Artificial Intelligence depend on continuing advances in high-performance automated theorem proving tools. The typical use of these tools is as backends: application problems are translated by an application tool into (typically very large and complex) logic formulas, which are then handed off to a logic solver. Different tradeoffs between linguistic expressiveness and the difficulty of solving the resulting problems give rise to different logics. Solver communities, formed around these different logics, have developed their own community research infrastructures to encourage innovation and ease adoption of their solver technology. Such infrastructure includes standard formats for logic formulas, libraries of benchmark formulas, and regular solver competitions to spur solver advances. <br\/><br\/>Currently, these different infrastructures are all developed separately, at significant cost in equipment and support. These costs are paid again and again for the different services, since there is currently no global piece of computing infrastructure suitable for the logic solving domain, which all these communities can use. This project is building a simplified proof-of-concept of a single piece of shared computing infrastructure, which could eventually be used by many different logic solver communities. The award also provides other support for soliciting research community feedback on the prototype and the design of a comprehensive infrastructure.","title":"Collaborative Research: CI-ADDO-NEW: *-EXEC: A Cross-Community Solver Execution Service","awardID":"0957438","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["471910"],"PO":["491702"]},"168960":{"abstract":"This proposal requests funding to assist approximately 6 US-based graduate students and junior faculty to attend the 19th annual New Security Paradigms Workshop (NSPW) to be held in Concord, MA, in September 2010. This is a unique meeting that combines scientific talks interleaved with vivid discussions, whose goal is to explore paradigm shifts that disrupt the status quo in security research. <br\/><br\/>NPSW is thought provoking, research stimulating, and is a highly valuable and unique experience to it participants. The support requested in this proposal will enable the participation of students and junior faculty who would otherwise be unable to attend NPSW.","title":"NSF Support for the 2010 New Security Paradigms Workshop Financial Aid; September 2010; Concord, MA","awardID":"1019309","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["564223"],"PO":["565264"]},"163031":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-60316<br\/>PI(s): Brown, Frank, L.; Fredrickson, Glenn, H.; Garcia-Cervera, Carlos; Gilbert, John, R.; Van de Walle, Christian, G.<br\/>Institution: University of California-Santa Barbara <br\/>Title: MRI-R2: Acquisition of a High Performance Central Computing Facility at UCSB<br\/>Project Proposed:<br\/>This project, acquiring of a computational cluster to replace a six-year-old system, allows access to fast mid-sized parallel computation to dozens of researchers and serves as the institution's primary resource for parallel computation. The system is structured for a variety of uses. Standard MPI computation is carried out with a tightly coupled cluster of quad core processors, while 'fat nodes' with 256 GB of RAM as well as local high speed disk storage service jobs that require large shared memory. Researchers actively developing codes can take advantage of the unique performance characteristics of GPU (graphics processing) nodes. The system will have several NVidia Tesla nodes.<br\/>The users of the system are drawn from all five departments of the College of Engineering (Chemical Engineering, Computer Science, Electrical & Computer Engineering, Materials, and Mechanical Engineering), seven departments of the Division of Mathematical, Life and Physical Sciences (Chemistry & Biochemistry, Earth Science, Ecology Evolution & Marine Biology, Mathematics, Molecular Cellular & Developmental Biology, Physics, and Psychology), as well as the departments of Economics, Geography, and Media Arts & Technology from the Division of Humanities and Social Sciences. In addition, the system supports research in eight campus centers: Allosphere Research Facility, the California NanoSystems Institute, the Center for Polymers and Organic Solids, the Institute for Crustal Studies, the Kavli Institute for Theoretical Physics, the Materials Research Laboratory, the National Center for Ecological Analysis & Synthesis, and the Neuroscience Research Institute.<br\/>The new system will be housed in the same location as the previous one where the same successful administrative and maintenance procedures used for the past six years will be applied. The proposed cluster will be accessible via the UC Grid, a web portal interface that makes high performance computing resources easy to use from desktop machines (PCs or Macs). The acquired system will come with a three-year warranty. Prior experience has shown that only a small number of nodes are expected to malfunction during the useful lifetime (> 3 years) of the cluster. <br\/>Broader Impacts: <br\/>The research enabled by the campus-wide facility, interdisciplinary and collaborative in nature, is available to the broad research community. The large majority of users, roughly 75%, consists of postdocs, graduate students, and undergraduates (5%), allowing this award to accomplish NSF's longstanding goal of integrating research and education. Outreach to K-12 takes place via a new initiative, The School for Scientific Thought (SST), an extension to the Let's Explore Physical Sciences (LEAPS) Program. Under the SST Program UCSB science and engineering graduate students design and teach a course for an audience of high school students on Saturdays. In addition, many of the faculty associated with this proposal participate in the UC Leadership Excellence through the Advanced Degrees program that has increased the number of underrepresented students in science and engineering at UCSB.","title":"MRI-R2: Acquisition of a high performance central computing facility at UCSB","awardID":"0960316","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[436116,436117,"504404","560826","517721"],"PO":["557609"]},"169521":{"abstract":"The NAACL HLT conference is the major international conference in North America in the field of natural language processing. This project is to subsidize travel, conference, and housing expenses of students selected to participate in the NAACL HLT Student Research Workshop which will be held during the conference June 1-6, 2010 in Los Angeles, California. The workshop consists of two tracks: full paper presentations and poster presentations. All selected work has only student primary authors. The full paper sessions are composed of paper presentations followed by a discussion panel led by respected researchers in the field. The workshop is organized and run by students.<br\/><br\/>The Student Research Workshop provides a valuable opportunity for the next generation of natural language processing researchers to enter the computational linguistics community. It allows the best students in the field to take their first important step toward becoming professional computational linguists by receiving critical feedback on their work from external experts, and by making contacts with other students and senior researchers in their field. The students who are involved in running and selecting papers for the workshop also gain valuable opportunities for professional growth and interaction with the researchers on the organizing committee of the main conference. The workshop contributes to the maintenance and development of a skilled and diverse computational linguistics and natural language processing research community.","title":"Student Research Workshop in Computational Linguistics at the NAACL HLT 2010 Conference","awardID":"1022697","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["488661"],"PO":["565215"]},"168036":{"abstract":"This is funding to support a doctoral consortium (workshop) of approximately 10 promising graduate students from U.S. institutions of higher learning along with 3 distinguished research faculty, to be held in conjunction with the Third International Conference on Pervasive Technologies Related to Assistive Environments (PETRA 2010), which will take place June 23-25, 2010, on the island of Samos, Greece (http:\/\/www.petrae.org). PETRA is the leading annual interdisciplinary conference on assistive technologies. Its brings together experts in healthcare, sensors,, wireless communications, smart devices, intelligent software, privacy and security, to address an important social and healthcare issue, namely that as the world's population ages there is an urgent need to develop solutions for in-home care of the elderly, as well as of people with Alzheimer's, Parkinson's, and other disabilities or traumas. PETRA provides a unique venue that focuses on combining wireless computing, sensors, and other pervasive computing technologies into assistive environments. While PETRA 2010 will continue to bridge the continuum from data collection and processing to semantic understanding of human behavior, it will also evolve and incorporate new exciting aspects such as how to connect the genotype with phenotype, or the clinical\/biomedical features with behavioral patterns and how these impact each other and thus refine research. PETRA 2010 will also study vital issues in privacy and security in monitoring ambient intelligent environments with the goal of identifying and predicting risks, intrusions, unauthorized access to information, or information leaking. PETRA projects assume a human is at the center of \"cyberphysical systems\" where the digital world merges with the physical.<br\/><br\/>The goals of the Doctoral Consortium are to increase the exposure and visibility of the participants' work within the community, to help establish a sense of community among this next generation of researchers, and to help foster their research efforts by providing substantive feedback and guidance in a supportive and interactive environment from a group of senior researchers. Student participants in the Doctoral Consortium will be drawn from diverse communities including computer science, engineering, psychology, social science, neuroscience, human-computer interaction, cognitive science and communication. They will make formal presentations of their work and will receive feedback from a faculty panel; the feedback is geared to helping students understand and articulate how their work is positioned relative to other research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. The workshop faculty members will bring a wide spectrum of expertise, and provide student mentoring and coordination. Doctoral Consortium attendees will have short papers on their work included in the Conference Proceedings, and a summary report on the event will be posted on the conference website. <br\/><br\/>Broader Impacts: The PETRA 2010 Doctoral Consortium will bring together some of the best students, researchers and practitioners in relevant fields, and will thereby afford the younger participants a unique opportunity to gain wider exposure for their innovative ideas while also receiving reinforcement for the importance and value of conducting research with societal impact. The workshop will allow the junior participants to create a social network both among themselves and with senior colleagues. Since the conference is expected to host a diverse group along several dimensions (such as nationality, scientific discipline, and research specialization), participants' horizons will be broadened and new collaborations will emerge, to the future benefit of the field. The organizing committee will make a concerted effort to attract participants who are women, members of under-represented minorities, and persons with disabilities.","title":"Doctoral Consortium and Student - Author Travel for PETRA '10 Conference","awardID":"1015219","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["463572","560636","557541","229551"],"PO":["565227"]},"172096":{"abstract":"This award is made in support of a collaborative project called \"Frontiers in Activity Recognition\" whereby a group of experts from different fields of computer science, engineering, mathematics and statistics convene in a workshop to be held in the vicinity of UCLA. <br\/>One component of the workshop consists in interactive break-out sessions where different approaches to activity representation (descriptors) and recognition will be analyzed. A second component consists in a competition, announced to the broad public ahead of the IEEE International Conference on Computer Vision and Pattern Recognition (CVPR), whereby an extensive dataset provided by a third party will be released, with benchmarks, and contestants will be invited to submit their best results in the detection of a number of action categories. The proposers of high-ranking approaches will be invited to the workshop to present their results and discuss it in the context of the analysis of the state of the art to be performed as part of the field assessment. The workshop can have broad impact to many applications ranging from security (surveillance, monitoring) to environmental science (habitat monitoring, global warming), to industrial operations (factory floor optimization), to multi-media and information retrieval (content-based video meta-data extraction), to entertainment (input devices for games), and to transportation (driver assistance).","title":"Frontiers of Activity Recognition","awardID":"1036462","effectiveDate":"2010-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[461021],"PO":["564316"]},"168961":{"abstract":"The purpose of this travel supplement is to develop a plan for a new research partnership between GridStat and INSPIRE. The proposal is to support two trips. The purpose of the proposed visits is to form a collaborative research between the PI and participants in the INSPIRE (INcreasing Security and Protection through Infrastructure Resilience), a Collaborative Project, co-funded by the European Commission, which focuses on SCADA systems.","title":"Transatlantic Collaborative Planning Travel for the Power Grid","awardID":"1019319","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":[452195],"PO":["565264"]},"163186":{"abstract":"CNS - 0961234 <br\/>Research Experiences for Undergraduates in Smart Environments<br\/>Cook, Diane J. <br\/>Washington State University<br\/><br\/>The goal of this REU Site program is to offer a unique training opportunity for undergraduates to conduct research in the multidisciplinary area of health-assistive smart environment technologies. The population is aging; therefore research is needed to understand the effects of aging and to find ways of allowing older adults and individuals with disabilities to lead independent lives at home. Our proposed REU program facilitates research and training in the complementary disciplines of computer science, electrical engineering, psychology, and health care. This program will partner with other REU programs both locally and in other geographic areas. Students will also interact with graduate students from a related IGERT program on campus. The REU program will continue to place emphasis on targeting involvement with women and students from underrepresented groups.<br\/>The program is designed to enable high quality interdisciplinary research that links technology design with health-based applications. The topics addressed are highly interdisciplinary and will require interaction with faculty and mentors from a number of disciplinary areas. The program will create new opportunities for undergraduates to study health and human behavior using the technology.","title":"Research Experiences for Undergraduates in Smart Environments","awardID":"0961234","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["547675","559679"],"PO":["563751"]},"159314":{"abstract":"The University of Alabama proposes a multi-tiered mentoring model (M3) that partners a diverse university campus with a large urban school system. The project will provide high-level instruction in computational thinking across three different age groups using a \"Learn to Teach, Teach to Learn\" approach. The participants will include: (1) middle and high school students from minority backgrounds, (2) their teachers, (3) minority and majority college students with secondary science education or computer science majors, (4) University educators from four interdisciplinary units (Computer Science, and the schools of Education, Engineering, and Medicine); and (5) a learning design firm dedicated to enhancing computing education through media and technology. <br\/><br\/>The Specific Aims of M3 are: (1) to recruit a cadre of minority and women middle and high school students into the computing pipeline by presenting engaging mentored technology experiences, (2) to expose pre-service secondary education students to pedagogical and technical aspects of computing education, through interdisciplinary peer mentorship, (3) to extend computational expertise among high school teachers in predominantly minority schools to encourage them to actively learn and teach computer science courses in their schools, (4) to increase the retention of minority students in undergraduate computer science programs by providing them opportunities to create innovative tools for computing education, (5) to engage K-12 administrators and parents of participants through workshops that highlight the benefits of careers in computing and (6) to evaluate the effects of M3 on student and teacher performance in computing education, their aptitude and interest for this area of research and tracking of career choices among participants.","title":"BPC-DP: A Multi-tiered Mentoring Model (M3) for Increasing Minority and Women Participation in Computing","awardID":"0940564","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["555863","495546",425896,"555863","495546",425899],"PO":["561855"]},"162692":{"abstract":"Parallel computing now plays a central role in nearly every science and engineering endeavor. The leading supercomputers today comprise hundreds of thousands of processors, and in the near future are expected to comprise millions of processors. Researchers at the University of Delaware are working to harness this vast computing power to make ground-breaking scientific discoveries. This work requires fundamental algorithmic research and development to address issues such as multiscale coupling, scalability, and hybrid message-passing\/threaded programming.<br\/><br\/>The investigators are building a new, highly parallel, computing system for scientific computation research and teaching at the University of Delaware. This computer consists of approximately 1,600 processors, and is expandable to many more. UD researchers who share a common interest in scalable parallel computation plan to explore a variety of scientific applications: 3D Navier-Stokes solvers for environmental turbulent flows; \"ensemble analysis\" in oceanic forecasting; computational electromagnetism; simulation of emulsion microstructure for environmental pollution control and material synthesis; electronic structure calculations for atoms and molecules; multiscale cloud dynamics for more reliable weather and climate prediction; computational carbon nanoelectronics; and vorticity-dominated flows. The new computer will be used to optimize the current algorithms in each application, help identify limitations to scalability, and explore new ideas to enable scaling to hundreds of thousands of processors and to take advantage of hybrid architectures. The system motivates collaboration among faculty interested in application problems and faculty with expertise in computer science. Libraries for efficient parallel data redistribution and automatic optimization of parallel codes are some of the ways the computer scientists participating in the project are enhancing the scientific applications.","title":"II-New: System Acquisition for the Development of Scalable Parallel Algorithms for Scientific Computing","awardID":"0958512","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["503569","548919","561781","561820"],"PO":["565272"]},"171096":{"abstract":"This project supports a workshop whose purpose is to give push to collaborative research between US and EU in the areas of pervasive computing and social networking relative to emerging applications. The collaboration will enrich education, research and development in pervasive social networking. The Workshop will be collocated with the IEEE International Conference on Pervasive Computing and Communications in Mannheim, Germany on March 29, 2010. The requested funding is intended to support US researcher to attend this workshop. It is expected that the workshop will lead to both short and long term collaborations between US and EU researchers in this important emerging area.","title":"CSR: NSF-EU Workshop on Pervasive Computing and Social Networking for Emerging Applications","awardID":"1030695","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["486502"],"PO":["535244"]},"163000":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-60163<br\/>PI(s): Sukhatme, Gaurav; Caron, David A.; Edwards, Katrina J.; Jones, Burton, H; Mitra, Urbashi<br\/>Institution: University of Southern California <br\/>Title: MRI-R2: Acq. of a Networked AUV-based Instrument for the Southern California Bight<br\/>Project Proposed:<br\/>This project, acquiring a networked instrument composed of two complementary Autonomous Underwater Vehicles (AUVs), supports an extensive program of research in robotics, underwater acoustic communication and networking, marine biology, oceanography, and biogeochemistry at the Center for Integrated Networked Aquatic PlatformS (CINAPS). These two AUVs add capability to those already in use by CINAPS. The work addresses two current key limitations: limited depth (depth no greater than 200m) and limited communication (only supports communication through the air, i.e., when the vehicles are not below the surface.) These instruments impact agendas in two main fields: research in the Southern California coastal marine ecosystem (in physical oceanography, geobiological oceanography, and microbial ecology), and research in robotics, communication, and networking.<br\/>The instrumentation consists of a Slocum Electric Glider and an EcoMapper-EP (Expandable Payload) Autonomous Underwater Vehicle. The Slocum glider, for use up to 1000m, was developed by in the early 1990's, and has become an integral tool of ocean science in this decade. It is driven entirely by a variable buoyancy system rather than active propulsion. The glider's wings convert the buoyancy-dependent vertical motion into forward velocity. Slocum gliders are truly autonomous, requiring a surface vessel only for deployment and recovery. On-board communications capabilities include a two-way RF modem, Iridium satellite and an ARGOS locator. With its onboard instrumentation, combined with its mobility and long-range capabilities, the glider provides continuous, near-real-time information, about the physics and biogeochemistry of the ocean. Designed specifically for water quality and bathymetry mapping applications, the Ecomapper for shallow use (up to 200m) is a unique AUV. Easily deployed by one person, it is able to perform a wide-area survey without a surface workboat or associated personnel. The EP class EcoMapper allows for additional ports for customized sensor integration and space for a second low-power CPU to support the additional sensors and software. This additional CPU enables mission adaptations to occur on-the-fly based on real-time sensor readings that are necessary when trying to detect and track dynamically changing oceanic features a range of important processes and associated questions can only be studied with the coupling of deep AUV operations (up to 1000m) with shallow (up to 200m). These include (a) the toxic effect of harmful algal blooms at greater depth, (b) the temporal and spatial variations of the low oxygen interface (deep basins can become hypoxic or anoxic due to isolation), and (c) fluxes of particulate material from urban runoff to the deeper sea that are discontinuous in both time and space; the spatial extent of which can be best resolved with autonomous vehicles that can maintain a presence over several events. To enable these studies, new algorithms for multi-AUV communication and control are necessary. The ability to coordinate vehicle trajectories and missions while submerged presents a current limitation. This is of particular concern in the Southern California Bight, the study site, a region with high maritime traffic where surfacing of the AUVs needs to be minimized. Used as a field instrument deployed in the Southern California Bight (SCB), the instrument is programmed and bench-tested in the Robotic Embedded Systems Laboratory on the USC main campus in LA. The instrument manager is supported by the PI;s grants. USC covers all operational and maintenance costs.<br\/>Broader Impacts: <br\/>The instrumentation impacts faculty research and student education, contributing to enable new science in diverse research projects and impacting the ongoing instruction at the institution and serves as a learning tool to develop student scientific proficiency (through existing courses and participation in faculty-led research). This acquisition plays an important role in the Southern California Bight Study planned for Spring 2010, coordinated by the Southern California Coastal Water Research Project (SCCWRP), a public agency focusing on the coastal ecosystems of Southern California. The PIs have close collaborative ties to this agency. Moreover, the networked and adaptive sensor systems provide important data relating to the climate and health of Southern California coastal ocean.<br\/>Undergraduate students are involved through REU site awards at USC. Since the PI runs the USC Computer Science department REU site for research in various ","title":"MRI-R2: Acquisition of a Networked AUV-based Instrument for the Southern California Bight","awardID":"0960163","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[435967,"495864","515828","560335","559475"],"PO":["557609"]},"171382":{"abstract":"This project is advancing the scope, effectiveness, impact, and scientific rigor of experimental tools and methodologies available to researchers in cybersecurity and networking. Underpinning the project, and forming a second objective, is the creation of a new international, inter-disciplinary community of researchers in the United States and Japan that leverages the shared vision and complementary strengths of the individual collaborators and their respective research cultures. <br\/>The work includes design and implementation of a federated system integrating USC\/ISI?s DETER and JAIST?s StarBED research testbeds. Among key elements, the development of an advanced experiment description language builds on current DETER and StarBED capabilities to support higher-level reasoning about experiment configuration, workflow and validity, while research into new user interface approaches for controlling extremely complex experiments leverages StartBED?s kuroyuri procedural model and DETER?s SEER declarative model. Because this work is carried out in the context of DETER?s existing federation architecture, users of the facility will additionally gain access to other DETER cooperating infrastructures such as GENI.<br\/>Also included is a series of catalyst research tasks, designed as motivators for the infrastructure while providing value to future networks. One task is focusing on improving the robustness and dynamic error recovery of Internet routing by creating dynamic policy-conformant fallback paths within the Internet?s interdomain routing protocol, BGP. The other task is addressing a significant challenge to the deployment of a secure Domain Name System (DNS) through robust unscheduled rekeying. Each task leverages previous research by multiple project collaborators, and each poses significant challenges to the new experimental facility.","title":"Long-Range Active Collaborative Environment (LACE)","awardID":"1032314","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[458851,458852],"PO":["564993"]},"169667":{"abstract":"This award gives travel, housing, and registration-cost support to selected doctoral students from U.S. universities for their participation in the Doctoral Consortium of the 20th International Conference on Automated Planning and Scheduling (ICAPS-10) held May 13 in Toronto, Canada. ICAPS is the premier conference for research in artificial intelligence planning and scheduling, with relevance to a wide variety of applications such as software engineering, manufacturing, transportation, and robotics. The ICAPS-10 Doctoral Consortium includes a poster session, where students present their research, and a mentoring program that pairs senior scientists with doctoral students.","title":"Doctoral Consortium Travel Support: International Conference on Automated Planning and Scheduling","awardID":"1023246","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["505404"],"PO":["491702"]},"159327":{"abstract":"The Puget Sound Center for Teaching, Learning and Technology proposes the Computer Science Collaboration (CSC) Project, which will build capacity among K-12 programs that aim to increase diversity in computing. Many K-12 organizations and activities are designed to address the continuing underrepresentation in computing among people with disabilities, women, and certain racial\/ethnic minorities. Yet we have seen few gains in representation among these groups. This is, at least in part, due to the isolation of outreach organizations and their inconsistent capacity to access and implement best practices. The CSC Project aims to change this by building collaborations and connections between existing programs. It will use the most successful elements of the National Girls Collaborative Project to work with the Alliances and K-12 outreach organizations that are already part of the BPC community, specifically focusing on outreach to persons with disabilities, African Americans, Hispanics, American Indians, Alaska Natives, Native Hawaiians, Pacific Islanders, and women. The CSC Project aims to maximize access to shared resources within organizations (public and private) serving underrepresented youth in computing, strengthening their capacity by sharing best practice research and program models, outcomes, and products through training and dissemination. In this way, the project hopes to create the tipping point, creating a community of projects, initiatives, and stakeholders dedicated to transforming the computing workforce with equitable participation.","title":"BPC-LSA: The Computer Science Collaboration Project","awardID":"0940646","effectiveDate":"2010-05-01","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["533833","552450","478878"],"PO":["561855"]},"170470":{"abstract":"This is funding to support the Student Design Competition (SDC), which will be part of the 2010 annual RESNA conference to be held June 26-30 in Las Vegas. Today, between 40 and 56 million people in the United States report some type of disability, and this number will likely grow in the coming years as the baby boom generation enters late life. RESNA (formerly the Rehabilitation Engineering Society of North America) is the one organization with an international focus that is devoted solely to technology for individuals with disabilities. RESNA's membership consists of individuals and institutions covering a range of disciplines (including researchers, clinicians, suppliers, manufacturers, consumers and educators who work in non-profit and for-profit settings), all of whom are dedicated to promoting the exchange of ideas and information for the advancement of assistive technology. In addition to its annual conference, RESNA conducts a credentialing program for assistive technology practitioners, rehabilitation engineering technologists and suppliers, as well as sponsored projects. RESNA's Technical Standards Board is the U.S. Technical Advisory Group to ANSI, the official U.S. representative to the International Organization for Standardization (ISO), for the development of ISO standards pertaining to assistive technology and other products for persons with disabilities.<br\/><br\/>The RESNA Student Design Competition fosters innovation and creativity with the ultimate goal of producing technology that can contribute to the independence of individuals with disabilities. The first SDC was held in 1980 as part of the inaugural RESNA conference. Since then, over 200 designs have been identified as winning entries, chosen from more than 600 submissions by students from over 115 different universities. SDC entries are required to represent the work of students ONLY, including the design documentation; both undergraduates and graduates are eligible to take part. Many past participants in the event are now leaders in service, research, and educational areas related to technology for people with disabilities. Some past student designs have been patented and are now available commercially. NSF has been a supporter since 2005. This year's funding will enable the SDC to be further expanded and enhanced, so as to include more entries and support for more design teams, especially from minorities, women, and individuals with disabilities. A call for participation has been posted on the conference website, and also distributed electronically to a large number of colleges and universities with engineering and design schools. A team of 5 judges will pre-select entries from up to 10 teams, from which two members each will be invited to attend the conference supported with travel and hotel funds as well as complimentary registration. During a half-day session in which the teams will make presentations before the judges and public audience at the conference, 5 teams will ultimately be selected as the final winners. Judges will have an opportunity to ask questions and make suggestions and recommendations to the design teams. A platform session will be held in which the 5 finalists will make presentations to the general conference attendees. All SDC teams invited to the conference will have an opportunity to present their projects in a poster session during the general conference time. More information is available online at http:\/\/www.resna.org\/conference.<br\/><br\/>Broader Impacts: The annual RESNA Conference and the Student Design Competition combine to create a forum for interaction between working and experienced rehabilitation engineers and students who are about to enter the field. Unique in its primary focus on undergraduates, the event provides participants with experience and skills that help them succeed in their engineering and design careers. It further encourages and mentors students in various disciplines to become involved in the assistive technology and rehabilitation engineering fields, and also provides an opportunity for the students to network with their peers and rehabilitation engineers, many of whom participated in previous SDC competitions. In an effort to increase the diversity of submissions to the SDC in future years, this year's participants will build web pages to illustrate their design and design process. Not only will young scientists benefit from this medium of dissemination but professors and those who teach will also be able to share this information with their students as examples of projects that others have done. The content of all submissions, not just the finalists, will be captured and accessed through the RESNA website. The information will be searchable through the National Public Internet Site on assistivetech.net and the ATWiki. Use of an existing national search engine will allow professors to use design information in their course work, while allowing service providers and people with","title":"2010 Student Design Competition - Las Vegas, NV","awardID":"1027077","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["559082"],"PO":["565227"]},"166214":{"abstract":"This award partially supports a series of three national and international Frontiers of Engineering (FOE) Symposia by the National Academy of Engineering (NAE): German-American Frontiers of Engineering (April 23-25 in Knoxville, Tennessee), U.S. Frontiers of Engineering (September 23-25 in Armonk, New York), and EU-US Frontiers of Engineering (late fall 2010, location TBD). Each symposium focuses on four topical areas. Topics for 2010 include cloud computing, biosensing and bioactuation, engineering and music, autonomous space systems, rapid vaccine manufacturing, novel concepts for automobiles, lasers, modern power system grid control, synthetic biology, mobility and transport, technologies for safety and security, and energy\/environment. Between 60 and 100 outstanding, early-career scientists and engineers participate in each symposium. Sessions consist of presentations by speakers on leading edge research, emerging technologies, and opportunities for collaboration across science and engineering fields. The symposia foster interdisciplinary and international collaborations and serve as a reference point for many of the emerging frontiers in research and innovation in the U.S. Presentations from the U.S. FOE seminar will be posted on the NAE FOE web site.","title":"2010 Frontiers of Engineering Symposia (U.S., German-American, and EU-US)","awardID":"1005574","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1517","name":"ELECT, PHOTONICS, & MAG DEVICE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"1630","name":"MECHANICS OF MATERIALS"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0704","name":"Division of EMERGING FRONTIERS IN RES & IN","abbr":"EFRI"},"pgm":{"id":"1402","name":"BIOCHEMICAL & BIOMASS ENG"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0704","name":"Division of EMERGING FRONTIERS IN RES & IN","abbr":"EFRI"},"pgm":{"id":"7633","name":"EFRI RESEARCH PROJECTS"}}],"PIcoPI":["543859"],"PO":["565007"]},"162760":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-58854<br\/>PI(s): Wu, Jie, Biswas, Saroj K., Klein, Michael L., Rivin, Igor, Shi, Yuan<br\/>Institution: Temple University<br\/>Title: MRI-R2: Acquisition: A Hybrid High-Performance GPU\/CPU System<br\/>Project Proposed:<br\/>This project, acquiring a hybrid high-performance GPU (graphics processing unit)\/CPU system, enables broader heterogeneous computing by deploying multiple types of computing nodes and allowing each to perform the tasks to which it is best suited in traditional CPU-based, GPU based, and hybrid GPU\/CPU applications. Satisfying two major research environments in computer and information sciences and scientific computing, the instrument <br\/>- Serves faculty and students conducting research using existing parallel application software and developing tools for parallel programming and parallel applications of the system, <br\/>- Serves the center for High Performance Computing and Networking at the institution and the greater Philadelphia region offering services not only to other departments on campus, but also to other institutions in the local community, such as area high schools and local colleges\/universities , <br\/>- Educates and trains providing a computing environment to various science courses for students to gain hands-on experience and offers research training sessions to the local research community; and<br\/>- Fosters collaboration by supporting joint research with local colleges\/universities, in collaboration with other schools in the state, to develop, test, and apply advanced tools for designing and executing parallel programs.<br\/>Among others, the Center services Chemistry, Computer and Information Sciences, Electrical and Computer Engineering, Mathematics, Physics, and Pulmonary, Critical Care Medicine and Physical Therapy. The instrument specifically supports research projects with broad impact in molecular self assembly, microvessel networks, spatio-temporal data analysis, large-scale system simulation, effective uniformization, fault tolerant computing, etc. and augments existing applications using the GPU as an accelerator enabling some problems to run entirely on the GPU.<br\/>Broader Impacts: <br\/>The instrument greatly enhances the current computing facilities at the institution. With its GPU\/CPU component, this instrument is the first of its kind of high-performance computing facility in the greater Philadelphia region, an area with a high degree of diversity. This university draws a substantial portion of its students from one of the largest African American populations in the country. Enabling education, training, and collaboration, the instrument contributes to foster economic growth in an area with a high concentration of high-tech and IT-related industries that currently has no high-performance computing and networking center of this magnitude. The region is now able to go beyond minimal services and promote and support collaboration and cooperation across sectors (e.g., higher education and local industry).","title":"MRI-R2: Acquisition: A Hybrid High-Performance GPU\/CPU System","awardID":"0958854","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["7594",434973,"515512",434975,"497770"],"PO":["557609"]},"163784":{"abstract":"The goal of this research project is to enable statistical analysis and knowledge discovery on networks without violating the privacy of participating entities. Network data sets record the structure of computer, communication, social, or organizational networks, but they often contain highly sensitive information about individuals. The availability of network data is crucial for analyzing, modeling, and predicting the behavior of networks.<br\/><br\/>The team's approach is based on model-based generation of synthetic data, in which a model of the network is released under strong privacy conditions and samples from that model are studied directly by analysts. Output perturbation techniques are used to privately compute the parameters of popular network models. The resulting \"noisy\" model parameters are released, satisfying a strong, quantifiable privacy guarantee, but still preserving key properties of the networks. Analysts can use the released models to sample individual networks or to reason about properties of the implied ensemble of networks. <br\/><br\/>By synthesizing versions of networks that would otherwise remain hidden, this research can advance the study of topics such as disease transmission, network resiliency, and fraud detection. The project will result in publicly available privacy tools, a repository for derived models and sample networks, and contributions to workforce development in the field of information assurance. The experimental research is linked to educational efforts including undergraduate involvement in research through a Research Experience for Undergraduates site, as well as interdisciplinary seminars.<br\/><br\/>For further information see the project web site at the URL:<br\/>http:\/\/dbgroup.cs.umass.edu\/private-network-data","title":"TC: Medium: Dissemination and Analysis of Private Network Data","awardID":"0964094","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["545655","562750","449017"],"PO":["565136"]},"169900":{"abstract":"This award funds students to attend a summer school in Bangalore, India, hosted by IIT-Bangalore in India from May 23 - 30, 2010. The goal of this school is to expose graduate students and young researchers to new and important ideas in concurrent and real-time programming. Concurrency is an important topic involved in design of new hyper-threading techniques in computer architectures, specification of non-blocking data structures and algorithms, implementation of scalable computer farms for handling massive data sets, and the design of a robust software architecture for distributed business processes. Recent architectural advances in multi-core and many-core architectures have made this an essential topic for a serious student of computer science. The focus will be on real-time systems, programming language design, program analysis, specification, and implementation as they relate to concurrent systems. Real-time issues are important in many kinds of critical embedded and other types of systems. The trip to India will also be an international experience and a community-building experience for the next generation of researchers.","title":"Third International Summer School on Trends in Concurrency","awardID":"1024387","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7943","name":"PROGRAMMING LANGUAGES"}}],"PIcoPI":["549800","558390","540776"],"PO":["564388"]},"166655":{"abstract":"The 2010 IEEE INFOCOM Conference on Computer Communications will be held in San Diego, CA from March 15 to March 19, 2010. This flagship technical conference is a premier venue in the area of computer communications, and is widely attended by researchers and practitioners in the field. This project provides funds to support approximately twenty-one graduate and post-graduate students in the United States to attend INFOCOM 2010 and to present their work. Participating students will also have the opportunity to attend several technical activities, including paper presentations, workshops, tutorials and panel\/keynote sessions.<br\/><br\/>The intellectual merit of the proposal resides in encouraging and supporting student attendance to INFOCOM 2010. This continues the tradition of previous INFOCOM conferences as a premier venue for bringing together academia, industry, and government to share newest developments. Its rich program exposes participants to new ideas and cutting-edge research and allows for interaction between researchers from all over the world.<br\/><br\/>In terms of broader Impact, the project integrates research and education through exposure of students to one of the premier conferences in computer communications. Students have the opportunity to attend high-quality presentations and interact with senior researchers as well as peers in the field. This experience is expected to have a positive impact on the students? development as well as in shaping the future of the field. The project also promotes diversity by encouraging and enabling the participation of women, graduate students from under-represented minorities and institutions, and, for the first time, postdoctoral students as well.","title":"Student Travel Support for the Infocom 2010 Conference; San Diego, CA","awardID":"1007615","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["536897"],"PO":["557315"]},"163883":{"abstract":"The conventional architecture for short-range, low-power, wireless hardware integrates a radio transceiver and a general-purpose microcontroller. However, microcontrollers have limited computational power and hence, restrict the kinds of algorithms that can be implemented. Moreover, closed radio architectures prevent the direct access to the physical layer needed for many novel applications. The emergence of low-power FPGAs with their efficient duty cycling support presents an opportunity to create a novel wireless platform to overcome these limitations. The project develops a highly flexible hardware\/software architecture for mobile wireless networking based on low-power FPGA devices. High performance DSP and other algorithms can be implemented directly in hardware, while the rest of the code runs on a soft processor core inside the FPGA. This flexible hardware\/software boundary increases the complexity of software development that is eased via sophisticated development tool support and an extensive software component library that the project is also developing. The small inexpensive platform offers two orders of magnitude higher performance than current microcontroller-based hardware at equivalent power for many applications. Hence, it will stimulate research in novel protocols and enable new applications not possible today. A competition for undergraduate students will be organized in which winners will receive the hardware, software, training, and mentorship needed to carry out their ideas during a paid summer internship at Vanderbilt.","title":"NeTS: Medium: Collaborative Research: Experimental Platform for Low-Power Wireless Networking Research","awardID":"0964592","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["551714","527012"],"PO":["565303"]},"163675":{"abstract":"This project is focused on research issues associated with producing extremely detailed and accurate 3D geometry and appearance (BRDF) models at city scale from internet collections of photos from various sources containing millions of photos of enormous diversity such as viewing range and conditions, time of day and weather conditions, to name a few. The properties of urban scenes may include low-texture surfaces, reflective and transparent materials, and repeated structures that challenge existing reconstruction algorithms. The investigators will address these challenges with the aim of reconstructing several large US and foreign cities. Historical photos and virtual models may also be incorporated. There are a number of research topics associated with the project. To register photographs and recover sparse geometry at city-scale, a new, unified, structure-from-motion (SfM) algorithm will be designed to take advantage of large, parallel computing platforms. With registered photographs and sparse 3D scene points recovered by SfM, multi-view stereo (MVS) algorithms can reconstruct detailed geometric models. Novel MVS algorithms will then exploit the structure of architectural scenes and volumetric reconstruction methods will be employed to produce annotated models of exceptional accuracy and usability. Digital models are playing an increasingly important role in social, cultural and economic endeavor and are central to next-generation mapping and visualization applications. All models and datasets will be made freely available to researchers and the general public.","title":"RI: Medium: Collaborative Research: Reconstructing Cities from Photographs","awardID":"0963657","effectiveDate":"2010-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":[438138,"533242",438140],"PO":["565227"]},"168944":{"abstract":"The recent growth in large-scale networks and online communication has generated new ways in which networks can diffuse information. But a number of research questions remain unanswered, such as how networks affect innovation and how network structure shapes competition among ideas or technologies.<br\/><br\/>The goal of the research is to examine how research communities and links between them affect innovation. It develops a theory of how connections and absences of connections among individuals influence the process of innovation, with particular attention paid to the role of \"boundary agents\" who straddle different communities.<br\/><br\/>Intellectual Merit. The project is poised at the frontier of computer science and economics. Computer scientists have long studied how information is created and processed. Economists have long studied incentives for innovation. This project introduces a new paradigm. It studies innovation in networks of people and firms, where information flows through network links. Developing this paradigm requires a deep understanding of the graph-theoretic properties of the network and the incentives of the participants. The combined tools of the principal investigators represent a significant methodological advance not only for computer science and economics, but the sciences more generally.<br\/><br\/>Broader Impact. The project increases participation of women and under-represented groups in science. A graduate course trains students in state-of-the-art tools in network science from all relevant fields including economics, social sciences, mathematics, and computer science, while under graduate courses incorporate social network examples. In addition, the research advances understanding about the participation of underrepresented groups in social and economic networks. Finally, the scientific aims of the project develop knowledge that can inform policy makers in designing incentives for innovation, discovery, and diversity.","title":"Collaborative Research: Innovation in Social Networks","awardID":"1019237","effectiveDate":"2010-05-15","expirationDate":"2012-09-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0401","name":"Division of SBE Off of Multidisciplinary A","abbr":"SMA"},"pgm":{"id":"7626","name":"SCIENCE OF SCIENCE POLICY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1320","name":"ECONOMICS"}}],"PIcoPI":["478157"],"PO":["565013"]},"163961":{"abstract":"This project is to develop a global scale IPv6 monitoring system that will track IPv6 address allocations, IPv6 routing announcements, the topological connectivity of IPv6-capable networks, and IPv6 reachability in the data plane, all at the global scale. Each of these metrics is useful in tracking IPv6 deployment, but the right combination of control plane metrics and data plane metrics has the potential to provide a comprehensive overview of IPv6 deployment successes and obstacles. Lessons learned in monitoring IPv4 infrastructure will be applied, but monitoring IPv6 deployment poses a number of unique challenges and unknowns. At this early stage of IPv6 deployment, it is particularly important to provide data plane information that can complement the control plane information. This project will develop an innovative technique that measures IPv6 coverage and reachability by using active probes to DNS servers. This approach leverages our existing DNS monitoring infrastructure and will allow us to test reachablity in both IPv6-IPv6 and IPv6-IPv4 scenarios. If successful, the results will provide detailed information for researchers and operators faced with specific measurement questions and also provide a global perspective that is meaningful to those searching for IPv6 deployment challenges. The results will not only provide the latest snapshot of IPv6 rollout but will also help identify open issues and potential obstacles to facilitate IPv6 deployment.","title":"IRNC: SP: 6Watch: Routeviews Infrastructure for Monitoring, Tracking and Diagnosing IPv6 Deployment","awardID":"0964969","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["543560","543493","559197"],"PO":["564246"]},"163752":{"abstract":"The current Internet architecture is built around layers of different functions, where the Network Layer provides a technology-independent abstraction on top of a large set of autonomous, heterogeneous networks. The Internet Protocol (IP) is one mechanism for achieving such an abstraction. By making the choice for a rudimentary \"best-effort\" service, the Internet has not been able to effectively respond to new requirements (security, manageability, wireless, mobility, and so forth.) The rigid structure of the current IP model has led to numerous ad hoc solutions that are either inefficient or incomplete.<br\/><br\/>This project is aimed at developing a clean-slate Recursive Internet Architecture(RINA) that is based on the fundamental principle that networking is inter-process communication (IPC). In this model, application processes(APes) communicate via a distributed IPC facility. The IPC processes that make up this facility provide a protocol that implements an IPC mechanism, and a protocol for managing distributed IPC (routing, security and other management tasks). RINA views each IPC facility as a \"private\" network, thus it offers intrinsic security features. And it is recursive in that the IPC processes can themselves be APes requesting services from lower IPC facilities. This project will design and develop the repeating structures of RINA, along with various policies seen useful in support of security, multihoming, mobility, and manageability. The developed IPC mechanisms build upon recursive naming and addressing of IPC processes, separation of mechanism and policy, and isolating data transfer, control and management. The developed prototype will be tested on small and larger-scale testbeds.","title":"CNS-NeTS:Medium: A Recursive Internet Architecture","awardID":"0963974","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":[438360],"PO":["564993"]},"163895":{"abstract":"The wide use of wireless data services leads to sensitive and confidential information delivered over wireless links. With e-crimes resulting from such information being compromised to unauthorized parties at an all time high, the ?all wireless? vision can truly materialize only if the security of wireless information transfer can be guaranteed. Conventional approaches to information security are designed for wired networks with assumptions that lead to a disassociation from the physical medium in which communication takes place, and provide guarantees against adversaries that are computationally limited. This project provides a new approach for wireless networks to deliver provable and unconditional security. <br\/><br\/>This research designs wireless networks with a secure foundation guaranteeing reliable and secure delivery of information. In doing so, the investigators account for untapped and rich resources provided by wireless systems naturally, including sources with correlated observations or application content, channels that provide spatial and temporal diversity, network nodes that are helpers or relays providing interaction, and broadcast and bi-directional nature of the medium enabling communication with feedback. The project calls for a network design paradigm that has security in its foundation and provides enlightened system design principles and protocols that are optimized to jointly exploit these resources. Some examples of this, which form the intellectual backbone of this project, include the optimal use of correlated sources and broadcast channels, the role of multinode interaction, the opportunistic use of potentially untrusted relay nodes, the creative use of feedback channels, in order to render intelligent and computationally unlimited (passive and active) adversaries ineffective. An extended goal is to integrate the resulting design principles for unconditional security with cryptographic approaches towards exploiting synergies between the two.","title":"CIF: Medium: Collaborative Research: Interactive Security","awardID":"0964645","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7938","name":"SENSOR NETWORKS"}}],"PIcoPI":["548269"],"PO":["564898"]},"167229":{"abstract":"This award provides travel support to students to attend the 2010 SIAM Data Mining (SDM 2010) Conference, and to enable them to participate in a Ph.D. student forum to be held as part of SDM 2010. This conference will be held in Columbus (OH), USA from April 29 to May 1st, 2010 (http:\/\/www.siam.org\/meetings\/sdm10\/).<br\/><br\/>Jointly organized by computer scientists and statisticians, SDM 2010 is a premiere conference for presenting new research results in the area of data mining, and is widely attended by researchers and practitioners in the field. Selection of award recipients will be based on the quality of their research as well as their potential to benefit from attending this meeting. Special emphasis will be given to minority students not traditionally well represented at SDM conferences.<br\/><br\/>Participation in premier research conferences such as SDM is an integral component of the training of Ph.D. students in data mining. The SDM 2010 Ph.D. Student Forum will provide an opportunity for Ph.D. candidates to present their work and receive constructive feedback and mentoring from established researchers in data mining. Such feedback and mentoring is expected to improve the quality of the students thesis research. Similarly, students recipient of a travel award will be able to attend technical sessions, plenary talks, panels, tutorials and workshops. They will interact with peers who share similar interests from other universities, as well as hundreds of leading researchers in data mining from around the world. This experience will be extremely formative and fruitful towards the shaping of their future research endeavors. <br\/><br\/>Data mining is playing an increasingly important role in many emerging data-rich sciences and application domains, such as bioinformatics, computational biology, link analysis, counter-terrorism, and security. The SDM 2010 Ph.D. student forum will enrich the education and training of student researchers at early stages in their careers. The attendance of SDM 2010 will expose students to cutting-edge research and to relevant applications in a variety of domains. Both the student forum and travel awards will also help broaden the representation of women and members of underrepresented minority groups within the Data Mining research community.","title":"Doctoral Student Forum and Student Travel at the 2010 SIAM Data Mining Conference; Columbus, Ohio","awardID":"1010857","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["521348"],"PO":["563751"]},"163764":{"abstract":"The wide use of wireless data services leads to sensitive and confidential information delivered over wireless links. With e-crimes resulting from such information being compromised to unauthorized parties at an all time high, the ?all wireless? vision can truly materialize only if the security of wireless information transfer can be guaranteed. Conventional approaches to information security are designed for wired networks with assumptions that lead to a disassociation from the physical medium in which communication takes place, and provide guarantees against adversaries that are computationally limited. This project provides a new approach for wireless networks to deliver provable and unconditional security. <br\/><br\/>This research designs wireless networks with a secure foundation guaranteeing reliable and secure delivery of information. In doing so, the investigators account for untapped and rich resources provided by wireless systems naturally, including sources with correlated observations or application content, channels that provide spatial and temporal diversity, network nodes that are helpers or relays providing interaction, and broadcast and bi-directional nature of the medium enabling communication with feedback. The project calls for a network design paradigm that has security in its foundation and provides enlightened system design principles and protocols that are optimized to jointly exploit these resources. Some examples of this, which form the intellectual backbone of this project, include the optimal use of correlated sources and broadcast channels, the role of multinode interaction, the opportunistic use of potentially untrusted relay nodes, the creative use of feedback channels, in order to render intelligent and computationally unlimited (passive and active) adversaries ineffective. An extended goal is to integrate the resulting design principles for unconditional security with cryptographic approaches towards exploiting synergies between the two.","title":"CIF: Medium: Collaborative Research: Interactive Security","awardID":"0964018","effectiveDate":"2010-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7938","name":"SENSOR NETWORKS"}}],"PIcoPI":["521731"],"PO":["564898"]},"165855":{"abstract":"The computing landscape is changing - parallel computing will be the \"default\" approach to programming in the future. A central challenge in the transition to parallelism is shortage of workforce with expertise in parallel programming. In this REU, we will train students in the basics of parallel programming, provide them with research experience that demonstrates the importance of parallel computing in their own fields, and help them develop the confidence that they need to be successful in graduate school.<br\/><br\/>To enable undergraduates to participate in the revolutionary new capabilities afforded by parallel computing, the REU-POP program (Research Experience for Undergraduates-Passionate on Parallel) at the University of Illinois will recruit ten (10) junior- and senior-level undergraduates majoring in science, technology, engineering, and mathematics (STEM) disciplines to participate in a summer research experience in parallel computing and programming relevant to their own fields of study. Recognizing that women are critically underrepresented in academic and professional computer science, qualified students will be especially sought at women's and minority-serving colleges with limited research or graduate-school options. Eligible students will have completed specified computer science courses, but will not be required to have experience in parallel programming, which is rarely available at the undergraduate level.<br\/><br\/>REU students will work in pairs (current literature suggests this is a successful learning strategy for women in programming) in small teams that will include a faculty member in their own discipline and a specially trained graduate mentor. Through preparatory online sessions before the POP summer, a four-day immersion session at the start of the POP summer, hands-on learning in their university laboratory, weekly technical sessions, and special seminars on topics such as parallel computing in current technology; research ethics; technology commercialization; and the benefits of graduate school, students will develop essential skills in parallel programming and explore the research options in their own STEM disciplines. Students will also interact with prominent professional and academic researchers to form a network of diverse role models and mentors to provide advice on careers and graduate school options.<br\/><br\/>We believe undergraduates can be encouraged to persist in engineering programs, particularly computer science, by engaging them in research, by employing multiple mentoring options, and by providing opportunities for them to work in \"programming pairs.\" The REU-POP program at Illinois will explore these methods within the REU context, and we will report on their success in the open literature to assist others in this effort.<br\/><br\/>This site is supported by the Department of Defense in partnership with the NSF REU program.","title":"REU Site: Passionate on Parallel-A Summer Research Program for Women in STEM","awardID":"1004311","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J103","name":"AIRFORCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"J243","name":"Air Force Office of Scientific"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"K629","name":"Air Force Office of Scientific"}}],"PIcoPI":["539055","492285"],"PO":["564588"]},"164535":{"abstract":"IIS - 0968647 <br\/>Automatic Indexing of Polyphonic Music by Cascade Classifiers<br\/>Ras, Zbigniew W. <br\/>University of North Carolina at Charlotte<br\/><br\/>Abstract<br\/><br\/>The goal of this EAGER project is to support exploratory work on a new class of cascade classifiers and hybrid classifiers for automatic indexing of polyphonic music according to instruments and types of instruments. Testing new classifiers for automatic indexing of polyphonic music, specifically those for the automatic classification of instrumental sound from recordings of orchestral music is difficult and involves a high degree of risk and uncertainty as to the outcome. If successful, the results may prove to be transformative and have significant impact on music information analysis. The work will employ resources in the MIRAI database developed in an earlier NSF supported project. The main MIRAI database contains about 1,000,000 musical instrument sounds, each represented as a vector of approximately 1,000 features. Each instrument sound is identified and matched to a corresponding instrument.","title":"EAGER: Automatic Indexing of Polyphonic Music by Cascade Classifiers","awardID":"0968647","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[440783],"PO":["565136"]},"167956":{"abstract":"Proposed is travel support for US graduate students to participate in the IEEE Intelligent Robots and Systems (IROS) conference. IROS will be held in Taipei, Taiwan, October 2010. A unique aspect of this proposal is lab visits. Approximately 30 students will visit academic, government and\/or industrial labs in Taiwan while in Taiwan for IROS. These students will be hosted by Taiwanese graduate students. The envisioned outcome is that the 30 students will reciprocate; they would host the Taiwanese students when future conferences are held in the US.","title":"Grassroots 2010 - Travel Support for the Intelligent Robots and Systems Conference in Taiwan","awardID":"1014762","effectiveDate":"2010-05-15","expirationDate":"2014-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[449805],"PO":["564069"]},"171971":{"abstract":"This award will help to subsidize the participation of graduate students in the fourth Northeast Student Colloquium on Artificial Intelligence (NESCAI) to be held April 16-18, 2010 at the University of Massachusetts in Amherst. This conference is to include oral and poster presentations by students,invited talks by senior AI researchers, and student-run tutorials. The conference will be largely run by a program committee consisting of doctoral students under the guidance of senior faculty. The program committee will conduct a review process to select the projects chosen for oral and poster presentations. In addition to graduate students, the conference plans to encourage attendance by outstanding senior undergraduates through a special undergraduate track, in the hope that it will increase undergraduate enthusiasm for research and thus the likelihood that they will go on to graduate work. The project integrates research and education and commits to broadening diversity.","title":"The Fourth Northeast Student Colloquium on Artificial Intelligence","awardID":"1036017","effectiveDate":"2010-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[460641,460642],"PO":[460643]},"171355":{"abstract":"Existing Biologically Inspired Algorithm (BIA) approaches to Self-Organized (SO) networks lack a theoretical foundation and analysis. This work develops a framework to describe the types of problems that BIA can address in network control. First, this work establishes a theory of BIA network control. Here the PIs: a) broadly review the literature for BIAs that have been applied to solving control theory problems and develop a categorization of the methods; b) categorize the common problems in network control and the complexity of these problems; c) analytically demonstrate the potential of these BIAs in solving various network control problems; and d) formally describe BIA for control of wireless networks. Second, this work analyzes mutual interaction among layers in a BIA-based network. The PIs carry out an analysis of mutual interaction among layers in BIA-based networks. This includes a) analysis of interaction among layered SO-based control and b) establishment of a fundamental theory of layered architecture. Third, this work analyzes BIA-based control in wireless networks. Here the PIs conduct analyses of BIA-based control on wireless networks, to a) determine implementation issues of BIA-based control on real systems and b) perform a practical evaluation and analysis of BIA-based control through simulation and testbed implementation. This work is significant in that it provides a framing of BIA and provides a means for others to assess new approaches beyond wireless applications. The results of this work will be made available in conference and journal publications and through web sources.","title":"EAGER: Self-Organization Based Control for New Generation Networks","awardID":"1032207","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["543626"],"PO":["564993"]},"163853":{"abstract":"This proposal addresses the problem of synthesizing speaker identity when only a small training sample is available. To achieve the goal of synthesis of speaker identity from a small training corpus the project will address problems including trainable abstract parameterizations of the prosodic patterns that characterize a speaker and voice conversion methods. The project falls into the general category of building Text-to-Speech (TTS) synthesis system in order to generate speech that sounds like that of a specific individual (Speaker Identity Synthesis, or SIS). Systems of this kind have numerous applications, including the creation of personalized voices for individuals with neurodegenerative disorders who anticipate becoming users of Speech Generating Devices (Sods) in the future and many other applications in the consumer products and entertainment industry. Consumer products such as navigation systems and mobile phones are rapidly being developed that make use of linguistic information about generated utterance. The project will also provide new tools and data for human perception of speaker identity. The tools developed in the process and the associated perceptual studies are also relevant for assessment of speaker recognition systems, and the project provides a new generation of concise, trainable characterizations of a speaker?s prosodic patterns that can be incorporated in these systems. The proposed study will elucidate the trade-offs and algorithm issues of the proposed SIS systems and it is likely that the proposed work will have a strong intellectual impact in the field of speech synthesis.","title":"HCC: Medium: Synthesis and Perception of Speaker Identity","awardID":"0964468","effectiveDate":"2010-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[438630,438631,"483791"],"PO":["564456"]},"162885":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59441<br\/>PI(s): Wills, Craig <br\/> Claypool, Mark L.; Doyle, James K.; Ward, Mathew O.<br\/>Institution: Worcester Polytechnic Institute <br\/>Title: MRI\/Acq.: Dev. of a User-Centered Network Measurement Platform<br\/>Project Proposed:<br\/>This project, developing a network measurement approach centered on where users live and on their specific interactions with the Internet, supports a wide range of research projects. The instrumentation provides a means to test applicable techniques from research projects on a large scale through vetted experiments and will be accessible to all users via two integrated measurement approaches that<br\/>- Execute within the protected sandbox of a user Web browser to provide low impediments encouraging broad user participation while still yielding useful Internet data.<br\/>- Perform more extensive application-oriented performance tests from a user's machine and is not constrained by the sandbox.<br\/>The former makes use of entertainment applications in the form of games and videos to help engage users and increase participation. The application-oriented nature of the latter tests yields performance data that can be uploaded for sharing among network researchers while providing feedback to users on network applications of interest. This feedback serves as an incentive for user participation. Thus, the platform provides information about the network applications that interest home users and conditions in which these applications operate. Researchers can use the platform tests from their own measurement points (MPs) and then calibrate the characteristics of their MPs with others. The entertainment orientation of the sandboxed platform serves provides an environment to decide how best to employ the use of videos and games for measurement. The open research area offers a training opportunity for students.<br\/>Broader Impacts: <br\/>This project promotes teaching and training through integration with systems courses and the Interactive Media and Games Development (IMGD) program. The work also aims to broaden participation in science and engineering by underrepresented groups through IMGD. Moreover, the available data sets are likely to provide a foundation for scientific discovery.","title":"MRI-R2: Development of a User-Centered Network Measurement Platform","awardID":"0959441","effectiveDate":"2010-05-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["543519",435447,"476209",435449],"PO":["557609"]},"165988":{"abstract":"This project proposes to establish a three-year REU site program in information assurance and security (IAS) at Dakota State University (DSU). The objective of this program is to provide a diverse pool of motivated undergraduate students with a competitive research experience in IAS. Specifically, the proposed REU site will offer an nine-week summer program for nine undergraduate students each year to develop confidence as researchers and scientists. To assure the diversity of participants, the site will select up to 40% of the students from DSU (a primarily undergraduate institution) and at least 60% from other academic institutions in the Upper Midwest and across the nation. The recruiting effort will focus on students from underrepresented groups and academic institutions with limited research opportunities or without IAS programs. During the nine-week program, each student will work with a faculty mentor at DSU on a carefully designed research project. In the first few weeks, students will focus on developing projects. A series of tutorials and workshops will be provided to help students establish necessary background knowledge and learn about how to conduct scientific research in IAS. Students will also work with their individual advisors, read literature, and design their projects. For the remaining weeks, students will carry out their projects under the supervision of their mentors. They will also attend the weekly seminars by faculty and invited industry speakers and report their weekly progress. In the last week, students will prepare a written report and an oral presentation. <br\/><br\/>Intellectual Merit: IAS is a field of national priority. Recent security incidents indicate that many organizations such as banks have not adequately responded to the IAS issues. The project provides undergraduate students with a competitive research experience in this important field. They will tackle a variety of significant IAS problems, ranging from secure design and verification, security testing, to forensics of security incidents. This will have an important impact on the defense in-depth of information systems such as online banking applications. A unique feature of this project is the integration of the fundamental IAS problems into an important application domain (i.e., banking and finance).<br\/><br\/>Broader Impacts: This project will allow a diverse pool of motivated students from underrepresented groups and universities with limited research opportunities to gain research experiences in IAS. It builds upon an existing partnership with a consortium of schools in the Upper Midwest. It will strengthen the partnership by providing their students with a competitive research experience which would otherwise be unavailable. The recruitment process will capitalize on minority institutions that have established connections with DSU, specifically the Oglala-Lakota College in South Dakota and Florida International University. The REU program provides valuable skills that will help participants integrate their research experiences with their ongoing classroom instruction. The process of learning how to do research, write up and present their research results will better prepare them for their future field of study and motivate them to pursue graduate studies.","title":"REU Site: Information Assurance and Security","awardID":"1004843","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["564245","531638","489025"],"PO":["564181"]},"163458":{"abstract":"The International Research Instrumentation System (IRIS) is a proposal to provide a software framework to simplify the task of end-to-end network performance monitoring and diagnostics and thereby improve support for international science and engineering collaborations. IRIS will deliver a comprehensive monitoring package that will benefit each IRNC awardee as well as the entire project as a whole by delivering instant access to information that will reveal the status and health of any participating network.<br\/><br\/>IRIS facilitates a broader deployment of perfSONAR enabled resources significantly increasing the likelihood diagnostic resources will be available along the end-to-end paths needed by researchers relying on high-performance international network connections. As a result, NSF-funded science efforts, such as those within Very Long Baseline Interferometry (eVLBI), the Global Environment for Network Innovations (GENI), and the Laser Interferometer Gravitational Wave Observatory (LIGO), are more likely to be able to exploit available network resources by improving their network performance.<br\/><br\/>This proposal will have significant impact on the broad international science and engineering network user community by providing key measurement tools with global applicability. IRIS will advance the state of network measurement and monitoring by working with IRNC projects to research and implement solutions to challenging network measurement problems. This to have a broad impact among multiple scientific disciplines involving global collaboration and exchange of large data sets.","title":"IRNC: SP: International Research Instrumentation System (IRIS)","awardID":"0962704","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["510794","437217"],"PO":["564246"]},"170850":{"abstract":"There is increasing demand among researchers and production system architects to combine (federate) compute, storage, and network resources from multiple sources (e.g., the organization?s own resources, their partners? resources, commercial and academic clouds, programmable network substrates). Various proprietary and experimental systems have taken the first steps to demonstrate the potential effectiveness of such federations, but substantial concerns remain about security, interoperability and management. In many ways, the situation resembles what emerging networks faced at the dawn of the Internet. Consolidation seems certain, but there is a lack the right architectural framework, where new models must contend with a quickly growing base of incompatible production systems. Against this backdrop, this workshop focuses on issues related to federating resources from multiple autonomous organizations into a seamless\/ubiquitous resource pool, thereby giving users standard interfaces for accessing the widely distributed and diverse collection of resources they need. This workshop brings together leading network researchers and network research infrastructure developers to discuss specifics of federate (combine) compute, storage, and network resources from multiple sources. The concept for the workshop follows from multiple discussions in the GENI and FIRE initiatives to build federated network test-beds. The workshop expects to develop a common understanding of what it means for autonomous organizations to federate their resources into a seamless\/ubiquitous resource pool.","title":"Workshop on Federating Computational Resources","awardID":"1029325","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["560046"],"PO":["565090"]},"163832":{"abstract":"The wide use of wireless data services leads to sensitive and confidential information delivered over wireless links. With e-crimes resulting from such information being compromised to unauthorized parties at an all time high, the ?all wireless? vision can truly materialize only if the security of wireless information transfer can be guaranteed. Conventional approaches to information security are designed for wired networks with assumptions that lead to a disassociation from the physical medium in which communication takes place, and provide guarantees against adversaries that are computationally limited. This project provides a new approach for wireless networks to deliver provable and unconditional security. <br\/><br\/>This research designs wireless networks with a secure foundation guaranteeing reliable and secure delivery of information. In doing so, the investigators account for untapped and rich resources provided by wireless systems naturally, including sources with correlated observations or application content, channels that provide spatial and temporal diversity, network nodes that are helpers or relays providing interaction, and broadcast and bi-directional nature of the medium enabling communication with feedback. The project calls for a network design paradigm that has security in its foundation and provides enlightened system design principles and protocols that are optimized to jointly exploit these resources. Some examples of this, which form the intellectual backbone of this project, include the optimal use of correlated sources and broadcast channels, the role of multinode interaction, the opportunistic use of potentially untrusted relay nodes, the creative use of feedback channels, in order to render intelligent and computationally unlimited (passive and active) adversaries ineffective. An extended goal is to integrate the resulting design principles for unconditional security with cryptographic approaches towards exploiting synergies between the two.","title":"CIF: Medium: Collaborative Research: Interactive Security","awardID":"0964362","effectiveDate":"2010-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7938","name":"SENSOR NETWORKS"}}],"PIcoPI":["550356"],"PO":["564898"]},"163843":{"abstract":"As mobile embedded systems become more prevalent, there is an increasing demand to make processor pipelines more power efficient. Conventional pipeline inefficiencies include unnecessary accesses to the register file due to duplication or avoidable computation from constantly checking for forwarding and hazards at points where they cannot possibly occur, repeated calculation of invariant values, etc. It is desirable to develop an alternative processor design that can avoid these wasteful energy consumption aspects of a traditionally pipelined processor while still achieving comparable performance.<br\/><br\/>A statically pipelined processor is expected to achieve these goals by having the control during each cycle for each portion of the processor explicitly represented in each instruction. The pipelining is in effect statically determined by the compiler, which has several potential benefits, such as reducing energy consumption without degrading performance, supporting a less complex design with a lower production cost, and being able to apply more effective compiler optimizations due to instructions having more explicit control of the processor.<br\/><br\/>If successful, the broader impact of this research is manifold. The use of ultra-low power embedded devices, such as bio-implantable microelectronic devices, can significantly affect everyday activities. A new generation of ultra-low power processors will enable these devices to be more feasible to develop and deploy. Educational efforts to introduce the latest architecture and compiler enhancements in the classroom complement our research. Steps will also be taken to increase female and minority enrollment at both institutions in their Computer Science and Computer Engineering programs.","title":"CSR: Medium: Collaborative Research: Static Pipelining, an Approach for Ultra-Low Power Embedded Processors","awardID":"0964413","effectiveDate":"2010-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["537231","537232"],"PO":["565255"]},"163789":{"abstract":"The conventional architecture for short-range, low-power, wireless hardware integrates a radio transceiver and a general-purpose microcontroller. However, microcontrollers have limited computational power and hence, restrict the kinds of algorithms that can be implemented. Moreover, closed radio architectures prevent the direct access to the physical layer needed for many novel applications. The emergence of low-power FPGAs with their efficient duty cycling support presents an opportunity to create a novel wireless platform to overcome these limitations. The project develops a highly flexible hardware\/software architecture for mobile wireless networking based on low-power FPGA devices. High performance DSP and other algorithms can be implemented directly in hardware, while the rest of the code runs on a soft processor core inside the FPGA. This flexible hardware\/software boundary increases the complexity of software development that is eased via sophisticated development tool support and an extensive software component library that the project is also developing. The small inexpensive platform offers two orders of magnitude higher performance than current microcontroller-based hardware at equivalent power for many applications. Hence, it will stimulate research in novel protocols and enable new applications not possible today. A competition for undergraduate students will be organized in which winners will receive the hardware, software, training, and mentorship needed to carry out their ideas during a paid summer internship at Vanderbilt.","title":"NeTS: Medium: Collaborative Research: Experimental Platform for Low-Power Wireless Networking Research","awardID":"0964120","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["562959"],"PO":["565303"]},"165879":{"abstract":"CNS - 1004409 <br\/>REU Site: Digital Forensics Research In Rhode Island<br\/>Wolfe, Victor <br\/>University of Rhode Island<br\/><br\/>This is a renewal proposal with the main topic of digital forensics ? the relatively new science of examining evidence in digital form, such as that which exists on storage media and is communicated in network activity. The project continues to be a cooperative project among researchers and faculty in the Computer Science Department The University of Rhode Island. It aims to bring six to ten undergraduate students to computer forensics research during a 10-weeks REU site. The goals of the project include higher computer science retention rates, greater numbers of students who are women and from minority groups who will continue in computer science and related majors. It also aims to increase recruitment of graduate programs, and to develop skills which will prepare students in a variety of occupations.","title":"REU Site: Digital Forensics Research In Rhode Island","awardID":"1004409","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":[444421],"PO":["563751"]},"163459":{"abstract":"The Dynamic Gateways for International Research (DyGIR) project will provide well-tested, production-ready solution for scheduling dynamic circuits on IRNC ProNet infrastructure. DyGIR will help IRNC ProNet projects meet the requirements of the IRNC solicitation to provide production hybrid network services including dynamic circuit services and to do so in a way that is interoperable with emerging production dynamic switching network services in the US (e.g. ESnet, Internet2) and in other countries (e.g. GÉANT3, JGN2).<br\/><br\/>DyGIR will advance the state of the art of dynamic circuit networking in support of international science and engineering by developing new functionality, particularly for international exchange points - critical pieces of the overall global R&E network infrastructure.<br\/><br\/>The broader impact of the DyGIR project for the international science and engineering research community will be significant. DyGIR will increase the opportunity for scientific collaboration between distributed research efforts by enabling the predictable network performance required to effectively share large data sets. DyGIR will also enable these collaborators to schedule their use of the network, permitting the sharing of costly network resources between institutions and scientific disciplines.","title":"IRNC: SP: Dynamic Gateway for International Research (DyGIR)","awardID":"0962705","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["510794",437217],"PO":["564246"]},"168926":{"abstract":"The recent growth in large-scale networks and online communication has generated new ways in which networks can diffuse information. But a number of research questions remain unanswered, such as how networks affect innovation and how network structure shapes competition among ideas or technologies.<br\/><br\/>The goal of the research is to examine how research communities and links between them affect innovation. It develops a theory of how connections and absences of connections among individuals influence the process of innovation, with particular attention paid to the role of \"boundary agents\" who straddle different communities.<br\/><br\/>Intellectual Merit. The project is poised at the frontier of computer science and economics. Computer scientists have long studied how information is created and processed. Economists have long studied incentives for innovation. This project introduces a new paradigm. It studies innovation in networks of people and firms, where information flows through network links. Developing this paradigm requires a deep understanding of the graph-theoretic properties of the network and the incentives of the participants. The combined tools of the principal investigators represent a significant methodological advance not only for computer science and economics, but the sciences more generally.<br\/><br\/>Broader Impact. The project increases participation of women and under-represented groups in science. A graduate course trains students in state-of-the-art tools in network science from all relevant fields including economics, social sciences, mathematics, and computer science, while undergraduate courses incorporate social network examples. In addition, the research advances understanding about the participation of underrepresented groups in social and economic networks. Finally, the scientific aims of the project develop knowledge that can inform policy makers in designing incentives for innovation, discovery, and diversity.","title":"Collaborative Research: Innovation in Social Networks","awardID":"1019169","effectiveDate":"2010-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0401","name":"Division of SBE Off of Multidisciplinary A","abbr":"SMA"},"pgm":{"id":"7626","name":"SCIENCE OF SCIENCE POLICY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1320","name":"ECONOMICS"}}],"PIcoPI":["516987"],"PO":["565013"]},"158916":{"abstract":"This research focuses on developing scalable parallel file access methods for multi-scale problem domain decompositions, such as the one presented in Adaptive Mesh Refinement (AMR) based algorithms. Existing parallel I\/O methods concentrate on optimizing the process collaboration under a fairly evenly-distributed request pattern. However, they are not suitable for data structures in AMR, because the underlying data distribution is highly irregular and dynamic. Process synchronization in the existing parallel I\/O methods can penalize the I\/O parallelism if the process collaboration is not carefully coordinated. <br\/>This research addresses such synchronization issue by developing scalable solutions in the Parallel netCDF library (PnetCDF), particularly to address AMR structured data and its I\/O patterns. PnetCDF is a popular I\/O library used by many computer simulation communities. A scalable solution for storing and accessing AMR data in parallel is considered a challenging task. This research will design a process-group based parallel I\/O approach to eliminate unrelated processes and thus avoid possible I\/O serialization. In addition, a new metadata representation will also be developed in pnetCDF for conserving tree-structured AMR data relationship in a portable form.","title":"Collaborative Research: An Application Driven I\/O Optimization Approach for PetaScale Systems and Scientific Discoveries","awardID":"0938000","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7952","name":"HECURA"}}],"PIcoPI":["560392","560393"],"PO":["565272"]},"171995":{"abstract":"Diagrams are very wide-ranging and open-ended representations that include sketches, drawings, graphs, pictures, 2D and 3D geometric models, visualizations and animations. Diagrammatic representations significantly impact many aspects of human life and society ranging from art to science, from communication to education. The emerging science of visual analytics, which focuses on interactive use of diagrammatic representations for supporting human problem solving, is just one topical example of the need for studying diagrammatic representations and reasoning. In fact, there is a need for transformative advances in (1) understanding diagrammatic reasoning in humans, (2)understanding the use of diagrammatic representation for communication and collaboration among humans, (3) developing techniques for automated diagrammatic reasoning, and (4) designing interactive environments for use of diagrammatic representations for supporting human reasoning.<br\/><br\/>This project provides support for the Doctoral Student Symposium at the Sixth International Conference on the Theory and Application of Diagrams in Portland Oregon on August 11-14, 2010. The goal of the 1-day Doctoral Symposium is to provide senior doctoral students as well as recent Master's and Doctoral graduates engaged in research with an opportunity to present their work and get feedback from established researchers in the field. A group of experts will be present to comment on the young researchers? presentations in an informal and constructive environment.","title":"HCC: Doctoral Symposium at the Sixth International Conference on the Theory and Application of Diagrams","awardID":"1036113","effectiveDate":"2010-05-01","expirationDate":"2011-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["539354"],"PO":["565227"]},"162612":{"abstract":"Ongoing breakthroughs in nationally important research areas like Verification and Artificial Intelligence depend on continuing advances in high-performance automated theorem proving tools. The typical use of these tools is as backends: application problems are translated by an application tool into (typically very large and complex) logic formulas, which are then handed off to a logic solver. Different tradeoffs between linguistic expressiveness and the difficulty of solving the resulting problems give rise to different logics. Solver communities, formed around these different logics, have developed their own community research infrastructures to encourage innovation and ease adoption of their solver technology. Such infrastructure includes standard formats for logic formulas, libraries of benchmark formulas, and regular solver competitions to spur solver advances.<br\/><br\/>Currently, these different infrastructures are all developed separately, at significant cost in equipment and support. These costs are paid again and again for the different services, since there is currently no global piece of computing infrastructure suitable for the logic solving domain, which all these communities can use. This project is building a simplified proof-of-concept of a single piece of shared computing infrastructure, which could eventually be used by many different logic solver communities. The award also provides other support for soliciting research community feedback on the prototype and the design of a comprehensive infrastructure.","title":"Collaborative Research: CI-ADDO-NEW: *-EXEC: A Cross-Community Solver Execution Service","awardID":"0958160","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["521573","532995"],"PO":["562760"]},"163767":{"abstract":"This project is focused on research issues associated with producing extremely detailed and accurate 3D geometry and appearance (BRDF) models at city scale from internet collections of photos from various sources containing millions of photos of enormous diversity such as viewing range and conditions, time of day and weather conditions, to name a few. The properties of urban scenes may include low-texture surfaces, reflective and transparent materials, and repeated structures that challenge existing reconstruction algorithms. The investigators will address these challenges with the aim of reconstructing several large US and foreign cities. Historical photos and virtual models may also be incorporated. There are a number of research topics associated with the project. To register photographs and recover sparse geometry at city-scale, a new, unified, structure-from-motion (SfM) algorithm will be designed to take advantage of large, parallel computing platforms. With registered photographs and sparse 3D scene points recovered by SfM, multi-view stereo (MVS) algorithms can reconstruct detailed geometric models. Novel MVS algorithms will then exploit the structure of architectural scenes and volumetric reconstruction methods will be employed to produce annotated models of exceptional accuracy and usability. Digital models are playing an increasingly important role in social, cultural and economic endeavor and are central to next-generation mapping and visualization applications. All models and datasets will be made freely available to researchers and the general public.","title":"RI: Medium: Collaborative Research: Reconstructing Cities from Photographs","awardID":"0964027","effectiveDate":"2010-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["502048"],"PO":["565227"]},"163778":{"abstract":"As mobile embedded systems become more prevalent, there is an increasing demand to make processor pipelines more power efficient. Conventional pipeline inefficiencies include unnecessary accesses to the register file due to duplication or avoidable computation from constantly checking for forwarding and hazards at points where they cannot possibly occur, repeated calculation of invariant values, etc. It is desirable to develop an alternative processor design that can avoid these wasteful energy consumption aspects of a traditionally pipelined processor while still achieving comparable performance.<br\/><br\/>A statically pipelined processor is expected to achieve these goals by having the control during each cycle for each portion of the processor explicitly represented in each instruction. The pipelining is in effect statically determined by the compiler, which has several potential benefits, such as reducing energy consumption without degrading performance, supporting a less complex design with a lower production cost, and being able to apply more effective compiler optimizations due to instructions having more explicit control of the processor.<br\/><br\/>If successful, the broader impact of this research is manifold. The use of ultra-low power embedded devices, such as bio-implantable microelectronic devices, can significantly affect everyday activities. A new generation of ultra-low power processors will enable these devices to be more feasible to develop and deploy. Educational efforts to introduce the latest architecture and compiler enhancements in the classroom complement our research. Steps will also be taken to increase female and minority enrollment at both institutions in their Computer Science and Computer Engineering programs.","title":"CSR: Medium: Collaborative Research: Static Pipelining, an Approach for Ultra-Low Power Embedded Processors","awardID":"0964079","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[438426,438427],"PO":["565255"]},"163899":{"abstract":"Many advanced combinatorial problems have algebraic aspects. Even though the problem formulation can be entirely discrete, significant insight and efficient algorithms might be obtained by applying sophisticated algebraic methods. It is not uncommon that combinatorial problems have simple and elegant formulations, yet they are computationally hard, meaning that the obvious algorithms are useless for their solutions except for very small instances. It can also happen that even though traditional algorithmic approaches are successful, algebraic methods are still more efficient and provide additional insights into a combinatorial problem.<br\/><br\/>The graph isomorphism problem exemplifies a combinatorial problem where algebraic methods seem to be required for efficient solutions. Interesting for algebraic and combinatorial approaches is also the monomer dimer problem, the counting of matchings in grid graphs, which is of much importance in statistical physics. This proposal studies algorithms based on the scaling method. A particular goal is doing matrix scaling efficiently in parallel, as a tool for approximating the permanent. <br\/><br\/>This project will look at the computation of all coefficients of graph polynomials for trees and graphs of bounded tree-width. The goal is to compute all coefficients together almost as fast as a single coefficient.<br\/><br\/>The other main focus of this project is the exploration of variations of the recent faster integer multiplication algorithm and the study of its application to polynomial multiplications and Fourier transforms. One goal is to develop a new algorithm, based on a more discrete method, improving the asymptotic complexity as well as leading to a more practical algorithm for computing products of very long integers.<br\/><br\/>Integer multiplication is such a fundamental arithmetic task that understanding and improving it is an obvious basic intellectual challenge. Such theoretical goals are foremost in this project. But there could be an impact on the search for Mersenne primes as well as on general purpose computations with high degree polynomials. Other aspects of this research involve topics with applications in Physics and Chemistry.","title":"AF: Medium: Algorithms Based on Algebraic and Combinatorial Methods","awardID":"0964655","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}}],"PIcoPI":["551015"],"PO":["565251"]},"162910":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59583<br\/>PI(s): Celebi, M Emre, Cvek, Urska, Trutschl, Marjan, Williams-Hart, Itara T.<br\/>Institution: Louisiana State University<br\/> Shreveport, LA 71115-2301<br\/>Title: MRI-R2\/Acq: High Performance Computational Infrastructure for Image Analysis, Visualization, and Game Development<br\/>Project Proposed:<br\/>This project, acquiring high-performance and storage infrastructure, services research projects requiring the use of high performance resources for image analysis, visualization, game development, and other advanced applications. The specific instrumentation is a blade server system with a storage area network (SAN) subsystem for use by faculty and students mainly in Computer Sciences, Biological Sciences, and Physics\/Astronomy. Key characteristics follow.<br\/>- Provides high performance computing and storage infrastructure to support large image databases, visualization research, and access to vast amount of experimental data from outside the institution;<br\/>- Promotes multidisciplinary use of common equipment and infrastructure;<br\/>- Enhances current research efforts and creates new synergy among the various groups involved. <br\/>These key characteristics should lead to scholarly publications and additional research ideas. Hence, new research ideas and initiatives are expected to emerge that will lead to additional high quality interdisciplinary research activities with potential to enhance socioeconomic progress in the state and beyond. <br\/>Broader Impacts: <br\/>The instrument greatly enhances this primarily undergraduate, non-doctoral institution that serves under represented students in an EPSCoR state. The institution has a long history of involving undergraduates in research. Thus, the acquisition and utilization of the system supports an improved learning environment that integrates research and education fostering collaborations within the university, and across institutions. It directly benefits approximately 150 undergraduate students, and at least 15 graduate students per year. Moreover, the supported research and education should contribute to the development of a skilled workforce. The acquisition and utilization of the new blade server system expands opportunities for a diverse community of faculty and students in an underserved area of U.S.","title":"Acquisition of High Performance Computational Infrastructure for Image Analysis, Visualization, and Game Development","awardID":"0959583","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[435560,435561,"462473","486290",435564],"PO":["557609"]},"170896":{"abstract":"Current network-centric Internet service model is prone to<br\/>resource exhausting attacks such as Distributed Denial of<br\/>Services attacks. Due to the resource sharing nature and<br\/>non-coordinated monitoring capability of the current Internet,<br\/>it is difficult to quickly identify attack sources. Second, a<br\/>new trend is to develop a user-centric Internet service model,<br\/>in which traditional local network services are outsourced to<br\/>remote service providers such as for cloud services. This new<br\/>trend allows end users to fully control remote service nodes,<br\/>their interconnections and routing, which imposes great threats<br\/>on network resource allocations. Thus, it is highly desired<br\/>that the future Internet is designed to provide a secure<br\/>service domain that is both network-centric and user-centric.<br\/>As a fundamental core to this goal, a secure and resilient<br\/>virtualized routing architecture in a global inter-networking<br\/>environment is explored to provide network resource reservation<br\/>protection both at the network-centric and the user-centric<br\/>level. A novel attribute-based, cryptography-based approach to<br\/>construct secure virtualization is to be developed.<br\/>Furthermore, an architectural solution to address the policy<br\/>enforcement and inter-domain trust management is also<br\/>considered. The end goal is to greatly improve the efficiency<br\/>of attack monitoring and intrusion detection and to increase<br\/>the resiliency of the future Internet. This is a collaborative<br\/>exploratory project bringing together researchers from the<br\/>University of Missouri-Kansas City, Arizona State University,<br\/>and Osaka City University, Japan. All research results will be<br\/>made available to the scientific community.","title":"EAGER: Collaborative Research: A Secure and Resilient Virtual Trust Routing Framework for Future Internet","awardID":"1029546","effectiveDate":"2010-05-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["527024"],"PO":["564993"]},"163702":{"abstract":"This project is focused on research issues associated with producing extremely detailed and accurate 3D geometry and appearance (BRDF) models at city scale from internet collections of photos from various sources containing millions of photos of enormous diversity such as viewing range and conditions, time of day and weather conditions, to name a few. The properties of urban scenes may include low-texture surfaces, reflective and transparent materials, and repeated structures that challenge existing reconstruction algorithms. The investigators will address these challenges with the aim of reconstructing several large US and foreign cities. Historical photos and virtual models may also be incorporated. There are a number of research topics associated with the project. To register photographs and recover sparse geometry at city-scale, a new, unified, structure-from-motion (SfM) algorithm will be designed to take advantage of large, parallel computing platforms. With registered photographs and sparse 3D scene points recovered by SfM, multi-view stereo (MVS) algorithms can reconstruct detailed geometric models. Novel MVS algorithms will then exploit the structure of architectural scenes and volumetric reconstruction methods will be employed to produce annotated models of exceptional accuracy and usability. Digital models are playing an increasingly important role in social, cultural and economic endeavor and are central to next-generation mapping and visualization applications. All models and datasets will be made freely available to researchers and the general public.","title":"RI: Medium: Collaborative Research: Reconstructing Cities from Photographs","awardID":"0963743","effectiveDate":"2010-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7453","name":"GRAPHICS & VISUALIZATION"}}],"PIcoPI":["451788"],"PO":["565227"]},"163889":{"abstract":"The microprocessor industry has moved toward multicore designs to leverage increasing transistor counts in the face of physical and micro-architectural limitations. Unfortunately, providing multiple cores does not translate into performance for most applications. Rather than pushing all the burden onto programmers, this project advocates the use of the implicitly parallel programming model to eliminate the laborious and error-prone process of explicit parallel programming. Implicit parallel programming leverages sequential languages to facilitate shorter development and debug cycles, and relies on automatic tools, both static compilers and run-time systems, to identify parallelism and customize it to the target platform. Implicit parallelism can be systematically extracted using: (1) decoupled softwarepipelining, a technique to extract the pipeline parallelism found in many sequential applications; (2) low-frequency and high-confidence speculation to overcome limitations of memory dependence analysis; (3) whole-program scope for parallelization to eliminate analysis boundaries; (4) simple extensions to the sequential programming model that give the programmer the power to refine the meaning of a program; (5) dynamic adaptation to ensure efficiency is maintained across changing environments. This project is developing the set of technologies to realize an implicitly parallel programming system with scalable, lifelong thread extraction and dynamic adaptation. At the broader level, the implicitly parallel programming approach will free programmers to consider the problems they are trying to solve, rather than forcing them to overcome the processor industry's failure to continue to scale performance. This approach will keep computers accessible, helping computing to have the same increasingly positive impact on other fields.","title":"CSR: Medium: Collaborative Research: Scaling the Implicitly Parallel Programming Model with Lifelong Thread Extraction and Dynamic Adaptation","awardID":"0964627","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[438733,438734],"PO":["565255"]},"162801":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59053<br\/>PI(s): Johnson, Andrew E.; Brown, Maxine, Leigh, Jason, Peterka, Tom<br\/>Institution: University of Illinois - Chicago <br\/>Title: MRI\/Dev.: Dev. of the Next Generation CAVE Virtual Environment (NG-CAVE)<br\/>Project Proposed:<br\/>This project, developing the Next Generation CAVE (NG-CAVE), supports 15 research projects from local institutions. These projects in multiple domains (Astronomy, Astrophysics, Art, Bioengineering, Earth Science, High Performance Computing, Homeland Security, Neuroscience, Rehabilitation, etc.) are poised to use NG-CAVE for their large visualization needs. Just as cyberinfrastructure provides better access to greater volumes and varieties of data, from data storage systems, online instrumentation, and\/or major computational resources like the TeraGrid and future Petascale facility, advanced visualization instruments serve as the eyepieces of a telescope or microscope, enabling researchers to view their data in cyberspaces and to better manage the increased scale and complexity of accessing and analyzing the data. NG-CAVE is such an eyepiece, providing researchers with powerful and easy to use information-rich instrumentation in support of cyberinfrastructure-enabled scientific discovery. It provides users with the ability to see 3D content at nearly 106 Megapixels.<br\/>For the Electronic Visualization Laboratory (EVL) at the institution, NG-CAVE represents the culmination of decades of experience and expertise developing immersive environments, from the room-sized CAVE virtual environment in 1992, to the office-sized ImmersaDesk in 1994, to the GeoWall in 2000, and the more recent ultra-high-resolution LamdaVision tiled-display wall and autostereoscopic Varrier-tiled-display wall. Each new generation of visualization instrumentation has provided scientific communities with one or more advanced features (higher resolution, unencumbered stereoscopic viewing, multi-Gigabit connectivity, and intuitive user interfaces), better coupling worldwide scientific virtual organizations, and better integrating scientific workplaces with globally distributed cyberinfrastructure.<br\/>NG-CAVE provides an alternative approach to constructing CAVEs by using new near-seamless flat LCD technology augmented with micropolarization, rather than traditional projection technologies. The net effect is a new CAVE that has 3D acuity to match human vision, can be scaled near-seamless to even greater resolution, is affordable compared to projection-based approaches, requires little maintenance, can be used for both 2D and 3D stereoscopic viewing, and can support multiple simultaneous viewers. The instrument also opens new opportunities in computer science research at the intersection of large-scale data visualization, human computer interaction, virtual reality, and high-speed networking,<br\/>Broader Impacts: <br\/>This project provides state-of-the-art equipment, opportunities, and supervision to enhance undergraduate and graduate research and education. The new NG-CAVE supports 10 classes in Computer Science, Art and Design, and Biomedical Science departments. It provides scientific communities with highly integrated virtual-reality collaboration environments; it enables working with industry to commercialize new technologies for the advancement of science and engineering and to continue ongoing partnerships with many of the world's best domain scientists and computer scientists in academia and industry, who readily become early adopters of new instrumentation and who provide students with summer internships and jobs upon graduation. Thus, this instrument enables US to maintain its leadership position in high performance computing and contributes in the advancement of complex global issues (e.g., environment, health, homeland security, economy, etc.), which, in turn, benefit society as a whole.","title":"MRI-R2: Development of the Next-Generation CAVE Virtual Environment (NG-CAVE)","awardID":"0959053","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["558517","495168","558518",435115],"PO":["557609"]},"161723":{"abstract":"Due to the increase in design complexity as a result of the paradigm shift from single-core to multi-core technology, designers require advanced optimization techniques to meet design constraints (e.g. power, energy, performance, area) within an ever shrinking time-to-market. Autonomous self-tuning architectures and methodologies enable a system to dynamically adapt to input stimuli to meet design constraints with little or no designer effort. However, self-tuning systems are exceedingly difficult to design, requiring custom algorithms, flexible reconfigurable architectures, non-intrusive self-evaluation techniques, etc. This research explores and architects novel, lightweight, and efficient reconfigurable architectures, algorithms, and methodologies in the context of a self-tuning cache hierarchy for energy efficient embedded systems. This research will provide fundamental knowledge of how core inter-dependencies both complicate and reveal new optimization opportunities and self-tuning methodologies applicable to other system components (e.g. communication topologies and protocols, voltage scaling, task-to-core mapping, etc.). The outcomes will spawn future research endeavors and enhance academic curricula as well as impact society through more rapidly advancing state-of-the-art technology made possible by reducing design time burdens, enabling application designers to focus more heavily on enhanced functionality rather than system optimization. A research group composed largely of underrepresented minorities and women will undertake the project's endeavors. In addition, the project will include an in-depth evaluation of real-life experiences gathered from successful women engineers to provide tangible motivation, which will be disseminated through scholarly publications, summer research experience programs for high school students, as well as seminars for K-12 students, teachers, and parents.","title":"CAREER: A Self-Tuning Cache Architecture for Multi-Core Systems","awardID":"0953447","effectiveDate":"2010-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["507807"],"PO":["565255"]},"170358":{"abstract":"This project supports US student researchers to travel to the Doctoral Consortium and the premier international conference on autonomous agents and multiagent systems. The International Joint Conference on Autonomous Agents and Multiagent Systems (AAMAS 2010) will be held in Toronto, Canada between May 10 and May 14, 2010. The conference provides these students with a platform to present their research results and allows them to participate in valuable discussions that will likely shape the future of this critically important field. The technical program is complemented with an array of workshops, tutorials and other events, as it has in previous years. The wide variety and significance of the topics typically presented at AAMAS, in both the technical program and the workshop program, provides opportunities for students to share, exchange and learn from each other. A Doctoral Mentoring Program is available for Ph.D. students in advanced stages of their research. This program will provide an opportunity for students to interact closely with established researchers, to receive feedback on their work and to get advice on managing their careers.","title":"Doctoral Mentoring Consortium at the International Conference on Autonomous Agents and Multi-Agent Systems (AAMAS 2010)","awardID":"1026617","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["556682"],"PO":["491702"]},"161536":{"abstract":"Collective intelligence has been harnessed recently to create new collaborative forms that were not previously achievable. This socially-emergent intelligence appears in collaborative management and indexing of information, authoring encyclopedia articles, participating in blogs, tagging or commenting photographs or videos. This socially-emergent movement also exposes an unprecedented amount of social information. Particularly, two classes of Internet applications reveal voluminous social information: popular online social networks (e.g., Facebook or LinkedIn); and the widely-adopted collaborative tools (e.g., CiteULike or Delicious) that provide rich information fabric through tags, annotations, and text organization.<br\/><br\/>This project investigates the potential of including social knowledge in the design of community-enabled peer-to-peer distributed infrastructures. It will design, prototype, and evaluate a community-oriented peer-to-peer infrastructure that exploits social knowledge for services such as data and computing management, while protecting social data privacy seen as contextual integrity. Using social knowledge in the design of services will likely improve performance, based on the assumptions that social incentives reduce churn; socially-inferred trust reduce security breaches and expand the set of available resources; and shared interest improves data placement decisions or co-location of data and computations. This will create the potential to enable new classes of applications and infrastructures. <br\/><br\/>This project develops innovative teaching strategies that facilitate non CS-major students use of computational tools in their professional lives. This will be done through multidisciplinary co-teaching of an undergraduate introductory course, and coordinated teaching of independent graduate courses in computer science and social sciences.","title":"CAREER: Socially-Aware Distributed Systems","awardID":"0952420","effectiveDate":"2010-05-01","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":[432066],"PO":["565255"]},"163725":{"abstract":"This project concerns one of the fundamental challenges facing<br\/>contemporary science and engineering today, namely, the efficient<br\/>processing and analysis of massive amounts of high-dimensional data,<br\/>such as images, videos, web pages, and bioinformatics data. In short,<br\/>data now routinely lie in thousands or even billions of dimensions. On<br\/>the one hand, massive data collection is motivated by 1) scientific<br\/>discovery and 2) the need for better engineering systems. On the other<br\/>hand, the difficult task now is to conduct meaningful inference in<br\/>such high dimensions, and draw correct conclusions from limited<br\/>amounts of sample data and with limited computational<br\/>resources. Fortunately, scientific or engineering data often have very<br\/>low intrinsic complexity and dimensionality. This project addresses<br\/>the opportunities offered by this common situation, establishes<br\/>conditions under which reliable inference is actually possible, and<br\/>develops computational tools for extracting key information from huge<br\/>data sets.<br\/><br\/>This interdisciplinary project is expected to have three outcomes: 1)<br\/>the development of innovative mathematics needed to study the recovery<br\/>of data matrices from partial and corrupted information 2) the<br\/>development of effective algorithms for recovering low-rank matrices<br\/>and performing accurate dimensionality reduction with corrupted data<br\/>and 3) the development of novel applications in which these techniques<br\/>are expected to considerably advance the state-of-the-art. With these<br\/>new tools, scientists and engineers will be able to efficiently<br\/>extract correct information from data, which was previously<br\/>inaccessible or intractable by conventional techniques. This will<br\/>enable the development of far better computer vision systems for face<br\/>recognition, better compression schemes of video sequences, a better<br\/>understanding of gene expression data, or better search engines for<br\/>web documents and images.","title":"CIF: Medium: Collaborative Research: Advances in the Theory and Practice of Low-Rank Matrix Recovery and Modeling","awardID":"0963835","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["438963"],"PO":["564898"]},"171238":{"abstract":"The most important task for scientific computing is to plan the way forward from the current era of multicore microprocessors implemented in deeply submicron CMOS. This has to be done in such a way that performance improvements are guaranteed. Otherwise the escalating costs of fabrication at the nanometer scale will not be sustainable. Multiple core microprocessors face several major problems, not the least of which is codified in Amdahl?s Law. This law states that even if multiple core processors can reduce all parallelizable code to vanishingly small run time, what will remain is serial code. Even relatively small amounts of serial code then limit the gains possible. Consequently it is prudent to pursue a balanced technology approach, in which both parallelizable and serial codes enjoy advantages. For serial code, assuming all instruction level parallelism (ILP) is fully exploited, the only way forward is to execute the serial code on a higher clock rate unit, or HCRU. Since clock rates for CMOS have tended to saturate due to wire scaling problems and excessive heat dissipation, one must look to an alternate three terminal device, but which is compatible with CMOS. This project explores whether the solution lies with an overlooked device, an aggressively scaled SiGe Heterojunction Bipolar Transistor (HBT). The claim for the research to verify is that clock rates of 20-30 GHz are possible at reasonable power levels and densities, but 3D technology is needed to mitigate memory wall problems.","title":"EAGER: A 32 GHz RISC Computer using 3D and SiGe Emerging Technology","awardID":"1031440","effectiveDate":"2010-05-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7945","name":"DES AUTO FOR MICRO & NANO SYST"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["517103"],"PO":["535244"]},"163857":{"abstract":"The microprocessor industry has moved toward multicore designs to leverage increasing transistor counts in the face of physical and micro-architectural limitations. Unfortunately, providing multiple cores does not translate into performance for most applications. Rather than pushing all the burden onto programmers, this project advocates the use of the implicitly parallel programming model to eliminate the laborious and error-prone process of explicit parallel programming. Implicit parallel programming leverages sequential languages to facilitate shorter development and debug cycles, and relies on automatic tools, both static compilers and run-time systems, to identify parallelism and customize it to the target platform. Implicit parallelism can be systematically extracted using: (1) decoupled softwarepipelining, a technique to extract the pipeline parallelism found in many sequential applications; (2) low-frequency and high-confidence speculation to overcome limitations of memory dependence analysis; (3) whole-program scope for parallelization to eliminate analysis boundaries; (4) simple extensions to the sequential programming model that give the programmer the power to refine the meaning of a program; (5) dynamic adaptation to ensure efficiency is maintained across changing environments. This project is developing the set of technologies to realize an implicitly parallel programming system with scalable, lifelong thread extraction and dynamic adaptation. At the broader level, the implicitly parallel programming approach will free programmers to consider the problems they are trying to solve, rather than forcing them to overcome the processor industry's failure to continue to scale performance. This approach will keep computers accessible, helping computing to have the same increasingly positive impact on other fields.","title":"CSR: Medium: Collaborative Research: Scaling the Implicitly Parallel Programming Model with Lifelong Thread Extraction and Dynamic Adaptation","awardID":"0964478","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["518034"],"PO":["565255"]},"163538":{"abstract":"Network Startup Resource Center (NSRC), University of Oregon IRNC:SP Cultivating the International Research and Education Network Fabric: An Essential Underpinning of Cyberinfrastructure PI: Dale Smith, co-PI: Steven Huter<br\/><br\/>The Network Startup Resource Center (NSRC) develops and enhances network infrastructure for collaborative research, education, and international partnerships, while promoting teaching and training via the transfer of technology. This IRNC project focuses NSRC activities on cultivating cyberinfrastructure via technical exchange, engineering assistance, training, conveyance of networking equipment and technical reference materials, and related activities to promote network technology adoption, and enhanced connectivity in R&E sites around the world. The end goal is to enhance and enable international collaboration via the Internet between U.S. scientists and collaborators in developing countries.<br\/><br\/>The broader impacts of NSRC's activities are global in scope -- helping to establish and improve underlying cyberinfrastructure, both physical (network connectivity) and human which are necessary to allow international scientific endeavors to flourish. Such resources are crucial to engage researchers in developing areas of the world. As an additional benefit, the NSRC's work builds goodwill for U.S. scientists, the NSF, and the U.S. government in universities, research institutions, and network operator groups throughout the developing world.<br\/><br\/>Regarding intellectual merit, NSRC's work advances knowledge and understanding within the fields of networking, telecommunications and information technology through the clarity of its focus: working to solve specific problems with people in the research and education environments of developing economies that seek to work together with their counterparts in the U.S. Improved infrastructure and increased available bandwidth enable international researchers to document and publish more local, indigenous data and publish more co-authored papers with U.S. scientists. The improved communications resulting from these efforts enhance collaboration between scientists and engineers on both ends of the connectivity spectrum; this ultimately helps attract a wider variety of ideas, information, talent, and resources to solving problems.","title":"IRNC: SP Cultivating the International Research and Education Network Fabric: An Essential Underpinning of Cyberinfrastructure","awardID":"0963081","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["547714","527261"],"PO":["564246"]},"161801":{"abstract":"To date, relatively little success has been achieved in realizing machines that continually perform simple yet adaptive behaviors in unstructured environments (compared to a structured environment such as a factory). The prevailing approach to create such machines is to copy physiological and neurological systems observed in animals, and build them into robots. This raises the issue however of what from among the infinitude of existing biological structures should be copied. Research under this award is pursuing an alternative approach: rather than copy existing biological systems, evolutionary dynamics are copied and connected in a virtual space. The resulting evolutionary algorithm optimize virtual robots' neurological structures that control behavior and their body plans. Importantly, evolution in these studies is task and behavior specific.<br\/><br\/>The research is intended to make important contributions to robotics and biology. For roboticists, this work will enable computers to automatically design the body plans and neural controllers for robots that are more adaptive and robust than robots designed manually. Automatically-designed virtual robots can then be built as physical devices and deployed into real-world environments, to include those that are dangerous to humans. For biologists, our studies will provide insight into why and how particular structures evolved in nature. For example, if legged robots originally evolved for locomotion are then selected to locomote and grasp objects, computational evolution may re-purpose the robot's front legs into arms and grippers; or, it may add manipulatory appendages onto the existing body plan. Either outcome would be of great interest to evolutionary biologists.<br\/><br\/>Finally, experiments are being housed in online tools that will allow graduate, undergraduate and K-12 students to run evolutionary simulations passively on their own machines, as well as actively participate in the process: they may design novel virtual environments in which the robots must evolve. This active participation is intended to motivate students to understand the physics, biology, engineering and computational processes underlying evolution.","title":"CAREER: Investigating the Ultimate Mechanisms of Embodied Cognition","awardID":"0953837","effectiveDate":"2010-05-15","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["560697"],"PO":["564318"]},"162967":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\"<br\/>Proposal #: 09-59958<br\/>PI(s): Bhattacharya, Sambit; Almeida, Michael; Czejdo, Bogdan, D.; Montoya, Daniel<br\/>Institution: Fayetteville State University <br\/>Title: MRI-R2: Acq. of Robots and Robot Accessories for Interdisciplinary Faculty and Student Research<br\/>Project Proposed:<br\/>This project, acquiring four research grade robot platforms along with accessories required for navigation, robot vision, and robot-human interaction within a hybrid architecture, enables research in mobile reactive and hybrid robots. It also forms the basis of a robotics laboratory for conducting such research.<br\/>The work addresses research in the following areas: spatial and temporal representation and reasoning using cognitive maps, stereo vision and object recognition, rapid modification and testing for correctness of reactive behaviors, and human experience of embodiment using robots. Although the institution currently utilizes educational robots in teaching activities, a robot platform suitable for human-robot interaction research is needed. Currently, no advanced robotics research facility exists at FSU or other local universities.<br\/>The acquisition of this equipment for a Robotics Lab strengthens interdisciplinary collaboration between the Departments of Psychology and Mathematics and Computer Science. Students in Psychology benefit from learning about computer hardware components and programming algorithms, while students in Computer Science learn about and work with concepts of cognitive psychology. A room within the science building at FSU is currently being refurbished to conduct the research projects described in this proposal, and store the robots. The PI and a co-PIs are responsible for installation of the robots at FSU. Most accessory and software installation in the robot bases will mainly be done by the vendor before shipping, so very little time and effort will be required to get started using the robots. Since one robot base will be used per project described in the proposal, there is no initial allocation needed. A long term maintenance contract from the vendor is included as part of the proposal.<br\/>Broader Impacts: <br\/>The equipment enables research activities involving undergraduate and graduate students, contributing to train them in advanced scientific research methodology and application development. This training benefits students from segments of population who are traditionally underrepresented in the STEM disciplines since FSU is a minority serving institution. The existing facilities at FSU are adequate for introductory programming and behavior based robotics courses. This new equipment and the space committed by the university to support the project enables advanced research and training. The activities supported by the equipment strengthen research at FSU. The new equipment will be available to regional faculty who are interested in conducting research in robotics and related fields.","title":"MRI-R2: Acquisition of Robots and Robot Accessories for Interdisciplinary Faculty and Student Research at Fayetteville State University","awardID":"0959958","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[435823,435824,435825,435826],"PO":["557609"]},"172108":{"abstract":"This research project is designing, evaluating, and implementing a interdomain routing system to ensure its scalability while at the same time easing the management load and enhancing the robustness of multi-homed networks. The project develops \"multiprocess routing\", an approach that runs multiple parallel routing processes that select primary or backup routes to deliver packets with high probability under multiple link and node failures, or misconfigurations. Multiprocess routing is particularly appropriate for multihomed networks where each network has multiple providers and potentially can be reached with node\/edge disjoint paths. A hierarchical automatic addressing scheme is being incorporated in the context of multiprocess routing. The hierarchical automatic addressing scheme provides multihomed networks with multiple addresses, each of which are allocated within the address block of its provider. This address allocation scheme can effectively reduce routing table size and routing update messages since providers can aggregate their customers? addresses and announce the whole address block rather than the specific address block for each customer. Furthermore, the automatic addressing protocol used here for host addressing can ease the management of multiple addresses for each network host. This project also establishes a collaboration with networking researchers in Japan.","title":"Design of Multiprocess Routing under the Hierarchical Automatic Addressing","awardID":"1036496","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["564706"],"PO":["564993"]},"162968":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59979<br\/>PI(s): Kaufman, Arie E., Mueller, Klaus, Qin, Hong, Samaras, Dimitrios, Varshney, Amitabh<br\/>Institution: SUNY at Stony Brook<br\/>Title: MRI-R2: Development of an Immersive Giga-pixel Display<br\/>Project Proposed: <br\/>This project, developing a next generation of immersive display instrument (called 'Reality Deck'), aims to explore and visualize data from many fields. To satisfy the need driven by the explosive growth of data size and environments already at the institution, the work builds on the existing experience with immersive environments (e.g., the 'Immersive Cabin' a current generation device using projectors). This unique project generates a one-of-a-kind exploration theater, using 308 high-resolution 30 LCD display monitors, by contributing an environment whose visual resolution is at the limit of the human eye's acuity. Within this environment investigators can interact with the data\/information displayed. <br\/>The instrument services many groups, including visual computing, virtual and augmented reality, human computer interfaces, computer vision and image processing, data mining, physics, scientific computing, chemistry, marine and atmospheric sciences, climate and weather modeling, material science, etc.<br\/>Collaborating scientist's applications will be ported to the RealityDeck, including applications in nanoelectronics, climate and weather modeling, biotoxin simulations, microtomography, astronomy, atmospheric science, G-pixel camera for intelligence gathering, architectural design and disaster simulations, smart energy grid, and many others.<br\/>A unique assembly of displays, GPU cluster, sensors, communication\/networking, computer vision and human computer interaction technologies, RealityDeck is an engineering feat with user studies to deliver a holistic system with a significant societal and research value. It is a one-of-a-kind pioneering G-pixel display approaching the limits of visual cognition that provides functionalities to a diverse user base. Its resolution at the eye's visual acuity and its field of view will always exceed that of a human user (wherever a human chooses to look), satisfying visual queries into the data in a very intuitive way. This visual interaction is tightly coupled with physical navigation.<br\/>This surround virtual environment consists of inertial sensors and six cameras mounted around the top corners of the RealityDeck room to allow interaction with the displays. The display system is driven by a cluster of about 80 high-end computer nodes, each equipped with two high end GPUs. A small-scale video-wall has already been constructed as an experimental platform for the RealityDeck consisting of 9 high-resolution 30 LCD panels in a 3×3 configuration. <br\/>Broader Impacts: <br\/>The instrument will be used for research, education, and outreach across many departments at the institution, the University of Maryland, and Brookhaven National Laboratory (BNL). It fosters collaborations across disciplines attracting faculty, researchers, and students. RealityDeck significantly enriches the quality of visual thinking and data exploration. It substantially enhances the infrastructure of research and education and has the potential to alter the way computer graphicists, engineers, and scientists work and\/or conduct scientific discoveries.","title":"MRI-R2: Development of an Immersive Giga-pixel Display","awardID":"0959979","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["541908","543581","416071","486115","508251"],"PO":["557609"]},"170108":{"abstract":"This award supports participants to EAAI-10: The First Symposium on Educational Advances in Artificial Intelligence. EAAI-10 provides a venue for researchers and educators to discuss pedagogical issues and share resources related to teaching artificial intelligence (AI) and using AI in education across a variety of curricular levels (K-12 through postgraduate training), with a natural emphasis on undergraduate and graduate teaching and learning. The symposium will seek and disseminate contributions showing how to more effectively teach AI, as well as how themes from AI may be used to enhance education more broadly. Examples of this kind of broad AI impact include its use to motivate and inspire students in introductory computing courses or as a means for fostering computational thinking. We encourage the sharing of innovative educational approaches that convey or leverage AI and its many subfields, such as robotics, machine learning, natural language, and computer vision.","title":"EAAI-10: The First Symposium on Educational Advances in Artificial Intelligence; July 2010; Atlanta, Georgia","awardID":"1025375","effectiveDate":"2010-05-15","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["491701","470900"],"PO":["491702"]},"163827":{"abstract":"The microprocessor industry has moved toward multicore designs to leverage increasing transistor counts in the face of physical and micro-architectural limitations. Unfortunately, providing multiple cores does not translate into performance for most applications. Rather than pushing all the burden onto programmers, this project advocates the use of the implicitly parallel programming model to eliminate the laborious and error-prone process of explicit parallel programming. Implicit parallel programming leverages sequential languages to facilitate shorter development and debug cycles, and relies on automatic tools, both static compilers and run-time systems, to identify parallelism and customize it to the target platform. Implicit parallelism can be systematically extracted using: (1) decoupled softwarepipelining, a technique to extract the pipeline parallelism found in many sequential applications; (2) low-frequency and high-confidence speculation to overcome limitations of memory dependence analysis; (3) whole-program scope for parallelization to eliminate analysis boundaries; (4) simple extensions to the sequential programming model that give the programmer the power to refine the meaning of a program; (5) dynamic adaptation to ensure efficiency is maintained across changing environments. This project is developing the set of technologies to realize an implicitly parallel programming system with scalable, lifelong thread extraction and dynamic adaptation. At the broader level, the implicitly parallel programming approach will free programmers to consider the problems they are trying to solve, rather than forcing them to overcome the processor industry's failure to continue to scale performance. This approach will keep computers accessible, helping computing to have the same increasingly positive impact on other fields.","title":"CSR: Medium: Collaborative Research: Scaling the Implicitly Parallel Programming Model with Lifelong Thread Extraction and Dynamic Adaptation","awardID":"0964328","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["511660"],"PO":["565255"]},"166929":{"abstract":"Support for Federated Logic Conference<br\/><br\/>The Federated Logic Conference (FLoC)is a back-to-back event of all the major international conferences in the area of Formal Methods. These include: <br\/>Conference on Computer-Aided Verification (CAV) <br\/>International Conference on Logic Programming (ICLP)<br\/>International Joint Conference on Automated Reasoning (IJCAR)<br\/>IEEE Symposium on Logic in Computer Science (LICS)<br\/>Conference on Rewriting Techniques and Applications (RTA)<br\/>International Conference on Theory and Applications of Satisfiability Testing (SAT)<br\/><br\/>While the participating conferences are normally held individually by their local conference organization on an annual basis, they all agree to this joint and federated event to be held every three-four years. The number of participants is near one thousand, and a third to one half of the participants are expected to be young researchers. To ensure that US-based students are able to attend, this grant provides travel support. The Federated Logic Conference brings together the following major events in Formal Methods, ranging from theory to applications in computer science and software engineering. The support is provided through cooperation of CISE directorate's computer science theory and software science\/engineering programs, as well as the MPS directorate's mathematical sciences division. Support for these foundational topics is important to enhance research in many areas, including the security, privacy, usability, and reliability of computing systems. Formal Methods have emerged as one of the primary approaches towards that goal. A federated conference provides an opportunity for accelerating research via synergy between the different strands of research in Formal Methods. It is also an outstanding training opportunity for young researchers, as it offers them a grand view of the whole area. Support for this grant is provided cooperatively from the NSF directorates of Computer & Information Science and Engineering and Mathematical and Physical Sciences.","title":"Support for the 2010 Federated Logic Conference","awardID":"1009103","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1268","name":"FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}}],"PIcoPI":["565263"],"PO":["564388"]},"170901":{"abstract":"Current network-centric Internet service model is prone to<br\/>resource exhausting attacks such as Distributed Denial of<br\/>Services attacks. Due to the resource sharing nature and<br\/>non-coordinated monitoring capability of the current Internet,<br\/>it is difficult to quickly identify attack sources. Second, a<br\/>new trend is to develop a user-centric Internet service model,<br\/>in which traditional local network services are outsourced to<br\/>remote service providers such as for cloud services. This new<br\/>trend allows end users to fully control remote service nodes,<br\/>their interconnections and routing, which imposes great threats<br\/>on network resource allocations. Thus, it is highly desired<br\/>that the future Internet is designed to provide a secure<br\/>service domain that is both network-centric and user-centric.<br\/>As a fundamental core to this goal, a secure and resilient<br\/>virtualized routing architecture in a global inter-networking<br\/>environment is explored to provide network resource reservation<br\/>protection both at the network-centric and the user-centric<br\/>level. A novel attribute-based, cryptography-based approach to<br\/>construct secure virtualization is to be developed.<br\/>Furthermore, an architectural solution to address the policy<br\/>enforcement and inter-domain trust management is also<br\/>considered. The end goal is to greatly improve the efficiency<br\/>of attack monitoring and intrusion detection and to increase<br\/>the resiliency of the future Internet. This is a collaborative<br\/>exploratory project bringing together researchers from the<br\/>University of Missouri-Kansas City, Arizona State University,<br\/>and Osaka City University, Japan. All research results will be<br\/>made available to the scientific community.","title":"EAGER: Collaborative Research: A Secure and Resilient Virtual Trust Routing Framework for Future Internet","awardID":"1029562","effectiveDate":"2010-05-01","expirationDate":"2013-10-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["541801"],"PO":["564993"]},"161914":{"abstract":"Human beings can recognize objects in a highly selective, robust and fast manner. One of the remarkable properties of our recognition machinery is the possibility to selectively recognize objects even after transformations such as rotation, translation, scaling, occlusion and clutter. How the human brain accomplishes recognition is not well understood. More is known about processing of sensory information from receptors to the initial stages in cortex than about the subsequent transformation of perceptual data into cognition. In parallel, over the last decades, major progress has been made in building ever more accurate and sophisticated computers and devices to capture sensory information but progress has been slower in terms of developing algorithms and hardware to automatically interpret the sensory data. With support from the National Science Foundation, Dr. Gabriel Krieman is undertaking research whose aim is to elucidate the computational steps and algorithms implemented by the cerebral cortex to transform incoming inputs into cognitive functions and behavior. The research focuses on one particular aspect of cognitive experience, the neuronal mechanisms and circuits that underlie visual processing. While vision is only one of many aspects of cognition, lessons learnt from studying visual cortex can also eventually help describe other aspects of cortical function and can pave the way for research on other challenging aspects of cognition. To investigate visual cognition, Dr. Kreiman takes advantage of a rare opportunity to both stimulate and record electrical activity at high spatial and temporal resolution directly from the human brain in epilepsy patients. The study investigates tasks where visual cognition is dissociated from the incoming sensory processing in order to isolate the cognitive operations involved in recognition. The discoveries about the function of biological neural circuits will be applied to develop biophysically-inspired robust machine vision algorithms. <br\/><br\/>Visual recognition is essential for most everyday tasks including navigating, reading, and identifying objects, faces and emotions. By furthering our understanding of the transformation of perceptual information into cognition, the study is contributing to two broad goals: (1) Helping to alleviate the challenging conditions that involve cognitive disorders through the development of brain-machine interfaces; and (2) Applying knowledge about neuronal circuits to develop computational algorithms to extract cognitive information from sensory data. Building a fast, robust and reliable artificial vision system would have profound repercussions in many areas of science and engineering including pattern recognition, surveillance and security, automatic navigation, clinical image analysis and others. These scientific and engineering advances could in turn translate into important real-world applications of interest for industrial partnerships. Dr. Kreiman pursues these goals by studying the best possible system that can solve visual recognition challenges, the human brain. Understanding the visual system relies on many skills ranging from computer science to engineering to physics to neuroscience to psychology. The project serves well to train a generation of multidisciplinary students who can build on the fundamental science knowledge and apply this knowledge to challenging biological problems.","title":"CAREER:Deciphering the Neural Code From Perception To Cognition","awardID":"0954570","effectiveDate":"2010-05-15","expirationDate":"2015-04-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1699","name":"COGNEURO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["447585"],"PO":["562348"]},"162948":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59856<br\/>PI(s): Starr, Francis W.; Beveridge, David, L.; Weir, Michael, P.<br\/>Institution: Wesleyan University <br\/>Title: MRI-R2\/Acq: Shared Cluster and Database Computing Facilities at Wesleyan University<br\/>Project Proposed:<br\/>This project, acquiring a shared, state-of-the-art, mid-sized super-computing cluster and database server, supports intensive research computing and corresponding initiatives at the institution. The current central facilities are no longer able to meet the intensive research computing and corresponding initiatives in education, as evidenced by a five-fold increase in the number of pending jobs over a period of two years. The requested cluster roughly doubles the size of the central super-computing facility, as well as adds new support for informatics-based research that relies heavily on relational database mining.<br\/>Research programs in astrophysics, biomaterials, liquid state chemical physics, nanotechnology, quantum chemistry, molecular biophysics, neuroinformatics, and structural bioinformatics, all require high-end computing resources and have become increasingly dependent on high-performance computing facilities. All these areas offer courses that involve hands-on computation. Currently, a large number of faculty, staff and students are active research users, and roughly 2\/3 of those are students; additionally, 40-50 students per year make use of facilities for course related computational activities.<br\/>Based on consultations with the current primary users of the system and the systems administrator, the new proposed cluster consists of 40-50 CPU nodes, each with two Intel Xeon quad core processors, and containing 8-16 GB of storage. An infiniband interconnect will connect the processors to facilitate parallel applications. Data storage is provided for the user calculations via a RAID array of 30-40 TB. The dedicated database server has dual 4 or 6-core processors, a large memory footprint, and high performance local disks to store the database.<br\/>The system is housed in the renovated facility on the Information Technology Services (ITS) floor of the Wesleyan Science Tower, maintained by a designated ITS systems manager and made available for research and instructional needs over the current WESNET network. A faculty Computer Advisory Committee provides academic oversight, manages allocation requests, and coordinates with ITS. The institution continues to support the administration of the new system.<br\/>Broader Impacts: <br\/>The instrument services both the faculty research and student education. It enables new science to be produced in the course of diverse research projects and impacts the ongoing instruction in the University, serving as a learning tool to develop student scientific computing proficiency both through existing courses and participating in faculty-led research. To further extend the educational and training goals, a new Scientific Computing and Informatics Center (SCIC) was developed with funding support from the University, aimed at facilitating the effective use of the new high-performance computing facility by all faculty and students, and supporting the educational initiatives of courses utilizing computational resources. The SCIC also operates a summer program supporting undergraduate research and developing teaching modules (in collaboration with relevant faculty) that directly impacts many courses across the curriculum. <br\/>The cluster and database facility also serve as a focal point and resource for undergraduate students in computationally intensive courses of study, including a recently approved interdisciplinary 'Certificate Program in Informatics and Modeling'. This interdisciplinary program functions effectively as a minor field of study alongside major fields. The program has two elements, a computational and an informatics foci.","title":"MRI-R2: Acquisition of Shared Cluster and Database Computing Facilities at Wesleyan University","awardID":"0959856","effectiveDate":"2010-05-01","expirationDate":"2013-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[435731,"552175",435733],"PO":["557609"]},"163806":{"abstract":"This project concerns one of the fundamental challenges facing<br\/>contemporary science and engineering today, namely, the efficient<br\/>processing and analysis of massive amounts of high-dimensional data,<br\/>such as images, videos, web pages, and bioinformatics data. In short,<br\/>data now routinely lie in thousands or even billions of dimensions. On<br\/>the one hand, massive data collection is motivated by 1) scientific<br\/>discovery and 2) the need for better engineering systems. On the other<br\/>hand, the difficult task now is to conduct meaningful inference in<br\/>such high dimensions, and draw correct conclusions from limited<br\/>amounts of sample data and with limited computational<br\/>resources. Fortunately, scientific or engineering data often have very<br\/>low intrinsic complexity and dimensionality. This project addresses<br\/>the opportunities offered by this common situation, establishes<br\/>conditions under which reliable inference is actually possible, and<br\/>develops computational tools for extracting key information from huge<br\/>data sets.<br\/><br\/>This interdisciplinary project is expected to have three outcomes: 1)<br\/>the development of innovative mathematics needed to study the recovery<br\/>of data matrices from partial and corrupted information 2) the<br\/>development of effective algorithms for recovering low-rank matrices<br\/>and performing accurate dimensionality reduction with corrupted data<br\/>and 3) the development of novel applications in which these techniques<br\/>are expected to considerably advance the state-of-the-art. With these<br\/>new tools, scientists and engineers will be able to efficiently<br\/>extract correct information from data, which was previously<br\/>inaccessible or intractable by conventional techniques. This will<br\/>enable the development of far better computer vision systems for face<br\/>recognition, better compression schemes of video sequences, a better<br\/>understanding of gene expression data, or better search engines for<br\/>web documents and images.","title":"CIF: Medium: Collaborative Research: Advances in the Theory and Practice of Low-Rank Matrix Recovery and Modeling","awardID":"0964215","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7797","name":"COMM & INFORMATION FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7936","name":"SIGNAL PROCESSING"}}],"PIcoPI":["518402","311520"],"PO":["564898"]},"162817":{"abstract":"This proposal will be awarded using funds made available by the American Recovery and Reinvestment Act of 2009 (Public Law 111-5), and meets the requirements established in Section 2 of the White House Memorandum entitled, Ensuring Responsible Spending of Recovery Act Funds, dated March 20, 2009. As the cognizant Program Officer, I also affirm that the proposal does not support projects described in Section 1604 of Division A of the Recovery Act.<br\/><br\/>Proposal #: 09-59124<br\/>PI(s): Apon, Amy W.; Cothren, Jackson, D.; El-Shenawee, Magda O.; Pulay, Peter; Spearot, Douglas E.<br\/>Institution: University of Arkansas<br\/>Title: MRI-R2\/Acq.: Acq. of an Integrated Instrument for Computational Research and Education<br\/>Project Proposed:<br\/>This project, acquiring an integrated supercomputing platform for distributed and shared memory parallel applications that are computationally, data, and storage intensive, aims to service a broad range of projects in computational science and engineering. The work potentially expands the capability to do computational research in Arkansas by an order of magnitude.<br\/>The supercomputer requested would be used principally in the areas of computer science, computational chemistry, computational biomagnetics, mechanical engineering, geosciences, and spatial science. It also benefits researchers in integrated nanoscience, astrophysics, bioinformatics, large scale optimization, video analysis, and network topology.<br\/>Broader Impacts: <br\/>The proposed cluster will be the primary high-end computing platform for research and educational activities for the University and for the state. The geosciences projects have substantial commercial potential and particular significance for the economic development in Arkansas. The proposal includes a significant outreach and an educational component targeted to undergraduate students. In addition, the project contains training activities targeted to faculty who teach undergraduate students at many institutions of the eleven four-year institutions of higher education in Arkansas.","title":"MRI-R2: Acquisition of an Integrated Instrument for Computational Research and Education","awardID":"0959124","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":["516195","540643","521723","551314","442237","442237"],"PO":["557609"]},"162707":{"abstract":"This proposal seeks to obtain funding to acquire computing<br\/>infrastructure to perform cross-disciplinary research in artificial<br\/>intelligence, natural language processing, bioinformatics, social<br\/>networks and related fields. In particular, the projects that will<br\/>be supported by the infrastructure acquired include developing algorithms<br\/>and architectures for large-scale ontology alignment, particularly in<br\/>the biomedical domain; mining Wikipedia and similar Web-based sources<br\/>for geographical, temporal and ontological information; performing<br\/>named entity recognition in biomedical and other domains; performing<br\/>computational motivational and content analysis of socially generated<br\/>content such a blogs and micro-blogs; undertaking corpus-based computational<br\/>linguistics research in under-studied and possibly endangered languages from<br\/>India and other locations; developing better-performing algorithms for gene<br\/>expression analysis; and developing, implementing and comparing algorithms<br\/>for protein structure prediction, particularly proteins that contain<br\/>coiled-coil structures. These projects deal with large amounts of data<br\/>and information and processing such data and information requires large<br\/>amounts of computing power. Our proposal seeks to acquire adequate and<br\/>flexible computing hardware to facilitate problem-solving in these and other<br\/>areas, so that current and future problems can be solved felicitously. <br\/><br\/>The infrastructure acquired will enable cutting-edge research by Ph.D.,<br\/>Masters and undergraduate students, including REU site students, in a<br\/>variety of cross-disciplinary topics that employ ideas and innovations<br\/>in artificial intelligence, machine learning and information retrieval.<br\/>For example, the results of our research may enable creations of systems<br\/>that discover overlaps and matches among large medical ontologies so that<br\/>painstakingly created domain-specific information can be fused, compared<br\/>and utilized better; and may assist in creating programs that assist in<br\/>automatically understanding and\/or visualizing content of socially-generated<br\/>Websites such as Wikipedia and Twitter.<br\/><br\/>For further information see the project web site at the URL:<br\/>http:\/\/www.cs.uccs.edu\/~kalita.","title":"II-NEW: Acquiring infrastructure for Artificial Intelligence, Natural Language Processing and Information Retrieval","awardID":"0958576","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["504374","504375",434802],"PO":["543481"]},"162928":{"abstract":"\"This award is funded under the American Recovery and Reinvestment Act of 2009 (Public Law 111-5).\" <br\/>Proposal #: 09-59713<br\/>PI(s): Sharp, Richard <br\/> Dixon, Emily H.; Estevez, Ana Y.; Harcourt, Edwin; Olendzenski, Lorraine, C.<br\/>Institution: Saint Lawrence University <br\/>Title: MRI-R2\/Acq.: High Performance Computer and Microarray Scanner for Interdisciplinary Research in Computer Science and Biology at St. Lawrence University<br\/>Project Proposed:<br\/>This project, acquiring a microarray scanner and a high-end compute-server, enables the research programs of twelve faculty members from the departments of Computer Science, Biology, Statistics, and Psychology. Projects include image synthesis, comparative genome analysis in yeast, phylogenetic analysis of microbial communities and comparative analysis of bacterial genomes, microarray analysis of gene expression, and bird foraging studies. Both of these instruments will be the first of their kind on the St. Lawrence University (SLU) campus; the microarray scanner is the first in New York State north of Syracuse and the high-end server, the first in any neighboring universities. The placement of a microarray scanner eliminates the need to utilize one in North Carolina that provides services at a discounted rate for faculty conducting research with undergraduate students. This currently useful but unwieldy procedure prevents faculty from expanding the number and types of microarrays used in their research, significantly limiting progress. A single high-end server has been chosen, as opposed to a cluster of computers, due to the simpler programming model inherent in one machine versus many. Most of the St. Lawrence users employ software tools that are parallel, but not distributed, and hence would not benefit from a cluster. The large memory size in one machine is especially beneficial for those research projects that generate large hash tables, such as the BLAST algorithm for genome database querying, and photon-mapping algorithms used in numerical simulations of light scatter.<br\/>The microarray scanner is housed in a common-use equipment room close to faculty microbiology, biochemistry, genetics and cell biology labs where it will be easily accessible to all biology faculty. The scanner and space will be managed by the Department of Biology, but available for use by faculty and students in all science disciplines, as well as scientists\/researchers from the broader North Country Region of New York State (Clarkson University, SUNY-Potsdam, SUNY-Canton, Paul Smith's College). The biology co-PIs oversee day-to-day operations, training, scheduling of all users, and equipment maintenance (via a service contract support from manufacturers). The server will be housed in the SLU Information Technology (IT) Central Server Facility. Physical maintenance is conducted by IT's server manager and IT. User accounts are maintained, and training is conducted. A multidisciplinary Project Steering Committee oversees the use and management of the equipment. With the new microarray scanner on site, the volume of microarray processing will increase, as will the costs associated with running these experiments. These higher research costs will be covered through research support funds from the Biology Department. At the completion of the project period, SLU assumes all costs for the day-to-day operation and long-term maintenance.<br\/>Broader Impacts: <br\/>This instrumentation strongly impacts SLU and strengthens SLU's undergraduate research culture. The new equipment will allow undergraduates in these disciplines to gain experience with key scientific technologies and relevant methodologies. However, the reach of the equipment is not limited to SLU alone; two research projects from neighboring Clarkson University have been identified, and will be a focal point for The Associated Colleges of the St. Lawrence Valley, an educational consortium between St. Lawrence University and three neighboring universities: Clarkson University, State University of New York, (SUNY) Potsdam, and SUNY Canton. This consortium was created to expand the number and variety of educational opportunities for faculty and students, to share resources, and to innovate through joint action. Emphasis is placed on the recruitment of students from underrepresented backgrounds.","title":"MRI-R2: Acquisition of High Performance Computer and Microarray Scanner for Interdisciplinary Research in Computer Science and Biology at St. Lawrence University","awardID":"0959713","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1189","name":"MAJOR RESEARCH INSTRUMENTATION"}}],"PIcoPI":[435646,435647,"435649",435649,435650,435651],"PO":["557609"]},"161718":{"abstract":"Massive volumes of data are now generated in social, scientific, business and military applications. However, access to the data is limited, due to computational, bandwidth, power limitations, as well as human constraints such as attention and privacy. A fundamental problem is thus to obtain most useful information at minimum cost. Most existing techniques are heuristics without guarantees, do not scale or cannot cope with dynamic, distributed phenomena that change over time. In addition, existing algorithms typically disregard human aspects of the information gathering task. <br\/><br\/>This research (1) develops principled algorithms for optimized information gathering in distributed, uncertain, dynamic domains, (2) studies human aspects of optimized information gathering, considering attention, perception and privacy as fundamental constraints and (3) pursues novel, real-world applications. <br\/>To accomplish these goals, fundamentally new techniques in combinatorial optimization, probabilistic reasoning and decision theory are developed. The approaches are unified in the mathematical framework of submodular function optimization. In addition to developing theoretically well-founded, rigorous approaches, an important part of the research is evaluation on interdisciplinary, real world applications in social computing, scientific data analysis and stochastic optimization in sustainability.<br\/><br\/>These applications of optimized information gathering have the potential to enable new classes of systems and services for science and society. Impact is achieved through collaboration with partners from industry (Microsoft Corporation) and governmental facilities (USGS and JPL), as well as by broad dissemination of the results through an integrated education plan, tutorials, shared data and open-source software, and interdisciplinary collaborations.","title":"CAREER: Coping with the Data Deluge - Algorithms, Human Aspects and Applications","awardID":"0953413","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0302","name":"Division of ASTRONOMICAL SCIENCES","abbr":"AST"},"pgm":{"id":"1045","name":"CAREER: FACULTY EARLY CAR DEV"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":[432447],"PO":["562760"]},"170409":{"abstract":"The 19th ACM International Symposium on High Performance Distributed Computing (HPDC 2010). HPDC 2010 will be held, along with nine workshops and a meeting of the Open Grid Forum (OGF) standards body, in downtown Chicago, Illinois on June 20 through June 25, 2010. <br\/>HPDC is the premier forum for presenting the latest research findings on the design and use of parallel and distributed systems for high end computing, collaboration, data analysis, and other innovative applications.<br\/>HPDC seeks to increase student participation in symposium and the field. The proposed funding would support the travel of eligible US students to the symposium. Recipients would be able to attend the main conference, workshops, the OGF meeting, and would also participate in a birds-of-a-feather session to discuss their experiences. Travel grants will encourage the research interests and the involvement of students in the field who are not well funded and those who are just beginning their participation in the field or are interested in entering it. A special effort will be made to reach out to women and under-represented minorities.","title":"Student Travel Support For ACM HPDC 2010; June 2010; Chicago, IL","awardID":"1026810","effectiveDate":"2010-05-01","expirationDate":"2011-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["540138"],"PO":["565272"]},"166096":{"abstract":"An award was made to the University of Alaska Anchorage to provide research training for 10 weeks for 8 students, for the summers of 2010-2012. This program actively engages students in faculty-mentored research in the areas of Ecology and Physiological Ecology in Alaska. It is intended to encourage undergraduates toward postgraduate education and careers in the sciences. It is guided by four main objectives: 1) to help students develop critical thinking skills, 2) to increase student interest in pursuing careers in sciences and to engage students directly in discussions surrounding graduate school and career options, 3) to increase student independence as researchers, and 4) to attract a diverse range of students into the program. The program is structured to involve students in all aspects of scientific investigation and to inspire them through direct exposure to ecological and physiological phenomena in Alaska. Students are mentored toward increased independence as the program progresses. Weekly research seminars, a series of career development workshops, and a variety of fieldtrips and group activities facilitate student learning and development. Focused discussions and training in ethics and responsible conduct of research are included in the program's format. The program concludes with a student research symposium in which students are expected to present the results of their projects to student peers, colleagues, and mentors. Students from underrepresented minority groups and from institutions with limited opportunities for research are targeted during recruiting efforts. A combination of assessment tools, including exit surveys, mentor evaluations, student tracking, and program tracking, are used to measure the effectiveness of this program. For more information, please contact Dr. David Pfeiffer at (907) 786-7762 or afdcp@uaa.alaska.edu or visit http:\/\/www.uaa.alaska.edu\/reu.","title":"REU Site: Ecology and Physiological Ecology in Alaska","awardID":"1005210","effectiveDate":"2010-05-15","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"J265","name":"Defense Intelligence Agency"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"7972","name":"Transforming Undergrad Bio Ed"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0808","name":"Division of BIOLOGICAL INFRASTRUCTURE","abbr":"DBI"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["539262","539260"],"PO":["562548"]},"169264":{"abstract":"Research is performed to establish the role of innate theories in cognitive robotics. Current architectures have a major weakness: the semantic levels, although perhaps patterned after biological systems, are selected in an ad hoc way. This project develops domain theories for the following levels of cognitive function:<br\/><br\/>? self-knowledge: ? dynamical vehicle control: rigid body motion is fundamental<br\/>to dealing with the physical world, and Lie algebra is used as the key domain<br\/>theory.<br\/><br\/>? particular constraints ? rules of the game (e.g., traffic laws): rule-based systems provide the underlying methodology for understanding rules.<br\/><br\/>? user interaction ? agent behavior: graph eigenvector clustering is used to segment basic behaviors of other agents, including people.<br\/><br\/>? operational context ? active embodiment computation and communication control: high-level policies on latency, throughput, priority, and parameter selection provide a domain theory.<br\/><br\/>Specifically, the project studies how symmetry theory can be exploited in a novel perception-action architecture. Symmetry plays a deep role in our understanding of the world, in that it addresses issues of invariance. The determination of operators which leave certain aspects of state invariant makes it possible to identify objects or maintain specific constraints while performing other actions. Symmetry operators in signal analysis, concept formation, learning and platform control are studied. The potential impact of the work is a more cohesive, expressive, adaptable and effective cognitive<br\/>robotics framework. Results will be disseminated at robotics and AI conferences<br\/>as well as at international workshops (e.g., Schloss Dagstuhl). Potential applications include: cognitive vehicles, sensor networks, buildings, interactive toys, etc.","title":"EAGER: Innate Theories in Cognitive Robotics","awardID":"1021038","effectiveDate":"2010-05-15","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["486565","429182"],"PO":["565227"]},"159321":{"abstract":"Wayne State University, in partnership with local community organizations, proposes a demonstration project that integrates K-12 outreach activities, pre-college bridge programs, and undergraduate computing degree programs in Detroit, MI to increase the participation and success of under-represented students in computer science, particularly African-Americans and women. The pipeline is novel in that it joins K-12 outreach efforts with adult learners and undergraduate students in an urban context. The pipeline will offer a selection of summer camps, Saturday classes, after school and in-school programs in conjunction with community organizations having experience with the K-12 educational processes and with recruiting minority students. These activities will target students from 2nd grade through high school. Parents will also participate, in the form of parent cafés, in which they engage in dialog with computing educators about how to support and encourage their children in the computing disciplines. Finally, the project will offer pre-college and first year bridge instruction which remediates academic deficiencies and explicitly prepares disadvantaged students for undergraduate education in the computing disciplines.<br\/><br\/>All pipeline activities will incorporate a suite of interventions designed to explicitly counter stereotype threat, promote a growth-oriented mindset, and encourage learning as well as feelings of self-efficacy, particularly with respect to the computing disciplines. These activities include coaching of students and teachers about the growth-oriented nature of intelligence, developing and providing culturally-relevant role models who demonstrate striving and a growth-oriented view of intelligence, and asking the students to develop themselves or Alice-generated representations of self as role models and exemplars of striving and learning for others. Similar interventions have been shown to eliminate a significant share of the black-white achievement gap in urban settings; this project is the first to explore their use in large scale for computer science and engineering<br\/>education.","title":"BPC-LSA: STRONG Computing Pipeline","awardID":"0940592","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":[425920,425921,425922,425923,425924],"PO":["561855"]},"166097":{"abstract":"The Texas Tech University Research Experiences for Undergraduates Site program provides opportunities for ten undergraduate students each summer to conduct research on two of the most crucial aspects of computing, software engineering and service composition. This REU Site project meets the needs for an undergraduate computing research environment in the Texas South Plains and contributes to producing graduate students in two essential sub-disciplines of computer science. The overall basis for this REU Site is for research efforts that improve the development of software and service-oriented systems in a wide variety of application domains. There are three major objectives for the proposed REU Site: increase the percentage of women and underrepresented minority students; improve the retention of computer science students; and increase those undergraduate students entering into graduate computing education degree programs.<br\/><br\/>These objectives are met through research that addresses a broad spectrum of means for improving software development. The projects address: software specification generation based on user input and output; construction of a self-managed embedded software system using software specifications; and dynamic techniques for service composition and recovery in a service-oriented environment. The undergraduate student research topics include language development, software tool design and implementation, application development in a variety of application domains to demonstrate applicability, and measurement of the improvements. The technical results of the research efforts with undergraduate students will be disseminated in a broad set of publications. The broadening participation aspects of the broader impacts will be in the women and underrepresented minority students that are recruited for the program, the achievement of success at conducting research, and then continuation on to graduate school.","title":"REU Site: Research Experiences for Undergraduates in Software Engineering and Service Composition","awardID":"1005212","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[445009,"553593","539086","553593","539087"],"PO":["564588"]},"158871":{"abstract":"Petascale applications are producing terabytes of data at a great rate. Storage systems in large-scale machines are significantly stressed as I\/O rates are not growing as fast to cope with data production. A variety of HPC activities such as writing output and checkpoint data are all stymied by the I\/O bandwidth bottleneck. Further to this, the post-processing and subsequent analysis\/visualization of computational results is increasingly time consuming due to the widening gap between the storage\/processing capacities of supercomputers and users' local clusters. <br\/><br\/>This research focuses on building a novel in-job dynamic data staging architecture and in bringing it to bear on the looming petascale I\/O crisis. To this end, the following objectives are investigated: (i) the concerted use of node-local memory and emerging hardware such as Solid State Disks (SSDs), from a dedicated set of nodes, as a means to alleviate the I\/O bandwidth bottleneck, (ii) the multiplexing of traditional user post-processing pipelines and secondary computations with asynchronous I\/O on the staging ground to perform scalable I\/O and data analytics, (iii) bypassing memory to access the staging area, and (iv) enabling QoS both in the staging ground and in the communication channel connecting it to compute client and persistent storage. <br\/><br\/>This study will have a wide-ranging impact on future provisioning of extreme-scale machines and will provide formative guidelines to this end. The result of this research will be a set of integrated techniques that can fundamentally change the current parallel I\/O model and accelerate petascale I\/O pipelines. Further, this research will help analyze the utility of SSDs in day-to-day supercomputing I\/O and inform the wider HPC community of its viability.","title":"Collaborative Research: Dynamic Staging Architecture for Accelerating I\/O Pipelines","awardID":"0937842","effectiveDate":"2010-05-01","expirationDate":"2013-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7952","name":"HECURA"}}],"PIcoPI":["561947"],"PO":["565272"]},"154152":{"abstract":"This project is motivated by new connections between the research fields of computational complexity theory and machine learning theory. Computational complexity theory aims to understand which problems can be solved efficiently on a computer by determining the amounts of computational resources such as CPU time, memory space, or circuit area that are required to solve problems. At the center of this field is the famous P vs. NP question which impacts virtually every scientific and engineering discipline, given the thousands of diverse NP-complete problems that have been discovered. Machine learning theory studies the extent to which computers can learn from data and their ability to make future predictions and classifications based on what has been learned. Some powerful learning algorithms have been discovered, but whether computers can be programmed to accomplish many learning tasks remains an open question.<br\/><br\/>Both computational complexity and machine learning aim to understand the capabilities and limitations of computation, but the two fields study different types of problems and use different kinds of techniques. This research will employ techniques and ideas from each of these two fields to impact the other field, specifically with the goal of proving \"lower bound\" results. This research will be accomplished by making use of a new vantage point provided by algorithmic randomness to relate complexity and learning problems. Learning algorithms will be utilized to establish lower bounds on the computational resources required to solve problems in computational complexity. The converse direction will be investigated to apply techniques and ideas from computational complexity to show that \"attribute-efficient\" learning algorithms do not exist for certain concept classes. Algorithmic randomness and Kolmogorov complexity will be used to improve our understanding of the capabilities and limitations of learning algorithms.<br\/><br\/>This research will improve our understanding of computational complexity, which is informative to many areas of science and engineering where computation plays a role. This project aims to better understand what learning tasks can be accomplished efficiently by computers, which has applications to the foundations of artificial intelligence. In particular, this research will identify new obstacles that must be overcome in order to design successful automatic learning systems. A greater synergy will be developed between computational complexity theory and machine learning theory, with the benefit of laying a foundation for future collaboration and interdisciplinary work across these fields.","title":"AF: Small: Learnability, Randomness, and Lower Bounds","awardID":"0917417","effectiveDate":"2010-05-15","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}}],"PIcoPI":[410155],"PO":["565157"]},"166032":{"abstract":"In this new REU site proposal the goal is to provide interdisciplinary research experiences for promising students in building massive social networks and exploring applications of these. Specific targeted projects involve topics in the areas of distributed regular path query evaluation in social networks, privacy- preserving distributed architectures for social networks, mechanisms of 'virtual' friendship relationships, and the impact on understanding and modeling of online\/offline human behaviors. The proposed REU site will recruit promising undergraduates each year and provide a structured plan of activities for the duration of the project. Special emphasis on attracting high quality students from under-represented groups in research. An eight- week summer session will be organized for all REU students.","title":"REU Site: Interdisciplinary Research Experiences for Undergraduates in Massive Online Social Networks","awardID":"1004996","effectiveDate":"2010-05-01","expirationDate":"2014-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":[444829,444830],"PO":["563751"]},"169795":{"abstract":"PACT is a multi-disciplinary conference that brings together researchers from hardware and software areas to present ground-breaking research in parallel systems ranging across instruction-level parallelism, thread-level parallelism, multiprocessor parallelism and large scale systems.<br\/>This award is to make travel scholarships available to students and universities not typically represented at PACT in order to improve the conference?s impact and outreach.","title":"International Conference on Parallel Architectures and Compilation Techniques (PACT) 2010 Student Scholarships","awardID":"1023812","effectiveDate":"2010-05-01","expirationDate":"2012-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7329","name":"COMPILERS"}}],"PIcoPI":["533346"],"PO":["565272"]}}