{"39491":{"abstract":"This award supports some of the cost of a national workshop on advanced<br\/>networking middleware. There are three goals for the workshop: (a) development of<br\/>an acceptable definition for the concept of \"networking middleware,\" (b)<br\/>identification of core components for a networking middleware<br\/>infrastructure \"layer,\" and (c) identification of needed research related<br\/>to components and to their involvement in a networking testbed. Though<br\/>results will be of benefit to many in the research community, the workshop<br\/>report will be of particular use to the Advanced Network Infrastructure<br\/>program at NSF in its deliberations about future advanced networking programs.","title":"iCAIR Workshop on Middleware: Allen Conference Center, Northwestern University's Evanston Campus, Evanston, Illinois: (December 3 - 4, 1998)","awardID":"9901226","effectiveDate":"1998-12-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["320720"],"PO":["121202"]},"38063":{"abstract":"The focus of this study is to identify the ethical dimensions of software development projects and the ways that potential negative consequences can be mediated. A software development impact statement (SoDIS) will be developed to uncover and address ethical dimensions such as privacy, access, security, autonomy, safety, and harmfulness. An \"ideal\" SoDIS would be consistent with standard development practices and could be incorporated into national and international software development standards. This study will: 1) refine the conceptual tools for identifying ethical risks; 2) begin examination of means to resolve ethical risks; 3) develop a software prototype; 4) identify software project management tools currently used in the industry and integrate the prototype; and 5) refine the process for incorporation into national and international standards.","title":"SGER: Software Development Impact Statements: Identifying and Responding to the Ethical Dimensions of Software Projects","awardID":"9874684","effectiveDate":"1998-12-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7915","name":"Ethics & Values of SET"}}],"PIcoPI":[96793],"PO":["495796"]},"49210":{"abstract":"","title":"SGER: Human-Machine Cooperative Telerobotics for Complex Task Execution","awardID":"9996189","effectiveDate":"1998-12-15","expirationDate":"1999-04-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["522399"],"PO":["335186"]},"36000":{"abstract":"In this exploratory research, an attempt is being made to understand the generic scientific task of classification. This task is perhaps somewhat better understood than discovery, which has previously been studied by the same PI. In the AI field, much research is going on in induction of classifications and in classification learning. But it is important to augment what is discovered in these areas by looking at two other important aspects of classification: describing classifications (i.e., developing a good model of the classification scheme), and relating a classification to new criteria (e.g., relating a biological classification based on characteristics or serology to one based on DNA). This work will lead to a better understanding of the cognitive aspects of classification, as well as to new computational tools for aspects of classification that can be used by scientists in a variety of disciplines.","title":"SGER: Concise, Intelligble, and Approximate Modeling of Large Classifications in Natural and Social Science","awardID":"9819340","effectiveDate":"1998-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["428481"],"PO":["565227"]},"35660":{"abstract":"A one day meeting called the East Coast Computer Algebra Day will be held at North Carolina State University (NCSU) in Raleigh on Saturday, April 24, l999.<br\/><br\/>The purpose of this meeting is to stimulate interest in and enhance understanding of the technical aspects of computer algebra, by providing a way for those in the region who are active or interested in becoming more active in computer algebra to meet with each other in an inexpensive and easily accessible way. This meeting will be more informal than the annual ISSAC meetings, with ample time for unstructured interaction. Participation by the region's graduate students will be particularly encouraged through special invitation to contribute to the poster sessions, and through travel support. The meeting will have three invited speakers who have made outstanding contributions to the field of computer algebra. The speakers will anchor the meeting and will help attract participants. The invited talks and poster sessions contributed by the community are expected to cover the breadth of computer algebra: algorithms, software, and applications. The principle theme of the l999 meeting will be applications.","title":"East Coast Computer Algebra Day, April 24, l999, North Carolina State University, Raleigh, North Carolina","awardID":"9818360","effectiveDate":"1998-12-15","expirationDate":"1999-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["520532","550491","485433"],"PO":["187585"]},"35640":{"abstract":"9818319<br\/>Feng, Wu-chi<br\/>Jain, Raj<br\/>The Ohio State University<br\/><br\/>CISE Research Instrumentation: A Video-Based Testbed For Scientific Visualization and<br\/>Networking Research<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Video Networking Congestion Management for ATM,<br\/>- Video Streaming Protocols over ATM and Best-Effort Networks,<br\/>- An Image-Based Approach to Scientific Visualization, and<br\/>- High Performance Video Processing.<br\/><br\/>This award supports established, on-going research in scientific visualization, multimedia computing, and low-level networking in the Department of Computer and Information Science Department at the Ohio<br\/>State University by contributing to the acquisition of an SGI server and Octane workstation with Digital Video Option, several HP-based workstations, and two ATM switches. This dedicated video-based infrastructure will enable conducting research of a more experimental nature in an environment not devoted to the day-to-day computing requirements of the department. The scientific visualization research will bring together researchers from the OSU Medical Center and the Ohio Supercomputer Center to study advanced scientific visualization techniques for medical and high performance computing applications. This diverse<br\/>application space will allow the systems support researchers (multimedia computing and networking) to have access to new applications that require both high bandwidth and stringent end-to-end requirements.","title":"CISE Research Instrumentation: A Video-Based Testbed for Scientific Visualization and Networking Research","awardID":"9818319","effectiveDate":"1998-12-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["532762","518376","196100"],"PO":["301532"]},"33122":{"abstract":"Although much progress has been made in understanding the development and function of the visual cortex experimentally, the exact mechanisms are still not completely understood. With the advent of parallel supercomputers in the past few years, it has become viable to test theories about these mechanisms in detailed computational simulations. In the PIs previous project, a model of the primary visual cortex was developed that showed how the observed receptive fields, columnar organization, and lateral connectivity can arise through input-driven Hebbian self-organization. The current project continues the research in four directions: (1) The self-organizing model is extended to a hierarchy of visual representations, taking into account feedback from higher levels of visual processing. (2) Internal pattern generators are included in the model and the hypothesis that they implement genetic control over the self-organized structures is verified against data on chick imprinting and the development of face recognition in infants. (3) The hypothesis that visual illusions and aftereffects occur as a side effect of the adapting lateral interactions in the system is tested computationally. (4) The hypothesis that perceptual grouping occurs based on synchronization mediated by the lateral and feedback connections is tested, verifying that Gestalt phenomena emerge from self-organized interactions. The project lends strong computational support to the idea that the visual cortex is a continuously-adapting recurrent structure, and that perceptual phenomena such as face recognition, illusions, and grouping are its emergent effects.<br\/>http:\/\/www.cs.utexas.edu\/users\/nn\/pages\/research\/selforg.html","title":"Modeling Development and Perceptual Phenomena in the Visual Cortex","awardID":"9811478","effectiveDate":"1998-12-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["408627"],"PO":["564456"]},"35642":{"abstract":"9818322<br\/>Dickinson, Sven<br\/>Stevenson, Suzanne<br\/>New Brunswick, NJ 08854-8010<br\/><br\/>A Laboratory for Interactive Applications of Computational Vision and Language<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Visual Object Recognition and its Applications to Robotic Aids for the Disabled,<br\/>- Model-Based Estimation, Tracking, and Recognition for Observing Human Activities,<br\/>- Evaluating Interactive Systems Based on Natural Language Generation, and<br\/>- Resolving Ambiguities in Interactive Instructions.<br\/><br\/>This award supports established, on-going research in computer science and engineering at Rutgers University and contributes to the purchase of a Minolta 3-D laser scanner\/object modeler, a Nomadics Technologies XR4000 Robotic Arm and Stereo Vision Upgrade, a Vision One Video Tracking Platform, four STW Linux-based PC's, and a membership in the Linguistic Data Consortium (a source of text corpora). The equipment forms the basis for a new Laboratory for Interactive Applications of Computational Vision and Language, directed by the four PIs, and will be shared among four collaborative research projects spanning the areas of computer vision and natural language processing: (1) the integration of object recognition and language understanding in a robotic system for the disabled; (2) the development of integrated vision systems that combine estimation, tracking, and recognition of both objects and events in a model-based framework; (3) the design of a video analysis system for evaluating automatically generated instructions; and (4) the development of automatic ambiguity resolution procedures for natural language instructions. In each case, the resulting technologies are embedded within human-computer interfaces, thereby taking a step toward achieving the goal of more natural interactive systems.","title":"CISE Research Instrumentation: A Laboratory for Interactive Applications for Computational Vision and Language","awardID":"9818322","effectiveDate":"1998-12-15","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["474118","355043","140208",89656],"PO":["301532"]},"49107":{"abstract":"","title":"U.S.-France Cooperative Research (INRIA): Static Types for Reasoning about Concurrent Systems","awardID":"9996084","effectiveDate":"1998-12-01","expirationDate":"2001-07-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"5980","name":"WESTERN EUROPE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["563479"],"PO":["323582"]},"36611":{"abstract":"This proposal seeks to conduct a workshop on the subject of \"next generation networking.\" The target audience for the workshop is the \"next tier\" of institutions beyond those that NSF presently serves via its High Performance Connections Program. Issues for this community include: how to plan for advanced high performance networking, how to budget for and finance same, how to prepare technologically, and how to identify needs and requirements. The workshop will involve networking experts together with representatives from \"next tier\" institutions in analyzing these questions. A report will be produced for public consumption and for NSF to use in planning for future network infrastructure programs.","title":"Preparing America","awardID":"9820976","effectiveDate":"1998-12-15","expirationDate":"2000-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["547713",92249,"106147"],"PO":["198445"]},"39626":{"abstract":"This award is to fund travel by two researchers from Sookmyung Women's University in Seoul, South Korea to the Language Technologies Institute of Carnegie Mellon University. The purpose of this visit is to continue bilateral discussions related to agent-based cross-language information retrieval.. The two groups have held preliminary discussions over the past year, and anticipate forming a collaborative research project. Korean language offers many important and unique research challenges to digital libraries research. Solutions for information merging and retrieval from Korean\/English corpora can be generalized to other non-character based languages, including Japanese and Chinese.","title":"Planning Grant: International Collaboration on Cross-Language Information Retrieval","awardID":"9901650","effectiveDate":"1998-12-15","expirationDate":"1999-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["338010"],"PO":["433760"]},"39428":{"abstract":"This workshop is intended to bring together a distinguished group of research scientists\/educators and industry experts to explore the role of wireless\/tetherless communications in the global economy of the future, and to develop recommendations for future research and development. The goal of the meeting is to provide answers to the question, \"What research needs to be done to achieve full T3 via the wireless medium by 200X?\"","title":"Toward T3 Tetherless Communications Workshop, University of Colorado, Denver, Colorado, November 19-20, l998","awardID":"9901083","effectiveDate":"1998-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":[100028],"PO":["188393"]},"35644":{"abstract":"9818327<br\/>Das, Chita R.<br\/>Sivasubramanian, Anand<br\/>Pennsylvania State University<br\/><br\/>A Low-Cost, High Performance Computing Platform<br\/><br\/>This research instrumentation enables research projects in:<br\/>- Efficient Communication and Scheduling Support for a Network of Workstations,<br\/>- High Performance Geographical Information Systems,<br\/>- High Performance Scientific Calculations Based on Unstructured Mesh Discretizations, and<br\/>- Application Communication Characterization.<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of Pentium machines and Myrinet hardware to set up a cost-effective Network of Workstations (NOW) platform which will be<br\/>dedicated to support research in computer and information science and engineering by the Department of Computer Science and Engineering at Pennsylvania State University. The experimental platform will be used for several research projects, including in particular, the four cited above. The first project focuses on deriving efficient software mechanisms for communication and scheduling for parallel applications. The second interdisciplinary research project plans to develop a High Performance Temporal Geographical Information System (GIS) on the NOW platform. The third project proposes to use this platform for developing efficient algorithms for unstructured mesh computations. The last project aims at characterizing the communication behavior of many applications.","title":"CISE Research Instrumentation: A Low-Cost, High Performance Computing Platform","awardID":"9818327","effectiveDate":"1998-12-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["550859","542015"],"PO":["301532"]},"35637":{"abstract":"9818313<br\/>Flanagan, James L.<br\/>Krane, Michael<br\/>Rutgers University - Busch Campus<br\/><br\/>CISE Research Instrumentation: Speech Synthesis from Fluid Dynamic Principles,<br\/>with Application to Human-Computer Interaction<br\/><br\/>This research instrumentation enables research projects in:<br\/><br\/>- Synergistic Multi-modal Communication in Collaborative Multi-user Environments, and<br\/>- Speech Synthesis Based upon Fluid Dynamics Principles<br\/><br\/>To support the aforementioned projects, this award contributes to the purchase of image acquisition, networking, visualization, and speech processing equipment at Rutgers University CAIP Center.<br\/><br\/>Advanced human-machine interfaces employ multiple modalities through which a human user can communicate effectively with computers and complex information systems. Interactive speech (in the form of automatic recognition and synthesis) is a natural modality, which improves the effectiveness of human-machine interfaces. However, advances in speech technology have been limited due to incomplete understanding of the physical mechanisms of human speech generation. A particular deficit has been the lack of naturalness in speech synthesis. Equipment to be instrumented under this proposal will directly enable research on the synthesis of natural quality speech using a more complete description of the fundamental physics of speech generation (NSF contract #IRI-98-00999). The instrumentation will also support research on multi-modal workstations with which human users interact using sight, sound, and touch (NSF contract #IRI-96-18854). Additionally, the proposed instrumentation will enhance the effectiveness of the speech component in multi-modal interfaces through visual tracking. And, the speech interface will directly benefit from a machine voice that exhibits improved human-like quality.","title":"CISE Research Instrumentation: Speech Synthesis from Fluid Dynamic Principles, with Application to Human-Computer Interaction","awardID":"9818313","effectiveDate":"1998-12-15","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["271309","487723","409115","328359"],"PO":["301532"]},"31668":{"abstract":"The goal of this research is to develop algoithms and tools for modeling hardware and software using a high-level programming language, or an HDL, and use it to develop algorithms for language-level \"presynthesis\" optimizations. Research activities being carried out under this grant include: (a) indentify semantic support for modeling reactive and structural components in a high-level language that preserves synthesizability of the resulting description; (b) explore the nature of the Don't Care (DC) information an design assertions that are used to optimize an HDL description; develop appropriate models to capture the DC information; (c) develop a tabular model of system behavior called. Timed Decision Tables (TDTs); (d) use TDT model transformations to restructure and rewrite HDL code for improved synthesis results. The research results are being used to develop a framework for language-level exploration and optimization of design alternatives for microelectronic systems.","title":"Efficient HDL Modeling and Presynthesis Optimizations for Embedded Systems","awardID":"9806898","effectiveDate":"1998-12-01","expirationDate":"2001-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["457653"],"PO":["564898"]},"37919":{"abstract":"Both humans and non-human primates show remarkable learning abilities. However, these abilities are often limited to certain domains, developmental periods, or behavioral contexts. For example, nearly all humans acquire one or more complex linguistic systems-that is, languages -- but not all humans acquire complex musical systems. Similarly, non-human primates are exceptionally adept at learning to forage for and categorize different types of food, but are severely limited in acquiring complex communication systems. Also, both humans and non-human primates appear to learn best in several domains during early periods of development. Thus, learning is nearly always characterized by specializations, rather than by general-purpose mechanisms. Understanding the constraints on learning will contribute to basic research, by accounting for domain- and species-specializations, and to applied research, by refining our understanding of which domains, ages, and contexts are optimal for human<br\/>learners.<br\/><br\/>The goal of the present research project is to explore the ability of human adults, children, infants, and non-human primates (Tamarins) to learn rapid sequential events. A prime example of a rapid sequential event is language, in which sounds are combined to form words, and words are combined to form sentences. Recent findings have demonstrated that human adults and infants can rapidly extract and remember very detailed 'statistics' of linguistic input, such as the frequency and probability that one syllable will follow another. In our proposed research, we will employ miniature artificial 'languages' which simulate some of the structural properties of natural languages, but which can be built with equivalent structures across different domains (speech sequences, tone sequences, visual sequences, motor sequences). At issue is the facility humans and non-human primates show for the extraction of statistical structure from these different learning materials. Are they equally sensitive to the distributions of elements and higher order structure in the materials? Do learning abilities differ across learners of different ages and species, and across different structures and domains?<br\/><br\/>In addition to behavioral experiments with humans and non-human primates, a series of computational studies will allow us to investigate the formal properties of learning mechanisms, in order to ask what architectural and neural differences might underlie such differences in learning abilities. What kinds of computational architectures can learn the types of regularities and patterns that human infants learn? Is the inability of adults or non-human primates to learn some types of complex sequential events due to the absence of a learning device specialized for that domain, or could small differences in computation and\/or memory lead to large differences in learning outcome?","title":"KDI: Statistical Learning and Its Constraints","awardID":"9873477","effectiveDate":"1998-12-01","expirationDate":"2002-11-30","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"8876","name":"KDI OPPORTUNITY FUND"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}}],"PIcoPI":["558225","190828","405518","345620"],"PO":["221403"]}}