{"92911":{"abstract":"This award by the Division of Chemistry in the Directorate for Mathematical and Physical Sciences, the Division of Integrative Biology and Neuroscience in the Directorate for Biological Sciences, the Division of Behavioral and Cognitive Sciences in the Directorate for Social, Behavioral and Economic Sciences, the Division of Computer and Network Systems and the Division of Information and Intelligent Systems in the Directorate for Computer and Information Science and Engineering, and the Division of Chemical and Transport Systems in the Directorate for Engineering, supports a Workshop on \"Models of Thought Processes: Insights toward Chemical Systems\" to be held at the National Science Foundation in June 20-22, 2004.<br\/><br\/>This workshop will bring together scientists from several disciplines to explore how chemistry may offer insights into and models for such key processes as learning, memory, motor control, integration of sensors, signaling, computation and how knowledge gained about these processes from other areas of science may open up new and exciting areas for chemists. Invited participants from a range of fields, including chemistry, biology, neuroscience, cognitive science, computer science, mathematics, physics, and engineering will engage in half-day sessions devoted to different aspects of learning and other processes and in a final session to summarize and synthesize the questions and insights that have arisen. <br\/><br\/>Participants will be asked to prepare materials before the workshop that will highlight key issues for cross-disciplinary attack. A workshop summary and final report will be prepared that will survey particularly promising directions and approaches. Specific areas to be addressed are: 1) chemically and biologically based approaches to computation; 2) models of learning in chemical systems; 3) transmission of information at the local (synaptic) and global (network) levels; 4) synthesis and analysis of key molecules and structural elements important in learning, memory, computation, sensing and signaling. A professional science writer will be employed to assist with preparing pre-workshop materials and the final report, and to craft materials for press releases and other forms of public dissemination. <br\/><br\/>The broader impact of this workshop includes its exploration of the diversity of scientific thought in this inherently interdisciplinary area, with strong prospects for generating new collaborations across fields. A small number of postdoctoral and\/or advanced graduate students will be invited to attend including individuals from underrepresented groups. The results of the workshop will be made available on a publicly accessible website. Other goals include the identification of areas in which a multidisciplinary, multilevel approach is likely to yield significant new insights, and initiation of interdisciplinary collaborations, which may be relevant to several interdisciplinary NSF programs.","title":"Workshop on Models of Thought Processes: Insights Toward Chemical Systems; June 20-23, 2005; Arlington, VA","awardID":"0403126","effectiveDate":"2004-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0309","name":"Division of CHEMISTRY","abbr":"CHE"},"pgm":{"id":"1980","name":"PROGRAM SUPPORT"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0404","name":"Division of BEHAVIORAL AND COGNITIVE SCI","abbr":"BCS"},"pgm":{"id":"1699","name":"COGNEURO"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1401","name":"CATALYSIS AND BIOCATALYSIS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"5500","name":"NEURAL SYSTEMS CLUSTER"}}],"PIcoPI":["448902"],"PO":["299150"]},"90327":{"abstract":"CNS-0347252 <br\/> <br\/>CAREER: A Multiresolution Approach to Network Anomaly and Intrusion Detection<br\/><br\/>Paul Barford<br\/><br\/>This project aims to measure traffic and detect anomalies and intrusions in wide area networks. The measurements will support precise, real-time identification of anomalies\/intrusions, enabling future networks to function securely and efficiently--something that is seriously threatened in today's hostile and dynamic environment. New, in-situ measurement systems will be built and deployed to collect traffic data from many locations across the Internet and store it in a centralized repository in an anonymized, privacy preserving format. Research access to the data will be provided through a private, secure web interface. In conjunction with the measurement and data collection activity, the research will develop multiresolution analysis methods based on wavelets, which isolate distinct traffic characteristics in both frequency and time, thus enabling accurate and timely detection of anomalies\/intrusions. A library of measurement\/analysis tools and the data repository will be made available to the research community. This project will also develop a series of laboratory experiments to provide secondary and university students a hand-on means of learning about the Internet. This effort involves collaboration on both the measurement and analysis activities with network operators, researchers in industry and researchers in disciplines outside of networking including applied math, statistics and signal processing.","title":"CAREER: A Multiresolution Approach to Network Anomaly and Intrusion Detection","awardID":"0347252","effectiveDate":"2004-04-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["402290"],"PO":["529429"]},"94904":{"abstract":"Workshop on Real Algebraic Geometry in Geometric Modeling<br\/><br\/>This workshop is on the current and potential interactions between geometric modeling and real algebraic geometry, particularly real algebraic geometry, as it is embedded in a larger program at the Mathematical Sciences Research Institute (MSRI) on real algebraic geometry. It is held on April 3 and 4, 2004 during a period of activity at MSRI on applications of real algebraic geometry. The workshop brings experts from the United States and Europe to interact with the MSRI community for this weekend and the week following the workshop.<br\/><br\/>This workshop explores, for the first time, the role of real algebraic geometry in geometric modeling; the basic objects in geometric modeling---surface patches or a Bezier curves---are objects in real algebraic geometry. It also strengthens recent, mutually beneficial interactions between geometric modeling and algebraic geometry, specifically in implicitization and the development of exotic toric surface patches. In particular, there are mathematical challenges posed by toric surface patches that need to be clarified and addressed before they can begin to fulfill their promise. This is first workshop in the US on such interactions and will influence the evolution of these scientific links in US.","title":"Workshop on Real Algebraic Geometry in Geometric Modeling","awardID":"0412858","effectiveDate":"2004-04-15","expirationDate":"2004-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["510114","441633"],"PO":["321058"]},"94827":{"abstract":"This grant requests funds to support the inaugural International Conference on Continuous Optimization, to be held on the campus of Rensselaer Polytechnic Institute from Monday August 2, 2004 through Wednesday August 4, 2004. The Conference will be preceded by a two-day Summer School, in which several distinguished scholars will offer tutorials on contemporary topics in continuous optimization. The School will be attended by advanced graduate students and postdoctoral fellows on the recommendation of their supervisors. The intellectual merit of the proposed activity is that it will provide a stimulus for sustained research in continuous optimization, which is a fertile scientific\/engineering discipline with immense practical applications. Among its broader impacts, the proposed activity will have a significant affect on cyber infrastructure.<br\/><br\/>Continuous optimization has played, and continues to play, a major role in advancing and impacting the contemporary developments of many scientific and engineering disciplines, and provides a fundamental set of mathematical and computational tools that are key for many real-world decision support systems and modeling applications, which in turn are vital for the sustained growth of the economy and for the well being of society. The goal of the Conference is threefold: (a) to provide a focused forum for US and international researchers and practitioners to meet in order to facilitate the rapid exchange of state-of-the-art results and promising ideas to ensure the healthy advancement of continuous optimization, (b) to offer educational opportunities to graduate students and junior researchers to learn about the latest developments in continuous optimization, and (c) to encourage women and minority researchers to work in this important area of Operations Research and Computational Science. The Conference will facilitate the discussion and dissimilation of the latest results in continuous optimization, will inspire new ideas and sharpen existing ones, will advance scientific knowledge and increase the general population's awareness of optimization, and will attract new talents to work in the discipline. The end benefits to society are that complex scientific, engineering, financial, and economic problems can be better modeled and solved, and human resources can be gainfully utilized.","title":"International Conference of Continuous Optimizatio; August 2-4, 2004; RPI, Troy, NY","awardID":"0412377","effectiveDate":"2004-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0703","name":"Division of CIVIL, MECHANICAL, & MANUFACT","abbr":"CMMI"},"pgm":{"id":"5514","name":"OPERATIONS RESEARCH"}}],"PIcoPI":["564987","381805","554109"],"PO":["351577"]},"91737":{"abstract":"Institution: West Virginia University<br\/>Proposal Number: 0353806<br\/>PI: Frances L. Van Scoy<br\/>Title: REU Site: Virtual Environments REU Site<br\/><br\/>This project establishes an REU site focusing on virtual environments and multisensory computing. It will build on a prior REU Site award to establish undergraduate research internships in on-going research projects at West Virginia University. The interns will also participate in semi-weekly classes on virtual technology at the Virtual Environments Lab (VEL). Projects will include research in functional brain imaging; computational materials science; integration of geographical information systems (GIS) with virtual reality; and applications of advanced visualization technology in biometrics. The interns will work in teams of mentors, graduate students, other undergraduates, and sometimes high school students. <br\/><br\/>The project will support 11 students per year for a 10-week research internship. The PI will continue to recruit interns from Puerto Rico as she has in the past. The program will also emphasize student presentations and publication.","title":"REU Site: Virtual Environments REU Site","awardID":"0353806","effectiveDate":"2004-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["271025"],"PO":["317663"]},"90418":{"abstract":"NCS-0347661<br\/>CAREER: Efficient Cryptographic Protocols for Secure and Private Cryptographic Transactions<br\/>PI: Anna Lysyanskaya<br\/><br\/>A typical computer user performs a multitude of electronic transactions each day: reading e-mail, managing bank accounts, making on-line purchases, to name a few. Each of them must be secure: they should be carried out by authorized users only, and the information entered must be authentic. On the other hand, each transaction should be private: personal information or account balances should not become available without a user's explicit consent. Since data aggregation is simple to do, it is highly desirable to limit the information transmitted in each transaction to a bare minimum without compromising its authenticity.<br\/><br\/>Cryptographic schemes that make this possible are the intended direct outcome of this research. This project investigates the security requirements of the basic protocols that a system for secure and private electronic transactions would comprise and develops efficient and provably secure digital signature schemes and other primitives that lend themselves to the design of such protocols. The chief method for achieving these results is to build upon existing highly theoretical foundations using practical buiding blocks.<br\/><br\/>Since this project develops provable guarantees that personal information will not be abused, its broader impact is in protecting the privacy of computer users.","title":"CAREER: Efficient Cryptographic Protocols for Secure and Private Electronic Transactions","awardID":"0347661","effectiveDate":"2004-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["448713"],"PO":["497499"]},"91827":{"abstract":"Institution: Columbus State University<br\/>Proposal Number: 0354144<br\/>PI: Mei Yang<br\/>Title: REU Site: Research Experiences for Undergraduates - Emerging Issues in Computer Networking<br\/><br\/>This project establishes an REU site for eight undergraduates yearly for two years to conduct research in computer networking. Research topics will include switch scheduling, QoS in networking, wireless applications, network security, grid computing, and web services. In addition to the summer, fulltime research internships, a unique feature of this proposed project is an independent study course for one to three credit hours for students in the Spring semester before they begin their internships. The course will be guided by one of the summer faculty mentors, and will be designed to help students develop an interest in one of the research topics offered in the summer project. The PI will reach out to regional 2- and 4-year institutions to recruit her interns, thus creating positive relationships among the higher educational institutions in this rural region.","title":"REU Site: Research Experiences for Undergraduates - Emerging Issues in Computer Networking","awardID":"0354144","effectiveDate":"2004-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["240616",240616,"240618",240618,"491031"],"PO":["564181"]},"81808":{"abstract":"ACI-0305496 PI: YAU<br\/>ACI-0305537 PI : HOU<br\/>ACI-0305768 PI : YAO<br\/><br\/>In this project, we propose to design, implement, and evaluate a component-based software environment for<br\/>simulating and emulating network protocols in a systematic manner, and for a wide variety of target network<br\/>architectures. We will also explore the use of the developed protocol components on a software-programmable<br\/>router platform. The software environment has been built upon a component-based software architecture, called<br\/>autonomous component architecture (ACA), that deploys a message-passing, independent execution model to<br\/>realize the notion of software IC. On top of ACA, a packet-based network modeling framework, called extensible<br\/>internetworking framework (EIF), has been laid to de?ne generic network components that are general enough<br\/>to accommodate future technology advances. To demonstrate the use of ACA and EIF, we have implemented in<br\/>Java both ACA and EIF, and an (almost) complete suite of essential Internet protocols in the Internet best-e?ort<br\/>service, integrated services, and di?erentiated services architectures. The resulting code, along with a scripting<br\/>framework, constitutes a network simulation environment called JavaSim.<br\/><br\/><br\/>Dr. Frederica Darema<br\/>July 30, 2003","title":"NGS: Collaborative Research: A Component-based Software Environment for Simulation, Emulation, and Synthesis of Network Protocols in Next Generation Software","awardID":"0305537","effectiveDate":"2004-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["563534","563534","342042"],"PO":["551712"]},"79171":{"abstract":"Proposal Number: IIS-0241229<br\/>Principal Investigator: Thomas Moritz<br\/><br\/>This international collaborative project proposes to design and test approaches to mark-up and extraction of scientific date from a corpus drawn from the biosystematics literature of entomology (ants) and to develop a set of applications bases on an ontology for this topical area. Ontologies for natural history information are particularly complex because of the diversity of the source material and selected descriptors. The project will build on digital library work underway at the American Museum of Natural History, on biological informatics at Ohio State University and computer science at Universitat Magdeburg in Germany. The project is jointly sponsored by the German Deutsche Forschungsgemeinschaft.<br\/><br\/>Biosystematics is the science that provides the definitional foundations for organismic biology and for the applied science of biodiversity conservation. Within zoological systematics, insects are a uniquely important group of organisms with major impacts on human health and economics; ants constitute a particularly important group of social insects accounting for a major part of the biomass in tropical rainforests and displaying remarkable diversity and behavioral variation. This proposal is designed to test approaches to mark-up and extraction of scientific data from a corpus of texts drawn from the biosystematics literature of entomology (ants) and to develop a set of applications including powerful search and retrieval strategies to operate on this corpus. Specifically, approaches to automated XML mark-up will be tested using NMNH hypothesized Taxon-X Schema (derived from the implicit structure of scientific publications in biological systematics and already under development at AMNH). Then the corpus of marked-up literature will be used to explore the automated extraction and application of imbedded scientific data including scientific names, morphological characters, species distribution data (for plotting in GIS and contribution to the emerging world database of biological diversity) and collection locales\/events for inclusion in a gazetteer of collecting events.<br\/><br\/>Accomplishment of these goals will result in increased worldwide access and usefulness of an extensive body of scientific literature that is now generally restricted to users who have access to major research libraries. The project will also stimulate interdisciplinary interaction between computer scientists and domain specialists in a field that stands to benefit greatly from IT research. The core work of this project will contribute to global efforts to design and implement of similar, general purpose ontological services capable of supporting biological and conservation education at all levels. These project can contribute to research and education in biology by prototyping a model by extending the practical usefulness of the enormous body of legacy literature in biosystematics and contributing to the completion and continuing updating of international biodiversity databases. The corpus of literature to be made available on the Web -- as well as the methodology and protocols for managing them -- occurring in the context of the Commonsphilosophy can create a new model for international access to this literature offering access to biosystematics libraries to those who have never before had such resources available.","title":"Collaborative Research: Development of New Digital Library Applications in the Context of a Aasic Ontology for Biosystematics Information Using the Literature of Entomology (Ants)","awardID":"0241229","effectiveDate":"2004-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":["206159",206159,"546736","427492","427492","326520"],"PO":["433760"]},"97150":{"abstract":"This proposal explores a new space-time architecture called Stacked Orthogonal Space Time (SOST) for designing coding\/modulation schemes and associated signal processing and decoding algorithms for multi-input multi-output (MIMO) wireless channels. It combines the complimentary properties of two well-known architectures based on orthogonal designs and vertical layering (V-BLAST). Unlike orthogonal designs, SOST is well-suited for systems with several receive antennas and would perform well at large fractions of the capacity. Unlike V-BLAST, the SOST architecture can provide full diversity and excellent performance at small multiplexing gains.","title":"SGER: An Exploration of MIMO Communication via the Optimization of a Novel Space-Time Architecture","awardID":"0423842","effectiveDate":"2004-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["508378"],"PO":["348215"]},"86472":{"abstract":"A daunting challenge is the evolution from today's computational Grid to a true cyberinfrastructure that <br\/>seamlessly integrates resources ranging from small clusters in academic laboratories to the largest <br\/>national supercomputing centers and provides ubiquitous access to high performance computing, <br\/>research instrumentation, data warehouses and visualization. Realization of this future requires <br\/>fundamental advances in transparent fault recovery mechanisms to mask component failures endemic <br\/>to any large-scale computational resource. While previous generations of supercomputers engineered <br\/>reliability into systems hardware, today's high performance computing (HPC) environments are based <br\/>on clusters of COTS components, with no systemic solution for the reliability of the resource as a <br\/>whole. Engendering stability in ever growing networked collections of cluster systems needs a <br\/>software solution that provides reliable access to computing resources through transparent, efficient, <br\/>and automatic checkpointing and recovery (CPR) mechanisms. This propoject aims to bring about this future through radically new approaches to longstanding problems in CPR and process migration by building an integrated system called Daja vu. Daja vu provides (a) a transparent parallel checkpointing and recovery mechanism that recovers from any combination of systems failures without any modification to parallel applications. (b) a novel post-compiler analysis system that transparently captures application state, (c) a systems architecture that seamlessly integrates user-initiated and system-initiated checkpoints in a single framework enabling the effective use of a wide variety of domain specific knowledge, (d) novel runtime mechanisms for transparent incremental checkpointing, to efficiently capture the least amount of state required to maintain global consistency, (e) a novel communications architecture that enables transparent migration of existing MPI\/PVM codes without source-code modifications to either the application or the MPI\/PVM libraries, (f) recoverable IO subsystems that can be tailored to specific storage environments, and (g) interfaces to and augmentation of the Globus Toolkit to effectively use the CPR and migration capabilities provided by this research. The core CPR and migration facilities of Deja vu will be surrounded by management, security, and scheduling facilities that (a) integrate with local scheduling systems (e.g., OpenPBS) and accounting systems for site-specific accounting and refunding of lost compute cycles and (b) extend the Globus security architecture with fine grain rights and dynamically created user accounts that allow the fluid resource control available under the Deja vu system to be fully exploited. <br\/>The design goal of this project is not just to implement \"point\" solutions, but an integrated system that will constitute a fundamental component of both large-scale computing facilities and Grid infrastructures. Our <br\/>research team (VT, PSC, ISR) has considerable experience in the design, development, deployment <br\/>and support of complete solutions.","title":"Collaborative Research: ITR\/NGS: Deja Vu: Transparent Checkpointing and Migration of Parallel Codes Over Grid Infrastructures","awardID":"0325534","effectiveDate":"2004-04-15","expirationDate":"2009-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["493880","309296","309299"],"PO":["561889"]},"86395":{"abstract":"A daunting challenge is the evolution from today's computational Grid to a true cyberinfrastructure that seamlessly integrates resources ranging from small clusters in academic laboratories to the largest national supercomputing centers and provides ubiquitous access to high performance computing, research instrumentation, data warehouses and visualization. Realization of this future requires fundamental advances in transparent fault recovery mechanisms to mask component failures endemic to any large-scale computational resource. While previous generations of supercomputers engineered reliability into systems hardware, today's high performance computing (HPC) environments are based on clusters of COTS components, with no systemic solution for the reliability of the resource as a whole. Engendering stability in ever growing networked collections of cluster systems needs a software solution that provides reliable access to computing resources through transparent, efficient, and automatic checkpointing and recovery (CPR) mechanisms. <br\/>This project aims to bring about this future through radically new approaches to longstanding problems in CPR and process migration by building an integrated system called Deja vu. Deja vu provides (a) a transparent parallel checkpointing and recovery mechanism that recovers from any combination of systems failures without any modification to parallel applications. (b) a novel post-compiler analysis system that transparently captures application state, (c) a systems architecture that seamlessly integrates user-initiated and system-initiated checkpoints in a single framework enabling the effective use of a wide variety of domain specific knowledge, (d) novel runtime mechanisms for transparent incremental checkpointing, to efficiently capture the least amount of state required to maintain global consistency, (e) a novel communications architecture that enables transparent migration of existing MPI\/PVM codes without source-code modifications to either the application or the MPI\/PVM libraries, (f) recoverable IO subsystems that can be tailored to specific storage environments, and (g) interfaces to and augmentation of the Globus Toolkit to effectively use the CPR and migration capabilities provided by this research. The core CPR and migration facilities of Deja vu will be surrounded by management, security, and scheduling facilities that (a) integrate with local scheduling systems (e.g., OpenPBS) and accounting systems for site-specific accounting and refunding of lost compute cycles and (b) extend the Globus security architecture with fine grain rights and dynamically created user accounts that allow the fluid resource control available under the Deja vu system to be fully exploited. The design goal of this project is not just to implement \"point\" solutions, but an integrated system that will constitute a fundamental component of both large-scale computing facilities and Grid infrastructures. Our research team (VT, PSC, ISR) has considerable experience in the design, development, deployment and support of complete solutions.","title":"Collaborative Research: ITR\/NGS: Deja Vu: Transparent Checkpointing and Migration of Parallel Codes Over Grid Infrastructures","awardID":"0325182","effectiveDate":"2004-04-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["292961"],"PO":["551712"]},"89840":{"abstract":"This award to the National Academy Sciences provides partial support for the \"Core Research Activities and Studies of the Computer Science and Telecommunications Board (CSTB)\". The CSTB is an objective, nonpartisan analytical entity. Blending expertise in computer science, electrical engineering, telecommunications, and various applications and impacts of information technology, CSTB is both comprehensive and focused. It engages experts from the research community and elsewhere in mixed collaborative groups, developing ideas, explanations and recommendations reflecting diverse points of view and rigorous review. It is a focal point for engaging the research community in the development of new research agendas and in raising the level of policy debate, a source of strategic thinking for research funding agencies, and an exponent of how and why IT research should be done. Core support provides for the continuing costs of maintaining the basic activities of the CSTB; it enables the Board to exist and to plan, oversee, and follow up on projects.","title":"Support for the Core Research Activities and Studies of the Computer Science and Telecommunications Board","awardID":"0344585","effectiveDate":"2004-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"T199","name":"HOMELAND SECURITY-CSTB"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1713","name":"WORKFORCE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"V825","name":"SSA-E GOVT STRATEGY"}}],"PIcoPI":["298189",235705,"298190","560890"],"PO":["564181"]},"86474":{"abstract":"A daunting challenge is the evolution from today's computational Grid to a true cyberinfrastructure that seamlessly integrates resources ranging from small clusters in academic laboratories to the largest national supercomputing centers and provides ubiquitous access to high performance computing, research instrumentation, data warehouses and visualization. Realization of this future requires fundamental advances in transparent fault recovery mechanisms to mask component failures endemic to any large-scale computational resource. While previous generations of supercomputers engineered reliability into systems hardware, today's high performance computing (HPC) environments are based on clusters of COTS components, with no systemic solution for the reliability of the resource as a whole. Engendering stability in ever growing networked collections of cluster systems needs a software solution that provides reliable access to computing resources through transparent, efficient, and automatic checkpointing and recovery (CPR) mechanisms. This project aims to bring about this future through radically new approaches to longstanding problems in CPR and process migration by building an integrated system called Deja vu. Deja vu provides (a) a transparent parallel checkpointing and recovery mechanism that recovers from any combination of systems failures without any modification to parallel applications. (b) a novel post-compiler analysis system that transparently captures application state, (c) a systems architecture that seamlessly integrates user-initiated and system-initiated checkpoints in a single framework enabling the effective use of a wide variety of domain specific knowledge, (d) novel runtime mechanisms for transparent incremental checkpointing, to efficiently capture the least amount of state required to maintain global consistency, (e) a novel communications architecture that enables transparent migration of existing MPI\/PVM codes without source-code modifications to either the application or the MPI\/PVM libraries, (f) recoverable IO subsystems that can be tailored to specific storage environments, and (g) interfaces to and augmentation of the Globus Toolkit to effectively use the CPR and migration capabilities provided by this research. The core CPR and migration facilities of Deja vu will be surrounded by management, security, and scheduling facilities that (a) integrate with local scheduling systems (e.g., OpenPBS) and accounting systems for site-specific accounting and refunding of lost compute cycles and (b) extend the Globus security architecture with fine grain rights and dynamically created user accounts that allow the fluid resource control available under the Deja vu system to be fully exploited. <br\/>The design goal of this project is not just to implement \"point\" solutions, but an integrated system that will constitute a fundamental component of both large-scale computing facilities and Grid infrastructures. Our research team (VT, PSC, ISR) has considerable experience in the design, development, deployment and support of complete solutions.","title":"Collaborative Research: ITR\/NGS: Deja Vu: Transparent Checkpointing and Migration of Parallel Codes Over Grid Infrastructures","awardID":"0325540","effectiveDate":"2004-04-15","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["254995","283026","283028"],"PO":["551712"]},"89521":{"abstract":"Coevolution plays a central role in shaping biological diversity, molding the structure of biological communities, and driving tight coadaptation between interacting species. Over shorter ecological time scales coevolution also generates chronic maladaptation and maintains substantial levels of genetic polymorphism. The geographic mosaic theory of coevolution provides a unifying framework for these disparate aspects of the coevolutionary process. The overarching goal of this proposal is to develop a rigorous theoretical backbone for this theory. This will be achieved through the application of recently developed mathematical techniques that greatly simplify the analysis of complex genetic systems. <br\/><br\/>The broader impacts of the proposed work are twofold. First, the models will extend previously developed mathematical techniques to coevolving systems. The result will be the development of new and powerful analytical tools that can be readily applied to a diverse array of problems in coevolutionary biology. The distribution of this analytical technology will be facilitated by public presentation of techniques at annual meetings, and by the publication of electronic Mathematica appendices. Second, the training component of the proposed work will introduce two graduate students and an undergraduate to these new mathematical techniques, as well as other computational and analytical approaches. This training will directly contribute to the increased integration of analytical and computational techniques in the biological sciences.","title":"QEIB: General Genetic Models of the Geographic Mosaic Theory of Coevolution","awardID":"0343023","effectiveDate":"2004-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1127","name":"EVOLUTIONARY PROCESSES CLUSTER"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1128","name":"POP & COMMUNITY ECOL CLUSTER"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1174","name":"POPULATION DYNAMICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["487140"],"PO":["406317"]},"97410":{"abstract":"This is funding to support this year's HCI doctoral research consortium (workshop) of approximately 15 promising doctoral students from the United States and abroad, along with distinguished research faculty. The event will take place in conjunction with the ACM 2004 Conference on Human Factors in Computing Systems (CHI 2004), to be held April 24-29 in Vienna, Austria, and sponsored by the Association for Computing Machinery's Special Interest Group on Human Computer Interaction (SIGCHI). Goals of the workshop include building a cohort group of new researchers who will then have a network of colleagues spread out across the world, guiding the work of new researchers by having experts in the research field give them advice, and making it possible for promising new entrants to the field to attend their research conference. Student participants will make formal presentations of their work during the workshop, and will receive feedback from the faculty panel. The feedback is geared to helping students understand and articulate how their work is positioned relative to other human-computer interaction research, whether their topics are adequately focused for thesis research projects, whether their methods are correctly chosen and applied, and whether their results are appropriately analyzed and presented. Student participants will present their work to the doctoral consortium on April 25-26, with follow up activities to be held during the technical program of the CHI 2004 conference. Extended abstracts of the students' work will be published in the CHI 2004 Extended Abstracts, which has wide print and electronic distribution. SIGCHI's conference management committee will evaluate the doctoral consortium, and the results made available to the organizers of future consortia. The CHI doctoral consortia, which began in 1986, have been highly successful in providing a forum for the initial socialization into the field of young doctoral scholars, and many of today's leading HCI researchers participated as students in earlier consortia. <br\/><br\/>Broader Impacts: The annual CHI doctoral consortia traditionally bring together the best of the next generation of HCI researchers, allowing them to create a social network both among themselves and with senior researchers at a critical stage in their professional development. Because the students and faculty constitute a diverse group across a variety of dimensions, including nationality\/cultural and scientific discipline, the students' horizons are broadened to the future benefit of the field.","title":"ACM 2004 Conference Workshop: Human-Computer Interaction Doctoral Research Consortium; April 24-29, 2004; Vienna, Austria","awardID":"0425083","effectiveDate":"2004-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["551829"],"PO":["565227"]},"97300":{"abstract":"This award supports participants in a two-day symposium on reasoning and learning in cognitive systems to be held at Stanford University on March 20-21, 2004. The purpose of the symposium is to bring together researchers and students in order to allow them to share recent results from their own specialties within artificial intelligence and cognitive science, particularly about machine learning and reasoning, in order to foster collaborations and new research directions that reflect facets of cognitive systems currently overlooked in current research. A central aspect of the symposium will be invited talks and commentaries to be given by established researchers whose work provides a good sampling of research at the intersection of reasoning and learning.","title":"Symposium on Reasoning and Learning in Cognitive Systems; Palo Alto, CA","awardID":"0424601","effectiveDate":"2004-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["559662",255989],"PO":["491702"]},"95364":{"abstract":"SPAWC-2004, the fifth IEEE International Workshop on Signal Processing Advances for Wireless Communications will be held from July 11-14, 2004 at Hotel Tivoli - Tejo, in Lisbon, Portugal. The Workshop is devoted to recent advances in signal processing for wireless and mobile communications. This workshop brings together members of the signal processing, communications and information theory communities, working in universities, research centers and telecommunications companies. The meeting will feature keynote addresses by leading researchers, as well as invited and contributed papers","title":"V IEEE Workshop on Signal Processing Advances in Wireless Communications (SPAWC-2004)","awardID":"0414744","effectiveDate":"2004-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[250064],"PO":["564898"]},"89116":{"abstract":"EIA-0340851<br\/>Gwen Littlewort-Ford<br\/>Institution: University of California San Diego<br\/><br\/>Title: Theory and Application of Machine Perception to Understanding Human Behavior<br\/><br\/>This ADVANCE Fellows award provides support to explore facial recognition systems and their ability to recognize emotion based on facial expression and to apply a facial recognition system to education and cognitive disorders. The project has several significant goals including: mathematical analysis of neural and machine learning systems; engineering computer vision systems that provide information about human behavior in real world interactions, and furthering the understanding of human-computer interactions and the nature of tasks solved by the brain. <br\/><br\/>The intellectual merit of this project is centered in its strong research basis working with and extending the work of a leading research team. The proposal mentions several original concepts and possibilities that may significantly impact machine learning, computer vision, and HCI. The PI and the group with which she is working have excellent credentials and expertise to conduct such state-of-the art investigations and to then demonstrate the practical applications that result from the research. The project provides the PI with an environment to re-establish herself in her research field and position herself for a permanent academic position based on the contributions of the project to the scientific community.<br\/><br\/>The broader impacts include potential applications to benefit education and human potential development, among the many possible avenues for successful results. If successful, the research results could be applied to a number of everyday tasks, including online learning and medical diagnostic tools. It could open new learning opportunities and employment potential to individuals whose learning could be supported by the new technologies.","title":"ADVANCE Fellows Award: Theory and Application of Machine Perception to Understanding Human Behavior","awardID":"0340851","effectiveDate":"2004-04-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"7704","name":"Science of Learning Activities"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1681","name":"ADVANCE - FELLOWS"}}],"PIcoPI":[233701],"PO":["564181"]},"90381":{"abstract":"One of the biggest challenges to supporting communication in ad hoc networks is the limited battery life of mobile nodes. Current approaches to energy conservation in ad hoc networks narrowly focus on optimizations at only one layer, and some only focus on a specific mechanism in that layer. By ignoring the impact within a layer and on other layers, many approaches become ineffective and may even increase energy consumption. This research integrates optimizations across layers in the innovative Pulsar framework, resulting in network-wide energy-efficient communication. At the node layer, power control (i.e., dynamically changing transmission power levels) reduces the energy consumption for data transmissions. Additionally, power management (i.e., placing the device in a low-power sleep mode) reduces the energy consumed unnecessarily during idle periods in communication. At the routing layer, energy consumption is reduced by finding minimum energy routes, maximizing the number of nodes in low-power mode and reducing the overhead of the routing protocol. At the global layer, Pulsar uses topology control to reduce transmission energy consumption and alleviate contention in the network. Each of these techniques can save a significant amount of energy for an individual node, but given the cooperative nature of communication in ad hoc networks, energy conservation at one node may impact the entire network. Pulsar captures the relationships between layers and provides energy-efficient communication using intelligent MAC and routing protocols and distributed algorithms to manage high-level network goals. Further, this research is bringing novel wireless networking projects into the undergraduate and graduate curriculum.","title":"CAREER: Pulsar: A Cross-Layer Approach to Energy Conservation in Mobile Ad Hoc Networks","awardID":"0347468","effectiveDate":"2004-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["561785"],"PO":["434241"]},"91130":{"abstract":"Partnerships between mathematicians and social scientists have existed for a long time, but partnerships between computer scientists and social scientists are relatively new. In the past 5 years, they have begun to sprout and several important new fields of research are already thriving as a result. Applying computational methods to the solution of modern social science problems requires the development of new data structures, algorithms, and other tools that are in the domain of the computer scientist. This project seeks to develop the new ``social-science-based'' CS methodologies and to investigate their application to problems of information technology and to problems of the social sciences of fundamental importance to modern society. It also seeks to investigate computer science tools that are especially relevant to emerging problems of the socio-economic sciences. Research into issues of this type requires new interdisciplinary partnerships among computer scientists, mathematicians, operations researchers, economists, experts in business applications, political scientists, psychologists, sociologists, and researchers specializing in the handling of information. This project seeks to catalyze such partnerships.<br\/><br\/>The research component of the project will be organized around interdisciplinary working groups of researchers, with students and junior researchers included. Tutorials will introduce researchers and students to relevant methods of computer science and the social sciences and relevant applied problems. Workshops will identify areas for research, seek to catalyze interdisciplinary collaborations, and focus on future research challenges, and they will have an educational component with tutorial presentations and opportunities for students to participate. All working groups and workshops will seek an interdiscipinary mix of participants. Working Groups will investigate Game Theory, Computation, and Behavior; the Mathematics of Web Search and Meta-Search; and Distributed Computing, Social Networks, and Disease Spread Processes. Workshops will be held on Markets as Predictive Devices (Information Markets); Computational Issues in Auction Design; Electronic Voting (Theory and Practice); and Polyhedral Combinatorics of Random Utility. Additional workshops will cover the topics Network Economics; Bounded Rationality; and Yield Management and Dynamic Pricing.","title":"DIMACS Special Focus on Computation and the Socio-Economic Sciences","awardID":"0351165","effectiveDate":"2004-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1320","name":"ECONOMICS"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1321","name":"DECISION RISK & MANAGEMENT SCI"}},{"dir":{"id":"04","name":"Directorate for DIRECT FOR SOCIAL, BEHAV & ECONOMIC SCIE","abbr":"SBE"},"div":{"id":"0405","name":"Division of OF SOCIAL AND ECONOMIC SCIENCE","abbr":"SES"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["264120"],"PO":["565298"]},"94650":{"abstract":"0411536<br\/>Hunziker<br\/>The National Academy of Engineering (NAE) will host a joint German-American Frontiers of Engineering (FoE) Symposium to which a total of 60 participants, 30 from each country, will be invited. The basic idea is to engage promising engineering researchers from both countries, with emphasis on the younger generation in the community, to explore and discuss important areas of research at the cutting edge of technology. The German counterpart sponsor is the Alexander von Humboldt Foundation (AvH) <br\/><br\/>A bipartite organizing committee has identified the Internet, Bioengineering and the Food Industry, Process Quality Measurement, and Engineering and Art\/New Media as the areas of concentration. In each of these areas both American and German experts will be speakers reporting on the latest developments in these areas The program consists of four formal sessions and a technical tour over a three-day period. Each session entails talks by speakers on advances and opportunities in their engineering fields followed by discussion. To foster cross-fertilization among disciplines, the talks on cutting-edge research and innovation will be aimed at the technically sophisticated but nonspecialists.<br\/><br\/>The event is scheduled to take place at the NAE Headquarters in Washington, DC, April 29-May 1, 2004.","title":"Seventh German-American Frontiers of Engineering Symposium, Washington, DC, April 29, 2004 - May 1, 2004","awardID":"0411536","effectiveDate":"2004-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1766","name":"STRATEGIC TECH FOR INTERNET"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1340","name":"ENGINEERING EDUCATION"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1385","name":"SPECIAL STUDIES AND ANALYSES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1491","name":"BIOTECH, BIOCHEM & BIOMASS ENG"}}],"PIcoPI":["543859"],"PO":["319455"]},"95200":{"abstract":"Face analysis and synthesis has become an inexhaustible research topic in both the scientific community and industry, driven by applications in human-computer interaction, security, and entertainment. State of the art 3D face models used for recognition or animation cannot represent and identify subtle differences in facial appearance or feature configuration necessary to uniquely discriminate among individuals. In this project, the PI will develop a novel technique for analysis and synthesis of the human face at a higher level of detail than it is currently possible to achieve. A so-called 3D topographic representation is proposed for labeling and modeling the facial surface, in which the face is represented by an active mesh with a variable resolution based on the surface curvatures and the topographic labels. The PI expects that tracing the behavior of some features across multiple scales will reveal precious information about the nature of the underlying physical process, and thus lead to establishing an intrinsic relationship between facial features and surface properties (i.e., peak, pit, ridge, ravine, saddle, hill, flat, etc). This will, in turn, provide a scientific understanding of how facial appearance and representation vary along with expression changes, in an intuitive and detailed manner, and will offer profound new insights into how 3D facial surfaces contain embedded features that are not exhibited in 2D planar images. The PI anticipates that this pilot research will eventually enable him to develop a \"humanized\" system for recognizing human faces and their expressions (even emotions), as well as an automatic system for generating life-like facial expressions.<br\/><br\/>Broader Impacts: This research will improve our understanding of the cognitive processes involved in human vision, and impact the development of next generation human-computer interfaces in which machines can recognize facial expressions. The work will also have important applications in law enforcement (mug shot searches, security surveillance, and lie detection), access control (biometric authentication), entertainment (films, media, and games), videoconferencing (including support for lip-reading), and medicine (craniofacial plastic surgery planning, and cosmetics).","title":"SGER: Developing a high-definition face modeling system for recognition and generation of face and face expressions","awardID":"0414029","effectiveDate":"2004-04-01","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["511701"],"PO":["565227"]},"91790":{"abstract":"This project establishes an REU site at DePaul University and Argonne National Laboratory in the areas of bioinformatics and grid computing. This REU site will provide research internships to undergraduates as part of on-going research projects of a team of researchers from DePaul, Argonne, and University of Chicago. Research projects in the following areas will be offered: next generation grid environments, bioinformatics applications using computational grids, development of portals for transparent access to grids by nonexperts, and various applications using the Illinois Bio-Grid. The site will also sponsor lectures by Chicago-area researchers. <br\/><br\/>The site will support 8 students for a 10-week summer program of full-time research. The PI will focus on recruitment of interns from DePaul and similar institutions (Loyola University of Chicago, Chicago State) with many first-generation college students and many underrepresented minority students. The site projects will be multidisciplinary and the PI's plan to team computer science students with biology students on research projects. Interns will also attend a conference on grids to expose them to even more research.","title":"REU Site: An Interdisciplinary REU Site for Bioinformatics and Grids","awardID":"0353989","effectiveDate":"2004-04-15","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["455144",240505],"PO":["317663"]},"90394":{"abstract":"0347542<br\/>CAREER: Type Systems for Secure Code Migration<br\/>James Riely<br\/><br\/>Distributed systems increasingly rely on forms of code migration, such as client-side scripting, downloaded plugins, application service providers, and networked class loading. In executing migrating code, trust becomes an important issue: why should a host trust some newly arrived code to run locally? And why should a migrating agent trust the host where it is now running? One part of a trust architecture can be the use of type-checking: a host trusts a newly arrived agent if it can type-check it. This project uses semantic techniques to provide a formal basis for trust issues in distributed object-oriented systems with code migration. The formal models are a basis for a prototype language implementation that provides a secure infrastructure for distributed application development. The following issues are addressed: foundations of distributed objects, security properties of code migration, and code migration to hostile hosts. Work on object foundations brings together research on the semantics of class-based and aspect-oriented languages and distributed process-calculi. Work on security properties focuses on the problem of untrusted migrating agents: when can a host trust a newly arrived agent? The problems are formalized using type systems incorporating trust and models of encryption and digital signatures in order to transmit trust across the network. Work on hostile hosts addresses the other side of the coin: when can a mobile agent trust the host it is running on? If the host has been compromised, then the results of running the agent cannot be trusted. However, a notion of partial trust may be developed, again using encryption and digital signatures.","title":"CAREER: Type Systems for Secure Code Migration","awardID":"0347542","effectiveDate":"2004-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["409672"],"PO":["529429"]},"97643":{"abstract":"This award will provide travel support for approximately ten graduate students to attend the 14th International Workshop on Network and Operating Systems Support for Digital Audio and Video (NOSSDAV) to be held June 16-18, 2004 in Kinsale, County Cork, Ireland. NOSSDAV brings together researchers, developers and practitioners from academia and industry to present and discuss new ideas and future directions in networking and operating systems support for all forms of networked human interaction. From large immersive environments to portable wireless multimedia devices, NOSSDAV covers a broad spectrum of cutting edge multimedia research that strongly impacts infrastructure and the human experience. The travel award will target graduate students, since attending conferences is an important part of their educational experience, and they often have limited funds. An important aspect of this grant is independently requested, but synchronized support of the National Science Foundation, VA, and the Science Foundation Ireland (SFI). The latter has given NOSSDAV 2004 a grant to cover a variety of items related to the graduate student participation. This travel support thus contributes to initiate, develop, and foster relationships with leading international groups undertaking research in the related technical areas.","title":"Student Travel Support for the 14th International Workshop on Network and Operating System Support for Digital Audio and Video, June 2004; Kinsale, Ireland","awardID":"0426288","effectiveDate":"2004-04-15","expirationDate":"2006-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["552796"],"PO":["565090"]},"90395":{"abstract":"The objective of this project is to provide teams of cooperative robots with the appropriate knowledge of their organizational structure and capabilities, along with efficient reasoning mechanisms, to allow them to reorganize \"on-the-fly\" to achieve their overall team goals more efficiently and effectively in the face of a changing environment and team capabilities. The goal is to establish organizational reasoning as a key component in a new approach to building highly robust cooperative robotic teams. To realize this goal, the new organizational knowledge and reasoning techniques must be incorporated into practical methods and tools for designing and developing real world cooperative robotic systems. The technological objectives of this research will be to (1) develop a team organizational model that describes how organizational concepts such as goals, roles, and individual team members are related, (2) develop strategies, techniques, and algorithms for discovering when reorganization is required as well as efficient techniques for reorganizing to allow teams to reach their goals, and (3) codify these methods and techniques in an automated toolset to ensure that the organizational knowledge is captured and transformed into a form compatible with efficient reasoning techniques. The theories, techniques, methods, and tools developed in research will be used to enhance both undergraduate as well as graduate curriculum in multiagent and cooperative robotic systems. Also, a series of activities designed to impact persons not specifically part of the project are planned with a strong emphasis on pre-college students from elementary to high school. We plan to participate in several summer workshops to motivate pre-college students to select science and technology majors and to reach specific underrepresented groups.","title":"CAREER: Autonomous Reorganization of Cooperative Robotic Teams for Robustness","awardID":"0347545","effectiveDate":"2004-04-01","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["528449"],"PO":["564316"]},"92595":{"abstract":"This research is on an interconnect-centric layout design methodology incorporating on-chip inductance into the methodology. Specifically, the following problems are explored: (1) accurate modeling and analysis techniques for multiple coupled RLC interconnects; (2) efficient algorithms for interconnect synthesis to optimize performance and signal integrity for coupled RLC nets; (3) efficient algorithms for pre-layout interconnect estimation considering a comprehensive set of interconnect optimization techniques, and application of estimation results to interconnect architecture planning; and (4) efficient algorithms for pre-layout estimation of maximum switching current for functional blocks followed by optimization of the power supply structure using the RLC model. In addition, this project investigates an innovative computer engineering curriculum incorporating interconnect and System-On-Chip (SOC) considerations, and development of Web-based interconnect planning tools for use in innovative teaching and for outreach beyond the campus.","title":"CAREER: Interconnect-Centric Layout Synthesis and Planning with Consideration of On-Chip Inductance","awardID":"0401682","effectiveDate":"2004-04-15","expirationDate":"2009-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4710","name":"DES AUTO FOR MICRO & NANO SYS"}}],"PIcoPI":["352589"],"PO":["562984"]},"95301":{"abstract":"This research aims to explore why people turn to other people for information with the purpose of guiding future study while informing professional practice and, in the long run, system design. The study focuses on everyday situations in which information is needed, ranging from finding new jobs and lower mortgages, to healthcare, housing, childcare, social activities, and other aspects of daily life. It aims to expand empirical and theoretical knowledge of interpersonal information seeking with a long-term focus on devising ways for improving information services; involving students and underrepresented groups in varied capacities; collaborating with cognate business, community and academic organizations; communicating the results to national and international audiences; and facilitating a community of interest and practice around enhancing information behavior as it occurs in everyday contexts. <br\/><br\/>The study will be conducted using a naturalistic approach that will yield rich insights into two groups of people (stay-at-home mothers and preteens) to discern key aspects of their everyday information behavior, particularly regarding interpersonal information seeking over different synchronous and asynchronous media (e.g., face-to-face, telephone, email, chat rooms, newsgroups, etc). Using a grounded theory approach along with Chatman's theory of normative behavior and Friedman's value sensitive design, data will be collected using multiple methods, including different forms of observation, interviews, participant diary keeping, and focus groups with approximately 15-20 participants for each population. Data may be collected in-person and\/or online depending on the nature of each group and which methods appear most viable. During field observation, participants' interactions with other people will be watched for incidents of information sharing while contextual background evidence also will be gathered. During interviews participants will be asked such questions as with whom they discuss particular situations (finding a job, illness, childcare needs, relationships, home maintenance, etc.,) and why, how they can tell if someone needs information, how they personally manage everyday information, etc. Potential participants will be located at \"information grounds\"-places where they gather naturally for an activity but subsequently engage in information sharing. Data collection and analysis will occur iteratively and combined with the generation of theoretical propositions. <br\/><br\/>The study results will be used to derive the initial framework for a theoretical model of interpersonal information seeking that will be highly relevant to scholars and professionals working in any field related to the design and delivery of information systems and services. These fields range from information science and computer science to business, engineering, medicine and healthcare, social work and education. To-date virtually no framework exists from a user and information perspective that can explain why people turn to other people for information and that can be used for supporting human behavior. The framework's richness will stem from the study's naturalistic and grounded theory approach together with its focus on a broad range of participants as they engage in daily life.<br\/><br\/>Broader Impacts: Undergraduate and graduate students will participate in formal and informal capacities throughout all stages of the project, as will partners at different organizations such as the United Way and Microsoft Research. Concrete suggestions for improving professional practice will be drafted by working with different stakeholders in the nonprofit and profit sectors, and disseminated broadly.","title":"SGER: Talking with You: Exploring Interpersonal Information-Seeking","awardID":"0414447","effectiveDate":"2004-04-15","expirationDate":"2006-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":["565010"],"PO":["564456"]},"97017":{"abstract":"The PIs have submitted a proposal to organize a workshop in secure knowledge management. The workshop will explore critical knowledge management security issues such as secure languages, secure knowledge sharing and secure content management, privacy and some other important topics. These topics are very important to fully understand the issue surrounding secure semantic web as well as securing knowledge management practices. This is one of the first workshops in this area and will enhance the state-of-the-art.","title":"Secure Knowlege Management 2004 (SKM 2004) Workshop; September 9-10, 2004; Buffalo, NY","awardID":"0423014","effectiveDate":"2004-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7228","name":"DATA AND APPLICATIONS SECURITY"}}],"PIcoPI":["548305","563364"],"PO":["563751"]},"98217":{"abstract":"The Wavelets and Multifractal Analysis Workshop (WAMA 2004) will bring together world experts in wavelets and multifractal analysis, researchers new to these fields, and students in Carg`ese, Corsica, France between 19-31 July 2004. Support from NSF is being sought to help defray registration fees, travel expenses, and lodging costs for some of the invited speakers, researchers, and students. Partial support has already been obtained in the US from ONR-IFO, AFOSR and in France from the Direction Generale de l'Armement, Minist`ere de l'Enseignement Superieure, and INRIA. The participants will comprise 25 invited speakers, 20 researchers, and 40 graduate students from around the world, distributed approximately one-half each from the US and Europe (with several from other regions).","title":"WAMA 2004: Wavelets and Multifractal Analysis Workshop","awardID":"0430648","effectiveDate":"2004-04-01","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["497441"],"PO":["564898"]},"98349":{"abstract":"This is a proposal to support best paper awards, US student travel, and<br\/>publication costs for the third IEEE\/ACM Information Processing in Sensor<br\/>Networks (IPSN) to be held in Berkeley, CA in April 2004.<br\/>The workshop is devoted to recent advances in information processing<br\/>techniques and algorithms for sensor networks. This workshop brings<br\/>together members of the signal processing, communications, networking and<br\/>protocols, data bases, information management and distributed algorithms<br\/>communities, working in universities, research centers and industry. The<br\/>meeting will feature keynote addresses by leading researchers, as well as<br\/>invited and contributed papers.","title":"Proposal for Supporting the third IEEE\/ACM Information Processing in Sensor Networks 2004","awardID":"0431304","effectiveDate":"2004-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["533198"],"PO":["348215"]},"90264":{"abstract":"ABSTRACT<br\/>0346903<br\/>Laurie Williams<br\/>North Carolina State University<br\/>CAREER: The Test-Driven Development of Secure and Reliable Software Applications<br\/><br\/>Our nation's critical infrastructure demands that our current and future IT professionals have the knowledge, tools, and techniques to produce reliable and trustworthy software. The objective of this research is to extend, validate, and disseminate a software development practice to aid in the prevention of computer-related disasters. The practice is based upon test-driven development (TDD), a software development technique with tight verification and validation feedback loops. The proposed work extends the TDD practice and provides a supportive open-source tool for explicitly situating security as a primary attribute considered in these tight feedback loops. Additionally, the research examines the composition of TDD and pair programming\/pair testing as a security- and reliability-enhancing tuple of development practices. The study will also examine the potential of pair programming\/pair testing for improving the success\/retention of socially-oriented women, men, and minorities in the IT workforce. The intellectual merits of this proposal include an enhanced TDD-based software development practice to mitigate security concerns and a catalog of security testing patterns disseminated via the Internet. The broad impacts of the proposal include an interuniversity student competition to build excitement about developing secure and reliable software applications and a revised undergraduate software engineering textbook integrating security and reliability topics.","title":"CAREER: Test-Driven Development of Secure and Reliable Software Applications","awardID":"0346903","effectiveDate":"2004-04-01","expirationDate":"2011-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1100","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["549909"],"PO":["564388"]},"91783":{"abstract":"This project establishes an REU site at Texas A&M University (TAMU) in several areas of computer science research: computing foundations, human-centered systems, information, intelligent systems and robotics, software, and software engineering and systems. The site will engage 8 interns per summer for 10 weeks in the on-going research projects of TAMU computer science faculty. Each intern will be mentored by a 3-person team consisting of one faculty member, one graduate student, and one undergraduate (\"peer mentoring\"). In addition to the formal research projects, the site will sponsor weekly seminars on a number of research topics. <br\/><br\/>The PI will focus on recruitment of interns from other TAMU campuses as well as HBCU's, with which she has already established relations. Her TAMU campus already has a summer undergraduate research program funded by the General Electric Foundation that she will leverage with this REU award to increase the number of resident interns-concomitant with an expansion of the TAMU CS faculty. Site activities will include not only the research projects; interns will also receive coaching in how to apply to graduate school. Organized group activities will help develop a sense of community among the interns.","title":"REU Site: Research Experiences at Texas A&M University Department of Computer Science for Undergraduate Students","awardID":"0353957","effectiveDate":"2004-04-15","expirationDate":"2007-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["410068","541641","561154"],"PO":["381214"]},"97812":{"abstract":"This award provides funds to subsidize the travel and registration costs of students selected to participate in the 21st International Conference on Machine Learning (ICML), which will be held on July 4-7, 2004, in Banff, Canada.<br\/><br\/>At the conference, students will present results of their research in poster sessions as part of the normal conference schedule. Members of the Program Committee will be required to visit at least five posters to provide feedback to the students. This provides the students with invaluable exposure to outside perspectives on their work, at a critical time in their research, and also enables them to explore their career objectives. This workshop contributes to the professional development of young scientists who will lead this growing field in the coming decades.","title":"Proposal for Student Travel Scholarships - Twenty First International Conference on Machine Learning","awardID":"0427636","effectiveDate":"2004-04-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"V743","name":"DARPA-21ST INTERNATL CONF ON"}}],"PIcoPI":["562750"],"PO":["564318"]},"89848":{"abstract":"Testing a Developmental Mechanism by an Integrated Empirical-<br\/><br\/>Computational Approach<br\/><br\/>Stuart A. Newman, Ph.D., New York Medical College<br\/><br\/>Mark Alber, Ph.D., University of Notre Dame<br\/><br\/>PROJECT SUMMARY<br\/><br\/>The objective of this project is to define and test an activator-inhibitor based mechanism for skeletal pattern formation in vertebrate limb mesenchymal cells. The strategy involves working with three distinct but interrelated \"models\" for this process: (i) a readily manipulable in vitro experimental model utilizing high-density ('micromass\") cultures of avian limb mesenchymal cells; (ii) a conceptual developmental model that focuses on experimentally confirmed gene expression-growth factor-cell behavioral interactions common to the in vivo and in vitro patterning process; and (iii) a discrete cellular automaton (CA)-based computational model that has been shown to capture, in a semi-quantitative sense, the major features of the in vitro model, under assumptions that derive from the developmental model. The key interactions specified by the<br\/>computational model ultimately can be integrated into a multiscale, continuous representation of limb development in vivo. Before this is possible, however, it is necessary to determine whether these interactions uniquely simulate chondrogenic pattern formation in vitro, and whether introduction of additional, experimentally-confirmed molecular interactions and geometrical considerations increases or decreases the fidelity of the model to the in vitro results.<br\/><br\/>The computational model is an \"agent-oriented\" model that represents cells by points on a lattice which obey rules motivated by experimental findings. The \"cells\" follow these rules as autonomous agents, interacting with other cells and with microenvironments produced by cell activities. The rules include random cell motion, production and lateral deposition of a substrate adhesion molecule corresponding to fibronectin, production and release of a diffusible activator, corresponding to TGF-B that stimulates production of the SAM, and another diffusible factor (\"inhibitor\") that suppresses the activity of the activator. The cellular automaton is modeled on a 2- dimensional square lattice to emulate the quasi-2D micromass culture.<br\/><br\/>The Newman laboratory will misexpress and inhibit expression of TGF-B , fibronectin, FGF2 and 8 (elicitors of lateral inhibition) and candidate inhibitory molecules in vitro and compare pattern results with corresponding manipulations of the CA model; Dr. Alber and his associates will refine the CA model so as to provide cells with more realistic shapes, allow them to move and accumulate in a third dimension, cause them to exhibit differential adhesion, and will develop a set of quantitative methods for pattern analysis, applicable to both micromass cultures and simulations, so as to facilitate detailed comparison between in vitro and in silico results.<br\/><br\/>Broader impact: The project can be expected to yield several benefits that extend beyond the particular scientific problem addressed. The cellular automata approach is a general tool that can provide developmental biologists working in the area of pattern formation with a way of designing experiments, making predictions, and testing hypotheses. The cross-disciplinary nature of the project will provide a prototype for collaborative efforts by experimental biologists and mathematical, physical, and computational scientists. The work will also have educational value by providing interdisciplinary research experience to graduate students in experimental biology and applied mathematics, who will all spend time in the research groups of the alternate field.","title":"Testing a Developmental Mechanism by an Integrated Empirical-Computational Approach","awardID":"0344647","effectiveDate":"2004-04-15","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1119","name":"ANIMAL DEVELOPMENTAL MECHANSMS"}}],"PIcoPI":["381067","529886"],"PO":["280701"]},"93830":{"abstract":"INT-0407508<br\/>Wienhausen<br\/><br\/><br\/>This proposal is a pilot project to provide international experience for undergraduate students from the University of California at San Diego (UCSD) to carry out research projects in cyber-infrastracture (CI) in PRAGMA member institutes. Professor Gabriele Wienhausen, Ms. Linda Feldman, and Dr. Peter Arzberger are principal investigators at UCSD and the key members from PRAGMA institutes who will participate in this activity include Dr. Shinji Shimojo, Osaka University, Dr. Fang-Pang Lin, National Center for High-performance Computing, Taiwan, and Dr. David Abramson, Monash University, Australia. This project will have six students each year, 18 for three years, from UCSD conduct research at PRAGMA institutes in Japan, Taiwan and Australia. The students will work on CI related projects with dual mentors, one international and one at UCSD, and spend the summer at one of the identified institutions. At the conclusion of their stay, the students will present the results of their research at an international meeting. The P.I. s are highly qualified and positioned to establish and manage this learning experience for undergraduate students. UCSD has a strong setting for an internship abroad program in the Pacific Rim. Using the PRAGMA network, this project can provide a unique opportunity to train students to routinely use CI for communication and research. This could open their eyes to the immense potential this technology has to impact science. The project is jointly supported by the National Science Foundation and the PRAGMA member institutes in Australia, Japan and Taiwan.","title":"Collaborative Undergraduate Experiences in the Pacific Rim","awardID":"0407508","effectiveDate":"2004-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7316","name":"EAPSI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7475","name":"HEC CORE FACILITIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4089","name":"NETWORK CENTRIC MIDDLEWARE SVC"}}],"PIcoPI":["547710","336793","336794"],"PO":["320738"]},"91784":{"abstract":"Institution: University of New Orleans<br\/>Proposal Number: 0353959<br\/>PI: Mahdi Abdelguerfi<br\/>Title: REU Site: REU in Spatio-Temporal Database Systems<br\/><br\/>This project establishes an REU site at the University of New Orleans (UNO) focusing on research experiences for undergraduate students in spatio-temporal database systems (STDS). This REU site will provide research internships to undergraduates in a number of STDS applications, all of them involving modeling of dynamic information in space and time. The specific projects include work on a 3D spatio-temporal GIS at the University of New Orleans (UNO); a digital geospatial mapping and analysis system at the Digital Mapping, Charting, and Geodesy Analysis Program (DMAP) of the Naval Research Laboratory; and developing management tools for different off-the-shelf GIS suites at the Army Corps of Engineers-New Orleans District. <br\/><br\/>The site will support 10 students for a 10-week summer program of full-time research, and the students will continue their research projects throughout the academic year, meeting from time to time at UNO. In addition to the scientific research, the project will provide the interns with training and orientation for effective communication (presentation) skills; preparation of research papers; computer ethics; and graduate school admissions processes.","title":"REU Site: Research Experience for Undergraduates in Spatio-Temporal Database Systems","awardID":"0353959","effectiveDate":"2004-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["425195","425197"],"PO":["317663"]},"91685":{"abstract":"Institution: University of South Carolina<br\/>Proposal Number: 0353637<br\/>PI: Caroline M. Eastman<br\/>Title: REU Site: Multidisciplinary Research in Computing<br\/><br\/>This project establishes an REU site at the University of South Caroline in the broad areas of secure and reliable software. The initial four research topics are: information security; secure computing for mobile code; enterprise-level network-based systems; and software agents for team software development. An innovative aspect of this proposed project is the use of research teams consisting of computer science majors and pre-service education students. The goal of these teams is to explore not only the research questions in a specific area but also how the research might be communicated to the research community, the public, and K-12 students. <br\/><br\/>The site will support 8 students for a 10-week summer program of full-time research, as well as some semester research for two of the interns. The project will also develop teaching modules during the research internships, and these modules can be used in K-12 classrooms. The project includes a dissemination plan and funds for promoting student participation in conferences, and these conferences will be opportunities for other students and faculty to learn about this innovative program.","title":"REU Site: Multidisiciplinary Research in Computing","awardID":"0353637","effectiveDate":"2004-04-01","expirationDate":"2008-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7371","name":"CYBER TRUST"}}],"PIcoPI":["444741","444742"],"PO":["564181"]},"92433":{"abstract":"The HSCC 2004 {Seventh International Workshop on Hybrid Systems: Computation and Control, and a satellite workshop devoted to foundations and applications of Robustness, Abstractions and Computations, were held March 25-28, 2004 in Philadelphia on the campus of the University of Pennsylvania. The annual workshop on hybrid systems attracts researchers from academia and industry interested in modeling, analysis, and implementation of dynamic and reactive systems involving both discrete and continuous behaviors. The emphasis is on the interdisciplinary nature of the topic, bringing together researchers in computer science and control engineering. HSCC 2004 includes tracks on the use of hybrid systems in computational biology and a special session devoted to foundations of Robustness, Abstractions and Computation. <br\/><br\/>NSF support enables participation by U.S. graduate and undergraduate students in hybrid systems.","title":"Proposal for Hybrid Systems Workshop; March 25-28, 2004, Philadelphia, PA","awardID":"0401049","effectiveDate":"2004-04-15","expirationDate":"2005-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2801","name":"EMBEDDED & HYBRID SYSTEMS(EHS)"}}],"PIcoPI":["497082","526896"],"PO":["561889"]},"90278":{"abstract":"This project applies combinatorial and geometric optimization techniques to design efficient algorithms for three important research areas in bioinformatics: (1) substructure similarity identification; (2) inverse protein folding; and (3) test set problems. Efficient algorithms are designed by using combinatorial methods such as the information content heuristic approach, local-ratio and multi-phase techniques, slice-and-dice methods, and a linear programming approach via primal-dual schema. Judicious combinations of existing and novel combinatorial techniques coupled with collaborations with other computational biologists and effective interactions with and feedback from the biologists and bioengineers makes the designed algorithms practical and biologically relevant.<br\/><br\/>The technical impact of this work will be in designing efficient algorithms for computationally challenging problems in the abovementioned areas via combinatorial\/geometric techniques. This will provide the biologists with better algorithms and software for several applications such as recognizing remote evolutionary relationships at the level of protein fragments via discovering similar substructures from different proteins and efficiently detecting unknown pathogens via string barcoding. The broader impacts of this proposal will be integrating research and teaching, effective dissemination via publications, web and other means, and improving diversity in research and education.","title":"CAREER: Efficient Algorithms for Computational Problems in Bioinformatics Via Combinatorial and Geometric Techniques","awardID":"0346973","effectiveDate":"2004-04-15","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7294","name":"SCIENCE & ENGINEERING INFORMAT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["516991"],"PO":["565136"]},"98418":{"abstract":"As the Human Genome Project nears completion the need grows for functional genomic analyses which in addition to the primary genomic sequence involve other types of data such as gene expression measurements from microarray hybridization experiments. Research in functional genomics involves a range of computational problems including visualization, clustering, classification, regression, knowledge representation, and predictive modeling. This project will touch on each of these areas, but the primary focus will be on developing machine learning techniques that learn to place genes into discrete functional categories in order to simplify and render more tractable the problem of inferring gene function from genomic data. To the end the PI will build on his prior work which showed that a support vector machine (SVM) can be successfully trained using DNA microarray expression data to recognize various gene functional categories, and will develop methods for combining coding sequence, promoter region, gene expression, and other types of genomic data in SVM-based learning algorithms. The research will lead to improved understanding of the ability of various machine learning techniques to recognize different types of gene functional classes, and will also yield new techniques for learning simultaneously from multiple types of data. Learning from heterogeneous data sets is a core issue in artificial intelligence and machine learning; the ability to combine knowledge from various types of genomic data is critical for understanding the cell at the molecular level, and should lead to important insights into gene function.","title":"CAREER: Support Vector Methods for Functional Genomic Analysis","awardID":"0431725","effectiveDate":"2004-04-01","expirationDate":"2007-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["393337"],"PO":["387198"]},"81852":{"abstract":"In this project, we propose to design, implement, and evaluate a component-based software environment for<br\/>simulating and emulating network protocols in a systematic manner, and for a wide variety of target network<br\/>architectures. We will also explore the use of the developed protocol components on a software-programmable router platform. The software environment has been built upon a component-based software architecture, called autonomous component architecture (ACA), that deploys a message-passing, independent execution model to realize the notion of software IC. On top of ACA, a packet-based network modeling framework, called extensible internetworking framework (EIF), has been laid to de?ne generic network components that are general enough to accommodate future technology advances. To demonstrate the use of ACA and EIF, we have implemented in Java both ACA and EIF, and an (almost) complete suite of essential Internet protocols in the Internet best-e?ort service, integrated services, and di?erentiated services architectures. The resulting code, along with a scripting framework, constitutes a network simulation environment called JavaSim.","title":"NGS: Collaborative research : A Component-based Software Environment for Simulation, Emulation, and Synthesis of Network Protocols in Next Generation Software","awardID":"0305768","effectiveDate":"2004-04-01","expirationDate":"2007-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":[213489,213490],"PO":["301532"]},"91664":{"abstract":"Institution: Hope College<br\/>Proposal Number: 0353566<br\/>PI: Herbert L. Dershem<br\/>Title: REU Site: An Undergraduate Research Participation Program in Computer Science<br\/><br\/>This proposal establishes an REU site in several fields of computer science, including bioinformatics, algorithms, wireless networks, and programming environment research. The site will build on Hope College's 12 years of experience in hosting summer undergraduate research interns. Research projects available to the interns include: automated animation of abstract data types; text formatting to enhance code understanding; field programmable gate arrays; measures of software complexity; functional modeling of genes and cellular processes; etc. <br\/><br\/>The REU site will support 8 students per year for 10 weeks in each of the 5 years of the project. Recruitment will target women and underrepresented minority students and at least 4 of the 8 will be non-Hope College students. The interns will meet graduates of the Hope Summer Research program currently in graduate school, and will visit research labs at a major university where they will meet professors and graduate students.","title":"REU Site: An Undergraduate Research Participation Program in Computer Science","awardID":"0353566","effectiveDate":"2004-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}}],"PIcoPI":["503906","437778"],"PO":["564181"]},"90377":{"abstract":"Next generation communication systems will integrate mobile ad hoc networks, wireless mesh networks, and all-IP cellular networks into hybrid networks. Key features of these systems are the multiplicity of access technologies and the diversity of nodes to facilitate always best connected (ABC) communication and pervasive computing. The survivability of hybrid networks is of paramount importance to homeland security, where the networks must fulfill their missions in a timely manner even in the presence of failures or attacks. This project aims to (1) develop hybrid routing protocols where portions of the same route span both infrastructure components and multi-hop wireless components of different networking characteristics, (2) integrate control with computing and communication to harness mobility and control trajectory to achieve eventual connectivity, (3) design hybrid transport mechanisms that cope with asymmetry, and (4) develop utility-based congestion control algorithms that maximize the aggregate transport utility over wireless networks. The project is investigating integrated solutions and pursuing cross-layer design, and will yield theory, algorithms, and protocols that help enhance capacity and survivability of hybrid networks. In addition, the educational activities of the project are to integrate control with computing and communication into mobile wireless networking curricula to foster the next phase of the information technology revolution, and to develop tools such as protocol animations to help comprehend protocol concepts, simulation exercises to help learn a complex simulator, and methodology for simulation and performance evaluation. The results will be disseminated and will be of value to both the educational community and industry.","title":"CAREER: Survivable Hybrid Networks","awardID":"0347460","effectiveDate":"2004-04-15","expirationDate":"2010-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["528443"],"PO":["434241"]},"81798":{"abstract":"In this project, we propose to design, implement, and evaluate a component-based software environment for<br\/>simulating and emulating network protocols in a systematic manner, and for a wide variety of target network<br\/>architectures. We will also explore the use of the developed protocol components on a software-programmable<br\/>router platform. The software environment has been built upon a component-based software architecture, called<br\/>autonomous component architecture (ACA), that deploys a message-passing, independent execution model to<br\/>realize the notion of software IC. On top of ACA, a packet-based network modeling framework, called extensible<br\/>internetworking framework (EIF), has been laid to de?ne generic network components that are general enough<br\/>to accommodate future technology advances. To demonstrate the use of ACA and EIF, we have implemented in<br\/>Java both ACA and EIF, and an (almost) complete suite of essential Internet protocols in the Internet best-e?ort<br\/>service, integrated services, and di?erentiated services architectures. The resulting code, along with a scripting<br\/>framework, constitutes a network simulation environment called JavaSim.","title":"NGS: Collaborative Research: A Component-based Software Environment for Simulation, Emulation, and Synthesis of Network Protocols in Next Generation Software","awardID":"0305496","effectiveDate":"2004-04-01","expirationDate":"2009-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2884","name":"NEXT GENERATION SOFTWARE PROGR"}}],"PIcoPI":["438434"],"PO":["551712"]},"97705":{"abstract":"This award will provide travel support for approximately ten graduate students to attend the USENIX First Symposium on Networked systems Design and Implementations (NSDI 04), and Third USENXI Conference on File and Storage Technologies (FAST 04) to be held March 29-30, 2004 in San Francisco, CA. NSDI and FAST are important technical forums for high-quality research in networked and storage systems. The collaborative support of these two events will contribute to initiate, develop, and foster relationships between the two research communities. For students it is an opportunity to meet and discuss their research with some of the most notable researchers in these fields.","title":"Student Stipends to Attend USENIX NSDI and FAST Conferences","awardID":"0426748","effectiveDate":"2004-04-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["553906"],"PO":["565090"]}}