{"132187":{"abstract":"Modern global society is increasingly reliant on computing and information professionals to serve key roles in creating, managing, and maintaining the global computing and information infrastructure that is critical to research, education, commerce, and quality of life. As such, computing and information professionals need to learn not only technical skills but also how to resolve ethical issues such as in\/outsourcing, intellectual property, and information privacy. Working in the new global economy requires that computing and information professionals are able to consider the range of cultural values and ethical perspectives as represented by leading thinkers such as Aristotle, Bentham, Buddha, Confucius, Gilligan, and Kant. To broaden and deepen the ethical perspectives of computing and information professionals, it is essential to develop and teach courses in computing and information ethics as part of professional graduate programs in computer science and the interdisciplinary information field. Further, to enable current and future computing and information professionals to appreciate and understand the relevance of ethics in their work, it is necessary to find educationally motivating ways to engage graduate students in professional computing and information programs to consider key ethical issues. In this project the PIs hope to accomplish this goal through development and evaluation of an educational simulation for computing and information ethics, which serves as the cornerstone for an innovative course focusing on the role of values and ethics in computing and information within a global society. Building on their prior research, the PIs will explore three main research questions: How do graduate students in a computing and information ethics course use educational simulation software to gain understandings of and hands-on experiences with important computing and information ethics issues such as intellectual property in a global society? Does geographical co-location have an impact on use of the simulation in the context of an internationally-oriented computing and information ethics graduate course with a diverse range of students? Do students in a graduate-level computing and information ethics course benefit most from interaction with peers, or with the software agents developed through this project?<br\/><br\/>Broader Impacts: Project outcomes will include a free and open-source simulation for computing and information ethics, which allows students both to participate in and learn from cases, and to develop and implement their own cases that they can then share with peers. The PIs will develop a novel and highly participatory course built around the simulation, which will be implemented in professional computing and information master's programs across the country and the world, and which will better prepare computing and information professionals to deal with ethical issues throughout their careers.","title":"Collaborative Research: Educational Simulation for Computing and Information Ethics","awardID":"0734894","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":["547983"],"PO":["565227"]},"129405":{"abstract":"Communications networks increasingly rely on robust, accurate monitoring systems to help network operators detect disruptions, misconfigurations, and failures. Accurate monitoring techniques detect disruptions when they occur (with a negligible number of false alarms), and identify the source of the disruption, for example, the faulty network element, the source of unwanted traffic. Robust monitoring detects disruptions when measurements may be noisy, incomplete, or when attackers are actively trying to disguise their presence. Network monitoring is most accurate when distributed; that is, when it draws upon observations from a large number of vantage points. Monitoring is more robust when it is network-level; that is, when it can rely on properties of the network traffic, rather than on other features such as traffic content. The researchers are developing techniques for distributed, network-level monitoring and incorporating these techniques into a distributed data management system for detecting network disruptions in two areas: internal network faults and failures, and external threats and unwanted traffic.<br\/><br\/>The research has three themes: (1) Online, distributed, detection algorithms; (2) Informed actuation that uses passive measurements as a baseline, judiciously choosing active measurements to issue in support of the passive measurements, (3) Incorporating these techniques into real-world systems to evaluate the practicality of the schemes and their applicability in realistic network monitoring settings. We will evaluate our algorithms in two settings: detection of internal network disruptions (e.g., failures, faults and misconfigurations within a single network, such as a campus or enterprise network); and fast detection of global threats (e.g. spam, botnets).","title":"Collaborative Research: NeTS-NBD: SCAN: Statistical Collaborative Analysis of Networks","awardID":"0721581","effectiveDate":"2008-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["561756","518447"],"PO":["565090"]},"142077":{"abstract":"This project, acquiring and developing a 3D Imaging and Virtual Environment System, aims at bridging the content gap that limits the use of 3D models because of the difficulty of creating and obtaining 3 D content. The integrated platform collects laser range data in conjunction with photometric stereotypes. Motivations include:<br\/><br\/>-Enabling development of integrated digital imaging and visualization tools for different areas,<br\/>-Providing powerful tools for developing new approaches for acquiring, processing, and visualizing 3D data, and<br\/>-Sharing the facility to expand the contributions.<br\/><br\/>The facility, used for a wide variety of research and teaching activities, should enable improved methods and tools for 3D characterization and modeling in several areas. Expectations include: <br\/><br\/>- A Versatile digital imaging and analysis system for rapid characterization of 3D field objects, including procedures for 3D shape capture, generating 3D textures surfaces, stitching images, automated image interpretation and data extraction, and<br\/>-Virtual environment system particularly suited to visualizing, manipulating, and processing digitally scanned 3D images.<br\/><br\/>Broader Impact: Societal impacts involve integration of education and research, participation of minorities and women, enhancement of infrastructure, and rapid and broad dissemination of results.","title":"CRI: Versatile 3D Imaging and Virtual Environment System","awardID":"0824670","effectiveDate":"2008-01-01","expirationDate":"2009-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":[378129],"PO":["564456"]},"137479":{"abstract":"The Pacific Symposium on Biocomputing is an international multidisciplinary conference covering research in the theory and application of computational methods in problem of biological significance. The conference provides a forum for work on databases, algorithms, interfaces, visualization, modeling and a variety of other computational approaches. A particular area of emphasis has been data-intensives areas. The session are defined dynamically each year, with session organized to provide forums for publication and discussion of emerging areas of research. The award will provide funds for travel support for US conference participants, with priority going to graduate students who will be presenting paper or poster sessions.","title":"Pacific Symposium on Biocomputing 2008","awardID":"0802687","effectiveDate":"2008-01-01","expirationDate":"2008-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["483872"],"PO":["565136"]},"133014":{"abstract":"This project supports activities at both the secondary school and university level aimed at increasing the participation of gender and ethnically diverse students in computing and engineering as well as fostering an undergraduate environment that cultivates retention. A feeder network established with the high schools during the project builds direct links with students and their counselors, teachers, and parents to inform them about the rewards and opportunities in the computing professions and to prepare them for undergraduate computing programs. Developmental workshops for teachers and counselors link them to the program. The project includes activities for all incoming engineering students to expose them to computing through a revised introductory curriculum. Retention efforts involve establishing a supportive academic and faculty community through mentoring, training on pedagogical methods, and linkage to faculty accountability. Formative and summative evaluations identify areas for improvement and the impact of the various activities on reaching project goals.<br\/> <br\/>The intellectual merit of this project lies in the curriculum development and assessment which may provide best practices in addressing diversity concerns at both the secondary and university level. The evaluations should help define a set of activities that are effective for mentoring and outreach and for building academic communities including teachers and university faculty.<br\/><br\/>The broader impacts of the project include attracting and retaining women and under-represented minorities into computer science and engineering. The project has the potential to produce new models for developing a more diverse group of students and faculty members and to advance discovery and understanding while promoting learning in the information technology disciplines. The project will also provide a better technically educated workforce to meet national security and economic priorities.","title":"BPC-DP: Outreach and Pedagogy to Increase Undergraduate Diversity at Engineering Schools","awardID":"0739254","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["464116","438734","513746"],"PO":["564181"]},"135005":{"abstract":"For years, microprocessor vendors have supplied processors with increasingly faster clock speeds, ensuring the continued growth in the number of embedded products on the market. These embedded products have had a profound impact on the quality of life. Today, and as a result of physical design challenges, the industry finds itself at a turning point, with a shift of emphasis from single-processor core to multi-core systems using Field Programmable Gate Arrays (FPGAs) as means to accelerate compute-bound applications.<br\/><br\/>To obtain desired performance from these new compute platforms, designers are following platform-specific programming and compilation practices. These practices yield non-portable code, and violate the principle of clean separation of function from architecture, reducing the degree of interoperability among developers, tool vendors, and architecture providers.<br\/><br\/>The planned research of virtualizing a multi-core system augmented with FPGA fabric, akin to the concept of virtual machines such as Java VM, provides an abstract and universal underpinning for design and verification of complex embedded software. The research aims to explore and define a parametric virtualization layer providing an abstract view of hardware to the software subsystem and study technologies for configuration checkpointing\/rollback and source level debugging support.<br\/><br\/>A virtual platform will enhance and enable research in distributed software, operating systems, compilers, on-chip synthesis, device configuration, debugging, active power management, and FPGA\/microprocessor design. It will serve as an important tool in the lecture room and in the hands of students, allowing them to explore, define, and refine the design paradigms of the future.","title":"SGER: A Virtual Target For Next Generation Hardware Accelerated Multi-Core Systems","awardID":"0749508","effectiveDate":"2008-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["495392"],"PO":["493916"]},"137106":{"abstract":"This work, modeling auditory processing in children with learning disabilities and its corresponding treatments, builds, validates, and experiments with computational models the processing of audio signals in the auditory nervous system of the human brain. The following tasks will be completed during this work:<br\/>. Modeling and validation of a \"single neuronal channel (SNC)\" along the pathway from the auditory nerve fiber all the way to the auditory cortex;<br\/>. Expansion of the SNC to include possibly all neurons along the auditory pathway and validation of the resulting highly parallel model, with feedback along the pathway, on a high performance computer; <br\/>. Modeling of diseases (disorders) of the auditory pathway as faults in the neuronal circuitry in the computational model and studying their impact on signal processing along the pathway; and<br\/>. Determining the correlation of the neuronal activity of the \"computationally diseased\" model with the human brainstem response observed through experimentation with learning-impaired children.<br\/>With a long-term goal for capturing into a computational model the knowledge related to the acoustic processing streams acquired by speech and hearing scientists through experiments with the human auditory system, the project aims to accomplish the following short-term goals: <br\/>. Understanding what portions of the auditory processing ought to be included in the model;<br\/>. Building a neural network model in consultation with researchers in speech and hearing sciences; and<br\/>. Validating the model by running computer simulations against experimentally observed data.<br\/>Such a model was expected to predict brainstem responses to audio signals that come in via the human ear and partition into its finer spectral components in the cochlea from where the impulses travel via the auditory nerve and several specialized nuclei in the brainstem to the auditory cortex. The fact that the audio signals split into two distinct \"what\" and \"where\" streams in the auditory cortex or en-route to it motivates the research. Although many computational models of the auditory system exist, the novelty of the proposed research lies in<br\/>. Including the ventral and dorsal streams in the computational model and<br\/>. Validating the model against auditory brainstem responses observed in children with learning disorders.<br\/>Research into the understanding of the different auditory pathways has wide ranging implication in the treatment of various speech and communications disorders such as language impairment in children.<br\/><br\/>Broader Impacts: Validated computational models of the auditory cortex carry the potential for performing computer-based experiments and trials to understand the impact of proposed treatments for such disorders. Such experiments can be fast, relatively inexpensive, and serve as a precursor to conduct experiments involving humans and animals. Additionally, students also gain expertise in the area. The research expands the discipline of neuron-computational modeling and should contribute in understanding the causes of learning disabilities in children, thus enabling development of the corresponding treatment. However, it is unclear as to what type of training will be needed for such computational model to mimic the experimentally observed behaviors and then to suggest behaviors that can be verified experimentally. The computational model will be used to answer \"what if\" questions.","title":"Computational Models to Study Auditory Processing and Learning Disorders in Children","awardID":"0801119","effectiveDate":"2008-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"5761","name":"INDUSTRY\/UNIV COOP RES CENTERS"}}],"PIcoPI":[364273],"PO":["557609"]},"134874":{"abstract":"The next frontier for computers is the automated personal assistant that can interact with people in intuitive and natural terms. One of the key capabilities to enable this is robust spoken language communication. Current techniques for automated natural language understanding, however, all depend on the notion of a complete sentence as the core unit on communication. This assumption makes sense for text understanding applications, but is very unnatural in spoken language applications. Human-human spoken communication occurs incrementally, using sentence fragments, with corrections, elaborations, and confirmations to enable efficient coordinated action. This Small Grant for Exploratory Research (SGER) explores the possibility for new models of incremental processing that redefine the basic communicative unit of communication and develop new understanding techniques that use these units. <br\/><br\/>One of the key ideas underlying this work is that communicative units should be defined in terms of identifying the speaker intentions (as opposed to the traditional view of analyzing language in terms of its structural properties). This project is exploring the feasibility of developing new computational models that identifying intentions incrementally. Exploratory testing is accomplished using the TRIPS natural language understanding system and comparing the performance of incremental vs non-incremental processing models.<br\/><br\/>This SGER will lay the foundations for significantly more natural human-computer interfaces in a new generation of automated personal assistants that will revolutionized how computers are used, allowing computers to adapt to people rather than forcing humans to adapt to computers.","title":"Integrating Language and Acting","awardID":"0748942","effectiveDate":"2008-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7495","name":"ROBUST INTELLIGENCE"}}],"PIcoPI":["517044"],"PO":["565215"]},"129409":{"abstract":"Communications networks increasingly rely on robust, accurate monitoring systems to help network operators detect disruptions, misconfigurations, and failures. Accurate monitoring techniques detect disruptions when they occur (with a negligible number of false alarms), and identify the source of the disruption, for example, the faulty network element, the source of unwanted traffic. Robust monitoring detects disruptions when measurements may be noisy, incomplete, or when attackers are actively trying to disguise their presence. Network monitoring is most accurate when distributed; that is, when it draws upon observations from a large number of vantage points. Monitoring is more robust when it is network-level; that is, when it can rely on properties of the network traffic, rather than on other features such as traffic content. The researchers are developing techniques for distributed, network-level monitoring and incorporating these techniques into a distributed data management system for detecting network disruptions in two areas: internal network faults and failures, and external threats and unwanted traffic.<br\/><br\/>The research has three themes: (1) Online, distributed, detection algorithms; (2) Informed actuation that uses passive measurements as a baseline, judiciously choosing active measurements to issue in support of the passive measurements, (3) Incorporating these techniques into real-world systems to evaluate the practicality of the schemes and their applicability in realistic network monitoring settings. We will evaluate our algorithms in two settings: detection of internal network disruptions (e.g., failures, faults and misconfigurations within a single network, such as a campus or enterprise network); and fast detection of global threats (e.g. spam, botnets).","title":"Collaborative Research: NeTS-NBD: SCAN: Statistical Collaborative Analysis of Networks","awardID":"0721591","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["549916"],"PO":["564993"]},"132753":{"abstract":"The Colorado School of Mines proposes to pilot an intervention, called CONNECT: Creating Open Networks aNd Expanding Connections with Technology, that will help students attending the Grace Hopper Celebration of Women in Computing 2008 to develop support networks and, more importantly, to sustain those connections after the <br\/>conference ends. Conference registrants choosing to participate will complete a questionnaire about their networking goals at registration; these participants will then receive a colored barcode on their badge at the conference, signaling ?Ready to Network?. Participants who meet at the conference will have the opportunity to have that interaction noted electronically. At the end of each day, participants will be sent the names and contact information for the people they networked with along with an assessment of how they are doing on their pre-meeting goals. If successful, this pilot will lead to a larger program aiming to (1) encourage attendees to reach their networking goals, (2) precipitate post-conference communication from faculty and computing professionals to undergraduate and graduate students met during the conference, (3) assist future organizers of GHC and other conferences by providing data on where\/when attendees met their networking goals, and (4) evaluate the long-term realization of social networks that develop at professional conferences.","title":"CONNECT: Creating Open Networks aNd Expanding Connections with Technology","awardID":"0738102","effectiveDate":"2008-01-15","expirationDate":"2010-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7482","name":"BROADENING PARTIC IN COMPUTING"}}],"PIcoPI":["546219"],"PO":["561855"]},"131664":{"abstract":"A proliferation of technical instruments, computational resources, and digital media are opening up new opportunities in security, entertainment, science and medicine. We are automatically acquiring large databases of measurements that span physical scales from the molecule, to the cell, tissue, organism, ecosystem, and beyond to stars and galaxies. However, the rate of acquisition of these data exceeds our ability to analyze them, and many applications are stymied not by the lack of data but by the daunting task of understanding it all. This project addresses the problem of constructing statistical models of such data sets using examples from the data itself. The researchers will study the technical problems associated with constructing statistical modeling in high-dimensional spaces from mathematical and computational points of view. This research will focus on applications of these methods to problems in multidimensional image analysis, including denoising, segmentation, and image synthesis. <br\/><br\/>This project will develop new algorithms for analyzing large sets of data. These algorithms make very weak assumptions about the statistical structure of data, and instead learn the statistics through large sets of examples, using raw measurements from very high dimensional spaces. The project combines a small team of researchers from probability theory, applied mathematics, and computer science to simultaneously address several important, fundamental questions pertaining to estimates of high-dimensional probability density functions, the computational challenges associated with these estimations, and the applications of these ideas to ongoing problems in science and medicine. The work in probability theory addresses basic questions about probability density functions in very high dimensional spaces. The applied mathematics work is developing methods for approximating these densities through lower-dimensional or sparse representations. The computer science research is examining implementation issues and the application of these methods to a wide range of ongoing problems that demand better algorithms for data analysis.","title":"MSPA-MCS: High-Dimensional, Nonparametric Density Estimation for the Analysis of Images and Shapes","awardID":"0732227","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"7454","name":"MSPA-INTERDISCIPLINARY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["544625","515717","350293","501995"],"PO":["562984"]},"136208":{"abstract":"This project renews a Research Experience for Undergraduates site focused on wireless research in cognitive networks. The research aims to increase spectrum utilization significantly for both military and commercial applications. Students develop software defined radio frequency transmitters and receivers, develop an integrated test bed, and conduct research using the test bed. The project involves collaboration between the host institution and Jackson State University, with half the students and one mentor coming from Jackson State. Undergraduate students participate in a ten-week summer research program at the host institution. The project includes mentorship by experienced computer science faculty members, weekly presentations and seminars, laboratory visits and other professional development opportunities.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications. The research related to dynamic spectrum access techniques may significantly improve the spectrum utilization for future wireless networks.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The project develops strong collaborative ties between the host institution and Jackson State University that will enable the students to continue their research and professional growth after the summer experience. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Integrated Software Radio and RF Test Bed for Wireless Research in Cognitive Networks","awardID":"0755026","effectiveDate":"2008-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["409087",361858],"PO":["564181"]},"142974":{"abstract":"The objective of the project is to develop new efficient simulation methods using a hybrid simulation\/analytic queueing model for large and complex networks, and efficiently run the simulation portion of the model using a new dynamic computing budget allocation technique. This project will extend the use of the newly developed simulation methods to the national air traffic network including runway slot auctioning and agent-based modeling (ABM) of air traffic management. Airlines and airports play the roles of agents engaged in a dynamic competition to maximize their individual profits with the use of information. Alternative agent-based rules will be experimented to determine optimal decision policies. Good auction rules to better regulate the use of airport runways will be investigated and designed using the fast simulation engine and ABM modeling approach. Using auctions to allocate runway slots has the potential to economically induce airline carriers to more efficiently use the capacity of the entire system - thus, decreasing congestion and increasing the safety level. While the proposed simulation tool is tailored for the air transportation network in the U.S., the newly developed methods will be applicable to other complex, dynamic networks, such as communication networks, manufacturing systems, and logistics networks.","title":"ITR: Very Efficient Network Simulation Methods for Auctioning and Collaborative Models of Air Traffic Management","awardID":"0829553","effectiveDate":"2008-01-01","expirationDate":"2009-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1687","name":"ITR MEDIUM (GROUP) GRANTS"}}],"PIcoPI":["315316"],"PO":["565227"]},"130489":{"abstract":"Long-Lived Data Collections: Models and Case Studies<br\/><br\/>Modern science, social science and engineering generate and rely upon massive amounts of electronic data and complex digital objects. Sky data collected through telescopic arrays, computer structural models of the earth's crust, demographic information from national and international public opinion surveys, and the ever growing body of genetic information add terabytes daily to the nation's knowledge base. To preserve such information over time digital repositories have been created by government agencies, scientific consortia, universities, and even for-profit corporations. Some of these data repositories have flourished and persisted; others have not. <br\/><br\/>Long-Lived Data Collections: Models and Case Studies is a two-year project to determine why and how certain data repositories have achieved long lives, and how the scientific community can apply the lessons of longevity in forming and maintaining new data repositories. The project is analyzing eight well established, long-lived collections of data and digital resources from a wide range of disciplines to identify the practices, strategies and mechanisms that have enabled them to sustain massive data collections over substantial periods of time. Aside from simple longevity, the basis for measuring the relative effectiveness of the repositories is the requirements for digital preservation repositories enumerated in the CRL\/OCLC Trustworthy Repositories Audit and Certification: Criteria and Checklist: http:\/\/www.crl.edu\/PDF\/trac.pdf. The project is focused particularly on funding, organizational, and governance models adopted by the repositories, and it is assessing the role that feedback and accountability mechanisms play in their sustainability. <br\/><br\/>The Long-Lived Data Collections project is producing risk assessment tools and cost data to inform future planning of and investment in Cyberinfrastructure by federal agencies, universities, scientific consortia and other stakeholders across the entire spectrum of science, engineering, and social science communities.","title":"Long-Lived Data Repositories","awardID":"0726250","effectiveDate":"2008-01-01","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0111","name":"Office of CYBERINFRASTRUCTURE","abbr":"OCI"},"pgm":{"id":"7684","name":"STRATEGIC TECHNOLOGIES FOR CI"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":[346255],"PO":["565136"]},"133735":{"abstract":"Ibarra <br\/>0742675 <br\/><br\/>This 3-day workshop is to be jointly sponsored by NSF and the science agencies of Latin America (Peru, Chile, Brazil, others). The workshop will explore opportunities, challenges and breakthrough activities to help bring international collaborative genomics research to a new level. The meeting will include 30-40 invited genomics researchers, CI technologists, and funding agency representatives. It will focus on identifying activities that will enable North and Latin American partnerships, with an eye towards a more inclusive western hemisphere approach. Outcomes will include recommendations for follow-up activities and suggestions for investments to promote international genomics-CI research, education and outreach collaborations. Key foreign collaborators in Peru are Dr. Gisella Orjeda, Head of the Genomics Research Unit, and Dr. Jose Segovia Juarez, professor, department of Physics, Informatics and Mathematics.at the University Peruana Cayetano Heredia. This workshop will be jointly supported by the Office of International Science and Engineering, the Office of Cyberinfrastructure, and the Directorate for Computer and Information Science and Engineering.","title":"U.S.-Peru Workshop: International Collaborations in Cyberinfrastructure-enabled Genomics workshop","awardID":"0742675","effectiveDate":"2008-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"01","name":"Office of OFFICE OF THE DIRECTOR                  ","abbr":"O\/D"},"div":{"id":"0109","name":"Office of INTL SCIENCE & ENGINEERING","abbr":"OISE"},"pgm":{"id":"7299","name":"Catalyzing New Intl Collab"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"7369","name":"INTERNATIONAL RES NET CONNECT"}}],"PIcoPI":["564024"],"PO":["565266"]},"143679":{"abstract":"Communication networks are critically important in the<br\/>dissemination of information in today's technological<br\/>society. Several academic disciplines have undertaken<br\/>the study of various aspects of their operation, but<br\/>an integrated theory of networking has been elusive.<br\/>The objective of network optimization theory is to<br\/>most effectively use network resources, but recent<br\/>work in network coding has demonstrated that a standard<br\/>assumption of flow conservation from this theory has<br\/>imposed artificial restrictions on the workings of<br\/>communication networks. Network information theory<br\/>considers more general models of communication and<br\/>offers some bound on the limits of information transfer<br\/>in a communication system involving multiple senders<br\/>and receivers.<br\/><br\/>This research fuses aspects of network optimization<br\/>theory and network information theory in order to find<br\/>and specify new limits of information transfer across<br\/>a communication network. The investigators use the<br\/>two-way channel from information theory as a general<br\/>model of the transmission medium between neighboring<br\/>processors of a communication network and address<br\/>fundamental optimization problems pertaining to the<br\/>analysis and design of networks of two-way channels.<br\/>The investigators seek optimal routing algorithms in<br\/>multicast settings and a broad classification of<br\/>situations where network coding can or cannot improve<br\/>upon routing. The investigators further aim to<br\/>categorize network scenarios in which a bidirected<br\/>cut set bound derived using information theoretic<br\/>arguments is tight and to explore a network information<br\/>counterpart to Kirchoff's law when the bidirected<br\/>cut set bound is not tight. The research also<br\/>involves extending the notion of minimal cost flow<br\/>as an initial approach to treating quality-of-service<br\/>issues and devising networks with least cost or<br\/>capacity that meet requirements on information transfer.","title":"Limits of Information Flow in Networks of Two-Way Channels","awardID":"0832810","effectiveDate":"2008-01-01","expirationDate":"2009-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["509405"],"PO":["432103"]},"133417":{"abstract":"This award funds risk reduction activities for a future, experimental network infrastructure that will allow researchers from diverse disciplines across computer and information science and engineering as well as from economics and the social sciences to escape today's Internet-circumscribed research environment. This infrastructure will allow researchers to program their own unique networks (i.e., multiple end-to-end \"slices\") that run on federated, heterogeneous backbones and edge networks to try out new protocols (that may or may not be TCP\/IP-based), new architectures inspired by recent discoveries in economic game theory or artificial intelligence (that didn't exist when the Internet was first imagined), and\/or new cross-layer research whereby functionalities that incorporate human values, such as information privacy or security, for example, become integral parts of the network architecture as opposed to an afterthought. The intention is for this infrastructure to be deeply instrumented so that researchers will be able to monitor their ongoing experiments, collect data on the use of novel protocols, designs and architectures, and analyze the emergent behaviors of traffic. Major outcomes from this project include 1) identification and reduction of technical risks, and 2) broadening and strengthening community participation in planning the experimental network infrastructure. Significant outreach activities will include the widest possible array of research and education communities in dialogue about the scope and scale of research on such an infrastructure, which promises to deepen their participation in the design process and helps to ensure that the future infrastructure meets their needs.","title":"System Engineering Risk Reduction","awardID":"0741315","effectiveDate":"2008-01-01","expirationDate":"2012-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7917","name":"NetS RESEARCH RESOURCES"}}],"PIcoPI":["521729"],"PO":["564993"]},"140958":{"abstract":"Humans naturally use dialog and gestures to discuss complex phenomena and plans, especially when they refer to physical aspects of the environment while they communicate with each other. Existing robot vision systems can sense people and the environment, but are limited in their ability to detect the detailed conversational cues people often rely upon (such as head pose, eye gaze, and body gestures), and to exploit those cues in multimodal conversational dialog. Recent advances in computer vision have made it possible to track such detailed cues. Robots can use passive measures to sense the presence of people, estimate their focus of attention and body pose, and to recognize human gestures and identify physical references. But they have had limited means of integrating such information into models of natural language; heretofore, they have used dialog models for specific domains and\/or were limited to one-on-one interaction. Separately, recent advances in natural language processing have led to dialog models that can track relatively free-form conversation among multiple participants, and extract meaningful semantics about people's intentions and actions. These multi-party dialog models have been used in meeting environments and other domains. In this project, the PI and his team will fuse these two lines of research to achieve a perceptually situated, natural conversation model that robots can use to interact multimodally with people. They will develop a reasonably generic dialog model that allows a situated agent to track the dialog around it, know when it is being addressed, and take direction from a human operator regarding where it should find or place various objects, what it should look for in the environment, and which individuals it should attend to, follow, or obey. Project outcomes will extend existing dialog management techniques to a more general theory of interaction management, and will also extend current state-of-the-art vision research to be able to recognize the subtleties of nonverbal conversational cues, as well as methods for integrating those cues with ongoing dialog interpretation and interaction with the world.<br\/><br\/>Broader Impacts: There are clearly many positive societal impacts that will derive from this research. Ultimately, development of effective human-robot interfaces will allow greater deployment of robots to perform dangerous tasks that humans would otherwise have to perform, and will also enable greater use of robots for service tasks in domestic environments. As part of the project, the PI will conduct outreach efforts to engage secondary-school students in the hope that exposure to HRI research may increase their interest in science and engineering studies.","title":"HRI: Perceptually Situated Human-Robot Dialog Models","awardID":"0819984","effectiveDate":"2008-01-01","expirationDate":"2012-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7632","name":"HUMAN-ROBOT INTERACTION"}}],"PIcoPI":["515704"],"PO":["565227"]},"136193":{"abstract":"This project develops a new Research Experience for Undergraduates site focused on sensor networks and data security at the University of Missouri - Rolla. The research is in areas of national need and importance and of interest to undergraduates. The project plans to recruit students from under-represented groups through partnership with a diverse set of academic institutions. Undergraduate students participate in a ten-week summer research program at the host institution. The project includes mentorship by faculty and graduate students, collaborative and individual research experiences, seminar and guest speakers, training in ethics, and other professional development opportunities for the participating students.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the project team. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications that could result in advances to the current research in these important areas.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups. The relationships developed during the project could lead to future collaborations among the institutions of the participating students that may enable the students to continue their research and professional growth after the summer experience. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Research and Training Experience for Undergraduates in the Area of Sensor Computing","awardID":"0754959","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["523155","554583"],"PO":["564181"]},"134171":{"abstract":"The project creates and evaluates two techniques for interaction design by example modification. The first of these techniques will be a direct manipulation technique for modifying existing web applications, the digital equivalent of adding additional padding to a backpack shoulder strap. This direct manipulation approach will be based on the d.mix technology for web mash-ups. The second proposed technique will introduce of runtime tuning into the user interface. Tuning in an interface is the ability for designers to mark certain attributes in a user interface as tunable, these may be either continuously variable attributes such as color, or discretely distinct variations of a sub-piece of the design. In a tunable user interface, designers will be provided with an additional tuning view on a separate display at runtime that enables them to interactively vary the denoted attributes; the tunable prototype will employ a USB mixing board for controlling the attributes, so as to provide a ready-to-hand physical interface. The goal of this research is to understand whether introducing techniques for rapidly modifying existing interfaces actually impacts the quality of creative design. <br\/><br\/>Broader Impacts: The proposed research will help pave the way for computer science research on creativity by offering an example of how CS research can draw on science?s understanding of human cognition and on ethnographic fieldwork as resources for tool design. The project will release software on the web as open source. This will help practitioners who would like to use these tools, as well as research and industrial efforts to extend the research and development manifest in our tools.","title":"SGER: Leveraging Grassroots Creativity for Interaction Design: Infrastructure Support for Design Thinking","awardID":"0745320","effectiveDate":"2008-01-01","expirationDate":"2009-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7655","name":"ITR-CreativeIT"}}],"PIcoPI":["390884"],"PO":["424970"]},"144094":{"abstract":"Dialog-based technologies play an ever-increasing role in our lives. The interest in conversational interfaces stems not only from their importance for universal access, but also because they can be used in settings in which traditional hands-on interface devices are not practical. Efforts are underway to extend the use of dialog systems into new roles, including: becoming companions to help seniors remain independent; moving some aspects of healthcare outside of the clinical setting; providing entertainment and interactive theater experiences; and improving disaster response. In many of these systems, the computer conversational partner is presented as a talking head or graphical persona. Although designers of dialog systems aim to make them simple and natural to use, major gaps in our understanding of human-computer interaction create obstacles to achieving this goal.<br\/><br\/>Some of these gaps are likely to be filled by examining recent psycholinguistic models of human conversational interaction. These models explore the time-course with which information coming from the context of conversation affects language processing. This context includes the shared information, or common ground, between interlocutors, as well as the processes by which reference to items in common ground is coordinated. One property of negotiated reference concerns the establishment of conceptual pacts, which are a (usually implicit) agreement to refer to an item in common ground from the same conceptual perspective. Recent psycholinguistic findings have examined whether conceptual pacts in conversation are speaker-specific, and how quickly this information is used during comprehension. To the extent that speaker-specific conceptual pacts have significant and immediate effects on the interpretation of reference in human-human interaction, dialog systems utilizing computer-based partners should take these characteristics into account in human-computer interaction.","title":"Collaborative Research: HRI: Establishing and Breaking Conceptual Pacts with Dialog Partners","awardID":"0835396","effectiveDate":"2008-01-28","expirationDate":"2010-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7367","name":"HUMAN-CENTERED COMPUTING"}}],"PIcoPI":[384116],"PO":["565227"]},"136295":{"abstract":"This project renews a Research Experience for Undergraduates site focused on computational science and cybersecurity at the University of Houston. Each year, ten students are to be recruited from institutions that offer limited research opportunities. The program emphasized steering non-traditional students into research, reinforcing their interest in computer science, and providing professional development opportunities for the students. Research in these areas of national importance is overseen by an interdisciplinary team of faculty mentors and is reinforced through site visits to cutting-edge research laboratories in the local area.<br\/><br\/>The intellectual merit of this project lies in strong research basis and the expertise of the faculty. The projects are in major current research areas that are of interest to the community at large and that have clear practical applications.<br\/><br\/>The broader impacts of the project include providing a quality research experience to undergraduate students, particularly students from underrepresented groups and from institutions with limited research environments. Thus this project has the potential to produce new computer science graduate students and faculty members and to advance discovery and understanding while promoting learning.","title":"REU Site: Research Experience for Undergraduates in Computational Science and Cybersecurity","awardID":"0755500","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["528483","528484"],"PO":["564181"]},"131060":{"abstract":"Massive amounts of protein sequence data are derived from such large-scale DNA sequencing efforts as the Human Genome Project. However, the rate of new protein sequences is growing exponentially relative to that of protein structures being solved by experimental methods. Once a protein sequence has been determined, deducing its unique three-dimensional native structure is a daunting task. Such experimental methods to determine detailed protein structure as x-ray diffraction studies and nuclear magnetic resonance analysis are highly labor intensive. Computational approaches offer a considerably faster and cheaper alternative. However, despite substantial efforts, the protein folding still remains largely unsolved.<br\/><br\/>Prediction of the three-dimensional structure greatly benefits from information related to secondary structure, solvent accessibility, and non-local bonds that stabilize a protein's structure. Thus, prediction of such components is vital to our understanding of the structure and function of a protein. In this context, the investigators focus on protein secondary structure prediction, beta-sheet topology prediction, and contact map prediction. They study a Bayesian beta-sheet model to characterize the non-local interactions in beta-sheets. Starting with the secondary structure and solvent accessibility predictions, the model scores possible beta-sheet architectures by considering groupings of beta-strands into beta-sheets, spatial arrangement of beta-strands in each sheet, interaction types of beta-strands, and base pairing patterns of the amino acid residues on interacting segment pairs.<br\/><br\/>The investigators also improve the accuracy of secondary structure predictions by modeling the non-local interactions in beta-sheets. This is achieved by a two stage approach. First, suboptimal segmentations of secondary structure are generated from a hidden semi-Markov model. Then, each segmentation score is updated using the beta-sheet model. Finally, the prediction is computed by applying a voting procedure.","title":"Understanding the Book of Life: Non-Local Interaction Modeling for Protein Beta-Sheets and Its Integration to Protein Structure Prediction","awardID":"0728808","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[347935],"PO":["564898"]},"135372":{"abstract":"Today, mankind's scholarly knowledge is stored in millions of papers that are often not the best format to keep track of scientific results, in 10,000s of databases that are rarely interlinked, 1,000s of software repositories with no central search facility, and of course in experts heads distributed around the globe and across the landscape of science. Many scientific projects and experiments require access not only to results published in papers but also to the raw or processed data used, the services\/algorithms\/tools applied, the people which performed the work as the paper might not report results in a way that the experiment can be re-run, or new data can be analyzed using the same tools, or all experts familiar with a dataset\/algorithm can be retrieved, etc. <br\/><br\/>The proposed workshop aims to identify the general features of cyber-enabled knowledge management tools in support of discovery. Specifically, the focus is on two major challenges: <br\/>* How to better capture and interlink scientific data, algorithms, publications, and expertise? <br\/>* How to improve access, navigation, understanding, and discovery by means of visual interfaces to digital resources such as scientific data, algorithms, publications, and expertise?<br\/>The two challenges and potential solutions will be discussed in detail using two application domains of major economic and societal importance: science of science studies and biomedical research. <br\/><br\/>The two-day workshop will bring together about 20 leading US and international experts in databases, digital libraries, cyberinfrastructure\/e-Science design, social science of cyberinfrastructure, as well as practitioners in the areas of science of science studies and biology. The goal of the workshop is to identify high impact research directions, technological opportunities, synergistic collaborations across disciplines and application domains towards more effective knowledge management and visualization tools that will support discovery and innovation. <br\/><br\/>Workshop Web site (http:\/\/vw.indiana.edu\/cdi2008) provides relevant material and will be used for disseminating the resulting workshop report.","title":"NSF Workshop on Knowledge Management and Visualization Tools in Support of Discovery","awardID":"0750993","effectiveDate":"2008-01-01","expirationDate":"2009-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"7364","name":"INFO INTEGRATION & INFORMATICS"}}],"PIcoPI":["519649"],"PO":["563751"]},"129543":{"abstract":"Communications networks increasingly rely on robust, accurate monitoring systems to help network operators detect disruptions, misconfigurations, and failures. Accurate monitoring techniques detect disruptions when they occur (with a negligible number of false alarms), and identify the source of the disruption, for example, the faulty network element, the source of unwanted traffic. Robust monitoring detects disruptions when measurements may be noisy, incomplete, or when attackers are actively trying to disguise their presence. Network monitoring is most accurate when distributed; that is, when it draws upon observations from a large number of vantage points. Monitoring is more robust when it is network-level; that is, when it can rely on properties of the network traffic, rather than on other features such as traffic content. The researchers are developing techniques for distributed, network-level monitoring and incorporating these techniques into a distributed data management system for detecting network disruptions in two areas: internal network faults and failures, and external threats and unwanted traffic.<br\/><br\/>The research has three themes: (1) Online, distributed, detection algorithms; (2) Informed actuation that uses passive measurements as a baseline, judiciously choosing active measurements to issue in support of the passive measurements, (3) Incorporating these techniques into real-world systems to evaluate the practicality of the schemes and their applicability in realistic network monitoring settings. We will evaluate our algorithms in two settings: detection of internal network disruptions (e.g., failures, faults and misconfigurations within a single network, such as a campus or enterprise network); and fast detection of global threats (e.g. spam, botnets).","title":"Collaborative Research: NeTS-NBD: SCAN: Statistical Collaborative Analysis of Networks","awardID":"0722077","effectiveDate":"2008-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7363","name":"RES IN NETWORKING TECH & SYS"}}],"PIcoPI":["451018"],"PO":["565090"]},"134570":{"abstract":"The emergence of miniature sensors with low-power wireless transceivers holds the promise of a new phase in the wireless revolution. Sensor networks have the ability to collect and transmit environmental data through the ubiquitous deployment of inexpensive wireless devices. This project addresses some of the most important current issues in wireless sensor networks. It seeks to develop an integrated framework for the combined analysis of sampling, distributed signal processing, and data dissemination in the context of delay-sensitive applications. Understanding the interplay between data gathering, resource allocation, and overall performance in wireless sensor networks necessitates a new mindset and a global system perspective. To this end, this project introduces a methodology for the analysis and the design of delay-sensitive sensor networks based, in part, on large deviations, queueing theory, and network calculus.<br\/><br\/>Systems composed of hundreds or thousands of wireless sensors make the dense sampling of stochastic environments possible. The amount of data generated by such large numbers of devices is equally vast, and it creates new challenges for the processing and transmission of observed data. Novel methods of analysis are required to provide insight into the efficient design and conception of sensor networks. As part of this research project, techniques from large-deviation theory and asymptotic analysis will be extended and applied to distributed sensing. These techniques will be used to: derive guidelines for node placement in correlated fields, propose novel paradigms for communication over multihop sensor networks with statistical delay guarantees, develop access control strategies that utilize the information content of individual packets, and characterize the interplay between in-network signal processing and traffic profiles for event-driven applications.","title":"CAREER: Information-Aware Wireless Sensor Networks","awardID":"0747363","effectiveDate":"2008-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["381516"],"PO":["564898"]},"131061":{"abstract":"This project studies the intrinsic power and limitations of current and future computing devices. The focus lies on so-called NP-complete problems, a ubiquitous class of computational problems and the subject of one of the seven millennium prize questions proposed by the Clay Mathematics Institute as grand challenges for the 21st century. No efficient algorithms for NP-complete problems are known. Such algorithms would have many applications in science and engineering but would also jeopardize the security of internet communication. In fact, all the cryptographic systems currently in use hinge on the assumption that there do not exist efficient algorithms for NP-complete problems. The goal of this research is to make progress in establishing that premise by showing that NP-complete problems do not have efficient algorithms that use a small amount of memory space.<br\/><br\/>The investigator and other authors have shown that satisfiability does not have a deterministic algorithm that runs in time n^c and space n^d for certain nontrivial combinations of the constants c and d. The same holds for other natural NP-complete problems. This project intends to quantitatively improve the time-space lower bounds for NP-complete problems in the deterministic model. A concrete objective for satisfiability is a quadratic time lower bound for subpolynomial-space algorithms. The project also aims to establish similar lower bounds in the randomized and the quantum model, where currently nothing nontrivial is known. An ambitious long-term goal is to prove superpolynomial lower bounds for subpolynomial-space algorithms that solve more complex NP-hard problems like the permanent.","title":"Time-Space Lower Bounds for NP-Hard Problems","awardID":"0728809","effectiveDate":"2008-01-01","expirationDate":"2010-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565082"],"PO":["565157"]},"132183":{"abstract":"Modern global society is increasingly reliant on computing and information professionals to serve key roles in creating, managing, and maintaining the global computing and information infrastructure that is critical to research, education, commerce, and quality of life. As such, computing and information professionals need to learn not only technical skills but also how to resolve ethical issues such as in\/outsourcing, intellectual property, and information privacy. Working in the new global economy requires that computing and information professionals are able to consider the range of cultural values and ethical perspectives as represented by leading thinkers such as Aristotle, Bentham, Buddha, Confucius, Gilligan, and Kant. To broaden and deepen the ethical perspectives of computing and information professionals, it is essential to develop and teach courses in computing and information ethics as part of professional graduate programs in computer science and the interdisciplinary information field. Further, to enable current and future computing and information professionals to appreciate and understand the relevance of ethics in their work, it is necessary to find educationally motivating ways to engage graduate students in professional computing and information programs to consider key ethical issues. In this project the PIs hope to accomplish this goal through development and evaluation of an educational simulation for computing and information ethics, which serves as the cornerstone for an innovative course focusing on the role of values and ethics in computing and information within a global society. Building on their prior research, the PIs will explore three main research questions: How do graduate students in a computing and information ethics course use educational simulation software to gain understandings of and hands-on experiences with important computing and information ethics issues such as intellectual property in a global society? Does geographical co-location have an impact on use of the simulation in the context of an internationally-oriented computing and information ethics graduate course with a diverse range of students? Do students in a graduate-level computing and information ethics course benefit most from interaction with peers, or with the software agents developed through this project?<br\/><br\/>Broader Impacts: Project outcomes will include a free and open-source simulation for computing and information ethics, which allows students both to participate in and learn from cases, and to develop and implement their own cases that they can then share with peers. The PIs will develop a novel and highly participatory course built around the simulation, which will be implemented in professional computing and information master's programs across the country and the world, and which will better prepare computing and information professionals to deal with ethical issues throughout their careers.","title":"Collaborative Research: Educational Simulation for Computing and Information Ethics","awardID":"0734879","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2878","name":"SPECIAL PROJECTS - CCF"}}],"PIcoPI":["548125"],"PO":["565227"]},"130270":{"abstract":"0725190<br\/>Tao Xie<br\/>North Corolina State University<br\/><br\/>0725202<br\/>Orso, Alessandro<br\/>GA Tech Research Corp<br\/><br\/>SOD Team: Designing Tests for Evolving Software Systems<br\/><br\/>Software artifacts continue to evolve throughout their (often long) lifetime, and maintaining them is one of the most expensive activities in software development. A considerable percentage of maintenance costs are due to regression testing, which consists of retesting the software after it is modified and is a crucial part of maintenance. Previous research on regression testing has mostly focused on the efficiency of this activity, while little emphasis has been placed on assessing and improving regression-testing effectiveness. The goal of<br\/>this project is to fill this gap through the definition of techniques for (1) determining the adequacy of a test suite with respect to a set of software changes, and (2) providing automated support for designing and developing test cases that target inadequately-exercised changes. To achieve this goal, the research will perform three main tasks: define techniques that combine dependence- and state-related information to generate regression-test requirements for changed software; define techniques based on static and dynamic analysis for developing test cases that satisfy the identified requirements; and evaluate the techniques defined in the project through rigorous experiments and industrial case studies. This research directly addresses the stated goals of this program by targeting the development of techniques that can improve the processes of<br\/>constructing and modifying software-intensive systems.","title":"Collaborative Research: SoD-TEAM: Designing Tests for Evolving Software Systems","awardID":"0725190","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7652","name":"SCIENCE OF DESIGN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}}],"PIcoPI":["562727"],"PO":["564388"]},"140292":{"abstract":"The aquatic research community is rapidly equipping ecological sites with a broad range of sensors and instruments. However, the development of aquatic sensing networks is significantly lagging terrestrial counterparts. It is widely recognized that an aquatic counterpart to low cost, low power, wireless radios is needed to advance the state-of-the-art in underwater sensor networks. Unfortunately, there are few open-architecture, low power and low cost underwater acoustic modems. <br\/><br\/>This project looks at an alternative hardware platform for wireless underwater communication. Reconfigurable devices will be used to create a software defined acoustic modem (SDAM) ? the underwater counterpart to software defined radios being proposed for future generations of terrestrial communications. The SDAM can be remotely programmed, which enables adaptive sensing capabilities and changes to the network without physically retrieving the device. Since the communication protocol is programmed into the modem, the same SDAM board can be used for a variety of different underwater environments. <br\/><br\/>The ultimate goal is to develop a prototype SDAM that uses a reconfigurable device for physical layer processing. This requires careful design of a system architecture that can communicate with the sensors, interface with acoustic transducer(s), efficiently compute physical layer algorithms, and provide services to the rest of the network stack. <br\/><br\/>The broader impacts of this project center around the incorporation of embedded and reconfigurable computing systems into course material, and the use of the SDAM for ecological research, which enables long-term understanding of many ecological processes, including the effects of environmental degradation and climate change on coastal and lake ecosystems.","title":"CSR-EHS:Architecture and Design Tools for Software Defined Acoustic Modem","awardID":"0816419","effectiveDate":"2008-01-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["560817"],"PO":["561889"]},"139324":{"abstract":"ExPert: dynamic analysis based fault location via Execution Perturbations<br\/><br\/>Abstract<br\/><br\/>This project is studying dynamic characteristics of runs of faulty programs and<br\/>designing promising dynamic analysis techniques to identify executed program<br\/>statements where a fault lies, i.e. the fault candidate set. To narrow the set of<br\/>statements in the fault candidate set, an array of automated dynamic analyses are<br\/>being used in conjunction with each other. These analyses consider not only the<br\/>failed run but also execution perturbations of this faulty run. The goal of this<br\/>work is to focus the users attention on a small subset of statements in the<br\/>fault candidate state. Identification of fault candidate set is based upon<br\/>uncovering of two types of evidence: negative evidence and positive evidence. <br\/>A negative evidence is considered as an indicator that leads to the conclusion <br\/>that a value encountered during a failed program run is related to the program's <br\/>failure. Positive evidence on the other hand indicates that some of the values <br\/>computed during a failed run are in fact correct. Through a combination of negative<br\/>and positive evidence we aim to produce a small fault candidate set. As part of <br\/>this work we are identifying new sources of evidence. We are also carrying out a <br\/>systematic integration of above dynamic analyses technology into a practical <br\/>debugging environment.","title":"ExPert: dynamic analysis based fault location via Execution Perturbations","awardID":"0810906","effectiveDate":"2008-01-01","expirationDate":"2011-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7354","name":"COMPUTER SYSTEMS"}}],"PIcoPI":["549718"],"PO":["535244"]},"130272":{"abstract":"0725202<br\/>Orso, Alessandro<br\/>GA Tech Research Corp<br\/><br\/>0725190<br\/>Tao Xie<br\/>North Corolina State University<br\/><br\/>SOD: Team: Designing Tests for Evolving Software Systems<br\/><br\/>Software artifacts continue to evolve throughout their (often long) lifetime, and maintaining them is one of the most expensive activities in software development. A considerable percentage of maintenance costs are due to regression testing, which consists of retesting the software after it is modified and is a crucial part of maintenance. Previous research on regression testing has mostly focused on the efficiency of this activity, while little emphasis has been placed on assessing and improving regression-testing effectiveness. The goal of<br\/>this project is to fill this gap through the definition of techniques for (1) determining the adequacy of a test suite with respect to a set of software changes, and (2) providing automated support for designing and developing test cases that target inadequately-exercised changes. To achieve this goal, the research will perform three main tasks: define techniques that combine dependence- and state-related information to generate regression-test requirements for changed software; define techniques based on static and dynamic analysis for developing test cases that satisfy the identified requirements; and evaluate the techniques defined in the project through rigorous experiments and industrial case studies. This research directly addresses the stated goals of this program by targeting the development of techniques that can improve the processes of<br\/>constructing and modifying software-intensive systems.","title":"Collaborative Research: SoD-TEAM: Designing Tests for Evolving Software Systems","awardID":"0725202","effectiveDate":"2008-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7352","name":"COMPUTING PROCESSES & ARTIFACT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7652","name":"SCIENCE OF DESIGN"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7798","name":"SOFTWARE & HARDWARE FOUNDATION"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7944","name":"SOFTWARE ENG & FORMAL METHODS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"7298","name":"COLLABORATIVE RESEARCH"}}],"PIcoPI":["550999","530729"],"PO":["564388"]},"131174":{"abstract":"Despite the success of the Internet, its bandwidth overprovisioning, redundancy in its connectivity, and increased understanding of operation, Internet users still experience congestion and service disruption. Furthermore, network applications are increasingly sophisticated requiring greater reliability and higher bandwidth. Particularly proliferation of high bandwidth one-to-many multimedia applications is imminent. Without effective network design schemes in place, users inevitably encounter occasional network service degradation or breakdowns. This research aims to design, implement, and evaluate network architecture for one-to-many high bandwidth applications through multiple layer perspectives toward achieving optimal resource usage, performance and reliability. <br\/><br\/> <br\/><br\/>The PI will develop scalable and efficient algorithms of design and reconfiguration of virtual topologies for multicast while supporting unicast in optical layer; investigate the trade-off among overhead, scalability, and reliability in IP over optical network models; explore efficient multimedia delivery schemes particularly over multi-provider networks; and analyze multi-layer interaction and necessary cooperation for multicast applications. <br\/><br\/> <br\/><br\/>The intellectual merit lies in taking a holistic multi-layer approach to large scale multicast support in the presence of unicast applications so as to address the optimization issues practically. The implicit or explicit cooperation of multiple layers provides new dimensions to network design for one-to-many high bandwidth applications. The developing of optimization algorithms and the quantifying the performance benefits of innovations are expected to have a wide applicability in computer science.<br\/><br\/>The project will broadly impact the universities, industry and research community in a number of ways by reaching out to students from underrepresented groups for the research projects, enhancing the quality of education by integrating the latest research developments into instructional activities of undergraduate and graduate curriculum, and making project results available widely.","title":"On Optimization Issues In Supporting High Bandwidth Multimedia Applications","awardID":"0729197","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7933","name":"NUM, SYMBOL, & ALGEBRA COMPUT"}}],"PIcoPI":[348204],"PO":["565157"]},"134485":{"abstract":"A central theme in post-genomic research is the dissection and understanding of the complex dynamical interaction involved in gene regulation. Recent advances in technology have enabled biologists to investigate gene expression and regulation in single cells on a whole-genome scale, which reveals that the amount of mRNA and protein expressed from a gene is a stochastic process. While such experimental studies have provided valuable insights on gene regulation, a computational approach based on stochastic methods is essential to understanding dynamic gene interaction, since intuitive interpretations from experimental results cannot fully expose the dynamics of a gene network. However, the current stochastic approach does not provide sophisticated modeling techniques, analytical methods and efficient simulation algorithms.<br\/><br\/>This research employs a module-based approach to modeling large gene networks, similar to that used in analyzing electronic circuits, and aims to develop computational tools for analyzing and simulating gene networks. The investigator pursues the following three research thrusts: 1) derive a general stochastic model for gene expression and statistical methods for estimating model parameters based on experimental results, 2) characterize some common modules in gene networks and develop a module-based approach to analyzing gene networks, and 3) devise efficient stochastic simulation methods for large gene networks. The computational approach employed in this project will potentially have major impact on biological research, since it will shed light on many unanswered questions related to the stochasticity in gene regulation. The computational tools developed in this project will find numerous applications in biological research related to the design of drugs and synthetic gene circuits, as well as the investigation of diseases, such as cancer. The methods devised in this research can also be employed to simulate communication networks and design or optimize network protocols.","title":"CAREER:Stochastic Modeling, Analysis and Simulation of Gene Networks","awardID":"0746882","effectiveDate":"2008-01-01","expirationDate":"2013-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7351","name":"THEORETICAL FOUNDATIONS (TF)"}}],"PIcoPI":["550664"],"PO":["564898"]},"136278":{"abstract":"The Department of Computer Science at the University of Massachusetts Amherst <br\/>is hosting a Summer Information Technology Research Experience for Undergraduates <br\/>(SITe-REU) under the direction of Professor W. Richards (Rick) Adrion. We are <br\/>recruiting students in community college pathways, i.e., students planning to <br\/>transfer or who have transferred to 4-year programs. Minorities and women are <br\/>proportionally better represented in IT associates degree programs than they <br\/>are in bachelors programs. These students often are the first in their families <br\/>to attend college, may lack family and community mentoring and role models, <br\/>frequently are focused on job opportunities, and seldom think about graduate <br\/>programs or research careers. Reaching out to this diverse student population <br\/>to attract, retain and nurture them in upper division and graduate programs is <br\/>the primary goal of our REU Site. We are partnering with three NSF BPC, two <br\/>LSAMP, and one EGEP alliances and others to cast a wide net and bring a diverse <br\/>set of students into positive research experiences. <br\/><br\/>Each spring we will select 10 rising juniors or seniors to participate in a <br\/>10-week summer research experience. We identified research projects for the <br\/>students that emphasize fundamental computer science that is core to addressing <br\/>a broad set of IT challenges. Projects include: Robotics (sensor fusion for <br\/>manipulation, emergency detection of immanent collision); Bioinformatics and <br\/>Biocomputing (memory, circadian, or tumor modeling, protein folding, gene <br\/>regulation); Wireless Networks (the DieselNET location system, database, and <br\/>diagnostics, the TurtleNET wildlife tracking net); Learning Systems (pedagogical <br\/>agents for intelligent tutors, jMANIC, Ubiquitous\/Auto Presenter); Software <br\/>engineering (medical error modeling, dispute resolution systems); Security\/Privacy <br\/>(medical Devices, RFIDs); and Data Mining (models for social nets).","title":"REU-Site: A Summer Information TEchnology Research Experience for Undergraduates (SITe-REU)","awardID":"0755376","effectiveDate":"2008-01-01","expirationDate":"2011-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1139","name":"RSCH EXPER FOR UNDERGRAD SITES"}}],"PIcoPI":["533875"],"PO":["523800"]}}