{"41948":{"abstract":"Abstract<br\/> <br\/>IIS-9908675<br\/>Hollerbach, John<br\/>University of Utah<br\/>$75,000 - 12 mos.<br\/><br\/>Motion Display in the Treadport Locomotion Interface<br\/><br\/>Locomotion interfaces represent a new field, and at this early stage<br\/>there are many uncertainties about the best approaches. This exploratory<br\/>research is concerned with the mechanical display of slope,<br\/>inertia, and turning on a treadmill-based locomotion interface, the <br\/>Sarcos Treadport. The Sarcos Treadport comprises a linear tilting <br\/>treadmill, an active mechanical tether, and a CAVE-like visual display. <br\/>The active mechanical tether, which is the unique aspect of the Treadport,<br\/>measures user position and applies axial forces to the user.<br\/>Although the treadmill is a linear device, the research aims to show that the<br\/>tether coupled to the visual display provides a reasonable basis for<br\/>turning control. The force-producing capability of the active tether<br\/>offers the unique ability to simulate inertial forces during running,<br\/>which are otherwise absent because the user is stationary. Treadmill<br\/>tilt mechanisms are typically too slow to display rapid slope changes.<br\/>By pulling on the user to simulate uphill walking and pushing for<br\/>downhill walking, the active mechanical tether can simulate gravity.<br\/>The PIs propose to conduct a series of biomechanical, modeling, and<br\/>psychophysical studies to demonstrate the proposed motion displays for<br\/>turning, inertial force, and slope using an active mechanical tether.<br\/>The objective is to show that adding a mechanical tether to linear <br\/>treadmills is a useful and reasonable approach towards locomotion <br\/>interfaces, and that the proposed locomotion display approaches have <br\/>some scientific basis and are effective from a user standpoint.","title":"Motion Display in the Treadport Locomotion Interface","awardID":"9908675","effectiveDate":"1999-07-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["560997","513354"],"PO":["475621"]},"38080":{"abstract":"Abstract<br\/><br\/>IIS-9874771<br\/>University of California, Davis<br\/>Samuel Armistead<br\/>$182,715<br\/><br\/>DLI Phase 2: Folk Literature of the Sephardic Jews: A Multi-tiered Extensible Digital Archive<br\/><br\/>The Armistead-Silverman collection at the University of California at Davis contains fifteen hundred \"Judeo-Spanish\" narrative ballads, together with other genres, including lyric poetry, folktales, proverbs, and riddles. The oral traditions preserved in the language also known as ``Ladino'' but called ``Judeo-Spanish'' in this grant proposal, were gathered by Professors Farmstead, Katz, and Silverman during the years 1957-1980 from<br\/>informants from Bosnia, Macedonia, Bulgaria, Greece, Turkey, Morocco, Israel, Spain, and the United States. This material is the largest collection of Judeo-Spanish oral literature in North America, and one of the three largest in the world. The Judeo-Spanish oral tradition preserves a cultural legacy for the study of Sephardic Jewry as well as for<br\/>researchers in the history of pan-Hispanic and pan-European balladry. This oral tradition, with roots extending back into Middle Ages, provides a unique matrix within which Hispanic written literature was created.<br\/><br\/>The technical goals of the project are to continue conversion of this material to a multi-media digital corpus so that these materials can be made ,more widely available, with increased access analytic capabilities. Textual transcriptions will be tagged using a number of markup methods, especially XML and a digital audio database will be created. A variety of approaches will be tested to make the archive fully extensible. The<br\/>project will build on earlier research products from other digital libraries projects,<br\/>including the University California, Berkeley digital libraries group.","title":"A Multi-media Digital Library of Folk Literature","awardID":"9874771","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"X277","name":"NEH-DIGITAL LIBRARIES INITATIV"}}],"PIcoPI":[96832,96833],"PO":["433760"]},"38391":{"abstract":"Tomorrow's system software must provide efficient resource management across<br\/>a range of operating environments, and hence needs to adapt its policies<br\/>dynamically to suit its changing environment. Currently such adaptation is<br\/>hampered by modular software architectures that prevent informed adaptation<br\/>by hiding all implementation details. This proposal advocates a new<br\/>approach to building software that enables cooperative adaptation by the use<br\/>of symbiotic interfaces. A symbiotic interface extends a system's<br\/>application programming interface (API) to incorporate high-level<br\/>abstractions designed to both better support the application's needs while<br\/>simultaneously giving the system the information it needs to adapt its<br\/>policies. A symbiotic interface encapsulates user level semantics to improve<br\/>support for the application, and thus improves usability of the<br\/>system. Capturing user-level semantics through the interface discloses<br\/>information to the system, so it can make informed decisions on how to adapt<br\/>to better suit the application's needs. Like symbiotic relationships in<br\/>nature, the symbiotic interface allows mutually beneficial cooperation<br\/>between the application and system. Professor Steere's educational plan<br\/>involves creating advanced courses in systems architecture that focus on<br\/>building adaptive and predictable systems, beginning with a survey course on<br\/>mobile computing that concludes with a project in building adaptive software.","title":"CAREER: Symbiotic Interfaces to Enable Cooperative Adaptation","awardID":"9876217","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["125068"],"PO":["565272"]},"38072":{"abstract":"Abstract<br\/><br\/>IIS-9874747<br\/>Harvard University<br\/>Sidney Verba<br\/>$507,277 - 12 mos.<br\/><br\/>DLI-Phase 2: An Operational Social Science Digital Data Library<br\/><br\/>This proposal is for developing a Virtual Data Center (VDC) for managing and sharing numerical social science data for teaching and research purposes across multiple institutions. This project will refine and extendthe prototype data server developed by the Harvard-MIT Data Center and turn it into a free, portable software product that will integrate with other data centers and library databases by supporting a variety of communication and interoperation protocols. The project is unique in serving as a public<br\/>resource offering an open set of tools, and as a way to test and adapt previous digital library research to the rigors of a production environment. The project will be one of the first to address a number of digital library issues in a production environment, and will serve as a production framework for other types of digital libraries.","title":"DLI-Phase 2: An Operational Social Science Digital Data Library","awardID":"9874747","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"1333","name":"METHOD, MEASURE & STATS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"Y995","name":"DARPA-DIGIAL LIB INIT PHASE II"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1371","name":"POLITICAL SCIENCE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1106","name":"Division of HUMAN RESOURCE DEVELOPMENT","abbr":"HRD"},"pgm":{"id":"1331","name":"SOCIOLOGY"}}],"PIcoPI":[96812,"531617",96814,96815],"PO":["433760"]},"38260":{"abstract":"Proposal number: CCR-9875617<br\/>PI's name: Kshemkalyani, Ajay D<br\/>Institution: University of Illinois at Chicago<br\/>Title: CAREER: Synchronization, Monitoring, and Communication for Distributed <br\/> Agents<br\/><br\/><br\/>Complex distributed applications can use event abstraction to provide <br\/>simplicity to the programmer and system designer by reducing the amount of <br\/>information to be handled. However, it is necessary to retain a fine degree of <br\/>control over the synchronization conditions in the computation. This research<br\/>investigates a framework to provide the necessary control on synchronization <br\/>and communication among the distributed agents by addressing the following. <br\/>First, various forms of synchronization between distributed agents whose <br\/>actions can be viewed at different levels of abstraction are defined. <br\/>Second, mechanisms to specify and enforce the desired forms of synchronization,<br\/>to detect the forms of synchronization that occur, and to monitor the <br\/>computation nonintrusively are designed. Third, algorithms for efficient <br\/>communication among the synchronizing agents are designed and evaluated. <br\/>The research is expected to impact the ease with which the increasingly <br\/>complex distributed applications can be synchronized, controlled, and <br\/>monitored while maintaining a fine degree of control over the synchronization <br\/>involved. This has the potential to simplify the design of the rapidly<br\/>increasing number of large distributed applications.","title":"CAREER: Synchronization, Monitoring, and Communication for Distributed Agents","awardID":"9875617","effectiveDate":"1999-07-01","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["406717"],"PO":["309350"]},"38183":{"abstract":"9875279 Pontelli, Enrico<br\/>The goal of this CAREER project is to study techniques and methodologies for execution of constraint logic programs on parallel and distributed architectures. These models are applied to implicit and explicit parallelization of complex and irregular symbolic applications, such as those arising in Natural Language Processing, Knowledge-based Systems, and Digital Libraries. Parallelization is achieved through novel compile-time analysis algorithms and efficient run-time process and memory management schemes. The models are also employed to support an abstract framework for World-Wide-Web programming, based on distributed constraint logic programming and embedding specialized constraint domains, meta-programming extensions, and Web communication protocols. The framework created serves for rule-based coordination of software components. The activities of this project are expected to advance the state-of-the-art in these research areas and infuse knowledge into NMSU's parallel computing and programming languages educational programs. The educational development relies on curriculum development and on the introduction of novel teaching methodologies and collaborations with existing educational infrastructures. Emphasis is also placed on improving Minority participation in these fields.","title":"CAREER: Parallel and distributed Constraint Programming: methodologies, applications, and educational opportunities","awardID":"9875279","effectiveDate":"1999-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["561141"],"PO":["564388"]},"38194":{"abstract":"9875329 Jonathan G. Rossie Jr. <br\/>The research focuses on programming-language support for the behavioral characterization of observable components in terms of logical finite-state machines. Observable components support two-way messaging protocols with their client code, keeping the clients informed of significant state changes that affect the component's outward utility. The logical state machines provide a vocabulary for this protocol, serving as enforceable characterizations of the component's dynamic protocol. The research objective is to develop practical language mechanisms, rigorous formal foundations, and efficient implementation techniques to support observable components and to exploit the enforceable state machines to improve the safety of component reuse. A safe implementation would protect components from receiving messages out of sequence, and would also protect clients from components that are not faithful to their declared state machines. An essential technology in developing and using these components is a notion of safe substitutability that would account for the state machine and its implied two-way protocols. The research plan includes formal foundations for safe substitutability of components, as well as robust and efficient implementation technology in sequential and concurrent contexts.","title":"CAREER: Safe Observable Components: Programming-Language Support for Object Interaction Protocols","awardID":"9875329","effectiveDate":"1999-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":[97080],"PO":["150697"]},"38095":{"abstract":"Gal<br\/>CCR-9874862<br\/><br\/><br\/>This project studies combinatorial and algebraic models of computation for Boolean functions. Such models are Boolean circuits and formulae, branching programs, span programs and models of communication complexity. The complexity of computational problems in these models corresponds to their inherent complexity in terms of important computational resources.<br\/><br\/>The main questions addressed in this research are: finding new methods for proving complexity lower bounds, the role of randomness and pseudorandomness in the complexity of Boolean functions, and issues of fault tolerance in the above models. The educational component of the project includes the development of an upper level undergraduate course on fault tolerance and error correcting codes, and development of a series of graduate research courses in complexity theory.","title":"CAREER: Combinatorial and algebraic models of computation","awardID":"9874862","effectiveDate":"1999-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["451556"],"PO":["543507"]},"58381":{"abstract":"","title":"Prototype and Distribution of Re-programmable Queuing Modules for Scalable Input Buffered Switches","awardID":"0096052","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["316262"],"PO":["234222"]},"39395":{"abstract":"9900988 Barbara Ryder<br\/>Large industrial-sized software systems (of 1 million lines of code) suffer from a lack of adequate testing and program understanding tools, especially when such systems contain heterogeneous components and\/or legacy codes. Scalable compile-time analysis techniques are needed to serve as a basis for appropriate software tools which can provide adjustable levels of precision for predictable cost. Analysis results should be obtainable for an arbitrary component (e.g., module) of a system, even if the code for the entire system is not available for inspection. The goal of this research is to explore new analyses applicable to these large industrial systems, emphasizing the issues of scalability and unavailability of full system source code. This will be accomplished by design of a schema for \"component data-flow analysis\", a scalable data-flow technique which, given some coarse-grained data-flow information about unavailable program components, is able to apply an acceptably precise data-flow analysis on a particular component whose source code is available. The utility of component analysis will be demonstrated by its application to several data-flow problems useful for testing and program understanding, using a prototype implementation built with the PROLANGS Analysis Framework (PAF), a publically available software platform for compile-time program analysis","title":"Component Data-Flow Analysis for Large-Software Systems","awardID":"9900988","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["438877"],"PO":["564388"]},"39781":{"abstract":"In a semidefinite programming (SDP) problem, a linear function of a symmetric matrix variable X is minimized subject to linear equality constraints on X and the essential constraint that X be positive semidefinite. Several problems can be cast as SCP problems including linear programs, convex quadratic problems with convex quadratic inequality constraints, matrix norm minimization and a variety of maximum and minimum eigenvalue problems. In addition, SDP has many applications in engineering, combinatorial optimization and statistics.<br\/><br\/>Today, it is known that several interior-point algorithms for linear programs can be extended to SDP problems. As in linear programming, many of these methods are polynomially convergent and perform very efficiently in practice. In particular, the class of primal-dual interior-point methods and their higher-order variants are very effective methods for solving SDP problems. In contrast to linear programming, there are many ways one can compute the Newton search directions used in primal-dual algorithms for SDP. For this reason, the theory of primal-dual methods for SDP is substantially more difficult than that for LP. <br\/><br\/>This project addresses the development of the theory and implementation of algorithms for SDP problems. The objectives of this research consist of: 1) advancing the knowledge of the theory of polynomial and superlinear convergence analysis of primal-dual methods for SDP; 2) studying the existence and asymptotic behavior of continuous trajectories for SDP; <br\/>3) developing superlinearly convergent higher-order primal-dual methods for SDP problems which do not have strictly complementary solutions; 4) developing interior-point primal-dual algorithms to solve more general classes of cone programming problems; 5) developing new methods for solving specially structured SDP problems based on nonlinear programming techniques; 6) implementing these new approaches and comparing them against existing SDP methods; 7) extending primal-dual interior point algorithms to the context of nonlinear SDP and complementary problems.<br\/><br\/>This research will lead to new or improved algorithms to find exact or approximate solutions to large-scale optimization problems arising in diverse applications in industry, finance, science, and engineering.","title":"Theory and Implementation of Algorithms for Semi-Definite and Cone Programming","awardID":"9902010","effectiveDate":"1999-07-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["540935"],"PO":["201974"]},"46283":{"abstract":"This proposal requests support for a workshop to be held in Durau, Rumania, in July 1999 to explore the need for and advantages of international cooperation in language technology between US and Romanian researchers. The goals are to look forward to the preparation of Cooperative research efforts between the two countries.","title":"Workshop: Exploring US-Romanian Collaboration in Language Technology","awardID":"9978601","effectiveDate":"1999-07-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["501442"],"PO":["565227"]},"38671":{"abstract":"The proposed project has two main thrusts, aimed at creating efficient and secure cryptographic algorithms and protocols, and providing means for protecting and enhancing privacy in the electronic era.<br\/><br\/>Public-Key Cryptography (PKC) occupies a central position in modern secure communications and electronic commerce. There are a number of fundamental issues, of great practical and theoretical significance, related to PKC. Let ER be a public-key encryption function. Under reasonable assumptions an encryption C = ER(M) protects the secrecy of M. But there are more subtle attacks on ER. Two such threats which are very difficult to protect against, are the chosen ciphertext attack and the malleability attack. In the latter, and adversary may replace, say, the ciphertext C by C* = ER(M + 3), without knowing what M is. A considerable amount of profound work was invested in protecting encryptions against these dangerous attacks. All the generally applicable solutions involved application of general Zero Knowledge Proofs (ZKP) and consequently, while in principle of polynomial complexity, required an inordinate amount of computations. Recently the PI was able to immunize any semantically secure encryption function ER against chosen ciphertext attacks and malleability attacks by considerably more efficient algorithms which do not require ZKPs. A key role is played by a novel and efficient Proof of Plaintext Knowledge Protocol. All these methods are generic, in the sense that they apply to enhance any PK encryption ER. Further development, applications and optimization of these novel methods will be pursued. The overall objective is to achieve a comprehensive, provably secure, and efficient methodology for PKC and its applications.<br\/><br\/>The electronic computing and Internet era exposes individuals to considerable threats to their privacy. The second thrust is aimed at bringing cryptography to bear on the solution of these privacy problems. Again, the emphasis is on truly efficient and provably secure solutions for such problems as secure and privacy preserving access to data bases containing personal data, privacy protection for transactions such as voting.","title":"Efficient Cryptographic Protocols and Protection of Privacy","awardID":"9877138","effectiveDate":"1999-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["184097"],"PO":["543507"]},"49396":{"abstract":"","title":"Modeling Dynamic Task Coordination in Inter-Operating Workflow Management Systems","awardID":"9996381","effectiveDate":"1999-07-01","expirationDate":"2002-07-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}}],"PIcoPI":[126313],"PO":["495796"]},"36582":{"abstract":"CCR-9820879<br\/>Farach-Colton<br\/><br\/>Manipulating metric spaces is a basic task in many areas. Clustering, data visualization, and nearest neighbor searches are some of the standard primitives which come up in almost any data-intensive domain. One of the most useful unifying approaches to addessing these problems involves the notion of an embedding. In an embedding, an input metric is mapped into another metric for which useful algorithms have been developed.<br\/><br\/>This project considers basic algorithmic problems in metric space embeddings. Some of the problems were abstracted from work in image database indexing, protein database indexing and phylogency construction. However, most problems studied are basic algorithmic questions.","title":"Algorithms for Metric Space Embeddings","awardID":"9820879","effectiveDate":"1999-07-15","expirationDate":"2003-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["531670"],"PO":["543507"]},"38672":{"abstract":"CCR-9877139<br\/>Berman<br\/><br\/><br\/>This project conducts research on the design, implementation, and analysis of algorithms for the support of scalable and reliable communication services in distributed networks. The focus centers around important challenges that affect the national network-communication infrastructure and the needs of increasing numbers of network users and services. These challenges included mitigating the stress on network backbone caused by the diminishing locality of network traffic, easing the addition of large numbers of geographically distributed network hosts, implementing fault-tolerant and congestion-tolerant communication methods, and integrating diverse technologies such as fast-switching and mobile communication devices into the national networking infrastructure. A significant obstacle in meeting these challenges is the difficulty of routing, switching, addressing, and guaranteeing delivery of messages in such a large and growing global network. This is a program of fundamental and applied research attacking these scalability and reliability problems using techniques of network algorithms, computational combinatorics and graph theory. The analysis of the topological structure of networks and the algorithmic properties associated with network routing schemes will be the primary focus. Extensive implementations and empirical studies building on the experience using the network platform provided by the Ohio Supercomputer Center and the OCARNet dedicated ATM research network will be performed.","title":"Algorithms and Routing Schemes for Scalable Networks","awardID":"9877139","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["283131",98239],"PO":["543507"]},"38320":{"abstract":"This CAREER award supports the study of image processing and vision. Vision is perhaps the most complex and powerful capability that we possess. Intriguingly vision develops gradually as we grow from infancy to adulthood. This research focuses on two related questions: What is the fundamental structure of visual images that allow this type of learning? What algorithms can be used to learn this structure? Answers to these questions have bearing on the recognition of complex visual patterns, the generation of computer graphics images, and the study of human perception. The technical emphasis of this effort is based on the observation that the distribution of natural images is far from uniform. On the contrary, real images have complex and important statistical structure that can be exploited for image processing, recognition and analysis. Based on these insights, the investigator has developed a non-parametric multi-scale statistical model for images that can be used for recognition, image processing and in a ``generative mode'' to synthesize high quality textures. In this effort the theoretical underpinnings of these algorithms as well as the application to other processing problems are studied. In addition, the award is supporting the development of a class and textbook on the statistical structure of natural images. While emphasizing fundamentals, the course draws together advances in computer vision, image processing, digital television, image compression, the psychology of vision, and the neural basis of vision.","title":"Career: Non-parametric Multi-scale Statistical Models for Natural Signals and Images","awardID":"9875866","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":[97332],"PO":["564898"]},"49342":{"abstract":"","title":"NYI: Parallel Algorithms for Information Retrieval","awardID":"9996322","effectiveDate":"1999-07-15","expirationDate":"2001-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["517717"],"PO":["563751"]},"38342":{"abstract":"Global information systems consist of asynchronous, autonomous components that are open and distributed. These components will need to handle multiple media types and satisfy varying Quality-of-Service(QoS)<br\/>requirements such as responsiveness, reliability, availability, security and cost-effectiveness. Adapting to changing system conditions and application requirements is often difficult and error prone. Distributed<br\/>systems services can potentially interfere with each other in non-compatible ways, especially in the presence of QoS requirements.<br\/><br\/>This research plan proposes the formulation, specification and implementation of a new paradigm for developing QoS-enabled customizable middleware for the global information infrastructure. The customizable and safe distributed systems middleware infrastructure developed, called ComPOSE\/Q (Composable Open Software Environment with QoS), has the ability to effectively address the challenges posed by the evolving infrastructure. The primary distinguishing feature of ComPOSE\/Q is that it provides \"composable distributed resource management\", i.e., it allows the concurrent execution of multiple resource management policies in a distributed system in a safe and correct manner. Safe composability of resource management mechanisms is required to provide cost-effective QoS in a wide area distributed infrastructure. The research develops a semantic model for representing QoS, middleware components and techniques for reasoning about their interaction. The work is based on a formal meta-architectural model of middleware that permits customization of policies for placement, scheduling synchronization and management of<br\/>components. The meta-architecture allows for the separate specification of system policies from application requirements and hence permits either to be customized independently to adapt to changing system conditions and application requirements. To ensure non-interference, CompOSE\/Q implements core resource management services -- remote creation, distributed snapshot and directory services that are composable and can be used as a basis for creating more complex activities. The proposed methodology will be validated by using the CompOSE\/Q middleware to develop systems support for network-centric and mobile computing environments.<br\/><br\/>The accompanying educational objectives are to strengthen the graduate and undergraduate computer science curriculum at the University of California, Irvine in the principles, practice and applications of wide-area<br\/>distributed computing and multimedia technologies. This will involve the establishment of an Instructional Multimedia Laboratory that facilitates teaching both introductory and advanced courses in multimedia, distributed systems and information management. The long-term vision of the lab is to catalyze multidisciplinary application-oriented endeavors that are increasingly the driving force for innovative research as the world becomes highly interconnected and computerized.","title":"CAREER: Qos-enabled Customizable Middleware for Global Distributed Computing","awardID":"9875988","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["499298"],"PO":["234222"]},"39156":{"abstract":"Abstract<br\/><br\/>IIS-9900322<br\/>Mason, Metthew<br\/>Carnegie Mellon University <br\/>$102,913 - 12 mos.<br\/><br\/>Mobile Manipulation<br\/><br\/>This is the first year funding of a three year continuing award. The goal of this research is to explore the boundary between robotic manipulation and robotic locomotion. The initial focus is on a simple robot called the Mobipulator which manipulates paper and other common desktop objects using its wheels both for locomotion and manipulation.<br\/>Some of the goals are to refine and test variations on the design, to explore theoretical kinematic and dynamic properties of the device, and to develop suitable planning and control techniques.","title":"Mobile Manipulation","awardID":"9900322","effectiveDate":"1999-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["560864"],"PO":["234178"]},"58374":{"abstract":"","title":"CAREER: Integrated Dynamic Control for Robust Quality-of-Service Routing","awardID":"0096045","effectiveDate":"1999-07-01","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4097","name":"NETWORKING RESEARCH"}}],"PIcoPI":["438360"],"PO":["194325"]},"49442":{"abstract":"","title":"A Modular Toolkit for Vision and Robotics -- An Experiment in Domain specific Software Architecture --","awardID":"9996430","effectiveDate":"1999-07-01","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["541946","531055"],"PO":["241298"]},"38124":{"abstract":"CCR-9875024<br\/>Vempala<br\/><br\/>The goal of this research is to develop several tools for the design of efficient algorithms and apply them to fundamental algorithmic problems in computer science, as well as to modelling and solving some of the new challenges in the field. <br\/><br\/>The design of approximation algorithms lends itself to a particularly geometric interpretation. There are two steps involved: (1) Find a Relaxation, i.e., a set that encloses the set of solutions to the original problem and is easier to solve, (2) Find a Rounding, i.e., a mapping from a solution of the relaxation to a true solution. The first idea this project sets out to explore is that of a Convex relaxation. The set of solutions to the original problem can be viewed as a convex set (viz. Their convex hull) and any convex set enclosing this is a relaxation. The quality of a relaxation is dependent on how well it estimates the true optimum of the problem. Building on the past success of this approach, the project pursues promising relaxations for two fundamental problems, finding the Minimum Sparsity Cut (or Conductance) of a graph, and the Minimum Traveling Salesman problem in a directed graph.<br\/><br\/>The second idea is based on a technique of Lovasz and Schrijver, Called \"lift-and-project,\" to progressively refine any given convex relaxation. Although the technique has so far been used only to solve special cases of NP-hard problems in polynomial time, it appears to be well-suited for approximation algorithms, and one objective of this research is to adapt it for this purpose. A natural candidate for this approach is the problem of finding the Maximum Acyclic Subgraph of a directed graph.<br\/><br\/>The next two ideas are techniques for rounding. Random Projection has recently enjoyed much success as an algorithmic tool, for problems ranging from VLSI layout to finding nearest neighbors. Here it is developed by refining its application to the problem of learning the intersection of half-spaces (convex bodies).<br\/><br\/>It is often the case that a relatively small subset of the solutions to a relaxation, upon rounding, leads to the worst case performance of the algorithm, whereas on average, near-optimum solutions to the relaxation exhibit much better performance. To exploit this, the idea is to find a Random Near-Optimum of the relaxation, and then round this to a true solution. The problem of finding a random near-optimum can be solved efficiently via a random walk. Two candidate problems where this strategy might improve the quality of approximation are the Maximum Cut problem and the Minimum Bandwidth problem.<br\/><br\/>The last tool is a fast algorithm for approximating a given matrix with another matrix of small rank. Standard methods to compute such low-rank approximations take time that is polynomial in the size of the matrix. In the context of problems such as information retrieval on the internet, this can be prohibitively expensive. I contrast, the running time of the new algorithm depends only on the quality of the desired approximation and not on the size of the matrix. This algorithm will be applied as a tool to speed up existing (polynomial-time) algorithms for several applications, including linear equations, searching for nearest neighbours, and text and image retrieval.<br\/><br\/>These ideas are being integrated into education in the form of two courses, one at the senior undergraduate level, and the other at the graduate level. The former would be based on the basic concepts and successful ideas that come out of this research, while the latter would be exploratory and present promising directions and relatively difficult results.","title":"CAREER: Geometric Tools for Algorithms","awardID":"9875024","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["565103"],"PO":["543507"]},"39158":{"abstract":"9900326 John McCarthy and Carolyn Talcott<br\/>Large software systems are increasingly complex and costly. The design, development, and maintenance of a system can be greatly helped by good documentation of its architecture, that is, of how it is structured into meaningful subsystems or components, and how those subsystems are glued together to form the overall system. A key unresolved problem is the interoperability problem, namely, how the architectural pieces and their multiple and possibly heterogeneous semantic descriptions corresponding to the different views fit together to make a coherent whole, and how these different descriptions impose constraints on each other. The main objectives of this collaborative project are (1) developing mathematical foundations for integrating and interoperating in a coherent and mathematically rigorous way diverse architectural descriptions, formal specifications, and executable prototypes of object-based distributed systems and (2) based on such foundations, developing a methodology for system design, development, and evolution that supports a seamless integration of the different formal and informal system descriptions and makes explicit the constraints that these different views of a system impose on each other. The development of mathematical foundations will be driven by substantial case studies and will begin with an in-depth study of a wide range of notations and formalisms and of their mutual relationships that seem particularly promising for describing systems at different levels. Rewriting logic will play an important role, not only as an executable specification formalism, but also as a reflective metalogical framework in which the chosen formalisms and their relations can be formalized. These formalizations can be executed using the meta tools developed in the Maude<br\/>language, an implementation of rewriting logic. It is expected that these foundations and experimental methodology will advance the state of the art in software development and evolution, and will lead to new tools and methods that, when used properly, will substantially reduce the cost and effort of software development and maintenance.","title":"NSF-CNPq Collaborative Research: Mathematical and Engineering Foundations for Interoperability via Architecture","awardID":"9900326","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["551949","550115"],"PO":["564388"]},"34495":{"abstract":"This research involves constructions of combinatorial objects called Ramanujan graphs that are special types of expander graphs that have a vast number of applications to several areas of computer science and communication science and to many other areas of research (e.g., reliable communication networks, sorting networks, super-concentrators, construction of highly efficient error-correcting \"expander codes\"). This investigation connects expander graphs to codes, sequences <br\/>and exponential sums, three fundamental areas of communication science that are already deeply connected, and that already have many important applications in: the correction of errors in transmission and storage of data (e.g. to CD's), fault-tolerant systems, secure data communication, and cryptography. <br\/><br\/>The investigators have recently introduced notions of projective coset graphs of codes and have constructed Ramanujan graphs and other good expander graphs from codes, sequences and related exponential sums that appear as eigenvalues of these graphs. Research thus far has shown that good codes and <br\/>sequences lead to good expander graphs in general, and Ramanujan graphs in particular. Also, some exponential sums that appear in the construction of Ramanujan graphs and good expander graphs lead to very good codes and sequences. The investigation involves: i) a vast extension and generalization of the work done so far; ii) construction of Ramanujan graphs and other good expander graphs from algebraic geometric codes, codes over Galois rings, and other classes of codes; iii) practical and <br\/>feasible applications of these graphs to the research areas mentioned above; and iv) discovery of new areas of applications. In addition, the investigators analyze the highly practical research work of the last fifty years in coding theory, sequence design and related exponential sums for efficient implementation of the proposed schemes.","title":"Ramanujan Graphs, Codes, Exponential Sums, and Sequences","awardID":"9814981","effectiveDate":"1999-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["139519","318463"],"PO":["348215"]},"38202":{"abstract":"Visualization - the visual representation of information through images -<br\/>is vital in a broad range of scientific and medical applications. A good<br\/>visualization conveys the essential information in a complex dataset<br\/>clearly and effectively, emphasizing important features and minimizing<br\/>extraneous detail. The usefulness of a particular visualization technique<br\/>can be quantified in terms of the extent to which it improves task<br\/>performance for a given application. This makes it possible to compare<br\/>different methods or to pick optimal parameter values for a given method.<br\/>The process of designing an effective visualization, however, remains for<br\/>the most part a black art, terribly ad hoc, largely guided by intuition.<br\/>The PI's research is a quest for a deeper understanding of the science<br\/>behind this art, guided by theoretical and experimental insights from human<br\/>visual perception. This can be used to enhance all computer interfaces<br\/>that use elements studied here.<br\/><br\/>Specifically, the focus of the research is to investigate<br\/>perceptually-based methods for more effectively conveying the<br\/>three-dimensional shape and relative depth of smoothly curving surfaces in<br\/>scientific datasets. Key applications for this work include the<br\/>visualization of superimposed isovalue surfaces in 3D scalar fields, and<br\/>the combined visualization of external and internal structures in medicine<br\/>and CAD. The investigator will begin by using controlled observer<br\/>experiments to thoroughly evaluate texture as a device for enhancing the<br\/>perception of shape. This will identify and quantify the key aspects of<br\/>texture in interface design. The investigator will also pursue the<br\/>automatic generation of non-photorealistic, pen-and-ink style<br\/>representations of arbitrary polygonally-defined objects for interactive applications. <br\/>The advantage of such techniques is that some datasets need to be represented in a more<br\/>subtly indicative style than traditional graphics renderings. Complementing<br\/>the research component of this project is an educational component,<br\/>directed at both undergraduate and graduate students, aimed at inspiring<br\/>interest and fostering creativity through hands-on experiences in<br\/>visualization.","title":"PECASE: Perceptual Issues in Data Visualization: Conveying 3D Shape and Depth through Texture","awardID":"9875368","effectiveDate":"1999-07-01","expirationDate":"2005-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}}],"PIcoPI":["565146"],"PO":["565272"]},"39259":{"abstract":"While the commodity desktop environment is growing in popularity, researchers continue to study architecture-based research questions using standard benchmark programs. Benchmarks possess behavior that is fundamentally different from the behavior of desktop applications. For instance, the reliance of desktop applications on the hosting operating system and dynamically linked libraries warrants careful consideration when pursuing performance-driven architectural tradeoffs targeting a desktop environment.<br\/><br\/>In the future these applications will be developed in object-oriented languages. Again, this introduces a different program model that has not been rigorously addressed in the architectural research community. Object-oriented programs place significant pressure on instruction caches and branch prediction mechanisms. The focus of this research is to provide compile-time optimizations that take advantage of the profile information currently available in the desktop application environment. The goal is to develop new profile-based compiler optimization algorithms that can significantly accelerate the performance of desktop applications.<br\/><br\/>This project pursues the following research areas: Parameter Value Prediction, Indirect Branch Prediction, Instruction Memory Coloring, Weighted Completion Time Instruction Scheduling. Graph-based program analysis using program profiles is used to guide these optimizations. Improved optimization techniques are employed to produce tuned executable images. These optimizations are implemented in existing compilation environments to quantify their performance gains.","title":"Profile-Driven Compile-Time Optimizations Targeting Commodity Desktop Environments","awardID":"9900615","effectiveDate":"1999-07-01","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["557272","138361"],"PO":["113883"]},"36587":{"abstract":"CCR-9820897<br\/>Papadimitriou<br\/><br\/>Abstract:<br\/><br\/>This project concerns research on algorithms, complexity, and their applications to database theory, economics and organization theory, and the life sciences. In database theory it explores the indexability of database workloads, the applicability of spectral methods to information retrieval problems, new concepts and techniques in data mining, and novel languages for topological queries. In applications, it investigates a novel model of organizations as information expediters; algorithmic questions that arise in relation to resource sharing and the information economy; the complexity of inferring the genetic basis of multigenic traits; as well as certain algorithmic problems arising in the modeling and analysis of cancer progress and protein folding. In the core theory of algorithms and complexity, it investigates output-polynomial algorithms circuit minimization, and approximate algorithms for the traveling salesman problem.","title":"Research on Algorithms, Complexity, and Database Theory","awardID":"9820897","effectiveDate":"1999-07-15","expirationDate":"2003-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["558880"],"PO":["543507"]},"36598":{"abstract":"CCR-9820934<br\/>Levin<br\/><br\/>Decades of research failed to demystify the power of the two basic \"freedoms\" stretching the concept of deterministic computation: randomness and non-determinism. In recent years, however, some vague pattern is emerging in relationships between them. Even more notable seems the pattern of techniques instrumental for quite different results in this area: multilinear and low-degree multivariate polynomials, Fourier transformation over low-periodic groups, related to classical results on error-correcting codes or hashing. Some techniques based on different math, like expander graphs, also emerge as very relevant. <br\/><br\/>This project continues investigation of the power of randomness and non-determinism using the above or similar techniques. <br\/><br\/>Several specific directions of the research are:<br\/><br\/>The concept and specific examples of average-case (rather than worst case) intractability of NP-problems and problems of inverting one-way functions; removing degeneracy of one-way functions as an obstacle to efficient generation of pseudo-random bits. <br\/><br\/>Improvement and simplification of fault-resistant computation and communication.","title":"Randomness in Computing","awardID":"9820934","effectiveDate":"1999-07-01","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["467800"],"PO":["543507"]},"38655":{"abstract":"CCR-9877080<br\/>Scott<br\/><br\/> This project will focus on applying results developed in learning theory to real-life problems. Such application-based theoretical work is important so that the learning models and problems studied capture as best possible the needs of real-life problems. Working to apply theoretical techniques to real problems creates a better understanding of the real-world problems and thus helps direct future theoretical work, facilitating the transfer of results from theory to practice.<br\/> Many system control algorithms (e.g. networking protocols) depend heavily on ad hoc methods in their operation, and their performance can be very sensitive to the robustness of these methods. These ad hoc approaches are frequently based on assumptions made about the operating environment, e.g. assuming a particular distribution on the traffic patterns in a communication network without a sound statistical basis. This project will develop a framework based on formal learning methods for assisting in automatic system control. This framework will help to determine if better performance can be obtained by a system control algorithm.<br\/> One goal of this project is to continue research on dynamically adjusting delays of acknowledgments in the TCP protocol. Delaying acknowledgments has two main advantages. First, it allows a single acknowledgment for more than one packet. Second, if a data packet is being sent in the opposite direction, then one can piggyback the acknowledgment on the outgoing packet. However, there is a tradeoff since delaying the acknowledgment too much can increase the latency. Most TCP implementations, used today employ some sort of acknowledgment delay mechanism.<br\/> The project applies different learning schemes to predict TCP packet arrivals. The learning schemes include ones based on the Weighted Majority (WM) algorithm, ones based on the Exponentially Weighted Moving Average (EWMA) algorithm, and ones based on distributional assumptions with a sound statistical basis. The new ideas include new loss functions (functions that measure the learners' performance) that are more appropriate for the application.<br\/> Another application explored in this project is that of branch prediction of general purpose programs. A fast, accurate branch predictor is invaluable to a computer architecture that relies on instruction-level parallelism (ILP) techniques, e.g. pipelined and superscalar architectures. Many commercial architectures employ branch prediction schemes, and it is well known that even a small increase in prediction accuracy can greatly increase the amount of ILP that can be exploited.<br\/> An interesting facet of the branch prediction problem is that it requires some or all of the algorithms to be implemented in hardware. Thus whatever approaches are adapted eventually lead to algorithms that have fast and compact hardware implementations. The principal investigator's experience in hardware design and in learning theory will help in this regard.<br\/> Applying learning theory results to these problems and other systems problems will then provide guidance in defining new theoretical learning models that better model real-life scenarios. This project will also carefully develop and study such new learning models.","title":"Applying Learning Theory to Systems Problems","awardID":"9877080","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["424849"],"PO":["543507"]},"40052":{"abstract":"CCR-9902961<br\/>Rao<br\/><br\/>THEORY, ALGORITHMS, AND APPLICATIONS OF SIGNAL PROCESSING WITH THE SPARSENESS CONSTRAINT <br\/><br\/>This research project will examine the theoretical and computational issues that arise in signal processing problems with the sparseness constraint in several important application domains. The research plan includes using majorization theory to develop and identify suitable diversity measures whose minimization leads to sparse solutions. Then, to minimize these measures, a new class of optimization algorithms will be developed, analyzed, and applied. Algorithms based on a factored representation for the gradient along with Affine Scaling Transformation (AST) based methods of interior point optimization theory will be the starting point of this work. To facilitate a more comprehensive understanding of the methods, and to develop methods robust to noise, a Bayesian framework will be employed. The important extension to the multiple measurement vector problem will be studied greatly expanding the range of applications. Learning algorithms will be developed to tune the required overcomplete dictionaries for specific application environments, thereby increasing their overall effectiveness. Theoretical and algorithmic development will be guided by the requirements of the applications. Particular attention will be given to the applications of signal representation and neuromagnetic imaging using Magnetoencephalography (MEG) (a potentially important new modality for the imaging of the brain).","title":"Theory, Algorithms, and Applications of Signal Processing with the Sparseness Constraint","awardID":"9902961","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["499664"],"PO":["564898"]},"45772":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for an OC-3 connection. Applications involve data mining, surface metrology, non-invasive imaging for stroke research and atherosclerosis; distributed computing, cryptography, wireless LANs, caching, vehicle crashworthiness research, fire protection engineering, and spacecraft electric and chemical propulsion. Other efforts include the ODEToolkit project, global project centers, and a digital library. Collaborating institutions include but are not limited to: the Swiss Federal Laboratory for Materials and Testing in Thun, University of Massachusetts Medical School, the Central Massachusetts Magnetic Imaging Center, Lawrence Livermore Laboratory; NASA, the Metals Processing Institute, the Center of Wireless Information Technology, and the New England Center for Mixed Signal Processing.","title":"Advancing WPI","awardID":"9975857","effectiveDate":"1999-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["361842",116324,116325],"PO":["198445"]},"38414":{"abstract":"This award addresses issues of hybrid robotic locomotion systems --- robotic systems that utilize multiple<br\/>locomotion modalities in order to achieve greater mobility. Examples of these systems include the use of arms or legs by a wheeled robot to walk or climb stairs, or the use of a tail by a legge&robot to provide swimming thrust or bracing forces in underground tunnels or pipes. Such systems can provide robotic platforms capable of operating in multiple environments, such as underwater, in pipes, or overland. Central to this research<br\/>is how to generate appropriate input patterns, or gaits, for hybrid robotic locomotion systems, and how to modify these gaits when moving between environments, such as land to water. Other issues include the development of measures of terrain difficulty and mobility for robotic systems. These would provide a characterization of the mobility of a given robot configuration in relation to the difficulty of the path it must follow through the environment. Issues of sensing, both of the environment and of contact forces acting<br\/>on the robot, will be addressed. The use of modular components will also be emphasized, in order to provide basic modules, such as legs, tails, and wheels, that can be rapidly configured into a complete robotic system. Using modular components, the experimental side of this research will, focus on the development of three basic robotic platforms: a salamander, a wheel-legged system, and an eel robot. Each of these systems will<br\/>potentially possess advanced locomotion and manipulation capabilities that greatly exceed those found in existing robotic systems.<br\/><br\/>The education plan includes building visualization tools and graphics animation to help graduate students understanding difficult concepts by illustration. A website will be established for sharing such tools with educators around the world. At the undergraduate level, research will be integrated into education through senior design projects and the newly formed Penn Robotics Club. At the middle and high school level, an existing robotics mentoring program will be strengthened by introducing an internet-based mobile robot, with associated short-course modules.","title":"CAREER: Hybrid Locomotion Systems for Varying Terrains and Environments","awardID":"9876301","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["554983"],"PO":["234178"]},"38304":{"abstract":"Abstract for CCR-9875805<br\/><br\/>Wireless communication systems, particularly code-division<br\/>multiple access (CDMA) systems, are vital building blocks of the rapidly<br\/>evolving global information infrastructure. Digital signal processing (DSP)<br\/>is playing a central role in wireless communications due to the increasingly<br\/>sophisticated processing required in the physical network layer. The major<br\/>DSP challenges in CDMA system design stem from three key factors that<br\/>dominate the processing in the physical layer: (1) channel propagation<br\/>dynamics; (2) multiaccess interference; and, (3) the inherent complexity of<br\/>the DSP algorithms. The proposed research has two primary goals for meeting<br\/>the physical layer CDMA challenges:<br\/><br\/>* Development of DSP tools and theory to launch an integrated attack<br\/>on time-varying multipath dispersion, time-varying multipath fading, and<br\/>multiaccess interference.<br\/>* Development of design strategies for practical high-performance<br\/>systems that optimize the complexity versus performance tradeoffs inherent<br\/>in the DSP techniques.<br\/><br\/>A new unified framework based on DSP in canonical multipath-Doppler<br\/>coordinates will be developed to meet these goals. The canonical coordinates<br\/>are defined by a fixed basis that is derived from a fundamental<br\/>characterization of channel propagation dynamics in terms of certain discrete<br\/>multipath delays and Doppler shifts of the signaling waveform. The canonical<br\/>coordinates naturally connect the key physical layer facets and thus<br\/>facilitate a unified DSP development. First, all processing relating to<br\/>propagation effects can be directly performed in the coordinates. Second,<br\/>the same coordinates provide a canonical subspace-based representation<br\/>of the desired signal and multiaccess interference. Finally, the simple <br\/>computation and subspace structure of the coordinates affords a direct handle <br\/>on complexity. At the heart of the research is a particularly promising<br\/>innovation: whereas existing interference suppression techniques treat<br\/>propagation effects as a nuisance, canonical coordinates exploit the subspace<br\/>structure induced by channel effects for enhanced interference suppression.<br\/><br\/>The educational objectives of the program include integrated curriculum<br\/>development in DSP and communications, a thematic approach to teaching to<br\/>facilitate conceptual thinking, and leveraging of technology to extend the<br\/>boundaries of traditional instruction and learning.","title":"CAREER: An Integrated Digital Signal Processing Framework for Optimized Wireless Communications","awardID":"9875805","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["531613"],"PO":["564898"]},"39646":{"abstract":"Proposal Number: CCR-9901697<br\/><br\/>Title: Scheduling and Operating System Support for Real-Time and Embedded<br\/>Systems<br\/><br\/>Principal Investigator: Kwei-Jay Lin, University of California, Irvine<br\/><br\/>The design and implementation of a Linux kernel for real-time and embedded <br\/>applications are proposed. The Real-time and Embedded Linux (RED-Linux) <br\/>kernel is designed to support applications that have both real-time and <br\/>non-real-time tasks with different QoS parameters. By integrating a <br\/>micro-timer and inserting preemption points in the kernel, RED-Linux will <br\/>provide a very short task dispatch latency and interrupt handling response <br\/>time. A unified scheduling framework for supporting various scheduling <br\/>paradigms (such as priority-driven, time-driven and share-driven) will be <br\/>investigated. New scheduling algorithms will be studied as a result of the <br\/>unified scheduling framework. Different from previous real-time Linux <br\/>projects, RED-Linux will not implement a separate real-time kernel (which <br\/>co-exists with the Linux kernel) to handle real-time tasks. All real-time <br\/>and non-real-time tasks are handled and scheduled by the same kernel. <br\/>Real-time tasks are scheduled according to their real-time and QoS <br\/>requirements. Non-real-time tasks are scheduled with a fair share of <br\/>system time, sharing the resources used by real-time and other <br\/>non-real-time tasks. Finally, the project will investigate an open kernel <br\/>structure with modular components so that it can be used in different <br\/>embedded system environments by integrating components with specific <br\/>capabilities.","title":"Scheduling and Operating Systems for Real-Time and Embedded Systems","awardID":"9901697","effectiveDate":"1999-07-15","expirationDate":"2003-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[100551],"PO":["309350"]},"38436":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for a DS-3 connection to the vBNS. Applications involve virtual manufacturing and materials processing, on-line EEG data analysis using nonlinear methods, long-term study of TCP\/IP (Internet) based applications on high-speed satellite networks; data transfer of nuclear and particle physics research being conducted on an international level between Ohio University and the Thomas Jefferson National Accelerator facility. Collaborating institutions include NASA Lewis Research Center, the Jefferson Lab, and the Children's Medical Center in Cincinnati.","title":"Connection to vBNS for Ohio University","awardID":"9876396","effectiveDate":"1999-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1922","name":"CONNECTIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["543984",97574,"450812","500872",97577],"PO":["198445"]},"42110":{"abstract":"This proposal requests support for a workshop to be held in the Washington area on May 26, 1999 to explore the possibilities for a major program in digital library research by a consortium of institutions in the EPSCOR states. The workshop will be attended by university researchers from the EPSCOR states, representatives of the major national organizations in the digital library area, a few representatives of universities playing lead roles in the digital library arena, and representatives of the EPSCOR organizational community. The need for this workshop is critical to determine the need for digital library programs in the EPSCOR states and the technological needs for extending digital library research into new areas.","title":"EPSCoR Digital Library Meeting Proposal","awardID":"9909123","effectiveDate":"1999-07-01","expirationDate":"2000-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6857","name":"DIGITAL LIBRARIES AND ARCHIVES"}}],"PIcoPI":[106646,"461693"],"PO":["433760"]},"41021":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for an OC-3 connection to the vBNS. Applications involve telemedicine, scorpion venom protein research, visualization-aided reverse engineering on violins and multivariate strategies development in chemistry. Collaborating institutions include: Syracuse University, Ohio State University, Ohio Supercomputing Center, North Carolina Supercomputing Center, University of North Carolina - Chapel Hill, University of Wisconsin, University of Alabama at Birmingham, Virginia Polytechnic University and the Measurement and Control Engineering Center at the University of Tennessee.","title":"High Bandwidth Connection to the North Carolina Research and Education Network","awardID":"9906078","effectiveDate":"1999-07-15","expirationDate":"2001-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[103841,"311639","109094","315477",103845],"PO":["198445"]},"45630":{"abstract":"9975286<br\/>Burger, Doug<br\/>Keckler, Stephen<br\/>University of Texas Austin<br\/><br\/>CADRE: SimpleScalar: Industrial-Strength Computer Systems Simulation<br\/><br\/>This award supports enhancement to the functionality, reliability and accessibility of the SimpleScalar tool suite of microprocessor simulation tools. The tools will provide the computer architecture research community with access to accurate and validated tools and a shared code base to enable reproducibility of results. Educational users will be able to integrate the tools into undergraduate and graduate curricula and provide students access to experimental systems research.","title":"CADRE: SimpleScalar: Industrial-Strength Computer Systems Simulation","awardID":"9975286","effectiveDate":"1999-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["217452","424003"],"PO":["297837"]},"38404":{"abstract":"The rapid growth in voice and data communications services over satellite and wireless communication networks has resulted in the rapid incorporation of the state of the art in digital communication techniques into current systems. The next generation of these networks will demand even more sophisticated techniques at every point in the system. It is evident that channel coding will be ubiquitous in order to combat channel transmission effects, to more efficiently utilize system resources and to facilitate multiuser access. This project is concerned with the investigation of new classes of channel codes to meet these demands. In particular, new classes of time varying codes are being developed to reduce transmitter power requirements and to enable systems to operate close to theoretical limits with several levels of quality of service. In addition, new iterative decoding algorithms and soft information exchange paradigms are being developed to provide robust integrated solutions to a variety of system functions such as timing and synchronization and multiuser detection.<br\/><br\/>This project involves the design, analysis and performance of time-varying channel codes in the context of the basic theorems of information theory and the demands of the next generation of satellite and wireless communication systems. The classes of codes being studied include parallel and serial concatenation of block and trellis codes and new classes of periodically time varying convolutional codes. The performance of these coding schemes is studied for both the additive white Gaussian noise channel and a variety of multipath fading channel models. A particular effort is being made to develop codes, including asymmetric parallel concatenations, with short block lengths and near capacity performance at a variety of error rate for mobile wireless communications. The principle of iterative decoding and soft information exchange is also being exploited to enhance other system functions. This includes low signal to noise ratio timing and synchronization algorithms that interact with soft output channel decoding algorithms and novel joint source\/channel coding structures. Iterative decoding of channel codes is also being investigated as a means of developing iterative multiuser detection algorithms that achieve near single user capacity on highly loaded multiuser systems.","title":"CAREER: Channel Coding for Satellite and Mobile Communications","awardID":"9876254","effectiveDate":"1999-07-15","expirationDate":"2006-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["340694"],"PO":["348215"]},"39988":{"abstract":"CCR-9902796<br\/>Hemami<br\/><br\/>The increase in image transmission, currently over the internet and in the future via wireless personal-communication-services, poses new problems with respect to digital image compression. High-quality images can be nearly instantaneously downloaded over a communications link with high bandwidth. However, as bandwidth decreases, the download time increases dramatically. At some point, the user may decide whether to continue or to stop the transmission based on the image information available, rather than waiting for the entire high-quality image. If the transmission is stopped at any point, the<br\/>user should ideally have an image of the highest possible visual quality for that amount of data. Generation of such images requires an understanding of the human visual system (HVS), and specifically how the HVS perceives compression artifacts in low-quality images. However, HVS research to date has focussed only on understanding how the HVS perceives artifacts in high-quality images. The goal of this research is to quantify the perception of compression artifacts in wavelet-coded images with visible artifacts. The resulting<br\/>algorithms will allow image recognition, object identification, and data extraction at lower bit rates than algorithms known to date, and hence imaging tasks will require that less data be transmitted or downloaded.<br\/><br\/>The proposed work will experimentally quantify human sensitivity to supra-threshold compression artifacts in wavelet-compressed images. Because sensitivity to visible artifacts is under evaluation, a top-down test in which actual images are distorted is employed, rather than the traditional bottom-up test which measures sensitivity to individual basis functions. Uniform quantization noise is added to individual subbands and observers identify the step sizes that produce noticeable differences. Fifteen images selected for their specific visual characteristics and over 150 subjects will provide a data set large enough to make general characterizations rather than producing image- and observer-specific results. The effects of granular and<br\/>overload distortion will be separately characterized, and these experimental results will be incorporated into quantization strategies and compression algorithms, both for traditional and embedded wavelet coders.","title":"Visually Optimized Supra Threshold Wavelet Image Compression","awardID":"9902796","effectiveDate":"1999-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["530523"],"PO":["564898"]},"38228":{"abstract":"One of the major goals of modern communications is to develop a system that provides users high-speed ubiquitous access to information. Such a system requires a wireless component; however, because of the limited amount of bandwidth available and the signal fading due to the multipath inherent to the wireless environment, the wireless component can be the bottleneck of the system. Thus, the communications research community is called upon to provide focused research on bandwidth efficient communications over multipath fading channels and to educate students so that they have the<br\/>necessary skills to contribute to this and future systems. As detailed below, this project is addressing these issues through: (1) advances in coded modulation for high-speed wireless systems, (2) a comparison of system architectures for the physical layer of high-speed wireless systems, (3) broadly applicable innovations in the instruction of students, and <br\/>(4) a program of undergraduate research in communication theory.<br\/><br\/>The two main architectures that are being considered for future high-speed wireless communication systems are a coded single-carrier system employing a decision feedback equalizer (DFE) at the receiver and a coded orthogonal frequency division multiplexing (OFDM) system. In this project, the problem<br\/>of designing coded modulation for the OFDM system is being formally developed. By viewing this problem in the more general framework of frequency domain coded modulation (FDCM), design rules are being developed that lead to systems that can efficiently tradeoff complexity for improved bit error <br\/>probability and amplifier efficiency relative to traditional OFDM systems. Furthermore, this project is analyzing the utility of the resulting systems as a hybrid between coded single-carrier systems employing a DFE and coded OFDM systems; this provides a unified comparison of the most widely considered <br\/>system architectures for high-speed wireless communications. The educational portion of this project employs three complementary methods that strive to foster student learning through innovations that supplement traditional classroom instruction. The first method will be the continuation of the<br\/>introduction of supplements that support active learning in traditional courses, such as the introduction of games of chance for course points in an undergraduate probability class. The second method will be the development of a capstone wireless communications course that will allow graduate students and advanced undergraduates to integrate their knowledge in various communication system components in a team-oriented environment <br\/>that stresses overall system performance. Finally, the third method will be the continuation of a funded undergraduate research program, which aids promising undergraduate engineers by providing one-on-one attention in an active research environment.","title":"CAREER: Coded Modulation for High-Speed Wireless Communications","awardID":"9875482","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["545656"],"PO":["223414"]},"58447":{"abstract":"","title":"CAREER: Adaptive Intelligent Agents for the Internet","awardID":"0096118","effectiveDate":"1999-07-01","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":["478413"],"PO":["563109"]},"37899":{"abstract":"This is a three-year continuing award. To ensure that new workplaces and digital work materials serve human needs requires both a different theoretical base and an integration of theory with ethnographic and experimental methods. We propose a research framework based on distributed cognition. Distributed cognition provides a reorientation of how we think about designing and supporting human computer interaction. It permits one to move boundary of the cognitive unit of analysis out beyond the skin of the indivdual to include the material and social environment as components of a larger cognitive system. This focuses attention on the processes by which people take advantage of both internal and external resources to organize their actions. For the design of workplaces, this means that work materials are more than stimuli for disembodied cognitive sytems. Work materials become elements of the cognitive system itself, and cognition becomes an emergent property of the interactions among people and work materials. We will apply our integrated approach to developing a distributed cognition based theory of annotation and explore a range of application domains: collaborative scientific research, education, and commercial aviation. In each domain, we will conduct ethnographic and experimental studies, design and implement digital work materials and analyze their effectiveness. In addition, to help us develop and communicate our distributed cognition perspective, we are developing: (1) a series of prototypes of history-enriched work materials that support collection and selective sharing of personnel and group activity histories and annotations, (2) annotation facilities to assist collaborations, and (3) information visualization facilities to exploit rich histories of interactions and provide effective access to annotations.","title":"KDI: A Distributed Cognition Approach To Designing Digital Work Materials For Collaborative Workplaces","awardID":"9873156","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6850","name":"DIGITAL SOCIETY&TECHNOLOGIES"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8876","name":"KDI OPPORTUNITY FUND"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"8888","name":"LEARNING & INTELLIGENT SYSTEMS"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0809","name":"Division of INTEGRATIVE ORGANISMAL SYS","abbr":"IOS"},"pgm":{"id":"1180","name":"HUMAN COGNITION & PERCEPTION"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}}],"PIcoPI":["348076","443223","550599"],"PO":["495796"]},"44444":{"abstract":"9970939 Roman, Gruia-Catalin<br\/>Ad hoc networks refer to systems of components that communicate via wireless devices without the support of a permanent infrastructure such as the one provided by the Internet. Such networks are assembled, reshaped and taken apart as components move in and out of communication range. This project develops software engineering methods and an associated software infrastructure to facilitate rapid construction of dependable mobile applications executing over ad hoc networks. Several mobile applications are developed for demonstration and evaluation purposes. They will involve collaborative exploration of unknown environments, cooperative behaviors in a competitive setting, and group learning activities. Formal techniques are employed for reasoning about mobile computations and in the verification of algorithms needed to solve problems that are fundamental to mobile computing. The research seeks to identify novel coordination constructs that support transient interactions among mobile components, have cleanly defined semantics, have efficient implementations, and simplify programming. The choice of constructs will be driven by the need to build self-adaptive components able to function correctly in open systems under a minimalist set of operating assumptions. Ease of programming is achieved by making component interactions transparent to the programming effort, i.e., implicit in the definition of the coordination constructs.","title":"Rapid Development of Dependable Applications over Ad Hoc Networks","awardID":"9970939","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2880","name":"SOFTWARE ENGINEERING AND LANGU"}}],"PIcoPI":["384032"],"PO":["564388"]},"42685":{"abstract":"9910633 Guibas, Leonidas<br\/>As the application of computers to the physical world widen, there is an ever increasing need for computational tools to deal with the physical attributes of objects, such as their geometry. The field of Computational Geometry has made impressive strides in the last twenty years in providing an algorithmic foundation for the solution to many geometric problems in computer graphics, computer vision, robotics and manufacturing, and many other application areas. The purpose of this proposal is to develop a set of novel geometric representations and algorithmic techniques that will make computational geometry more useful in modeling physical-world objects and processes. The aim is not to obtain universal, domain-independent solutions --- such as a complete solution to robustness concerns in geometric computing. Instead the focus will be on certain key issues, such as scale- sensitivity, shape variability, and motion, that arise in many of the important uses of geometry in modeling physical objects and systems. Geometric models that properly capture certain key aspects of the uncertainty or variability in models of physical objects and processes will be investigated, and efficient algorithms for manipulating these models effectively will be developed. It is expected that this set of research directions will generate new mathematical and algorithmic problems that will be interesting and worthy of study on their own right, in addition to producing geometric tools that are well-tailored to physical world applications. ***","title":"Computational Geometry in the Physical World","awardID":"9910633","effectiveDate":"1999-07-15","expirationDate":"2002-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["521232"],"PO":["201974"]},"40188":{"abstract":"CCR-9903368<br\/>Zakhor<br\/><br\/><br\/>Efficient compression of image and moving video is becoming increasingly more important in a wide range of emerging applications. These applications can be classified by the bit rates they require. A broadcast quality video-on-demand system might require several megabits per second, while a commercial video conferencing system might use only a few hundred kilobits per second. At the extreme low end of the scale, video telephone and wireless communication systems are often restricted to rates below 20 kilobits per second. The hybrid motion-compensated Discrete Cosine Transform (DCT) structure is a part of nearly all existing video coding standards such as H.263 and MPEG-1,2,4, and commercially available video compression systems. In applying DCT to very low bit rate video coding, blocking artifacts become quite pronounced. This research is focused on non-block oriented decomposition techniques to replace DCT in today's video coding systems.<br\/><br\/><br\/>One such scheme recently developed at the VIP group at U.C. Berkeley involves signal decomposition over a larger, more flexible over-complete basis set based on Gabor dictionary. It uses the greedy, matching pursuit algorithm from the statistics literature in order to find the expansion coefficients. This approach is found to result in significant PSNR and visual quality improvement over DCT based schemes. In addition, since there are no constraints on the overcomplete set of basis functions over which the signal decomposition is carried out, the elements of the set can be chosen to be free of blocking artifacts, resulting in artifact free reconstructed frames, with no need for compute expensive post processing. The main goal of this research is to investigate signal decomposition along overcomplete dictionaries with applications to video coding. In particular the issues to be addressed regarding video coding systems based on over complete signal expansion include: fundamental bounds on performance, optimum amplitude and position coding algorithms, non-block based motion compensation techniques to match the non-blocky nature of the basis set, dictionary design, decomposition and search strategies, and extension to: (a) spatio-temporal scalability, (b) still image coding, (c) multiple description coding and (d) synthetic video\/imagery\/graphics. <br\/><br\/><br\/>Level of Effort Statement: At the recommended level of support, the PI will make every attempt to meet the original scope and level of the project.","title":"Over-complete Signal Decomposition","awardID":"9903368","effectiveDate":"1999-07-15","expirationDate":"2003-02-28","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["118490"],"PO":["564898"]},"44379":{"abstract":"A new memory model called Commit-Reconcile \\& Fences (CRF) is<br\/>presented, and it is shown how other memory models can be described as<br\/>restricted versions of it. The CRF memory model has been designed so<br\/>that it is both easy for architects to implement, and rich enough that<br\/>compilers for high-level parallel languages can use it as a target<br\/>machine language. This proposal is for investigating 1. the<br\/>integration of CRF into modern microprocessors, 2. adaptive protocols<br\/>for implementing CRF in Distributed Shared memory Systems (DSM) and<br\/>3. efficient translation of high-level multithreaded programming<br\/>models (e.g. Cilk) into CRF. <br\/><br\/>The impact of this research would be to eliminate a plethora of<br\/>implementation-dependent memory models, and to provide a stable<br\/>interface for architects and compiler writers. The development of<br\/>micro-architectures and cache-coherence protocols to support CRF could<br\/>have an immediate impact on industry because these changes can be<br\/>incorporated in PC's and servers without the loss of software<br\/>compatibility.<br\/><br\/>Another theme in this proposal is the use of a new formal framework<br\/>based on Term Rewriting Systems (TRS) for describing computer systems.<br\/>The biggest appeal of TRS's is its naturalness for designers. The TRS<br\/>framework is useful in verification of system properties. It is also<br\/>possible to synthesize hardware from TRS's. A unified synthesis and<br\/>verification framework is likely to have a big impact on current<br\/>design practices.","title":"Memory Models for Architects and Compiler Writers","awardID":"9970735","effectiveDate":"1999-07-01","expirationDate":"2003-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":["370891"],"PO":["113883"]},"45623":{"abstract":"9975248<br\/>Reed, Daniel A. <br\/>U. Illinois at Urbana-Champaign<br\/><br\/>CADRE: A National Facility for High-Performance I\/O Characterization and Optimization<br\/><br\/>This award provides support for the establishment of a national facility for I\/O characterization and optimization tools. The resulting portable toolkit will be able to characterize I\/O access patterns on PC workstation clusters, scalable parallel systems, and computational grids. The toolkit is based on Pablo, a portable performance environment that supports performance data capture and analysis. The National facility will provide system tools and experimental data needed for research in I\/O system design, analysis, and optimization for scalable parallel and distributed systems. Web-based tutorials, demonstrations and exercises will be developed which, together with other outreach activities, will make these tools available and useful to smaller institutions.","title":"CADRE: A National Facility for High-Performance I\/O Characterization and Optimization","awardID":"9975248","effectiveDate":"1999-07-15","expirationDate":"2004-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["562707",115888],"PO":["297837"]},"11512":{"abstract":"CONRAD, Michael<br\/>CCR-9610054<br\/>Wayne State University<br\/><br\/>The high recognition capacity of proteins and other biological macromolecules derives largely from shape-based interactions. The pictures of a lock-key or jigsaw-like fit is frequently used to describe this type of molecular level pattern recognition. The goal of this research project is to harness this powerful intrinsic form of pattern recognition to solve computational problems. The basic idea is captured in the self-assembly model of computing. Signal patterns impinging on a device are transduced to molecular conformations which then self-organize to form a higher level complex (or mosaic). Shape features common to different mosaics represent different families of input patterns. Enzymes that recognize these shape features control the output of the device. The solution of potentially difficult symbolic pattern recognition problems is converted in this way to a macromolecular self-organization process driven by free energy minimization. Devices of this type cannot be programmed in a conventional sense, because of the difficulty of predicting the structural and functional consequences of conformational interactions. However, they are well suited to molding through directed evolution (due to the high structure-function plasticity of biological macromolecules) and to adaptation through error feedback acting on the internal structure of the device.<br\/><br\/>Chemical implementation of this scheme can operate on the basis of the conformational responses of single proteins to different patterns of milieu features. Shape-based enzyme recognition serves to transform input signal patterns (coded in chemical form) to output activity (detected spectroscopically). The particular protein being used for this purpose is mitochrondrial malate dehydrogenase, a readily available enzyme of carbohydrate metabolism, that could in the future easily be coupled to other enzymes to build up a repertoire of special purpose pattern processors that can be utilized as co-processors for a conventional machine linked into computational networks capable of performing complex recognition-action tasks.","title":"Conformation-Driven Molecular Computing","awardID":"9610054","effectiveDate":"1999-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}}],"PIcoPI":["141002","434228"],"PO":["528421"]},"45777":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for an OC-3 connection. Applications involve data mining, active networking, high-power semiconductor device modeling, dynamic visualization of geophysical flows, lightning-induced phenomena and nuclear safety and more. Collaborating institutions include but are not limited to the U.S. Army, NASA, Sandia National Laboratory, Argonne National Laboratory, AT&T Research; Lucent Technologies, Thiokol Corporation, Rutgers University, Princeton University, and Cornell University.","title":"Engineering and Technology Pathsetting","awardID":"9975889","effectiveDate":"1999-07-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["437263","290534",116341,"435501"],"PO":["168746"]},"37956":{"abstract":"Sapiro<br\/><br\/>This project addresses the development of a comprehensive research and educational program in mathematical techniques applied to the areas of image processing and computer vision. In particular, Geometric Partial Differential Equations (GPDE's) are used. Using GPDE's is a relatively new approach to image analysis that brings numerous benefits and has already lead to several state-of-the-art results. This research focuses on the theoretical and practical study of ways to introduce advanced a-priori and learned knowledge and information into the GPDE's framework, moving beyond the simple edge information commonly used. <br\/><br\/>Key examples where knowledge can be incorporated include MRI and SAR, where the number of different objects present in the image is known a-priori; object tracking in video, for human-computer interaction for example, where information from previous frames can be used; and medical image analysis and visualization, where important biological information is available. This knowledge is incorporated combining Bayes rule, learning techniques, systems of coupled GPDE's, and special geometric forces driving the GPDE's. The theoretical study of these new equations is an integral part of the program. The educational component of this project focuses on improving multi-disciplinary training and creating a new image processing laboratory based on personal computers. New courses on GPDE's and on Geometric Visual Tracking are being introduced. These and the basic image processing courses are oriented to a diverse audience and are attended by students from many departments across the University. The collaboration with industry and other departments is also addressed defining joint projects. The whole research and educational program is oriented toward making advanced tools in image analysis more accessible to users that frequently interact with visual information in their personal computers.","title":"CAREER - Intelligent PDE's: Introducing Knowledge into Geometry Driven Image Deformations","awardID":"9873670","effectiveDate":"1999-07-01","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4720","name":"SIGNAL PROCESSING SYS PROGRAM"}}],"PIcoPI":["549760"],"PO":["564898"]},"44833":{"abstract":"PROPOSAL NUMBER: CCR-9972243<br\/><br\/>TITLE: Operating System and Middleware Support for a <br\/> Multi-media Systems Area Network<br\/><br\/>PI: Kamlesh Rath<br\/><br\/><br\/>Multi-media appliances are evolving around new serial systems area<br\/>network (SSAN) standards, e.g. FireWire (IEEE1394) and SerialExpress<br\/>(IEEE P3100). These provide the band-width needed for networking<br\/>multi-media appliances at a very low cost compared to current system-bus<br\/>and LAN technologies. Operating system enhancements for multi-media<br\/>appliances on high-bandwidth SSANs can enable sharing of processing,<br\/>storage and peripheral resources between appliances.<br\/><br\/>The operating system and middleware software in appliances on a SSAN<br\/>are required to perform the following functions: (i) manage the network<br\/>and peripheral interface hardware, (ii) provide dynamic transaction<br\/>based device registration and resource management mechanisms for<br\/>hot-pluggable devices, (iii) provide automatic buffer management based<br\/>on application and multi-media data\/stream requirements, (iv) provide<br\/>one-copy user to network interface data transfer mechanism for real-time<br\/>data, and (v) provide mechanisms for integrated presentation of related<br\/>media streams on a client.<br\/><br\/>This research focuses on analysis, design and development of dynamic<br\/>resource management software for multi-media appliances and transport<br\/>layer software for SSANs. The operating system enhancements and<br\/>middleware are being developed on a light-weight real-time kernel using<br\/>a minimal POSIX compliant sub-set for portability.","title":"Operating System and Middleware Support for Multi-Media Systems Area Network","awardID":"9972243","effectiveDate":"1999-07-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":[113902],"PO":["250083"]},"44888":{"abstract":"9972464 Wilhelms, Jane<br\/>This project investigates new methods of extracting general, three-dimensional human and animal models and their motion from digitized video, in order to create an accurate and realistic virtual library. Realistic, computer-animated humans and animals are important in computer graphics and many other fields, including biomechanics, biology, surgical planning, sports medicine, engineering, education, training, and ergonomics. Natural human movement simulation is important in the ergonomic design of environments such as cars, planes, and work places. While much work has been done in the anthropomorphic study of the range of human body types, less is known about the natural range of comfortable motion among individuals in specific environments. Locomotion studies of humans and animals would profit from three-dimensional representations that allow quantitative comparisons between recorded motion of different individuals and species. Humans and animals lend verisimilitude and interest to any computer-generated scene. Videotape already records massive amounts of information on the free movement of humans and many animal species; what is needed are ways to extract quantitative information from these records. However, generating the realistic motion of complex articulated structures is extremely difficult. Trained animators can produce realistic motion using laborious keyframing techniques, but results are not useful for scientific study. Considerable research has been done in the last 15 years in attempting to use constraints, physical simulation, and higher-level procedural specification to partially automate the process with some encouraging but limited results. Studio motion capture techniques can provide exact motion specification for single individuals, at considerable cost, but work has just begun on generalizing these results. Computer vision is developing automatic recognition approaches, but at this point results are only reliable for simplified cases and environments. Methods of extracting accurate three-dimensional motion from video filmed using a single camera in any general environment will provide the necessary general tool for turning recorded motion into a quantitatively useful form. This project will bring together several research areas to attack the problem of extracting and representing articulated motion. The process will combine parametric, hierarchical, and constraint-based methods from computer graphics, physiological insights from biology and biomechanics, and model-based image-by-synthesis approaches from computer vision. The process will be partially automated, but user input will provide necessary initial conditions and alterations when necessary.<br\/>The result will be a library of accurate human and animal models accompanied by realistic parameterized, hierarchical motion descriptions. Scientists in other research areas, such as biology, biomechanics, anthropology, and vision, both at the University of California, Santa Cruz, and elsewhere will be involved. The virtual library will be made available, and software will be modular to facilitate integration with existing systems.","title":"Model and Motion Libraries from Video","awardID":"9972464","effectiveDate":"1999-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":[114053],"PO":["321058"]},"44823":{"abstract":"Proposal Number CCR-9972211<br\/><br\/>Pfair-Scheduled Real-Time Systems: Extending Theory to Practice<br\/><br\/>James H. Anderson<br\/><br\/>The scope of real-time computing is increasing to include \"next generation\"<br\/>applications implemented across multiple processors. Examples of such<br\/>applications include defense systems, avionics control systems, and<br\/>telepresence systems. To develop such systems, effective techniques for<br\/>realizing timing constraints in multiprocessor systems are required. A major<br\/>advance in the evolution of such techniques was recently achieved in the work<br\/>of Baruah and colleagues on Pfair scheduling. Under Pfair scheduling, tasks<br\/>are required to execute at steady rates. Executing tasks at steady rates has<br\/>important consequences. For instance, Pfair scheduling algorithms have been<br\/>developed that optimally schedule periodic tasks on a multiprocessor in<br\/>polynomial time. This is a problem that was previously viewed as being<br\/>almost undoubtedly NP-hard. Unfortunately, the current theory of Pfair<br\/>scheduling is of limited practical value because it includes support only for<br\/>strictly periodic tasks that have no synchronization or data-sharing<br\/>requirements. In this project, these shortcomings will be addressed by<br\/>developing a Pfair scheduling framework that includes support for<br\/>interprocess communication and synchronization, I\/O, and fault tolerance.<br\/>This framework will be evaluated by implementing a Pfair-scheduled real-time<br\/>operating system, which will be used as a basis for experimental research<br\/>involving both synthetic and real-world applications.","title":"Pfair-Scheduled Real-Time Systems: Extending Theory to Practice","awardID":"9972211","effectiveDate":"1999-07-15","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"2876","name":"DISTRIBUTED SYSTEMS"}}],"PIcoPI":["31436"],"PO":["241298"]},"58606":{"abstract":"","title":"POWRE: Interaction in Information Retrieval: Successive Searching by Usage Over Time","awardID":"0096284","effectiveDate":"1999-07-15","expirationDate":"2001-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1592","name":"PROF OPPOR FOR WOMEN IN RSCH"}}],"PIcoPI":[150536],"PO":["289456"]},"41921":{"abstract":"This is a proposal from Educause for a workshop on several critical, <br\/>network-based, applications-enabling technologies. Many of the most <br\/>challenging problems related to future uses of networking have to do with <br\/>matters of security, public key infrastructure, and electronic commerce. <br\/>This workshop will explore these issues and utilize a series of follow-on <br\/>meetings to identify technical strategies and possible approaches for <br\/>multi-university experiments in implementation and use of the technical <br\/>strategies. A key part of the proposed work is an extensive information <br\/>dissemination plan, including establishment of a repository of <br\/>state-by-state PKI and E-Commerce approaches.","title":"Workshop: Identifying and Implementing a Coordinated Strategy for E-Commerce, Security, and PKI in Higher Education; August 12-13, 1999","awardID":"9908627","effectiveDate":"1999-07-15","expirationDate":"2004-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4090","name":"ADVANCED NET INFRA & RSCH"}}],"PIcoPI":["43608","547713","259750",106147],"PO":["565090"]},"36619":{"abstract":"CCR-9821009<br\/>Larmore<br\/><br\/>This research concerns on-line algorithms and is focused on two problems, generalizing well-known open problems. The first is: the given any on-line algorithm and any specific kind of restriction on computational power memory or information flow, does there exist, an on-line algorithm that satisfies this restriction and is still optimal (among all on-line algorithms)? The second is the question whether randomization helps for the 2-server problem.<br\/><br\/>In particular, the project introduces a new restriction on information flow for on-line algorithms called tracklessness and seeks to answer the above questions for trackless on-line algorithms.<br\/><br\/>Some effort will also be expended on the major problem of the area, the k-server conjecture. <br\/><br\/>Besides the server problem, the research will attempt to settle a number of other on-line problems for which optimal competitiveness is unknown, including: randomized list update, multiprocessor scheduling, and page migration.<br\/><br\/>A number of tools developed by the PI (in conjunction with Chrobak) have been used successfully, by them and by others, including workfunctions, pseudocost, competitive games, and convex hulls. Computer simulations are an essential tool in the research. A major component of the work in finding additional generic tools for classes of problems.","title":"On Line Competitive Algorithm","awardID":"9821009","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1108","name":"Division of EXPER PROG TO STIM COMP RSCH","abbr":"EPS"},"pgm":{"id":"9150","name":"EXP PROG TO STIM COMP RES"}}],"PIcoPI":["217595","217596"],"PO":["543507"]},"34409":{"abstract":"This project aims to study stability and sensitivity of flow control protocols for best-effort or available bit rate (ABR) traffic on integrated networks. Rigorous mathematical analysis will be carried out to produce a general stability and sensitivity theory for ABR flow control. The theoretical results will be obtained via extensive simulations and analytical derivation. Robust flow control protocols to combat spatial, temporal, and integration variations will be designed and tested. <br\/>The following tasks will be carried out: 1. A general theory of stability and sensitivity of rate-based ABR flow control protocols will be developed. The concepts of stability and sensitivity will be formalized. The new theory will use the concept of control but the formulation will be based on combinatorial analysis of the distributed asynchronous operations of the protocols. Various factors affecting the stability will be investigated and classified. The emphasis will be on the control laws themselves.<br\/>2. The spatial aspects of the stability and sensitivity theory will be further investigated in conjunction with existing protocols. The emphasis will be on the robustness of the protocols in the face of network uncertainty, transient behaviors, and misbehaving components. A model spatially robust protocol will be developed.<br\/>3. The temporal aspects of the stability and sensitivity theory will be further investigated in conjunction with existing protocols. The emphasis will be on the temporal variations of background traffic and disparity of feedback latencies. A model temporally robust protocol will be developed.<br\/>4. The integration aspects of the stability and sensitivity theory will be further investigated in conjunction with existing protocols. The emphasis will be on interactions between protocols and traffic control mechanisms from networks of distinct architectures. The aim of this theory is to provide<br\/>guidelines on how to seamlessly integrate multiple networks or multiple protocols. A model interactively robust protocol will be developed.<br\/>5. Well-known and widely deployed protocols and the new protocols developed in this project will be extensively simulated and tested in various integrated network configurations for stability and sensitivity. The purpose is to verify the theories derived and to test the protocols developed from this project.","title":"Stability and Sensitivity of ABR Flow Control Protocols for Integrated Networks","awardID":"9814759","effectiveDate":"1999-07-01","expirationDate":"2003-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1920","name":"RESEARCH\/TESTBEDS"}}],"PIcoPI":["206019"],"PO":["565090"]},"45806":{"abstract":"This award is made under the high performance connections portion of ANIR's \"Connections to the Internet\" announcement, NSF 98-102. It provides partial support for two years for an OC-3 connection. Applications involve the development of a fiber-optic sensor system called the \"Artificial Nose Project\", a high energy physics application, Project MONARC; and locating anomalies in large data sets and verification with simulation models. Other projects include a humanities digital library, the Perseus Project follow-on, microscale reflectance spectrometry of biological thin-film structures and multisensor electrochemical analysis on Mars. Collaborating institutions include: CERN, California Institute of Technology, Columbia University, West Virginia University, University of Arizona, University of Kentucky, Duke University; UC - Irvine, Northwestern University, Penn State University, Johns Hopkins University, NASA, IBM Watson Research Center in New York, Stanford University, and SUNY - Albany.","title":"High Performance Network Connection in Support of Meritorious Research at Tufts University","awardID":"9976429","effectiveDate":"1999-07-15","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[116437],"PO":["182196"]},"34509":{"abstract":"The investigators perform a systematic study of issues related to the tradeoffs between dimension and rate in vector quantization. They investigate the compression gains achievable by simultaneous quantization of a block of data over scalar quantization. Theoretical limits on the savings, rates of convergence, and algorithms achieving them are sought for worst-case as well as average-case performance criteria. Special consideration is given to \"combinatorial\" distortion measures that attain only two values: zero or infinity. These measures allow only certain types of errors and are important in applications where some mistakes cannot be tolerated. These measures are simpler to analyze, yet display many of the complexities of general measures.","title":"Vector Quantization: Theoretical Limits and Practical Constructions","awardID":"9815018","effectiveDate":"1999-07-01","expirationDate":"2002-06-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4096","name":"COMMUNICATIONS RESEARCH"}}],"PIcoPI":["486456"],"PO":["188393"]},"44905":{"abstract":"This project aims to develop the theory, algorithms, and software for solving systems of equations made of composed functions efficiently, by utilizing their composition structure. The project will investigate methods for various symbolic and numeric operations such as multivariate subresultants, Groebner bases, characteristic sets, and Newton iterations that are fundamental to solving systems of equations. Composed functions arise very naturally and frequently in most moderate- to large-scale engineering computations. It is expected that the results of this research will have a broad impact on system solving in science and industry.","title":"Computing with Composed Functions","awardID":"9972527","effectiveDate":"1999-07-15","expirationDate":"2001-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["550491"],"PO":["179846"]}}