{"161680":{"abstract":"Over the years, Machine Learning has become a very broad discipline with important applications to many areas including computer vision, speech recognition, robotics, and bio-surveillance, to name just a few. Moreover, many of these application areas have faced a huge increase in the volume of available data of various kinds. In order to be able to use all this data a number of new learning approaches have been proposed. These approaches have been intensely explored in the machine learning community, with many heuristics and specific algorithms, as well as experimental results reported. Unfortunately, however, the standard theoretical models do not capture the key issues involved in these learning techniques, and it has become clear that for developing robust, versatile, and general algorithms in these settings a more fundamental understanding is necessary. This project will develop theoretical foundations for such learning paradigms which are of significant practical importance but are not explained by existing theoretical models. This project will also develop fundamental new connections between Machine Learning, Game Theory, and Combinatorial Optimization, that will aid in advancing and solving important problems in all three areas.<br\/><br\/>The key research directions of this project are:<br\/><br\/>1. Developing mathematical foundations and algorithms for important machine learning paradigms that are not captured well by standard models. This includes new analysis frameworks as well as new practical and theoretically justified algorithms both for semi-supervised learning and active learning, two important emerging approaches for incorporating unlabeled data and interaction in the learning process. This project will also explore a fundamentally new approach to analyzing clustering -- a classic central task in the analysis and exploration of data, for which the existing theory has been very brittle. This framework will enable practitioners to describe in a formal way the properties they believe to be true about their data, and then use these properties to choose or design the right algorithm for their needs.<br\/><br\/>2. Developing novel fundamental connections between Machine Learning and Algorithmic Game Theory in order to solve difficult problems in multi-agent systems that have resisted previous approaches. In particular, many multi-agent interactions have bad equilibria, and it is important to develop methods for helping agents in such bad states to move to better ones. This project will develop techniques for understanding and influencing the behavior of natural dynamics in games of this type, by using connections to important concepts in Machine Learning, such as learning from untrusted experts' advice.<br\/><br\/>3. Developing fundamental connections between Machine Learning and Combinatorial Optimization in order to advance both areas. These include new connections between approximation algorithms and learning-based objectives for clustering, and new algorithms and computational theory for learning submodular functions. Submodular functions, which describe laws of diminishing returns, are ubiquitous in economic optimization problems, and methods for learning them from observed data can aid in designing improved decision procedures.<br\/><br\/>Altogether, this project will advance Machine Learning, Algorithmic Game Theory, and Combinatorial Optimization, by developing and exploiting novel connections between these areas. The theory developed by this work will enable the next generation of powerful algorithms for machine learning and multi-agent systems. It will additionally impact a wide range of application areas including computer vision, robotics, bio-surveillance, and online auction design. More broadly, the research results of this project will have impact across a number of scientific, medical, and industrial fields. The PI's education plan further contributes to the project's impact. In addition to advising a diverse set of students on projects directly related to this project, the progress in this research will be used to influence the curriculum via special courses presenting the theoretical advances along with their applications. The PI will also contribute to increasing the participation of women in computational sciences.","title":"CAREER: Machine Learning Theory with Connections to Algorithmic Game Theory and Combinatorial Optimization","awardID":"0953192","effectiveDate":"2009-12-01","expirationDate":"2014-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7796","name":"ALGORITHMIC FOUNDATIONS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7926","name":"ALGORITHMS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7932","name":"COMPUT GAME THEORY & ECON"}}],"PIcoPI":["565091"],"PO":["565251"]},"160515":{"abstract":"ABSTRACT<br\/><br\/>Principal Investigator: Seress, Akos <br\/>Proposal Number: DMS - 0946649<br\/>Institution: Ohio State University Research Foundation <br\/>Title: Supplemental Funding for a Conference on: Combinatorics, groups, algorithms, and complexity<br\/><br\/>A conference on ``Combinatorics, groups, algorithms, and complexity'' will be held on March 21-24, 2010, at The Ohio State University. The objective of the conference is to provide a forum to explore the manifold interactions between the branches of mathematics and computer science named in the title. Ever since the inception of the polynomial-time paradigm in the late 1960s, theoretical computer science has been a major consumer of concepts and techniques developed in combinatorics, and, conversely, the conceptual frameworks developed in algorithms and complexity theory have transformed much of combinatorics. As the relatively young areas of combinatorics and complexity theory have matured in the past decades, algebraic methods have become increasingly relevant to each. Group theory has played an important role both as a source of techniques and as a subject of rigorous algorithmic study, with the subarea of asymptotic group theory leading the way in the interaction.<br\/><br\/>The subareas to be covered include but are not limited to arithmetic combinatorics, asymptotic group theory, automorphism groups of combinatorial structures, vertex-transitive graphs, expanders, combinatorial models of computation (circuits, decision trees, communication complexity, etc.), probabilistically checkable proofs and approximation algorithms, derandomization, algebraic graph theory, abelian sandpiles, algorithmic problems in combinatorics and algebra, mathematical problems motivated by problems in algorithms and complexity theory. This interdisciplinary conference will focus on the crossfertilization between the areas of combinatorics, group theory, algorithms, and complexity theory, the first two being areas of mathematics and the last two - areas of theoretical computer science. Each of these areas has significantly contributed to the development of the others over the past decades. It is expected that the conference will increase our understanding of the deeper mathematical issues that underlie the connections between these areas, with implications to each of the areas concerned. A particular occasion for this meeting will be the 60th birthday of Laszlo Babai whose work has been influential in developing connections between these fields.","title":"Supplemental Funding for a Conference on: Combinatorics, groups, algorithms, and complexity; March 2010; Columbus, OH","awardID":"0946649","effectiveDate":"2009-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1264","name":"ALGEBRA,NUMBER THEORY,AND COM"}},{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7927","name":"COMPLEXITY & CRYPTOGRAPHY"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7795","name":"TRUSTWORTHY COMPUTING"}}],"PIcoPI":["451149","531145"],"PO":["565280"]},"160698":{"abstract":"This proposal seeks travel support funding for the 42nd International Symposium on Microarchitecture (MICRO-42), a top-tier conference on microprocessor related research, to allow 34 awards (at least $300 per student). <br\/><br\/>The requested funds are to be solely used to provide travel support for graduates students to defray the costs of attending and participating in MICRO-42. The priority will be given to those students who will present their research at MICRO-42 or its joint workshops. To broaden the participation, the PI plans to strongly encourage women and members of other under-represented groups to apply for the travel grant.","title":"Travel Support for the 42nd International Symposium on Microarchitecture","awardID":"0947952","effectiveDate":"2009-12-01","expirationDate":"2010-05-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7941","name":"COMPUTER ARCHITECTURE"}}],"PIcoPI":["495323"],"PO":["565272"]},"163552":{"abstract":"This proposal seeks travel support for the 2010 IEEE International Symposium on Performance Analysis of Systems and Software to be held on March 28-30, 2010<br\/>in White Plains, NY. <br\/>The ISPAS'10 student travel scholarships will be used to target students that are typically underrepresented at computer science conferences. <br\/>The PIs are requesting funds to cover expenses of up to 20 US-based students and junior faculty with no NSF travel support.","title":"Travel Support for the 2010 IEEE International Symposium on Performance Analysis of Systems and Software","awardID":"0963160","effectiveDate":"2009-12-01","expirationDate":"2010-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"7942","name":"HIGH-PERFORMANCE COMPUTING"}}],"PIcoPI":["518229"],"PO":["565272"]},"148969":{"abstract":"This project builds a unique metro-scale, vehicular wireless testbed, called MadBed, with capabilities for wide-area wireless connectivity, with specially designed nodes mounted on Madison area city buses. The testbed is also being leveraged to provide Internet services to the passengers of these city buses. Further the testbed is also providing various vehicular communication services<br\/>to the bus network, e.g., tracking of city buses, and some specialized law enforcement capabilities. The infrastructure is enabling a large number of specialized wireless and mobile networking research projects in the UW-Madison campus. A few examples include exploration of new wireless network management techniques for wide-area wireless networks, exploration in design of new cooperative MAC protocols, exploration in wide-area spectrum sensing and their utilization, and in vehicular delay tolerant networking.<br\/><br\/>As part of its educational component, MadBed is allowing a greater hands-on experience to students in the classroom on design and performance of wide-area wireless environments. In its outreach component, the PIs of MadBed are<br\/>partnering with a local governmental organization called Educational Communications Board of Wisconsin to to provide city-wide broadcasts of certain educational content. The PIs are also organizing annual visit days for certain<br\/>local area high schoolers, and exposing them to some interesting aspects of careers in computing, through various aspects of MadBed. Finally, MadBed has also built great synergies with a number of local, national, and international<br\/>industrial partners, e.g., Cisco, Sprint, MadCity Broadband.","title":"II-EN: A Metro-Scale Vehicular Wireless Testbed with Spectrum Awareness and Spectrum Agility","awardID":"0855201","effectiveDate":"2009-12-15","expirationDate":"2013-08-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"1714","name":"SPECIAL PROJECTS - CISE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7359","name":"COMPUTING RES INFRASTRUCTURE"}}],"PIcoPI":["553458","560207"],"PO":["557315"]},"166783":{"abstract":"It is now an opportune time to assess the current state of modeling in biomedical, biological and behavioral research. In 2003, a small trans-agency working group resulted in the formation of the Inter-agency Modeling and Analysis Group (IMAG) and the first inter-agency solicitation for<br\/>multiscale modeling of biomedical, biological and behavioral systems. That solicitation funded 24 projects, creating the Multiscale Modeling Consortium (MSM). The IMAG MSM Consortium is now in its fourth year and the awards made through the original MSM solicitation are expiring. Since then many other initiatives have emerged from the eight IMAG government agencies that<br\/>have a focus on multiscale modeling (e.g., NIH, NSF, DOE). As the original MSM projects expire and new MSM projects are introduced to the MSM Consortium, IMAG has determined that this year, in lieu of the annual MSM grantee meeting, IMAG will hold an IMAG Futures Meeting featuring twenty invited broad thinkers in biology representing different biology disciplines(see attached Agenda) to brainstorm ideas concerning the future of biomedical, biological and behavioral modeling, including an assessment of current progress, both successes and failures. Specifically, the meeting will provide an opportunity for IMAG to assess to what extent computational modeling has succeeded or failed to make a difference in the broader research endeavor, and to discuss these issues in the context of current challenges and opportunities for biomedical, biological and behavioral modeling.<br\/><br\/>The twenty invited scientists representing diverse areas of biology, and representatives from NIH, NSF, and DOE, will discuss the impact of computing on biology and biomedicine to identify failures and successes and direct future work through a report generated from the meeting.","title":"Workshop Proposal: IMAG Futures Meeting","awardID":"1008193","effectiveDate":"2009-12-15","expirationDate":"2011-11-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"7726","name":"DATANET"}}],"PIcoPI":[446672],"PO":["496127"]},"162114":{"abstract":"The challenges of achieving a sustainable future for humanity are among the most crucial facing society today. To understand the complex and dynamic interconnections among human and environmental systems, and to mobilize that knowledge to inform effective management and policy making, will require increasingly powerful quantitative tools, building upon but expanding dramatically the approaches available for modeling, prediction and analysis of climate systems, ecosystems and socio-economic systems. To address these challenges, the organizers will hold a workshop in Winter 2009 to bring together scientists and practitioners from across a broad spectrum of disciplines, to identify crucial open research questions whose solution would advance the field by quantum levels. Our hope is that the products of this workshop will help guide priorities for funding of research on sustainability.","title":"Towards a Science of Sustainability: Conference to be held Fall 2009 at Warrenton, VA","awardID":"0955699","effectiveDate":"2009-12-01","expirationDate":"2013-11-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1260","name":"INFRASTRUCTURE PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"1640","name":"INFORMATION TECHNOLOGY RESEARC"}},{"dir":{"id":"06","name":"Directorate for DIRECTORATE FOR GEOSCIENCES             ","abbr":"GEO"},"div":{"id":"0600","name":"Division of A\/D FUND","abbr":"A\/D"},"pgm":{"id":"7699","name":"ICER"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"7643","name":"ENVIRONMENTAL SUSTAINABILITY"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"1127","name":"EVOLUTIONARY PROCESSES CLUSTER"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0801","name":"Division of ENVIRONMENTAL BIOLOGY","abbr":"DEB"},"pgm":{"id":"5209","name":"ENVIR SOCIAL & BEHAVIOR SCIENC"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0804","name":"Division of EMERGING FRONTIERS","abbr":"EF"},"pgm":{"id":"1371","name":"POLITICAL SCIENCE"}}],"PIcoPI":["515276"],"PO":["564152"]}}