{"5995":{"abstract":"The goal of this project is to help scientists and engineers carry out computational tasks more effectively by doing research on: - The integration of symbolic and numeric computation to facilitate problem specification, exploration and result verification. - Hierarchies of reusable computational abstractions organized in libraries with well-defined navigational structures. - Exploiting commercial standards and tools for object-request brokers, compound documents, and collaboration infrastructure. The project takes a novel approach to problem-solving environments (PSEs). Its focus is on the entire process of problem-solving from initial conception, symbolic specification, solution, visualization, comparison with experimental data, and feed back. The project focuses on problem-solving environments, not merely programming environments. This focus leads to research on reusable abstractions at all levels of problem-solving. Important abstractions include the problem-solving method itself, method-specific abstractions for sequential and parallel program design, reasoning and debugging, performance analysis and tuning, and frameworks for class libraries. PSEs are more useful when they are more specific. However, rather than build one problem- solving environment for one class of user, application domain, programming language and machine, this project aims at the basic research that will enable us to develop tools for building specific PSEs. To use a metaphor, rather than doing research on workbenches we want to do research on machine tools that can be used to build workbenches. Traditional PSEs deal with extending a workstation environment whereas this project is concerned with developing structured environments for problem-solving. Scientists and engineers collaborate when they solve problems, and they share much more than code. PSEs based on collaboration also provide object-request brokering and compound multimedia document interfaces. Since this vision is both novel and ambitious, a critical aspect of the project is leveraging methods and tools developed for scientific, commercial and home-computing applications.","title":"MDC: Integration of Symbolic Computing with Framework of Classes and Problem-Solving Archetypes","awardID":"9527130","effectiveDate":"1995-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}}],"PIcoPI":["208799","470889","138667","499268","285304"],"PO":["187585"]},"4885":{"abstract":"9521756 Cobb The Southern College of Optometry requests support from NSF for a connection to the Internet through the SURAnet regional network. SURAnet is the regional network located in the state of Tennessee that will provide operations and network information services. It will provide the Southern College of Optometry with a connection to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The college needs the Internet connection to be able to access information resources throughout the state, the nation nd the world. The connection will benefit the students, faculty and staff of the Southern College of Optometry.","title":"NSFnet Connections","awardID":"9521756","effectiveDate":"1995-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":["395448",11919],"PO":["43608"]},"2652":{"abstract":"This is an inter-institutional collaborative research project involving University of Illinois at Chicago (UIC) and Wright State University (WSU). Pictorial systems which retrieve pictures based on contents have wide applications. For example, learning can be facilitated by retrieving pictures from electronic encyclopedia; radiologists can be assi sted in diagnosis; satellite images of desired contents can be retrieved by earth scientists to perform research; appropriate garments can be viewed by customers before deciding where they go shopping, etc. The purpose of the project is to construct a generic picture retrieval and analysis system which can be easily adapted to various applications , including the construction of digital libraries and their use in retrieval of information. Similarity based retrieval involving spatial relationships, and fuzzy and precise matching is used one of the approaches investigated. Other techniques that play a significant role are: multi-dimensional searching; parametrized similarity functions; visual query tools; image analysis techniques such as segmentation; object recognition; and color and shape analysis. The retrieval subsystem is developed at UIC, while the image analysis subsystem is developed at WSU. The two subsystems will be combined to form an integrated system. The usefulness of the system will be demonstrated for the following ap plications: retrieval of photographs for the photo-shop at UIC, and retrieval of images for diagnosis of skin cancer at Rush-Presbyterian Medical Center in Chicago.","title":"A Picture Retrieval System Based on Contents","awardID":"9509253","effectiveDate":"1995-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["389044"],"PO":["563751"]},"6712":{"abstract":"; R o o t E n t r y F V: e C o m p O b j b W o r d D o c u m e n t O b j e c t P o o l %9 e %9 e % & ' ( ) * + , - . \/ 0 1 2 3 F Microsoft Word 6.0 Document MSWordDoc Word.Document.6 ; h j D u r ;V r w ;F r Õ EU F HHu - tZ- t v h F u v h v $ = u v G 9F t v G v v h ;F u}Ph v j j v h $ v h F t5 v h j $ v h v j j The spread of information systems, and, in particular, information infrastructure throughout the economy and social fabric raises questions about the ease of use by all kinds of people, especially those with limited technical acumen or know-how and those with various disabilities. Therefore, an interdisciplinary group (computer scientists and other relevant disciplines) will evaluate and suggest fruitful directions for progress in user interfaces. A two-day workshop will produce a summary report with analysis derived from deliberations by the steering committee. A workshop would serve to bring together individuals from different disciplines, perspectives\/schools of thought, and activities (research, product development, and so on) to identify and begin to narrow down the capabilities of desirable ordinary citizen interfaces (OCIs). It could determine the state-of-the-art of research in CS and other disciplines, identify the questions most important to investigate next, identify what is known from research on the longer-term problems that will aid in the near-term human-computer communications de sign, and identify important long-term research issues. Further, there is a need to promote university-industry collaboration to provide reality-checks on the utility of research and to create theoretical bases for development, enhancing the application of research. Oh +' 0 $ H l D h R:\\WWUSER\\TEMPLATE\\NORMAL.DOT S u m m a r y I n f o r m a t i o n ( $ The spread of information systems, and, in particular, information infrastructure throughout the economy and social fabric raises questions about the ease of use by all kinds of people, especially those with limited technical acumen or know-how and those Michele R Johnson Michele R Johnson @ e \" e @ @ e \" e @ Microsoft Word 6.0 1 ; e = e j j j j j j j j j I 1 + z T 5 I j I j j j j ~ j j j j 7 The spread of information systems, and, in particular, information infrastructure throughout the economy and social fabric raises questions about the ease of use by all kinds of people, especially those with limited technical acumen or know-how and those with various disabilities. Therefore, an interdisciplinary group (computer scientists and other relevant disciplines) will evaluate and suggest fruitful directions for progress in user interfaces. A two-day workshop will produce a summary report with analysis derived from deliberations by the steering committee. A workshop would serve to bring together individuals from different disciplines, perspectives\/schools of thought, and activities (research, product development, and so on) to identify and begin to narrow down the capabilities of desirable ordinary citizen interfaces (OCIs). It could determine the state-of-the-art of research in CS and other disciplines, identify the questions most important to investigate next, identify what is known from research on the longer-term problems that will aid in the near-term h","title":"Workshop: Toward an Ordinary Citizen Interface to the National Information Infrastructure","awardID":"9529473","effectiveDate":"1995-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}}],"PIcoPI":["234699"],"PO":["183208"]},"5999":{"abstract":"9527169 Keyes This project will develop public use software to implement two important paradigms for domain decomposition: medium-grained data decomposition and course-grained task decomposition. In addition, it will enhance the theory of task decomposition with respect to two specific applications involving multiple physics, aerodynamics and physics. It will attempt to verify the theory behind the two paradigms, and the develop software which combines the strength of both. Effective multi-domain parallel solutions to multi-model coupled field problems will have widespread usefulness, particularly in light of the growing emphasis on multidisciplinary analysis and optimization. The current pioneers of multidisciplinary optimization are finding it necessary to revisit the lower levels of the constituent modeling hierarchies. It is not practical to simultaneously upgrade all of the low-level models employed inside of optimization loops to the complex models used in the state-of -the-art of the individual disciplines, for reasons of complexity and severe ill-conditioning. This creates an obvious niche for the deliverables of this proposal - highly performant solvers with built-in support for multi-model analysis.","title":"MDC: A Numerical Laboratory for Multi-Model Multi-Domain Computational Methods in Aerodynamics and Acoustics","awardID":"9527169","effectiveDate":"1995-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1519","name":"INTEGRATIVE SYSTEMS"}}],"PIcoPI":["369299"],"PO":["395818"]},"8969":{"abstract":"Carroll 95-54206 We propose to create and evaluate an infrastructure for constructing and conducting experiments in a virtual laboratory. Our architecture will integrate existing and future Internet technology to support collaborative, highly interactive educational settings. Our prototype testbed will address physical science middle and high school students. The project represents a rational melding of existing technologies in new ways that we believe will do as much for active learning as the advent of World-Wide Web browsers such as Mosaic has done for passive browsing of information. Key elements of our proposal are: a participatory design approach involving teachers and students as design team members (in contrast to externally-imposed educational technology solutions). support for reuse of a wide variety of educational software available on the Internet (in contrast to requiring and assuming custom-designed educational applications). asynchronous extensions to interactive, collaborative environments (in contrast to the current dichotomy between non-interactive e-mail collaborations and strictly real-time interactions via MUDs and MOOs). multimedia extensions to interactive, collaborative environments (in contrast to teletype-style interactions currently supported by MUDs and MOOs). collaborative system support for heterogeneous platforms ranging from PCs to high-end workstations (in contrast to the assumption of homogenous computing environments). continuous on-site teacher support to help in selection and composition of project-oriented curriculum elements, community involvement in experimental projects, and evaluation of technology change, attitudes, and outcomes. This project seeks to leverage the technological and cultural opportunities of the Blacksburg Electronic Village (BEV), a densely interconnected community in rural Southwestern Virginia. It exploits the availability of Tl network connections to the four participating public schools. It builds upon an ongoing NIE Planning Grant, our ongoing work on participatory design of educational network applications, our ongoing work with computer aided education systems and software, and working relationships with Apple Computer, a company with years of commercial experience in supporting K-12 education. This project will develop the technical infrastructure necessary for solutions to educational issues and concepns of national significance: mitigating logistic obstacles to peer-based learning in rural settings. facilitating broad community involvement in public school activities. empowering teachers through their use of instructional technology. promoting more active roles for students in using World-Wide Web technology. increasing access to peer collaboration and laboratory experiences for students. enhancing participation in school activities for all students.","title":"Leveraging Networks for Collaborative Education in the Blacksburg Electronic Village","awardID":"9554206","effectiveDate":"1995-10-01","expirationDate":"1999-12-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7256","name":"RSCH IN EDUCATION, POLICY, PRA"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7263","name":"NETWORKING INFRASTRUCT-EDUCAT"}}],"PIcoPI":["536668","549541","549540","224876"],"PO":["565121"]},"1720":{"abstract":"9505721 Buller This proposal seeks to provide a direct Internet connection between Native American communities including Community Colleges that as of yet no network connectivity. Training for the classroom use of the Internet will provided and will be done in conjunction with the AISES Teacher Enhancement Project. This will provide over 100 educators of American Indian students with their first look at network use and networked information. Thus the major goal of facilitating access to the Internet for as many Native American as possible will be provided.","title":"American Indian Internet Access and Training Project","awardID":"9505721","effectiveDate":"1995-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}},{"dir":{"id":"11","name":"Directorate for DIRECT FOR EDUCATION AND HUMAN RESOURCES","abbr":"EHR"},"div":{"id":"1109","name":"Division of RESEARCH ON LEARNING","abbr":"DRL"},"pgm":{"id":"7263","name":"NETWORKING INFRASTRUCT-EDUCAT"}}],"PIcoPI":["22605"],"PO":["57343"]},"29183":{"abstract":"","title":"Intelligent Tools for Conceptual Design and Simulation of Opto-Electro-Mechanical Devices","awardID":"9796046","effectiveDate":"1995-10-01","expirationDate":"2002-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["193837"],"PO":["564456"]},"1328":{"abstract":"9504426 Ewen This project connects Colorado Christian University to the Internet over a T1 (1.544 thousand bit per second) line. Faculty and students will benefit from access to the resources of the Internet, including libraries and supercomputers. In addition, they will be able to communicate and collaborate with colleagues at other institutions in pursuit of research and educational projects. The award provides partial support of the project for two years.","title":"Connections to NSFNET","awardID":"9504426","effectiveDate":"1995-10-01","expirationDate":"1998-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[3061,3062,3063],"PO":["121202"]},"1728":{"abstract":"The aim of this project is to obtain new results which will help reduce the time and computational effort required when using the computer simulation models for optimization found in many discrete-event systems. The focus is on the enhancement of the Score Function and Likelihood Ratio methods to provide accurate estimates for derivative and perturbation, respectively. The goals are improvements of the existing variance reduction techniques, theoretical unification, some extensions, and advancements in the practical implementation of these `single run` methods. The project will develop procedures and algorithms, investigate their accuracy versus execution time behavior, and present numerical results for a wide variety of queuing, inventory, and reliability models.","title":"Optimization of Discrete Event Simulation Models: Single-Run-Based Approaches","awardID":"9505731","effectiveDate":"1995-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"2865","name":"NUMERIC, SYMBOLIC & GEO COMPUT"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}}],"PIcoPI":[4015],"PO":["187585"]},"19007":{"abstract":"","title":"SGER: Reformulation of System Theories in Robotics","awardID":"9696060","effectiveDate":"1995-10-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}}],"PIcoPI":["171293"],"PO":["475621"]},"5252":{"abstract":"9523244 Jackson Sojourner-Douglass College requests support from NSF for connection to the Digital Express Group Network (DIGEX). DIGEX, a midlevel network in the in the Baltimore area, will provide operations management and information services and it will give the campus access to the Internet, a collection of interoperable networks that connect most research and education organizations in the United States. The campus needs the Internet connections to be able to access information resources throughout the state, the nation and the world. The connection will benefit the faculty, staff students of the Sojourner-Douglass College as well as the community in general.","title":"Connection to NSFNET","awardID":"9523244","effectiveDate":"1995-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0505","name":"Division of COMPUTER AND NETWORK SYSTEMS","abbr":"CNS"},"pgm":{"id":"4091","name":"NETWORK INFRASTRUCTURE"}}],"PIcoPI":[12848,12849],"PO":["57343"]},"7111":{"abstract":"This is planning and preparation funding for the Third International Workshop on Multistrategy Learning, which seeks to further explore the implications of the multistrategy approach to machine learning. This workshop will provide a forum for a group of researchers to present and discuss the progress and most recent results in the area of multistrategy learning and its practical applications, and hopefully, to serve as an aid in planning further research in the area.","title":"Proposal to Organize Third International Workshop on Multistrategy Learning (MSL '96); May 23-25, 1996; Harpers Ferry, WV","awardID":"9530871","effectiveDate":"1995-10-01","expirationDate":"1997-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6845","name":"HUMAN COMPUTER INTER PROGRAM"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6856","name":"ARTIFICIAL INTELL & COGNIT SCI"}}],"PIcoPI":["355581"],"PO":["54008"]},"6001":{"abstract":"9527181 Wagner The establishment of a Center for High Performance Computing in Structural Biology will tackle computationally intensive problems that have been difficult or impossible using conventional laboratory computational resources, but that will be solvable in the HPCC environment. The emphasis is on the reduction, analysis, and interpretation of experimental data in structural biology. The primary goal will be the implementation, validation, application and dissemination of parallel protocols for the computational tasks, focusing on problems in macromoleculap NMR spectroscopy and X-ray crystallography, including advanced signal processing, molecular modeling, and ligand design. The Center will have a high impact on basic science in structural biology, and on the development and application of new hardware and software technologies to problems that are manifestly important. The broad aims of the Center are to extend the reach of structural biology to greater sensitivity and higher resolution, to larger and more complex structures and phenomena, and to reduce the time required for structure investigations. %%% The Center's structural biology focus provides a set of problems that embody a rich diversity of mathematical and algorithmic expression, creating a fertile testbed for the development of HPC algorithms and software. The emphasis on experimental aspects of structural biology, in particular, will bring HPC to bear on new problems that are not being pursued by groups developing applications of HPC to theory and simulation in structural biology. The architecture of the planned computational facility will provide a versatile and cost-effective computational environment for this effort. ***","title":"Opportunities in Support of Multidisciplinary Research: A Center for High Performance Computing and Communication for Structural Biology","awardID":"9527181","effectiveDate":"1995-10-01","expirationDate":"2000-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"1144","name":"Biomolecular Dynam,Struc,Func"}},{"dir":{"id":"08","name":"Directorate for DIRECT FOR BIOLOGICAL SCIENCES          ","abbr":"BIO"},"div":{"id":"0807","name":"Division of MOLECULAR AND CELLULAR BIOSCIE","abbr":"MCB"},"pgm":{"id":"9199","name":"UNDISTRIBUTED PANEL\/IPA FUNDS"}}],"PIcoPI":["529638"],"PO":["564395"]},"6563":{"abstract":"This is an inter-institutional collaborative research project involving University of Illinois at Chicago (UIC) and Wright State University (WSU). Pictorial systems which retrieve pictures based on contents have wide applications. For example, learning can be facilitated by retrieving pictures from electronic encyclopedia; radiologists can be assisted in diagnosis; satellite images of desired contents can be retrieved by earth scientists to perform research; appropriate garments can be viewed by customers before deciding where they go shopping, etc. The purpose of the project is to construct a generic picture retrieval and analysis system which can be easily adapted to various applications, including the construction of digital libraries and their use in retrieval of information. Similarity based retrieval involving spatial relationships, and fuzzy and precise matching is used one of the approaches investigated. Other techniques that play a significant role are: multi-dimensional searching; parametrized similarity functions; visual query tools; image analysis techniques such as segmentation; object recognition; and color and shape analysis. The retrieval subsystem is developed at UIC, while the image analysis subsystem is developed at WSU. The two subsystems will be combined to form an integrated system. The usefulness of the system will be demonstrated for the following applications: retrieval of photographs for the photo-shop at UIC, and retrieval of images for diagnosis of skin cancer at Rush-Presbyterian Medical Center in Chicago.","title":"A Picture Retrieval System Based on Contents","awardID":"9529045","effectiveDate":"1995-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2885","name":"CISE RESEARCH INFRASTRUCTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6840","name":"ROBOTICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"6855","name":"INFORMATION & KNOWLEDGE MANAGE"}}],"PIcoPI":["104104"],"PO":["563751"]},"5993":{"abstract":"9527123 Joseph This project will develop highly efficient methods for computing the three-dimensional motion of large number of particles in solid-liquid flows, under the action of the hydrodynamic forces and torques exerted by the suspending fluid, and use these methods to elucidate the fundamental dynamics of particulate flows and solve problems of engineering interest. The goal is to develop high-performance, state-of -the-art software packages called particle movers, capable of simulating the motion of thousands of particles in 2-D and hundreds in 3-D domains, in both Newtonian fluids, governed by the Navier-Strokes equations, and in several popular models of viscoelastic fluids. Such simulations will be extremely computationally intensive. It is therefor imperative to develop the most efficient possible computational schemes, and to implement them on parallel machines, using state-of-the-art parallel algorithms. The project will develop two different computational schemes for simulating solid-liquid flows on parallel computers. The first is a generalization of the standard Galerkin finite element method in which both the fluid and particle equations of motion are incorporated into a single variational equation, containing both fluid and particle velocities as primitive unknowns. In the second approach, an embedding method, the fluid flow is computed as if the space occupied by the particles were filled with fluid. The no-slip boundary condition of the particle boundaries is enforced as a constraint using Lagrange multipliers. This allows a fixed grid to be used, eliminating the need for remeshing, a definite advantage in parallel implementations. The new schemes will be used to study the microstructural (pair interaction) effects which produce clusters and anisotropic structures in particulate flows, to produce statistical analyses of particulate flows (mean values, fluctuation levels and spectral properties), to derive engineering correlations of the kind usually obtained from expe riments, and to provide clues and closure data for the development of two-phase flow models and a standard against which to judge the performance of such models. They will also be used to solve practical problems of industrial interest such as sedimentation, fluidization an slurry transport of solid particles in Newtonian and viscoelastic fluids.","title":"MDC: Direct Simulation of the Motion of Particles in Flowing Liquids","awardID":"9527123","effectiveDate":"1995-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4080","name":"ADVANCED COMP RESEARCH PROGRAM"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0701","name":"Division of ELECTRICAL, COMMUN & CYBER SYS","abbr":"ECCS"},"pgm":{"id":"1518","name":"CONTROL, NETWORKS, & COMP INTE"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0705","name":"Division of ENGINEERING EDUCATION AND CENT","abbr":"EEC"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0709","name":"Division of BIOENGINEERING & ENVIRON SYSTE","abbr":"BES"},"pgm":{"id":"1443","name":"FLUID DYNAMICS"}}],"PIcoPI":["404761"],"PO":["395818"]},"8545":{"abstract":"This Presidential Faculty Fellow award is made in recognition of significant achievements of this principal investigator as a researcher and teacher, with potential for future contributions to this country's scientific and engineering enterprise. The research supported by this award is in the general area of image synthesis in computer graphics. In particular, the following topics will be investigated: (1) Real-time walkthroughs of complex environments (2) Controlled-precision photorealistic image synthesis, in which reliable error metrics are used to improve both speed and accuracy and (3) Computer-generated pen-and-ink illustrations.","title":"Presidential Faculty Fellowships","awardID":"9553199","effectiveDate":"1995-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0501","name":"Division of COMPUTER & COMMUNICATION FOUND","abbr":"CCF"},"pgm":{"id":"4715","name":"COMPUTER SYSTEMS ARCHITECTURE"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}}],"PIcoPI":["223138"],"PO":["187585"]},"6147":{"abstract":"This research deals with the development of a new scalable volume visualization architecture and its associated algorithms. The architecture, called Cube-4, exploits parallelism and pipelining to achieve real-time rendering of high-resolution images from volume data. The architecture is based on an algorithm for ray casting of a volume buffer of voxels which is stored as a skewed distributed memory to support conflict-free access to voxel structures. It performs interpolation of sampled points, shading, and compositing to generate the pixel values. Computations are done using limited communication between processors, so that the architecture is scalable over a wide range of performances and image resolutions. This project encompasses algorithm development, architecture research, and construction of a reduced-resolution prototype.","title":"Scalable Architecture for Real Time Volume Rendering","awardID":"9527694","effectiveDate":"1995-10-01","expirationDate":"1999-09-30","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"4725","name":"EXPERIMENTAL SYSTEMS\/CADRE"}}],"PIcoPI":["541908"],"PO":["549626"]},"5994":{"abstract":"; R o o t E n t r y F Tz C| C o m p O b j b W o r d D o c u m e n t ^ O b j e c t P o o l Tz C| Tz C| 4 @ = > ? @ A B C D E F G F Microsoft Word 6.0 Document MSWordDoc Word.Document.6 ; DMS-9527124 Trotter Advanced Scientific Computing Centers This award covers a broad research program in the area of computational optimization. The central thrust of the research addresses real-life, large-scale mixed-inter programming problems arising from important industrial application areas, such as manufacturing, telecommunications, and distribution. These problems are of vast importance towards the nation s present and future economic and technological development. The problems are also extremely intractable, both from the viewpoint of practical computation, as well as in terms of theoretical understanding, and they will only become larger and more difficult in future applications. The computational and methodological technology for solving integer programming models has made steady advances over the last thirty years, often following improvements in computing machinery as much as new theoretical insights. We are now at the starting point of a major quantum improvement in the technology. Not only are there several new and promising methodological venues available, but we are witnessin g a revolution in the computing world, in particular involving parallel computing and operating systems, with profound implications for science and engineering. It is almost certain that within a few years all computers will have multiple CPUs, and that all major scientific and engineering computing will be done on clusters of multiple-CPU machines. As supercomputing becomes redefined, a push to parallelize algorithms is starting now, and the end result will be software of extraordinary complexity by today s standards. However, it is fair to say that the field of parallel integer programming is, at best, in its infancy. The research seeks to propel computational integer programming into the realm of parallel computing, with the objective of effectively handling difficult real-world problems. The objective will require a multidisciplinary approach. Our work will seek to extend and develop solution methodologies for integer programming, in particular involving cutting planes, column generation, and branch-and-cut techniques. This will be integrated with computational theory techniques, especially the design of efficient data structures for parallel integer programming. Finally, there will be a large component of software engineering, necessary for the implementation of efficient parallel programs. This work combines the scientific and computational resources of three participating organizations, Columbia University, Cornell University, and the IBM T.J. Watson Research Center, to create a collaborative research environment to attain the goals outlined above. Among the many important advantages of such a close relationship between university computing research groups and that of a major hardware producer is the focus on practical ends provided by the industrial component. Oh +' 0 $ H l D h R:\\WWUSER\\TEMPLATE\\NORMAL.DOT S u m m a r y I n f o r m a t i o n ( < DMS-9527124 Jocelyn J. Whitehurst Jocelyn J. Whitehurst @ \" C| @ @ \" C| @ F # Microsoft Word 6.0 1 ; e = e r ^ r l l l l l l l 1 r T I l l l l l l l l l 9 DMS-9527124 Trotter Advanced Scientific Computing Centers T","title":"MDC: Computational Optimization research Center","awardID":"9527124","effectiveDate":"1995-10-01","expirationDate":"2001-09-30","fundingAgent":[{"dir":{"id":"03","name":"Directorate for DIRECT FOR MATHEMATICAL & PHYSICAL SCIEN","abbr":"MPS"},"div":{"id":"0304","name":"Division of MATHEMATICAL SCIENCES","abbr":"DMS"},"pgm":{"id":"1271","name":"COMPUTATIONAL MATHEMATICS"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0502","name":"Division of INFORMATION & INTELLIGENT SYST","abbr":"IIS"},"pgm":{"id":"2860","name":"THEORY OF COMPUTING"}},{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0503","name":"Division of SHARED CYBERINFRASTRUCTURE","abbr":"SCI"},"pgm":{"id":"4066","name":"PART FOR ADVANCED COMP INFRA"}}],"PIcoPI":["78948"],"PO":["562372"]},"3585":{"abstract":"ABSTRACT CTS-9512517 Caltech has established the Center for Quantitive Visualization (CQV) which serves as a focus organization and coordinates imaging developments and applications. The personnel participating in the Center, who will be involved in this project, represent an interdisciplinary team with expertise in many areas of imaging, high-speed data-acquisition and storage, and imaging-processing. The development and acquisition of advanced imaging instrumentation falls in two broad categories: (1) high-speed image acquisition systems, and (2) advances in image-processing, storage, and graphics systems. It is intended to extend the presently-available, state- of-the-art in this field, resulting in new, nationally and internationally unique capabilities. An attempt is made to balance the greater risks of development versus acquisition by the much more capable technology that would result. This endeavor is shared by industrial and governmental partners, such as the Jet Propulsion Laboratory, EPIX, Inc., General Pixels, Inc., Boeing Co. and Baxter Healthcare, Inc. The activities of the CQV and the proposed infrastructure project form an integral part of the educational and research environment at Caltech, with broad and intense participation by students, faculty, visitors, and staff. Furthermore, this center will serve equally as a bridge between university and industry by providing the means for transfer of technology and science, between academia and industry, and by preparing students for the industrial work environment. ***","title":"Development and Acquisition of High Speed\/Resolution Imaging Systems","awardID":"9512517","effectiveDate":"1995-10-01","expirationDate":"1998-03-31","fundingAgent":[{"dir":{"id":"05","name":"Directorate for DIRECT FOR COMPUTER & INFO SCIE & ENGINR","abbr":"CSE"},"div":{"id":"0506","name":"Division of EXPERIMENTAL & INTEG ACTIVIT","abbr":"EIA"},"pgm":{"id":"2890","name":"CISE RESEARCH RESOURCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"1415","name":"PARTICULATE &MULTIPHASE PROCES"}},{"dir":{"id":"07","name":"Directorate for DIRECTORATE FOR ENGINEERING             ","abbr":"ENG"},"div":{"id":"0702","name":"Division of CHEM, BIOENG, ENV, &  TRANSP S","abbr":"CBET"},"pgm":{"id":"9155","name":"ACADEMIC RESEARCH INFRASTRUCTU"}}],"PIcoPI":["266906","544292","508959"],"PO":["433053"]}}